[

  {
    "title": "Chapter 1000 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine suddenly remembered Logan and had a bad feeling. “You cut off his finger?”"
      },
      {
        "paragraph": "Shaun was speechless. Did she just think of him as a mad demon who chopped people’s fingers off?"
      },
      {
        "paragraph": "When he did not say anything, Catherine became angry. “Shaun Hill, I believe that Liam wasn’t the thief\nwho leaked Hill Corporation’s data. He’s not that kind of person.”"
      },
      {
        "paragraph": "“Believe?” A fire surged in Shaun’s heart."
      },
      {
        "paragraph": "That was a word that both of them did not have for each other, yet she was so concerned about Liam."
      },
      {
        "paragraph": "“Catherine Jones, don’t be naive. You believe in Liam just because he helped you once. He’s Mason\nCampos’ son, and Mason hid his true colors while staying with the Hill family for more than zo years.\nBoth father and son are scheming people. Do you see what has happened to me now? Hill Corporation\nonly became like this because I believed in him.”"
      },
      {
        "paragraph": "“I believe that Liam and Mason are different.” Catherine insisted. Maybe no one would believe Liam, but\nshe truly believed that he was not such an unscrupulous person."
      },
      {
        "paragraph": "In those years she was abroad, Liam had sincerely helped her. Of course, she also knew that it was\nbecause Liam had felt guilty for using her before. However, a person who could feel guilt would not be\nbad in nature."
      },
      {
        "paragraph": "Later, when Liam was forced to acknowledge Suzie as his daughter, he was really good to Suzie. Even\nthough he knew that Suzie was Shaun’s daughter, he still took care of her wholeheartedly."
      },
      {
        "paragraph": "If he coveted Hill Corporation, he could have used Suzie to deal with Shaun."
      },
      {
        "paragraph": "However, he did not."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“You don’t understand anything at all.” Shaun was stung by her words. “I checked the monitoring system.\nThe time Liam entered the lab and the time the data was deleted matched perfectly. Who else could it be\nbut him?”"
      },
      {
        "paragraph": "Catherine was confused by this."
      },
      {
        "paragraph": "Shaun said coldly, “ I didn’t send him to the police station again. I’m already being extremely benevolent\nby simply breaking his leg.”"
      },
      {
        "paragraph": "“What? You broke his leg?” Catherine was shocked."
      },
      {
        "paragraph": "Shaun pursed his thin lips. He had not even used his full strength. If his leg was treated in time, Liam\nwould still be able to walk again. However, he did not want to explain too much to Catherine."
      },
      {
        "paragraph": "“Were you expecting me to just beat him up and let him go back to the Campos family? He’ll inherit\neverything Mason has in the future. Since he dared to harm Hill Corporation, I have to cut off his escape\nplan. Campos Corporation can’t possibly be passed to a cripple.”"
      },
      {
        "paragraph": "Catherine got chills from listening to him, but she was in no mood to scold him now. “Is Liam still in\nLiona?”"
      },
      {
        "paragraph": "“I got him thrown out… ” Shaun had just finished speaking when the call ended."
      },
      {
        "paragraph": "He looked at the phone in annoyance. He really did not understand what made her care about Liam\nmore than she cared about him."
      },
      {
        "paragraph": "After all, he had married her and they even had children once."
      },
      {
        "paragraph": "In a shabby and isolated alley in the capital."
      },
      {
        "paragraph": "A black SUV stopped, and Chance dragged Liam, who was delirious from the pain, out before throwing\nhim to the ground."
      },
      {
        "paragraph": "Chance did not take another look at him and soon drove the car away."
      },
      {
        "paragraph": "Sitting in the passenger seat, Yael glanced at the rear-view mirror to look at Liam. The second young\nmaster of the Hill family looked like a mess with bruises and blood all over his body."
      },
      {
        "paragraph": "“Chance, do you think his leg will be crippled?” Yael asked in a low voice."
      },
      {
        "paragraph": "“There shouldn’t be a problem if he walks slowly. Eldest Young Master Hill held back.” Chance frowned.\nAfter answering, he looked at Yael helplessly. “Why do you always insist on coming along during these\nkinds of bloody incidents?”"
      },
      {
        "paragraph": "“I miss you. You’ve been busy these two days and I haven’t been able to see you.” Yael rubbed her belly.\n“Our baby misses you too.” Chance’s heart softened as he reached over to touch her head. He had\nfinally made up his mind and said, “Next week, I’ll resign and leave Liona.”"
      }
    ]
  },
  {
    "title": "Chapter 1001 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Yael’s eyes lit up. “Really?”"
      },
      {
        "paragraph": "“Yeah. The Hill family has become a thing of the past. It’s impossible for them to regain the glory they\nonce had. Liona is a large organization that needs money to operate, so I’m guessing Eldest Young\nMaster Hill won’t be able to sustain it for long,” Chance said, “Let’s find a place to live in seclusion where\nwe’ll lead ordinary lives.”"
      },
      {
        "paragraph": "“Yes. Thank you, Chance. By the way, stop at the corner in front. I want to go for a stroll.”"
      },
      {
        "paragraph": "“Then I won’t accompany you. I still have to go back to receive orders from Eldest Young Master Hill, ”\nChance said with difficulty."
      },
      {
        "paragraph": "“I know. Go quickly, don’t delay.” Yael threw him a After Chance drove away, she immediately got into a\nblack car on the side. \nShe drove back to the lonely alley at once."
      },
      {
        "paragraph": "Liam had already regained some consciousness. Since there was no one passing by the vicinity, he\ncould only slowly crawl on the ground."
      },
      {
        "paragraph": "After crawling for a long time and almost losing consciousness, a car stopped in front of him. A woman\nstepped out of the car."
      },
      {
        "paragraph": "He remembered that this person was Yael Chadwick, a member of Liona."
      },
      {
        "paragraph": "“Sorry, Second Young Master Hill. I suddenly received a call from Eldest Young Master Hill to take you to\nanother place.”"
      },
      {
        "paragraph": "Yael opened the trunk and threw him in with difficulty."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Liam desperately knocked on the back. Where was Yael bringing him? He had a very bad feeling, but he\ndid not dare to let himself faint."
      },
      {
        "paragraph": "Every time he could hardly hold on, he pinched the wound on his kneecap to stay awake."
      },
      {
        "paragraph": "It was not until an hour later that the car finally came to a halt."
      },
      {
        "paragraph": "Yael opened the trunk and smiled faintly. “I didn’t think you’d still be conscious.”"
      },
      {
        "paragraph": "“What do you want?” Liam looked around and saw that they were on a cliff by the sea. A wave of panic\nsurged up."
      },
      {
        "paragraph": "“Of course… I’m going to throw you off.” Yael dragged him down from the car."
      },
      {
        "paragraph": "Liam strained himself to get up and tried to escape despite having a leg that could barely move."
      },
      {
        "paragraph": "However, Yael immediately kicked him to the ground."
      },
      {
        "paragraph": "If it were in the past, Yael would be no match for him, but he had just been beaten up by Shaun. His\nspleen was injured and one of his legs was crippled. He was just like an ant that could only be\nmanipulated by others now."
      },
      {
        "paragraph": "“Yael, I dare you to touch me. My dad is Mason Campos. Even though he has an illegitimate child, I’m\nstill his son. If I disappear, he’ll look for me.”"
      },
      {
        "paragraph": "Liam yelled at her impulsively. It seemed like his only backing now was Mason."
      },
      {
        "paragraph": "“Sorry, Second Young Master Hill. It was your fault for betraying Hill Corporation. This is Eldest Young\nMaster Hill’s order. At first, he just wanted to cripple one of your legs and forget about it, but his anger\nwas not relieved and he asked me to throw you into the sea to feed the fishes.” Yael yanked one of his\nlegs toward the sea."
      },
      {
        "paragraph": "Liam’s mind went blank. One of his legs was crippled now. He would certainly die if he was thrown into\nthe sea."
      },
      {
        "paragraph": "Shaun Hill! Shaun was too vicious! How could he be so ruthless?"
      },
      {
        "paragraph": "An endless stream of hatred and despair gushed out from his chest, but a moment later, he suddenly felt\nthat there was something wrong."
      },
      {
        "paragraph": "“No, if Shaun wanted to harm me, why would he make a woman do it? Yael Chadwick, you betrayed\nLiona. You betrayed the Hill family, didn’t you?”"
      },
      {
        "paragraph": "Yael turned around and looked at him gloomily."
      },
      {
        "paragraph": "Liam glared at her. “Hill Corporation’s data was stolen by you, right? You’re a member of Liona and you\nwere there when the core members of Liona guarded the lab that day. It was you who set me up. Have\nyou been bought off by Campos Corporation?”"
      }
    ]
  },
  {
    "title": "Chapter 1002 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Second Young Master Hill, sometimes, it’s not good to be too smart.” Yael raised her brows and smiled\ncoldly."
      },
      {
        "paragraph": "Chills ran through Liam’s entire body. He did not expect everyone to be tricked by Yael."
      },
      {
        "paragraph": "Yael had made him miserable, but the most important thing for him now was to survive."
      },
      {
        "paragraph": "He quickly smiled and said, “Yael, in fact, I don’t blame you. You did a good job. You did what I wanted to\ndo but didn’t dare to. You see, we’re all in the same boat. My dad is Mason Campos. You’re working for\nhim, right? Hurry up and let me go. I’ll let my dad use you again in the future.”"
      },
      {
        "paragraph": "Yael looked at him and laughed in a low voice. “ Second Young Master Hill, you’re so naive.”"
      },
      {
        "paragraph": "The smile that Liam had desperately tried to squeeze froze. A thought popped up in his heart, but he did\nnot want to accept it."
      },
      {
        "paragraph": "“What do you mean?”"
      },
      {
        "paragraph": "“Isn’t it clear enough? Since I’m now working for the Campos family, why else would I bring you here if it\nwere not for their orders?” Yael dragged him to the edge of the cliff. “Second Young Master Hill, look\nclosely. Below this is your grave.”"
      },
      {
        "paragraph": "Liam was racking his brain, and he even forgot to be afraid of death at this moment. His eyes were\nbloodshot and filled with unwillingness. “My dad wants me dead? Why? Why? I’m his son.”"
      },
      {
        "paragraph": "“I don’t know either. Maybe it’s because you’re too useless.” Yael smiled at him. “Goodbye, Second\nYoung Master Hill. You can die now.”"
      },
      {
        "paragraph": "Then, she pushed Liam directly into the raging sea below."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "When it was certain that he could not survive after taking the fall, Yael finally drove away."
      },
      {
        "paragraph": "In the city district of Canberra. Catherine did not even go to the company. She, Logan, and Austin looked\nall over for Liam, but after searching for half a day, there was no trace of him. There was no news of him\nin any hospitals either."
      },
      {
        "paragraph": "She could not help but call Shaun. “Shaun Hill, where the hell did you toss Liam to? I can’t find him at all.\nDid you lie to me? Is he still in Liona?”"
      },
      {
        "paragraph": "Shaun frowned. “I told Chance to toss him at a remote and old alley in the north of the city.”"
      },
      {
        "paragraph": "“I’ve already searched for him there but I didn’t find him. He hasn’t been admitted into any hospital\neither.” Catherine shouted angrily, “I think you clearly want him to die! There are very few people passing\nby that area. By tossing him there, you’re just delaying his treatment time.”"
      },
      {
        "paragraph": "“Since I was teaching him a lesson, was I supposed t o kindly send him to the hospital for treatment after\nbeating him up?” Shaun became upset. “ Maybe he was taken away by the Campos family. Mason\nCampos has remarkable power and can even take down the Hill family. What else can the Campos\nfamily not do?”"
      },
      {
        "paragraph": "“No, the Campos family didn’t save Liam.” Catherine became increasingly anxious. “ I asked around.\nMason Campos stayed in the company the whole day without going anywhere. There was no movement\nin the Campos family.”"
      },
      {
        "paragraph": "Shaun’s heart sank at her words."
      },
      {
        "paragraph": "After all, Liam and he were related by blood. He hated Liam, but he never wanted to kill him."
      },
      {
        "paragraph": "“Shaun Hill, have you ever thought that the Hill family has offended a lot of people? You just tossed Liam,\nwho’s covered in injuries and has no ability to defend himself, to a remote place. Aren’t you afraid that"
      },
      {
        "paragraph": "someone would attack him? Besides, maybe some people know that he’s Mason’s son and kidnapped\nhim.”"
      },
      {
        "paragraph": "Catherine finished angrily and hung up the phone. Shaun was stunned."
      },
      {
        "paragraph": "He had not thought too much about it before, but after Catherine said so, it did not seem impossible."
      },
      {
        "paragraph": "He quickly called Chance and got him to come over. “Go and find out where Liam is and whether he\nwent to the Campos family.”"
      },
      {
        "paragraph": "Chance was shocked. “Eldest Young Master Hill, didn’t you just tell me to toss him out this morning?\nWhy are you looking for him again?”"
      },
      {
        "paragraph": "“He might be missing.”"
      }
    ]
  },
  {
    "title": "Chapter 1003 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun gritted his teeth, his handsome face looking so gloomy that it could drip blood."
      },
      {
        "paragraph": "Chance spent a whole day searching, but Liam seemed to have vanished into thin air. No hospitals said\nthat they had taken in such a patient."
      },
      {
        "paragraph": "“Eldest Young Master Hill, I’m sorry. I can’t find Liam. He… It seems he’s really not in the Campos family.\nThey haven’t called any doctors to go over for a consultation.”"
      },
      {
        "paragraph": "Shaun fiercely kicked over the table in front of him. “Were you followed when you tossed him earlier?”"
      },
      {
        "paragraph": "“No. Who would follow us anyway?” Chance smiled bitterly. “There’s no one left who’s still jealous of the\nHill family.”"
      },
      {
        "paragraph": "“What about the nearby surveillance cameras?” Shaun asked through clenched teeth."
      },
      {
        "paragraph": "“That place is an old city area that’s about to be demolished. No one lives there anymore and the\nmonitoring there has long been disabled, ” Chance explained, “I tossed Liam there in order to prevent\nanyone from catching on as it would be unfavorable to you.”"
      },
      {
        "paragraph": "Shaun rubbed his eyebrows. “You tossed Liam there alone, but does anyone else in Liona know that you\ntossed Liam there?”"
      },
      {
        "paragraph": "Chance’s heart jerked. He actually intended to go alone, but Yael suddenly ran up to him and wanted to\nfollow."
      },
      {
        "paragraph": "However, if Eldest Young Master Hill found out that he had brought Yael along during his task, Eldest\nYoung Master Hill would definitely become displeased with Yael. Thus, he said, “ I was alone. ”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Continue to find Liam. Even if… Even if he’s dead, I want to see his corpse, ” Shaun paused and said in\na muffled voice."
      },
      {
        "paragraph": "He had a bad feeling. Liam was Mason’s son. If Liam went missing, Mason might not let him off."
      },
      {
        "paragraph": "The more he thought about it, the more anxious he became. He could not hold back and smashed the\nteacup on the table."
      },
      {
        "paragraph": "There were too many things happening recently. There were a bunch of matters regarding the company\nthat he had not finished dealing with. He had not had the chance to visit the old master in the hospital\neither, but now, Liam was missing."
      },
      {
        "paragraph": "At that moment, a strong sense of fatigue and bewilderment arose in his heart."
      },
      {
        "paragraph": "He did not dare to imagine what would happen to Lea if she found out that Liam was missing."
      },
      {
        "paragraph": "In the Yule family’s villa, Catherine was also distracted."
      },
      {
        "paragraph": "She had not gone to the company at all. She received numerous calls from the directors asking her to\nattend the meeting, but she did not have the time to."
      },
      {
        "paragraph": "Liam was her friend, so she was worried now that h e had gone missing. Besides, Liam was also\npretending to be Suzie’s father."
      },
      {
        "paragraph": "Without Liam acting as a bridge, how could she go see Suzie in the future? The Hill family would not let\nher bring Suzie out at all."
      },
      {
        "paragraph": "“Mommy, eat some vegetables.” Lucas saw her holding her bowl motionlessly and worriedly gave her a\nfork."
      },
      {
        "paragraph": "“Lucas, did you see Suzie in preschool today?” Catherine asked in a low voice."
      },
      {
        "paragraph": "Lucas shook his head. “She took time off this week and didn’t come.”"
      },
      {
        "paragraph": "“I’ll give her a call. ” Catherine really could not eat so she got up and walked to the side to dial Suzie’s\nphone watch."
      },
      {
        "paragraph": "“Mommy… ” Suzie’s voice sounded choked up. “ I miss you so much. I’m so envious of Lucas. Lucas can\nsee you, but I can’t. Uncle can’t be contacted these few days. I want him to take me to see you. ”"
      },
      {
        "paragraph": "Catherine’s heart felt uneasy. She did not dare to tell Suzie that Liam might be in trouble. “Your uncle"
      },
      {
        "paragraph": "… might be busy. Have you been well?”"
      }
    ]
  },
  {
    "title": "Chapter 1004 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“No,” Suzie said, “These days, I’ve been alone at the manor. Great -grandma and the others are at the\nhospital since Great-grandpa can’t walk anymore. I saw Great-grandpa once before. He’s so pitiful.\nUncle Willie too. He’s mentally retarded now and acts like a ditz. He’s even more childish than me Suzie\ncould not help but cry. “Uncle Willie is so pitiful. He used to tease me and loved to pull my ears, but he\nalways bought me whatever I wanted…”"
      },
      {
        "paragraph": "Catherine’s throat hurt."
      },
      {
        "paragraph": "She wanted to hug Suzie when she heard her cry. After all, Suzie was still so small."
      },
      {
        "paragraph": "However, without Liam, she could not see Suzie at all."
      },
      {
        "paragraph": "What should she do with Suzie in the future?"
      },
      {
        "paragraph": "The more she thought about it, the more distressed she was. However, she did not know what to do. She\ncould only keep talking to Suzie until she managed to coax the little girl to fall asleep, but her whole\nperson was slouched and dazed."
      },
      {
        "paragraph": "The next day, she ran out to find Liam before dawn."
      },
      {
        "paragraph": "There was still no news after a day, so she finally had no choice but to go to Hill Corporation to find\nShaun."
      },
      {
        "paragraph": "At first, she thought that after returning to Canberra, she would not meet Shaun ever again even until she\ndied. However, she did not expect that she would one day step into Hill Corporation again."
      },
      {
        "paragraph": "Hill Corporation was no longer as glorious as it was i n the past."
      },
      {
        "paragraph": "There was no one at the front desk. She saw several employees walking out with big boxes in their arms."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "She was wearing a cap, so the employees did not recognize her. Everyone was calmly whispering, “\nCampos Corporation called me and said they were offering me a position with a higher salary for me. I\nthink Campos Corporation has more prospects.”"
      },
      {
        "paragraph": "“Campos Corporation called me too. We should leave soon. I heard that Hill Corporation won’t even be\nable to give us year-end bonuses. What’s the point of skilled workers like us staying here?”"
      },
      {
        "paragraph": "“Stop.” A manager ran out in anger. “Have I agreed to your resignation? Even if you want to leave, you\nhave to finish your work and hand it over before leaving.”"
      },
      {
        "paragraph": "“Come on, Manager Ford. We won’t continue to work anymore. If we leave early, we can still find good\njobs elsewhere. Hill Corporation is done for. We don’t want to delay our time here.”"
      },
      {
        "paragraph": "Manager Ford scolded, “You ungrateful things! If Hill Corporation hadn’t spent money to send you abroad\nfor further training, would you be where you are today?”"
      },
      {
        "paragraph": "“Manager Ford, you should jump ship early too. Hah, it’s too late now. Be careful. Maybe, by the time you\nlook for another job, we’d be your managers instead.”"
      },
      {
        "paragraph": "The employees left one after another."
      },
      {
        "paragraph": "Catherine was stunned. It seemed like Hill Corporation’s situation was more severe than she imagined."
      },
      {
        "paragraph": "When she took the elevator to the president’s floor, the secretarial office was not as crowded as before.\nThere was not even a single security guard."
      },
      {
        "paragraph": "She walked to the door of the president’s office when she suddenly heard the arrogant voice of a middle-\naged man from inside."
      },
      {
        "paragraph": "“ Shaun Hill, if I were you, I’d agree to my request. Why are you doing this? It’s a fact that Hill\nCorporation is done for. I won’t tell you to compensate me for the liquidated damages."
      },
      {
        "paragraph": "Instead, give me Hill Corporation and I’ll compensate you another ten million dollars. I’m already being\nbenevolent.”"
      },
      {
        "paragraph": "“You want to buy Hill Corporation with just ten million dollars? You must be dreaming. ” Hadley’s furious\nvoice sounded. “Hill Corporation includes various subsidiary companies such as insurance, finance, and\nelectronics. Aren’t you being too greedy if you aren’t even willing to fork out that much money?”"
      },
      {
        "paragraph": "“Shut up! Who do you think you are? A mere assistant like you dares to talk back to me? Are you worthy\nto speak to me? Do you think you’re still the assistant of the high and mighty Shaun Hill from the past?”\nPresident Hale scolded meaningfully, seemingly rebuking Hadley but in truth, he was actually targeting\nShaun."
      },
      {
        "paragraph": "Shaun’s handsome face was cold and heavy. “Get lost.”"
      }
    ]
  },
  {
    "title": "Chapter 1005 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“You want me to get lost?” President Hale sneered. “Shaun Hill, I think you’re still dreaming. Hill\nCorporation is a thing of the past now. Your Hill family isn’t even as good as a small company under my\nHale Corporation. In the past, you were high above me and didn’t care about me, but now, I can find\nsomeone to get you killed anytime.”"
      },
      {
        "paragraph": "“Sure, you can try.” Shaun suddenly stood up."
      },
      {
        "paragraph": "His tall body and aura after staying in a high position for a long time instantly overwhelmed the short and\nstout President Hale."
      },
      {
        "paragraph": "“Fine, since you won’t do it until you’re forced to, I’ll make you regret this. Just wait.”"
      },
      {
        "paragraph": "President Hale kicked over the chair in front of him and strode out."
      },
      {
        "paragraph": "When he reached the door, Catherine had her head down, so he did not look too closely."
      },
      {
        "paragraph": "Catherine looked at his back. She had seen this man before. He was Gary Hale from the Hale family.\nThe Hale family was barely in the top 2o families in the capital."
      },
      {
        "paragraph": "However, even he could run over to Hill Corporation so arrogantly now. It was clear that Hill Corporation\nwas not what it used to be."
      },
      {
        "paragraph": "In the office, Hadley said angrily, “President Hill, Gary Hale is too shameless! He didn’t even dare to\nspeak up in front of you before and always used Joanne to cozy up to Sarah to try and please you—”"
      },
      {
        "paragraph": "“Shut up.” Shaun glared at him warningly and looked behind him nervously. “Why are you here?”"
      },
      {
        "paragraph": "Hadley turned around and saw Catherine walking in."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "She had taken off her hat, revealing her soft and long thick hair. Her beautiful face was small and pure,\nbut her facial features were delicate. Her nose was straight and upright, while her eyes were tinged with\na layer of melancholy."
      },
      {
        "paragraph": "“Miss… Miss Jones…” Hadley was startled."
      },
      {
        "paragraph": "“Go out,” Shaun ordered him."
      },
      {
        "paragraph": "Hadley walked out in a complicated mood and closed the door behind him."
      },
      {
        "paragraph": "In the office, the two people looked at each other."
      },
      {
        "paragraph": "Catherine looked at Shaun. In fact, the two of them had only separated for a few days, but it was like a\nlong time had passed. Shaun’s appearance had changed too."
      },
      {
        "paragraph": "That morning, he was still well-dressed, handsome, and charming. Now, his suit was all wrinkled and his\neyes were bloodshot. There were dark circles under his eyes and he had a scruffy beard. It was clear\nthat he had not rested after coming back from the island."
      },
      {
        "paragraph": "“Cathy, you—”"
      },
      {
        "paragraph": "Shaun cautiously opened his mouth, but Catherine interrupted him, “I came here to ask you about Liam’s\nwhereabouts.”"
      },
      {
        "paragraph": "An unnatural glint flashed in Shaun’s dark eyes. “ Cathy, why are you so… concerned about Liam?”"
      },
      {
        "paragraph": "“I think of Liam as a good friend.” Catherine lowered his eyes, afraid that he would be suspicious. “Also…\nHe’s Suzie’s father. Suzie is already pitiful for losing her mother. If she doesn’t"
      },
      {
        "paragraph": "have a father too, I’m afraid she won’ t be able to take it.”"
      },
      {
        "paragraph": "Shaun was suddenly startled. He had been so busy and tired these days that he had not thought about\nSuzie."
      },
      {
        "paragraph": "“You forgot about Suzie, didn’t you?” Catherine was a little annoyed at his reaction."
      },
      {
        "paragraph": "“I… There have been too many things going on lately.” There was a complicated look on Shaun’s face.\n“Suzie is in the manor. There’s a nanny taking care of her.”"
      },
      {
        "paragraph": "“Have you forgotten that you were also taken care of by a nanny when you were young? How did that\nnanny treat you?” Catherine’s expression was unpleasant. “Why don’t you… let Suzie stay with me for a\nfew days? I’m quite worried about her. She called me in tears last night saying that she’s very lonely and\ncouldn’t contact her daddy. She kept crying.”"
      },
      {
        "paragraph": "Shaun’s heart throbbed in pain and he suddenly became even more upset. He hated Liam, but he had to\nthink about Suzie as well."
      },
      {
        "paragraph": "“ .. Fine. I’ll come pick her up in a few days when I’m not so busy, but you can’t take her to Wesley.\nOtherwise, I won’t agree.”"
      }
    ]
  },
  {
    "title": "Chapter 1006 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine had originally promised to move in with Wesley."
      },
      {
        "paragraph": "However, after hearing Shaun’s words, she immediately hesitated."
      },
      {
        "paragraph": "“Are you planning to take my niece and live with Wesley? Dream on.” Shaun saw her expression and\nbecame irritable."
      },
      {
        "paragraph": "Catherine sighed helplessly. “Fine.”"
      },
      {
        "paragraph": "Shaun did not feel relieved because of this. After all, Catherine’s expression betrayed too much of her\nemotions."
      },
      {
        "paragraph": "“You still want to be with Wesley?” Shaun was somewhat incredulous. “You’ve slept with me for so long,\nyet you still refuse to divorce Wesley. Or is it because he’s unwilling?”"
      },
      {
        "paragraph": "Catherine’s face burned from his savage tone. This man really did not know what shame was."
      },
      {
        "paragraph": "“ Shaun Hill, it’s none of your damn business who I’m with. You could be arrogant in the past and we\ncouldn’t do anything about it, but Hill Corporation isn’t even comparable to Hudson Corporation now.\nYour net value is also incomparable to mine. Do you think you’re worthy of me? Do you think you’d catch\nmy eye?”\nShe spoke coldly. In the past, he had always looked down on her and thought she was trying to climb up\nthe social ladder using the Hill family. However, the tables had turned now, so she taunted him\nmercilessly."
      },
      {
        "paragraph": "Sure enough, an embarrassed look immediately washed over Shaun’s handsome face."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "He could not care less about President Holt’s contempt and did not care about other people’s cynicism,\nbut Catherine’s words were like a slap to his face."
      },
      {
        "paragraph": "Men had their pride, but his current status was even worse than Catherine’s and worse than his rival’s."
      },
      {
        "paragraph": "His heart burst with bitterness. He never thought that such a day would come."
      },
      {
        "paragraph": "“Also, get this straight, ” Catherine reminded him coldly, “Although you were released on bail by Chester\nand the others, the case of you kidnapping me hasn’t been closed yet. The police station keeps calling\nfor me to give my statement. I can personally tell the police that you kidnapped me and abused me."
      },
      {
        "paragraph": "“ Shaun Hill, if I do that, will you still be able to sit here and talk to me? You’ll have to go to prison for a\nfew years at least. When you come out, the difference between us will be like the clouds and dirt.\nRemember, you’re dirt, and I’m the clouds. ”"
      },
      {
        "paragraph": "“You want to send me to prison yourself?” Shaun’s body shook, his face full of pain."
      },
      {
        "paragraph": "“Since you dared to do it, why are you afraid? I’ ll give you one more chance. I want Liam to appear in\nfront of me in three days. Otherwise, don’t blame me for being ungracious.”"
      },
      {
        "paragraph": "Catherine turned around and left."
      },
      {
        "paragraph": "Shaun suddenly grabbed her wrist from behind and forcefully pushed her against the wall with dark and\nheavy eyes."
      },
      {
        "paragraph": "“Cathy, Liam is important to you, Wesley is important to you, and even Suzie is important to you. But\nwhat about me? Do I really have no place in your heart at all? Am I not special in your heart?”"
      },
      {
        "paragraph": "His dark voice revealed a rare hint of sadness."
      },
      {
        "paragraph": "Perhaps it was because too many things had happened recently, so this strong man was unexpectedly\nrevealing a hint of vulnerability."
      },
      {
        "paragraph": "Catherine was lost in thought for a moment but quickly shoved him away."
      },
      {
        "paragraph": "“There used to be a place for you in my heart, but there’s nothing left after you did that to Logan."
      },
      {
        "paragraph": "Remember what I said. I’m serious.”"
      },
      {
        "paragraph": "She turned and left withoutlooking back."
      },
      {
        "paragraph": "Shaun did not chase after her. He leaned against the wall and looked up at the ceiling. For some reason,\nhis eyes stung."
      },
      {
        "paragraph": "He was so tired. At that moment, he really wanted her to stay with him."
      },
      {
        "paragraph": "As long as she was around, he would try to pull himself together even if he had nothing left."
      },
      {
        "paragraph": "However, without her, he seemed to have lost all his motivation."
      }
    ]
  },
  {
    "title": "Chapter 1007 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Of course, Shaun knew that the current him was no longer worthy of Catherine."
      },
      {
        "paragraph": "Catherine walked out of the elevator. On the side, Hadley stepped out from another elevator and quickly\ncaught up to her."
      },
      {
        "paragraph": "“Ms. Jones, I need to talk to you.”"
      },
      {
        "paragraph": "Catherine stopped. “What do you want to say, Hadley?”"
      },
      {
        "paragraph": "Hadley said awkwardly, “Actually, I heard a little about what Eldest Young Master Hill and you talked\nabout in the office earlier. I want to ask you not to sue him.”"
      },
      {
        "paragraph": "Catherine frowned. If it were someone else, she would not hesitate to refuse, but she owed Hadley."
      },
      {
        "paragraph": "“Hadley, he’s a devil. I just wanted to start another life with Wesley, but he ruined it. He even made a big\nfuss and ruined my reputation. Do you know how many people out there are laughing at Wesley and\nme? I’m not just doing it for myself. I have to give Wesley an explanation too.”"
      },
      {
        "paragraph": "“But if you really sue the Eldest Young Master Hill now and he goes to jail for even as short as two years,\nwithout him sitting in Hill Corporation, it’ll be swallowed up by others until nothing is left."
      },
      {
        "paragraph": "“Willie has been beaten silly, while Liam betrayed u s and went missing. Lea lives every day like she has\nlost her soul. Valerie and Spencer are incompetent."
      },
      {
        "paragraph": "“The old madam is too old and suffering from all kinds of ailments due to the stimulation recently, so we\ndon’t know how long she’ll last. Of course, they’re people who have nothing to do with you, but you have\nto think about Suzie…”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Hadley reminded her helplessly, “You and I both know that although Liam is Suzie’s pretend father, she’s\nactually Eldest Young Master Hill’s daughter. It’s impossible to send Suzie to the Campos family. I f the\nHill family falls, what will happen to Suzie? She will really become a child without a father or a mother!"
      },
      {
        "paragraph": "“Although Eldest Young Master Hill thinks that Suzie is his niece, he really does treat her well."
      },
      {
        "paragraph": "Perhaps because he’s actually her father. Suzie also cares deeply about him as well.”"
      },
      {
        "paragraph": "Catherine fell silent."
      },
      {
        "paragraph": "She indeed had not thought so much before."
      },
      {
        "paragraph": "What Hadley said made sense."
      },
      {
        "paragraph": "However, if she did not sue Shaun, how would she explain it to Wesley?"
      },
      {
        "paragraph": "“Miss Jones, that’s all I can say.” Hadley did not say anything else and turned to go upstairs."
      },
      {
        "paragraph": "Not long after Catherine returned to Hudson, Suzie was brought over by the Hill family’s driver."
      },
      {
        "paragraph": "It had been more than a month since she saw the little girl. Catherine brought her out to buy some pretty\nclothes and even bought her a big cake"
      },
      {
        "paragraph": "before bringing her back to the Yule family’s villa to eat with Lucas."
      },
      {
        "paragraph": "She had a lively personality, which was different from Lucas, and made Joel extra happy."
      },
      {
        "paragraph": "“Cathy, Suzie is really delightful. Why don’t you leave her here and let the two little ones accompany me?\nI feel much younger already.” It had been a long time since Joel was so happy."
      },
      {
        "paragraph": "Suzie thought about it and shook her head seriously. “Grandpa, I can’t. I have to accompany Great -\ngrandma. She’s so pitiful. In the past, she had Great-grandpa to accompany her, but she’s all alone now.”"
      },
      {
        "paragraph": "“ Suzie, you’re such a filial child.” Joel praised her but sighed and turned to Catherine. “I heard that the\nHill family is planning to sell the manor.”"
      },
      {
        "paragraph": "Catherine was stunned. “Is the Hill family really that desperate?”"
      },
      {
        "paragraph": "Joel knocked on the desk. “Hill Corporation has too many subsidiaries which need a lot of money to run.\nActually, the microchip was a gamble taken on by Shaun. If he won, he would become among the richest\nmen in the world, but if he lost, it would be like falling to the ground from heaven. Business is all about\nrisks and opportunities coexisting.”"
      },
      {
        "paragraph": "Catherine was silent before saying, “I heard that Holt Corporation wants to buy Hill Corporation.”"
      },
      {
        "paragraph": "“Yeah, Holt Corporation is running wild now. You probably don’t know this but the daughter of Holt\nCorporation, Joanne Holt, is having an affair with Mason Campos. They even have an illegitimate child\ntogether.”"
      }
    ]
  },
  {
    "title": "Chapter 1008 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Joel said, “The Holt family is planning to buy Hill Corporation for a song while the Campos family is\nsecretly inciting the matter. Now, all the wealthy families in Canberra are just waiting to watch the drama\nunfold.”"
      },
      {
        "paragraph": "As Catherine listened to Joel, she was increasingly disgusted by those wealthy families in Canberra."
      },
      {
        "paragraph": "“Alas, poor Suzie. I shouldn’t have let her return to the Hill family.” Joel sighed. “Anyway, don’t overthink\nit. Have a great life with Wesley in the future. Don’t let him down again.”"
      },
      {
        "paragraph": "“Mm.” Catherine lowered her head."
      },
      {
        "paragraph": "When it was time for dinner, Wesley drove over."
      },
      {
        "paragraph": "The minute Wesley saw Suzie, he held her up happily. “Suzie, why don’t you come to my house with\nyour mommy tomorrow?”"
      },
      {
        "paragraph": "“Oh, okay…” Suzie answered by stretching out her voice, neither happy nor sad. She just felt that\nWesley’s house was not her home. “Mommy, are you going to move to Uncle Wesley’s place?”"
      },
      {
        "paragraph": "“Suzie, go and have dinner with Lucas first.”"
      },
      {
        "paragraph": "When Catherine sent Suzie away, Wesley gazed at her with a gentle look. “What’s wrong?”"
      },
      {
        "paragraph": "“Wesley, I might… have to move over only after some time.” Faced with a dilemma, Catherine explained,\n“I could bring Suzie here today only because I promised Shaun not to bring her over to yours to stay. I’m\nsorry, but I can’t leave Suzie alone. A lot of things have been going on in the Hill family recently, and\nshe’s been lonely because nobody keeps her company.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“ I thought it was a serious issue.” Wesley touched her head with a smile. “Although you can’t move to\nmy place, I can move here. It’s still the same, and you can move to my place once Suzie returns to the\nHill family.”"
      },
      {
        "paragraph": "Catherine froze and could not quite catch what he said."
      },
      {
        "paragraph": "“Don’t you welcome me?” Wesley raised his brows all of a sudden."
      },
      {
        "paragraph": "“…No, no.” Catherine was rather confused. “But I have two children sleeping with me at night. The bed\nmight not be able to fit…”"
      },
      {
        "paragraph": "“It’s fine. I can sleep in the guest room.” Wesley did not make things difficult for her. Catherine nodded."
      },
      {
        "paragraph": "“However… You can’t just accompany your kids all the time and ignore me.” Wesley extended his hands\nand wrapped them around her. With an affectionate tone, he added, “Cathy, I’m also a normal man.”"
      },
      {
        "paragraph": "“…Alright.”"
      },
      {
        "paragraph": "Catherine’s face flushed as she felt awkward."
      },
      {
        "paragraph": "Particularly when Wesley hugged her, she could smell a faint masculine scent from his body, which\nsomehow reminded her of Shaun’s scent."
      },
      {
        "paragraph": "In fact, she was not averse to Wesley’s hugs before she got married."
      },
      {
        "paragraph": "However, she had been with Shaun every day of this month. Moreover, since Shaun enjoyed kissing her\ni n particular, she had slowly gotten used to his scent."
      },
      {
        "paragraph": "As this thought struck her, she suddenly shuddered. She could not behave like this anymore."
      },
      {
        "paragraph": "“By the way, when are you going to the police station, Cathy?” Wesley asked abruptly. “The case of\nShaun kidnapping you isn’t over yet.”"
      },
      {
        "paragraph": "Catherine’s head began to hurt. Only then did she experience how difficult it was to remarry while having\ntwo children."
      },
      {
        "paragraph": "“Wesley, I… I don’t plan to sue him. Suzie’s birth certificate is with the Hill family. If Shaun goes to jail,\nSuzie will have no one to depend on. I don’t think you know that Liam has gone missing…”"
      },
      {
        "paragraph": "This time, Wesley’s elegant and handsome face froze in spite of himself."
      },
      {
        "paragraph": "“Cathy, have you thought about how the public will see us if you don’t file a lawsuit against Shaun?"
      },
      {
        "paragraph": "They will criticize you for being indecent even though you’re married. They might even think that you\nhaven’t gotten over Shaun. As for me, it clearly shows that I’ve been cuckolded. Can’t you just…\nconsider things from my end?”"
      },
      {
        "paragraph": "Given that Catherine rarely saw Wesley getting so indignant, she was at her wits’ end. “But I need to\nthink about it from Suzie’s end too.”"
      },
      {
        "paragraph": "“But I don’t think you’ve even gotten over Shaun. ” A miserable look washed over Wesley’s face. “ Cathy,\nwhen you went missing for the whole of last month, what worried me most was not whether you slept\nwith Shaun but whether you fell for him again. No matter how much I’ve done for you, I’m always the\nlowest on your list of priorities. ”"
      }
    ]
  },
  {
    "title": "Chapter 1009 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Wesley took two steps backward and gave a bitter laugh before he turned on his heel and left."
      },
      {
        "paragraph": "Lucas and Suzie ran to Catherine. “Mommy, why did Uncle Wesley leave? Did both of you quarrel?”"
      },
      {
        "paragraph": "“Go and have your dinner.” Catherine bent over and replied gently."
      },
      {
        "paragraph": "There was a great sense of fatigue in the depths of her eyes."
      },
      {
        "paragraph": "In the next two days, Shaun asked all Liona members to search for Liam. However, it seemed as if he\nhad vanished into thin air."
      },
      {
        "paragraph": "“Eldest Young Master, we’ve checked the records at the train stations, airports, and highways, but Liam\ndidn’t leave from any of these places. Even the foreign hospitals don’t have Liam’s clinical record, ”\nChance reported his findings with a frown."
      },
      {
        "paragraph": "“At present, there are only two possibilities. The first possibility is that Liam has been locked up."
      },
      {
        "paragraph": "Another one is that… He’s dead.”"
      },
      {
        "paragraph": "Sitting on the leather chair, Shaun felt as if a bucket of cold water was poured over his tall figure."
      },
      {
        "paragraph": "“Dead?”"
      },
      {
        "paragraph": "How could it be? How could someone as hard to defeat as Liam be dead?"
      },
      {
        "paragraph": "His hands trembled as he took out a cigarette from the cigarette pack."
      },
      {
        "paragraph": "“Chance, you’re the last person who saw Liam. Try your best to recall carefully. When you left, was there\nanyone else around?” Shaun suddenly roared."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Chance quaked. The only thing he knew was that Yael was in the car too. Nevertheless, Yael had no\nreason to harm Liam since they did not have a grudge against each other."
      },
      {
        "paragraph": "“No, Eldest Young Master.”"
      },
      {
        "paragraph": "As soon as Chance finished speaking, Lea rushed into the office."
      },
      {
        "paragraph": "“Shaun, Mason just called and told me that he couldn’t reach Liam. He found out that you took Liam to\nLiona. Did you imprison Liam there?”"
      },
      {
        "paragraph": "Shaun froze. What worried him most had happened eventually."
      },
      {
        "paragraph": "“Mom, I punched Liam three days ago, but I sent him away right after that.”"
      },
      {
        "paragraph": "Lea was dazed. “If he had betrayed Hill Corporation, the punch would’ve served him right. But it’s\nstrange that we can’t reach him.”"
      },
      {
        "paragraph": "Shaun pursed his thin lips grimly and was silent for some time."
      },
      {
        "paragraph": "Looking at Shaun, Lea got increasingly anxious, so she shifted her eyes to Chance."
      },
      {
        "paragraph": "Chance kept his head down and said, “We abandoned him in a remote alley in the north of the city, but\nwe couldn’t trace him after that. Eldest Young Master has been searching for him in the past few days,\nyet Liam is nowhere to be found…”"
      },
      {
        "paragraph": "Lea took two ghastly steps backward. After all, Liam was her son with whom she was pregnant for ten\nmonths."
      },
      {
        "paragraph": "“If he’s still alive, why can’t anyone trace him? Shaun, are you lying simply because you want to kill\nLiam?”"
      },
      {
        "paragraph": "“I’m not…”"
      },
      {
        "paragraph": "Those words sent shivers down Shaun’s spine. However, Lea acted as if she did not hear what Shaun\nsaid as she dashed to him and slapped him straight away."
      },
      {
        "paragraph": "“I can understand that you hate Liam. I won’t stop you from punching him however you want, but you\ncan’t kill him. After all, he’s your younger brother.”"
      },
      {
        "paragraph": "Amid her speech, Lea broke into tears."
      },
      {
        "paragraph": "“Liam is still young. He went astray because I didn’t get him a good dad and educate him properly. Why\ndid you have to kill him?”"
      },
      {
        "paragraph": "“Madam, Eldest Young Master really didn’t kill Second Young Master,” Chance explained."
      }
    ]
  },
  {
    "title": "Chapter 1010 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Even if you didn’t do this, Liam’s disappearance surely has to do with you.” Lea was consumed with\nregret."
      },
      {
        "paragraph": "These days, she had been so muddleheaded and overwhelmed by Mason’s cheating and betrayal that\nshe had neglected her two sons."
      },
      {
        "paragraph": "By the time she came to her senses, Liam had gone missing."
      },
      {
        "paragraph": "“Shaun Hill, if you don’t bring Liam back, I’ll never acknowledge you as my son.” Once Lea finished her\nsentence in hysterics, she suddenly felt faint. 3"
      },
      {
        "paragraph": "“Madam.” Chance swiftly held her."
      },
      {
        "paragraph": "Shaun leaped to his feet and carried Lea. Then, he raced her to the hospital."
      },
      {
        "paragraph": "After conducting different types of blood tests, the doctor said, “Madam Hill hasn’t slept for a few days or\nso. Her fatigue and blood insufficiency have also contributed to her feeling faint. She needs to take care\nof her health by relaxing and worrying less.”"
      },
      {
        "paragraph": "A bitter look washed over Shaun’s face. By the look of things, how could Lea possible relax?"
      },
      {
        "paragraph": "Shortly after the doctor left the ward, a few police officers walked in."
      },
      {
        "paragraph": "“Mr. Hill, Mason Campos has reported to the police that you have kidnapped his youngest son."
      },
      {
        "paragraph": "Liam Hill’s whereabouts are still not known. Please follow us to the police station for investigation.”"
      },
      {
        "paragraph": "Shaun’s eyes darkened. He was worried that Mason would attack him using Liam’s incident, but little did\nhe expect that it would happen so soon."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Okey. Let me have a word with my mom, and I’ll go with you guys immediately.”"
      },
      {
        "paragraph": "Shaun turned arround and walked to the bed. Lea’s condition had improved slightly after she received an\nIV infusion. However, she still looked pale."
      },
      {
        "paragraph": "“Mom, I know you hate me, but you should know that Liam is Mason’s son. Now that Mason is riding\nhigh, what I’d do at most is to take it out on Liam. I wouldn’t go as far as killing him. As you can see now,\nthe campos family has called the police.”"
      },
      {
        "paragraph": "“….”"
      },
      {
        "paragraph": "Lea looked bewildered and astonished."
      },
      {
        "paragraph": "Shaun did not have enough time to explain further to her. “Many companies out there, especially Holt”"
      },
      {
        "paragraph": "Corporation that has Campos Corporation’s backing, are planning to swallow Hill Corporation whole.\nAfter I’m taken to the police station, Holt Corporation will surely get other corporations together to destroy\nHill Corporation. You’d better sell off those insurance companies, hotels, and electronics companies\nunder Hill Corporation that have been making losses for years."
      },
      {
        "paragraph": "“Get rid of the Hill family’s manor as soon as possible too. Invest solely in the financial industry o f Hill\nCorporation. Only then will we be able to maintain Hill Corporation’s business.”"
      },
      {
        "paragraph": "“Sell off?” Lea was still lost in thought."
      },
      {
        "paragraph": "“Mom, I think you were a superwoman in the business industry twenty years ago. Don’t let Mason look\ndown on you. What’s more, Hill Corporation wouldn’t have come to this point if it weren’t for you."
      },
      {
        "paragraph": "“Now is the time for you to make it up to the Hills. You won’t want to see Grandpa and Grandma\nhomeless at their age, right?”"
      },
      {
        "paragraph": "Once Shaun finished speaking, he turned around and left with the police."
      },
      {
        "paragraph": "Lea was startled. When she thought it through, she realized that she had hardly concerned herself with\nthe company’s matters considering Shaun’s power for the past few years."
      },
      {
        "paragraph": "No wonder Mason looked down on her. Even she looked down on herself."
      },
      {
        "paragraph": "After ten minutes of silence, it finally hit Lea that now was not the time for her to feel sad for herself even\nthough being abandoned by Mason made her upset and miserable."
      },
      {
        "paragraph": "“Hadley, come over here.” “Madam…” Hadley’s eyes glinted."
      },
      {
        "paragraph": "“Hurry up and sell off the companies under Hill Corporation. Let’s see how much working capital we can\nobtain from there.” Lea’s pretty face immediately exuded a strong sense of authority."
      },
      {
        "paragraph": "Hadley was relieved. Luckily, the realization came home to Lea soon enough, or the Hill family would be\ndestroyed."
      },
      {
        "paragraph": "An hour later, news of Shaun’s arrest had spread across the whole of Australia."
      }
    ]
  },
  {
    "title": "Chapter 1011 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "[Are my eyes deceiving me? Eldest Young Master Hill has been arrested for kidnapping Second Young\nMaster Hill, but didn’t he kidnap Catherine too? He really enjoys kidnapping people, huh?]"
      },
      {
        "paragraph": "[He is completely lawless. He even kidnapped his own brother. Quickly lock him up.]"
      },
      {
        "paragraph": "[I heard Shaun has a bad temper, and he used to take it out on Liam for no reason.]"
      },
      {
        "paragraph": "[What happened this time seems much more serious than that. Rumor has it that Liam has gone missing\nfor days. The witness in the hotel said that the last time he saw Liam was when Shaun took Liam away.\nLuckily, Liam’s dad, Mason Campos, has reported it to the police.]"
      },
      {
        "paragraph": "[Now that the Campos family is the most influential family in Australia, they can send Shaun to jail."
      },
      {
        "paragraph": "Don’t ever let him out.]"
      },
      {
        "paragraph": "The issue had caused a heated discussion among the netizens. Even Catherine learned about the\nmatter through the internet."
      },
      {
        "paragraph": "As her assistant, Harvey also informed her about what he heard. “I heard Hill Corporation is planning to\nsell off their subsidiary companies, such as insurance and electronics companies.”"
      },
      {
        "paragraph": "“With Hill Corporation’s poor cash flow, it’s a wise decision to sell them off.” Catherine could not help but\nask, “Who decided on this?”"
      },
      {
        "paragraph": "“Lea is now in charge of Hill Corporation. There’s no one else in the Hill family.” Harvey handed an\ninvitation card to Catherine. “By the way, a grand auction will be held in Canberra the night after\ntomorrow. The main item that will be up for auction this time is the Hill family’s manor.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine was dumbfounded for a while. Then, she could not help but sigh. “In the end, the Hill family i s\nbeing left high and dry.”"
      },
      {
        "paragraph": "“Exactly, ” Harvey said. “Lea was the one who decided to auction it. The Hill family’s manor is the largest\nmanor in Australia. Rumor has it that it costs more than 1o billion dollars as it’s situated in the mountains.\nHaving said that, I heard the Campos family has secretly asked those wealthy families in Australia to\nforce the price down.”"
      },
      {
        "paragraph": "Catherine frowned. “The Campos family is really…” Considering the improper means the Campos often\nused, she wondered how they came to gain the position they had today."
      },
      {
        "paragraph": "“Yeah. Anyway, all the wealthy families are following the Campos family’s lead now.” Harvey said, “Do\nyou want to go and take a look? All the reputable figures in Canberra will be attending.”"
      },
      {
        "paragraph": "Catherine rubbed her forehead. “What’s the point of going? I can’t afford the manor either. Just throw the\ncard away.”"
      },
      {
        "paragraph": "In the detention center."
      },
      {
        "paragraph": "The security guard tossed the food and water at the door. After darting a glance, Shaun lost his appetite\nat the cold food, so he just picked up the cup of water to drink."
      },
      {
        "paragraph": "Less than half an hour after he finished the water, he was suddenly drained of energy."
      },
      {
        "paragraph": "The bunch of criminals around him then exchanged glances upon finishing their food, and they walked to\nShaun with sinister smiles."
      },
      {
        "paragraph": "“Who instructed you guys?” Shaun was so sharp that he came to his senses in an instant. Nevertheless,\nit was too late. He had lost his energy by then."
      },
      {
        "paragraph": "“Eldest Young Master, you used to be arrogant."
      },
      {
        "paragraph": "Now, let us serve you well.”"
      },
      {
        "paragraph": "A tall, bald man grabbed a stool and smashed it on Shaun’s back."
      },
      {
        "paragraph": "As Shaun could not bring himself to get up, a ferocious punch subsequently landed on his body and\nhead, causing him to cough up a mouthful of blood."
      },
      {
        "paragraph": "Before he completely passed out, he faintly saw someone cracking a ceramic bowl and cruelly slashing\nhis thigh with a splinter afterward."
      },
      {
        "paragraph": "Shaun widened his eyes in disbelief."
      },
      {
        "paragraph": "He clenched his fists hard. Even so, all he could do was let out a groan!"
      },
      {
        "paragraph": "“Young Master Hill, I heard you were quite a playboy back then. I’ll make you a eunuch then.” As the man\nwatched the blood gush out from the hole in Shaun’s trousers, he burst out laughing."
      },
      {
        "paragraph": "Shaun’s face turned ghastly. Perhaps due to the excruciating pain, he finally regained a little energy."
      },
      {
        "paragraph": "He kicked the man before he fell from the bed. His eyes were bloodshot."
      }
    ]
  },
  {
    "title": "Chapter 1012 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Who on earth was that ruthless person?"
      },
      {
        "paragraph": "Mason Campos? He did not have such a deep- seated hatred for Liam, did he?"
      },
      {
        "paragraph": "Could it be someone else?"
      },
      {
        "paragraph": "“Motherf*cker. How dare you kick me?” That man wiped his injured mouth."
      },
      {
        "paragraph": "Just as he was about to walk toward Shaun, the police suddenly came in and yelled, “What are you guys\ndoing? How dare you guys beat each other in private even when you’re locked up.”"
      },
      {
        "paragraph": "In the villa situated on the coast."
      },
      {
        "paragraph": "When Wesley received a call, his lips curled upward. “Is it done?”"
      },
      {
        "paragraph": "“Yes. The person in the detention center said that Shaun’s thigh was bleeding profusely, so he’ll most\nlikely become a eunuch in the future.”"
      },
      {
        "paragraph": "“Most likely?” Wesley narrowed his eyes. “I want it to be certain.”"
      },
      {
        "paragraph": "Considering that Shaun had humiliated him time and time again, Wesley wanted him utterly destroyed."
      },
      {
        "paragraph": "Wesley wondered how Shaun was now going to play around with women since he enjoyed it so much."
      },
      {
        "paragraph": "Would Shaun have the dignity to approach Catherine if he was a eunuch?"
      },
      {
        "paragraph": "“I can’t be certain about it, ” Wesley’s subordinate said with a low voice. “When the person was about t o\nattack him the second time, Chester happened to b e there to see Shaun, and he witnessed the whole\nthing when the police officer brought him in.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“F*ck, ” Wesley cursed gruffly."
      },
      {
        "paragraph": "“President Lyons, I heard the man was very brutal with the attack, so it was most probably ruined,” the\nsubordinate comforted Wesley."
      },
      {
        "paragraph": "“Mm.” Wesley’s elegant and handsome face twisted grimly."
      },
      {
        "paragraph": "As soon as Rodney received the news, he rushed to the hospital. Chester had already been waiting\noutside the emergency room for a while."
      },
      {
        "paragraph": "“How’s Shaun? Damn. Which b*stard did this to Shaun?” Rodney looked stern. “That person really\nwanted to make Shaun impotent and childless, huh? Could it be Mason? That was very cruel of him.\nWhy couldn’t he let the Hills go, considering their predicament? Did he resent the Hills that much? Did he\nhave to go this far?”"
      },
      {
        "paragraph": "“I don’t think it was Mason…” Chester took a drag on his cigarette before he suddenly said in a low\nvoice, “Indeed, Mason and the Hill family don’t resent each other so much, but Mason is very perverted.\nParticularly because he used to be in the lowest rank, the Hill family must have looked down on him for\nthe past ten years or so. Now that it’s finally Mason’s turn to become successful, he wants to destroy the\nHill family completely. He even wants to cover up those who have lent him a hand because he treats\ntheir help as a form of humiliation. To him, he believes that he can succeed without the Hill family.”"
      },
      {
        "paragraph": "Rodney froze for a moment. Then, he thought it over and felt that Mason could indeed have this mindset.\n“Wow, Chester. When did you learn to analyze someone’s mental state?”"
      },
      {
        "paragraph": "“I did some research on it when I dealt with Shaun’s illness previously.”"
      },
      {
        "paragraph": "Chester said with a frown, “Why would that person target that part of Shaun’s? Clearly, he wanted Shaun\nto be childless and impotent. People who do that usually mean to take revenge.”"
      },
      {
        "paragraph": "Rodney blinked. “It means that person is Shaun’s rival, but… Wesley is his only rival.” Rodney was\ndumbfounded when he blurted out the name ‘Wesley’. “Can it be? Wesley is well known for his good\ntemper and elegance. Many people even label him as an infatuated man.”"
      }
    ]
  },
  {
    "title": "Chapter 1013 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Think about it. Don’t you think this person is quite scary?” Chester darted a glance at Rodney.“ We’re all\nfighting in the business industry, and those who have succeeded are all crafty and unyielding. Wesley’s\ncompany has only been around for a few years, yet it is now a leading company in Australia. I still\nremember when Golden Corporation was set up in Canberra a few years back, a lot of people looked\ndown on it. It’s not clear when he gained a foothold in Canberra. But these days, he’s always present in\nsocial gatherings involving prominent figures in the business industry.”"
      },
      {
        "paragraph": "“…Precisely.” Rodney was enlightened by his reminder."
      },
      {
        "paragraph": "“What’s more… Do you remember when Catherine came from Melbourne three years ago? She was\nWesley’s fiancée at that time, but Shaun later snatched her from Wesley. Then, during Wesley and\nCatherine’s wedding, Shaun came to seize her in public again. It was a slap in Wesley’s face. Do you\nthink any man could put up with that?”"
      },
      {
        "paragraph": "“Yeah.” Rodney recalled the incident and nodded. “ Chester, if that’s the case, Wesley is actually very\nmanipulative. Since he could mess with Shaun in the police station, it shows that he’s not simple. If he\nkeeps targeting Shaun, it’s going to be troublesome.”"
      },
      {
        "paragraph": "“What’s worse is that he’ll secretly deal with Shaun while looking calm on the surface.”"
      },
      {
        "paragraph": "The two of them did not say anything else until Shaun was pushed out of the emergency room. He did\nnot lose consciousness, but his face was as white as a sheet."
      },
      {
        "paragraph": "After entering the ward, the doctor said helplessly, “ We’ve performed debridement and suture on his\nwound. Considering that his wound is quite severe, I can’t tell if he’s still potent.”"
      },
      {
        "paragraph": "“What do you mean? I won’t be able to do it anymore…?” It came as a real blow to Shaun."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“You can’t say that either. It’s… not definitely the case.” The doctor glanced at him pitifully. “You need to\nbe optimistic.”"
      },
      {
        "paragraph": "Shaun laughed sardonically."
      },
      {
        "paragraph": "The doctor’s words did not seem to offer him comfort."
      },
      {
        "paragraph": "Did this mean that all he could do now was to keep an optimistic attitude?"
      },
      {
        "paragraph": "In fact, he was not the kind who had a desperate sexual urge. Even before Catherine’s return, he was\nfien with not sleeping with any women for a few years."
      },
      {
        "paragraph": "However, at the thought of his possible importance, he wondered what right he had to win Catherine\nback. What was the poing of asking her tobe with him again?"
      },
      {
        "paragraph": "To become a widow?"
      },
      {
        "paragraph": "It seemed that God did not want to bring him together with Catherine again. First, it was Hill\nCorporation’s collapse, and now, it was himself. Ha!"
      },
      {
        "paragraph": "He must have hurt Catherine too much back then, so God wanted to punish him and make him grow old\nalone."
      },
      {
        "paragraph": "He was suddenly plugged into dejection."
      },
      {
        "paragraph": "He had initially planned to bounce back come what may. After all, he was still young to make a\ncomeback with Hill Corporation. Only then could he have the nerve and confidence to win Catherine’s\nheart back. Neverthless, he had now lost the motivation to work hard."
      },
      {
        "paragraph": "“Don’t be like this, Shau.” Rodney had never seen Shaun in such a state before. Shaun had always been\narrogant, so much that it made others feel like"
      },
      {
        "paragraph": "punching him. However, Rodney noticed that self- confidence had vanished in Shuan’s eyes. He did not\nlook so disheartened even when his microchip was stolen."
      },
      {
        "paragraph": "“Yeah. You’ve managed to have your earlier mental illness cured, so with the current technology, this can\nbe cured. ” Chester consoled him. “I know a lot of well-known doctors. Trust me.”"
      },
      {
        "paragraph": "“Thank you. ” Shaun laughed bitterly. “If it hadn’t been for the two of you, I would probably still be in the\npolice station. I never thought that I’d end up in this state.”"
      },
      {
        "paragraph": "“ It was all because of that woman.” Rodney could not help mumble. “If you didn’t bring Catherine to the\nisland and stayed in Hill Corporation until the microchip was a success, the Campos family wouldn’t have\ntaken advantage of it.”"
      },
      {
        "paragraph": "“Drop it,” Chester warned Rodney."
      },
      {
        "paragraph": "Rodney let out a sigh."
      },
      {
        "paragraph": "Shaun remained silent, knowing that Rodney was just telling the truth. However, he did not regret what\nhe did. If he were given another chance, he would do the same thing again. At least he was happy during\nthat one month."
      }
    ]
  },
  {
    "title": "Chapter 1014 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Hey, say something.”"
      },
      {
        "paragraph": "Shaun’s behavior made Rodney uneasy. “Now is not the time to feel sad. You still have a lawsuit to\ndispute. The Campos family deliberately made this matter big to attract the public’s attention. If\nsomething hadn’t happened to you in the detention center, we wouldn’t have been able to bail you.”"
      },
      {
        "paragraph": "“The police have forbidden you from leaving Canberra. ” Chester sighed and said, “What actually\nhappened to Liam? Why is he missing all of a sudden?”"
      },
      {
        "paragraph": "Rodney said, “Could it be Liam and Mason trying to scheme against you? Liam could, very well, be\nhiding.”"
      },
      {
        "paragraph": "Shaun closed his eyes, his black lashes casting a tired shadow beneath his eyes. “I’m not sure, but I\nhave a sinking feeling that this matter might have t o do with Mason. How does Mason look?”"
      },
      {
        "paragraph": "Chester recalled the incident. “When I confronted him in the police station, he looked quite angry, but"
      },
      {
        "paragraph": "… I didn’t sense any sadness in him.”"
      },
      {
        "paragraph": "“Liam must be f*cking hiding, ” Rodney said in exasperation."
      },
      {
        "paragraph": "“Maybe not.” Shaun shook his head. “Liam was pretty badly injured at that time. If he was hiding, Mason\nwould surely get him a doctor. But I heard that the Campos, including Mason, didn’t look for a doctor. I\nsuspect… Liam could be… killed.”"
      },
      {
        "paragraph": "Toward the end of his sentence, Shaun’s voice choked with bitterness. Even his heart ached for a\nmoment."
      },
      {
        "paragraph": "Rodney was shocked. “Who killed him?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Chester analyzed the situation. “Besides his disagreement with Shaun, Liam has no enemies. The\nperson who killed Liam might want to use his death as a pretext for sending Shaun to jail."
      },
      {
        "paragraph": "“After all, witnesses in the hotel saw Shaun’s people taking Liam away, so Shaun is the prime suspect for\nLiam’s disappearance. Think about who Shaun’s enemy is in Canberra.”"
      },
      {
        "paragraph": "“Wesley Lyons?” Rodney was dumbfounded. “Or Mason Campos? It can’t be Mason since Liam is his\nson.”"
      },
      {
        "paragraph": "“Wesley is more likely to be the suspect.” Chester shifted his gaze to Shaun. “What do you think?”"
      },
      {
        "paragraph": "Shaun’s eyes trembled. A moment later, he gnashed his teeth and replied, “Probably. Wesley could be\nthe one who instructed the people in the detention center to deal with me as well.”"
      },
      {
        "paragraph": "Hence, Shaun pulled himself together and reflected on it. Mason was his business rival. If Mason were to\nattack him, he would not target that part of his body. In this case, the suspect had to be Wesley."
      },
      {
        "paragraph": "Shaun was quite surprised at Wesley being the suspect."
      },
      {
        "paragraph": "In his eyes, Wesley was merely an ant that he could step on however he wished. He could even snatch\nWesley’s woman away for a month, and even then, Wesley was too scared to do anything."
      },
      {
        "paragraph": "However, when Shaun thought it through, he found this type of person quite terrifying. Wesley might\nseem elegant and gentle on the surface, but no one knew what was on his mind. He was like… how\nMason used to be."
      },
      {
        "paragraph": "All of a sudden, Shaun was concerned about Catherine. Would Wesley harbor a grudge against\nCatherine for the video Shaun sent him the last time?"
      },
      {
        "paragraph": "Perhaps future Catherine would be current Lea."
      },
      {
        "paragraph": "He had to remind Catherine. However, she might not trust him."
      },
      {
        "paragraph": "“I’ll ask someone to look into Wesley, but what matters now is to bring Liam back, regardless of whether\nhe’s dead or alive. Meanwhile, the Campos family will definitely sue you. I’ll get you a better lawyer, ”\nsaid Chester."
      },
      {
        "paragraph": "“Thanks.” Never had Shaun thought that he, the most outstanding lawyer in Australia, would one day be\ninvolved in a lawsuit. “I already know how to tackle the case. If I have to go to court with the Campos\nfamily, let me lead the case. I’ll win it.”"
      },
      {
        "paragraph": "“Alright, then.”"
      },
      {
        "paragraph": "In a men’s clothing store of a mall."
      }
    ]
  },
  {
    "title": "Chapter 1015 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "When Catherine was looking at a men’s suit, someone tapped her from behind."
      },
      {
        "paragraph": "Freya smilingly appeared beside her. “It’s been more than a month. Tsk, absence really does make the\nheart grow fonder. You finally asked me out.”"
      },
      {
        "paragraph": "“Alright. I just want you to help me pick a men’s shirt.” Catherine took a blue shirt and asked, “What\nabout this?”"
      },
      {
        "paragraph": "“This shirt looks young. If you’re not buying this for your dad, it has to be either for Wesley or Shaun, ”\nFreya responded after glancing at it."
      },
      {
        "paragraph": "Catherine’s face fell. “Do you think I’ll buy it for Shaun? I’m getting it for Wesley. I made him angry, so I’m\nplanning to buy him a shirt and apologize to him. But I don’t know his size. Sigh.”"
      },
      {
        "paragraph": "“Don’t bother buying a shirt, then. If it’s for a man, you should buy a watch instead. Come on. Let’s go\nand pick a nice watch.”"
      },
      {
        "paragraph": "With that, Freya dragged her out of the store. Catherine thought it through for a while and felt that a\nwatch would match a man’s identity better as well. “Did I interrupt your work by asking you out this\nafternoon?”"
      },
      {
        "paragraph": "“Please, I’m a director as well as Rodney’s fiancée. I can leave whenever I want. Who would have the\nguts to stop me? What’s more, Rodney is busy bailing Shaun out of the police station. He’s too busy to\nconcern himself with the company’s affairs.”"
      },
      {
        "paragraph": "Catherine furrowed her brows. Freya and she seemed to mention Shaun’s name very frequently."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Just as Catherine was about to change the topic, Freya suddenly moved closer to her and whispered\ninto her ear, “I heard something happened to Shaun in the detention center. He was even sent to the\nhospital for emergency treatment.”"
      },
      {
        "paragraph": "Catherine was stunned. “With his skills, how could something have happened to him? He should be able\nto deal with ten people easily.”"
      },
      {
        "paragraph": "“I have no idea, but his injuries seem quite severe.” Freya added, “When I had a meal with the Snows\nthe other day, I heard Aunty Wendy mentioning it. Oh well, what goes around comes around.”"
      },
      {
        "paragraph": "Catherine was dazed, but in the end, she forced herself not to dwell on it. “Stop bringing Shaun up."
      },
      {
        "paragraph": "I’m not interested. Come on, take a look at the watches.”"
      },
      {
        "paragraph": "“Tsk. I just wanted you to cheer you up.”"
      },
      {
        "paragraph": "“As long as he doesn’t come looking for me, I’m happy.”"
      },
      {
        "paragraph": "Catherine eventually chose a Patek Philippe SA watch."
      },
      {
        "paragraph": "Catherine was about to return home after they both had dinner, but Freya held onto her. “Accompany m\ne to a place. Let’s go.”"
      },
      {
        "paragraph": "Only when they arrived at the venue did Catherine realize that it was an auction, and all the wealthy\nfamilies in Australia were gathered here tonight."
      },
      {
        "paragraph": "“Why did you bring me here?” Catherine pulled a long face."
      },
      {
        "paragraph": "“Please, the Hill family’s manor is up for auction tonight. I can’t afford it, but it won’t stop me from\nwatching the fun.” Freya dragged Catherine in excitedly."
      },
      {
        "paragraph": "“Hold on. Let me buy a cap.” Catherine stopped her. “I’m sure Melanie and the rest are here as well. I\ndon’t want to see them. I’m afraid I might be disgusted.”"
      },
      {
        "paragraph": "“That’s true. Now that her husband, Charlie, is the most influential young master in Australia, I guess she\nhas become very uppity.” Freya bought the same cap as her as well, and with sunglasses on, both of\nthem walked into the private room on the second floor, keeping a low profile."
      },
      {
        "paragraph": "There were many items up for auction tonight, with the Hill family’s manor being the last one."
      },
      {
        "paragraph": "During the auction, Catherine headed to the restroom and happened to come across Lea and Mason."
      },
      {
        "paragraph": "However, they were not a loving couple anymore. Mason had his hand wrapped around a lovely young\nwoman beside him, who was none other than Joanne Holt. Both of them seemed like they were trying to\nput Lea in a difficult position."
      }
    ]
  },
  {
    "title": "Chapter 1016 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Aunty Lea, have you been under a lot of stress lately? You look much older than before.”"
      },
      {
        "paragraph": "Joanne gloated while covering her mouth. “But that’s understandable with the Hill family’s current\npredicament. If I were you, I’d be so anxious that my hair would’ve turned gray.”"
      },
      {
        "paragraph": "“Even if I’m old, I’m still much stronger than a person like you who sleeps with a man of your dad’s age.”\nLea was now much more sensible and calm. To put it another way, she had no right to be sad or mad\nanymore."
      },
      {
        "paragraph": "“You…” Joanne’s expression shifted. She then shook Mason and said, “Hubby, look. She’s calling you\nold, but I don’t think so. You look very young, like you’re in your 30s.”"
      },
      {
        "paragraph": "“What a smooth talker you are.” Mason pinched her cheek flirtatiously."
      },
      {
        "paragraph": "Lea felt like vomiting at the sight of their interaction."
      },
      {
        "paragraph": "Mason may have kept a good shape over the years, which made him look like he was in his 40s even\nthough he was 5o years old. However, he did look like Joanne’s father when they stood next to each\nother."
      },
      {
        "paragraph": "To Lea, the young Mason was a warm, talented, and perfect man. At this point, however, he filled her\nwith disgust."
      },
      {
        "paragraph": "She was not even sure why she would fall for a man like Mason back then."
      },
      {
        "paragraph": "“Hubby, stop it. Look how terrible Aunty Lea’s face is. She must be unhappy. She’s your ex-wife, after\nall.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“You’re overthinking it. I probably find this scene pretty disgusting because of the huge age gap between\nyou both.” Lea pursed her lips sarcastically."
      },
      {
        "paragraph": "Mason’s expression changed, and his gaze became grim. “Lea, don’t think that I don’t know you’re\nplanning to sell off the Hill family’s manor because you’re running out of working capital."
      },
      {
        "paragraph": "Unfortunately, your plan is doomed to fail.”"
      },
      {
        "paragraph": "“What do you mean?” Lea frowned."
      },
      {
        "paragraph": "Joanne covered her mouth and chuckled. “It means that Mason has pulled some strings. Many wealthy\nand noble families have shown up tonight, and they’re quite interested in buying the manor. The reserve\nprice of the manor is 40 billion dollars, but Mason has warned them not to offer any price exceeding\n4o.1billion dollars during the bidding. By then, Mason will bid for it, and the three of us will be living\nthere.”"
      },
      {
        "paragraph": "Mason’s motive instantly dawned on Lea. She stared at him incredulously while trembling with anger."
      },
      {
        "paragraph": "“Mason Campos, don’t go too far. You already have everything you want. The Campos family has\nbecome the most influential family in Australia, and you’re now a high-ranking figure. Why do you have to\ndestroy Hill Corporation without leaving a way out for us?”"
      },
      {
        "paragraph": "In fact, if Lea were not desperate for money, she would have taken her time to sell the manor. Even if\nshe set the selling price at 1oo billion dollars, someone would surely buy it."
      },
      {
        "paragraph": "Although the reserve price of the manor tonight was 40 billion dollars, she thought it would not be a\nproblem for it to go for 8o billion at least. However, she did not expect Mason to be so despicable."
      },
      {
        "paragraph": "At the sight of her panicking, Mason smiled in satisfaction."
      },
      {
        "paragraph": "“How did I destroy Hill Corporation? 40 billion dollars is already enough for everyone in the Hill family to\nlive for the rest of their lives. You should be content. Lea. You’re not young anymore either, so why do\nyou want to work so hard? Be careful. You might end up without a penny left.”"
      },
      {
        "paragraph": "“Yeah. Look, Shaun is the best example, isn’t he?” Joanne said conceitedly, “Such a large Hill family has\nalready been destroyed by that son of yours, so you’d better not be greedy.”"
      },
      {
        "paragraph": "Lea lifted her hand to slap Mason in the face."
      },
      {
        "paragraph": "Nevertheless, Mason had braced himself for it. He pushed her away and put his hand around Joanne’s\nwaist. “Let’s go.”"
      },
      {
        "paragraph": "“Mason, Liam’s whereabouts are still unknown, yet you have the mood to think of ways to scheme\nagainst me and accompany another woman.” Lea moaned with sorrow, “Are you even a human? Liam is\nyour son.”"
      },
      {
        "paragraph": "“What can I do? I wasn’t the one who contributed to his disappearance. What’s more, he’s not my only\nson. Unlike you, Joanne can give birth to my child with her body anytime.” After that, Mason left with\nJoanne, unbothered."
      },
      {
        "paragraph": "Lea stood there in a daze. Only after a long while was she struck by a thought, and she swiftly walked\ntoward the organizer of the event."
      }
    ]
  },
  {
    "title": "Chapter 1017 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine presumed that Lea was about to withdraw the Hill family’s manor for auctioning. However, that\nwould be… quite impossible."
      },
      {
        "paragraph": "Most of the guests were here tonight for the manor. If it was withdrawn so abruptly, the organizer would\nlose its credibility and might not be able to organize an auction anymore."
      },
      {
        "paragraph": "Only after Lea went out of sight did Catherine head to the restroom, feeling preoccupied."
      },
      {
        "paragraph": "When Catherine made a turn, she suddenly saw a tall man leaning against the wall smoking."
      },
      {
        "paragraph": "She was taken aback."
      },
      {
        "paragraph": "She wondered how long this man had stood here. He had probably heard the conversation between Lea\nand Mason."
      },
      {
        "paragraph": "With that, she could not help but throw him a glance."
      },
      {
        "paragraph": "The man was really tall, and there was a hideous scar on his cheek. Although he was wearing a pair of\nsunglasses, his prominent features and tall nose"
      },
      {
        "paragraph": "were visible. Dressed in a black suit, he gave the illusion that he was intimidating."
      },
      {
        "paragraph": "This man looked like he was in his forties, but he must have been very charming when he was younger."
      },
      {
        "paragraph": "Even now, he looked quite charming, much less when he was young."
      },
      {
        "paragraph": "As if he had noticed her gaze, the man took out the cigarette from his mouth. After that, he left with his\nhands shoved in the pockets of his trousers."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "As soon as Catherine returned to the private room from the washroom, Freya grumbled, “You took such\na long time. The bidding for the Hill family’s manor is about to begin.”"
      },
      {
        "paragraph": "“Let it be, then. The manor will definitely go to Campos Corporation tonight.” At the thought of Lea’s\nbleak silhouette, Catherine began to sympathize with her."
      },
      {
        "paragraph": "“How do you know?” Freya gazed at her curiously."
      },
      {
        "paragraph": "Catherine could not help but tell her everything she just witnessed. Upon hearing it, Freya flew into a\nrage."
      },
      {
        "paragraph": "“Mason has gone too far. The Hill family’s manor is so huge and situated in the mountains, yet its reserve\nprice is merely 40 billion dollars. This amount isn’t even enough to cover the cost of the land. I’ll raise the\npaddle later and call out 5o billion dollars to increase the price. I don’t like the Hills, but I hate a scumbag\nwho goes back on his word and dumps his wife even more.”"
      },
      {
        "paragraph": "Catherine blinked. “What if nobody else bids after you call out 5o billion dollars? Are you able to fork out\nthat amount?”"
      },
      {
        "paragraph": "Freya suddenly felt dispirited."
      },
      {
        "paragraph": "“Don’t bid. If Mason found out, he’d cause you trouble. ” Catherine reminded her, “Can’t you tell that\nMason is the sort who’ll seek revenge on the smallest grievances.”"
      },
      {
        "paragraph": "At 9:00 p.m., the bidding for the Hill family’s manor finally began."
      },
      {
        "paragraph": "The host said, “The Hill family manor is the largest manor in Australia. It has 8oo,ooo square feet and\nfeatures an orchard, racecourse, golf club — you name it. They say most Australians dream of having a\none-week staycation at the Hill family’s manor. Even a random tree there costs more than 1oo thousand\ndollars due to its long history. Now, we’ll"
      },
      {
        "paragraph": "start the bidding at 40 billion dollars.”"
      },
      {
        "paragraph": "Soon, a paddle from the first private room went up. “40 billion dollars and ten cents.”"
      },
      {
        "paragraph": "“Haha. You’re too petty. I’m calling out 4o billion and loo dollars. I’m more generous.”"
      },
      {
        "paragraph": "“ I’ll add l000 dollars, and that’s the maximum. “"
      }
    ]
  },
  {
    "title": "Chapter 1018 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "The host of the auction looked awkward."
      },
      {
        "paragraph": "It was his first time encountering such a situation."
      },
      {
        "paragraph": "Freya was so furious that she slammed her hand on the table. “All of you are powerful figures in\nAustralia. Have you no shame? Damn, if I could fork out 50 billion dollars, I would’ve bid the manor. ”"
      },
      {
        "paragraph": "“Who doesn’t wish to buy the manor? In fact, a lot of people do, but they are forced to listen to Campos\nCorporation,” Catherine said complicatedly."
      },
      {
        "paragraph": "Someone outside started to bid once more. “40.2 billion dollars.” \nAfter hearing this voice, Catherine’s expression changed. Others might not recognize it, but she knew it\nwas Wesley’s voice as she had known him for several years."
      },
      {
        "paragraph": "She never thought that he would come. Did he receive a warning from the Campos family as well?"
      },
      {
        "paragraph": "Somehow, Catherine was quite disappointed."
      },
      {
        "paragraph": "In her eyes, Wesley was a gentleman. He could hate"
      },
      {
        "paragraph": "Shaun, but he probably would not make things worse for him."
      },
      {
        "paragraph": "Clearly, she was wrong. \nAfter Wesley called out 4o.2 billion dollars, nobody else made a bid."
      },
      {
        "paragraph": "The host was speechless. He seriously wondered if these wealthy people came to this auction to cause\ntrouble. “Anyone else wants to bid? 40.2 billion dollars, going once…”"
      },
      {
        "paragraph": "“5o billion dollars, ” Catherine suddenly said with a throaty voice, sounding like a man."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Her throaty voice had caused an uproar outside. Everyone turned their gazes to Catherine’s private\nroom, but nobody could tell who she was since the window of her room remained closed."
      },
      {
        "paragraph": "Shortly after, a clear smashing sound came from one of the private rooms. It evidently served as a\nwarning."
      },
      {
        "paragraph": "Catherine raised her brows. It must be Mason who was warning her."
      },
      {
        "paragraph": "Freya widened her eyes at Catherine and whispered, “Can you shell out 5o billion dollars?”"
      },
      {
        "paragraph": "“My dad should be able to pay for it,” Catherine answered reluctantly."
      },
      {
        "paragraph": "“Aren’t you afraid of offending the Campos family?” Freya grimaced. “You actually want to help the Hill\nfamily, right?”"
      },
      {
        "paragraph": "“Just like you, I enjoy standing up for justice.” Catherine darted a glance at her. “Besides, even if I’ve\nsuccessfully bid the manor, I can sell it to someone and earn tens of billions of dollars."
      },
      {
        "paragraph": "“You’re right.”"
      },
      {
        "paragraph": "Someone soon called out from outside. “50 billion and 100 dollars.”"
      },
      {
        "paragraph": "This was Mason’s voice."
      },
      {
        "paragraph": "Freya almost spat the coffee in her mouth. “Damn. Now that Mason is the wealthiest person in Australia,\nhow dare he add 1oo dollars only?”"
      },
      {
        "paragraph": "The corners of Catherine’s mouth twitched. She was at a loss for words. She realized that Mason was\nnot only despicable but also extremely… petty."
      },
      {
        "paragraph": "It was outrageous that this kind of person became the wealthiest person in Australia."
      },
      {
        "paragraph": "“50.2 billion dollars, ” Catherine called out again. “I’ll add another hundred dollars.”"
      },
      {
        "paragraph": "This time, it was Wesley’s voice."
      },
      {
        "paragraph": "Catherine rubbed her forehead. She was… rather disappointed in Wesley."
      },
      {
        "paragraph": "At this moment, a man’s cold and deep voice"
      },
      {
        "paragraph": "sounded from the right side. “150 billion dollars. “"
      },
      {
        "paragraph": "With that, a commotion arose across the auction room."
      }
    ]
  },
  {
    "title": "Chapter 1019 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "150 billion dollars was indeed an astronomical price."
      },
      {
        "paragraph": "Mason had warned others not to raise the price. Hence, now that someone had the audacity to call out\nsuch a sky-high price, it was plain that he was challenging Campos Corporation."
      },
      {
        "paragraph": "The host was dumbfounded, but he then said excitedly, “150 billion dollars, going once, going twice…\nSold.”"
      },
      {
        "paragraph": "In the private room, Freya was astonished. “Who was the one who shouted this price out of the blue?\n15o billion dollars? Let me do some math. It’s a lot.”"
      },
      {
        "paragraph": "“This amount… is not something many people can fork out.” Catherine was surprised. Somehow, the\nmysterious man whom she caught smoking earlier crossed her mind."
      },
      {
        "paragraph": "“Don’t Mason want to continue bidding?” Freya sighed. “Is that it?”"
      },
      {
        "paragraph": "“Considering how petty Mason is, would he be willing to fork out 1oo billion dollars? That’d be a joke.”\nThe moment Catherine opened the door, two men blocked her way."
      },
      {
        "paragraph": "“It’s a woman.” One of the men snorted. “Wait here. Chairman Campos would like to meet you. ”"
      },
      {
        "paragraph": "“Hey, Catherine, so it was you who called out the price.” Charlie and Melanie, who happened to pass by,\nsuddenly came to take a dig at her. “How savage of you. You don’ t have Shaun backing you up now, yet\nyou dare challenge us.”"
      },
      {
        "paragraph": "“You’re biting off more than you can chew.” Charlie fixed his burning eyes on Catherine and smiled."
      },
      {
        "paragraph": "Catherine snickered. “The Campos family actually caught me by surprise. How shameless of you guys to\nbid 1oo dollars. That was an eye -opener for me.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Charlie’s expression shifted into annoyance before he let out a cold laugh. “For an unlucky place like the\nHill family’s manor, adding 1oo dollars was extremely kind of us.”"
      },
      {
        "paragraph": "“Exactly. Whoever stays there will be unlucky. I mean, the Hills are currently so poor that they even have\nto sell off their manor.” Melanie made fun of their mishap."
      },
      {
        "paragraph": "“I know you guys couldn’t bring yourselves to buy it but didn’t allow others to buy it as well. Mason must\nbe putting the buyer in trouble now. Let me advise you guys. Not anyone can take out 150 billion dollars\neffortlessly to invest in a manor. Think about it. Can the Campos family easily fork out this amount?”\nCatherine reminded them."
      },
      {
        "paragraph": "Charlie furrowed his brows together."
      },
      {
        "paragraph": "150 billion dollars was nothing much to the Campos family considering their wealth today."
      },
      {
        "paragraph": "Nevertheless, forking such a large sum of money in such a short period would require them to hold a\nmeeting. The bigger the business was, the more cash flow they needed."
      },
      {
        "paragraph": "Hardly anyone in Australia could fork out this amount of money, except for those established gentries.\nHowever, that voice… she had never heard it before."
      },
      {
        "paragraph": "Could it be a foreigner?"
      },
      {
        "paragraph": "Having said that, why would a rich foreigner come to Canberra and buy the largest manor in Australia?"
      },
      {
        "paragraph": "She became increasingly vigilant for fear that someone would take advantage of her, especially Charlie\nand Mason."
      },
      {
        "paragraph": "After all, they had just tasted the sweetness of power."
      },
      {
        "paragraph": "“Cathy, why are you here?”"
      },
      {
        "paragraph": "At this moment, Wesley walked past the spot and caught sight of her. His handsome face twitched as he\nimmediately walked up to her."
      },
      {
        "paragraph": "Catherine shifted her eyes to Wesley, and he was not alone. Beside him was his secretary, Regina Trent,\nwho had a graceful figure. Catherine had seen her before, but she had not given her much thought."
      },
      {
        "paragraph": "“Miss Jones…” Regina greeted Catherine with a smile."
      },
      {
        "paragraph": "Catherine nodded, but before she could speak, Freya said, “President Campos is blocking our way. He’s\nthrowing his weight around and stopping us from leaving.”"
      },
      {
        "paragraph": "Wesley turned his gaze to Charlie, who then said grumpily, “The person who bid 50 billion dollars was\nCatherine. President Lyons, this woman is, dare I say it, thinking about helping the Hill family. You should\nbeware of her cuckolding you again.”"
      },
      {
        "paragraph": "Wesley’s handsome face darkened, looking extremely unpleasant in an instant. Catherine explained,\n“Don’t get me wrong. I thought of buying the manor and selling it off later to make millions of dollars.”"
      },
      {
        "paragraph": "“Didn’t you receive the warning from us?” Charlie asked fiercely."
      },
      {
        "paragraph": "“You guys planned on buying the manor but couldn’t bear to spend so much, so you guys deliberately\nthreatened others not to buy it and even stopped them from raising the price. I know what’s on your\nminds.” Catherine scoffed."
      },
      {
        "paragraph": "“Charlie, you guys are just businessmen. After all, you’re not the prime minister. You can’t possibly cover\nthings up. Am I right, Freya?”"
      }
    ]
  },
  {
    "title": "Chapter 1020 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Freya grasped Catherine’s message within a second. “Precisely. Are you guys insistent on blocking me?\nFine. I’ll call Uncle Jason. Let me remind you that I’ll soon be the Snow family’s daughter-in -law.”"
      },
      {
        "paragraph": "Charlie instantly felt bad."
      },
      {
        "paragraph": "The elected prime minister next year would most probably come from the Snow family. If they offended\nJason, with whom they were currently trying to curry favor, they would be in deep water."
      },
      {
        "paragraph": "Charlie almost forgot that Catherine’s best friend had such an influential background."
      },
      {
        "paragraph": "“It was merely a misunderstanding.” Charlie’s expression immediately switched to a friendly smile. “I was\njust curious who called out 50 billion dollars.”"
      },
      {
        "paragraph": "Freya bit her lip. “We weren’t planning on buying it. We just felt that those wealthy families who kept\nadding 100 dollars were a disgrace to the other wealthy families in Australia.”"
      },
      {
        "paragraph": "Charlie’s expression was extremely cold and unpleasant. However, he had to suppress his rage."
      },
      {
        "paragraph": "Meanwhile, Wesley dropped his gaze, and his expression was bizarre."
      },
      {
        "paragraph": "“Let’s go.” Catherine held Freya’s hand. When she walked past Wesley, she could not help but pause for\na moment. “Are you leaving? Or are you going to stay here and catch up with President Campos?”"
      },
      {
        "paragraph": "“I’m leaving with you.” Wesley cast a gentle look at Catherine."
      },
      {
        "paragraph": "After the four of them left, Charlie stomped his feet in a huff and kicked the garbage bin beside him."
      },
      {
        "paragraph": "Melanie said with disdain, “I never thought Catherine’s friend would get into the Snow family. Anyhow,\nwhat’s so great about it? It’s only an engagement. Who knows if she’ll be dumped someday? After all, we"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "all know that Rodney is only in love with Sarah.”"
      },
      {
        "paragraph": "Charlie’s brows moved. “How’s your relationship with Sarah?”"
      },
      {
        "paragraph": "“…So-so.” Melanie said embarrassedly, “But Joanne is quite close to her.”"
      },
      {
        "paragraph": "In fact, Melanie disliked Sarah. Since young, she had always been jealous of Sarah for being able to\ncapture Shaun’s heart."
      },
      {
        "paragraph": "“Our enemy’s enemy is our friend. We can take advantage of Sarah.” Charlie raised his brows. “If we\ndevelop a good relationship with Sarah, I don’t mind giving her full support in marrying into the Snow\nfamily.”"
      },
      {
        "paragraph": "“That’s true. After all, we’re not on good terms with Freya. If she marries into the Snow family, she’ll tear\nus apart, and it’ll ruin the Campos family’s progress.” Melanie nodded in agreement."
      },
      {
        "paragraph": "In this day and age, one had to get along well with the prime minister’s family no matter how rich he or\nshe was."
      },
      {
        "paragraph": "Meanwhile, when Mason arrived at the private room of the buyer who bid 15o billion dollars, the room\nwas already empty."
      },
      {
        "paragraph": "All that was left behind was a warm, steamy cup of coffee on the table."
      },
      {
        "paragraph": "“Excuse me, Mr. Campos. That buyer has left, but his secretary is currently handling the handover\nprocess with the auction staff over there,” said the server who was doing the cleaning."
      },
      {
        "paragraph": "Mason shot his assistant a look, and his assistant swiftly left."
      },
      {
        "paragraph": "With her arm hooked through Mason’s, Joanne said, “Mason, who the hell had the nerve to make you\nlook bad? You must punish him severely.”"
      },
      {
        "paragraph": "“Maybe… A foreigner.”"
      },
      {
        "paragraph": "Mason pulled a long face. No matter who it was, opposing him in public despite his warning was a real\nslap in the face."
      },
      {
        "paragraph": "150 billion dollars. Damn it."
      },
      {
        "paragraph": "That person was obviously trying to help the Hill family make more money."
      },
      {
        "paragraph": "In truth, the market price of the Hill family’s manor was only 1oo billion dollars at most."
      },
      {
        "paragraph": "Who on earth was trying to help the Hill family?"
      },
      {
        "paragraph": "When he turned around, Lea happened to run into this private room, panting. The moment she caught\nsight of Mason, a hint of hatred flashed across her eyes."
      },
      {
        "paragraph": "Mason shuddered. He could not believe that Lea dared to ‘hate’ him with his current status."
      }
    ]
  },
  {
    "title": "Chapter 1021 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Mason did not even harbor hatred for Lea."
      },
      {
        "paragraph": "“Are you here to look for the buyer?” Mason mocked, “From your eager look, you must be thinking about\nselling your body and pestering the buyer. Unfortunately, you’re old and unattractive. Don’t do such a\nshameless thing, Lea.”"
      },
      {
        "paragraph": "Lea sneered. “Since you were here earlier than me, it means that you’ re trying to pester the buyer as\nwell. Unfortunately, she won’t be interested in an old man like you even if she’s rich.”"
      },
      {
        "paragraph": "Joanne teased, “My husband is so rich, and it’s always other people who pester him. What’s more, the\nperson who bid for the manor was obviously a man…”"
      },
      {
        "paragraph": "“Yeah, it was a man, but he was much more generous than you. 50 billion and 100 dollars. Mason\nCampos, you’re the first wealthiest Australian who’s so miserly and petty. I felt ashamed on your behalf\nfor bidding that amount.”"
      },
      {
        "paragraph": "After Lea finished speaking, she turned on her heel and walked away."
      },
      {
        "paragraph": "Indeed, she was utterly disgusted by her ex-husband."
      },
      {
        "paragraph": "How could one be so petty?"
      },
      {
        "paragraph": "Mason could not resist yelling, “Lea, I’m not petty. I just don’t want to let you earn a penny.”"
      },
      {
        "paragraph": "“Then, what do you call this behavior if not petty? We were married for over ten years, and I even gave\nbirth to your child. Before we got married, I gave you and your family at least 1oo billion dollars as the\ncapital. But after we divorced, I got nothing."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Let’s not talk about a house. You didn’t even give me a penny. Mason Campos, I admit that you’re quite\nshrewd, but you’re shallow as well. Who would be bothered about such chickenfeed when they do big\nthings?”"
      },
      {
        "paragraph": "Lea turned around and looked at him calmly, “The Campos family is where they are now because you\nguys have been pretending to be weak and snatching things from others. But you guys won’t be able to\nstay this way for long. Those of higher social standing are forever concerned about their own benefits,\nand they care less for others with time.”"
      },
      {
        "paragraph": "At that, she left straight away."
      },
      {
        "paragraph": "Mason lifted his hand infuriatingly and smashed the cup on the table."
      },
      {
        "paragraph": "Lea had called him… shallow and petty?"
      },
      {
        "paragraph": "Those words were like a resounding smack on his face."
      },
      {
        "paragraph": "Very well!"
      },
      {
        "paragraph": "‘Lea, one day, I’ll make you pay for what you said today.’"
      },
      {
        "paragraph": "Shortly after, Mason’s assistant came in. “Chairman Campos, I just met the buyer’s assistant. After I\nintroduced myself, his assistant…"
      },
      {
        "paragraph": "completely ignored me.”"
      },
      {
        "paragraph": "“He dared ignore you after you told him that you’re my assistant?” Mason asked grimly."
      },
      {
        "paragraph": "“Yeah. I’ve checked the surveillance camera. His boss is a man, and he wore a pair of sunglasses and a\ncap.”"
      },
      {
        "paragraph": "Mason’s gaze was cold. “Keep an eye on the Hill family’s manor. Since he has bought it, he’ll show up\neventually. I want to find out who’s bold enough to set himself against me.”"
      },
      {
        "paragraph": "In the car park."
      },
      {
        "paragraph": "Freya tapped Catherine on the shoulder. “Since President Lyons is here, I won’t send you home. Let him\nsend you back and also… give him the watch.”"
      },
      {
        "paragraph": "“Watch?” A glint flashed across Wesley’s eyes. Grinning, Freya said, “Yeah. She said she offended you,\nso she bought you a watch to apologize to you. It was quite pricey. She spent over loo thousand dollars\non it. Alright, then. Goodbye.”"
      },
      {
        "paragraph": "With that, she quickly left, leaving a very embarrassed Catherine."
      },
      {
        "paragraph": "“Cathy, get into the car. ” Wesley then shot Regina a look. “Find your way back yourself.”"
      },
      {
        "paragraph": "“It’s fine. You can send Secretary Trent home.” Catherine felt that it would be dangerous for a woman to\ntake a taxi home alone at such a late hour. “It’s fine. I can take a taxi,” Regina said reluctantly with her\neyes fixed on Wesley’s expression."
      }
    ]
  },
  {
    "title": "Chapter 1022 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Once Regina turned around, her pretty face fell. Wesley was the one who took her to the auction. He\neven hugged and touched her in the private room just now."
      },
      {
        "paragraph": "However, as soon as he came out of the room, he put on an elegant front."
      },
      {
        "paragraph": "This man… was not one she could control, so she knew where she stood."
      },
      {
        "paragraph": "Moreover, she did not admire Catherine. Conversely, she found Catherine quite stupid, probably\nbecause Catherine was under the impression that Wesley was deep in love with her."
      },
      {
        "paragraph": "Wesley drove the car."
      },
      {
        "paragraph": "Seated in the passenger seat, Catherine took out a box from her handbag, and inside the box was a blue\nPatek Philippe SA mechanical watch."
      },
      {
        "paragraph": "“It must have cost you a lot.” Wesley said painfully, “Don’t spend so much on me next time. I should be\nthe one spending it on you instead.”"
      },
      {
        "paragraph": "“It doesn’t matter. I think this is my first time getting you a gift.” Catherine took out the watch and put it on\nfor him. It looked gorgeous and luxurious."
      },
      {
        "paragraph": "However, when her eyes settled on his wrist, Shaun’s wrists flashed in her mind."
      },
      {
        "paragraph": "Shaun’s wrists looked really beautiful. He never wore branded watches, but his watches were all\ndesigned by the top watchmaker. They might not be fascinating, but they were elegant."
      },
      {
        "paragraph": "Anyway… Why did she think about that damn man again?"
      },
      {
        "paragraph": "She sighed in frustration before she complimented, “It suits you very well.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Thanks. I love it.” Wesley held her hand and said apologetically, “I’m sorry, Cathy. I said those things on\nthe spur of the moment. All I cared about was my feelings but neglected the fact that you’re Suzie’s\nmom. Anyway, I’ll support your decision even though I hate Shaun.”"
      },
      {
        "paragraph": "“Wesley, don’t say that. You’ve suffered a lot because of my selfishness. ” Catherine apologized to him\ntoo."
      },
      {
        "paragraph": "“Alright. Let’s… make peace and not argue anymore.” Wesley smiled wryly."
      },
      {
        "paragraph": "Catherine pursed her lips. After the car traveled for some distance, she could not help but ask, “I didn’t\nexpect you to attend the auction tonight. Was it because the Campos family has pulled some strings with\nyou? I recall you seemed to be on good terms with Charlie back then. You also attended his wedding.”"
      },
      {
        "paragraph": "“We’re just business partners.” Wesley said frankly, “A lot of Australians dare not offend the Campos\nfamily now, so I can’t afford to set myself against them too. I don’t agree with the price that Mason set\ntonight too, but I had no choice. You won’t… blame me, right?”"
      },
      {
        "paragraph": "“No. I can understand that.”"
      },
      {
        "paragraph": "Catherine shook her head and did not blame Wesley. However, it occurred to her that Wesley was not an\nobstinate person. If it were Shaun…"
      },
      {
        "paragraph": "Why did she think of Shaun again?"
      },
      {
        "paragraph": "Catherine opened the window. Unlike Shaun, who was born into a brilliant and wealthy family, Wesley\nhad to be cautious in every step he took. The two of them could not be compared."
      },
      {
        "paragraph": "After they arrived at the Yule family’s villa, Wesley parked the car and got out of it. “I’ll stay here tonight.”"
      },
      {
        "paragraph": "His firm tone startled Catherine for a moment. Then, she said with a low voice, “I’ll get the guest room\nready for you.”"
      },
      {
        "paragraph": "In the guest room, she habitually removed the bedspread."
      },
      {
        "paragraph": "Suddenly, a man’s burning body wrapped around her from behind."
      },
      {
        "paragraph": "Knowing who it was, Catherine shuddered, but Wesley did not stop there. Instead, he pressed her onto\nthe bed."
      },
      {
        "paragraph": "“Cathy, can you sleep here tonight?” Wesley looked at her with burning eyes. “We’re already married,\nand I’ve been waiting for a very long time.”"
      },
      {
        "paragraph": "Catherine’s mind was in a mess, especially when Wesley kissed her. She felt very uncomfortable with it."
      },
      {
        "paragraph": "“Mommy…”"
      }
    ]
  },
  {
    "title": "Chapter 1023 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Suzie’s voice came from the door."
      },
      {
        "paragraph": "Catherine took the opportunity and snuck out from under Wesley’s arms. “I… I have to bathe Suzie. You\nshould sleep earlier.”"
      },
      {
        "paragraph": "Looking at Catherine’s silhouette, which was leaving in a hurry, Wesley’s eyes darkened."
      },
      {
        "paragraph": "He was not a fool. He could sense the rejection of Catherine’s body toward his touch."
      },
      {
        "paragraph": "She repulsed him so much, yet she could willingly accept Shaun."
      },
      {
        "paragraph": "‘Catherine, you were lying when you said you no longer have feelings for Shaun.’"
      },
      {
        "paragraph": "In the bathroom, Catherine’s mind wandered as she bathed Suzie."
      },
      {
        "paragraph": "She did not expect her body to be so repulsive of Wesley."
      },
      {
        "paragraph": "What should she do? She was already his wife, and some responsibilities could not be evaded."
      },
      {
        "paragraph": "“Mom, were you planning to have a baby with Uncle Wesley just now?” Suzie’s words were shocking."
      },
      {
        "paragraph": "Catherine pinched her cheeks with a flushed face. “What nonsense are you talking about? Who told you\nall these things?”"
      },
      {
        "paragraph": "“Uncle Liam told me to never kiss or touch the boys at preschool. Babies pop out that way, ” Suzie said\nconfidently."
      },
      {
        "paragraph": "This made Catherine embarrassed. Why did Liam tell Suzie those things?"
      },
      {
        "paragraph": "However, when she thought of Liam’s disappearance, she became worried and sad."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Mom, I don’t like you doing that with Uncle Wesley, ” Suzie said with a frown. “I like you sleeping with\nme.”"
      },
      {
        "paragraph": "“Okay, Mommy will accompany you.” Catherine’s brows moved. “Suzie, Uncle Wesley will be staying\nhere from now on. If you see that situation in the future, you must remember to call me over.”"
      },
      {
        "paragraph": "“Oh.” Suzie looked as if she understood Catherine’s words. “Mommy, you won’t kiss and hug Uncle\nWesley too, right?”"
      },
      {
        "paragraph": "“Don’t meddle in the grown-ups’ affairs.”"
      },
      {
        "paragraph": "Catherine sighed. She did not want to use Suzie either, but she would do it as long as it counts."
      },
      {
        "paragraph": "Maybe it was because she had just slept with Shaun, and now she had to sleep with Wesley. After all,\nshe was a conservative person. She was not able to open herself up yet."
      },
      {
        "paragraph": "After dressing Suzie, she went to the bathroom to wash Suzie’s clothes."
      },
      {
        "paragraph": "Once she was done and came out, she saw Suzie sitting on the bed, holding Catherine’s phone and\nchatting with someone."
      },
      {
        "paragraph": "“Susan Jones, did you take my phone and dialed 000 again?” Catherine shouted nervously."
      },
      {
        "paragraph": "“No, Uncle Shaun called, and I picked up. ” Suzie passed the phone to her."
      },
      {
        "paragraph": "Catherine took the phone and went to the balcony. When she lifted the phone to her ear, there was no\nsound from the other side of the phone."
      },
      {
        "paragraph": "She almost thought the person had hung up. She took a look at her phone and noticed that the call was\nstill connected. “Shaun, I heard you got hurt. In that case, let Suzie stay with me temporarily.”"
      },
      {
        "paragraph": "“Suzie can’t keep staying with you, ” Shaun said dryly. “Did Suzie… ask about her dad?”"
      },
      {
        "paragraph": "Catherine was stunned for a moment. Then, she realized the ‘Dad’ Shaun was referring to was Liam. “Of\ncourse she did. She asks every single day. I told her the truth that Liam was temporarily missing. She\ncried pretty sadly.”"
      },
      {
        "paragraph": "“How could you… be so straightforward about it with Suzie?” Shaun was anxious. “You… You didn’t tell\nher that Liam went missing only after I beat him up, right?”"
      },
      {
        "paragraph": "“Are you afraid Suzie will hate you?” Catherine sneered."
      },
      {
        "paragraph": "After a moment of silence, Shaun said, “No matter what, I’m largely responsible for Liam’s\ndisappearance. From now on, I’ll treat Suzie like my own daughter. I won’t remarry or have kids. She’ll be\nmy only daughter.”"
      }
    ]
  },
  {
    "title": "Chapter 1024 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun had thought it through. He did not know if he could be cured or not anyway, so he could not\npossibly find other women too. As such, he would just raise Liam’s daughter from now on."
      },
      {
        "paragraph": "Firstly, it was to compensate Liam."
      },
      {
        "paragraph": "Secondly, he liked Suzie a lot too. Since Suzie had lost both her parents, he was willing to take up the\nresponsibility of being her father, even though she was not his biological daughter."
      },
      {
        "paragraph": "Catherine was stunned to hear him."
      },
      {
        "paragraph": "Hearing those words coming out from Shaun’s mouth was quite… unbelievable."
      },
      {
        "paragraph": "She knew that no matter whether it was toward her or Sarah in the past, Shaun was the type who would\ncling on and refuse to let go. His obsession with love was slightly abnormal too."
      },
      {
        "paragraph": "Hence, it was very astonishing to hear him say he would not remarry or have children all of a sudden."
      },
      {
        "paragraph": "Even if Hill Corporation was done for, he did not need to be so discouraged and down."
      },
      {
        "paragraph": "He was a bit different from the Shaun she knew."
      },
      {
        "paragraph": "“Let’s discuss this only after you’ve solved the lawsuit,” Catherine muttered."
      },
      {
        "paragraph": "“Cathy…” Shaun suddenly called her name softly."
      },
      {
        "paragraph": "Catherine felt uncomfortable with him saying that. How could she respond when his tone was so gentle,\nhoarse, and delicate?"
      },
      {
        "paragraph": "“Be careful of Wesley.” Shaun reminded her, “He’s not as simple as you think.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine’s pretty face darkened immediately. “Do I need you to remind me? Would Wesley come this far\nif he was simple? Shaun, if you want to badmouth my husband, please shut up.”"
      },
      {
        "paragraph": "My husband…"
      },
      {
        "paragraph": "Those two words were like needles pricking Shaun’s heart."
      },
      {
        "paragraph": "He really wanted to yell and ask her not to say those words. However, when he thought of his body, he\nno longer had the confidence to give her happiness."
      },
      {
        "paragraph": "“I’m not purposely trying to drive a wedge between the both of you. I’m just worried that Wesley harbors\nhatred toward you and wants to get revenge on you.”"
      },
      {
        "paragraph": "“Are you crazy?” Shaun had made Catherine infuriated. “He hasn’t even had enough time to love me.\nHow can he possibly hate me? You, on the other hand, keep driving a wedge between us. You"
      },
      {
        "paragraph": "desperately want us to get divorced, don’t you? Let me tell you this. Even if I get divorced, I won’t\nchoose you.”"
      },
      {
        "paragraph": "Shaun acted as if he did not hear her. Instead, he continued saying, “I’ll send you a video. It’s a video I\ntook the night we held our wedding on the island and consummated it. I sent the video to Wesley that\nnight.”"
      },
      {
        "paragraph": "Catherine’s mind suddenly felt as if it had exploded, and her body trembled. “It can’t possibly be… that\nkind of video, right?”"
      },
      {
        "paragraph": "“… You’ll know when you see it, ” Shaun said in a low voice. “It’s impossible for any other man not to\nmind. If Wesley cares, being jealous is very normal. However, if he didn’t mention even a word about it\nand acts big-hearted and tolerant, you must be careful. After all, people who can tolerate this kind o f\nthing are terrifying.”"
      },
      {
        "paragraph": "“ Shaun, you b*stard.” Catherine’s eyes reddened from anger. “How dare you record a video that night?\nYou’re too much. You’re shameless. I’ll never forgive you.”"
      },
      {
        "paragraph": "“Never mind. I knew from the start that you wouldn’t forgive me. I just wanted to remind you. I don’t wish\nfor you to be like my mom. She got cheated for more than 20 years. She always thought she got married\nto her childhood sweetheart, who was infatuated with her, when in fact, it was all an intricate deception\nthat the other person had set up."
      },
      {
        "paragraph": "“Wesley is definitely not that kind of person, and I’m not your mom either. I don’t have a filthy rich family\nbehind my back. What possibly can he covet?”"
      },
      {
        "paragraph": "“He covets your feelings. After you fall in love with him, he can get revenge on you and trample on you\nall he wants.”"
      },
      {
        "paragraph": "Shaun’s words made Catherine shiver. “Shaun, I won’t fall for your tricks.” Then, she hung up."
      },
      {
        "paragraph": "After returning to the room, she accompanied Suzie to sleep, but she could not calm down at all."
      }
    ]
  },
  {
    "title": "Chapter 1025 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine only picked up her phone again after Suzie fell asleep. Shaun had sent her a video."
      },
      {
        "paragraph": "She put on earphones, and as she watched the video, her face flushed red. She found it unbelievable."
      },
      {
        "paragraph": "In the video, the lights were not on, but the moonlight shone through the windows."
      },
      {
        "paragraph": "She and Shaun were covered by the blanket. Shaun’s upper body was exposed, and her hands… were\ncircled around his neck tightly."
      },
      {
        "paragraph": "Not only that but her voice… It actually sounded as if she… really enjoyed it."
      },
      {
        "paragraph": "She always thought she was in despair that night. Yet, the video made it look like she and Shaun were\nlovey-dovey, and that she was willing."
      },
      {
        "paragraph": "Was that the video Wesley watched?"
      },
      {
        "paragraph": "She was so embarrassed that she desperately wanted to hit herself. However, once she calmed down\nand thought about it, no man could possibly stay indifferent after watching that video."
      },
      {
        "paragraph": "Wesley did not mention a word about it after she returned. He even said it was fine as long as it was\ndone against her will."
      },
      {
        "paragraph": "Thinking back at it now, Wesley was so big-hearted that it made her feel uneasy."
      },
      {
        "paragraph": "If she put herself in Wesley’s shoes, she would overthink and feel contempt when she saw her wife being\nintimate with another man on their wedding night. Even so, he might act as if nothing happened because\nhe was too deeply and blindly in love."
      },
      {
        "paragraph": "If it were the latter, it would be Catherine’s luck. However, if it were the former…"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "It was supposed to be summer, but she felt very, very cold."
      },
      {
        "paragraph": "The next day, Catherine brought Lucas and Suzie downstairs."
      },
      {
        "paragraph": "Wesley and Joel were having a pleasant chat in the dining room."
      },
      {
        "paragraph": "The warm sunlight shone through the full-length windows and fell on Wesley’s friendly face. A hint of\nconfusion flashed through Catherine’s eyes until Wesley called her."
      },
      {
        "paragraph": "“Cathy, have some breakfast.”"
      },
      {
        "paragraph": "Wesley stood up and served breakfast for both of them. He even thoughtfully put Lucas and Suzie’s\nfavorite breakfast on their plate. Those attentive and gentle actions made Catherine feel lost."
      },
      {
        "paragraph": "Could a person really act as if nothing happened at all?"
      },
      {
        "paragraph": "After sending the two children to preschool, Catherine drove to Hudson Corporation."
      },
      {
        "paragraph": "At 10:00 a.m., Logan came. “Are there any arrangements since you called me over?”"
      },
      {
        "paragraph": "“How is your drug rehabilitation going?” Catherine asked out of concern."
      },
      {
        "paragraph": "“It’s much better. I can basically control myself now.” Logan made himself at home as he sat comfortably\non the sofa and poured himself some coffee."
      },
      {
        "paragraph": "Catherine glanced at his finger that was chopped- off, with mixed feelings. “Is your finger okay?”"
      },
      {
        "paragraph": "“It’s fine. It’s just a chopped off finger. It’s not like I can’t use it anymore.” Logan had gone through a lot of\nhardships when he was young. Hence, these things were no longer a big issue to him. “By the way, I’ve\nbeen checking the place where Liam went missing thoroughly for the past few days. I think Liam may\nalready be dead.”"
      },
      {
        "paragraph": "“ I’ve guessed it too.” Catherine’s lips trembled. “I just don’t understand who would want to kill him?\nBesides, how could a big, living person disappear without a trace?”"
      },
      {
        "paragraph": "“Actually… Have you ever thought that something happened internally in Liona?” Logan suddenly said,\n“Liona’s members threw Liam at a remote alley, but I checked it. Barely any people would pass by that\nplace."
      },
      {
        "paragraph": "“When Austin and I rushed over within an hour, there was still a pool of blood on the floor. It meant Liam\nwas gravely injured. There were signs of dragging on the floor too.”"
      }
    ]
  },
  {
    "title": "Chapter 1026 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine understood it quickly. “You’re saying that after Liona’s members threw Liam there, another car\ncame and dragged Liam into it?”"
      },
      {
        "paragraph": "Logan nodded. “There’s a big possibility that someone was watching from Liona’s door from the start.\nAnother possibility is that an internal member of Liona leaked the information.”"
      },
      {
        "paragraph": "Catherine’s heart trembled."
      },
      {
        "paragraph": "However, after giving it some thought, she totally agreed with Logan’s analysis."
      },
      {
        "paragraph": "“Actually, I didn’t quite believe Liam would leak Hill Corporation’s data. He shouldn’t be that kind of\nperson. I suspect there’s a spy in Liona, and it’s the same person as the one who leaked the data."
      },
      {
        "paragraph": "“Moreover, Liona is the organization that Shaun trusts the most. When the microchip was developed, the\nfirst thing he must’ve done was let Liona’s important members guard the laboratory. It would not be\nimpossible for that person to steal the data and find the right timing to frame Liam.”"
      },
      {
        "paragraph": "After she said that, Logan glanced with admiration. “Boss, I realize it’s a shame you didn’t become a\npolice officer.”"
      },
      {
        "paragraph": "“This is just my guess. There’s no evidence.” Catherine rolled her eyes at him. “But the one who could do\nall of these should be Shaun’s most trusted subordinate. I reckon Shaun wouldn’t suspect that person\ntoo. Forget it. If it weren’t for Liam, I wouldn’t be interested in this matter at all.”"
      },
      {
        "paragraph": "“That’s right. In order to investigate who the spy is, we have to enter Liona. With your current identity…"
      },
      {
        "paragraph": "Wesley will surely be uncomfortable with it,” Logan said. “Let the Hill family and the Campos family\ninvestigate this matter.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Speaking about Wesley…"
      },
      {
        "paragraph": "Catherine frowned. “Let me ask you something. If it were you, what would your reaction be if you saw a\nvideo of your wife together with another man during your wedding night?”"
      },
      {
        "paragraph": "After she spoke, she saw Logan’s strange gaze. She immediately blushed and glared at him. “That’s\nright. That person is me.”"
      },
      {
        "paragraph": "“Ha, Boss, you’re truly extraordinary.” Logan laughed. “If it were me, I’d surely be very upset and have\nthe urge to kill that person.”"
      },
      {
        "paragraph": "“You don’t hate that woman?” “It depends on what video it is. If it were a video where the woman was\nresisting strongly, I would feel heartbroken and remorseful. But… if it were a video where the woman was\nwilling, I would probably hate that woman and even feel she was two-faced. In fact…”"
      },
      {
        "paragraph": "“In fact what?” Catherine asked nervously. “She’s… quite sl*tty.” Logan was awkward to say the truth.\n“Anyway, I’ll surely teach that woman a lesson.”"
      },
      {
        "paragraph": "A chill ran down Catherine’s back. “Um… Logan, do me a favor and investigate Wesley. Be careful not to\nalarm anybody.”"
      },
      {
        "paragraph": "“It can’t be.” Logan was shocked. “Go.” Catherine gave him a sidelong glance."
      },
      {
        "paragraph": "Shaun was hospitalized for five days."
      },
      {
        "paragraph": "He only found out that the Hill family manor was sold after he was discharged. By then, Lea had brought\nOld Master Hill and Old Madam Hill to live in a villa under the Hill family’s business."
      },
      {
        "paragraph": "Although it could not compare to the Hill family’s manor at all, the neighborhood’s management was\nexcellent, and the courtyard was clean."
      },
      {
        "paragraph": "When Shaun went over, Old Madam Hill was sunbathing with Old Master Hill on the lawn."
      },
      {
        "paragraph": "“Grandpa, are you feeling better?” Shaun walked over and looked at Old Master Hill with guilt. Old\nMaster Hill let out a long sigh. “My legs aren’t that well anymore. I didn’t think that I would live most of my\nlife in glory only to witness Hill Corporation’s downfall when I turned old.”"
      },
      {
        "paragraph": "“Forget it. This is all fate, but this is quite good too.” Old Madam Hill had come around to the situation.\n“We don’t have to worry about our meals. Except for being looked down on by others, we’re still better off\nthan most people.”"
      },
      {
        "paragraph": "Shaun did not expect Old Madam Hill would get over it so quickly. “Grandpa, I’m sorry. I’m largely\nresponsible for Hill Corporation’s current situation. I didn’t manage it properly…”"
      }
    ]
  },
  {
    "title": "Chapter 1027 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“You’re indeed responsible for it.” Old Master Hill glared at Shaun. “You should’ve been present at Hill\nCorporation personally. If it weren’t for you bringing Catherine overseas, other people wouldn’t have had\nthe chance to sneak in."
      },
      {
        "paragraph": "“But we can’t put all the blame on you either. It’s all fate. You and your mom are actually quite similar.\nYou both like to drive yourselves into a blind alley and don’t know how to treasure things that are\nsupposed to be treasured. Your dad treated her so well back then, but she looked down on him. She kept\nthinking that Mason was deeply in love with her.”"
      },
      {
        "paragraph": "Dad…"
      },
      {
        "paragraph": "That word had been unfamiliar to Shaun for a long time."
      },
      {
        "paragraph": "He was in a daze for a moment until he heard Old Madam Hill saying, “There has been no news of your\ndad for tens of years. I reckon he has already married someone with children overseas.”"
      },
      {
        "paragraph": "Just as she finished speaking, a black sedan drove in. Lea got down the car. “What were you guys\ntalking about?”"
      },
      {
        "paragraph": "Old Madam Hill said bluntly, “We were talking about Brennan.”"
      },
      {
        "paragraph": "Lea was stunned. That person had left her world for so long that she had almost forgotten that part of her\nlife."
      },
      {
        "paragraph": "“If you listened to us back then and stayed with Brennan, there wouldn’t be so much trouble now,” Old\nMaster Hill said. “You even dared say that Brennan coveted the Hill family’s wealth. You’re blind.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Lea felt uncomfortable. “That’s uncertain either. Maybe he’s the same type of person as Mason. Dad,\nMom, stop talking about this matter. Shaun, you came back at the right time. I’ve received information\nthat Garson Corporation’s director has come back to Australia discreetly. If we can collaborate with\nGarson Corporation and temporarily bring in their company’s advanced equipment, Hill Electronics might\nbe able to overcome this difficulty.” \n“Garson Corporation?” Shaun was taken aback.\nHe recalled that the company was a mega- corporation in Europe that had not been established for a\nlong time. It had only been 20 years."
      },
      {
        "paragraph": "Garson Corporation kept a low profile too. The person in power behind the scenes was mysterious and\ndid not take part in charts of the wealthiest people in the world. However, no one dared to underestimate\nthat company. Apparently, Garson Corporation had offices in more than loo countries."
      },
      {
        "paragraph": "“Shaun, come to the company tomorrow, and let’s try to meet Garson Corporation’s director.” Lea sighed."
      },
      {
        "paragraph": "Shaun went silent."
      },
      {
        "paragraph": "At night, after dinner, Shaun left the villa on the excuse of going for a walk."
      },
      {
        "paragraph": "His body was in a bad state, and he felt like he had lost all his motivation."
      },
      {
        "paragraph": "So what if he did rise again in the future? He was no longer a complete person. In this lifetime, he was\ndestined to have no wife nor children. He could only be alone."
      },
      {
        "paragraph": "However, everyone in the Hill family was counting on him. He had no right to back down."
      },
      {
        "paragraph": "Perhaps he was too depressed, so he went into a bar when he spotted one."
      },
      {
        "paragraph": "He ordered a lot of drinks. He downed glass after glass of alcohol as if the pain in his heart could only be\nlessened if he was drunk."
      },
      {
        "paragraph": "In a private room on the second floor, when Thomas came out to go to the bathroom, his eyes lit up\nwhen he saw Shaun, who was drinking downstairs."
      },
      {
        "paragraph": "He called Sarah immediately. “ Sarah, guess who I met at the bar? It’s Shaun. Tsk tsk, he’s really shabby\nnow. He’s wearing such a cheap T-shirt and drinking his sorrows away.”"
      },
      {
        "paragraph": "“Him?” The corners of Sarah’s mouth lifted."
      },
      {
        "paragraph": "Shaun was one whom she loved yet hated him at the same time. It was a shame that man did not know\nto cherish her in the past."
      },
      {
        "paragraph": "However, Shaun was now so shabby that he was not good enough for her anymore, and she would\nnever forget the humiliation back then. “Since you met him, find someone to entertain him properly.”"
      }
    ]
  },
  {
    "title": "Chapter 1028 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Thomas was startled, but excitement then followed. \n“Great. I’ve been tolerating his temper for so many years. F*ck, I’ve had enough since a long time ago.\nBut Young Master Snow and Shaun are good friends. Will Young Master Snow give me a hard time\nlater?”"
      },
      {
        "paragraph": "He went into hiding some time ago and only came out just two days ago. If he offended Rodney again,\nhe might really have to face the consequences."
      },
      {
        "paragraph": "“Fool, Shaun is usually so high and mighty, he must’ve offended many people. Sometimes, there’s no\nneed to do it yourself. Just move your lips, and there will naturally be someone to teach him a lesson, ”\nSarah reminded him."
      },
      {
        "paragraph": "Thomas understood in an instant. “Okay. I got it.” \nHe knew full well who in the whole of Canberra was dissatisfied with Shaun."
      },
      {
        "paragraph": "Thomas thought of an idea and dialed a number. “ Simon, where are you right now?”"
      },
      {
        "paragraph": "Shaun left a wad of cash drunkenly before he staggered out of the bar."
      },
      {
        "paragraph": "In a blur, it seemed as if he had bumped into someone."
      },
      {
        "paragraph": "That person pushed him hard, and Shaun, whose legs were weak, fell into a puddle of mud."
      },
      {
        "paragraph": "“Haha, look. This is the once arrogant Shaun. Back then, Young Master Hill was so haughty. He always\nignored us when we talked to him. Everyone was of similar age, yet he always looked down on us.”\nYoung Master Kelly pointed at Shaun and laughed mockingly."
      },
      {
        "paragraph": "The subordinates behind him followed and laughed as well."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Simon, now that the Hill family is in dire states, Shaun can’t compare to you at all.” Someone flattered\nhim."
      },
      {
        "paragraph": "“That’s right. I thought I’d never in my life have the chance to teach this person a lesson.”"
      },
      {
        "paragraph": "Young Master Kelly stepped on Shaun’s chest. His face was smug. “Shaun, do you still remember who I\nam?”"
      },
      {
        "paragraph": "“Get lost,” Shaun said as he gasped for air. \nNot only did his brain feel numb from being drunk, but he also had double vision."
      },
      {
        "paragraph": "“Haha, you don’t know me, but I recognize you.” Young Master Kelly gritted his teeth and said, “ Back\nthen, you broke my leg on the yacht.”"
      },
      {
        "paragraph": "Shaun shook his head so hard that it hurt. He did not know what that person was saying."
      },
      {
        "paragraph": "“You, Young Master Hill, are forgetful because you’re a busy man. It’s okay. I can remind you of it. Three\nyears ago, we did nothing but watch Catherine dance and touched her a bit on Rodney’s yacht. You were\nso cocky that you had someone break our legs. You even put out a word saying if anyone dared to\nexpose it, you’d make our family disappear.”"
      },
      {
        "paragraph": "Young Master Kelly pressed his foot harder onto Shaun’s chest. “You were so cocky that time. You\nmust’ve never thought that this day would come for you. I’ve held back that anger for a few years."
      },
      {
        "paragraph": "Today, I’ll pay you back in the exact same way you broke my leg three years ago.”"
      },
      {
        "paragraph": "After he spoke, he stepped on Shaun’s kneecap hard."
      },
      {
        "paragraph": "Shaun’s face paled from the pain. Although he was drunk, he still flung Young Master Kelly away\ninstinctively."
      },
      {
        "paragraph": "Young Master Kelly, who lost his balance, was furious. He waved his hand. “All of you, charge. I must\nbeat him up until he’s crippled tonight.”"
      },
      {
        "paragraph": "He led more than ten people and surrounded Shaun in an instant."
      },
      {
        "paragraph": "Shaun was drunk, so he could not see clearly. In a split second, he was kicked to the ground,\nsurrounded and beaten up by more than ten people."
      },
      {
        "paragraph": "Initially, he could still fight back."
      },
      {
        "paragraph": "Afterward, for some reason, he did not want to move. He just let them beat him up."
      },
      {
        "paragraph": "They could hit him all they want. His life was already meaningless anyway."
      },
      {
        "paragraph": "Thinking back, he was deceived by Sarah. She was obviously a deceitful woman. It was her lies that\nmade him lose his marriage and children."
      },
      {
        "paragraph": "Now, the woman he loved was another person’s wife."
      },
      {
        "paragraph": "Hill Corporation met its downfall in his hands, and even Liam’s death was related to him. What was more\ntragic was as a man, he… was incapable of s*x anymore."
      },
      {
        "paragraph": "Haha."
      },
      {
        "paragraph": "On the road, a sports car stopped in front of a traffic light."
      },
      {
        "paragraph": "That night was the birthday of Hudson Corporation’s general manager. As the director, Catherine booked\na private room and invited the company’s senior management team to celebrate the general manager’s\nbirthday together."
      },
      {
        "paragraph": "It was not until just now that she came out from the karaoke."
      },
      {
        "paragraph": "When the traffic light turned green, she drove her car ahead and suddenly noticed someone fighting by\nthe road from the corner of her eye."
      },
      {
        "paragraph": "She slowed down and took a look. It seemed like a group of people was hitting one person."
      },
      {
        "paragraph": "With a frown, she stepped on the brakes immediately."
      },
      {
        "paragraph": "If it were the old her, she would have just reported it to the police. However, her self-defense skills now\nwere quite good, so she was willing to save someone if she could."
      },
      {
        "paragraph": "Nevertheless, when she walked over, she found the person who was being beaten up familiar. Although\nthat person was on the ground and covered with mud all over the face, shirt, and pants, she could still\nrecognize Shaun from that heavily wounded face."
      },
      {
        "paragraph": "She could not believe that Shaun would be reduced to being beaten up on the street."
      },
      {
        "paragraph": "Was he not a good fighter? These people were supposed to be just a piece of cake to him."
      },
      {
        "paragraph": "The current Shaun looked degraded, as if he had completely lost faith in life."
      },
      {
        "paragraph": "“Stop.”"
      },
      {
        "paragraph": "When Catherine saw a guy in a floral shirt taking a steel bar and was about to hit Shaun’s leg, she\nimmediately went over and kicked that man away."
      },
      {
        "paragraph": "“You have a death wish.” The man in the floral shirt raised his head. As soon as he saw it was Catherine,\nhe smiled evilly. “It’s you, Catherine Jones. I heard you’re married now, yet you still rush here to save\nShaun. You’re not having an affair with Shaun, are you?”"
      },
      {
        "paragraph": "“Who are you?” Catherine thought the person looked familiar, like she had seen him somewhere before."
      },
      {
        "paragraph": "“You don’t recognize me?” That man scratched his neck and grinned. “Three years ago, on Rodney’s\nyacht, you danced in front of us. Tsk. That face and that body. To this day, I still haven’t forgotten it. I\neven rewarded l000 dollars to you.”"
      },
      {
        "paragraph": "“ It’s you! ” Catherine suddenly recalled it, and her pretty face turned unpleasant."
      },
      {
        "paragraph": "That year, she had just arrived in Canberra and was greatly troubled by that bunch of young masters."
      },
      {
        "paragraph": "“Ha, you finally remember. My last name is Kelly, and my name is Simon. Simon Kelly.” As Simon smiled,\nhis expression gradually turned grim. “Since you’re Joel’s daughter, you better leave quickly. Otherwise,\ndon’t blame me for being rude.”"
      },
      {
        "paragraph": "“In what way are you going to be rude?” Catherine laughed. “Who do you think you are? Among\nCanberra’s wealthy families, you, the Kelly family, are so behind in the rankings, yet you dare speak with\nsuch arrogance in front of me. You’re nothing a t all in my eyes.”"
      },
      {
        "paragraph": "Simon’s expression changed. “Fine. If you want to do it the hard way, don’t blame me for being rude.”"
      },
      {
        "paragraph": "With a wave of his hand, more than ten people surrounded them."
      },
      {
        "paragraph": "Catherine clenched her fists and defeated every one of them with just a few movements."
      },
      {
        "paragraph": "Seeing that the situation was not right, he turned around and tried to flee."
      },
      {
        "paragraph": "Catherine rolled the steel bar beneath her, picked it up with her foot, and caught it with her hands."
      },
      {
        "paragraph": "Then, she threw it at Simon’s back."
      },
      {
        "paragraph": "Simon fell flat on his face. Catherine laughed as she walked over. “Actually, I almost forgot about you,\nbut you reminded me just now. Three years ago, you did take a lot of advantage on me.”"
      }
    ]
  },
  {
    "title": "Chapter 1029 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“What… What are you going to do?” Simon’s legs trembled in fear. His arrogance from before was\ncompletely gone. “Eldest Young Lady Jones, please let me go. I was blind. I didn’t know you had such a\npowerful background back then. Besides, Shaun even broke my leg that time. It took me several months\nof lying in bed to recover.”"
      },
      {
        "paragraph": "“But that’s not what you said just now. You were quite cocky.” Catherine poked his face with the steel rod\nand smiled innocently. “You even said… you still remember my body until this day. In that case, should I\ndance for you again?”"
      },
      {
        "paragraph": "“Don’t. I’ve f*cking forgot all of it.” Simon was incredibly helpless. “Sister, Boss, you’re a broad- minded\nperson, so please don’t fuss over this.”"
      },
      {
        "paragraph": "“I can’t do that. Since you still remember incidents from three years ago, it means that you’re a petty\nperson. Who knows if you’ll get revenge on me afterward?”"
      },
      {
        "paragraph": "“I definitely won’t dare to get revenge on you. I wouldn’t dare.” Simon did not even dare to breathe loudly.\nHe never thought that the woman he could bully and tease all he wanted would be able to defeat more\nthan ten fighters."
      },
      {
        "paragraph": "F*ck. How did he provoke that woman?"
      },
      {
        "paragraph": "No, she was not a woman at all. No woman was as abnormal as her."
      },
      {
        "paragraph": "“But hearing you talk about the embarrassing things of the past, I just feel… very uncomfortable.”\nCatherine crouched in front of him. “Say, what should I do?”"
      },
      {
        "paragraph": "Simon was speechless."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "How did he know what to do? Could he take a dump?"
      },
      {
        "paragraph": "“How about this? I got taken advantage of back then, so today… I’ll strip you naked. Is that okay?”\nCatherine made an expression which said ‘I’m already very merciful’."
      },
      {
        "paragraph": "“…Okay.” Simon was on the verge of crying. However, it was better than being beaten up violently. “Take\noff my clothes then.”"
      },
      {
        "paragraph": "“You want me to strip you on the streets?” Catherine rolled her eyes. “Ugh, I’m not some female pervert.\nTake it off yourself.”"
      },
      {
        "paragraph": "“Okay, I’ll strip. It’s my honor to be seen[email protected]by the prettiest woman in Canberra,” Simon said\npainstakingly."
      },
      {
        "paragraph": "“The prettiest woman in Canberra?” Catherine raised her eyebrows."
      },
      {
        "paragraph": "“That’s right.” Simon nodded hard. “We, a group of young masters from wealthy families in Canberra,\nparty together frequently. Everyone acknowledges you as the prettiest woman in Canberra.”"
      },
      {
        "paragraph": "“A bunch of useless sc*mbags.” After rolling her eyes, Catherine looked toward Shaun, who was\nsprawled in the puddle of mud. She frowned. “How much did he drink?”"
      },
      {
        "paragraph": "“How would I know? Anyway, he’s pretty drunk,” Simon explained sheepishly. “If I didn’t know he was\ndrunk, I wouldn’t dare attack him. Who doesn’t know about Shaun’s skills?”"
      },
      {
        "paragraph": "“You don’t know?” Catherine’s brows moved. “ Then, how did you know that he drank tonight? Did you\nbump into him, or did someone tell you about it.?"
      },
      {
        "paragraph": "Simon was taken aback. He looked at her admiringly. “Your senses are keen. It was Thomas who\ninformed me.”"
      },
      {
        "paragraph": "“Thomas?” Catherine was astonished. Thomas must have deliberately used Simon to beat Shaun."
      },
      {
        "paragraph": "Never mind if it were other people, but Shaun helped Thomas escape imprisonment time and time again\nfor the past few years. It was not expected of Thomas to be grateful, but biting the hands that fed him\nwas too shameless."
      },
      {
        "paragraph": "“That’s right. Thomas suddenly invited me for a drink. That dude… I looked down on him, but his sister\ngot a lot of Shaun’s wealth and is quite rich, so I gave him my location. As he talked, he mentioned that\nhe saw Shaun drinking away his sorrows at the bar. That was why I started having devious thoughts.”"
      },
      {
        "paragraph": "Simon caught on to something at that moment. “Did that guy do it on purpose?”"
      },
      {
        "paragraph": "“Of course he did because he wanted to beat Shaun up too. However, Shaun and Rodney are brothers.\nHe was afraid that Rodney would give him a hard time if this got out, so he got you to do the dirty work. ”\nCatherine understood quickly. “I’ll give you a chance so that you don’t have to strip.”"
      },
      {
        "paragraph": "“What chance?” Simon’s eyes lit up. Who would want to take off their clothes? He would be mistaken as\na lunatic and get scolded by others."
      },
      {
        "paragraph": "“Reveal the fact that you hit Shaun tonight and say that it was Thomas who ordered you to do so,”\nCatherine said."
      }
    ]
  },
  {
    "title": "Chapter 1030 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“But… will I get into trouble with Chester?” Simon felt nervous."
      },
      {
        "paragraph": "Catherine was speechless. “You dare to hit him, yet you are afraid of getting into trouble? Don’t you know\nto say that it was Thomas who instigated you?”"
      },
      {
        "paragraph": "“Yes, yes, you’re smart.” Simon asked carefully, “So can I leave now?”"
      },
      {
        "paragraph": "“Get lost. By the way, if you dare fool me, watch out as I might look for you.” Catherine hit the ground\nwith the steel bar."
      },
      {
        "paragraph": "“I wouldn’t dare.” Simon shuddered. Then, he took his men and fled in a hurry."
      },
      {
        "paragraph": "Only then did Catherine go to Shaun’s side. That man was sprawled in a puddle of mud. His white T-\nshirt was soaked in mud water, and his handsome face was covered in wounds. At that moment, his\neyes were closed, and he looked lifeless."
      },
      {
        "paragraph": "If it were not for the familiar features on his face, Catherine would have doubted if he was Shaun."
      },
      {
        "paragraph": "The Shaun she knew was elegant and noble. He would even style his short, black hair tidily, and there\nwas never a wrinkle on his suit."
      },
      {
        "paragraph": "What made him become like this?"
      },
      {
        "paragraph": "Was it because Hill Corporation had fallen?"
      },
      {
        "paragraph": "Shaun was not the type of person who gave up and compromised so easily."
      },
      {
        "paragraph": "“Shaun, wake up.” Catherine lowered her head and pushed him."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun, who was blurry from the pain, opened his eyes. He could not see the woman in front of him\nclearly, but the faint fragrance wafting from the woman was very familiar. Even the woman’s voice was\nsimilar to hers."
      },
      {
        "paragraph": "“Cathy… Why are you here?” Shaun smiled weakly a t Catherine. He thought he was dreaming because\nshe would only come to him in his dreams."
      },
      {
        "paragraph": "Catherine’s throat moved. She felt a little bad. In the end, she bent over and helped him up."
      },
      {
        "paragraph": "He staggered and pushed Catherine’s hand away while burping. “Don’t… Don’t touch me. I’m dirty. Don’t\nget your clothes… dirty.”"
      },
      {
        "paragraph": "“Shaun, let me send you back.” Catherine had to go forward and grab his hand."
      },
      {
        "paragraph": "Only then did she realize there were wounds on his hand too, and it was bleeding."
      },
      {
        "paragraph": "She suddenly felt a mix of emotions."
      },
      {
        "paragraph": "“I… I don’t need you to send me. I can walk by myself.” Shaun flung her hand away before he turned\naround and stumbled. It was as if he was going to fall any time."
      },
      {
        "paragraph": "Catherine looked at him for a while, but she could not watch on anymore and forcefully yanked him over.\nShe put him in the backseat of her car."
      },
      {
        "paragraph": "As she drove, she glanced behind through the rearview mirror from time to time. That man was lying on\nhis back in the backseat. Once he got in the car, he fell asleep and lost consciousness."
      },
      {
        "paragraph": "After driving for more than ten minutes, Catherine spotted a pharmacy, where she got down from the car\nand bought a bottle of disinfectant and medicine. Then, she drove him to a bungalow where she once\nwent in the past."
      },
      {
        "paragraph": "She used Shaun’s fingerprint to unlock the door. When they went in, she threw him on the sofa."
      },
      {
        "paragraph": "Initially, she wanted to turn around and leave. Yet, as she glanced at the medicine in her hands, she\nkind-heartedly fetched a basin of water and helped to take off his dirty clothes."
      },
      {
        "paragraph": "When it came to his pants, she initially did not want to change them for him. However, after considering\nthat the inside was wet too, she simply took everything off."
      }
    ]
  },
  {
    "title": "Chapter 1031 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "When Catherine helped him with his pants, she was baffled to notice that part of his body was wrapped\nin gauze."
      },
      {
        "paragraph": "She swallowed her saliva. It seemed like she had discovered an unbelievable matter."
      },
      {
        "paragraph": "Why was that part of his body wrapped in gauze? Could it possibly be… crippled?"
      },
      {
        "paragraph": "She could not resist probing it brazenly, but it really did not react at all."
      },
      {
        "paragraph": "He was not like that in the past."
      },
      {
        "paragraph": "Her mind went blank for a few seconds before she gasped. Why would that part become crippled for no\nreason?"
      },
      {
        "paragraph": "Could this be why he was degraded, drunk, and lifeless?"
      },
      {
        "paragraph": "It seemed understandable. To a man, this would be a big deal, especially for a man like him who\nprioritized his needs a lot."
      },
      {
        "paragraph": "No wonder he suddenly said he would not marry or have kids in this life that day."
      },
      {
        "paragraph": "There was indeed no way for him to marry or have children in his state. He was bound to… end up\nalone."
      },
      {
        "paragraph": "Catherine looked at his face, which was covered in wounds. Strangely… she felt conflicted."
      },
      {
        "paragraph": "She should be so happy about it and setting off firecrackers to celebrate it. This was his retribution. It\nwas his fault for making her so miserable."
      },
      {
        "paragraph": "However, she felt a bit sour instead."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "That was why a person should not do too many bad deeds. After all, what comes around goes around."
      },
      {
        "paragraph": "Catherine sighed. She wiped him down, disinfected his wounds, and applied some medicine on them\nbefore she dressed him in clothes. As she was leaving, she took a blanket and covered him with it. After\nthat, she closed the door lightly and left."
      },
      {
        "paragraph": "Then, she sat in her car in the parking lot downstairs for a long time."
      },
      {
        "paragraph": "She found the whole thing unbelievable."
      },
      {
        "paragraph": "The next day, Shaun woke up from a hangover to his ringing phone."
      },
      {
        "paragraph": "He opened his eyes. When he saw his phone on the table, he picked up the call. Chester’s cool voice\ncame through. “Shaun, you got beaten up by Simon?”"
      },
      {
        "paragraph": "Shaun was stunned for a while, and only then he realized his body was aching. He recalled clips of him\ngetting drunk at the bar last night. After that… it seemed like he got hit once he exited the bar. The\nperson who hit him said many things, but he could not remember who that person was."
      },
      {
        "paragraph": "At that moment, he thought the person could hit him all he wanted. He did not feel like resisting anyway.\nHe had no strength to hit someone."
      },
      {
        "paragraph": "“So the person who hit me last night was Simon,” Shaun muttered."
      },
      {
        "paragraph": "“You didn’t know?” Chester was speechless. “It’s a viral topic in Canberra now. This Simon, how dare he\nadd insult to the injury. Why didn’t we realize before that he was this kind of person?”"
      },
      {
        "paragraph": "“I drank too much last night. I don’ t remember.” Shaun pinched the middle of his brows, which was\naching. “When did I have a grudge with Simon?”"
      },
      {
        "paragraph": "“He must’ve been holding a grudge because you broke his leg three years ago. That b*stard,” Chester\nscolded."
      },
      {
        "paragraph": "“I broke his leg before?” Shaun was astonished and shocked. “Why don’t I remember?”"
      },
      {
        "paragraph": "“You’ve forgotten a lot of stuff these years.” Chester said, “Three years ago, Rodney wanted to help you\nteach Catherine a lesson, so he kidnapped Catherine onto a yacht. Then, he got Simon and a few others\nto watch her dance. When you rushed over and saw Catherine being forced to drink and bullied by them,\nyou were so angry that you broke many young masters’ legs on the yacht that night.”"
      },
      {
        "paragraph": "Shaun was confused. He had no memory of that incident at all. “In the past… I would do those things for\nCatherine?”"
      },
      {
        "paragraph": "“What else? It became a big issue later on. Those families even joined hands and boycotted you. The\nvideo of you asking someone to break their legs was even uploaded on the internet. You got scolded so\nbadly. Afterward, no one dared to circulate those videos due to your oppression. But if you look for it\ncarefully, you still can find it.”"
      },
      {
        "paragraph": "Chester hesitated for a moment and then scolded, “There’s something else. I heard some news from\nSimon’s side. It seems like it was Thomas who instigated Simon to bother you after seeing you drinking\nat the bar.”"
      },
      {
        "paragraph": "“Thomas?” Shaun’s expression instantly turned cold."
      },
      {
        "paragraph": "It was one thing for him to lose faith in life, but it did not mean he would let just anyone bully him,\nespecially Thomas. Shaun did his best to help Neeson Corporation all those years. If it were not for him\nhelping Thomas get out of trouble and fighting his lawsuits, Thomas would have gone to jail long ago."
      },
      {
        "paragraph": "Yet, Thomas instigated Simon to hit him?"
      }
    ]
  },
  {
    "title": "Chapter 1032 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Are you sure?” Shaun said coldly, “I don’t have any grudges with Thomas.”"
      },
      {
        "paragraph": "“Are you sure you don’t?” Chester reminded him."
      },
      {
        "paragraph": "“Are you talking about my breakup with Sarah?’ Shaun was astonished, but hostility then welled up in his\neyes."
      },
      {
        "paragraph": "He did not think he owed Sarah anything. After all, the Neeson siblings played so many tricks behind the\nscenes after he made up with Catherine back then."
      },
      {
        "paragraph": "Chester sighed. “I’m not sure. I can only say that Thomas has never been a good person to begin with.\nSomeone like him will only take your help for granted, but if you don’t, he’ll hate you in return.”"
      },
      {
        "paragraph": "“He did it on purpose.” Shaun quickly understood. “It wasn’t convenient for him to do it as he was afraid\nof offending you guys, so he instigated Simon to come over.”"
      },
      {
        "paragraph": "“I reckon that was the case. When he drugged Freya last time, Rodney wanted to teach him a lesson,\nbut he escaped overseas. I guess he came back thinking that Rodney’s anger has subsided, and it has\nbeen more than a month since that incident happened.” Chester said, “You’re my brother. I’ll stand up for\nyou on this matter.”"
      },
      {
        "paragraph": "“Mm.”"
      },
      {
        "paragraph": "Shaun’s mind was still in a mess. “By the way, how did I come back last night?”"
      },
      {
        "paragraph": "“How do I know? I only knew that you got beaten up this morning.”"
      },
      {
        "paragraph": "Shaun lowered his head. He suddenly noticed that medicine was applied on the back of his hand and his\nbody. Not only that but his clothes were changed as well."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "His expression changed drastically. After he hung up, he tugged his pants and had a look inside.\nDamn it. His underwear was changed too."
      },
      {
        "paragraph": "It meant that someone might have found him last night."
      },
      {
        "paragraph": "Who was it?"
      },
      {
        "paragraph": "He recalled dreaming about Catherine last night, and she was here."
      },
      {
        "paragraph": "That… should be impossible."
      },
      {
        "paragraph": "He shuddered and quickly sat up. Then, he ran to the security room and had the administrator pull out\nthe security footage. After watching it, his knees went weak."
      },
      {
        "paragraph": "It really was Catherine. She helped him change his clothes, so she surely must have noticed that part of\nhim was wrapped in gauze."
      },
      {
        "paragraph": "What was more tragic than having the woman he loved finding out that he was impotent?"
      },
      {
        "paragraph": "Shaun wanted to slap himself. Why did he go drinking last night?"
      },
      {
        "paragraph": "Great. Now, he could not even keep the last bit of his private secret. 9:00 a.m."
      },
      {
        "paragraph": "Wesley drove Catherine to the main entrance of Hudson Corporation. However, Catherine looked like\nshe was still in a daze, so he reminded her in a low voice, “We’ve arrived.”"
      },
      {
        "paragraph": "“…Oh.” Catherine came back to her senses and unbuckled her seat belt. “Be careful on your own.”"
      },
      {
        "paragraph": "“Mm.” Wesley nodded. He suddenly stared into her eyes and said, “Last night… It looks like Shaun was\nbeaten up.”"
      },
      {
        "paragraph": "“Whatever. I’m not the one who had someone beat him up anyway.” Catherine opened the door, feeling a\nlittle guilty. “I’m heading up.”"
      },
      {
        "paragraph": "After seeing Catherine leave from behind, Wesley remembered the phone call he got that morning."
      },
      {
        "paragraph": "“Last night, Shaun was beaten up by Simon’s men. However, Catherine appeared and saved him\nafterward.”"
      },
      {
        "paragraph": "Wesley’s eyes darkened. No wonder she only came back home after 1:00 a.m. last night."
      },
      {
        "paragraph": "She lied to him again. That… fcking btch."
      }
    ]
  },
  {
    "title": "Chapter 1033 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Wesley started the car with a twisted expression. On the road, he gave Regina a call. “Go to the suite in\nthe office. Wait for me.” \nHe needed to find a woman. If not, he could not tolerate the anger he felt."
      },
      {
        "paragraph": "When he was almost at the company building, his phone rang again."
      },
      {
        "paragraph": "“President Lyons, you’ve been followed by Logan.” Logan?"
      },
      {
        "paragraph": "Wesley was shocked. “How long has he been following me?"
      },
      {
        "paragraph": "“Ever since you left Hudson Corporation. He’s very careful. If we didn’t send someone to observe him\nand Austin from the start, I wouldn’t have noticed it too.”"
      },
      {
        "paragraph": "“I got it.” Wesley tightened his grip on the phone. Then, he laughed coldly."
      },
      {
        "paragraph": "Logan only obeyed Catherine, which meant that Catherine had asked Logan to investigate him."
      },
      {
        "paragraph": "Did she suspect something?"
      },
      {
        "paragraph": "It made no sense. Wesley was very cautious all along. Where did it go wrong?"
      },
      {
        "paragraph": "It seemed like his top priority was to clear her suspicions of him. Hence, he called Regina again. “You\ndon’t have to go to the office anymore. You no longer have to wait for me in the near future either.\nCatherine is already suspicious of something.”"
      },
      {
        "paragraph": "Regina could not help but said, “President Lyons, let her suspect all she wants. She can’t do anything as\nlong as you don’t get a divorce anyway.”"
      },
      {
        "paragraph": "“What the f*ck do you know?” Wesley reprimanded her bluntly."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Regina’s voice choked from being scolded. “I just feel bad whenever I see you pleasing Catherine\ngingerly. With your current identity, there’s really no need for you to do that.”"
      },
      {
        "paragraph": "“What identity do I have now?” Wesley sneered. “I’m just Mason’s dog.”"
      },
      {
        "paragraph": "As his secretary, Regina knew of that identity. However, after hearing his words, she could not help but\nmutter to herself. Mason was now Australia’s wealthiest man, so being Mason’s subordinate meant that\nWesley was one of Australia’s top figures too."
      },
      {
        "paragraph": "Could it be that… Wesley was discontented at being placed below Mason?"
      },
      {
        "paragraph": "After that thought crossed her mind, Regina could not help but shiver."
      },
      {
        "paragraph": "“There are some things that you don’t understand a t all. Remember, don’t let Catherine find out your\nrelationship with me. As for Catherine… she’ll still be of use to me in the future.”"
      },
      {
        "paragraph": "He hung up right after he said that. Regina was confused."
      },
      {
        "paragraph": "Did Wesley want to use Catherine to deal with Shaun?"
      },
      {
        "paragraph": "However, Shaun was already impotent. Otherwise, did Catherine have any other… unique identity?"
      },
      {
        "paragraph": "After Catherine entered her office at Hudson Corporation, Shaun gave her a call."
      },
      {
        "paragraph": "She looked at the incoming phone number, and in the end, she picked up the call awkwardly. “Is there\nanything…”"
      },
      {
        "paragraph": "“Ahem.” Coughing sounds came from the other side of the phone, but she did not hear anyone speak for\na while."
      },
      {
        "paragraph": "“Shaun, I’m hanging up if you’re not talking.” Just as Catherine finished her sentence, Shaun’s deep\nvoice finally came from the other side."
      },
      {
        "paragraph": "“Thank you for sending me home last night, and… applying medicine on me.”"
      },
      {
        "paragraph": "His voice was shy, as if he was a little boy. He was completely different from the Shaun that Catherine\nknew, and it felt weird."
      },
      {
        "paragraph": "“Oh, don’t misunderstand. I just saw someone fighting at the roadside when I was driving last night. I\ndidn’t know it was you until I saw you lying in the mud. You looked quite pitiful, so I kindly sent you back.”"
      },
      {
        "paragraph": "Catherine avoided having any connections with him. “Even if it were a stranger last night, I would’ve\ndone the same thing too.”"
      },
      {
        "paragraph": "Shaun felt overwhelmingly bitter when he heard that. Luckily, he did not carry much hope from the start.\nBesides, he did not dare to think about the future either."
      }
    ]
  },
  {
    "title": "Chapter 1034 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“I have something else to do. Bye…”"
      },
      {
        "paragraph": "Catherine noticed the call went silent again, so she spoke."
      },
      {
        "paragraph": "“Cathy…” Shaun suddenly called out to her. She could hear his heavy breathing. “You… saw\neverything?”"
      },
      {
        "paragraph": "Embarrassment washed over Catherine’s face. Could she say she did not see it?"
      },
      {
        "paragraph": "“You’re talking about that?” A while later, she found her voice. “That’s none of my business anyway.”"
      },
      {
        "paragraph": "Shaun’s heart tugged."
      },
      {
        "paragraph": "None of her business. Her words were so heartless."
      },
      {
        "paragraph": "“You’re right.” He let out a self-deprecating smile. “I don’t have the right to be a part of your world\nanymore.”"
      },
      {
        "paragraph": "Catherine was surprised. If it were in the past, he would have lost his temper. Did the fact that he got hurt\nin that area really changed his personality?"
      },
      {
        "paragraph": "In fact, she really wanted to ask how he became like that. However, she was just about to say it when\nshe stopped, afraid that he would think she was still concerned about him."
      },
      {
        "paragraph": "Shaun said, “I don’t have any particular reason for calling you. I just wanted to say thank you. Goodbye.\nGo on with your work. I won’t disturb you.”"
      },
      {
        "paragraph": "After the call ended, Catherine was in a daze for a long time. Shaun’s careful tone was still ringing in her\nears, and she felt a little uncomfortable."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "She was used to Shaun’s arrogance and haughtiness. Hence, this sudden change of behavior was weird\nfor her."
      },
      {
        "paragraph": "At the bungalow, Shaun opened his laptop and watched a video on it."
      },
      {
        "paragraph": "It was the security footage from three years ago, where he ordered people to break the legs of those\nyoung masters. At that time, he was so nervous that he embraced Catherine in his arms."
      },
      {
        "paragraph": "Actually, he wanted to ask her just now what exactly their relationship was like three years ago."
      },
      {
        "paragraph": "Why would he break the legs of those young masters for her sake? Why would he care so much about\nthose men taking advantage of her?\nHe knew himself well. With his personality, he would not have done something to offend so many young\nmasters for a mere woman whom he did not care about."
      },
      {
        "paragraph": "Unless he already had her in his heart three years ago."
      },
      {
        "paragraph": "It was just that he forgot about it afterward."
      },
      {
        "paragraph": "Although people could be forgotten, how could feelings be completely forgotten as well?"
      },
      {
        "paragraph": "Moreover, thinking back carefully, he still remembered many things. Only the memories where he cared\nfor Catherine were oddly missing."
      },
      {
        "paragraph": "Not only that, but all he remembered was bad things about Catherine…"
      },
      {
        "paragraph": "He stood up abruptly and drove to Australia’s medical university."
      },
      {
        "paragraph": "He waited at an old building for half an hour before he finally saw an elderly in his sixties walking toward\nhim."
      },
      {
        "paragraph": "“Professor Lincoln.” Shaun walked over in long strides."
      },
      {
        "paragraph": "“Young Master Hill, what brings you here today?” Professor Lincoln used to be the vice director of the\nmental hospital. He was in charge of Shaun’s illness when Shaun was young. After he retired, he came\nto the university and became an honorary professor."
      },
      {
        "paragraph": "“Professor Lincoln, I would like to ask you something,” Shaun said in a low voice."
      },
      {
        "paragraph": "“Okay, but don’t tell me your illness recurred again? ”Professor Lincoln sized him up. “I heard you found\na top psychologist from the US and cured your illness.”"
      },
      {
        "paragraph": "“I have recovered, but I just want to ask about something else. Let’s talk about it upstairs.”"
      },
      {
        "paragraph": "Upstairs, Professor Lincoln poured Shaun a cup of coffee. “Go ahead.” Shaun took the cup of coffee. He\nmulled it over for a long time, then he slowly said, “As you know, my illness recurred three years ago\nafter my mental illness history was exposed. My memory deteriorated after that, and I’ve forgotten many\nthings…”"
      },
      {
        "paragraph": "“It’s very normal.” Professor Lincoln nodded. “ Some mentally ill patients’ memories will deteriorate.\nSome may even experience hallucinations or mental disturbance. In serious cases, some may murder\nothers.”"
      }
    ]
  },
  {
    "title": "Chapter 1035 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“My condition is fine now, but lately… I suddenly realized that although I’ve forgotten a lot of things from\nthe past, what I’ve forgotten most is the memories with my ex-wife."
      },
      {
        "paragraph": "“I always thought I didn’t love her in the past. All I remember are the bad things about her. I hate her a\nlot, but recently, subsequent evidence has appeared, proving I might’ve cared about her in the past.\nHowever, I don’t know why I can’t remember that I cared about her and some other things relating to\nher.”"
      },
      {
        "paragraph": "Shaun muttered, “I used to hate going to places like KFC, but a while back, I heard from my friend that I\naccompanied Catherine there before. I even offended many people to get revenge for her. I also spent a\nhuge amount of money on buying her a very expensive and meaningful diamond necklace.”"
      },
      {
        "paragraph": "Professor Lincoln’s eyebrows knitted into a frown. He was deep in thought. “You just don’t remember\nthings regarding her?”"
      },
      {
        "paragraph": "“Not really. I can’t remember some other things too. That was why I didn’t take this seriously back then.\nHowever, I’ve noticed lately that the things I’ve forgotten seem… mostly related to her. I even… It’s very\nstrange. If I really cared about her before, why would I hate her so much after that?"
      },
      {
        "paragraph": "Furthermore, my memories of hate toward her are still complete. It was only until recently that I suddenly\nrealized that a lot of my memories with her are missing.”"
      },
      {
        "paragraph": "Shaun was confused. He really could not get his head around it."
      },
      {
        "paragraph": "“I’m sorry, Professor Lincoln. The way I put it might be difficult for you to understand. To be honest, I\ndon’t really know how to describe that feeling myself either.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Professor Lincoln nodded. Then, he took out a pen and drew a line on a piece of paper. “This line\nrepresents your current state. The spaces in between are the memories you’ve forgotten.”"
      },
      {
        "paragraph": "“That’s right.” Shaun nodded."
      },
      {
        "paragraph": "Professor Lincoln frowned. “Before this, have you ever felt there was something wrong with your\nmemories? Or did you just realize it recently?”"
      },
      {
        "paragraph": "Shaun was taken aback. He shook his head. “The doctor in the past said I had a mental illness in this\narea. Back then, I was… The doctor said I was similar to those older age patients with brain atrophy. If I\ndidn’t get it treated as soon as possible, I might have degenerated to a retard or a child.”\nProfessor Lincoln was deep in thought. “Last question, did your feelings experience any change?”"
      },
      {
        "paragraph": "“Three years ago… the one I loved was another childhood sweetheart of mine. I thought I would love her\nforever. ” Shaun frowned. “But strangely, after my ex-wife returned, I was easily attracted to my ex-wife\nagain. I’m not a playboy. Recently, I realized maybe I did care about my ex-wife in the past, but because I\nforgot…”"
      },
      {
        "paragraph": "“You forgot?” Professor Lincoln processed Shaun’s words. “Three years ago, did you notice that your\nmemories of your ex-wife were incomplete? If you didn’t love her, why did you marry her? How did you\nboth interact in your daily life?”"
      },
      {
        "paragraph": "“I can remember.” Shaun nodded. “I remember why we got married. She married me just because she\nmistook me as the uncle of her ex-boyfriend. When she knew my real identity, she thought of every\npossible way to seduce me, but I didn’t like her at all. I felt revolted when I was with her. The one I love\nwas another woman.”"
      },
      {
        "paragraph": "“In this case, your memories of your ex-wife used to be a perfectly straight line, but you only just realized\nthat it’s now a dashed line.” Professor Lincoln looked at him calmly. “Many people, when they forget\nsomeone they closely interact with in their lives, they’ll slowly realize many weird points. But why did you"
      },
      {
        "paragraph": "only realize it after three years? It wasn’t even you who found it out yourself. It was your friend who told\nyou about it.”"
      },
      {
        "paragraph": "Shaun was shocked."
      },
      {
        "paragraph": "That was true. He had forgotten so many things. However, in his brain, the memories he had with\nCatherine in the past were still a perfect line, as if he had never forgotten anything."
      },
      {
        "paragraph": "His tall figure started to tremble. “Professor Lincoln, I… How did I become like this? Is it because of my\nillness?”"
      },
      {
        "paragraph": "“This kind of situation won’t arise from your illness. ” Professor Lincoln shook his head and took a sip of\ncoffee. “Perhaps the straight line of the memory you thought isn’t actually complete. In other words,\nsomeone drew the straight line for you. Do you know about robots? With them, you can delete programs\nand key in the instructions you want, like who you should obey and who you should like.”"
      },
      {
        "paragraph": "Shaun was mind blown."
      }
    ]
  },
  {
    "title": "Chapter 1036 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun’s handsome face paled. Someone had deleted programs from his brain?"
      },
      {
        "paragraph": "He laughed dryly. “This is impossible, Professor Lincoln. I’m not a robot…”"
      },
      {
        "paragraph": "Professor Lincoln put on a straight face. “No, as far as I know, Y country has an ancient hypnotic skill\nthat does this. This hypnotic skill can tamper with a person’s feelings and memories. It can even go\nunnoticed by the person concerned.”"
      },
      {
        "paragraph": "Shaun’s brain rumbled."
      },
      {
        "paragraph": "Hypnosis?"
      },
      {
        "paragraph": "Someone had altered his memories and feelings. “ You mean the person I loved might’ve been my wife,\nbut someone altered it afterward and made me love another woman?”"
      },
      {
        "paragraph": "“This is just my guess. I can’t confirm it, ” Professor Lincoln said, “but the symptoms you mentioned are\nsimilar to being under the influence of Country Y’s ancient hypnotic skill. Not only that, the person who\ncarried out the hypnosis on you should be a person you trust very much. If not, that person wouldn’t have\nsucceeded. At the same time, this person must be considerably skilled in the field of psychology.”"
      },
      {
        "paragraph": "A person he trusted very much…"
      },
      {
        "paragraph": "Shaun thought of Sarah. She used to be the person he trusted the most, so much that he would believe\nin anything she said."
      },
      {
        "paragraph": "Furthermore, Sarah was one of the best in the world when it came to her skills in psychological\ntreatment."
      },
      {
        "paragraph": "However, at the thought that it was her who altered his memories, he could not help but shiver."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "He did not dare to believe it as well.\nWould the pure woman who supported and encouraged him in the mental hospital when he was young\nbecome so evil and vicious?"
      },
      {
        "paragraph": "“Professor Lincoln, do you know how to use this hypnotic skill?” Shaun asked bewilderedly."
      },
      {
        "paragraph": "“I don’t.” Professor Lincoln shook his head. “This ancient hypnotic skill is too evil. The international\norganization banned it a long time ago. Think about it, if everyone knew how to do it, wouldn’t this world\nfall into chaos? Besides, the success rate of that hypnosis is very, very low. Only one out of ten people\nwould succeed at most. The remaining nine would become retards due to the failure.”"
      },
      {
        "paragraph": "“Become a… retard?” Shaun was shocked again. “ Does it mean that if I was hypnotized by someone\nand it failed at that time, I would’ve become a retard?”"
      },
      {
        "paragraph": "“Yes. That’s why this ancient hypnotic skill has been long lost. Around 5o or 6o years ago, there was\nsomeone who tried to hypnotize a billionaire. I n the end, that billionaire became a retard, and his family\ncaught that psychologist and shot him dead.”"
      },
      {
        "paragraph": "Professor Lincoln thought about it and said, “ Besides, even if you realize that you’ve been hypnotized,\ndon’t try to cure yourself or look for your original memories. The structure of the brain is very\ncomplicated. The probability of you getting cured is only 0.01 percent. If it fails, not only will you not end\nup a normal person, but you’ll even become a retard.”"
      },
      {
        "paragraph": "Shaun was stunned for a long time."
      },
      {
        "paragraph": "He initially wanted to get his memories back."
      }
    ]
  },
  {
    "title": "Chapter 1037 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“That’s… so evil.” Shaun’s hands, which were resting on his knees, trembled."
      },
      {
        "paragraph": "“Yes, it is quite evil.” Professor Lincoln nodded. Then, he looked at Shaun complicatedly. “If you have\nsomeone you’re suspicious of, stay away from that person. Of course, I sincerely hope that you weren’t\nhypnotized. Maybe all of these are just your delusions.”"
      },
      {
        "paragraph": "“Thank you.” Shaun stood up and bowed."
      },
      {
        "paragraph": "After leaving Professor Lincoln’s place, Shaun did not drive. He simply walked around the university\ncampus quietly. His long legs were trembling."
      },
      {
        "paragraph": "Not only that, but his mind was blank."
      },
      {
        "paragraph": "He, too, hoped that everything was just his imagination."
      },
      {
        "paragraph": "Did Sarah hypnotize him despite knowing that he might become a retard?"
      },
      {
        "paragraph": "That was impossible. It did not make sense for Sarah to be so evil."
      },
      {
        "paragraph": "However, what if it was true? His hair stood on end when he thought about Sarah’s gentle, kind, big-\nhearted character during those three years."
      },
      {
        "paragraph": "No. He absolutely had to find out the truth. Even if he could not remember, he had to figure out where\nexactly his memories went wrong."
      },
      {
        "paragraph": "Hence, he immediately bought an air ticket to Melbourne. He did not tell anyone about it because if\nSarah, whom he had trusted for more than ten years, made him deeply suspicious, then what about the\nothers?"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "When the airplane landed at Melbourne Airport, Lea gave Shaun a call. “What time are you coming to\nthe company today?”"
      },
      {
        "paragraph": "“I’m in Melbourne now.”"
      },
      {
        "paragraph": "“What?” Lea flew off the handle. “Didn’t I tell you yesterday to meet the director of Garson Corporation\ntoday? Now everyone in Canberra wants to collaborate with Garson Corporation. But you? You went to\nMelbourne without saying a word. What are you trying to do?”"
      },
      {
        "paragraph": "“I have something important to sort out,” Shaun said in a low voice."
      },
      {
        "paragraph": "“How important can it be? Is it more important than Hill Corporation?” Lea was furious."
      },
      {
        "paragraph": "“Yes. It is very important,” Shaun repeated himself."
      },
      {
        "paragraph": "Lea was at a loss of what to say to him. “I don’t care. Come back as soon as possible after you’re done.\nHave you forgotten? The last time you asked me to manage Hill Corporation, I was as busy as a bee\nevery day. Do you want me to die from overworking?”"
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "Shaun hung up. After exiting the airport, he went straight to Jennings Solicitors."
      },
      {
        "paragraph": "The receptionist first thought Shaun came for a legal consultation. However, after hearing that he wanted\nto meet Chase, the receptionist brought him to Chase’s office right away."
      },
      {
        "paragraph": "“Let’s go bowling together tonight…” Chase, who was sitting on the leather sofa, turned his body around.\nWhen he saw a towering silhouette suddenly walk through the door, he stood up in surprise and ended\nthe call in a hurry."
      },
      {
        "paragraph": "“F*ck, Shaun. You… Why are you here?” Chase sized him up. The Shaun in front of him was wearing a\npair of blue jeans and a black T-shirt. His hair rested on his heavily wounded face. He looked exactly like\na lifeless young man."
      },
      {
        "paragraph": "Chase’s jaw almost dropped out of shock. “Your… Your transformation is quite huge.”"
      },
      {
        "paragraph": "“Back when I lived in the villa in Melbourne, I remember you found me a housekeeper named Linda. Can\nyou contact her? I have some things I want to ask her.” Shaun went straight to the point."
      }
    ]
  },
  {
    "title": "Chapter 1038 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“You want to look for her? It’s been so long. Wait a moment.”"
      },
      {
        "paragraph": "Chase made a phone call to the housekeeping agency and checked for a while before reaching Aunty\nLinda. “Aunty Linda is working as a nanny in this villa.”"
      },
      {
        "paragraph": "Chase gave him an address. “I’ll send you there.” “No need.” Shaun took the address. “Thank you.”"
      },
      {
        "paragraph": "“Don’ t mention it. I’m not used to you behaving like this.” Chase threw the car keys at him. “You can\ndrive my car over. We’ll have dinner together later.”"
      },
      {
        "paragraph": "“That’s rare.” Shaun glanced at him. “You rarely contact the three of us now. How many times have you\ngone to Canberra and not invited us out for a meal? You’re quite comfortable staying in Melbourne\nalone.”"
      },
      {
        "paragraph": "For some reason, he suddenly envied Chase."
      },
      {
        "paragraph": "Although Melbourne was small, Chase was basically the overlord here. Life here was not as insufferable\nas Canberra."
      },
      {
        "paragraph": "Chase smiled awkwardly. “I didn’t mean to lose contact with you guys, but you three always brought\nTracy and Sarah around. I really didn’t like them. I felt like…”"
      },
      {
        "paragraph": "He suddenly closed his mouth. “Forget it.”"
      },
      {
        "paragraph": "“Say it,” Shaun ordered sharply. Even if he was dressed very ordinarily now, the aura in his eyes was still\nthere. “Chase, we’ve been friends for more than ten years. Some things are better said clearly.”"
      },
      {
        "paragraph": "“Fine. I just… felt like you were a scumbag to Rin. I’m not too familiar with Sarah either, so maybe I\nwasn’t used to seeing Sarah replace Rin, whom you always brought along when I was around. Also, I"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "really didn’t understand why Chester got together with Tracy. She’s not a good woman at all. As for\nRodney, his eyes were always on Sarah. He would listen to whatever she said. It was like his brain was\nmuddled by love, and that was fine too. But I was very uncomfortable with you bringing them along to all\nof our gatherings. That was why I saw you guys less.”"
      },
      {
        "paragraph": "Chase said honestly, “I often find it difficult to talk to you guys, especially in recent years.”"
      },
      {
        "paragraph": "Shaun was silent. In fact, he had also realized that Chase did not like Sarah and Tracy. However, he\nreally hated Catherine at that time, so he turned a blind eye. After all, it was normal for good friends to be\nestranged."
      },
      {
        "paragraph": "“Did I… love Catherine a lot before?” he asked casually out of the blue."
      },
      {
        "paragraph": "“I used to think that you liked her a lot, so I couldn’t understand why you did all that afterward. Maybe\nshe was just a pastime for you when Sarah wasn’t around.” Chase’s lips twitched."
      },
      {
        "paragraph": "“Is that so? Then tell me, what made you misunderstand that I liked her?” Shaun asked expressionlessly."
      },
      {
        "paragraph": "Chase looked at him speechlessly. “If you didn’t like her, why would you gift her the Queen’s Necklace?\nThat diamond necklace was worth tens of billions. If you didn’t like her, why would you sacrifice sleep\nand rush over overnight to save her when you learned that she was locked up in the old Jones\nresidence? Also, when the stone fell from a building on the construction, you ended up hurting your back\nto save her. You almost lost your life that time. Then, there was the time where you ate hotpot with her.\nHow can you eat hotpot with that stomach of yours? The stomachache you got after was excruciating…”"
      },
      {
        "paragraph": "After saying all that, Chase suddenly stopped. “ Forget it. No matter how much you liked her, it can’t\ncompare with Sarah.”"
      },
      {
        "paragraph": "“Who said… it can’t?” Shaun suddenly smiled, but there was indescribable sadness in that smile."
      },
      {
        "paragraph": "“Huh?” Chase was a little confused."
      },
      {
        "paragraph": "“ I’ll call you out for a drink later. ” Shaun took the car keys and turned away."
      },
      {
        "paragraph": "When he got into the car, he realized that his eyes were slightly red."
      },
      {
        "paragraph": "He had no memory of what Chase said."
      },
      {
        "paragraph": "However, he knew that since Chase could answer so quickly to his sudden question, it meant that it was\nnot a lie."
      },
      {
        "paragraph": "Those were things that had once truly happened between Catherine and him."
      }
    ]
  },
  {
    "title": "Chapter 1039 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "It was understandable to forget one or two things, but it was really strange that Shaun had forgotten all\nthe proof that he cared about Catherine."
      },
      {
        "paragraph": "He could not imagine that he almost died trying to save her once."
      },
      {
        "paragraph": "He even accompanied her to eat hot pot and got a stomach ache."
      },
      {
        "paragraph": "He would never eat hotpot."
      },
      {
        "paragraph": "How special was Catherine to him?"
      },
      {
        "paragraph": "He wanted to find out quickly, but he was suddenly afraid."
      },
      {
        "paragraph": "He was afraid that Catherine and he really were deeply in love, but since his memory was tampered with,\nhe later abandoned her and hurt their children."
      },
      {
        "paragraph": "He was afraid that he had hurt her deeper than he thought."
      },
      {
        "paragraph": "He sat in the car for half an hour before finally going to see Aunty Linda."
      },
      {
        "paragraph": "After Aunty Linda answered his call, she quickly walked out holding an old booklet. When she saw\nShaun, she called out tentatively, “Eldest Young Master Hill…”"
      },
      {
        "paragraph": "“Aunty Linda, you still remember me.” Shaun looked at Aunty Linda and found that he still remembered\nher."
      },
      {
        "paragraph": "“Of course I do. I’ve been a nanny for so many years, but Ms. Jones and you left the deepest impression\non me…” She suddenly paused guiltily for a moment before saying, “Did I… offend you by mentioning\nyour ex-wife?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“No.” Shaun tried to ignore the pain in his heart."
      },
      {
        "paragraph": "Aunty Linda asked worriedly, “What do you suddenly want to see me for?”"
      },
      {
        "paragraph": "“ I suffered from an illness a few years ago and lost a lot of memories of my former life in Melbourne, so I\nwanted to ask you about it.” Shaun found an excuse and said, “Can you tell me some things about\nCatherine and me?”"
      },
      {
        "paragraph": "Aunty Linda looked shocked and sympathetic when she heard that. “I see. Actually, I’m not too sure\nabout the specifics between Ms. Jones and you. I’m just a nanny, so I can only talk about what I usually\nsee. Anyway, Ms. Jones and you were like a grudgeful couple. When you two got along, you got along\nterribly well, but when it was bad, you two often quarreled and gave each other the silent treatment.”"
      },
      {
        "paragraph": "“What do you mean?” Shaun’s pupils shrank and could not help but move his throat with difficulty.\n“When you both were on good terms, Ms. Jones would cook breakfast for you every day. Sometimes,\nwhen she came back early because she was free, she would cook you dinner. My cooking wasn’t bad,\nbut you didn’t like my food. You only liked Ms. Jones’s cooking. When on bad terms, you two would fight,\nand you would disappear for a few days without any news. But when you came back, you both would\nmake up and be very sweet to each other again.”"
      },
      {
        "paragraph": "Aunty Linda sighed pitifully. “You two were a good match, but maybe it was because you both were still\nyoung, so it was easier for misunderstandings to happen. I remember Ms. Jones and you had a huge\nfight one night. I was downstairs and didn’t dare to go up, but you two signed the divorce papers the next\nday. Ms. Jones was… quite sad. Oh, right.”"
      },
      {
        "paragraph": "Aunty Linda hurriedly handed over the booklet in her hand. “This is the recipe book that Ms. Jones gave\nme on the day she left. She wrote it herself. It contains your favorite home-cooked dishes. She said you\nhad a bad stomach and was afraid that you’d be picky about food after you leave, so she told me to\nfollow the recipe so that you’d eat it.”"
      },
      {
        "paragraph": "With his heart thumping, Shaun took the recipe and flipped it open. He could tell that the words were\nwritten a long time ago, and even though the booklet was old, he still recognized her handwriting."
      },
      {
        "paragraph": "He had seen her handwriting when they lived together before."
      },
      {
        "paragraph": "It turned out that she was once so concerned about his stomach."
      },
      {
        "paragraph": "It turned out that she cared so much about him."
      },
      {
        "paragraph": "Aunty Linda said, “Ms. Jones is a really nice person. I’ve been a nanny for decades, but I’ve never\nencountered someone as good- tempered as her. She didn’t treat me as a nanny. Sometimes, when I\nwas working, she’d advise me to rest and don’t be so busy. With her, I could be frank, and she wouldn’t\nblame me. Before she lived in the villa, you never liked to come home. You’d go out in the morning and\ncome back when it was time to sleep. After she moved in, you’d go to work with her every day and come\nback on time after work mainly because you wanted to wait for her return. When she was busy with work,\nyou even complained that she cared more about her work than you.”"
      },
      {
        "paragraph": "Shaun was bewildered. He did that?"
      },
      {
        "paragraph": "He actually came back from work on time because of her?"
      },
      {
        "paragraph": "“Aunty Linda, are you… telling the truth?”"
      },
      {
        "paragraph": "“Why would I lie about this? It’s been a long time since I’ve worked for you,” Aunty Linda said frankly."
      }
    ]
  },
  {
    "title": "Chapter 1040 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Then, were we… intimate?” Shaun asked in a low voice. In his memory, he hated when Catherine\napproached and touched him three years ago. She even took advantage of him being drunk to get\npregnant."
      },
      {
        "paragraph": "Aunty Linda blushed. “Oh, of course you were. Every time Ms. Jones kissed you, you were quite happy.\nThere was once when you were injured, you lied to her and told her that it would stop hurting if she\nkissed you, and Ms. Jones actually believed you. Even my face turned red when I saw it.”"
      },
      {
        "paragraph": "“Thank you…” After hearing that, Shaun gratefully let Aunty Linda go back."
      },
      {
        "paragraph": "He had no recollection of what Aunty Linda told him, but he knew that like Chase’s words, it was all most\nlikely true."
      },
      {
        "paragraph": "However, he had forgotten it. He had forgotten that three years ago, he once loved a woman named\nCatherine Jones."
      },
      {
        "paragraph": "All his mind remembered were her faults."
      },
      {
        "paragraph": "It was no wonder that after Catherine came back three years later, she could easily cook a meal he\nloved. She knew his appetite like the back of her hand."
      },
      {
        "paragraph": "Even in bed, she knew what kind of position he liked the most."
      },
      {
        "paragraph": "It was because they were in love."
      },
      {
        "paragraph": "However, he had forgotten that he loved her."
      },
      {
        "paragraph": "It was enough that he forgot, but he even got together with Sarah and forced the divorce on her. He even\nforced her to announce to the public that they had a contract marriage."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "He defended Thomas Neeson time and time again, locked her up, pushed her down, and killed his two\nchildren."
      },
      {
        "paragraph": "He also hurt the friend she cared about the most and threatened her with Joel’s illness."
      },
      {
        "paragraph": "It was not easy for her to come back."
      },
      {
        "paragraph": "Yet, he cut off Logan’s finger for Sarah and almost locked Catherine in a dungeon."
      },
      {
        "paragraph": "If she had not been smart enough to find evidence to clear her name, he might still regard her as a bad\nand evil woman."
      },
      {
        "paragraph": "He did not deserve to love her."
      },
      {
        "paragraph": "He had hurt her so much and even abducted her to an island."
      },
      {
        "paragraph": "Shaun could no longer hold back his tears."
      },
      {
        "paragraph": "As a man, his tears poured down for the first time in his life. He cried in despair."
      },
      {
        "paragraph": "Time and time again, he trampled the woman he once loved and took care of the woman who ruined his\neverything. Not only that, but he also gave Sarah 100 billion for the breakup."
      },
      {
        "paragraph": "He always thought he was smart, but now, he realized that he was a fool."
      },
      {
        "paragraph": "He was played like a fiddle. Sarah Neeson, oh, Sarah Neeson."
      },
      {
        "paragraph": "He chewed over the name in his throat, wanting nothing more than to eat her bones and bite her flesh."
      },
      {
        "paragraph": "At night, in the room of a clubhouse."
      },
      {
        "paragraph": "Chase ordered the alcohol, and Shaun only appeared at 9:00 p.m."
      },
      {
        "paragraph": "He was pale and looked dazed."
      },
      {
        "paragraph": "”Hey, what did you do to yourself?” Chase did not feel good seeing him like this."
      }
    ]
  },
  {
    "title": "Chapter 1041 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“It’s just a failure. With your capability, whether it’s in law or finance, it won’t be a problem for you to\ncome back to Melbourne and become a big shot.”"
      },
      {
        "paragraph": "“That’s not it.” Shaun popped a bottle of beer and chugged it, his eyes red again."
      },
      {
        "paragraph": "Chase was startled. “What’s up with you?”"
      },
      {
        "paragraph": "He had known Shaun for more than ten years, but this was his first time seeing Shaun cry. It was as if he\nsaw a ghost."
      },
      {
        "paragraph": "“You don’t understand. I lost the most important thing in my life.” Shaun looked up and said bitterly,\n“Chase, can you tell me about my past with Catherine? I want to know how we met, got closer, and fell in\nlove with each other.”"
      },
      {
        "paragraph": "“Sure. Three years ago, you just came to Melbourne"
      },
      {
        "paragraph": ".” Although Chase was confused as to why he suddenly wanted to hear about Catherine, he still talked\nabout it."
      },
      {
        "paragraph": "He talked until Shaun fell asleep, drunk."
      },
      {
        "paragraph": "He could not help but call Rodney. “Are you guys even brothers? You guys should accompany Shaun\nmore since such a big thing happened to him. Look, now he’s here in Melbourne drinking his sorrows\naway.”"
      },
      {
        "paragraph": "“ Shaun is in Melbourne?” Rodney became upset. He only found out in the morning that Thomas\ninstigated Young Master Kelly to beat up Shaun. He was currently looking for Thomas all over Canberra."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Yes.” Chase sighed. “Rodney, I understand that you fought with Shaun because of Sarah, but you’ve\nknown each other for more than ten years. You guys are always there for each other whenever one of\nyou is in trouble, no? Hasn’t that happened to you before too?”"
      },
      {
        "paragraph": "“Chase, what do you take me for? Yes, I thought that Shaun was too cold-blooded before. But after\nsomething so big happened to him, I can still distinguish the seriousness of the matter. I’m not a fair-\nweather friend.”\n“Okay, it’s good that you think that way.”"
      },
      {
        "paragraph": "In Canberra."
      },
      {
        "paragraph": "After Rodney hung up the phone, his chest was about to explode in anger."
      },
      {
        "paragraph": "He was mainly furious at Thomas. How dare Thomas come back and bully Shaun when he had yet to\nsettle the score with Thomas for drugging Freya the last time."
      },
      {
        "paragraph": "Thomas did not listen to him now either, and he did not have anyone capable in his hands. Hence, he\ncould only reign in his anger and look for Sarah instead."
      },
      {
        "paragraph": "When he arrived at the seaside villa and saw the brand-new sports car parked in the yard, he became\neven more furious."
      },
      {
        "paragraph": "“Rodney, why are you here so late?” Sarah, dressed i n graceful pajamas, came out."
      },
      {
        "paragraph": "She really did not want to see Rodney at this time, but he must be here because of Thomas. She really\nadmired that stupid pig Thomas, who managed to get his hands dirty even when someone else was\ndoing the dirty work."
      },
      {
        "paragraph": "“Sarah, I’m just here for Thomas. Where is he hiding?” Even when faced with her s*xy appearance,\nRodney’s beautiful face did not look like he was in a good mood at all. “Did you hear about Shaun getting"
      },
      {
        "paragraph": "beaten up?”"
      },
      {
        "paragraph": "“Shaun was beaten up?” Sarah was shocked, and pain flashed across her face. “I didn’t know. I’ve been\nworking at the hospital recently.”"
      },
      {
        "paragraph": "Rodney said furiously, “Thomas saw Shaun drinking last night and told Young Master Kelly about it. What\nrelationship does Young Master Kelly have with Shaun? He hates Shaun’s guts, so he immediately\ngathered his people to beat Shaun up."
      },
      {
        "paragraph": "I really don’t understand why you have a brother like that. How many times has Shaun helped him? I f\nnot for Shaun, he would be in jail by now. Just what the hell is going on in his mind?”"
      },
      {
        "paragraph": "“I’m sorry.” Sarah looked embarrassed and bitter. “After that incident with you, I’ve been so angry that I\nhaven’t contacted him at all. He did call me, but I didn’t answer. Rodney, I hate him more than anyone\nelse.”"
      }
    ]
  },
  {
    "title": "Chapter 1042 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Don’t apologize. I’m not mad at you. I just can’t understand people like Thomas.” Rodney gritted his\nteeth. “Sarah, can you contact him? Yes, I want to teach him a lesson. Will you help me?”"
      },
      {
        "paragraph": "“Don’t say that. He should be taught a lesson. I’ll call him and try to find out, but I don’t know if he’ll\nanswer.”"
      },
      {
        "paragraph": "Sarah found Thomas’s number and dialed it, but no one answered. She gritted her teeth and said, “He’s\nnot even picking up my calls. Oh, right. How… is Shaun? After all, we’ve known each other for more than\nten years. It’s… impossible not to worry about him.”"
      },
      {
        "paragraph": "“Oh, he went to Melbourne.” Rodney sighed. “I don’ t know why he’s suddenly in Melbourne. He even\nwent drinking with Chase too.”"
      },
      {
        "paragraph": "Melbourne…"
      },
      {
        "paragraph": "The word made Sarah’s heart skip."
      },
      {
        "paragraph": "She remembered that Shaun and Catherine met in Melbourne. Did he suspect something?"
      },
      {
        "paragraph": "“Sarah…” Rodney’s voice once again pulled her out from her thoughts. “I saw a new sports car outside.\nDid you change it?”"
      },
      {
        "paragraph": "“Yes…” Afraid he would misunderstand that she was crazy about money, Sarah hurriedly explained, “I\ndidn’t want the old car anymore. I want to completely get rid of the past memories”"
      },
      {
        "paragraph": "“Oh, Sarah, you see… When you two broke up, he gave you 1oo billion dollars. Now that Shaun is quite\nmiserable and Hill Corporation urgently needs money, can you… return some of the money to him first?”\nRodney mustered up his courage to say."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "If it were another woman, he would not say it. Yet to him, Sarah was a person who valued friendship over\nmoney, so he felt she would definitely agree."
      },
      {
        "paragraph": "Moreover, Shaun’s break-up fee was really quite astronomical. No man in the world would give so much\nmoney to his ex-girlfriend before getting married.\n“Of course, I’m not asking you to give it all. Just give him around 60 to 70 billion dollars. Look, you’ll\nmarry me one day, and Osher Corporation’s performance is getting increasingly better. We definitely\nwon’t be short of money in the future. I’ll be able to fully support you and give you a wealthy"
      },
      {
        "paragraph": "life, so… can you help Hill Corporation through this crisis? I’m sure with his personality, he’ll definitely\nrepay you double if he has a change of fortune.”"
      },
      {
        "paragraph": "Sarah wanted to vomit blood as she listened to Rodney."
      },
      {
        "paragraph": "Give Shaun 6o to 70 billion?"
      },
      {
        "paragraph": "Was he crazy? How could she give Shaun so much money?"
      },
      {
        "paragraph": "Yes, Shaun was capable, but he had too many enemies. They would never let Shaun have the chance to\nchange his fortune."
      },
      {
        "paragraph": "If it were the high and mighty Shaun Hill of the past, she would not hesitate to give it to him. After all, she\nwould be able to get more than she gave, but the current Shaun…"
      },
      {
        "paragraph": "Forget it. Since his net worth was even less than hers, she wanted nothing to do with him anymore."
      },
      {
        "paragraph": "Only an idiot like Rodney would still think of Shaun as a brother. If not for the Snow family backing him,\nshe would have found someone else with a higher social standing."
      },
      {
        "paragraph": "However, she did not dare to say those words. At least, she could not let Rodney think that she was\nmaterialistic."
      },
      {
        "paragraph": "“Rodney, I really want to help Shaun too.”"
      },
      {
        "paragraph": "She lowered her eyes and revealed a pitiful and helpless look on her face. “I’ve already put the money\nShaun gave me into a trust fund. It’s the kind that seals the money for 3o years, so I can’t take it out\neven if I want to. As for the rest of the real estate shops and houses, I’ve rented them all out and signed\nlong-term contracts. If I default, I’ll have to pay a large fee for breach of contract.”"
      }
    ]
  },
  {
    "title": "Chapter 1043 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“I see…”"
      },
      {
        "paragraph": "Rodney froze. He thought that Sarah would agree without hesitation."
      },
      {
        "paragraph": "This was not quite what he had expected."
      },
      {
        "paragraph": "Sarah was now like a friend who found various excuses not to lend money to a good friend who was in a\ncritical moment."
      },
      {
        "paragraph": "“Forget it, then. It’s very late, so I’ll leave now. You should rest up. I won’t bother you anymore.” Rodney\nwaved his hand, not in the mood to stay any longer."
      },
      {
        "paragraph": "“Rodney, I’m sorry I can’t help you at all.” Sarah looked like she was on the verge of tears with guilt."
      },
      {
        "paragraph": "“It’s fine. Chester and I can help if Shaun needs money. I was just asking.”"
      },
      {
        "paragraph": "Rodney reluctantly comforted her before walking out of the villa."
      },
      {
        "paragraph": "As he drove out, he looked back at the villa. Although it was by the seaside, the beach was exquisite, the\nwater was blue, and it was closest to the city. It was the most expensive waterfront land in Canberra.\nShaun bought it with 300 million back then, and now, this villa was worth at least 8oo million."
      },
      {
        "paragraph": "When Shaun broke up with her, he gave this villa to Sarah without hesitation. Meanwhile, his\ngrandparents were now living in a villa worth several tens of millions in the suburbs."
      },
      {
        "paragraph": "Rodney sighed."
      },
      {
        "paragraph": "Forget it. He could not blame Sarah. Since Shaun gave the money to her, she had the right to use it\nhowever she wanted to. Besides, it was not just tens of thousands. It was hundreds of billions. These"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "days, money is more important than anything, so no one would want to fork it out. Even a kind girl like\nSarah could not help it."
      },
      {
        "paragraph": "At that moment, Chester suddenly called him. “ I caught Thomas.”"
      },
      {
        "paragraph": "“Where are you? I’ll be right there.”"
      },
      {
        "paragraph": "Rodney immediately drove to a factory under the Jewell family."
      },
      {
        "paragraph": "When he arrived, Thomas was tied up on the ground while Chester, dressed in an expensive suit, was\nsitting on a chair. He lowered his head and slowly and methodically wiped the glasses in his hand."
      },
      {
        "paragraph": "As soon as he saw Rodney, his double eyelids glanced over at him. His eyes looked calm, but there was\na hint of grimness inside."
      },
      {
        "paragraph": "“Young Master Snow, help me.” Thomas saw him and shouted, “I didn’t tell Young Master Kelly to harm\nYoung Master Hill. Young Master Hill is my benefactor. How could I harm him? I just unintentionally said\nsomething when I was drinking with Young Master Kelly. I was wrongly accused.”"
      },
      {
        "paragraph": "Rodney went up and kicked him. “If you were wrongly accused, then why did you hide? Damn it. You run\nevery time you do something bad. Never mind Shaun, I have a lot of scores I want to settle with you.\nLet’s talk about what happened during the banquet of my new product launch. Did you drug Freya\nLynch?”"
      },
      {
        "paragraph": "“No. I wouldn’t dare to…”"
      },
      {
        "paragraph": "“If you didn’t dare, why did you flee the country the next day? You were nowhere to be found.” Rodney\nkicked him hard with an unpleasant expression. “Do you know how much trouble you caused me?”"
      },
      {
        "paragraph": "Thomas’s whole body hurt from being kicked, but he still gritted his teeth and screamed injustice."
      },
      {
        "paragraph": "“Rodney, move aside. You’re all show and no go. You can’t hurt anyone like that.” Chester put on his\nglasses and stood up. His handsome face was elegant and graceful, but Thomas inexplicably\nshuddered."
      },
      {
        "paragraph": "Out of the three of them, Chester spoke the least and hid himself the deepest. He was a doctor on the\nsurface, but his methods were no better than Shaun’s."
      },
      {
        "paragraph": "“Young Master Jewell, I swear. I wouldn’t dare to harm Eldest Young Master Hill… Ah… Help… It hurts.”"
      },
      {
        "paragraph": "Before Thomas could finish, Chester stepped on the back of his hand."
      }
    ]
  },
  {
    "title": "Chapter 1044 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Thomas Neeson, you’ve been taking advantage of your sister and us all these years to do so many bad\ndeeds out there. Did you really think we didn’t Chester took his time to say it, but the force of his foot\nincreased. “Shaun saved you time and time again, yet not only did you not appreciate it, but you even\nkicked him while he was down. In the story with the farmer and the snake, you’re the snake.”"
      },
      {
        "paragraph": "Thomas was in so much pain that he could not utter a single word. He had even heard the sound of his\nfingers breaking."
      },
      {
        "paragraph": "“Let me ask you. Are you the only one who knows about this? Or is there someone behind the scenes\ndirecting you?” Chester suddenly spoke."
      },
      {
        "paragraph": "Thomas shook his head with a pale face. He did not even have the strength to speak."
      },
      {
        "paragraph": "He was not a fool. If he confessed that it was Sarah, Chester would not let him go either. Once Sarah\nmarried into the Snow family, he would get revenge for today."
      },
      {
        "paragraph": "“Cripple him down there.” Chester waved his hand a t his subordinate by the side."
      },
      {
        "paragraph": "Thomas’s eyes widened in fright, and before he could say a word, he fainted from the pain."
      },
      {
        "paragraph": "Rodney was also shocked. He thought that they were just going to beat Thomas up. After all, he was\nSarah’s brother. “C-Chester, about what happened to Shaun in jail… It wasn’t Thomas…”"
      },
      {
        "paragraph": "“I didn’t say it was Thomas.” Chester lit a cigarette. “But I have to make a show of our strength as a\nwarning. Although the Hill family has fallen, Shaun is still my brother. I need to let people know the\nconsequences of provoking my brother.”"
      },
      {
        "paragraph": "“But… there’s no need to get so bloody, right?” Rodney stammered. “After all, he’s Sarah’s… brother…”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Sarah’s brother.” Chester puffed out a mouthful of smoke. “If he didn’t have that title, he would be stuck\nin jail until his fifties or sixties. Look at the wicked things he has done in recent years. He forced a female\nuniversity student to jump off a building and forced himself on beautiful female employees. When he\nencountered someone like Freya who was unwilling to comply, he gathered people and broke into her\nhome."
      },
      {
        "paragraph": "“He assaulted her in her home, beat others, killed, and committed violence. When he failed to obtain her,\nhe drugged her under our noses."
      },
      {
        "paragraph": "“Now, he has even learned how to get others to do his dirty work. People like him are hopeless. I’m doing\nthis because I don’t want him to harm anyone anymore.”"
      },
      {
        "paragraph": "Rodney was suddenly at a loss for words."
      },
      {
        "paragraph": "Thinking about it now, Thomas really was a vile and lawless person."
      },
      {
        "paragraph": "“Think about it. Don’t you feel ashamed? How many women has he harmed over the years because of\nour protection?” Chester glanced at him indifferently."
      },
      {
        "paragraph": "“Alright, you did the right thing. Not having him as a brother would be good for Sarah too.” Rodney\nnodded vaguely. “At least… we’re letting him live.”"
      },
      {
        "paragraph": "Chester turned around and looked at his men. “ Throw him in front of Neeson Corporation’s gates.”"
      },
      {
        "paragraph": "Two days later."
      },
      {
        "paragraph": "Shaun returned from Melbourne and went back to Hill Corporation."
      },
      {
        "paragraph": "Hadley had been working with Lea these days, so when Shaun came back, he immediately reported the\ncompany’s situation to Shaun."
      },
      {
        "paragraph": "He had talked for a long time, so much that his mouth had dried up, only to see Shaun’s cold eyes.\nShaun still looked the same, but as Shaun’s closest assistant, he could feel that something was different."
      },
      {
        "paragraph": "Although Shaun had always been cold, he was still alive. However, the current Shaun seemed lifeless\nand covered in frost."
      },
      {
        "paragraph": "“Eldest Young Master, Campos Corporation has also been trying to contact the boss of Garson\nCorporation these days. But this person is very mysterious and no one has seen him before,” Hadley\nsaid in a low voice."
      }
    ]
  },
  {
    "title": "Chapter 1045 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Campos Corporation is above Landell, yet they are still not satisfied.” Shaun opened his mouth and said\ncoldly, “How greedy.”"
      },
      {
        "paragraph": "“Now that they’ve become the leading company in Australia, they probably want to expand their territory\ninternationally.” Hadley agreed with him."
      },
      {
        "paragraph": "Shaun suddenly fell silent, but his disdainful eyes stared at Hadley."
      },
      {
        "paragraph": "“Y-Young Master Hill, did I say something wrong?” Hadley was disturbed by his stare."
      },
      {
        "paragraph": "“Hadley, you’re my capable assistant. Wherever I go, you follow. You should know me better than anyone\nelse.” A cold, suffocating glint flashed across Shaun’s deep eyes. “Didn’t you notice my sudden change\nin attitude three years ago?”"
      },
      {
        "paragraph": "Hadley’s eyes quivered."
      },
      {
        "paragraph": "Shaun caught the expression in his eyes. “What… What change? Eldest Young Master, haven’t you\nalways been like this?” Hadley quickly calmed down and answered."
      },
      {
        "paragraph": "“Hadley, can I still believe you?” Shaun stood up. “Our relationship is just one between an employer and\nemployee. During this period, many of Hill Corporation’s executives and even the people in the\nsecretarial department have resigned and left one after another. What about you? Have you thought\nabout leaving before?”"
      },
      {
        "paragraph": "Hadley was startled by his words, but he shook his head. “Eldest Young Master, I met you when I was\naround 14- As you know, back then, my father remarried after my mother died and did not care about\nme. He didn’t even pay for my tuition fees. I got into fights every day and was someone who didn’t have\na future. It was your appearance that saved me. “You paid for my tuition and sent me to school. From"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "then on, I vowed to follow you for the rest of my life. After I graduated, I didn’t have much talent in\nbusiness, but it was you who taught me by hand. I will never forget that kindness. I swear, I’ll follow you\nfor the rest of my life.”"
      },
      {
        "paragraph": "“The rest of your life?” Shaun smiled mockingly at himself. “What if my future gets darker and darker?"
      },
      {
        "paragraph": "“It won’t. People might not understand you, but I do. I know what you’re capable of.”"
      },
      {
        "paragraph": "Hadley said in a low voice, “Even if you’re no longer the president of Hill Corporation, with your status as\na lawyer and your shrewdness in the financial market, you’d be noticed in any industry.”"
      },
      {
        "paragraph": "Shaun smiled, but it was not a smug smile. It was a sad one. “I’m very talented at earning money, but I’m\na fool when it comes to relationships. Hadley, I don’t believe that you didn’t notice my sudden change in\nattitude towards Catherine three years ago.”"
      },
      {
        "paragraph": "Hadley’s eyes widened. He had his suspicions, but he did not expect Eldest Young Master to really\nnotice it."
      },
      {
        "paragraph": "“Judging by your reaction, you’ve noticed it long ago. Why didn’t you tell me?”"
      },
      {
        "paragraph": "Shaun fiercely grabbed him by the collar. His eyes were filled with rage. “If you had told me earlier, I\nwouldn’t have acted like a fool for three years, completely unaware that I was hypnotized by Sarah.”"
      },
      {
        "paragraph": "After he roared, he realized that Hadley was not shocked. It was as if he already knew about it. “You\nknew that I was hypnotized?”"
      },
      {
        "paragraph": "Hadley nodded painfully. As matters stood, he knew he could not hide it any longer. “Ms. Jones and I\nwere the first to realize that something was wrong with you.”"
      },
      {
        "paragraph": "Shaun’s body trembled as he asked hoarsely, “She knew, too?”"
      },
      {
        "paragraph": "“Yes. Don’t forget, she was the wife that slept beside you every night, and I was the assistant who\nfollowed you every day.”"
      },
      {
        "paragraph": "Hadley said bitterly, “Three years ago, Sarah suddenly came back. Coupled with the matters from\nCharity’s family, you quarreled with Ms. Jones every day, and the estrangement deepened day by day.\nMs. Jones didn’t trust you, and the both of you were rarely speaking. You were always in the company\nand didn’t want to go back, and whenever you did, you both would end up fighting again.”"
      }
    ]
  },
  {
    "title": "Chapter 1046 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“But I know you still had Ms. Jones and your children in your heart. However, one day, when you and\nSarah were done with treatment at the manor, you suddenly became extremely cold to Ms. Jones. Even\nwhen she was with child, you insisted on divorcing her, and you were always with Sarah. You even…\nslept at Sarah’s place at night.”"
      },
      {
        "paragraph": "Shaun’s fists clenched so hard that veins bulged."
      },
      {
        "paragraph": "Yes, he remembered how cruel he was to Catherine. When she was pregnant, he went out with Sarah\ninstead."
      },
      {
        "paragraph": "Hadley sighed. “Young Master Jewell and Young Master Snow thought that you had lingering feelings for\nMs. Neeson, so they didn’t understand. They thought that after Ms. Neeson came back, you still liked her\nbetter, but I understand you, Eldest Young Master. You cared about Ms. Neeson, but you loved Ms.\nJones even more. Even if you wanted to get back together with Ms. Neeson, you would have given Ms.\nJones a proper way out rather than forcing her into a desperate situation.”"
      },
      {
        "paragraph": "“Yes.” How could he have locked her up?"
      },
      {
        "paragraph": "Shaun turned around, not wanting others to see his reddened eyes. “What happened after that? If she\nknew the truth, why had I never heard her say it before?”"
      },
      {
        "paragraph": "“Would you have believed her?” Hadley asked, “At that time, you had no doubts about Ms. Neeson."
      },
      {
        "paragraph": "Even if Ms. Jones said it, you would just think that she was a vicious woman.”"
      },
      {
        "paragraph": "Shaun fell silent. Yes, he would not have believed her at that point."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Hadley continued, “We consulted a notable psychiatrist about your illness. The doctor said you had been\nsubjected to a type of ancient hypnosis that had a very slim chance of curing. If it failed, you would\nbecome a fool.”"
      },
      {
        "paragraph": "“That year, when Ms. Jones heard those words, I saw how hopeless her eyes were. Then, she said that\nshe wouldn’t wake you up. She would leave you be. What she wanted was a divorce and a way out, and\nshe would let you spend your life with Ms."
      },
      {
        "paragraph": "Neeson. I knew that she loved you at that time, but she would rather endure the pain of being\nabandoned than risk you becoming a fool.”"
      },
      {
        "paragraph": "At those words, Shaun’s heart ached as if it was being torn apart."
      },
      {
        "paragraph": "He held his forehead as his eyes stung with moisture."
      },
      {
        "paragraph": "Yes, at that time, Catherine mentioned that she wanted a divorce, but he forced her to stay and give birth\nto the children so he could give them to Sarah. He did it so that Sarah would not have to endure the pain\nof childbirth."
      },
      {
        "paragraph": "How desperate and angry was she back then? However, he ignored her screams and locked her up."
      },
      {
        "paragraph": "Thinking about it now, Sarah’s claim that she was mentally ill must be fake as well."
      },
      {
        "paragraph": "He threw a woman who had just been abandoned by her husband and had a miscarriage into a cold\npsychiatric ward. How much despair must she have been in?"
      },
      {
        "paragraph": "His Cathy. How much had she suffered? How many injuries did she get? It was no wonder she hated him\nso much."
      },
      {
        "paragraph": "Never did Shaun hate himself as much as he did at that moment."
      },
      {
        "paragraph": "“Hadley, when the hospital said that Cathy died that time… were you in on it?” Shaun suddenly asked."
      },
      {
        "paragraph": "“I’m sorry, Eldest Young Master. ” Hadley did not cover it up anymore. “ Seeing that the situation was\nbad, it was me who informed the Second Young Master. If we didn’t do that, Ms. Jones wouldn’t have\nbeen able to hold on. She was already delirious from the medicine she was given.”"
      },
      {
        "paragraph": "“You did the right thing.” Shaun patted his shoulder and said gratefully, “Thank you, Hadley.”"
      },
      {
        "paragraph": "“It’s good that you don’t blame me.” Hadley breathed a sigh of relief."
      }
    ]
  },
  {
    "title": "Chapter 1047 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Why would I blame you? If you told me at that time, I would’ve suspected that Cathy had bribed you.\nYou did the right thing. ” Shaun murmured, “ I didn’t expect Sarah to be so ruthless. She played me like a\nfiddle. It must have been hard to feign being civil with her for the past three years.”"
      },
      {
        "paragraph": "“It was fine.” Hadley hung his head. In the end, he did not tell Shaun about Suzie."
      },
      {
        "paragraph": "Even if Shaun realized it now, so what? Some harm could not be remedied unless they remarried again\nand Ms. Jones personally told him the truth about the children."
      },
      {
        "paragraph": "After all, Ms. Jones had suffered so much. If she wanted her children to acknowledge Shaun, she would\nsay it herself."
      },
      {
        "paragraph": "“Hadley, get the car. I want to go to the seaside villa. It’s time for me to get back the breakup fee I gave\nSarah.”"
      },
      {
        "paragraph": "Suddenly, Shaun ordered coldly."
      },
      {
        "paragraph": "“Yes. ” Hadley’s eyes lit up. In fact, he thought that Shaun’s breakup fee was too ridiculous, but he could\nnot say anything back then."
      },
      {
        "paragraph": "Shaun chuckled mockingly. “I’m really hopelessly stupid. Sarah played with me like a fool, ruined my\nmarriage, and killed my children, yet I gave her 1oo million dollars when I broke up with her. Breakup fee,\npast debts, I’ll get it back from her in one way or another.”"
      },
      {
        "paragraph": "“But Eldest Young Master, if word gets out, the outside world would blame you. As for Young Master\nSnow…” Hadley said honestly, “Sarah definitely won’t give you back the money. Even though she acts\nlike she sees money like dirt, she actually values money very much. She’s just afraid of you finding out\nthat she’s vain.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Rodney is me from the past. If he doesn’t wake up early, he’ll regret it sooner or later.” Shaun sneered.\n“Don’t worry about it. I don’t care about m y reputation anymore. Besides, what reputation do I have left?”"
      },
      {
        "paragraph": "One hour later, Hadley drove the car and arrived at the seaside villa."
      },
      {
        "paragraph": "Sarah was under fire for the past two days. One was because Thomas was crippled by Chester. Every\nday, Thomas screamed in pain in the hospital, cussing his mouth out."
      },
      {
        "paragraph": "Fortunately, he sealed his mouth and did not snitch on her."
      },
      {
        "paragraph": "She had just gotten back to the seaside villa when Hadley drove in."
      },
      {
        "paragraph": "She told the guard not to open the gates and pretended not to be at home."
      },
      {
        "paragraph": "However, Hadley forcefully crashed the car in."
      },
      {
        "paragraph": "The car rolled on the grass and drove to the door of the villa, where Hadley honked the horn."
      },
      {
        "paragraph": "Before long, Sarah pretended to run out in a hurry. “ Who is at my house to cause trouble? Housekeeper,\ncall the police…”"
      },
      {
        "paragraph": "Before she could finish speaking, Shaun got out of the back seat. His long legs came out first, followed\nby his elegant and tall body dressed in a black suit. His tie was meticulously tied, and when he came\nover, his back was to the light, hiding his handsome face in the shadows. He looked cold and dangerous."
      },
      {
        "paragraph": "“S-Shaun.” Thinking that Hadley was the only one who came, Sarah’s beautiful face froze."
      },
      {
        "paragraph": "Although she looked down on Shaun now, he was still a dangerous person, especially since she\nsuspected that he might have noticed something. ”This is… your home?”"
      }
    ]
  },
  {
    "title": "Chapter 1048 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun looked around. He lived here for three years, but on his way here earlier, Hadley told him that this\nwas the place he used to stay in with Catherine before. It was also the place where Catherine\naccompanied him when his illness acted up."
      },
      {
        "paragraph": "“This is my home.” Sarah could not figure out the look in his eyes."
      },
      {
        "paragraph": "“It must be quite fun to stay in a place that belongs to another.” Shaun advanced forward, step by step.\nUnderneath his eyes were bags as dark as black ink. “You proposed to live here because this is the\nplace where Catherine and I stayed before. Do you feel particularly accomplished by robbing someone\nelse’s love nest?”"
      },
      {
        "paragraph": "Sarah’s head exploded."
      },
      {
        "paragraph": "Her worst fears came true. Shaun actually discovered it."
      },
      {
        "paragraph": "How on earth did he find out?"
      },
      {
        "paragraph": "“Shaun, I don’t know what you’re talking about. ” Sarah tried to calm herself down. “We’ve already"
      },
      {
        "paragraph": "broken up. Are you saying these things to humiliate me?”"
      },
      {
        "paragraph": "“You’re quite good at acting. It’s no wonder Chester, Rodney, and I were played into your hands.” Shaun\nlaughed and sized her up as if it was the first time he was meeting her. “ Sarah Neeson, have you ever\nloved me before? Was the love you mentioned referring to my money or the power I had?”"
      },
      {
        "paragraph": "“Shaun, we’re over. I’ve been hurt enough by you. I just want to move on…”"
      },
      {
        "paragraph": "Before Sarah could finish, Shaun grabbed her arm."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "He pulled her close to him. If looks could kill, Sarah would have been skewered a thousand times by his\neyes. “Back then, I trusted you, but you hypnotized me against my will when you were treating me?"
      },
      {
        "paragraph": "“That kind of vicious method could’ve turned me into a fool, but you didn’t care about that at all. All you\ncared about was getting what you wanted and if you couldn’t get it, then you’d destroy it.”"
      },
      {
        "paragraph": "“What hypnosis? Are you crazy?” Sarah yelled. “If I hadn’t cured you, you might have gone to a mental\nhospital by now.”"
      },
      {
        "paragraph": "“I’d rather bloody go to a mental hospital. At least my wife and children would be there.” Shaun’s eyes\nwere filled with a menacing scarlet red and the hatred felt in his heart nearly drove him berserk. “ I’ve\nnever seen such a vicious woman like you."
      },
      {
        "paragraph": "What do I owe you?”"
      },
      {
        "paragraph": "“Yes, you went missing in the States, but did I tell you to go missing? Ever since we met, you keep\nasking me for things and I’ve given you everything. I showed you all the patience and care and heck, I’ve\nnever been so good even to Catherine.”"
      },
      {
        "paragraph": "“I thought Thomas was bad but at least you were principled and uncorrupted. Haha, in the end,"
      },
      {
        "paragraph": "you’ re worse than Thomas. It’s enough that you hypnotized me, but why did you lie to me and say that\nCatherine was crazy? You made me lock her up with my own hands, you evil woman.”"
      },
      {
        "paragraph": "The more Shaun spoke, the more he could not repress himself, and he dragged her and threw her into\nthe swimming pool."
      },
      {
        "paragraph": "Sarah came to the surface in fear, but Shaun grabbed her neck and choked her until her face turned red.\n“Sarah Neeson, you don’t have to explain yourself. I’ve gone to Melbourne for a checkup. My memory is\nentirely different from what I experienced. You tampered with my memory when you were treating me.”"
      },
      {
        "paragraph": "“You said that Lucifer forced you before, but that was a lie too, wasn’t it? You ran to him because I\ncouldn’t satisfy you, and when you wanted to get married, you got someone to kill him, right?”"
      },
      {
        "paragraph": "“Shaun… Shaun, I didn’t. How could I possibly hurt you…” Sarah cried and shouted hoarsely."
      },
      {
        "paragraph": "“You won’t hurt me?”"
      },
      {
        "paragraph": "Shaun burst out laughing until tears dropped. “ Haven’t you harmed me enough? What did I do in my\npast life to be unfortunate enough to meet you? When I broke up with you, I still felt indebted and gave\nyou hundreds of millions in breakup fees."
      },
      {
        "paragraph": "Sarah, are you proud of yourself?”"
      }
    ]
  },
  {
    "title": "Chapter 1049 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Shaun, you’re already entangled with lawsuits. If something happens to me, you’ll definitely go to\nprison.” Sarah was frightened by his demented look and had to distract him. “Think about your\ngrandparents. Think about the Hill family. They’re depending on you now.”"
      },
      {
        "paragraph": "“You ruined me. Do you think I still care about my life?” Shaun gripped Sarah’s chin and lifted her body.\nAt that moment, he just wanted to kill her with his own hands."
      },
      {
        "paragraph": "Sarah’s face turned purple and her body kept shaking in the water."
      },
      {
        "paragraph": "“Eldest Young Master…”"
      },
      {
        "paragraph": "“Shaun Hill, what are you doing to Sarah?”"
      },
      {
        "paragraph": "Hadley and Rodney, who rushed in, spoke at the same time."
      },
      {
        "paragraph": "After Rodney ripped Shaun away from Sarah, he hurriedly rescued her out of the water."
      },
      {
        "paragraph": "“Rodney, he’s so scary.” Sarh hugged him and burst into tears. “He wanted to kill me. I almost couldn’t\nbreathe. I… I’m so scared.”"
      },
      {
        "paragraph": "When Rodney saw the circle of red marks on her neck, blood rushed to his brain and he punched Shaun\nin anger. “You son of a b*tch.”"
      },
      {
        "paragraph": "He did not dare to imagine what would happen if Sarah had not called him earlier. He sped all the way\nhere after she said that she was afraid after someone broke into her home. If he had come one minute\nlater, Sarah might have died."
      },
      {
        "paragraph": "Shaun dodged back and blocked Rodney’s fist. “Rodney, calm down. Sarah isn’t a simple woman at all.\nShe…”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Shut up. You’ve hurt Sarah and have no right to talk about her at all. Even if you’re my brother, I won’t\nhold back.”"
      },
      {
        "paragraph": "Rodney’s fist was relentless."
      },
      {
        "paragraph": "Shaun had no choice but to throw him to the ground directly, and roared, “Three years ago, Sarah\nhypnotized me when she was treating me."
      },
      {
        "paragraph": "She tampered with my memory and made me think that I loved her. Wake up!”"
      },
      {
        "paragraph": "“This woman would do any imaginable misdeed. She doesn’t love you. She just treats you like a fallback\nguy because you have an uncle behind you who will soon be president. She had an affair with Lucifer,\nbut it wasn’t because she was forced. She did it willingly…”"
      },
      {
        "paragraph": "Rodney was stunned and then gave Shaun an incredulous look. “Are you crazy? What hypnosis? I think\nyou’re delusional. We’ve known Sarah since we were kids. Do you think I wouldn’t understand her?”"
      },
      {
        "paragraph": "Shaun glared at him. Rodney was acting delirious, just like how he was before. “Think about it carefully.\nThree years ago, I suddenly wanted to divorce Catherine, but Catherine and I were clearly in love with\neach other…”"
      },
      {
        "paragraph": "“In love?” Rodney interrupted him. “You’ve had feelings for Sarah for more than a decade. Is that feeling\ncomparable to what you have for Catherine, whom you’ve only known for several months? It’s normal for\nSarah and you to get back together when she came back to you.”"
      },
      {
        "paragraph": "Shaun was speechless. If Rodney was not his brother, he would have beaten him to death."
      },
      {
        "paragraph": "“Shaun, I really didn’t hypnotize you.” Sarah choked and cried. “I’ve never even heard of such a thing.\nHow can there be hypnosis that can tamper with people’s feelings? If I could do it, I would’ve used it on\nyou before so you wouldn’t leave me.”"
      },
      {
        "paragraph": "“Did you hear that?” Rodney hugged Sarah tightly. “Shaun, don’t you think I won’t report to the police\nwhat you just did to Sarah.”"
      },
      {
        "paragraph": "“D-Don’t report it.” Sarah hurriedly said, “He’s involved with a lawsuit now. If you report that he wants to\nmurder me, he might really get locked up.”"
      },
      {
        "paragraph": "“Hear that? Even now, she’s still thinking about you.” Rodney felt more upset the more he heard her.\n“Sarah is a kind person. How could you even mention hypnosis? Shaun, are you trying to torture her\nheart?”"
      },
      {
        "paragraph": "Shaun wanted to vomit blood."
      },
      {
        "paragraph": "He finally understood how Catherine felt when she was facing him. It was a desperate attempt to wake\nsomeone who’s asleep and the person would not give a d*mn about what you had to say."
      }
    ]
  }
]