[


  {
    "title": "Chapter 850 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine, who was eating chocolate, almost choked. What the hell. Was this guy possessed by a\nhusky?"
      },
      {
        "paragraph": "However, she smiled silly as she looked at the conversation."
      },
      {
        "paragraph": "When she finally came about, the corners of her mouth stiffened."
      },
      {
        "paragraph": "At night, in a bar."
      },
      {
        "paragraph": "Catherine sat on a barstool next to Logan, who was i n a trench coat."
      },
      {
        "paragraph": "“It must have been a hard trip to Neah Bay. How was the investigation?” Catherine opened a beer bottle\nand pushed it over."
      },
      {
        "paragraph": "“This kind of thing is confidential and usually won’t be disclosed. ” Logan took a sip of beer and said\nsmugly, “But who am I? I spent some time there and finally got wind of something. There really were a\nbunch of guys there who came to the country. At that time, a young and handsome man"
      },
      {
        "paragraph": "from Australia went over there personally and spent a lot of money to hire them.”"
      },
      {
        "paragraph": "“Is there a photo?” “Nope.”"
      },
      {
        "paragraph": "Under her gaze that seemed to say ‘you’re so useless’, Logan was offended and explained, “Come on.\nAlthough that is the most chaotic place in the world, they’re still organized. Who would dare to seek their\ncooperation if information is casually leaked out?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“A young and handsome Australian man. Thomas Neeson is out. He doesn’t have the guts to contact\nthose dangerous people.” Catherine pondered. “ Does Sarah still have helpers?”"
      },
      {
        "paragraph": "“She definitely has people backing her, ” Logan said with certainty. “But she hasn’t shown her cards yet.”"
      },
      {
        "paragraph": "“Let’s wait. She should be impatient now, so we wouldn’t have to wait for long. ” Catherine took a sip of\nbeer and suddenly showed a trace of exhaustion from her brow."
      },
      {
        "paragraph": "“What’s wrong? Are you in a bad mood?” Logan raised his brows. “ Speaking of, you’re with Shaun\nagain, right? How is the feeling of getting back with your ex-husband? Is your ex-husband who once"
      },
      {
        "paragraph": "abandoned you treating you like a treasure now?”"
      },
      {
        "paragraph": "Catherine glared at him, and Logan chuckled. “I’m just curious. After all, he was someone you loved. You\nwon’t end up being soft-hearted, right?”"
      },
      {
        "paragraph": "Catherine looked down. Her beautiful face could not be seen in the dim light."
      },
      {
        "paragraph": "“What the f*ck, you really… became soft—hearted?” Logan was speechless at her strange silence. “\nThat’s the person who hurt you deeply before. Back then, if you hadn’t faked your death, you might have\ndied. You children would’ve been taken away too.”"
      },
      {
        "paragraph": "“I know.” Catherine frowned with great annoyance. If she had not learned from Yael that nothing\nhappened between Sarah and him, she might not have been shaken at all. “I’m just… a little annoyed. In\nfact, I know that he didn’t mean to hurt me at that time. He was just hypnotized by Sarah, but the past is"
      },
      {
        "paragraph": "like an open wound to me. Sometimes, I think that I should just get revenge on Sarah and I shouldn’ t get\ntoo close to this man. He’s toxic… ”"
      },
      {
        "paragraph": "She was clearly hurt by him and thought she no longer loved him."
      },
      {
        "paragraph": "However, the two days they were together made her feel like she went back to the time when the two of\nthem used to love each other."
      },
      {
        "paragraph": "“What should I do?” She asked blankly. Should she continue or give up?"
      },
      {
        "paragraph": "“How would I know? I’ve never been in love before. But can you continue to marry him and have children\nas if it never happened?”"
      },
      {
        "paragraph": "Logan said, “Frankly, I think that if he was able to be hypnotized by Sarah in the first place, it meant that\nhe completely believed in Sarah. Back then, how much did he respect you when you were married? He\ndidn’t think that he should keep a distance from his ex-girlfriend since he had a wife. Isn’t it just\ncomeuppance that he ended up like this now?”"
      },
      {
        "paragraph": "Catherine was stunned. Yes, Shaun deserved it."
      },
      {
        "paragraph": "His stupidity harmed her and her children."
      },
      {
        "paragraph": "“Forget it, let’s go. It’s too late.” Logan yawned. He had jet lag and had not rested well. “Don’t think too\nmuch. If there’s still someone behind Sarah, then it’s not over yet. Besides, don’t forget, Sarah only just\nbroke up with Shaun. Is this the only result you want?”"
      },
      {
        "paragraph": "“You’re right.”"
      },
      {
        "paragraph": "Her eyes gradually grew cold. Sarah killed so many people and ruined Charity’s family. Charity was also\ntortured to death by Sarah. She would definitely make Sarah’s life worse than death."
      },
      {
        "paragraph": "If Shaun dared to stop her, then she would deal with him too."
      }
    ]
  },
  {
    "title": "Chapter 851 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine woke up the next day with a slightly upset stomach due to the few pints of beer she had last\nnight."
      },
      {
        "paragraph": "When she got up and washed her face, she received a call from Shaun. His voice was low. “Where did\nyou go last night?”"
      },
      {
        "paragraph": "“I had something to do with a friend…”"
      },
      {
        "paragraph": "“Is that something drinking at a bar with him?” Shaun gritted his teeth and said gloomily, “Go read the\nnews about yourself, Ms. Jones. I’ll reach your place in ten minutes. You better give me an\nexplanation.”"
      },
      {
        "paragraph": "Then, he hung up."
      },
      {
        "paragraph": "Catherine was shocked and used her phone to search for her news. The latest one was: [Yule\nCorporation’s heir talking and laughing with her mysterious boyfriend, behaving intimately.]"
      },
      {
        "paragraph": "The photo was of Logan and blurred figures of hers in the bar."
      },
      {
        "paragraph": "She narrowed her eyes and rubbed her brows. Fortunately, Logan’s face was not exposed, otherwise,\nit would be troublesome. After all, Logan was the only assistant she could trust completely."
      },
      {
        "paragraph": "These reporters really had nothing better to do. She was not some kind of public figure."
      },
      {
        "paragraph": "It seemed like she had to give them a good beating."
      },
      {
        "paragraph": "She had just changed her clothes when someone knocked on the door violently."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "When she opened the door, Shaun’s handsome and cold face brought upon an eerie chill."
      },
      {
        "paragraph": "“Who was that man?” He was going crazy with anger. He cared about her so much and held her all the\ntime, but she went behind his back to go to a bar with another man. What was even worse was that he\ncould tell from the man’s back that he was not bad-looking. His physique was good too."
      },
      {
        "paragraph": "It was not easy for him to get rid of Isaac Stringer, and now there was another random man."
      },
      {
        "paragraph": "“Catherine Jones, can’t you give me peace of mind? Will you die if you don’t provoke men all day long?\nOr are you saying that I can’t satisfy you?”"
      },
      {
        "paragraph": "He grabbed her shoulders angrily."
      },
      {
        "paragraph": "Catherine’s shoulders hurt from his grip. She looked at the man in front of her, and Logan’s words last\nnight came to mind. She should control her feelings. “Shaun Hill, I did agree to be with you, but there’s\nno law that says I can’t have contact with the opposite sex.”"
      },
      {
        "paragraph": "Her face was full of indifference, completely different from the shy and hot appearance in bed\nyesterday. Shaun felt like a bucket of cold water was poured on him, chilling him."
      },
      {
        "paragraph": "“Catherine Jones, since you’re with me, keeping a distance from the opposite sex is the basic principle\nof being a girlfriend.”"
      },
      {
        "paragraph": "Shaun said with a cold face, “I asked you out yesterday, but you’d rather spend time with an unknown\nman. What do you take me for?”"
      },
      {
        "paragraph": "“If you don’t want to believe me, then there’s nothing I can do.”"
      },
      {
        "paragraph": "Catherine turned and took out the milk from the refrigerator indifferently."
      },
      {
        "paragraph": "Shaun glared at her back. “If you don’t give me an explanation, I’ll investigate that man and find out just\nwho he is.”"
      },
      {
        "paragraph": "Then, he turned around angrily and walked out."
      },
      {
        "paragraph": "“Stop,” Catherine called him, her voice rising in anger. “Are you done? You investigate the people\naround me at the drop of a hat. You investigated Isaac before and now you’re investigating someone\nelse. Shaun Hill, if you won’t even give me a little respect, then we’ll break up.”"
      },
      {
        "paragraph": "Shaun was shocked. His face was covered with hostility and he was so angry that he punched the\ndoor, making a heavy muffled sound."
      },
      {
        "paragraph": "However, Catherine simply poured a cup of milk with a calm face, completely unaffected by his anger."
      },
      {
        "paragraph": "For a moment, Shaun was a little taken aback."
      }
    ]
  },
  {
    "title": "Chapter 852 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun was clearly upset, but why did Catherine not comfort him softly, or explain herself?"
      },
      {
        "paragraph": "As long as she begged him and promised not to go out with the opposite sex in the future, he could force\nhimself to forgive her."
      },
      {
        "paragraph": "However, this woman’s attitude was really too cold."
      },
      {
        "paragraph": "“Catherine Jones, I don’t think you realize it, but since you’re my woman, it’s not that easy to break up. I’ll\nthrow you away if I don’t want you, but it’s"
      },
      {
        "paragraph": "impossible for you to initiate a breakup.” Then, he slammed the door and left."
      },
      {
        "paragraph": "In the room, Catherine called Logan helplessly. “"
      },
      {
        "paragraph": "You were photographed by a reporter. Hide for now and don’t show your face. I’ll contact you if\nsomething happens.”"
      },
      {
        "paragraph": "The next day, Shaun did not contact her."
      },
      {
        "paragraph": "She went to the Yule family villa to accompany Lucas. When she arrived, Lucas was fiddling with a Lego\nStar Wars set."
      },
      {
        "paragraph": "“Did Grandpa buy this for you?” Catherine looked a t the box. It was a limited edition, so it should be\nquite expensive."
      },
      {
        "paragraph": "“Uncle Wesley gave it to me. He came to the kindergarten to see me yesterday.” Lucas looked up and\nsmiled, revealing a row of pearly whites."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine was surprised. She knew that Lucas rarely smiled, but he was laughing now because of\nWesley’s gift. It showed that he was really fond of the gift."
      },
      {
        "paragraph": "Wesley was always like that. He remembered what the two children liked, and was gentle and attentive."
      },
      {
        "paragraph": "Her heart suddenly became heavy."
      },
      {
        "paragraph": "She knew that Wesley had always been watching her silently from behind. He was afraid of"
      },
      {
        "paragraph": "disturbing her plan and rarely came over to find her."
      },
      {
        "paragraph": "“Lucas, do you like Uncle Wesley a lot?” Catherine asked gently."
      },
      {
        "paragraph": "“Mommy, I know that he likes you and will be good to me,” Lucas said seriously. “The most important\nthing for me is that Mommy is happy and won’t get hurt.”"
      },
      {
        "paragraph": "Catherine lowered her head and kissed her son’s forehead."
      },
      {
        "paragraph": "Joel came over with a smile. “Lucas is the most sensible child I’ve seen. He’s so sensible that it’s\nstressing me out.”"
      },
      {
        "paragraph": "“Yes. ” Catherine touched her son’s head. “Dad, are you feeling better?”"
      },
      {
        "paragraph": "“A trace of toxins was removed recently, so I’m much better.” Joel sighed. I went to Yule Corporation\nyesterday and found that your grandfather… took the leading position. He wanted me to train at home for\na while and said that he would watch the company. Needless to say, he must have been encouraged by"
      },
      {
        "paragraph": "Damien. Your grandfather even agreed to set up a joint venture with Campos Corporation. I don’t have a\ngood feeling about this…”"
      },
      {
        "paragraph": "“Dad, if you ask me, you should just let them do as they please, ” Catherine said faintly. “Just sell your\nshares and leave Yule Corporation. When your health gets better, you can set up another company by\nyourself.”"
      },
      {
        "paragraph": "Joel’s face sank. “Cathy, Yule Corporation is Dad’s heart and soul. I spent most of my life on Yule\nCorporation…”"
      },
      {
        "paragraph": "“Dad, I’ll be honest. I’m not optimistic about Campos and Yule’s cooperation. I heard a bit from"
      },
      {
        "paragraph": "Shaun. The Campos family is best at pretending to be weak, but they want to surpass the Hill family and\nbecome the top family in the country. I’m guessing that he wants to use the Yule family as a stepping\nstone.”"
      },
      {
        "paragraph": "Catherine elaborated, “Think about it. Establishing a joint venture company. The Yule family knows\nnothing about finance and has no familiar team or talents. We won’t know how the Campos family will\nmanipulate it in the future.”"
      },
      {
        "paragraph": "“Moreover, Grandpa came back and got involved. Damien and Melanie are just the same as those\nshareholders. If you want to regain control, you can’t fight with Damien anymore. If you fight with\nGrandpa, and if things go south, you’ll be called an unfilial son.”"
      },
      {
        "paragraph": "Joel’s face darkened. He saw that coming."
      },
      {
        "paragraph": "Chill ran down his spine as he thought about what his father had done."
      },
      {
        "paragraph": "Damien and his daughter did so many things to harm Joel, yet his father still forgave them."
      },
      {
        "paragraph": "Catherine added, “If I have to say, Yule Corporation’s market value is high now, and the shares are at\ntheir most valuable. Getting rid of them earlier is the best idea. Dad, sometimes, letting go is also a kind\nof success. ”"
      }
    ]
  },
  {
    "title": "Chapter 853 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Maybe you’re right…” Joel was taken aback by her words for a while and sighed sorrowfully."
      },
      {
        "paragraph": "Catherine saw him hesitated and said, “Dad, if you can’t let go, leave this matter to me. After everything\nthat has happened, don’t you understand? You value affection too much. Your guilt to Nicola, your\nbrotherly love for Damien, and your love for Grandma and Grandpa. If it weren’t for all those, would you\nand my mom fall to where you are today? Tell me honestly. Are you happy?”"
      },
      {
        "paragraph": "Joel smiled bitterly. How could he be happy? Ever since finding out that Melanie was not his child, he\nregretted every moment."
      },
      {
        "paragraph": "Those people treated him like a fool and hurt him and there were no sincere apologies at all."
      },
      {
        "paragraph": "“Okay, Cathy. I’ll leave this to you.” Joel nodded. “ I’ll hand over all my rights to you.”"
      },
      {
        "paragraph": "“Dad, when you start a new company, you can still open up new frontiers with a group of people who are\nloyal to you.”"
      },
      {
        "paragraph": "Catherine reminded him. “But don’t make this public. Otherwise, Grandma and Grandpa will be furious if\nthey find out.”"
      },
      {
        "paragraph": "The next day, Catherine arranged a group to inquire about some news in the business circle."
      },
      {
        "paragraph": "Soon, Harvey brought her the news. “Chairman Jones, President Kawada from Delta Co., Ltd. in Japan\nis very interested in Yule Corporation."
      },
      {
        "paragraph": "Coincidentally, the president is flying to Hobart today to attend tomorrow’s international porcelain trade\nfair.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Porcelain?” Catherine raised her eyebrows."
      },
      {
        "paragraph": "“Yes, President Kawada is very interested in porcelain, ” Harvey explained."
      },
      {
        "paragraph": "“Book me a plane ticket. I’ll fly to Hobart today. ” Catherine said immediately."
      },
      {
        "paragraph": "Hill Corporation."
      },
      {
        "paragraph": "At 8:00 PM, the light in the president’s office was still on."
      },
      {
        "paragraph": "Those in the secretary’s office yawned and looked a t Hadley pleadingly. “Assistant Young, please\npersuade the president not to stay up so late and let"
      },
      {
        "paragraph": "him go home early. We can’t take it anymore.”"
      },
      {
        "paragraph": "“You say that as if I can.”"
      },
      {
        "paragraph": "Hadley wanted to cry. He took a picture of the pitiful faces of everyone in the secretary"
      },
      {
        "paragraph": "department and sent it to Catherine. [Ms. Jones, can you persuade President Hill not to work overtime so\nlate? We want to go home. PS: We worked overtime until 1:00 AM last night.]"
      },
      {
        "paragraph": "Catherine replied. [You’re used to it. Just go back. I never ask my employees to accompany me every\ntime I work overtime.]"
      },
      {
        "paragraph": "Hadley. [Not everyone is as nice as you.]"
      },
      {
        "paragraph": "Hadley. [I’m busy. I have a flight, so I’m turning off my phone.]"
      },
      {
        "paragraph": "Hadley. “ ”"
      },
      {
        "paragraph": "What the hell. Ms. Jones was not in Canberra anymore."
      },
      {
        "paragraph": "He quickly checked with the airlines. Ten minutes later, he walked through the door of the office. “\nPresident Hill…”"
      },
      {
        "paragraph": "“Don’t bother me,” Shaun warned coldly and picked up his phone, glancing at it."
      },
      {
        "paragraph": "Damn it. That woman had not even called to apologize to him yet."
      },
      {
        "paragraph": "Was she making a fool out of him?"
      },
      {
        "paragraph": "Was this a payback for those times when he did her wrong when they dated previously?"
      },
      {
        "paragraph": "When he thought about that possibility, his heart seized up with a fierce pain."
      },
      {
        "paragraph": "“No, President Hill. I wanted to inform you that Ms. Jones took a plane to Hobart. ” Hadley said weakly."
      },
      {
        "paragraph": "Shaun suddenly sat up from the leather chair and stared at him with treacherous eyes. “What is she\ngoing there for?”"
      },
      {
        "paragraph": "“There’s an international porcelain fair in Hobart tomorrow. Perhaps she’s there to attend it.”"
      },
      {
        "paragraph": "Shaun was furious. When he was annoyed to death a t their couple’s fight, not only did she not apologize\nto him, she even went to attend some porcelain fair."
      },
      {
        "paragraph": "Good. Very good, Catherine Jones."
      },
      {
        "paragraph": "“Right, how did you know she went there?” Shaun suddenly asked sharply."
      },
      {
        "paragraph": "“I sent a WhatsApp message to her. She…”"
      }
    ]
  },
  {
    "title": "Chapter 854 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“You have her WhatsApp?” Shaun narrowed his eyes at Hadley. “And you chatted with her privately?”"
      },
      {
        "paragraph": "Hadley flushed. “As your assistant, I added Ms. Jones’s WhatsApp for your own good. For example,\nwhen you’re upset, I can ask her to comfort you.”"
      },
      {
        "paragraph": "“But I’m not comforted by her now.” Shaun snorted coldly. “Did she tell you that she was going t o\nHobart?”"
      },
      {
        "paragraph": "“She mentioned it, but I…”"
      },
      {
        "paragraph": "“I know. She wants to tell me about this matter using your mouth.” Shaun scoffed. “She thinks that I’d\nbecome anxious if she leaves Canberra. She can dream on.”"
      },
      {
        "paragraph": "Hadley was speechless."
      },
      {
        "paragraph": "He seriously suspected that President Hill was thinking too much."
      },
      {
        "paragraph": "“Book me a plane ticket right now. I’m going to Hobart tonight.” Shaun suddenly ordered."
      },
      {
        "paragraph": "“You’re going to… chase after Ms. Jones?” Hadley was stunned and taken off guard by the change of\nheart."
      },
      {
        "paragraph": "“Of course not. I’m going to buy porcelain. ” Shaun got up and packed up his stuff."
      },
      {
        "paragraph": "Hadley wanted to cry. It was already so late, yet he had to accompany Shaun to Hobart. Being an\nassistant was so tiring."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "In the evening, Catherine stayed in a four-star hotel in Hobart."
      },
      {
        "paragraph": "Since there were too many people coming from all around the world to attend the fair, many good hotels\nwere booked in advance, so this was the best she could get."
      },
      {
        "paragraph": "After taking a shower, she was off to bed. She was suddenly woken up by doors slamming in the next\nroom."
      },
      {
        "paragraph": "“They must be crazy. Why did they bang the door closed?” Catherine scolded in her heart."
      },
      {
        "paragraph": "Less than ten minutes later, there was loud heavy metal music next door."
      },
      {
        "paragraph": "It was so noisy that she could not sleep. She could not hold back and called the front desk of the hotel t o\ncomplain. Five minutes later, the front desk called back helplessly. “I’m sorry. Our staff went up to find the\ngentleman next door, but he said that his music didn’t exceed 5o decibels, which isn’t"
      },
      {
        "paragraph": "causing a nuisance. Even the police can’t do anything about it.”"
      },
      {
        "paragraph": "“How can there be such a person?” Catherine was annoyed. “It’s very loud. It must be more than 50\ndecibels.”"
      },
      {
        "paragraph": "“We’ve measured it. It’s only 49 decibels.” Catherine was speechless."
      },
      {
        "paragraph": "Damn it. He was making things difficult for her. It must be someone who knew the law well. She thought\nof that stupid pervert, Shaun Hill."
      },
      {
        "paragraph": "“Can you change my room?”"
      },
      {
        "paragraph": "“I’m sorry, we have no other vacant rooms left.”"
      },
      {
        "paragraph": "Catherine had a headache. She could only stuff tissues into her ears in a daze."
      },
      {
        "paragraph": "In the end, she could not sleep well at night and kept having nightmares."
      },
      {
        "paragraph": "The next day, she got up early and put on her makeup delicately before heading to the trade fair."
      },
      {
        "paragraph": "After making a turn, she soon found Mr. Kawada. He was a man in his forties, but he looked refined and\nelegant."
      },
      {
        "paragraph": "At that moment, Mr. Kawada was studying a large plate with a dragon motif."
      },
      {
        "paragraph": "The seller said, “This is from the Kangxi period, and was passed down from my ancestors. It’s an\nabsolute treasure. I didn’t sell it even when someone offered 4 million last time.”"
      },
      {
        "paragraph": "“Can I have a closer look?” Catherine walked over and asked with a smile."
      },
      {
        "paragraph": "Mr. Kawana handed the large plate to her and smiled. “Does this lady know how to appraise porcelain?”"
      },
      {
        "paragraph": "“ I know a little.” Catherine looked at it and shook her head. “This is fake.”"
      },
      {
        "paragraph": "“Hey, don’t talk nonsense.” The seller glared at her angrily. “You don’t know anything, you silly little girl.”"
      }
    ]
  },
  {
    "title": "Chapter 855 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine pointed to the large dragon motif and said, “If it’s a plate from the Kangxi period, it should have\na history of at least several hundred years, and the jade should have been silicified long ago. Look, this\narea is too reflective, and in this spot, the glaze is too uneven. But it’s a good imitation. I offer two\nthousand.”"
      },
      {
        "paragraph": "The seller’s face was crimson in embarrassment by Catherine’s claim."
      },
      {
        "paragraph": "Mr. Kawada glared at him. “You used a fake to scam me. You think I’m easy to fool because I’m not\nChinese?”"
      },
      {
        "paragraph": "“I’m not. Anyway, I think that it’s real.” The seller slunk away with the plate in his arms."
      },
      {
        "paragraph": "“Thank you, Miss.” Mr. Kawada smiled. “You look a little familiar.”"
      },
      {
        "paragraph": "“Many people say that I look familiar. ” Catherine turned and tried to slip away shyly."
      },
      {
        "paragraph": "“Wait, I remember now. You’re the heir of Yule Corporation. Your last name is… Jones… ” Kawada\nhurriedly said. “Your father is Joel Yule, right?”"
      },
      {
        "paragraph": "“You’ve got the wrong person. ” Catherine waved awkwardly."
      },
      {
        "paragraph": "“Haha, no I didn’t. I’ve met your father before.” Kawada handed her his business card."
      },
      {
        "paragraph": "Catherine read it and immediately shook his hand. “ Hello, President Kawada. I’m actually a porcelain\nenthusiast too. I secretly flew over here to see because I didn’t want others to recognize me.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“I understand. There are always people who want to curry favor in exchange for benefits. It’s too\ntroublesome.” Kawada laughed. “ It’s fate that we could meet. Look at that piece.”"
      },
      {
        "paragraph": "“Sure.”"
      },
      {
        "paragraph": "Catherine followed him, and an hour flew by. The two chatted about many things."
      },
      {
        "paragraph": "When it was lunchtime, Kawada said, “Actually, I’ve always admired Yule Corporation’s development in\nthe logistics area. By the way, since you’re Yule Corporation’s heir, when are you planning to take over\nthe company?”"
      },
      {
        "paragraph": "“It’s not that easy to take over.” Catherine smiled bitterly. “Currently, Yule Corporation’s development is\nvery good, and the stock prices also rose, but Yule Corporation’s internal management is complicated.\nThere are many people who covet my position.”"
      },
      {
        "paragraph": "“That’s true.” Kawada’s eyes flashed. “But you can’t give up this position easily. It’s your father’s hard\nwork.”"
      },
      {
        "paragraph": "“My father isn’t in good health and wants me to take care of it, but I still have another company on hand. I\ndon’t have that much energy. I might end up selling my shares. ” Catherine blurted. “But I’m afraid my\nfather will disagree, and my grandfather might get angry too. But either way, my last name is Jones, so I\ndon’t care about it that much.”"
      },
      {
        "paragraph": "Kawada gave a deep cough. “That’s true. You’re still so young, and those uncles are old and cunning, so\nit might be better to sell them. A girl has to marry eventually anyway.”"
      },
      {
        "paragraph": "“That’s right. Sometimes I want to find a boyfriend, but I’m too busy. All I want now is to go dating happily\nnow…”"
      },
      {
        "paragraph": "Just as Catherine finished speaking, she suddenly seemed to hear the sound of something shattering\nfrom next door."
      },
      {
        "paragraph": "She froze."
      },
      {
        "paragraph": "At that moment, Kawada said in a low voice, “I’ll be frank. I’m actually quite interested in logistics. Why\ndon’t you sell the shares to me? You can name a price.”"
      },
      {
        "paragraph": "“Huh?” Catherine was shocked and looked around wildly. “That… That won’t do. If my grandfather finds\nout…”"
      },
      {
        "paragraph": "“I heard that your grandfather returned to Yule Corporation. I guess that he won’t be relinquishing his\nposition for some time.” Kawada said meaningfully, “You weren’t raised by his side either. Who knows if\nhe’ll support that cousin of yours instead in the future.”"
      },
      {
        "paragraph": "Catherine was stunned and gritted her teeth. “I’d sell it for 6o million USD…”"
      },
      {
        "paragraph": "“6o million?” Kawada was shocked. That was quite a high price. “I remember your Yule Corporation’s\nmarket value is only around loo million. I’m afraid no one will buy it if you sell for 6o million, but I’d be\nwilling to buy it if you can let it go for 45 million."
      },
      {
        "paragraph": "Look, there are so many logistics companies nowadays…”"
      },
      {
        "paragraph": "Then, Kawada incessantly tried to convince Catherine."
      },
      {
        "paragraph": "Catherine pretended to listen and become more and more interested and finally agreed to sell Yule\nCorporation’s shares for 50 million USD."
      }
    ]
  },
  {
    "title": "Chapter 856 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Kawada was overjoyed. “Then let’s sign the contract at night. There’s no time like the present. ”"
      },
      {
        "paragraph": "He was afraid this little girl would turn back and tell Joel, and Joel would disagree. After all, Yule\nCorporation was the country’s largest logistics company, and they were expanding fiercely in e-\ncommerce as well. He had wanted to buy Yule Corporation for a long time."
      },
      {
        "paragraph": "“Okay, then we’ll meet tonight. I need the secretary to send the contract over. But don’t tell anyone about\nit. I’m afraid of being scolded by my father. We’ll go to the company in a few days to transfer the shares.”\nCatherine said uneasily."
      },
      {
        "paragraph": "“Sure, sure, sure. It’s settled, then.”"
      },
      {
        "paragraph": "Kawada shook hands with her and left happily. As soon as he left, Catherine grinned."
      },
      {
        "paragraph": "Selling 40% of the Yule Corporation’s shares for 50 million. Not bad."
      },
      {
        "paragraph": "When Kawada went to Yule corporation, it would surely stir up a storm. Damien, Melanie, and Charlie\nwould definitely go mad."
      },
      {
        "paragraph": "“Waiter, I’d like another cup of coffee…”"
      },
      {
        "paragraph": "She turned her head and was instantly dumbfounded when saw a tall man with a domineering presence\nstanding by the door."
      },
      {
        "paragraph": "Shaun Hill. Why was he here? Her dark eyes were wide open."
      },
      {
        "paragraph": "“Come out.” Shaun gritted his teeth and glared at her viciously, directly pulling her out."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "He had been following her since the morning and watched her constantly peeking at a middle -aged\nman, and finally striking up a conversation with him. Then, they talked and laughed over lunch."
      },
      {
        "paragraph": "He was furious at first, but his heart felt more and more complicated when he went to the room next to\ntheirs."
      },
      {
        "paragraph": "This woman was getting more and more out of hand. She approached a person like President Kawada\nwithout batting an eyelid and even played him in the palm of her hands."
      },
      {
        "paragraph": "When they went out of the hotel, Shaun sized her up deeply."
      },
      {
        "paragraph": "“When did you come?” Catherine pulled her hand"
      },
      {
        "paragraph": "back and rubbed her wrist that was pinched and sore."
      },
      {
        "paragraph": "“I’ve been following you since you came out this morning,” Shaun said gloomily."
      },
      {
        "paragraph": "Catherine was stunned but quickly reacted with a dark expression. “Were you that psycho who kept\nblasting songs last night next door?”"
      },
      {
        "paragraph": "“Who are you calling a psycho?” Shaun’s handsome face went black."
      },
      {
        "paragraph": "“It really was you. ” Catherine rubbed her forehead and snapped at him. “Are you crazy? I couldn’t sleep\nat all because of the noise.”"
      },
      {
        "paragraph": "“We’re in the same boat. You tortured me until I couldn’t sleep, so don’t think you get to sleep either.”\nShaun snorted coldly. He had two sleepless nights because of her."
      },
      {
        "paragraph": "Catherine was speechless. “You weren’t eating in the room next door, right?”"
      },
      {
        "paragraph": "She looked at his hands, where there were scars and blood marks, and remembered that she heard\nsomething being crushed earlier."
      },
      {
        "paragraph": "Shaun said gloomily, “ I originally wanted to see if you would do something sorry to me, but I ended up\nhearing that you want to find a boyfriend to go dating happily. It turns out that I’m not your boyfriend yet.\nSo, who is your boyfriend? The one who went to the bar to drink with you at night?”"
      },
      {
        "paragraph": "The corners of Catherine’s mouth twitched. She finally saw what an unreasonable man looked like. “ I\nsaid that deliberately to fool him.”"
      }
    ]
  },
  {
    "title": "Chapter 857 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Catherine Jones, what are you planning?”"
      },
      {
        "paragraph": "Shaun’s gaze was odd. “You sold Yule Corporation’s shares just like that. Does your father know?”"
      },
      {
        "paragraph": "Yule Corporation was the country’s largest logistics company and had been developing rapidly in e-\ncommerce especially in recent years. Many people were eyeing this juicy piece of meat, but Catherine\nhanded it over so easily."
      },
      {
        "paragraph": "“Yeah, I persuaded him to sell it.” Catherine shrugged coolly. “There’s internal strife in Yule Corporation,\nmy grandfather is still ambitious at his old age, Damien and his daughter eye us covetously, and the\nshareholders are made from the same mold as Damien. It’s better to just sell them all."
      },
      {
        "paragraph": "“Delta Co., Ltd. is a big company in Japan. After President Kawada enters Yule Corporation, he’ll\ndefinitely think about competing for power with my grandfather and uncles. It would be interesting to\nwatch then.”"
      },
      {
        "paragraph": "Shaun was speechless."
      },
      {
        "paragraph": "He imagined the image. Old Master Yule would probably want to vomit blood out of anger. The ancestors\nof the Yule family would climb out of the grave if they knew about it."
      },
      {
        "paragraph": "The company was the painstaking efforts of the Yule family for generations, but she sold it just like that,\nand to someone from Japan."
      },
      {
        "paragraph": "“You’re really…”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine interrupted him. “There’s one more thing. I feel like a joint venture with Campos Corporation at\nthis time is a trap. President Kawada is also very knowledgeable in the area of finance. When he joins,\nhe’ll at least disrupt Charlie’s ambition to become the top family in the country. ”"
      },
      {
        "paragraph": "“In the end, you’re just trying to help me?” Shaun’s eyes suddenly brightened."
      },
      {
        "paragraph": "“You think too much.” Catherine felt herself sweat and spat out, and walked forward."
      },
      {
        "paragraph": "However, after taking just a few steps, her arm was grabbed by Shaun and she was pulled into his arms.\nHe glared at her with a trace of chagrin and annoyance. “Catherine Jones, do you really want to break up\nwith me? I’ve been waiting for you to apologize.”"
      },
      {
        "paragraph": "“Sorry, but I have no intention to apologize, ” Catherine said coldly."
      },
      {
        "paragraph": "“You…” Shaun’s pupils glared at her. If looks could kill, she would have died countless times already."
      },
      {
        "paragraph": "He had already chased her here. Why could she not bow her head? Would she die if she apologized?"
      },
      {
        "paragraph": "“So you want to break up with me?” Shaun breathed heavily. “You went behind my back at night with\nanother man to drink at the bar and make a scandal, but I can’t say anything about it? Don’t you think\nyou’re too much?”"
      },
      {
        "paragraph": "Catherine looked up at him. No one understood him more than her. His anger was almost at the limit."
      },
      {
        "paragraph": "She sighed. “I’m not trying to break up with you. I said I had matters to attend to, which I do. Who said\nthat people can’t talk in bars? Besides, did the photo show me kissing or hugging another man?”"
      },
      {
        "paragraph": "“ In any case, it’s an undisputed fact that you went behind my back with another man.” Shaun’s tone\nsoftened slightly when she explained, but his face was still cold and hard. “I can forgive you this time,\nbut… it can’t happen again.”"
      },
      {
        "paragraph": "He said it adamantly and that tone made it seem like Catherine was begging him for forgiveness."
      },
      {
        "paragraph": "Catherine refused to bite. “Why do I have to listen to you? You’re also always alone with Sarah whenever\nyou meet with her. Call me over if you dare.”"
      },
      {
        "paragraph": "Shaun was silent for a moment and said, “I won’t meet her much in the future.”"
      },
      {
        "paragraph": "“Is that so?” Catherine faked a smile."
      },
      {
        "paragraph": "“Why would I lie to you?” Shaun snorted coldly and used a superior tone. “Forget it. Since you have a\ngood attitude and admitted your mistake, I’ll let this matter pass.”"
      },
      {
        "paragraph": "Catherine. “ ”"
      },
      {
        "paragraph": "She had a good attitude and admitted her mistake? Since when did she admit her mistake?"
      },
      {
        "paragraph": "She was in disbelief."
      },
      {
        "paragraph": "“Why are you looking at me like that?” Shaun could not help but glared at her in return. “Catherine, I’ve\ncompromised time and again for you. No woman has dared to provoke me like this before.”"
      },
      {
        "paragraph": "“How did I provoke you? I didn’t do anything.” Catherine rolled her eyes at him. “Get out of the way. I’m\ngoing back to the hotel. It’s too sunny.”"
      }
    ]
  },
  {
    "title": "Chapter 858 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Don’t go to that hotel you went to yesterday. It’s too cheap.” Shaun brought Catherine into the car. “ I\nhave a private presidential suite in a five-star hotel here.”"
      },
      {
        "paragraph": "Catherine was astonished. “When did you invest in a hotel?”"
      },
      {
        "paragraph": "“I’ve been investing in a lot of places. You’ll slowly find out in the future. ” Shaun rubbed the tip of her\nnose. “You need to know that none of the men in the whole of Australia is comparable to me.”"
      },
      {
        "paragraph": "Knowing that he was trying to imply something again, Catherine pretended that she did not understand\nhis words."
      },
      {
        "paragraph": "Once they arrived at the presidential suite, she was suddenly carried before she could even look around."
      },
      {
        "paragraph": "“Shaun…” She wrapped her arms around his neck. Looking into the man’s burning eyes, she had a\nsinking feeling. “What are you planning to do in broad daylight…”"
      },
      {
        "paragraph": "“It’s not as if we’ve never done it in broad"
      },
      {
        "paragraph": "daylight.” Shaun immediately placed her on the bed and put his hands on both her sides. He added in a\nsomber tone, “You’ve been giving me the cold shoulder for the past three nights.”"
      },
      {
        "paragraph": "“Let’s talk about it tonight, okay? Harvey is coming in a while, and I’ll be meeting President Kawada\ntonight to sign an agreement.”"
      },
      {
        "paragraph": "Catherine tried to push away his muscular body, but he did not move at all."
      },
      {
        "paragraph": "“Harvey is taking a flight here, so it’ll take him a while. We still have time to do it.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "As soon as Shaun finished speaking, he carried her and kissed her passionately to stop her from\nspeaking."
      },
      {
        "paragraph": "In the dining hall of the hotel at night."
      },
      {
        "paragraph": "After waiting for a long while, President Kawada finally saw Catherine who was late. He let out a sigh of\nrelief and then said with a smile, “I thought you regretted it and decided not to come.”"
      },
      {
        "paragraph": "“I was held up at work. ” Catherine tried her best to act natural and sat down. Deep down, she was\nscolding Shaun, that b*stard."
      },
      {
        "paragraph": "Shaun was the one who said that they could make it"
      },
      {
        "paragraph": "in time. In the end, he kept Harvey waiting outside for over an hour before he opened the door. She had\nfelt thoroughly embarrassed."
      },
      {
        "paragraph": "After signing the agreement, Catherine shared small talk with President Kawada before he took a night\nflight back to Canberra."
      },
      {
        "paragraph": "When Catherine was about to book a flight ticket to go back, Shaun grabbed her phone. “ Since we’ve\nmade an effort to come here this time, let’s not hurry to return. We can stay here and explore the place.”"
      },
      {
        "paragraph": "Hobart had a long history and a number of attractions."
      },
      {
        "paragraph": "Catherine was stunned. A moment later, she nodded. “Sure. We’ve never gone on a trip together.”"
      },
      {
        "paragraph": "“I’ll take you out more often in the future,” Shaun replied gently while carrying her."
      },
      {
        "paragraph": "The next day, Shaun drove her to the nearby Mount Wellington. After he parked the car, the two of them\nbegan to walk to Wellington Park."
      },
      {
        "paragraph": "Halfway through their walk, Catherine was so tired that she kept nagging Shaun to carry her."
      },
      {
        "paragraph": "At the sight of the visitors who were walking to and from around them, Shaun felt awkward. “You’re\nalready an adult but you’re expecting me to carry you?”"
      },
      {
        "paragraph": "“ I’m not well. I want you to carry me.” Catherine pouted coquettishly."
      },
      {
        "paragraph": "Her behavior made Shaun become muddle-headed. Unable to say no to her, he had no choice but to\ncarry her on his back."
      },
      {
        "paragraph": "During their walk, many people looked at them with admiring looks."
      },
      {
        "paragraph": "“Look how nice her husband is. He’s carrying her along this mountain path.”"
      },
      {
        "paragraph": "“Above all, he’s good-looking.”"
      },
      {
        "paragraph": "Within seconds, a lot of people had secretly taken photos of Shaun and Catherine, sharing them online."
      },
      {
        "paragraph": "In this day and age when the internet had become a fast-growing technology, the netizens soon\ndiscovered that Catherine and Shaun were on a trip together."
      }
    ]
  },
  {
    "title": "Chapter 859 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "[Is there something wrong with my memory? Didn’t Young Master Hill marry Sarah recently?]"
      },
      {
        "paragraph": "[They didn’t get married in the end. I heard the police took Sarah away during the wedding."
      },
      {
        "paragraph": "According to an insider, Sarah seemed to have wronged Elder Young Master Hill.]"
      },
      {
        "paragraph": "[So Eldest Young Master Hill is getting back together with his ex-wife? Somehow, I find Eldest Young\nMaster Hill quite scummy.]"
      },
      {
        "paragraph": "[Can’t Eldest Young Lady Jones do better? After all, not only is she the female successor of one of the\nwealthiest families in Australia, but she’s also the top architect in the world. Aren’t there any other men\non earth for her to date?]"
      },
      {
        "paragraph": "[Well, Eldest Young Master Hill is indeed good- looking and wealthy. I guess hardly any woman can resist\nhim.]"
      },
      {
        "paragraph": "[Why do I feel that Eldest Young Master Hill loves Catherine more? From the way he carries her, he\npampers her a lot.]"
      },
      {
        "paragraph": "[I think so too. When Eldest Young Master Hill was in a relationship with Sarah previously, it was rare to\ncatch him shopping with her, much less carrying her.]"
      },
      {
        "paragraph": "Sarah, who was far away in the seaside villa, flew into a rage upon seeing those netizens’ comments."
      },
      {
        "paragraph": "In fact, they were right. Although she had been together with Shaun for over ten years, Shaun had never\ngone on a trip with her, much less carried her on his back."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "A hint of determination flashed across her grim eyes. She immediately called someone…"
      },
      {
        "paragraph": "At a mountain in a town at night."
      },
      {
        "paragraph": "In the wooden villa, Catherine lay on the bed while reading the netizens’ comments. The corners of her\nmouth curved up every now and then."
      },
      {
        "paragraph": "Shaun gazed at her silently after taking his shower. She was wearing an oversized shirt with a big\nneckline, revealing the hickeys on her collarbone."
      },
      {
        "paragraph": "The moment he recalled creating this masterpiece, he was filled with unspeakable contentment."
      },
      {
        "paragraph": "“Babe, what are you watching?” Shaun approached her. When he looked at the news about him on her\nphone, a blush of shame spread across his handsome face at once."
      },
      {
        "paragraph": "“Look how interesting netizens’ comments are.” Catherine pointed at one of them and said playfully,\n“Everyone’s saying that you’re loyal because"
      },
      {
        "paragraph": "you’ve only been involved with Sarah and me. When you choose to abandon Sarah, you can have me,\nand vice versa. You never look for other women.”"
      },
      {
        "paragraph": "With an impassive face, Shaun tossed Catherine’s phone aside. “Is it funny?”"
      },
      {
        "paragraph": "“Yeah. Don’t you think it makes sense?” Catherine lifted her head and fixed her eyes on him with a grin."
      },
      {
        "paragraph": "Seeing Catherine laughing at him mercilessly, Shaun felt a tight sensation deep down and frowned. He\ncupped her face and kissed her passionately until the two of them fell onto the bed again."
      },
      {
        "paragraph": "Catherine stopped him. “What are you doing? This is endless, just like yesterday. It’s almost like you’ve\nnever slept with other women for several years.”"
      },
      {
        "paragraph": "Shaun secretly gritted his teeth. She was right, but he could not admit it considering his dignity. As such,\nhe had no choice but to mumble, “I just can’t resist your charms.”"
      },
      {
        "paragraph": "“I thought you were going to say that you’ve never slept with other women.” With her finger wandering\nacross his chest, Catherine could clearly sense that his body had frozen at her remark."
      },
      {
        "paragraph": "Shaun lowered his head and remained silent. All he wanted to do was to continue kissing her.\nNevertheless, Catherine covered his mouth and began to look serious. “Since you refuse to answer me,\nit means that you’ve slept with Sarah a lot over the last few years, right? You guys probably slept\ntogether once a day or once a week—”"
      }
    ]
  },
  {
    "title": "Chapter 860 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Catherine Jones…” Shaun interrupted Catherine with gritted teeth. His handsome face flushed with\nshame. “Stop tying this back to Sarah and me, okay?”"
      },
      {
        "paragraph": "“No, I insist on doing so. I care about it.” Catherine wrapped her arms around his neck. “Am I more\ncharming, or is she more charming? If you don’t give me an answer today, you won’t hear the end of it\nfrom me.”"
      },
      {
        "paragraph": "Shaun’s head hurt. As much as he felt like flying into a temper, the woman looked so lovely even when\nshe was being unreasonable. How could he possibly be harsh with her?"
      },
      {
        "paragraph": "“Is it so difficult to answer? I know, I’m sure you’ve slept with Sarah a lot. I’m going to ignore you now.”"
      },
      {
        "paragraph": "She pretended to be angry and pushed him away. Then, she rose to her feet and was about to leave."
      },
      {
        "paragraph": "In a state of panic, Shaun swiftly hugged her from behind. “Babe, I’ll answer you, alright? Actually…\nActually, I’ve never done it with Sarah.”"
      },
      {
        "paragraph": "Catherine froze. She turned around and glanced at him in disbelief. “Stop deceiving me. Since you loved\nher so much previously, how could you possibly not have done it with her? Shaun, this is such a blatant\nlie.”"
      },
      {
        "paragraph": "“I’m not lying.” Shaun gave a bitter laugh. “ Whenever I tried sleeping with her, I’d have an upset\nstomach. I’ve even vomited a few times. When I lost control and looked for you the other day, I didn’t get\nframed. In truth, Sarah tried to do something to me but she failed. I ended up vomiting.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine was dazed. She had just wanted to sound him out. She did not expect what Yael said to be\ntrue."
      },
      {
        "paragraph": "“You spotted me visiting the andrology unit before this, didn’t you?” Shaun gripped her hand helplessly. “I\nthought there was something wrong with me, but when I was with you later… I could function normally. I\nthought I just couldn’t deal with Sarah, so I tried it with a few other women. In the end, they also made\nme feel like vomiting.”"
      },
      {
        "paragraph": "“You even tried it with other women…?” Catherine widened her eyes."
      },
      {
        "paragraph": "“I did that for the sake of understanding my condition. Anyway, I was never planning to do it with them.\nDon’t get me wrong. In fact, my private life is very decent,” Shaun quickly explained."
      },
      {
        "paragraph": "“But why didn’t you let me know earlier?” Catherine shrank away from his grip. “You decided to be with\nme just because I can satisfy your needs, huh?”"
      },
      {
        "paragraph": "“This is exactly why I didn’t tell you. I was afraid you’d have such a thought.”"
      },
      {
        "paragraph": "Shaun said softly, “I want to be with you simply because I love you. It feels like home when I’m with you.\nWhen I’m alone, I keep thinking about you. Even during meetings, I can’t help checking my phone\nfrequently. I’m afraid I won’t get to reply to your message immediately. I’ve never changed because of\nanyone. If not love, what is this?”"
      },
      {
        "paragraph": "Catherine’s heart jerked in spite of herself."
      },
      {
        "paragraph": "Despite being clear about her ulterior motive for approaching him, she could not help but get swayed by\nhim."
      },
      {
        "paragraph": "“Cathy, stop overthinking, okay? There’s no doubt that I love you.”"
      },
      {
        "paragraph": "Shaun turned her face gently and kissed her affectionately."
      },
      {
        "paragraph": "“By the way, Sarah went to the hospital to undergo i n-vitro fertilization recently. Did you— ”"
      },
      {
        "paragraph": "“No. I only accompanied her twice for a medical check-up. I didn’t approve of it. She won’t be having a\nchild,” Shaun responded vaguely."
      },
      {
        "paragraph": "Catherine then hugged him without saying anything else."
      },
      {
        "paragraph": "Just like that, they would continue staying together for as long as they could. Even though she had a\nhidden agenda, she thought of putting it aside until some time later."
      },
      {
        "paragraph": "At this moment, Shaun’s phone rang all of a sudden."
      },
      {
        "paragraph": "He did not answer the call. When the incessant calls did not stop, he got up and answered it grumpily. “\nRodney Snow, are you asking for death?”"
      },
      {
        "paragraph": "“You’re the one asking for death, Shaun. You’re actually in the mood to go on a f*cking trip with\nCatherine when Sarah is in trouble!” Rodney roared, “She has been kidnapped! ” Shaun’s red eyes\ndarkened. “What happened?”"
      }
    ]
  },
  {
    "title": "Chapter 861 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Sarah went missing this afternoon when she went out to buy something. I couldn’t even contact her.\nOnly when I asked the housekeeper did I learn that she hadn’t returned to the seaside villa at all. I\nchecked the surveillance cameras and found that someone covered her mouth and brought her into the\ncar when she was in the car park of a shopping mall.”"
      },
      {
        "paragraph": "Rodney said furiously, “Come back right now! Now that you’ve dumped her, she might not be able to\nsurvive if this bunch of people who’ve kidnapped her are hooligans.”"
      },
      {
        "paragraph": "“I’m coming back now.” Shaun rose to his feet."
      },
      {
        "paragraph": "Catherine hugged him from behind and cast a flirtatious look at him. “Shaun, are you going to leave me\nbehind?”"
      },
      {
        "paragraph": "“You can come with me,” Shaun whispered."
      },
      {
        "paragraph": "“But I don’t want to meddle in Sarah’s affairs. Just let Rodney and Chester save her,” Catherine"
      },
      {
        "paragraph": "responded with a low voice."
      },
      {
        "paragraph": "Those words made Shaun’s eyes flash with grimness."
      },
      {
        "paragraph": "Subsequently, Rodney’s howl sounded from the phone as the call had not ended."
      },
      {
        "paragraph": "“Catherine Jones, you’re such a cruel woman! Sarah has been kidnapped and the kidnappers might kill\nher. At such a moment, you’re still feeling jealous! Don’t you have the slightest sympathy? Why did\nShaun fall for a woman like you?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Rodney!” Shaun hung up the call without letting Rodney continue."
      },
      {
        "paragraph": "He turned around and said to Catherine in a stern voice, “ If you don’t feel like coming with me, you can\nstay here. I’ll ask Elle to pick you up tomorrow o r even accompany you for a few days.”"
      },
      {
        "paragraph": "“Didn’t you assign Elle to another part of the country?”"
      },
      {
        "paragraph": "“ I’ll ask her to come back right now. ” With that, Shaun swiftly put on his clothes and took his phone."
      },
      {
        "paragraph": "When he opened the door, the mountain breeze blew in on this chilly night. She wrapped her arms\naround her body. Before she realized it, he had already left."
      },
      {
        "paragraph": "With her arms around her knees, Catherine gave a weak smile."
      },
      {
        "paragraph": "Just earlier, she had swayed upon hearing his sweet words. Little did she expect a slap in the face so\nsoon after."
      },
      {
        "paragraph": "It was not a bad thing, after all. At least, she was learning not to be so easily touched by his words."
      },
      {
        "paragraph": "She had to thank Sarah for that. Her trip with Shaun made the news during the day, and Sarah was then\nkidnapped at night. What a coincidence."
      },
      {
        "paragraph": "It must be another new plan of hers."
      },
      {
        "paragraph": "It probably had to do with that man who was heading to Neah Bay."
      },
      {
        "paragraph": "Catherine tried to call Logan, but she could not reach him."
      },
      {
        "paragraph": "Somehow, she felt as though a dark shadow was cast on her. It was just like the night sky outside."
      },
      {
        "paragraph": "She quickly leaped to her feet and looked for the owner of the villa. “Sir, can you ask someone to send\nme down the mountain immediately? I have something urgent to deal with.”"
      },
      {
        "paragraph": "“Eh? Why didn’t you go with your boyfriend? He left first and now you’re leaving at such a late hour.” The\nowner yawned. “Let me remind you that the roads here are winding. It’s not easy to travel in the middle of\nthe night.”"
      },
      {
        "paragraph": "“I really have something urgent to deal with. Please get me a good driver. I’m willing to pay any amount.”"
      },
      {
        "paragraph": "6:00 a.m."
      },
      {
        "paragraph": "Shaun entered the seaside villa under the morning sunlight."
      },
      {
        "paragraph": "The top hacker and the members of Liona as well as the brilliant people of the Jewell family were"
      },
      {
        "paragraph": "already here. In addition, there were quite a number of people from the police department."
      },
      {
        "paragraph": "Rodney punched Shaun the minute he saw him. “ It’s all because of you! If you hadn’t driven away the\nLiona members after Sarah was discharged, she wouldn’t have been kidnapped, you b*stard! If anything\nhappens to her, I won’t let you off!”"
      },
      {
        "paragraph": "Shaun held Rodney’s fist and narrowed his eyes. “ Rather than kicking a fuss here, why don’t you go\nsearch for her?”"
      },
      {
        "paragraph": "After a moment, he turned around and asked Chance. “How is it going?”"
      }
    ]
  },
  {
    "title": "Chapter 862 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Chance asked the hacker to play the recorded footage. “The car that was used to kidnap Miss Neeson\nleft the car park and headed to the parking area of a nearby playground in the suburb. As the playground\nhas just opened to the public, there are no surveillance cameras in the parking area. It’s a little\nproblematic."
      },
      {
        "paragraph": "“When we got there, there was already no one in the car. We suspect that the kidnappers have left with\nanother car. Through our inspection of every car last night, we can confirm that it’s a black Santana.”"
      },
      {
        "paragraph": "Chester said, “From what I just heard, the Santana traveled to the forest in Cheney Hill before going\nmissing.”"
      },
      {
        "paragraph": "“Stop droning on. Let’s get there first, ” Rodney said impatiently, “It’s been one night. Many things\nmight’ve already happened.”"
      },
      {
        "paragraph": "Those words made everyone’s face turn somber."
      },
      {
        "paragraph": "After Shaun got into the car, he sped past the vehicles on the road, heading toward the suburb. On his\nway there, he asked, “Have you found out who did it?”"
      },
      {
        "paragraph": "“We still can’t see the kidnappers’ faces, so we’re not sure. It could be your business competitors too.”\nChester added hesitantly, “Over the years, many people have grown to dislike the sight of you."
      },
      {
        "paragraph": "Considering that you have a close relationship with Sarah, many probably plan to threaten you with her.\nThe owner of Gloway did something like this to you previously, didn’t he?”"
      },
      {
        "paragraph": "Shaun furrowed his brows."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Rodney glared at Shaun ferociously. “Those kidnappers must be blind! They should’ve kidnapped\nCatherine instead. What does it have to do with Sarah? You’ve hurt her enough. How unfortunate she is\nto have fallen for you.”"
      },
      {
        "paragraph": "Pursing his thin lips grimly, Shaun remained silent."
      },
      {
        "paragraph": "“You’d better pray that Sarah is fine.” Rodney was so anxious that his veins were bulging out."
      },
      {
        "paragraph": "Shortly after, a crowd of people appeared in the surrounding area of Cheney Hill."
      },
      {
        "paragraph": "Less than half an hour later, someone called and claimed that the black Santana was found in the west."
      },
      {
        "paragraph": "Shaun and the rest immediately rushed there. Chance said, “We’ve searched around, and I think the\nkidnapper brought the victim away using this path.”"
      },
      {
        "paragraph": "“Kidnapper?” Shaun raised his brow grimly. “Are you suspecting that there’s only one person involved?”"
      },
      {
        "paragraph": "“Based on the footprints, I think so.”"
      },
      {
        "paragraph": "“Go hunt him down. Since he’s bringing a woman along, he should still be somewhere here.”"
      },
      {
        "paragraph": "Shaun hurriedly gave an order."
      },
      {
        "paragraph": "About ten minutes later, they suddenly heard a woman screaming."
      },
      {
        "paragraph": "“It’s Sarah.” Rodney’s expression changed drastically. He ran to the area where the sound came from."
      },
      {
        "paragraph": "Shaun went after him with large strides. Soon, they discovered a cave behind a forest."
      },
      {
        "paragraph": "Everyone scurried into the cave with torchlights. Only a shirtless young man was seen pressing on\nSarah, whose shirt had been torn in half. From her swollen face, it was clear that she had been slapped\nviolently."
      },
      {
        "paragraph": "“What a wretch.”"
      },
      {
        "paragraph": "Rodney dashed to the man to smack him, but the man soon turned around as if he had eyes on the back\nof his head. He got into a fight with Rodney."
      },
      {
        "paragraph": "Shaun rapidly took off his shirt and wrapped it around Sarah."
      },
      {
        "paragraph": "“Shaunic, Shaunic, am I dreaming? You’ve finally come to save me.” Sarah fell into his arms while\nweeping."
      },
      {
        "paragraph": "“Sorry.” The moment Shaun began speaking, Sarah suddenly pushed him away forcefully. Then, she\ncurled up and hid at one side. “Don’t touch me. I’m dirty. I’m very dirty.”"
      },
      {
        "paragraph": "“You’re not dirty. We’re here, and you’ll be fine. ” Shaun comforted her softly. “Let me bring you home,\nokay?”"
      },
      {
        "paragraph": "“No, I’ve had enough. I don’t want to live anymore. ” As soon as Sarah finished speaking, she turned\naround and slammed her head on the wall."
      },
      {
        "paragraph": "“ Sarah… ” Shaun promptly rushed toward her and carried her."
      },
      {
        "paragraph": "Sarah’s head was covered with blood. While struggling to lift her head, she touched his face and sobbed\nmiserably. “Shaunic… d-don’t bother saving me anymore, really. I… I’m in a living hell. Actually… I\nwanted to die so badly at that time. I… don’t feel like… living anymore. I hate… how dirty I am. I hate…\nhow sweet… you and Catherine are… It pains me… This is fine… I can be free now…”"
      }
    ]
  },
  {
    "title": "Chapter 863 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "As soon as Sarah finished speaking, she closed her eyes as if she was dead."
      },
      {
        "paragraph": "“ Sarah!” Shaun screamed anxiously. He placed his hand by her nose and noticed that she was still\nbreathing shallowly."
      },
      {
        "paragraph": "“Chester, come and save her at once!” Distraught, Shaun roared at Chester."
      },
      {
        "paragraph": "On the other hand, Rodney was so furious that his eyes reddened. “Chester, you must save her,\nplease.”"
      },
      {
        "paragraph": "“I will.”"
      },
      {
        "paragraph": "Chester promptly asked Shaun to lay Sarah on the ground. Fortunately, he had brought along a first aid\nkit this morning."
      },
      {
        "paragraph": "After he spent over ten minutes treating Sarah, she let out a moan in an unconscious state. She still\nremained unconscious."
      },
      {
        "paragraph": "“ I’ve tried my best. Although she’s out of danger for now, she needs to be sent to the hospital as soon\nas possible, or she’ll suffer from a shock in the brain, ” Chester said in a deep voice."
      },
      {
        "paragraph": "“Alright. I’ll send her to the hospital right now.”"
      },
      {
        "paragraph": "Shaun swiftly carried Sarah and ran toward his car. After he found his car, he raced to the hospital as\nfast as lightning."
      },
      {
        "paragraph": "After emergency treatment, Sarah was finally rescued."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun leaned on the chair, and his hands were full o f blood. The weariness he felt was indescribable."
      },
      {
        "paragraph": "“Eldest Young Master Hill, the kidnapper is being locked up in Liona’s cellar, ” Chance walked to Shaun\nand informed him."
      },
      {
        "paragraph": "Shaun raised his head and glanced at the injuries on Chance’s face. When he looked at Rodney who\nwas i n a sorry state as well, he frowned grimly. “You and Rodney were dealing with only one person.\nHow did you get injured?”"
      },
      {
        "paragraph": "Chance coughed lightly. “I could’ve dealt with him alone as we were neck and neck, but Young Master\nSnow held me back a bit…”"
      },
      {
        "paragraph": "“What do you mean? Are you saying I’m inept? ” Rodney lost his temper."
      },
      {
        "paragraph": "An awkward look washed over Chance’s face."
      },
      {
        "paragraph": "Nevertheless, Shaun’s deep-set eyes flashed with a frosty look. “Anyway, it’s rare that anyone in\nAustralia can be a match for you. Who on earth is this person? Why did he kidnap Sarah? Who is the\nmastermind behind this incident? Hurry up and find out for me.”"
      },
      {
        "paragraph": "“Okay, I’ll do it now.” Chance turned around and left once he replied."
      },
      {
        "paragraph": "When Sarah was pushed into the VIP ward, Shaun felt extremely helpless at the sight of her head that\nwas bandaged."
      },
      {
        "paragraph": "Never had he thought that she would not hesitate to bang her head against the wall to kill herself."
      },
      {
        "paragraph": "Had he hurt her so much that she did not want to live anymore? It felt like he would owe her forever."
      },
      {
        "paragraph": "“Shaun…”"
      },
      {
        "paragraph": "Rodney approached Shaun with bloodshot eyes as he had not slept for a day. On top of that, he had\ngotten into a fight as well, which made him look dejected."
      },
      {
        "paragraph": "Shaun said in a huff, “ If you’re planning to fight with me…”"
      },
      {
        "paragraph": "Before he could finish his sentence, Rodney dropped on his knees in front of him."
      },
      {
        "paragraph": "Shaun’s expression changed. “What are you doing, Rodney Snow? Get up.”"
      },
      {
        "paragraph": "“ Shaun, you know I’ve never begged anyone nor knelt in front of anyone.” Rodney gave a bitter smile\nwhile being on the verge of tears. “I’m begging you just this one time. Marry Sarah and stop being with\nCatherine. If you abandon Sarah after all these things, she’ll… die. There’s nothing else I’ll ask you for.\nI just want to see her alive.”"
      },
      {
        "paragraph": "Shaun was at a loss for words."
      },
      {
        "paragraph": "If he had not gotten back together with Catherine, he might have chosen to endure it and marry Sarah.\nHowever, now that he had experienced the sweet romance, he would be too miserable marrying a\nperson he had no feelings for."
      },
      {
        "paragraph": "Post navigation"
      }
    ]
  },
  {
    "title": "Chapter 864 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Get up.” Shaun clenched his fists."
      },
      {
        "paragraph": "“No.” Rodney gnashed his teeth with an imploring gaze. “Shaun, the doctor has managed to rescue her,\nbut what if she has nothing else to look forward to after this? What about tomorrow and the day after\ntomorrow? If she hadn’t encouraged you back in the mental hospital, you probably would’ve given up.\nLater, she took up psychology because of you. If it weren’t for her three years ago, you would’ve gone\ninsane. Why can’t you sympathize with her a little? You just have to be so cruel, huh?”"
      },
      {
        "paragraph": "Shaun’s temples twitched. He turned around to walk out of the ward straight away."
      },
      {
        "paragraph": "Rodney gripped his leg. “ Shaun, I beg you. If you don’t agree, I’ll continue to kneel here.”"
      },
      {
        "paragraph": "“Rodney, as my buddy, you’re not supposed to threaten me like this.”"
      },
      {
        "paragraph": "Shaun broke free from his grip and strode out."
      },
      {
        "paragraph": "“Rodney, get up.” Chester let out a sigh. “I understand that you want Sarah to be happy, but"
      },
      {
        "paragraph": "you can’t build her happiness on someone’s pain. Shaun has been feeling guilty over what happened to\nSarah and her life. He’s stressed too.”"
      },
      {
        "paragraph": "With that, Chester walked out."
      },
      {
        "paragraph": "Shaun lit a cigarette in the corridor and said, “ Sometimes, I think it would’ve been better if Sarah hadn’t\nsaved me three years ago.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“ Shaun, don’t put too much pressure on yourself. I n truth… you haven’t done anything wrong.” Chester\ntapped Shaun on the shoulder. “I understand. Previously, you were only forcing yourself to marry Sarah\nand you weren’t even happy.”"
      },
      {
        "paragraph": "“Thank you.”"
      },
      {
        "paragraph": "Shaun forced a smile."
      },
      {
        "paragraph": "He took out his phone and found Catherine’s WhatsApp contact. However, he had not received a\nmessage nor a call from her."
      },
      {
        "paragraph": "He pressed on the keyboard, planning to ask her something. At that moment, he recalled Sarah banging\nher head on the wall so determinedly. He ultimately paused his actions. He was mentally exhausted as\nwell."
      },
      {
        "paragraph": "In the evening, Chance came to Shaun with the latest news. However, he bit his tongue after glancing at\nRodney and Chester."
      },
      {
        "paragraph": "“Just say it. They’re not outsiders anyway,” Shaun said nonchalantly."
      },
      {
        "paragraph": "“This is the person who kidnapped Sarah.” Chance showed him a photo."
      },
      {
        "paragraph": "Shaun took the photo and was stunned at the sight o f it. Never in his wildest dreams did he think that\nthe kidnapper would be a young man in his early 20s. Although his face was badly scarred, one could tell\nhe looked handsome and thuggish."
      },
      {
        "paragraph": "Chance added, “We found his passport, and it shows that he’s not Australian. He’s from Country X, and\nhis name is Logan Law. After returning to his home country for less than three months, he entered\nAustralia under a guarantor named…"
      },
      {
        "paragraph": "Catherine Jones.”"
      },
      {
        "paragraph": "Shaun froze. His muscular body appeared to be riveted to the spot."
      },
      {
        "paragraph": "“What did you say? It was Catherine who guaranteed his entry?” Rodney was so infuriated that he curled\nhis fingers up tightly. “So is Catherine the mastermind behind the kidnapping incident yesterday?”"
      },
      {
        "paragraph": "“This is impossible,” Shaun interrupted fiercely as he crumpled the photo in his hand."
      },
      {
        "paragraph": "“I’m sure it’s her!” Rodney thundered. “She has an ulterior motive. No doubt, she hates Sarah for\nclaiming she had mental illness three years ago and hates Thomas for forcing himself upon Freya."
      },
      {
        "paragraph": "Later, Thomas was acquitted because of Sarah. Moreover, Sarah snatched you away from her, so she’s\nbeen holding a grudge against her.”"
      },
      {
        "paragraph": "“Shut your mouth!” Shaun glowered at Rodney gloomily."
      },
      {
        "paragraph": "Chester stared at the two of them. “Calm down, you guys. Can you let Chance finish first?”"
      },
      {
        "paragraph": "Chance continued, “Eldest Young Master Hill, I’m not sure if you still remember the reporter who caught\nMiss Jones drinking with a strange man in a pub a few days ago.”"
      },
      {
        "paragraph": "“Yeah.” Shaun gritted his teeth. He would remember this incident until the day he died. “Are you trying to\ntell me that the man is Logan Law?”"
      },
      {
        "paragraph": "“This is the photo taken at the pub at that time. You can compare them.” Chance took out another photo.\n“Although only his back was captured then, this man’s hairstyle is exactly the same as Logan’s. If you"
      },
      {
        "paragraph": "look at his left ear, you’ll notice that the style of their piercings is the same."
      }
    ]
  },
  {
    "title": "Chapter 865 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun continued to look at the photo. His tall and straight figure seemed to be surrounded by frostiness."
      },
      {
        "paragraph": "He was completely dazed."
      },
      {
        "paragraph": "He simply could not believe that Catherine was the one who got this man to kidnap Sarah."
      },
      {
        "paragraph": "“You still trust her, huh?”"
      },
      {
        "paragraph": "Rodney snatched the photo and swung it in front of him. “Look, they’re the same. Don’t you get it yet?\nThis is Catherine’s trap. You’ve been trapped!"
      },
      {
        "paragraph": "“She has long since arranged for someone to kidnap Sarah. After that, she lured you to Hobart so that\nshe could get the man to kidnap Sarah. If I hadn’t learned about it and got there soon enough, Sarah\nmight have been killed. This woman is too cruel!”"
      },
      {
        "paragraph": "Shaun remained motionless. He only gazed at Chester. “What do you think?”"
      },
      {
        "paragraph": "Chester’s eyes carried a complicated look. “I think… what Rodney said makes sense. Catherine has a"
      },
      {
        "paragraph": "motive, and what’s more, she knows the kidnapper. I previously reminded you that she might have a\nhidden agenda when she decided to be with you again.”"
      },
      {
        "paragraph": "“If you still refuse to believe it at this point, you’re basically fooling yourself. I’m guessing you can’t bring\nyourself to treat Catherine harshly. I want to take revenge on Sarah’s behalf. I’ll send Catherine t o the\npolice station.”"
      },
      {
        "paragraph": "Rodney turned around and dashed out of the ward."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "After being dazed for a moment, Shaun immediately went after him."
      },
      {
        "paragraph": "Shortly after, Rodney entered the elevator. Shaun had no choice but to go down the stairs, quickening\nhis pace."
      },
      {
        "paragraph": "At this moment, Catherine, who had not managed to find Logan after a long time, sent a message to a\nnumber in the States. [Quickly come back to Australia, Austin Lord. Logan might be in danger.]"
      },
      {
        "paragraph": "After sending the message, she drove back to Hackett Institute."
      },
      {
        "paragraph": "At the same time, there was unease growing within her."
      },
      {
        "paragraph": "In the two years she knew Logan, Catherine had never failed to contact him. After returning to Australia\nfor such a long time, it was her first time feeling helpless. After all, Logan was her right- hand man."
      },
      {
        "paragraph": "As soon as she parked her car, a sports car suddenly whizzed toward her. Before she could dodge it, her\ncar crashed into the wall behind her. The airbag was deployed, protecting her, but blood was surging\ninside her."
      },
      {
        "paragraph": "Subsequently, she spotted Rodney striding out of the sports car opposite her. He opened the door of her\ncar and dragged her out directly."
      },
      {
        "paragraph": "“Catherine Jones, I’ve long since wanted to kill you but I kept putting up with you. Yet this time, you\nactually dared to harm Sarah. I won’t let you off the hook for this! ”"
      },
      {
        "paragraph": "With a ferocious expression, Rodney stretched out his hand to squeeze her throat."
      },
      {
        "paragraph": "Catherine closed her eyes, trying her best to control her head so that she would not feel so dizzy. After\nthat, she lifted her hands and attacked Rodney."
      },
      {
        "paragraph": "The two of them soon got into a fight. Rodney asked his people to subdue her."
      },
      {
        "paragraph": "“I’ll personally pay you back for what you did to Sarah.” Rodney pointed at her in exasperation."
      },
      {
        "paragraph": "“I don’t have the faintest idea what you’re saying! ” Catherine found it ridiculous. “Are you suspecting that\nI kidnapped Sarah?”"
      },
      {
        "paragraph": "“If not you, who else would have done it? Even the person under you has been seized.” Rodney tossed\nthe photo at her. “Look at this person. Do you know him?”"
      },
      {
        "paragraph": "Catherine lowered her head and saw Logan being tied to a shelf. There were whip marks all over his\nbody, and his handsome face was severely wounded."
      },
      {
        "paragraph": "Her eyes suddenly conveyed a sense of grimness. “"
      },
      {
        "paragraph": "Where is he?”"
      }
    ]
  },
  {
    "title": "Chapter 866 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Just admit it. ” Rodney scoffed. “Catherine Jones, I’m giving you two options now. You can either go to\njail or let my subordinates have their fun with you. Only then will I let you off the hook.”"
      },
      {
        "paragraph": "Catherine chuckled. “For someone like you who isn’t even eligible to inherit the Snow family’s\nproperties, you’re nothing. I’m sure this bunch of people are not the masters from Snow Corporation. If\nyou guys have the guts, you can band together and attack me. Let me see how great you are.”"
      },
      {
        "paragraph": "Rodney was so exasperated that his expression changed drastically. At this moment, Shaun had\nrushed over."
      },
      {
        "paragraph": "He slammed the brakes to stop in front of their cars. He immediately got out."
      },
      {
        "paragraph": "He was still wearing the same shirt as when he had hurriedly left in the wee hours of the morning."
      },
      {
        "paragraph": "Nevertheless, his exquisitely handsome face looked extremely fierce, which was completely different\nfrom his gentle appearance yesterday."
      },
      {
        "paragraph": "At the sight of Shaun, Rodney snorted. “Shaun, you came at the right time. She’s admitted that it was\nher doing. This time, you have to give me an explanation. This cruel woman must be punished\naccordingly.”"
      },
      {
        "paragraph": "Catherine was at a loss for words. “When did I admit to kidnapping Sarah?”"
      },
      {
        "paragraph": "“You admitted that the kidnapper works for you. If you hadn’t instructed him, would he have kidnapped\nSarah of his own accord?” Rodney criticized her."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine furrowed her brows. Although Logan worked for her, he would not randomly kidnap someone\nwithout her order—unless someone had framed him."
      },
      {
        "paragraph": "She had always kept Logan a secret. No one knew about him except for a few of her close friends."
      },
      {
        "paragraph": "Could it be that someone had found out about it after the reporter captured her meeting Logan in the\npub a few days ago?"
      },
      {
        "paragraph": "Having said that, who could that person be?"
      },
      {
        "paragraph": "Could it be the young man who headed to Neah Bay, the one who also secretly assisted Sarah?"
      },
      {
        "paragraph": "Perhaps… it was Sarah’s new plan. Sarah’s purpose was to intensify the conflict between Shaun and\nher. Then, she would destroy her right-hand man,"
      },
      {
        "paragraph": "Logan."
      },
      {
        "paragraph": "The mastermind of this incident was ruthless,"
      },
      {
        "paragraph": "indeed."
      },
      {
        "paragraph": "It had been a while since she returned to Australia and it was her first time feeling so frustrated."
      },
      {
        "paragraph": "She had underestimated Sarah."
      },
      {
        "paragraph": "At this point, it was still not known who was the one secretly assisting Sarah."
      },
      {
        "paragraph": "However, what mattered now was saving Logan. She could not leave him high and dry."
      },
      {
        "paragraph": "“Look, Shaun. She feels so guilty that she’s stopped speaking.” Rodney scoffed."
      },
      {
        "paragraph": "Shaun slowly walked toward Catherine. Last night, he had imagined himself being with her forever, yet\nat this moment, he felt that he could not see through her."
      },
      {
        "paragraph": "“Why did you do such a thing?”"
      },
      {
        "paragraph": "He stared at her icily with bloodshot eyes. “If you’re holding a grudge, you can take revenge on me. I\nwas the one who hurt you previously, not Sarah. You can do anything you want to me, but why did you\nget someone to humiliate Sarah?”"
      },
      {
        "paragraph": "For a woman, nothing was crueler than accusing her of something she did not do."
      },
      {
        "paragraph": "However, it was his beloved woman who did such a horrible thing."
      },
      {
        "paragraph": "Catherine looked into his eyes impassively and calmly. “Shaun, you just told me recently that you’d try\nto trust me. Is this how you’re trusting me? Whenever it comes to Sarah’s affairs, you always suspect\nme without a second thought.”"
      },
      {
        "paragraph": "“I don’t want to suspect you either, but I’ve caught the person who works for you!” Shaun thundered, “\nWhen you met him at the pub that day, you were instructing him to kidnap Sarah, right? If you say n o\nand deny your connections with him, I’ll get someone to kill him at once.”"
      },
      {
        "paragraph": "“No!” Catherine said helplessly, “Shaun, there must be a misunderstanding. I hope you’ll investigate\nthis matter thoroughly. It’s true that Logan works for me. He’s the bodyguard I hired from overseas.\nWhen I returned to Australia, you guys were still my enemies, so I had to get someone to protect me. I\nunderstand his character. He wouldn’t do such a thing.”"
      },
      {
        "paragraph": "“Stop denying,” Rodney chimed in, “The truth is already right in front of your eyes. Logan just acted on\nyour instructions. Who else would’ve instructed him to do so if not you? In the whole of Australia, only\nyou and Freya hate Sarah.”"
      }
    ]
  },
  {
    "title": "Chapter 867 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun remained silent, but he clearly agreed with Rodney."
      },
      {
        "paragraph": "As Catherine watched the glow in Shaun’s eyes dim little by little, her heart was overwhelmed with\nsarcasm. She mocked herself for being touched by his words 24 hours ago."
      },
      {
        "paragraph": "After going through so many hardships, had it still not hit her that this man was a liar?"
      },
      {
        "paragraph": "When he wanted her, he could say everything."
      },
      {
        "paragraph": "“Shaun, I just want to ask you one thing. What can I do so that you’ll let Logan go?” Catherine asked in a\nlow voice."
      },
      {
        "paragraph": "“Let him go?” Rodney reacted as if he had heard a joke. “Are you dreaming? He hurt Sarah. People like\nhim should be tortured to death. By the way, why are you so worried about someone who works for you?\nCould it be that you’re having an affair with him?”"
      },
      {
        "paragraph": "“Watch your mouth.”"
      },
      {
        "paragraph": "As soon as Catherine warned Rodney severely, she could clearly sense the sudden fury in Shaun’s\nfrosty eyes."
      },
      {
        "paragraph": "Deep down, she was cursing Rodney. She even hoped that he would not have any descendants nor get\ntogether with the woman he loved."
      },
      {
        "paragraph": "“I can let him go,” Shaun enunciated each word sourly, “When he dies, I’ll pour his ashes into the toilet.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Shaun, Logan and I are innocent. You’d rather believe Rodney’s words than mine despite sharing a bed\nwith me. I finally understand it now.” Catherine lowered her eyes, her eyelashes hiding the glint in her\neyes."
      },
      {
        "paragraph": "Shaun was heartbroken at the sight of her expression. Was she under the impression that he wanted to\nbehave this way? It was all because of her insistence on saving Logan."
      },
      {
        "paragraph": "“Catherine Jones, you’ve let me down. I never thought… you’d be so wicked.”"
      },
      {
        "paragraph": "Rodney had said this to her many times before but she never cared about it. However, when the same\nthing came out of Shaun’s mouth, she could not help but give a faint smile."
      },
      {
        "paragraph": "Her eyes even reddened."
      },
      {
        "paragraph": "He was calling her wicked?"
      },
      {
        "paragraph": "After three years, he was still as blind as ever. He still failed to see Sarah’s true colors."
      },
      {
        "paragraph": "“How dare you still smile at this point?! ” Rodney yelled in anger."
      },
      {
        "paragraph": "“It’s funny.” Catherine wiped the moist corners of her eyes before she turned around and walked toward\nthe elevator."
      },
      {
        "paragraph": "“Stop.” Rodney immediately asked his subordinates to surround her. “Where are you planning to go?”"
      },
      {
        "paragraph": "“Why? Are you planning to seize me on your own?” A stony look flashed across Catherine’s eyes. “You\nguys aren’t the ones in charge of Australia now. You claim that I kidnapped Sarah, but do you have"
      },
      {
        "paragraph": "evidence? Just because you caught someone I know, you’re certain that it was my doing. Did the person\nyou caught mention that I was the one who instructed him to do it?”"
      },
      {
        "paragraph": "Stung by her criticisms, Rodney was so exasperated that he widened his eyes. “I don’t care! Whether or\nnot you admit it, you just can’t leave today.”"
      },
      {
        "paragraph": "“Well, Young Master Snow, this means that you’re kidnapping me by force.” Catherine approached"
      },
      {
        "paragraph": "him suddenly. “May I know whether you’re a police officer?”"
      },
      {
        "paragraph": "“I…”"
      },
      {
        "paragraph": "“You’re not. Your uncle is going to run for prime minister next year. Do you think you can act\nunscrupulously and catch anyone at random? Now, you’re trying to lay your hands on the chairwoman o f\na listed company. What’s more, I’m the daughter of Joel Yule, one of the top ten most brilliant figures in\nAustralia.”"
      },
      {
        "paragraph": "Catherine’s eyes flashed with fierceness. “Young Master Snow, your uncle has quite a number of\ncompetitors now. Everyone in the Snow family has been behaving cautiously for the sake of the election\nnext year, yet you’re only dragging your uncle down. Are you sure you want to spoil your family’s\nreputation and become the one to blame?”"
      },
      {
        "paragraph": "“You…” Rodney’s veins bulged in a fit of fury. He felt an overwhelming urge to strangle her."
      },
      {
        "paragraph": "Nevertheless, what she said was true. He knew full well how important his uncle’s election next year\nwas."
      }
    ]
  },
  {
    "title": "Chapter 868 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Rodney had once destroyed the Snow family’s reputation previously, but that had to do with his private\nlife. If he made a move against Catherine this time, it would most probably cause everyone to boycott the\nSnow family for the election next year."
      },
      {
        "paragraph": "“If you plan to arrest me, you’d better have evidence first, ” Catherine said nonchalantly. With that, she\nturned around to leave."
      },
      {
        "paragraph": "“Hold on. You’re leaving, but have you asked me?” Shaun approached her with a stony expression. “ Did\nI say you can leave?”"
      },
      {
        "paragraph": "Rodney’s eyes lit up. “Shaun, seize her and send her to Liona to torture her.”"
      },
      {
        "paragraph": "“You’re planning to seize me, huh?”"
      },
      {
        "paragraph": "Catherine looked into Shaun’s eyes, her gaze revealing a rare look of grimness."
      },
      {
        "paragraph": "His heart tightened in an instant. Suddenly, he had no idea what to say."
      },
      {
        "paragraph": "He knew if he did it, the conflict between them would intensify. However, now that she had done"
      },
      {
        "paragraph": "such a wicked thing, could he actually pretend that nothing had happened?"
      },
      {
        "paragraph": "“Shaun, why are you hesitating?” Rodney thundered, “Have you forgotten that Sarah nearly lost her life?\nHave you forgotten the look of despair on her face when she wanted to kill herself?”"
      },
      {
        "paragraph": "Catherine was dazed. Sarah actually tried to kill herself. Indeed, she had acted ruthlessly this time."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“You, come to Liona with me.” Shaun’s eyes showed a sense of astonishment. Then, he extended his\nhand to grab Catherine."
      },
      {
        "paragraph": "Before he could approach the woman in front of her, she took out a gun and jabbed him with it."
      },
      {
        "paragraph": "He froze to the spot with a look of incredulity in his eyes. It was unclear whether he was shocked\nbecause she had a gun or because she was jabbing him with it."
      },
      {
        "paragraph": "“ I won’t come with you. If you dare take me away forcefully, I’ll have no choice but to shoot you.”"
      },
      {
        "paragraph": "Catherine’s gaze was unusually calm. He felt as if she would really shoot him if he insisted on taking her\naway."
      },
      {
        "paragraph": "Grief overcame Shaun deep down. He said with a hoarse voice, “How dare you have the thought of\nshooting me?”"
      },
      {
        "paragraph": "“Should I be awaiting my fate by letting you seize m e instead?” Catherine snorted. “I didn’t do it, so why\nshould I let myself be tortured in Liona?"
      },
      {
        "paragraph": "Shaun, I’m doing this out of self-defense. You might think that I’m hurting you by pointing the gun at you,\nbut what about you? You’re trying to seize me, so aren’t you hurting me as well? Since you can bring\nyourself to hurt me without a second thought, why can’t I?”"
      },
      {
        "paragraph": "She raised the gun a little and aimed at his leg. “You can try and make a move. Just give it a try.”"
      },
      {
        "paragraph": "“If you dare shoot me, you’ll be in jail,” Shaun warned severely."
      },
      {
        "paragraph": "“ If you dare move, you’ll be crippled, ” Catherine gave him a reminder without compromising."
      },
      {
        "paragraph": "Shaun clenched his fists tightly. His eyes were filled with fury, guilt, sorrow, and despair."
      },
      {
        "paragraph": "However, Catherine did not seem to notice it. She walked backward until she entered the elevator."
      },
      {
        "paragraph": "Only after the elevator went up did her tense heart begin to relax."
      },
      {
        "paragraph": "Nobody knew that she had gone through too many things. Ever since she returned, she had placed a\ngun in her car just in case. After all, who knew"
      },
      {
        "paragraph": "whether Sarah and Shaun would want to kill her the next minute?"
      },
      {
        "paragraph": "Even so, she had not planned on firing just now. It was because she would go to jail if she did."
      },
      {
        "paragraph": "Having said that, Catherine could not have him send her to Liona. It filled her with dread. Three years\nago, Shaun sent her to a mental hospital and nearly made her go insane. Three years later, who knew\nwhat consequences she would suffer in his clutches?"
      },
      {
        "paragraph": "Also, who would save Logan if she was taken away? Luckily, she guessed it right. Shaun did not go after\nher anymore."
      }
    ]
  },
  {
    "title": "Chapter 869 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "At the car park."
      },
      {
        "paragraph": "After the elevator went up, Shaun violently punched the glass window of his car."
      },
      {
        "paragraph": "Blood flowed from his fist to the ground, yet he did not feel the slightest pain. His eyes reddened, and he\nwas overwhelmed with grief."
      },
      {
        "paragraph": "Catherine actually… pointed a gun at him."
      },
      {
        "paragraph": "What could be more painful than knowing that his beloved woman had the thought of shooting him?"
      },
      {
        "paragraph": "Ha!"
      },
      {
        "paragraph": "Was she even in love with him? How could she be so brutal?"
      },
      {
        "paragraph": "“ Shaun, aren’t you already clear about Catherine’s character by now? She has long since changed. She\nhas changed so much that we can’t see through her now. Who would carry a gun with them?”"
      },
      {
        "paragraph": "Rodney said in exasperation, “She’s been hiding a lot of things from you. She’s probably not sincere\nbeing in this relationship with you. She doesn’t even love you. She got back together with you simply\nbecause she wanted to take revenge on Sarah. Don’t you see it?”"
      },
      {
        "paragraph": "“Shut up!” Shaun glowered at him frostily. “I’m just telling the truth. Wake up and look at what’s in front of\nyou. See who’s the one truly in love with you.” As soon as Rodney finished his sentence, he opened the\ndoor of the car in a huff. “ I’m not done with this matter yet. Even though she could escape today, I won’t\nlet her off the hook tomorrow. I’m going to Liona now to interrogate that wretch.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shortly after they left, Freya came over in a rush. “ Did Shaun really seize Logan?”"
      },
      {
        "paragraph": "“Mm.” Catherine had just come out of the bathroom and changed into a set of clean clothes."
      },
      {
        "paragraph": "As she had not slept for a night, her pretty face was filled with weariness. “According to what they said,\nLogan was caught treating Sarah violently at the scene. After Sarah was rescued, she felt so humiliated\nthat she banged her head on the wall to kill herself.”"
      },
      {
        "paragraph": "“Clearly, it’s all Sarah’s doing. How could Logan possibly be interested in a woman like Sarah? Pah!"
      },
      {
        "paragraph": "He’d be afraid of contracting a disease! ” Freya insulted in a fit of fury."
      },
      {
        "paragraph": "Catherine was having a headache and rubbed her forehead. “This is just too strange. But I can’t"
      },
      {
        "paragraph": "afford to leave Logan in Liona as Shaun will take his life.”"
      },
      {
        "paragraph": "“What are your plans?” Freya asked."
      },
      {
        "paragraph": "“…I haven’t thought about it.” Catherine’s eyes flashed with confusion. “I need to meet Logan to clarify\nthe matter so that I can prove my innocence.”"
      },
      {
        "paragraph": "“Forget about it. The two b*stards, Rodney and Shaun, have been brainwashed by Sarah. They have\ncomplete trust in her. The moment Sarah cries and threatens them, they’ll still believe her even if there’s\nevidence against her."
      },
      {
        "paragraph": "Freya let out a sigh. “I don’t understand why those men trust Sarah so much even though she’s so evil.”"
      },
      {
        "paragraph": "“Exactly.” Catherine clenched her fists. “Since I can’t teach Shaun a lesson, I’ll do it to another person.”"
      },
      {
        "paragraph": "One and a half hours later."
      },
      {
        "paragraph": "Joel and Catherine went to the Snow family’s villa together."
      },
      {
        "paragraph": "The Snow family had just finished their dinner. In addition to Old Master Snow, his sons and\ngrandchildren were also there."
      }
    ]
  },
  {
    "title": "Chapter 870 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Even Nathan Snow, who was going to run for prime minister next year, was present."
      },
      {
        "paragraph": "“Joel, what brings you here at this hour?” Old Master Snow asked with a grin."
      },
      {
        "paragraph": "“Old Master Snow, I have an urgent matter to talk to you about.” A look of exasperation washed over\nJoel’s face. “If I had another choice, I wouldn’t have brought my daughter here. Jason, considering we’re\nacquaintances, I hope you’ll keep an eye on your son.”"
      },
      {
        "paragraph": "Jason was stunned. He had two sons. “You’re referring to…”"
      },
      {
        "paragraph": "“This afternoon, Rodney came to Hackett Institute and caused trouble for me.” Catherine turned on her\nphone and showed him a video. “This is the footage I got from the surveillance camera. Take a look at it.\nHe crashed into me and destroyed my car.”"
      },
      {
        "paragraph": "The other members of the Snow family came over to watch the video on the phone. All of them saw\nRodney pulling Catherine’s hair while dragging her out of the car. He even strangled her after he hit her\ncar. From the footage, they could see that he brought a lot of people along as well."
      },
      {
        "paragraph": "Old Master Snow, Jason, and the rest turned grim in an instant."
      },
      {
        "paragraph": "The Snow family was faced with a critical issue at this moment. If such a video spread to the public,\nNathan would probably be disqualified from running for prime minister next year."
      },
      {
        "paragraph": "“What actually happened?” Jason soon pulled himself together. “There must be a reason behind this.”"
      },
      {
        "paragraph": "“President Snow, given that you’re a reasonable person and also an outsider, I’m going to be frank with\nyou. Sarah was kidnapped yesterday. It happened that the person who got caught was my bodyguard."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Because of that, Rodney was convinced that it was my doing."
      },
      {
        "paragraph": "“In fact, I find this incident strange. I was in Hobart the past few days. When I came back, Rodney\ncrashed into me with his car and even tried to seize me to… get his people to force themselves on me. ”"
      },
      {
        "paragraph": "Jason’s face darkened at once. It was even darker than charcoal now."
      },
      {
        "paragraph": "Every generation of the Snow family was strict with themselves and had reputations as clean as a\nwhistle. Little did Jason expect that he would have such a cocky son."
      },
      {
        "paragraph": "Catherine continued helplessly, “I tried to reason with him, but he continued to suspect that I was the one\nbehind Sarah’s kidnapping. I wouldn’t mind if he wanted to call the police, but he must have evidence.\nEven the person whom he caught didn’t claim that I gave the instructions."
      },
      {
        "paragraph": "“I wanted to have a word with Young Master Snow, but he couldn’t be bothered about me. All he did was\ncriticize and punch me. Honestly, I don’t think my bodyguard would kidnap Sarah. There might be a\nmisunderstanding regarding this issue.”"
      },
      {
        "paragraph": "“Miss Jones, is it true that you didn’t kidnap Sarah?” Old Master Snow suddenly asked with a deep voice.\n“As far as I know, you have a personal vendetta against Sarah.”"
      },
      {
        "paragraph": "“Elder Snow, if I wanted to kidnap Sarah, I would’ve asked my bodyguard to do it. I didn’t have to hire\nsomeone else to do it.” Catherine gave a bitter laugh. “What’s more, I’ve been on friendly"
      },
      {
        "paragraph": "terms with Shaun these days. We even went on a trip together two days ago. Why would I be bothered\nto kidnap Sarah and cause my relationship with Shaun to turn sour?”"
      },
      {
        "paragraph": "The Snow family was smart. After hearing Catherine’s words, they realized that she was right."
      },
      {
        "paragraph": "Besides that, Old Master Snow still remembered that Shaun had come to pick her up in person the other\nday."
      },
      {
        "paragraph": "Joel said with a snort, “My daughter wouldn’t kidnap Sarah. On the other hand, Sarah is extremely\nwicked. Despite knowing that Shaun and Cathy were already married back then, she still approached\nShaun and shamelessly seduced him. After the two of them were caught by the reporters, a lot of people\ncriticized Sarah as the mistress."
      },
      {
        "paragraph": "“But Shaun made Catherine announce that they were bound by a marriage contract and they had gotten\na divorce due to his illness. She was also forced to say that he was truly in love with Sarah. When in fact,\nShaun and Catherine only divorced last month. If you don’t believe me, you can go to the registry office\nand check their date of divorce. ”"
      },
      {
        "paragraph": "Upon hearing this, many women in the Snow family were indignant about it."
      },
      {
        "paragraph": "Wendy was astonished. “This means that Sarah has been the mistress during these two years. I didn’t\nexpect Shaun to be playing the field. He has gone too far.”"
      },
      {
        "paragraph": "“Sarah was his first love and also his childhood sweetheart. I only have myself to blame for falling for\nsomeone who was secretly loving someone else.”"
      },
      {
        "paragraph": "Catherine said dejectedly, “You guys might not know that Shaun was really planning to marry Sarah\nbefore this, but… I guess you all saw how the police had taken Sarah away during their wedding. ”"
      },
      {
        "paragraph": "“Yeah. Sarah didn’t marry Shaun in the end, and I heard… She was having an affair with another man?”\nJason coughed lightly and replied"
      }
    ]
  },
  {
    "title": "Chapter 871 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Yes. When Sarah was in a relationship with Shaun, she was having an affair with a drug addict who was\nalso a foreigner. If I’m not mistaken, they knew each other from her time overseas. Every week, Sarah\nwould go to his apartment and sleep with him. The person who murdered the man hasn’t been found.\nPreviously, the police suspected Sarah, but they didn’t find any evidence incriminating her.”"
      },
      {
        "paragraph": "This statement astounded everyone in the Snow family."
      },
      {
        "paragraph": "After all, they were under no illusions that Rodney had been protecting Sarah in secret."
      },
      {
        "paragraph": "Although Sarah’s tarnished reputation had caused an uproar lately, it was just a rumor, after all. The\nspecific details of the incident were unknown."
      },
      {
        "paragraph": "“Are you sure that you’re telling the truth?” A somber look washed over Jessica’s face."
      },
      {
        "paragraph": "“Actually, Young Master Snow is aware of this matter as well, but he treats Sarah as a goddess. Sarah\nprobably fooled these men by claiming that she had been forced to do those things.”"
      },
      {
        "paragraph": "Catherine spoke in a weak tone, “When a man has been bewitched by a woman, he’ll believe whatever\nshe says. What’s more, the fact that Shaun chose not to marry her in the end proves that I’m not lying.\nHardly any man can accept being betrayed by their woman.”"
      },
      {
        "paragraph": "The Snow family remained silent. The other day, Shaun had said that he would rearrange the wedding\nsometime later. However, it was not mentioned anymore. When the Hill family was asked about it, they\nwere vague about it."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "When Joel realized that his daughter was almost done, he said coldly, “ I came here to tell all of you\nthese things considering the relationship between us over the years. Also, I understand Old Master\nSnow’s character. I hope that all of you will keep an eye on Rodney. I showed you the video about his\nillegal and arrogant behavior to remind you that if this video is in the hands of those with ill intentions, I’m\nafraid Nathan won’t be able to run for prime minister next year.”"
      },
      {
        "paragraph": "With an elegant and handsome face, Nathan asked nervously, “Brother Joel, the footage…”"
      },
      {
        "paragraph": "“I’ve asked the security guard in the neighborhood to delete it,” Joel responded in a generous manner."
      },
      {
        "paragraph": "The Snow family let out a sigh of relief upon hearing it. They also expressed their gratitude toward Joel\nand Catherine."
      },
      {
        "paragraph": "“Thanks, Joel. ” Old Master Snow then said with a sigh, “It must’ve frightened you, Catherine. Don’t\nworry, I’ll keep a watchful eye on Rodney and teach him a lesson on your behalf.”"
      },
      {
        "paragraph": "“Thank you, Elder Snow,” Catherine said earnestly, “Actually, when Freya tricked Rodney previously, the\noutsiders had talked about the Snow family but you guys didn’t make a fuss about it. I can tell that you\nguys are reasonable people.”"
      },
      {
        "paragraph": "The Snow family was gratified to hear it. Then, Wendy said, “Miss Jones, you’re quite a pitiful person. It\nwas very immature of Rodney. In fact, I don’t like Sarah as well, but it seems that Rodney has been\nbewitched by her and can’t live without her.”"
      },
      {
        "paragraph": "Catherine sighed. “When one loves someone without complaining, aren’t they just the same as someone\nwho has been bewitched? Looking at it from another perspective, we can say that Young Master Snow is"
      },
      {
        "paragraph": "an affectionate person. Sadly, he fell for the wrong person. If he meets someone who cherishes him, I’m\nsure the woman will cherish their relationship.”"
      },
      {
        "paragraph": "“You’re right.”"
      },
      {
        "paragraph": "Wendy nodded in satisfaction. After all, Rodney was her son. She did not wish to hear an outsider\nbelittling him. Catherine’s words gave her a huge sense of contentment. “Unfortunately, we feel that\nSarah treats him as a backup but he doesn’t seem aware of it.”"
      },
      {
        "paragraph": "“Aunty Wendy, Sarah is a clever person. Now that Young Master Snow won’t be inheriting Snow\nCorporation, she won’t accept him unless she’s desperate.”"
      },
      {
        "paragraph": "Catherine darted a profound glance at Nathan. “Of course, if Sarah and Shaun still haven’t gotten\nmarried next year and Uncle Nathan becomes the new prime minister, you’ll see Sarah going all out to\nmarry into the Snow family.”"
      },
      {
        "paragraph": "The Snow family was startled."
      }
    ]
  },
  {
    "title": "Chapter 872 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Upon realizing that they had caused quite a commotion, Joel said, “It’s already late. We’ll leave first.”"
      },
      {
        "paragraph": "“You’re leaving just like that? Why don’t you stay and have coffee with us?” Jason rose to his feet."
      },
      {
        "paragraph": "“No, we’re going to investigate the matter regarding Catherine’s bodyguard to find out who’s secretly\nframing Cathy. We must find out the truth.” Joel waved his hand before he left with Catherine."
      },
      {
        "paragraph": "After they left, Old Master Snow asked with a deep voice, “Do you think what Joel and his daughter\nsaid is true?”"
      },
      {
        "paragraph": "Jason frowned. “I think… Catherine was telling the truth. Also, Joel is a gentleman.”"
      },
      {
        "paragraph": "“Yeah.” Wendy nodded as well. “Otherwise, Joel wouldn’t have been cuckolded by Nicola who had\nbeen having an affair with Damien for over ten years. Besides that, I’ve been fond of Catherine and\nFreya since the last time I met them. They’re unlike those people who have bad intentions. Well,"
      },
      {
        "paragraph": "onlookers see most of the game. Rodney and Shaun are both involved in the situation, so they’re not\nclear about it. They claim that Catherine kidnapped Sarah, but when you think about it carefully, the\nincident is questionable.”"
      },
      {
        "paragraph": "“I suspect that Sarah was the one who staged the kidnapping incident by herself,” Jessica suddenly\nsaid, “By the look of things, Sarah is even hoping to marry Shaun. According to the recent news, Shaun\nand Catherine have gotten back together, so it’s possible that Sarah is framing Catherine out of\nanxiety.”"
      },
      {
        "paragraph": "Everyone glanced at Jessica in astonishment for half a second. Then, Old Master Snow nodded. “\nThat’s likely.”"
      },
      {
        "paragraph": "Nathan began to look impatient. “Anyhow, you guys must teach Rodney a lesson. Luckily, it was the\nYule family who came. If it were other families, they might expose our family for bullying others and\ndisregarding the law. You guys know full well that we’ve spent more than ten years preparing for next\nyear’s election.”"
      },
      {
        "paragraph": "Old Master Snow hit the arm of the chair before he lifted his head. “Ask members of Snowden to bring\nRodney back. Don’t allow him to go anywhere during this period.”"
      },
      {
        "paragraph": "“Dad, if Rodney doesn’t listen…”"
      },
      {
        "paragraph": "“Beat him up immediately,” Old Master Snow responded nonchalantly, “You can beat him anywhere,\nexcept for his head. He’s stupid enough. If you hit his head, he might become even more stupid. His life\nwill be in shambles then.”"
      },
      {
        "paragraph": "Everyone else in the Snow family was at a loss for words."
      },
      {
        "paragraph": "Old Master Snow actually had a point."
      },
      {
        "paragraph": "After the black Bentley left the Snow family’s villa, Joel comforted Catherine, saying, “Don’t worry."
      },
      {
        "paragraph": "The Snow family will deal with Rodney. Nathan and I used to be classmates, and what’s more, the\nSnow family are reasonable people.”"
      },
      {
        "paragraph": "Catherine was surprised. “Dad, you and Nathan were classmates?”"
      },
      {
        "paragraph": "“Mm. Nathan is a shrewd person. The other candidates who are running for prime minister can’t\ncompete with him. As a brilliant figure in the Snow family, Nathan will soar in the sky sooner or later.\nSo… let’s not offend them or have a falling- out with them,” Joel reminded her cautiously."
      },
      {
        "paragraph": "“Okay…” Catherine rubbed her forehead upon hearing this. “If that’s the case, I mustn’t let Sarah marry\nRodney. If Nathan ends up being the prime minister, Sarah will act even more unscrupulously.”"
      },
      {
        "paragraph": "“Don’t worry. You’ve already exposed Sarah’s true colors today. If Rodney dares marry Sarah, he’ll be\nkicked out of the Snow family.”"
      }
    ]
  },
  {
    "title": "Chapter 873 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine nodded. She was secretly glad that she had come to the Snow family today."
      },
      {
        "paragraph": "At least, she completely destroyed the possibility of Sarah getting married to Rodney."
      },
      {
        "paragraph": "Just as she was deep in her thoughts, her phone rang. It was Wesley, whom she had not contacted in a\nlong time. “Cathy, I heard about the incident regarding Logan from Freya.”"
      },
      {
        "paragraph": "Catherine was speechless. “Freya, that loudmouth"
      },
      {
        "paragraph": "“She just wants to help you. Let’s meet up,” Wesley said, “Let’s discuss what we can do.”"
      },
      {
        "paragraph": "Catherine did not think that Wesley could compete against Liona, but she could not bear to turn down his\nkindness. In the end, she nodded."
      },
      {
        "paragraph": "In Liona’s basement."
      },
      {
        "paragraph": "The sound of Rodney speaking and the sound of whipping overlapped each other. “Say it! Was it"
      },
      {
        "paragraph": "Catherine who ordered you?”"
      },
      {
        "paragraph": "“No, I didn’t… do anything. ” Logan clenched his jaw. When he could not stand it anymore, he fainted."
      },
      {
        "paragraph": "“Fck, is this bstard a mule? He’s so stubborn.”"
      },
      {
        "paragraph": "Rodney turned around and left the basement furiously. When he went up, Shaun was sitting at the bar,\ndrinking wine. His refined, handsome face was icy-cold."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Shaun, that dude fainted, ” Rodney said angrily."
      },
      {
        "paragraph": "“He hasn’t said anything?” Shaun narrowed his eyes. He thought Logan was just a typical bodyguard. He\ndid not expect him to be so loyal to Catherine. No wonder she had been impatient in telling him to let\nLogan go."
      },
      {
        "paragraph": "Rodney shook his head. “No. Forget it, I’m going to the hospital to visit Sarah. Do you want to go with\nme?”"
      },
      {
        "paragraph": "“I’ll go later after taking a bath, ” Shaun said without much of an expression as he poured himself a glass\nof wine."
      },
      {
        "paragraph": "Rodney looked at him. His lips moved, but he gave up on saying anything and just left."
      },
      {
        "paragraph": "Just as he started his car, he was surrounded by a few cars."
      },
      {
        "paragraph": "Not long after, one of Snowden’s men got down from one of the cars."
      },
      {
        "paragraph": "Rodney got out of his car after seeing them. “Tyler, why are you guys blocking my car? Move away, I\nhave something to do.”"
      },
      {
        "paragraph": "“I’m sorry, Young Master Snow. Old Master Snow has ordered me to bring you back. You have to stay\nthere for a while. During this period, you should just stay put.” Tyler had a burly body, but he was\nspeaking in a gentle tone."
      },
      {
        "paragraph": "“What do you mean by stay put?” Rodney was astonished. “My grandpa is locking me up?”"
      },
      {
        "paragraph": "“You’ve been causing too much trouble recently. In order to avoid affecting Second Master Snow’s\ncampaigns, you should go back to the family house and stay there. Don’t come out and cause trouble for\nthe Snow family anymore, ” Tyler said calmly."
      },
      {
        "paragraph": "“When have I caused trouble to the Snow family?” Rodney suddenly realized something. He was\nenraged. “Did Catherine look for my grandpa and say something?”"
      },
      {
        "paragraph": "“Let’s go.” Tyler did not want to argue with him. “I did that because—”"
      },
      {
        "paragraph": "Tyler grabbed Rodney’s hand right away before he could finish speaking."
      },
      {
        "paragraph": "“ I won’t go back.” Rodney evaded and resisted. It was fine if it were any other day, but Sarah was still in\nthe hospital now. He did not feel reassured leaving. “Tyler, I’m the young master of the Snow family. I\ndon’t believe you’ll lay a hand on me.”"
      },
      {
        "paragraph": "“In that case, don’t blame us for being rude.” Tyler waved his hand. Snowden’s members instantly\nsurrounded Rodney. They were all skilled people. Rodney’s fists could not go against so many people.\nHe got beaten up badly and could not even stand up after."
      },
      {
        "paragraph": "“Stop! ”"
      },
      {
        "paragraph": "At that moment, the doors to Liona opened. Shaun and Chance stepped out with Liona members behind\nthem. Shaun’s expression was cold. “ Rodney is my good friend, yet you’re hitting him right in front of\nme. Do you still have any respect for the Hill family?”"
      }
    ]
  },
  {
    "title": "Chapter 874 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Tyler stepped forward. He said humbly, “Young Master Hill, Master Ziegler, Snowden, and Liona have\nalways minded our own business. I’d advise you to not meddle in the internal affairs of the Snow\nfamily.”"
      },
      {
        "paragraph": "“The Snow family allows the members of Snowden t o beat up their grandchild?” Shaun found it\nunbelievable."
      },
      {
        "paragraph": "Rodney, who was beaten up until his ribs almost broke, said angrily, “It was Catherine who tattled to my\ngrandpa. She’s trying to drive a wedge between us.”"
      },
      {
        "paragraph": "A trace of anger flashed across Shaun’s eyes. That woman was so cunning and despicable."
      },
      {
        "paragraph": "Tyler said indifferently, “Old Master Snow has given his orders. If Young Master Snow resists, we can\nbeat him up however we want. This is to prevent him from causing trouble everywhere and\nembarrassing the Snow family.”"
      },
      {
        "paragraph": "“My grandpa must’ve gone crazy…” Just as Rodney finished scolding his grandfather, someone\npunched him in the stomach from behind."
      },
      {
        "paragraph": "“The crazy one is you, ” Tyler reminded coldly, “ Second Master Snow’s election is around the corner.\nEveryone in the Snow family is being careful right now and making plans for the sake of Second"
      },
      {
        "paragraph": "Master Snow’s campaign. You’re the only one who’s always loafing around and obsessing over a\nwoman every day. Old Master Snow asked you to return to get back to your senses.”"
      },
      {
        "paragraph": "After Tyler spoke, he waved his hand. The members of Snowden immediately threw Rodney into the\ncar."
      },
      {
        "paragraph": "“Young Master Hill, I’ll be taking my leave now.” Tyler turned and left."
      },
      {
        "paragraph": "Chance looked at Shaun’s awful expression. “Young Master Hill…”"
      },
      {
        "paragraph": "“No need to go after them. This is indeed the Snow family’s matter. If I forcibly intervene, Liona and\nSnowden might get into a fight today.” Shaun shook his head."
      },
      {
        "paragraph": "The Snow family was not one of the top three families in Australia."
      },
      {
        "paragraph": "However, only Shaun knew about the power the Snow family had behind the scenes. The Snow family\nhad been forbearing in order to support Nathan in obtaining the seat of the prime minister."
      },
      {
        "paragraph": "Therefore, they had always kept a low profile in the business world."
      },
      {
        "paragraph": "Nevertheless, if they were to confront each other, Liona might not necessarily win against Snowden."
      },
      {
        "paragraph": "It was just that he never expected Catherine to drive a wedge until the Snow family would raise a hand\nagainst their precious Rodney."
      },
      {
        "paragraph": "What on earth did she do?"
      },
      {
        "paragraph": "Was that woman insisting on going against him?"
      },
      {
        "paragraph": "Catherine went to Wesley’s villa straight away."
      },
      {
        "paragraph": "As there were reporters who took pictures of her and Logan last time, she did not dare to meet Wesley\nin public."
      },
      {
        "paragraph": "“Cathy, you look like you really need some rest.” Wesley served her a plate of pasta. “I’m guessing you\nhaven’t had a proper meal after knowing Logan is in trouble.”"
      },
      {
        "paragraph": "“You’re right, I am hungry. I wouldn’t have noticed if you didn’t mention it.”"
      },
      {
        "paragraph": "Catherine looked at the piping hot plate of pasta. It felt like something was blocking her throat."
      },
      {
        "paragraph": "Whenever she felt helpless, Shaun, the man who said he loved her, kept hurting her. Wesley was the\nonly one who gave her warmth. He was like a harbor where she could hide from the wind."
      },
      {
        "paragraph": "She quickly ate the pasta."
      },
      {
        "paragraph": "“Eat slowly. ” Wesley poured a glass of warm milk for her. “I know Logan is important to you. He’s\nloyal.”"
      },
      {
        "paragraph": "“That’s right. I have to save him. It’ll only be more dangerous with each passing day if he stays at\nLiona. Shaun and the rest will surely torture him. H e may not even get through tonight.” Catherine\ntightened her grip on the fork."
      },
      {
        "paragraph": "“I’ll help you, ” Wesley suddenly said. Catherine was stunned."
      },
      {
        "paragraph": "Wesley lowered his head and said, “Actually, I have some personal connections with Charlie after\nworking in Canberra all these years. He’s always wanted the formulas of our company’s best-selling\nsupplements. I can make a deal with them and have the Campos family save Logan.”"
      },
      {
        "paragraph": "“No.” Catherine shook her head in a hurry. “ If you give those formulas to the Campos family, your\ncompany’s profits will be cut in half. Besides, a huge corporation like Campos Corporation won’t even\ngive your company a chance to survive.”"
      }
    ]
  },
  {
    "title": "Chapter 875 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Wesley gazed at Catherine affectionately. He said tenderly, “Compared to the company, I’d rather not see\nyou so upset.”"
      },
      {
        "paragraph": "Catherine was startled."
      },
      {
        "paragraph": "Although she knew that Wesley loved her, she never thought that he would casually sacrifice his\ncompany’s future for her sake."
      },
      {
        "paragraph": "“Wesley, I’m not worth it… ” she said in a low voice. She was helpless but sincere."
      },
      {
        "paragraph": "“Why aren’t you worth it? You’re the director of a company that has a net worth of loo billion dollars,\nJoel’s only daughter, and Hazle Group’s head director. You have so many identities. The number o f men\nwho want to marry you can even form a queue, yet here you are saying that you’re not worth it.” Wesley\nsmiled. “On the other hand, I think you’re the one who’s out of my league.”"
      },
      {
        "paragraph": "“Stop joking around. Golden Corporation’s ranking has already entered the top 50 megacorporations of\nthe whole nation. The media always does coverage on you, the young up-and-coming president. Many"
      },
      {
        "paragraph": "daughters of wealthy families want to get married to you…”"
      },
      {
        "paragraph": "“But I don’t want to marry someone whom I don’t love, ” Wesley interrupted her. “To me, I don’t want to\nmake compromises when it comes to marriage.”"
      },
      {
        "paragraph": "Catherine was at a loss for words."
      },
      {
        "paragraph": "“I’ll contact Charlie right now…” Wesley stood up."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Wait. ” Catherine stopped him. She bit her lip. “ I want to look for Shaun and talk it out with him again.”"
      },
      {
        "paragraph": "“Do you think there’s any use talking to him?” Wesley disapproved of the idea. A hint of sadness flashed\nacross his eyes. “Cathy, are you afraid that you’ll owe me too much? Or do you have uncontrollable\nfeelings for Shaun again after spending time with him during this period?”"
      },
      {
        "paragraph": "“It’s not that.” Catherine could not bear to hurt him. She denied it straight away, saying, “Wesley, the\nsituation isn’t that dire to the point that we need to use your company to save Logan. You have t o think\nabout it. There’ll still be confrontations between me and Shaun in the future. If we play all our cards now,\nhow will we compete against Liona afterward?”"
      },
      {
        "paragraph": "“But…”"
      },
      {
        "paragraph": "“I have my own ways. I accept your good intentions. At least I know you’re the one who treats me the\nbest. ” Catherine stood up. “It’s late, I have to go.”"
      },
      {
        "paragraph": "“Cathy… ” Wesley hugged her from behind all of a sudden. His voice was filled with agony. “I don’t care\nhow things are between you and Shaun right now. I’ll just turn a blind eye to it. If I don’t think about it, I\nwon’t feel suffocated. But after everything ends, can you promise… to marry me?”"
      },
      {
        "paragraph": "“…Wesley, this is unfair to you.” Catherine felt conflicted. She thought she did not deserve Wesley."
      },
      {
        "paragraph": "“I understand. In order to let Shaun fall in love with you again, you must’ve… slept with him.” Pain"
      },
      {
        "paragraph": "flashed across Wesley’s eyes, but he still had a smile on his face. “In this time and age, many women\naren’t virgins anymore when they get married. Everyone has a few ex-boyfriends, and some even had"
      },
      {
        "paragraph": "abortions. I’m not that conservative. What I want is your future, not your past.”"
      },
      {
        "paragraph": "“…Okay.”"
      },
      {
        "paragraph": "After a long silence, Catherine finally nodded her head. “As long as you’re willing to marry me, I’ ll get\nmarried to you.”"
      },
      {
        "paragraph": "In this lifetime, she owed a lot to this man who had silently been watching over her. She could no longer\ndisappoint him."
      },
      {
        "paragraph": "After leaving Wesley’s residence, Catherine dialed Liam’s number. “One of my men is in Shaun’s hands.\nI want to go to Liona tomorrow morning, but I must guarantee that I can get out of there smoothly. I want\nto borrow Suzie.”"
      },
      {
        "paragraph": "Liam caught on immediately. “You want to threaten Shaun with Suzie?”"
      },
      {
        "paragraph": "“Mm, Shaun doesn’t know about my relationship with Suzie. I have no other choice.” Catherine smiled\nbitterly."
      },
      {
        "paragraph": "“You’re Suzie’s mother. You’ll surely not hurt her, but Shaun may not think the same,” Liam said\nworriedly, “You’ll completely ruin your relationship with Shaun this way. Not only that, he’ll forbid me from\nletting you meet Suzie in the future.”"
      },
      {
        "paragraph": "“That’s why I’m in a hurry to meet Logan to clear his name. ” Catherine narrowed her eyes. “Only in this\nway will Shaun stop targeting me.”"
      },
      {
        "paragraph": "“Are you sure you can obtain evidence?” Liam was doubtful."
      },
      {
        "paragraph": "”I can. No plan is ever completely flawless. ”"
      },
      {
        "paragraph": "At 3:00 a.m., she received a call from Austin. ”Miss Jones, I’ve arrived in Canberra.”"
      }
    ]
  },
  {
    "title": "Chapter 876 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Go pick Suzie up in the morning. Bring her to play for the whole day.” Catherine assigned him a task."
      },
      {
        "paragraph": "“Just like that?” Austin was stunned."
      },
      {
        "paragraph": "“Yes. Don’t let anybody recognize you except Suzie.”"
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "6:30 a.m."
      },
      {
        "paragraph": "When Catherine was on the way to Liona, she called Shaun."
      },
      {
        "paragraph": "“You’re finally contacting me.” Shaun’s cold, hoarse laugh could be heard. “I thought you didn’t want your\nlackey anymore.”"
      },
      {
        "paragraph": "“I want to meet Logan. I’ll arrive at Liona in 40 minutes,” Catherine said."
      },
      {
        "paragraph": "“Are you dreaming? What right do you have to make a deal with me?” Shaun said harshly, “ Catherine,\nI’ve underestimated you. You went to the Snow family to drive a wedge between them."
      },
      {
        "paragraph": "You’ve screwed Rodney over badly. I can’t even contact him up till now. He’s been locked up by the\nSnow family.”"
      },
      {
        "paragraph": "“I didn’t expect Elder Snow to be so efficient.” Catherine grinned. This was the only good news she heard\nin two days."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“So it was you, ” Shaun said coldly, “You had someone kidnap Sarah and then looked for the Snow\nfamily to deal with Rodney. I’ve never seen such a despicable, vicious woman like you.”"
      },
      {
        "paragraph": "Catherine chuckled. Of course, he had never seen one because his eyes were blind."
      },
      {
        "paragraph": "“Why are you laughing?” Shaun was annoyed by her chuckle."
      },
      {
        "paragraph": "“Come over here. I want to meet you. ” The tone of her voice was very low as if it was a whisper between\nlovers."
      },
      {
        "paragraph": "Shaun’s mind wandered for a moment. When they were dating back then, she had never used such a\ntone to talk before."
      },
      {
        "paragraph": "His thin lips moved. Just as he was about to say something, the caregiver came over in a hurry and said,\n“Eldest Young Master Hill, Ms. Neeson has woken up.”"
      },
      {
        "paragraph": "He hung up immediately and rushed to the ward."
      },
      {
        "paragraph": "In the car, Catherine looked at the call that ended. The corners of her lips lifted."
      },
      {
        "paragraph": "Shaun was really concerned about Sarah. Not only had he stayed by her side the whole night, but he\neven immediately hung up when she woke up. His eyes and heart were filled with that woman only."
      },
      {
        "paragraph": "She suddenly felt a wave of exhaustion."
      },
      {
        "paragraph": "Catherine had previously planned to let Shaun fall in love with her again. She wanted to let Sarah taste\nthe feeling of having the person she cared about the most snatched away from her. Then, she would"
      },
      {
        "paragraph": "dump Shaun to let him feel the pain she felt before."
      },
      {
        "paragraph": "She thought she was about to succeed. However, she realized all her efforts were quite hilarious."
      },
      {
        "paragraph": "What did it matter that the man said he loved her? She could never beat Sarah. Maybe Sarah could\nsatisfy his body’s needs. There was no space for her in between them both."
      },
      {
        "paragraph": "She suddenly felt like all her hard work before was meaningless."
      },
      {
        "paragraph": "She wanted to get revenge on them, but she had made herself miserable instead."
      },
      {
        "paragraph": "In the ward."
      },
      {
        "paragraph": "Sarah opened her eyes weakly. “I’m still alive. Why… am I not dead?”"
      },
      {
        "paragraph": "“Sarah, stop talking nonsense.” Shaun consoled her in a low voice."
      }
    ]
  },
  {
    "title": "Chapter 877 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“That’s right, Sarah.” Thomas chimed in, “Ever since you got hurt yesterday, Young Master Hill has\nstayed by your side without taking a step away."
      },
      {
        "paragraph": "What will he do if something happens to you?”"
      },
      {
        "paragraph": "Shaun frowned upon hearing those words. However, when he saw the gleam of hope in Sarah’s eyes, he\ncould not bring himself to say anything."
      },
      {
        "paragraph": "“Really?” Sarah looked at him in anticipation with her reddened eyes. “Shaunic, don’t you despise me?\nI’m so dirty. I almost got—”"
      },
      {
        "paragraph": "“You didn’t,” Shaun interrupted her. “Don’t think nonsense. We got there in time and stopped it from\nhappening.”"
      },
      {
        "paragraph": "“Why do these things always happen to me?” Sarah’s expression was full of despair. “I don’t know that\nperson at all. It was terrifying. He ripped all my clothes—ahh!”"
      },
      {
        "paragraph": "She suddenly hugged her head in pain."
      },
      {
        "paragraph": "“ Stop thinking about it.” Shaun grabbed her hand. Sarah flung herself into his embrace, burying her"
      },
      {
        "paragraph": "face in his arms as she trembled. “Shaunic, why did you save me? I really wanted to die. I’m exhausted.\nYesterday made me remember what had happened before in the States. I’m so helpless. Don’t leave me,\nplease?”"
      },
      {
        "paragraph": "“…Okay, I’ll be right here.” Shaun coaxed her."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Sarah gradually became quiet in his embrace. After she calmed down, Thomas immediately asked, “\nSarah, what exactly happened? Why did that person kidnap you?”"
      },
      {
        "paragraph": "“I’ m not clear about it either. I just wanted to go shopping because I was in a bad mood, but he knocked\nme out and dragged me to the car in the parking lot. When I woke up, I was already in that cave. That\nperson… He said… He said he wanted to make me a fallen woman. He even intended to take pictures\nfor the public and let everyone see… me in that state.”"
      },
      {
        "paragraph": "Sarah said chokingly, “That person wanted to destroy me, but I don’t know him at all.”"
      },
      {
        "paragraph": "“It’s too much! ” Thomas was enraged. “Eldest Young Master Hill, I heard Young Master Snow saying\nthat the kidnapper is one of Catherine’s people. You have to give Sarah an explanation.”"
      },
      {
        "paragraph": "“It was… It was Catherine who planned it?”"
      },
      {
        "paragraph": "Sarah was at a loss and became filled with fear. “ Why did she do that? You were already snatched away\nby her. What else is she dissatisfied with? I know, does she hate me for saying that she was mentally ill\nbefore? Or does she hate me for snatching you away? Maybe she hates Thomas for almost sullying her\nfriend back then. But she could’ve looked for me directly. Why did she have to use such underhanded\nmeans?”"
      },
      {
        "paragraph": "Shaun’s handsome face went as cold as ice upon hearing that."
      },
      {
        "paragraph": "After stealing a glance at Shaun, Thomas acted like he was furious and said, “Sis, don’t you"
      },
      {
        "paragraph": "understand? She doesn’t only want to get revenge on you, she wants to destroy you completely so that\nyou’ll be pointed at and cast aside no matter where you go. No man will dare to marry you in the future\nand you’ll even lose the courage to continue living.”"
      },
      {
        "paragraph": "“It’s so scary.”"
      },
      {
        "paragraph": "Sarah kept shivering. She looked at Shaun pleadingly in fear. “ Shaunic, I know you love her now. You\nwon’t hurt me because of her, right?”"
      },
      {
        "paragraph": "“No, I’ll protect you.”"
      },
      {
        "paragraph": "Shaun coaxed her gently."
      },
      {
        "paragraph": "Thomas said discontentedly, “Young Master Hill, you must give Sarah an explanation on this matter.\nDon’t let Sarah be bullied for no reason just because the Neeson family is weak. She has had a hard life.\nShe was sent to the mental hospital when she was young because her parents despised her. After\ncoming out, her family only liked Charity and disliked her. She went to the States for her studies and\neven went missing for many years. Her life is too rough. Why do the heavens treat her so unfairly?”"
      },
      {
        "paragraph": "“ I’ll give her an explanation. ” Shaun lowered his head and asked Sarah, “What do you want me to do?”"
      },
      {
        "paragraph": "Sarah shook her head and said, “Logically speaking, he should be sent to jail. But I really hate that he\ntouched me with his hands. Shaunic, can you chop off the finger that he used to touch me with? I don’t\nwant any more innocent girls to suffer because of him.”"
      },
      {
        "paragraph": "“…Okay.” Shaun was taken aback but he nodded. “ I’ll get it done later.”"
      },
      {
        "paragraph": "After about ten minutes, Sarah got tired and went back to sleep."
      },
      {
        "paragraph": "Shaun stood up. He said to Thomas, “Stay here and take care of Sarah.”"
      },
      {
        "paragraph": "“Are you going to chop off the man’s finger?” Thomas mustered his courage and said, “Eldest Young\nMaster Hill, you won’t possibly get a fake one to fool us, right? After all… Ever since you and Catherine\ngot together, you don’t even care about Sarah at all.”"
      },
      {
        "paragraph": "“…I won’t.” Shaun turned and left with a stern face."
      }
    ]
  },
  {
    "title": "Chapter 878 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Not long after Shaun left, Sarah, who was on the bed, opened her eyes."
      },
      {
        "paragraph": "“Sarah, you’re incredible.” Thomas gave her a thumbs up. He whispered, “Say, how angry will Catherine\nbe if she knows her most important subordinate is getting his finger chopped off?”"
      },
      {
        "paragraph": "Sarah squinted her eyes. How angry will Catherine be?"
      },
      {
        "paragraph": "According to the information she got, that person was Catherine’s subordinate, but Catherine treated him\nlike family."
      },
      {
        "paragraph": "Catherine cherished feelings more than anything. How angry would she be if her family member’s finger\ngot cut off?"
      },
      {
        "paragraph": "Shaun could never be together with Catherine in this lifetime."
      },
      {
        "paragraph": "At Liona, after Catherine parked her car, she walked toward the main door."
      },
      {
        "paragraph": "When the person at the door saw her, he immediately went in to report it."
      },
      {
        "paragraph": "A few minutes later, Elle brought some people with her and came over. When she saw Catherine, she\nwas stunned. “Young Madam—”"
      },
      {
        "paragraph": "“Don’t call me ‘Young Madam’ anymore. I haven’t been one since a long time ago.” Catherine looked a t\nher with a smile."
      },
      {
        "paragraph": "They had not seen each other in three years. Elle’s skin had gotten tanner. It was apparent that she was\ntransferred to a place that was not so good."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Elle, long time no see. How have you been doing these years?”"
      },
      {
        "paragraph": "“Mm, I just got transferred back here a few days ago.” Hearing Catherine’s voice which was full of\nconcern, Elle said bitterly, “My days were just normal, but I know they weren’t as tough compared to\nyours.”"
      },
      {
        "paragraph": "She had witnessed Eldest Young Master Hill’s cruelty toward Catherine. Unfortunately, she could not be\nof any help as she was a subordinate."
      },
      {
        "paragraph": "“Miss Jones, please go back while Eldest Young Master Hill isn’t here. It’s not worth it for a bodyguard, ”\nElle advised Catherine in a hurry."
      },
      {
        "paragraph": "Catherine said bitterly, “Bodyguards are humans too. Not to mention, he’s not just a bodyguard to me but\nan important family member too. As long as someone is sincere and loyal to me, I’ll protect them with all\nmy might as their superior.”"
      },
      {
        "paragraph": "Elle was taken aback. “You’re still the same as before. But… I’m worried that you may not be able to go\nout once you step in here. Eldest Young Master Hill is really furious this time.”"
      },
      {
        "paragraph": "“Since I’ve already come, I won’t back down.” Catherine walked inside with a straight back."
      },
      {
        "paragraph": "Chance appeared and invited her to the lobby. “ Miss Jones, please sit here to wait for Eldest Young\nMaster Hill.”"
      },
      {
        "paragraph": "Eldest Young Master Hill and Catherine’s relationship was too complicated. As subordinates, they did not\ndare to do anything to Catherine."
      },
      {
        "paragraph": "After all, if both of them made up again in the future, things would be difficult for them."
      },
      {
        "paragraph": "“Can I go see Logan? I didn’t bring anything with me today. I won’t be able to take him away, ”"
      },
      {
        "paragraph": "Catherine explained."
      },
      {
        "paragraph": "“I’m sorry. We need Eldest Young Master Hill’s approval.” Chance rejected her straight away."
      },
      {
        "paragraph": "Catherine did not say another word. There was someone guarding the door. She could not go anywhere."
      },
      {
        "paragraph": "20 minutes later, Shaun’s towering figure entered. He wore a black shirt and a pair of long black pants.\nThe handsome, hard outline of his face looked fierce."
      }
    ]
  },
  {
    "title": "Chapter 879 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Although they were a distance away, Catherine could sense that Shaun was in a very bad mood. Even\nhis eyes were filled with hostility."
      },
      {
        "paragraph": "When she remembered that he had come from the hospital, she knew that b*tch, Sarah, did something\nto sow discord between them again."
      },
      {
        "paragraph": "“Eldest Young Master Hill, Miss Jones said she wants to meet Logan, ” Chance stepped forward and\nsaid."
      },
      {
        "paragraph": "Shaun’s thin lips lifted in a sneer. “You can meet him, but you won’t ever come out again after going in.\nWhat do you think?”"
      },
      {
        "paragraph": "Catherine’s brows were knitted together in a tight frown. “Shaun, I’m here because I sincerely want to\nhave a peaceful talk with you. Do we have to make things like this between us?”"
      },
      {
        "paragraph": "“Do you think I’m willing to? You’re the one who forced me.” Shaun’s chest was full of hostility. It made\nhis tone become filled with annoyance as well."
      },
      {
        "paragraph": "“Catherine, did you think about my feelings when you pressed a gun against me? You did such an awful\nthing to Sarah too. You want to destroy her, and even drive her to death. You fit the description of being\nthe most vicious person.”"
      },
      {
        "paragraph": "Catherine took a deep breath."
      },
      {
        "paragraph": "Her initially calm heart was enraged by his words in an instant."
      },
      {
        "paragraph": "Catherine smiled pitifully. “The reason I want to meet Logan is to understand what happened on"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "that day. Shaun, even a prisoner on death row will be sent to court, interrogated, and investigated by the\npolice many times over. What right do you have to determine right away that I was the one who\ninstructed Logan? Have you even given me a chance to justify myself? If you don’t believe me, you can\nstand at the side later.”"
      },
      {
        "paragraph": "Shaun sneered, “ Okay, I’ll let you meet him. But don’t think of coming out for now.”"
      },
      {
        "paragraph": "After he spoke, he turned his head heartlessly and said to Chance, “Bring her to the basement.”"
      },
      {
        "paragraph": "“Eldest Young Master Hill.” Elle was worried."
      },
      {
        "paragraph": "“Shut up! It’s good enough that I’m not sending her to the police station. This is a lesson for her. ” Shaun\nstared at Catherine coldly. “Stay inside there and reflect on yourself. Think about what you did"
      },
      {
        "paragraph": "wrong, keep your vicious thoughts away, and don’t target Sarah or hate her anymore. I may consider\nletting you out then.”"
      },
      {
        "paragraph": "He turned around after he spoke and turned to the window."
      },
      {
        "paragraph": "Catherine looked at his silhouette from behind. It was merciless and indifferent."
      },
      {
        "paragraph": "This was the man she had once loved so deeply. This was the man she was still attracted to even after\nshe returned."
      },
      {
        "paragraph": "However, at that moment, her heart grew utterly cold. She could no longer feel attracted to him."
      },
      {
        "paragraph": "Chance walked over. She did not resist and let him bring her away."
      },
      {
        "paragraph": "Shaun only turned back after her back was toward him. As he looked at her silhouette from behind, there\nwas agony swirling in his eyes."
      },
      {
        "paragraph": "“Eldest Young Master Hill…” Elle kneeled on the ground with a thump. “Eldest Young Master Hill, I don’t\nthink Miss Jones is an evil person— ”"
      },
      {
        "paragraph": "Shaun shot her an icy glare before she could finish her sentence. “ Elle, you’ re the same as Yael. You\nboth made the same mistake. You’re both members of Liona, yet you let your feelings interfere in your\nactions.”"
      },
      {
        "paragraph": "“ I understand. That was why Eldest Young Master Hill transferred me away that year.”"
      },
      {
        "paragraph": "Elle smiled bitterly. “However, I was protecting Miss Jones by her side as you had ordered back then.\nShe really isn’t an evil person. Eldest Young Master Hill, I’m doing this for your sake too. You finally\nmanaged to get back together with her. If you’re too ruthless and cut off the only bit of feelings you have\nfor her, there’ll be no future for the both of you after this.”"
      },
      {
        "paragraph": "“Do you think I want to do this? Did she ever think about my feelings when she did those things? She\nclearly knows Sarah is my benefactor. I already owe Sarah a lot, yet she keeps forcing me. Maybe… she\nhas never loved me at all.” Shaun laughed miserably."
      },
      {
        "paragraph": "During those days, maybe he had even looked like a fool to her."
      },
      {
        "paragraph": "“By the way, send this to the hospital.” Shaun raised his hand and threw a bag in his hand to Elle."
      },
      {
        "paragraph": "Elle took a look. Her expression changed instantly. “ This is…”"
      },
      {
        "paragraph": "“Logan’s finger. It’s my explanation to Sarah,” Shaun said. Before he came in, he had already gone to the\nbasement."
      },
      {
        "paragraph": "Elle opened her mouth and said hesitantly, “When I met Miss Jones at the door, she had said that\nalthough Logan is her bodyguard, she treats him as her family.”"
      }
    ]
  },
  {
    "title": "Chapter 880 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun’s heart shuddered. He narrowed his eyes. “ What do you mean?”"
      },
      {
        "paragraph": "“ I’m just thinking, Eldest Young Master Hill, how would you feel if someone chopped your family\nmember’s finger off?” Elle smiled bitterly. She bent over to pick up the finger on the floor and went to the\nhospital with it."
      },
      {
        "paragraph": "Shaun stood on the spot, unmoving."
      },
      {
        "paragraph": "Summer was nearing, yet he felt his insides turning cold."
      },
      {
        "paragraph": "No, it could not be. He was just a bodyguard."
      },
      {
        "paragraph": "Besides, he had to teach Catherine a lesson. If not, he could not give Sarah an explanation."
      },
      {
        "paragraph": "In the basement."
      },
      {
        "paragraph": "Catherine was brought in. After the door opened, she immediately smelled blood. Then, she saw that\nLogan had been thrown to the floor like a sack. He had already lost consciousness."
      },
      {
        "paragraph": "His face, which used to be arrogant and unyielding, was heavily wounded. His whole body was covered\nwith wounds caused by a whip."
      },
      {
        "paragraph": "She swept a glance over his whole body. Finally, her gaze set on his hand. Her pupils shrank."
      },
      {
        "paragraph": "“His finger…”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Young Master Hill chopped it off just now, ” a member of Liona said. After that, he locked the door and\nleft."
      },
      {
        "paragraph": "Just now…"
      },
      {
        "paragraph": "Catherine’s mind exploded."
      },
      {
        "paragraph": "Just now, Shaun was here when she was waiting outside…"
      },
      {
        "paragraph": "She clenched her fists until her fingernails dug into her flesh."
      },
      {
        "paragraph": "How could a person be so ruthless?"
      },
      {
        "paragraph": "It was too cruel! He was not human at all!"
      },
      {
        "paragraph": "A teardrop fell from her eye. At that moment, her eyes were devoid of warmth and were filled only with\nhatred."
      },
      {
        "paragraph": "“Logan… Logan.” She called out his name softly. No one knew how important Logan was to her."
      },
      {
        "paragraph": "He was only younger than her by two years. She had started treating him as her brother long ago."
      },
      {
        "paragraph": "“Boss…” Logan struggled to open his eyes. “Why are you here? Shaun… Shaun locked you up too?"
      },
      {
        "paragraph": "That… b*stard.”"
      },
      {
        "paragraph": "“I… I have a way to get out of here, ” Catherine said with reddened eyes, “But your finger…”"
      },
      {
        "paragraph": "“It’s okay. Isn’t… Isn’t it just a finger?” Logan sucked in a breath from the pain. After a moment, his body\nstarted convulsing while his eyes rolled back."
      },
      {
        "paragraph": "“What’s wrong with you?” Catherine was utterly shocked."
      },
      {
        "paragraph": "“I… I was injected with drugs. ” Logan panted with huge breaths."
      },
      {
        "paragraph": "“Was it Shaun who did this?” Catherine asked with a trembling voice."
      },
      {
        "paragraph": "“No… It wasn’t him. ” Logan pounded the ground with his fists in agony. “Some time ago, I was hiding…\nas per your orders. I was cautious, but I never expected that the food delivery guy would drug my food.\nWhen I woke up… I was already thrown in the cave."
      },
      {
        "paragraph": "“Sarah was at the side too. I started having withdrawal symptoms at that time. I could not control myself\nat all. After that… Shaun and the rest came. It was a scheme.”"
      },
      {
        "paragraph": "Catherine was horrified. She knew that someone was trying to frame them. However, according to\nLogan’s words, it was as if someone had monitored all of Logan’s and her movements."
      }
    ]
  },
  {
    "title": "Chapter 881 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“All these… must be connected to Sarah. But… what’s scarier is the person hiding behind Sarah. ”"
      },
      {
        "paragraph": "Logan struggled and said, “He’s already… targeting us.”"
      },
      {
        "paragraph": "Catherine shuddered. “Did you tell Shaun about this?”"
      },
      {
        "paragraph": "“ I did, but… they think I’m lying.” Logan laughed bitterly. “Boss, you… You have a bad eye. I’m even…\nstronger than him.”"
      },
      {
        "paragraph": "“ I’m sorry. Can you stand it?” Catherine looked at him worriedly."
      },
      {
        "paragraph": "“The most agonizing thing… is the withdrawal symptoms.” Logan was gasping. “But… the pain in my\nbody helps me stay awake and control… myself. Besides, death… is nothing. I owe you my life anyway.”"
      },
      {
        "paragraph": "“Don’t say any more. I’ll get you out of here.”"
      },
      {
        "paragraph": "Catherine held his hands and swore with reddened eyes."
      },
      {
        "paragraph": "The metal doors suddenly opened. Shaun stood at the door. When he saw both of their hands tightly\nclasped together, hostility flashed across his eyes."
      },
      {
        "paragraph": "“Looks like not only do you not want your finger, but you don’t even want your hand anymore.”"
      },
      {
        "paragraph": "Shaun walked over in long strides. He yanked Catherine away and stomped on the back of Logan’s hand\nhard."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“ Stop it!” Catherine could not tolerate it anymore and punched Shaun."
      },
      {
        "paragraph": "Shaun was caught off guard and staggered"
      },
      {
        "paragraph": "backward after getting hit. He felt his blood boiling i n his chest. However, the pain he felt was\nincomparable to the pain in his heart."
      },
      {
        "paragraph": "“You actually hit me for another man’s sake! ” Shaun stared at Catherine angrily like a lion that was about\nto go on a rampage. “Since you care about him that much, I’ll kill him.”"
      },
      {
        "paragraph": "“Shaun, if you dare kill him, I’ll die right in front of you,” Catherine threatened him furiously."
      },
      {
        "paragraph": "“You love him?” Shaun’s gaze was like a demon’s gaze."
      },
      {
        "paragraph": "“I don’t love him, but he’s an important family member of mine.” Catherine raised her reddened"
      },
      {
        "paragraph": "eyes. “In those two years, Freya and I had gone through many hardships when we were overseas. If it\nweren’t for Logan’s protection, I would’ve been dead already. I saved him before, and I asked him to\nprotect me by my side for ten years. In these ten years, I can’t let him die.”"
      },
      {
        "paragraph": "Shaun’s gaze turned better, but it was still awful. “If so, why were you grabbing his hand just now?"
      },
      {
        "paragraph": "You’re my woman. I don’t allow you to hold any other man’s hand.”"
      },
      {
        "paragraph": "“I’m your woman? ” Catherine chuckled, but her smile looked more awful than someone who was crying.\n“Forget it. I was never your woman from the start. It’s Sarah. I won’t have that sort of fantasy anymore.”"
      },
      {
        "paragraph": "Shaun’s expression changed. “Enough. If you hadn’t hurt Sarah, I wouldn’t be treating you this way.\nYou’re the one who’s in the wrong. You’ve never once put yourself in my shoes. I even suspect … you\nonly got in a relationship with me in order to get revenge on Sarah and me.”"
      },
      {
        "paragraph": "“Yes, I am getting revenge on you. I served you until you were satisfied every night.” Catherine laughed\nbitterly. “ I never wanted your protection nor your wealth. I even cooked for you and warmed your bed.\nEldest Young Master Hill, tell me, where can you find a woman like me?”"
      },
      {
        "paragraph": "Shaun was speechless from her words, but what he felt more was regret. “As long as you sincerely\nrepent, beg for Sarah’s forgiveness, and apologize, I can forgive you.”"
      },
      {
        "paragraph": "“Haha.” Logan, who was sprawled on the floor, suddenly laughed. “Boss, this is the man you fell in love\nwith? What pile of trash is he?”"
      },
      {
        "paragraph": "“Looks like I’ve been going easy on you these days.” Shaun narrowed his eyes scarily."
      },
      {
        "paragraph": "Catherine’s pretty face was expressionless. “Shaun, you don’t need to forgive me anymore.”"
      },
      {
        "paragraph": "“What do you mean?” Shaun was taken aback."
      },
      {
        "paragraph": "“What does she mean? Don’t you understand it yet?” Logan laughed sarcastically. “ It means that she…\ndoesn’t need to be with you anymore. Do you think you’re the… only man in the world?”"
      }
    ]
  },
  {
    "title": "Chapter 882 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun’s expression changed. He stared at Catherine without budging."
      },
      {
        "paragraph": "Catherine’s eyes were like stagnant lake water— calm without any ripples."
      },
      {
        "paragraph": "“What he said is right. If we were officially dating before, then I’m saying this formally. Shaun, let’s break\nup. It’s impossible for me to be with you anymore. It’ll never be possible again. Therefore, it’s not\nimportant whether you forgive me or not.”"
      },
      {
        "paragraph": "Shaun looked at the woman in front of him who had a calm, determined expression. His strong heart\nshuddered hard."
      },
      {
        "paragraph": "A sense of indescribable helplessness shrouded him."
      },
      {
        "paragraph": "Catherine was so close to him at that moment, yet i t was as if there were mountains and rivers between\nthem."
      },
      {
        "paragraph": "No one would know that he had never thought of breaking up. Even when Rodney kneeled in front of\nhim… Even when he knew she was the one who instructed Logan, he wanted to use Logan as a"
      },
      {
        "paragraph": "scapegoat. As long as she turned over a new leaf, he would forgive her."
      },
      {
        "paragraph": "“Don’t you dare.”"
      },
      {
        "paragraph": "After a long while, he spoke with a hoarse voice."
      },
      {
        "paragraph": "“ Shaun, you should never have chopped his finger. Catherine’s eyes were filled with contempt. “He’s my\nfamily. I treat him as my brother. Have you ever thought of what it feels like to have your family member"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "get their finger chopped off? A broken"
      },
      {
        "paragraph": "bone or a flesh wound can heal."
      },
      {
        "paragraph": "“However, a finger can never grow back! You’re a ruthless demon and a despicable person. Someone\nlike you should just be together with Sarah for the rest of your life! ”"
      },
      {
        "paragraph": "“In your dreams!” Shaun yelled at her like a madman. “Even if I marry Sarah, you’ll still have to be my\nwoman. If you want me to let you go, there’s no chance unless I die.”"
      },
      {
        "paragraph": "“Then you can go and die. A despicable scumbag like you don’t deserve to live in this world anyway, ”\nCatherine started yelling, “The Hill family did the right thing before. It’s only right for someone like you to\nbe locked up in the mental hospital and stay in there forever. Why did you come out? Why didn’t"
      },
      {
        "paragraph": "you die in there?!”"
      },
      {
        "paragraph": "The cold space in the basement suddenly went silent."
      },
      {
        "paragraph": "Shaun stared at Catherine. His bloodshot eyes were glinting with tears. His handsome face was\ncontorted, making him look crazy."
      },
      {
        "paragraph": "He never thought there would come a day when the woman he loved would curse him like that."
      },
      {
        "paragraph": "She was so vicious that she wished for his death."
      },
      {
        "paragraph": "He felt like his heart was being forcefully torn into “Do you dare say it another time?” He walked toward\nher step by step like a desperate madman."
      },
      {
        "paragraph": "“Did I say anything wrong? I said Logan was wrongly accused and he was framed by someone else.\nWhy didn’t you investigate it properly?! Ever since I got together with you, you would ask me to reflect on\nmyself every now and again and apologize to Sarah. I didn’t even do a f*cking thing. Stop saying that\nyou love me, I beg you. Stay away from me in the future. I can’t afford to offend you, Young Master Hill!”"
      },
      {
        "paragraph": "Catherine helped Logan up."
      },
      {
        "paragraph": "“What are you trying to do?” Shaun gave her a sarcastic stare. “If you want to take him away, dream on!\nCatherine Jones, you should just stay here forever. When you come to me and beg me to have sex with\nyou, maybe I can let you out to see the sun outside.”"
      },
      {
        "paragraph": "Catherine laughed. “Since I dared to come, then I surely have the confidence to go out. Shaun, why don’t\nyou find out which of your family members is missing?”"
      },
      {
        "paragraph": "Shaun’s expression darkened. “What did you do?”"
      }
    ]
  },
  {
    "title": "Chapter 883 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Do you want to call Suzie to ask where she is now?” Catherine raised her eyebrows and reminded\nShaun."
      },
      {
        "paragraph": "Shaun’s heart shuddered. He found Suzie’s number and dialed it in a hurry, but she could not be\nreached."
      },
      {
        "paragraph": "“What did you do to Suzie?” His eyes were full of murderous intent as if he was about to kill her."
      },
      {
        "paragraph": "“I can allow you to have a video call with her for a while, but you have to ask someone to return my\nphone to me.” Catherine extended her hand toward him."
      },
      {
        "paragraph": "Shaun immediately had someone bring her phone over. Catherine called Austin. A man wearing a mask\nappeared on the screen. “Miss…”"
      },
      {
        "paragraph": "“Let him see the child,” Catherine ordered. Soon, Austin gave the phone to Suzie."
      },
      {
        "paragraph": "“Uncle Shaun…” Suzie raised her head with a bright smile. Shaun looked at the background. He noticed\nit was not Hackett Institute but a completely unknown place."
      },
      {
        "paragraph": "“Suzie, why didn’t you go to school today?” he asked hurriedly."
      },
      {
        "paragraph": "“Aunty Cathy said she’s bringing me to play today. She asked this uncle to pick me up. Uncle Shaun, can\nyou ask Aunty Cathy when she’s coming over?” Suzie said naively, “I’m very bored.”"
      },
      {
        "paragraph": "“Suzie, do you know where you are?” “No, this is my first time here— ”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Little kid, it’s time to return the phone to uncle. ” Austin snatched the phone. Then, he looked into the\ncamera with a smile. “Miss, come back quickly. The little brat needs you. I’ve never raised a kid before,\nso I don’t have much patience.”"
      },
      {
        "paragraph": "He hung up after he said that."
      },
      {
        "paragraph": "Shaun threw the phone at Catherine. “B*tch,"
      },
      {
        "paragraph": "you’re even going as far as to harm a child who has complete trust in you! Are you still human? I must’ve\nbeen blind to have fallen in love with you. ”"
      },
      {
        "paragraph": "The phone hit Catherine’s forehead hard. At that moment, her head was buzzing from the pain and she\nalmost fainted. She barely stood on her feet."
      },
      {
        "paragraph": "She touched her forehead, and only then did she realize that her forehead was badly swollen."
      },
      {
        "paragraph": "“Didn’t you say I’m vicious? Since I’m such a vicious person, if you don’t let us out within ten minutes, I\ncan’t promise you that Suzie will be fine,” Catherine threatened Shaun coldly."
      },
      {
        "paragraph": "“You dare threaten me?” Shaun’s towering figure approached her step by step. His handsome face was\nfull of murderous intent."
      },
      {
        "paragraph": "“Would you like to try?” Catherine reminded him with a smile, “Have you forgotten how much Suzie likes\nyou and how adorable she is when she smiles?”"
      },
      {
        "paragraph": "Shaun’s body went still. A hint of red flashed across his eyes. Somehow, when he thought about how he\ncould not meet that little girl anymore, he felt like someone was yanking his heart away."
      },
      {
        "paragraph": "“Catherine Jones, my gravest mistake in this life is having fallen in love with you. Get lost! Take your man\nand get lost!” Shaun roared at her in contempt, “But let me tell you this, after walking out of this door, I\nhave 10,000 ways to make your lives a living hell.”"
      },
      {
        "paragraph": "“Have you not made my life a living hell many times already? Another time won’t make a difference.”"
      },
      {
        "paragraph": "Catherine helped Logan, who had blood all over him, up and walked out of the basement step by step."
      },
      {
        "paragraph": "The members of Liona surrounded them, but Catherine turned a blind eye to them. When she helped\nLogan walk out of Liona, the police arrived."
      },
      {
        "paragraph": "“I received a police report an hour ago. Who was the one who made the report… ” When the police came\nand saw the scene, they had a headache. After all, Liona was an existence that they did not dare to\noffend."
      },
      {
        "paragraph": "“I was the one who called the police, ” Catherine said, raising her hand. “A while back, Ms. Sarah\nLangley Neeson got kidnapped. When Shaun went to save her, he saw this man beside me in the cave\nwith Ms. Neeson. He concluded that this man was the kidnapper himself, so I called the police. After all,\neverybody has to be interrogated and given judgment by the police to be convicted, right?”"
      },
      {
        "paragraph": "“You’re right, and you’ve done the right thing.” The police nodded. He glanced at Logan who was\ncovered in blood. He warned, “Nobody should ever give extralegal punishment to another. If not, won’t\nthe world be in chaos?”"
      },
      {
        "paragraph": "Shaun’s expression darkened from anger. He never expected Catherine to be so cunning. She actually\ncalled the police beforehand!"
      }
    ]
  },
  {
    "title": "Chapter 884 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Once Logan was sent to the police station, he would be hospitalized for treatment and interrogated again\naccording to the standard procedure. Not only that, he would be in the police’s hands, so Shaun would\nbe unable to teach Logan a lesson."
      },
      {
        "paragraph": "“I’ll make a police report too.” He walked down the stairs, pointing at Catherine. “This woman abducted\nmy niece and intends to hurt her. Please investigate this matter immediately.”"
      },
      {
        "paragraph": "“Alright, this lady and Mr. Hill, please follow us to the police station,” the police said."
      },
      {
        "paragraph": "Next, Logan was sent to the hospital in an ambulance. Catherine sat in the police car while Shaun\nfollowed behind in a sedan arranged by Liona."
      },
      {
        "paragraph": "Not long after arriving at the police station, Liam brought Suzie over."
      },
      {
        "paragraph": "“Hello, Mr. Police, ” Suzie greeted the police sweetly once she entered."
      },
      {
        "paragraph": "“Hi, little darling.” After pinching Suzie’s chubby cheeks, the police looked at Shaun puzzledly. “"
      },
      {
        "paragraph": "Young Master Hill, didn’t you say your niece was kidnapped?”"
      },
      {
        "paragraph": "Shaun stared at Liam icily. “What happened? Why i s Suzie with you? Where’s that man wearing a\nmask?”"
      },
      {
        "paragraph": "“You mean Austin? He was playing with Suzie just now. ” Liam acted like he was confused and said, “\nBrother, why did you say Suzie was kidnapped?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Liam, you conspired with Catherine to fool me! ” Shaun was infuriated. He grabbed Liam’s collar. “ Does\nsomeone like you even deserve to be Suzie’s father?”"
      },
      {
        "paragraph": "“Aunty Cathy, what happened to your forehead?” Suzie’s voice rang out. She ran toward Catherine and\nbecame teary-eyed at the sight of her forehead."
      },
      {
        "paragraph": "“I injured it when I accidentally fell down. It’s okay.”"
      },
      {
        "paragraph": "Catherine extended her hands, wanting to carry Suzie. However, Shaun acted quicker and carried her\nfirst. “You have no right to carry her. Get lost!”"
      },
      {
        "paragraph": "It was the first time Suzie saw Shaun so furious. She was in a daze from shock. Then, she started to cry\nloudly. “I don’t like you being so angry at Aunty"
      },
      {
        "paragraph": "Cathy! You’re so scary. I won’t like you anymore.”"
      },
      {
        "paragraph": "“Suzie, you don’t understand. ” When Shaun heard the child’s cries, his heart was about to break from\nthe pain."
      },
      {
        "paragraph": "“I know! You’re the one who caused the injury on Aunty Cathy’s forehead, right? You’re too cruel. Go\naway!” Suzie kept hitting his shoulders."
      },
      {
        "paragraph": "When Liam saw Shaun’s awful expression, he was worried that Shaun might hurt Suzie. He immediately\ntook Suzie away from Shaun’s embrace."
      },
      {
        "paragraph": "“Daddy, let’s leave with Aunty Cathy. ” Suzie freed one of her hands to grab Catherine."
      },
      {
        "paragraph": "“Okay, let’s go. ” Catherine patted Suzie’s head. She then left the police station with Liam."
      },
      {
        "paragraph": "Shaun looked at them from behind. They were like a family of three."
      },
      {
        "paragraph": "His heart was hurting to the point of suffocating him. Why did Suzie misunderstand him? He wanted to\nsave her, yet she could not recognize his kindness and said she would not like him anymore."
      },
      {
        "paragraph": "Hah!"
      },
      {
        "paragraph": "It seemed that everyone did not like him."
      },
      {
        "paragraph": "Catherine had also asked why he was not locked up in the mental hospital and why he was not dead."
      },
      {
        "paragraph": "Was he that hateful?"
      },
      {
        "paragraph": "A wave of hostility surged within him. He looked like a volcano that was about to erupt. Nobody dared to\napproach him."
      }
    ]
  },
  {
    "title": "Chapter 885 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "In the sports car, Suzie lay in Catherine’s embrace. Tears streaked her face. “Mom, is it very painful? I no\nlonger like scummy dad. Don’t be together with him anymore.”"
      },
      {
        "paragraph": "“It’s okay. I’m fine.” Catherine touched Suzie’s head. “ Suzie, you did a good job today. I’m sorry that I\nused you.”"
      },
      {
        "paragraph": "If she could, she did not want her children to be exposed to such dirty stuff."
      },
      {
        "paragraph": "“It’s okay, you only did it to rescue Uncle Logan anyway. Besides, Uncle Austin kept playing with me,”\nSuzie whispered."
      },
      {
        "paragraph": "“Go play with Uncle Liam later. I still need to search for evidence to prove Uncle Logan’s innocence.”\nCatherine kissed Suzie’s forehead. “I’ll look for you after I finish my work, okay?”"
      },
      {
        "paragraph": "“Mm, Suzie will be a good girl. ” Suzie sniffed and nodded her head."
      },
      {
        "paragraph": "“Do you need help?” Liam asked."
      },
      {
        "paragraph": "“No, you just need to help me take good care of"
      },
      {
        "paragraph": "Suzie.” Catherine shook her head. That matter was too complicated. She was afraid something would\nhappen to Liam as well."
      },
      {
        "paragraph": "“It’s my fault for being useless.” Liam smiled bitterly."
      },
      {
        "paragraph": "“Don’t say that. I think you’re very smart, at least compared to your brother,” Catherine said sincerely."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“You have a point there. I really don’t understand how Sarah bewitched him.” Liam sighed."
      },
      {
        "paragraph": "After separating, Catherine quickly contacted Austin. She had Austin go to the cave where the incident\noccurred while she went to the house Logan stayed in when he was attacked."
      },
      {
        "paragraph": "When she arrived, she checked the security footage of the apartment. She found out that the recording\nof the food delivery guy delivering Logan his dinner was deleted. There was no footage at all from 8:00\np.m. to 8:30 p.m."
      },
      {
        "paragraph": "She searched the security footage at nearby places a s well yet there was not a trace. Eventually, she\nhad t o turn her attention toward the dashcams of the cars parked downstairs…"
      },
      {
        "paragraph": "The next day at Hill Corporation."
      },
      {
        "paragraph": "In the office, Shaun was listening to the reports of the senior managers with a dark expression."
      },
      {
        "paragraph": "He had not come to the company for a few days. There were a lot of matters that the senior managers\nhad to report to him."
      },
      {
        "paragraph": "However, they had only started reporting when the door of the office was kicked open. Liam strode in\nfuriously. “Shaun, what do you mean by this?"
      },
      {
        "paragraph": "You’re asking me to go to Country Y to build a microchip factory and not come back before it’s done?\nYou’re abusing your power to get back at me. You always use such despicable methods to deal with me\nevery time I make you upset. You clearly know that I can’t leave Canberra for too long. Suzie needs my\ncare.”"
      },
      {
        "paragraph": "“President… President Hill, we’ll come back later.”"
      },
      {
        "paragraph": "The senior managers sensed something was wrong with the situation. They went out in a hurry with\nlowered heads."
      },
      {
        "paragraph": "There was only Shaun and Liam left in the huge office."
      },
      {
        "paragraph": "Shaun folded his arms across his chest. He was expressionless. “You don’t deserve to be Suzie’s father.”"
      },
      {
        "paragraph": "“If I don’t, do you?” Liam laughed out of anger. He blurted, “Everyone has the right to say that except\nyou.”"
      },
      {
        "paragraph": "Shaun narrowed his eyes. He asked Liam sharply, “ What do you mean by that?”"
      },
      {
        "paragraph": "Liam’s heart skipped a beat. He quickly changed the topic. “ If you have the right, why were the twins lost\nback then?”"
      },
      {
        "paragraph": "“I dare you to say that again.” Shaun stood up abruptly. His tone and gaze looked utterly frightening."
      },
      {
        "paragraph": "Liam felt fear strike his heart. He felt that Shaun had been exuding a bloodthirsty aura lately, just like a\nmadman."
      }
    ]
  },
  {
    "title": "Chapter 886 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Liam clenched his fists and said discontentedly, “I can’t leave now. Suzie’s too young. You can let other\npeople do this…”"
      },
      {
        "paragraph": "“There are many people to take care of Suzie. Besides, you’re too close with that vicious woman,\nCatherine. I don’t feel reassured letting you raise Suzie. I don’t hope there’ll be another day when Suzie\nbecomes a hostage again. She’s young and doesn’t know anything. You’re her father, yet you joined\nhands with someone else and used Suzie to threaten me. Have you ever thought if Catherine was being\nserious, Suzie might’ve died at any moment?”"
      },
      {
        "paragraph": "Shaun glared at Liam. “I’m the head of the Hill family and Suzie is part of the Hill family. I have the right\nto decide everything related to you all.”"
      },
      {
        "paragraph": "“You’re really a bossy and arrogant person. ” Liam was exasperated. “Why do you think so badly of\nCathy? You falling in love with her really is her rotten luck.”"
      },
      {
        "paragraph": "“Love?” Shaun sneered. “ Someone like her doesn’t deserve my love. I was blind back then. From now\non, I don’t wish to see Suzie getting close to her.”"
      },
      {
        "paragraph": "“I’m telling you, I won’t go to Country Y.” Liam shook his head. He could not leave Suzie alone in the\nmanor. He had also promised Catherine he would protect Suzie and let them meet each other frequently."
      },
      {
        "paragraph": "“If you don’t want to go, then don’t be the general manager anymore. Go work at the lower ranks,” Shaun\nsaid coldly."
      },
      {
        "paragraph": "“Fine, you’re really ruthless.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Liam felt hatred and humiliation raging inside his heart. He turned around and left with long strides."
      },
      {
        "paragraph": "When he reached the door, he halted and turned around. “Shaun, I consider Catherine as a good friend\nand I can trust her unconditionally. But you? She sleeps by your side every night, but your trust in her\ncan’t even compare to mine."
      },
      {
        "paragraph": "“Not only that, even the police are investigating Logan’s case as per the standard procedure. You’re the\nonly one who isn’t willing to give her a chance to prove her innocence. You’re too cruel. You’ll"
      },
      {
        "paragraph": "regret this one day.”"
      },
      {
        "paragraph": "After he spoke, he slammed the door and left without looking back."
      },
      {
        "paragraph": "In the office, Shaun pounded the table with his fist. His eyes looked dazed."
      },
      {
        "paragraph": "Was he cruel? Was she not the one who had forced him?"
      },
      {
        "paragraph": "She even used Suzie to threaten him this time. She had completely triggered him."
      },
      {
        "paragraph": "He would never forgive her."
      },
      {
        "paragraph": "At that moment, his phone rang. Thomas was calling him from the hospital."
      },
      {
        "paragraph": "“Young Master Hill, when are you coming over? After you left in the morning, Sarah hasn’t eaten at all.\nShe’s all listless. Usually, Young Master Snow would come over, but we can’t even see his shadow these\nfew days.”"
      },
      {
        "paragraph": "“I had some business in the company. I’ll come over immediately.”"
      },
      {
        "paragraph": "Shaun quickly rushed to the hospital. When Sarah saw him, her spirits got better and she even ate some\nfood. “By the way, Shaunic, I heard… Logan was sent to the police station.”"
      },
      {
        "paragraph": "“Mm.” Shaun’s gaze sharpened. “The police have already filed a case. When the time comes, there’ll be\na trial in court.”"
      },
      {
        "paragraph": "“That’s good… ” Sarah gave a smile of relief. “After all, it’s not appropriate to give extralegal punishment.\nIt’s better to hand this case over to the police.”"
      },
      {
        "paragraph": "Thomas snapped, “But kidnapping cases like this will only receive a sentence of a few years in jail at\nmost.”"
      },
      {
        "paragraph": "“I believe he’ll repent wholeheartedly in jail. We should obey the law too, ” Sarah said with a sincere\nexpression."
      },
      {
        "paragraph": "Thomas sighed. “You’re just too kind.”"
      },
      {
        "paragraph": "Shaun lowered his gaze, looking at Sarah’s soft and fair petite face. He could not resist thinking of\nCatherine’s evil-looking face. He could not help but lament. Did he really love the wrong person?"
      },
      {
        "paragraph": "He might not love Sarah anymore, but at least she was a kind person. However, he had hurt her again\nand again for the sake of someone like Catherine."
      },
      {
        "paragraph": "“Eldest Young Master Hill, you’ll be Sarah’s lawyer for her case, right?” Thomas suddenly said, “ I’m just\nworried Catherine will hire a skilled lawyer. It’ll be troublesome if Logan is acquitted.”"
      }
    ]
  },
  {
    "title": "Chapter 887 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“That won’t happen. I’ll take over the case myself, ” Shaun said in a low voice."
      },
      {
        "paragraph": "“That’s great. There’s no lawsuit that Shaunic can’t win.” Sarah raised her head and smiled at him."
      },
      {
        "paragraph": "At night, in the Hill family’s manor."
      },
      {
        "paragraph": "Shaun came back, though it was rare of him. Old Madam Hill did not feel comfortable after looking at\nhim. “Has the sun risen from the west today? You actually have the time to come back? What’s that in\nyour hand?”"
      },
      {
        "paragraph": "“The newest Barbie doll. ” Shaun brought it over to Suzie who was having snacks. “I’m giving this to you,\nokay?”"
      },
      {
        "paragraph": "He was not someone who would care about a child’s feelings, but Suzie’s words yesterday had hurt his\nheart. He could not sleep for the whole night."
      },
      {
        "paragraph": "He did not understand why he was so concerned about Liam’s daughter. It was really strange."
      },
      {
        "paragraph": "“No.” Suzie evaded him. She ran over to Old Madam Hill’s side and lowered her head."
      },
      {
        "paragraph": "Old Madam Hill glared at Shaun and snapped, “You transferred her dad to work at the lower ranks and\nmade him a laughing stock, yet you still dare to come and please Suzie?”"
      },
      {
        "paragraph": "“Liam told her that?” Shaun’s expression darkened."
      },
      {
        "paragraph": "“Absolutely not.” Suzie raised her head. She looked at him in fear, but she said loudly, “It was\nGranduncle and Grand aunty who were discussing this matter. What did my dad do wrong that you have"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "to treat him like that?”"
      },
      {
        "paragraph": "Shaun was at a loss for words. He could not tell her the truth. A child’s world was too pure."
      },
      {
        "paragraph": "“I know, it must be like what Aunty Sarah said. Uncle Shaun and my dad have different fathers, so Uncle\nShaun doesn’t like my dad,” Suzie said aggrievedly with reddened eyes."
      },
      {
        "paragraph": "“Sarah said that to you?” Old Madam Hill’s expression changed instantly. “What kind of woman is she?\nHow could she say that in front of a kid? She’s too much.”"
      },
      {
        "paragraph": "“Granny…” Shaun looked awkward."
      },
      {
        "paragraph": "Old Madam Hill said sternly, “I heard you’ve been staying by Sarah’s side every day in the hospital\nrecently. Did you not have a woman in your past life? She has already cheated on you. Everyone in\nCanberra is talking about it. Why are you so silly?”"
      },
      {
        "paragraph": "Shaun put on a long face. He did not say a word."
      },
      {
        "paragraph": "Old Master Hill walked in with the support of his cane. “Stop talking. This grandson of yours can’t live\nwithout women anyway. Let him do whatever he wants. He’s the head of the Hill family now. It’s useless\nfor anyone to say anything.”"
      },
      {
        "paragraph": "“What else can I do? If you want to marry Sarah, both of you should just do it secretly overseas."
      },
      {
        "paragraph": "Don’t invite us. We won’t attend the wedding. It’s embarrassing,” Old Madam Hill said angrily."
      },
      {
        "paragraph": "“Forget it, I’m returning to my room.”"
      },
      {
        "paragraph": "Shaun put the Barbie doll on the table before turning around to leave."
      },
      {
        "paragraph": "Just as he was about to walk up the stairs, he heard Suzie’s voice from behind. “Uncle Shaun, wait.”"
      },
      {
        "paragraph": "“Suzie, I thought you didn’t like me anymore?” Shaun turned back. A hint of bitterness flashed across his\neyes."
      },
      {
        "paragraph": "Suzie bit her lip, and her clear eyes were reddish. “I just want to tell you this. That day, Aunty Cathy didn’t\nkidnap me. Before I went over, Aunty Cathy had already explained everything to me. She said she\nwanted to save a friend as that friend was captured by you. She had no choice but to let you think that I\nwas kidnapped. Only then would you let that uncle go.”"
      },
      {
        "paragraph": "“You knew it from the start.” Shaun was shocked. He thought the innocent Suzie had been kept in the\ndark."
      },
      {
        "paragraph": "Suzie said seriously, “Mm, Dad said Uncle Logan is a good person too. He helped Aunty Cathy a lot in\nthe past, so I wanted to help him. I’m sorry I lied to you."
      },
      {
        "paragraph": "“I just want to tell you that Aunty Cathy never hurt me. She never lied to me either. I like her a lot, and I’ll\ncontinue liking her in the future. Although I’m young, I still can differentiate who are the good people.”"
      },
      {
        "paragraph": "Shaun was stupefied. “What can a little kid like you differentiate?”"
      }
    ]
  },
  {
    "title": "Chapter 888 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Of course, I can.” Suzie planted her hands on her small waist. “In this big manor, Uncle, Great-\ngrandma, Great-grandpa, Grandma, and Granduncle all genuinely like me, but Grandpa, Grandaunt, and\nmy Great-grandma, Great- grandpa, and uncles and aunts from my father’s side don’t like me.”"
      },
      {
        "paragraph": "Shaun was startled and only reacted after a long time. “You mean your grandpa and your grandparents,\naunts, and uncles from the Campos family don’t like you?”"
      },
      {
        "paragraph": "“Yeah, when Daddy brought me to the Campos family, they all ignored me. Another big brother even\nbullied me. He was clearly in the wrong, but Grandpa told me to apologize to him.” Suzie lowered her\nhead and clenched her little fists."
      },
      {
        "paragraph": "“I grew up with Mommy since I was little, so I’m very good at reading people’s expressions.”"
      },
      {
        "paragraph": "Shaun’s heart clenched painfully, but he could not tell why. “Don’t go to the Campos family anymore. If\nyou’re bored, come and find me.”"
      },
      {
        "paragraph": "“No need. I don’t like Aunty Sarah, and I know she doesn’t like me either.” Suzie shook her head\ndecisively and waved. “Bye-bye, Uncle.”"
      },
      {
        "paragraph": "Then, she ran back into the house."
      },
      {
        "paragraph": "Shaun looked at her back for a long time and took out his phone to dial the personnel department. “ Let\nLiam continue to serve as the general manager of the company.”"
      },
      {
        "paragraph": "The manager of the personnel department was speechless. “Does he still need to go to Country Y to\nbuild a factory?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“No need. I’ll arrange for another person to go.”"
      },
      {
        "paragraph": "Shaun sighed. Why did Liam have a daughter who could make Shaun so distressed? If Liam was forced\nto the lower ranks in the company, Suzie would be looked down on as his daughter. Shaun would not\nallow anyone to bully Suzie."
      },
      {
        "paragraph": "However… he did not expect that Mason Campos would dislike Suzie so much. Suzie was clearly his\ngranddaughter. Which grandparent did not like their grandchildren? The people of the Campos family\nwere too strange."
      },
      {
        "paragraph": "When he returned to his villa, Aunty Yasmine welcomed him with a smile. “Eldest Young Master"
      },
      {
        "paragraph": "Hill, when will you bring Miss Jones back for a visit?”"
      },
      {
        "paragraph": "Shaun’s frown deepened, but Aunty Yasmine did not notice and continued with a smile, “ I watched the\nnews that day. You accompanied Miss Jones to Mount Wellington. You two have gotten back together,\nright? I’m really happy for you.”"
      },
      {
        "paragraph": "“We broke up again,” Shaun said expressionlessly. Aunty Yasmine froze. “How…”"
      },
      {
        "paragraph": "“Don’t mention her to me in the future, ” Shaun said and walked upstairs."
      },
      {
        "paragraph": "Aunty Yasmine looked at his back and sighed. Maybe it was good that they had not gotten back together.\nMiss Jones might suffer again if she stayed with the Eldest Young Master Hill."
      },
      {
        "paragraph": "After Shaun entered the study, he shut the door with a bang."
      },
      {
        "paragraph": "He lit a cigarette and remembered Suzie’s words. Did Catherine really not have the intention of using\nSuzie to threaten him? Would she really not harm Suzie?"
      },
      {
        "paragraph": "A trace of confusion surfaced in his eyes."
      },
      {
        "paragraph": "Then, Hadley came in. “Eldest Young Master Hill, this is the information on Logan Law’s case.”"
      },
      {
        "paragraph": "Shaun froze and suddenly remembered that he had decided to take over the lawsuit for Sarah. He had to\nhand in the relevant information."
      },
      {
        "paragraph": "This time, Catherine and he would meet in court."
      },
      {
        "paragraph": "Since she cared so much about Logan Law, he would personally send that man to jail and see how she\nwould fight against him."
      },
      {
        "paragraph": "After all, the word ‘defeat’ did not exist in his dictionary."
      },
      {
        "paragraph": "“Eldest Young Master Hill, you haven’t taken on a lawsuit in many years. Why are you suddenly… With\nall due respect, no matter who wins this lawsuit, Miss Jones and you will become complete strangers at\nthe end of it,” Hadley boldly said."
      }
    ]
  },
  {
    "title": "Chapter 889 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun was slightly stunned."
      },
      {
        "paragraph": "It was true that it had been years since he took on a lawsuit. If Thomas had not spoken in the hospital\nthat day, he might not have chosen to go to court in person."
      },
      {
        "paragraph": "He had to say that Thomas’ words really pushed Catherine and him to the brink."
      },
      {
        "paragraph": "Deep in his heart, there was a strong flash of irritation and annoyance. However, when he thought about\nit carefully, he knew she had already cut off the last trace of love between them when she used Suzie to\nthreaten him."
      },
      {
        "paragraph": "Since she did not know how to cherish him, why should he care?"
      },
      {
        "paragraph": "“Enough, I know what I’m doing. Go out,” Shaun said coldly."
      },
      {
        "paragraph": "Hadley closed the door behind him and sighed. When he saw Eldest Young Master Hill and Catherine\nreconcile, he had hesitated on whether he should tell him about the truth of the children after"
      },
      {
        "paragraph": "There’s no possibility of winning at all if he goes to court for Sarah.”"
      },
      {
        "paragraph": "Harvey looked at Catherine in concern. He shared the same thoughts as Freya."
      },
      {
        "paragraph": "Catherine lowered her eyes. Her dark and thick lashes blocked the dim light in her eyes. “No matter how\namazing Shaun is, he’s only the most powerful in the country. There will always be someone even more\npowerful in the world. As long as the other party is willing to come, I’m willing to spend any amount of\nmoney.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Actually… ” Harvey hesitated and said, “Shaun Hill once competed with the second-ranked lawyer in the\nworld and the two were tied. At present, the number one lawyer in the world is over 6o years old and has\nretired for more than ten years. He won’t appear even if the richest person in the world asks him to.”"
      },
      {
        "paragraph": "Catherine, “…”"
      },
      {
        "paragraph": "Freya was speechless. “In other words, Shaun Hill is already the best in the world?”"
      },
      {
        "paragraph": "“ Something like that. ” Harvey nodded helplessly."
      },
      {
        "paragraph": "Freya also suddenly fell silent. Shaun had taken on they got married."
      },
      {
        "paragraph": "However, it seemed there was no need now. Eldest Young Master Hill would always be unconditionally\npartial to Sarah. Even if he knew he loved Catherine, nothing would change. His protectiveness over\nSarah was carved deep into his bones. It was better this way. Eldest Young Master Hill and Sarah should\njust harm each other instead of hurting Catherine. He really could not stand it anymore."
      },
      {
        "paragraph": "Hackett Institute."
      },
      {
        "paragraph": "In the past two days, Catherine was cooped up at home and watched dashcam videos until her eyes\nbecame blurry. Fortunately, Freya was there to help. However, it was so tiring that they barely slept."
      },
      {
        "paragraph": "In the afternoon, Harvey brought the relevant paperwork for Logan’s case. “The case has been\nscheduled for next Wednesday. The other party’s lawyer is Shaun Hill.”"
      },
      {
        "paragraph": "“Shaun Hill?” Freya almost flipped the laptop in front of her. “He’s determined to fight against you, isn’t\nhe? Everyone in the country knows that Shaun has never lost before. No matter how much evidence you\nfind, he can spin the story around."
      },
      {
        "paragraph": "A lawsuit for Catherine to save her before, so Freya did not expect him to go against her to send her\nmost trusted subordinate to prison."
      },
      {
        "paragraph": "“We can’t give up, ” Catherine said, “In the face of absolute evidence, any powerful lawyer has the\npossibility to win. Since he has never lost, I’ll let him have a taste of what it’s like to lose in a fight against\nme.”"
      },
      {
        "paragraph": "Freya gave her a thumbs up. “You’re awesome!”"
      },
      {
        "paragraph": "Harvey said, “Every lawyer who had gone to court against Shaun Hill said that too, but they were all\nutterly defeated.”"
      }
    ]
  },
  {
    "title": "Chapter 890 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine closed her eyes and finally gritted her \nteeth. “Get out.”"
      },
      {
        "paragraph": "The next few days, Catherine and Austin were bustling about to find evidence."
      },
      {
        "paragraph": "It was Tuesday in the blink of an eye. When Wesley came to visit her, he saw that her eyes were\nbloodshot and her face seemed to have slimmed down. His heart clenched. “You’re going to court\ntomorrow. Have you found any evidence?”"
      },
      {
        "paragraph": "“Yeah.” Catherine rubbed her tired eyes. “We found some evidence. There’s a chance of winning, but it’s\nnot big.”"
      },
      {
        "paragraph": "“Oh?” Wesley’s eyes flashed meaningfully. “What is it? I’m quite curious.”"
      },
      {
        "paragraph": "“I won’t say it now. You’ll find out tomorrow,” Catherine said worriedly, “But the chances of winning are\nvery small. After all… the opposing side is Shaun Hill, who has never lost before. Tomorrow, rather than\nletting the judge pronounce that Logan is innocent, we’re actually trying to convince Shaun. As long as\nhe understands that Logan was framed, there’s a chance we can win.”"
      },
      {
        "paragraph": "“Not necessarily, ” Wesley reminded her, “Even if he realizes he might have wrongly accused Logan, it’ll\nbe his first failure in his career as a lawyer if he loses. Even if he knows he’s wrong, judging from his\narrogant character, he’ll continue to fight to win.”"
      },
      {
        "paragraph": "Catherine was stunned and smiled bitterly. “You’re right. People like him have no bottom line.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“But… you’ll win.” Wesley suddenly gently pressed on her shoulder. “I know you’ve been busy and very\ntired lately, so I haven’t been sitting around idly either. I found the car that was used to kidnap Sarah.\nThere was no trace of Logan in it.”"
      },
      {
        "paragraph": "“Really?” Catherine suddenly sat up, her eyes filled with brightness."
      },
      {
        "paragraph": "“Yeah.” Wesley handed her a file. “I’ve asked the relevant authorities to check the car and even searched\nfor fingerprints. Only the car trunk has Logan’s fingerprints.”"
      },
      {
        "paragraph": "“That’s great.” Catherine took the file and felt emotional. “With this, we’ll absolutely win. Wesley, thank\nyou so much. I can’t ever repay—”"
      },
      {
        "paragraph": "“Don’t talk about repaying me. My feelings for you make me more than willing to do anything for"
      },
      {
        "paragraph": "you. ” Wesley gently held her hands. His eyes were full of affection as he said, “ If you want to protect\nhim, I’ll protect him with you.”"
      },
      {
        "paragraph": "Catherine’s heart shook fiercely."
      },
      {
        "paragraph": "All along, she was aware of Wesley’s feelings for her, but she had always rejected him."
      },
      {
        "paragraph": "That moment, she was utterly touched. In fact, she should have realized long ago that he was the person\nwho treated her the best. All these years, he had accompanied her without complaints. He would help\nher whenever she needed it, and he treated Suzie and Lucas so well too."
      },
      {
        "paragraph": "As for Shaun, he only hurt her endlessly."
      },
      {
        "paragraph": "She suddenly regretted it. She regretted that she realized it too late."
      },
      {
        "paragraph": "“I’m sorry, Wesley. I realize that I’ve made a mistake,” Catherine said bitterly, “I shouldn’t have\napproached Shaun again and dated him to get back a t him. I keep hurting you time and again, but I’ll\nnever do it again.”"
      },
      {
        "paragraph": "“You mean…?” Wesley looked up in astonishment. “In the past, I only thought of letting Shaun taste"
      },
      {
        "paragraph": "the pain of being abandoned by his beloved.”"
      },
      {
        "paragraph": "Catherine said bitterly, “But I didn’t know that the bond between Sarah and him can’t be broken by\nanyone. In fact, even if Sarah hadn’t hypnotized Shaun, he wouldn’t be able to break off his relationship\nwith her. In the long run, we would be divorced anyway. Only now do I finally understand that Shaun and\nI divorced back then not because of the hypnosis but because he’s too deeply involved with Sarah. In\nthis lifetime, Sarah will always be his heart’s first love.”"
      }
    ]
  },
  {
    "title": "Chapter 891 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“It’s good that you know, ” Wesley said with a smile. “It’s just like how I have you in my heart. Even if I\nknow you won’t accept me, I’ll still automatically draw a clear line with other women. I n my opinion, true\nlove and loyalty should be like this.”"
      },
      {
        "paragraph": "“Yes, I know who is worth cherishing now.” Catherine held Wesley’s hand. “Thank you for always waiting\nfor me. I don’t want to let you down anymore.”"
      },
      {
        "paragraph": "“That’s great.” Wesley’s gentle and elegant face was overcome with joy."
      },
      {
        "paragraph": "He excitedly hugged Catherine and spun her around. “Cathy, I’ve waited too long for this day. I’m not\ndreaming, am I? You won’t leave me for Shaun again later, right?”"
      },
      {
        "paragraph": "“No, but I won’t let Sarah and her brother off. I have to get revenge on behalf of Charity’s family,”\nCatherine gritted her teeth and said."
      },
      {
        "paragraph": "“Okay, I’ll accompany you in the future. ” Wesley reached out to hold her tight, his face full of satisfaction\nand joy."
      },
      {
        "paragraph": "8:00 a.m. the next morning."
      },
      {
        "paragraph": "A Bentley appeared at the court."
      },
      {
        "paragraph": "After the car was parked, Shaun went down and opened the car door for Sarah. Meanwhile, Thomas got\ndown from the backseat."
      },
      {
        "paragraph": "At the entrance, a sharp-eyed reporter immediately went over. “Eldest Young Master Hill, are you back\ntogether with Ms. Neeson? I heard that you traveled to Mount Wellington just a few days ago with Miss"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Jones. Are you two-timing…?”"
      },
      {
        "paragraph": "“Don’t film…” Sarah blocked her face with her hand and hid in Shaun’s arms in fright."
      },
      {
        "paragraph": "Shaun glared at the reporter. “Continue filming if you don’t mind your company shutting down.”"
      },
      {
        "paragraph": "The reporter suddenly remembered that the media company that reported on Shaun and Catherine’s\nreconciliation a few days ago had suddenly closed down overnight. His legs trembled and he left in a\nhurry to find other news to report on."
      },
      {
        "paragraph": "“Shaun, today’s trial should be closed, right?” Sarah said with fear and worry, “I don’ t want the news of\nmy kidnapping to spread…”"
      },
      {
        "paragraph": "“It’s a closed trial. Don’t worry, news of it won’t spread.” Shaun gently patted her shoulder."
      },
      {
        "paragraph": "At that moment, a sports car drove over and parked next to the Bentley. Then, Catherine, Freya, and\nAustin stepped out of the vehicle."
      },
      {
        "paragraph": "When Sarah saw Catherine, she was so scared that she immediately hid in Shaun’s arms with a pale\nface."
      },
      {
        "paragraph": "Shaun thought that she was recalling those horrible things again and could not help but glare at\nCatherine. “ I thought you wouldn’t dare to come.”"
      },
      {
        "paragraph": "“Why wouldn’t I dare? I have a clear conscience. ” Catherine glanced at Sarah who was snuggled up in\nhis arms without any ripples in her eyes. She had gotten over some things after thinking through them."
      },
      {
        "paragraph": "“It’s a shame that you’ll definitely lose even though you’re here.” Thomas scoffed coldly. “ Eldest Young\nMaster Hill is the one taking on Sarah’s lawsuit today. He’s the best lawyer in the country and has never\nlost.”"
      },
      {
        "paragraph": "“That’s not necessarily true. Maybe today will be the day his invincible reputation falls?” Catherine smiled\ncalmly."
      },
      {
        "paragraph": "Thomas snorted a laugh. “Which lawyer have you found that you’re so confident in winning?”"
      },
      {
        "paragraph": "Catherine looked behind her and suddenly smiled. “ Mr. O’Neill, I’ll be counting on you.”"
      },
      {
        "paragraph": "Shaun and the others turned to look only to see a middle -aged man with a shiny head coming out of a\nSantana."
      },
      {
        "paragraph": "“You mean him…?” The corners of Thomas’ mouth twitched. He thought that Catherine would at least\nlook for an ace lawyer in Canberra, but she ended up finding an unknown lawyer who was short and\nlooked poor."
      }
    ]
  },
  {
    "title": "Chapter 892 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Geez, the man was even driving a Santana that was worth just a few tens of thousands of dollars. How\nincompetent was he?"
      },
      {
        "paragraph": "“Yes, this is Mr. O’Neill. ” Catherine shook hands with the lawyer enthusiastically."
      },
      {
        "paragraph": "Mr. O’Neill’s smile was very forced. When Shaun’s sharp line of sight swept over him, his legs turned to\njelly."
      },
      {
        "paragraph": "“Holy sh*t, where did you find such a garbage lawyer?” Thomas could not help but burst into laughter.\n“Eldest Young Master Hill, look at his clothes. I’m guessing they’re ready-made clothes. Even the soles\non his leather shoes are peeling. My stomach is going to ache from all this laughing.”"
      },
      {
        "paragraph": "Shaun also frowned deeply at Catherine. This was the lawyer she got for Logan?"
      },
      {
        "paragraph": "Catherine smiled without saying anything from beginning to end. She only looked at them quietly."
      },
      {
        "paragraph": "When Thomas was done laughing, he wiped away the tears from his eyes and said, “Mr. O’Neill, if I may\nask, how much did she spend to hire you?”"
      },
      {
        "paragraph": "“Not much, around 2,000 dollars, ” Mr. O’Neill said, embarrassed."
      },
      {
        "paragraph": "“Awesome! ” Thomas teasingly gave a thumbs up to Catherine. “Catherine, I know you’ve given up all\nhopes of winning because you’re dealing with Eldest Young Master Hill, but aren’t you being too\nmerciless to Logan Law? You’re not even willing to spend a little more money to hire a better lawyer.\n2,ooo dollars, tsk. If you’re that reluctant, I would’ve lent you money. If you find such a lowly lawyer, even\nif you’re not worried about embarrassing yourself, you’ll only drop Eldest Young Master Hill’s standing.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“You’ve misunderstood.” Catherine smiled faintly. “I just thought that to deal with a lawyer like Shaun Hill,\nthere’s no need to hire someone too expensive. After all, we’ll win anyway, so it doesn’t matter who we\nfind.”"
      },
      {
        "paragraph": "“What? Am I hearing things or are you still dreaming? You’re indulging in your fantasies.” Thomas\nguffawed. “Eldest Young Master Hill, she says that a lousy lawyer like this guy here can defeat you.”"
      },
      {
        "paragraph": "“Dream on, ” Shaun’s thin lips mercilessly uttered the two words. In his eyes, Catherine had already\ngiven up hope."
      },
      {
        "paragraph": "However, he understood the situation. It was normal for people to give up when they were facing him as\ntheir opponent."
      },
      {
        "paragraph": "“You can be complacent now, ” Freya sneered, “ When the lawsuit is over, people in the outside world will\nroll on the floor laughing when they learn that the famous undefeated legend lost to a lawyer who cost\n2,000 dollars.”"
      },
      {
        "paragraph": "“I really don’t understand why you guys have such unrealistic dreams. ” This time, even Sarah shook her\nhead. She held Shaun’s arm. “Shaun, let’s go inside. Let’s not waste any more time here.”"
      },
      {
        "paragraph": "“Mmh.”"
      },
      {
        "paragraph": "Shaun walked and left."
      },
      {
        "paragraph": "Behind him, Thomas said to Catherine in a low voice, “It’s impossible for you to win, but if you kneel\ndown and beg me and let Freya sleep with me for a few nights, I might be able to beg my sister to reduce"
      },
      {
        "paragraph": "Logan’s imprisonment by a few years.”"
      },
      {
        "paragraph": "“F*ck off,” Catherine spat out expressionlessly."
      },
      {
        "paragraph": "Freya directly cursed him, “A piece of trash like you wants me to accompany you? Get lost. You’re not\neven worthy to hold my shoes.”"
      },
      {
        "paragraph": "“Freya Lynch, I’ll make you regret it sooner or later.”"
      },
      {
        "paragraph": "Thomas smiled wickedly. “By the way, I forgot to tell you, Logan’s finger was fed to the dogs. It’s because\nEldest Young Master Hill cares about Sarah too much. When Sarah asked for Logan’s finger, Eldest\nYoung Master Hill cut it off and sent it over without a word. The dog ate it like it was a treat. ”"
      },
      {
        "paragraph": "Catherine looked up. The temperature in her eyes suddenly dropped to freezing point, and her fists\nclenched in anger."
      },
      {
        "paragraph": "Thomas saw it and chuckled before leaving."
      },
      {
        "paragraph": "“Son of a b*tch!” Freya cursed. “Sooner or later, I’ll make those siblings live lives worse than death.”"
      }
    ]
  },
  {
    "title": "Chapter 893 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Yeah, ” Catherine replied in a low voice. She had the same thoughts."
      },
      {
        "paragraph": "8:30 a.m."
      },
      {
        "paragraph": "The trial officially began."
      },
      {
        "paragraph": "Logan was brought out. These days, he had been healing in the hospital and was slightly better."
      },
      {
        "paragraph": "However, he still hobbled when he walked and his hand was wrapped in thick gauze."
      },
      {
        "paragraph": "Austin’s expression changed. He was just about to get up but Catherine pressed on his shoulder while\ngiving him a look."
      },
      {
        "paragraph": "Austin gritted his teeth and sat back down."
      },
      {
        "paragraph": "The judge looked at everyone and knocked the gavel, announcing the start of the hearing. “The plaintiff,\nSarah Neeson, is accusing Logan Law of kidnapping her on the 28th of this month. What does the\ndefendant have to say?”"
      },
      {
        "paragraph": "Mr. O’Neill cleared his throat and stood up under the crowd’s strange and provoking eyes. “The\ndefendant pleads not guilty. The defendant was framed.”"
      },
      {
        "paragraph": "Shaun stood up, his handsome and exquisite features looking incomparably cold. “Your Honor, these are\nthe testimonies of three eyewitnesses who were in the cave at that time. All of them witnessed Logan\nLaw’s intention to assault Ms."
      },
      {
        "paragraph": "Sarah Neeson. If we hadn’t stopped him in time, the consequences would’ve been unimaginable."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Even now, the defendant’s counsel wants to engage in sophistry.”"
      },
      {
        "paragraph": "The judge read the testimonies and nodded. “This is indeed incriminating evidence.”"
      },
      {
        "paragraph": "Mr. O’Neill hurriedly said, “We have evidence in hand that my client was framed. Your Honor, my client\nstated that the night before the incident, he was alone in his apartment and ordered take-out. He fainted\nafter eating the food and later woke up in the cave."
      },
      {
        "paragraph": "“In accordance with what Logan Law said, we checked the surveillance cameras of the apartment he\nlives in but coincidentally, all the footage within half an hour after the delivery man arrived was deleted.”"
      },
      {
        "paragraph": "Shaun sneered, “You could have deleted the footage"
      },
      {
        "paragraph": "yourselves to make things complicated.” “We have more evidence.”"
      },
      {
        "paragraph": "Mr. O’Neilled submitted surveillance footage. “This is the dashcam footage of a car we found in the\ndownstairs parking lot belonging to someone in the community. At 8:20 p.m. on the 28th, two people\nwere seen carrying a large bag and passed through the parking lot. My client said that one of them is the\ndelivery man.”"
      },
      {
        "paragraph": "The court personnel played the footage. In the dim parking lot, two suspicious- looking people were\ncarrying a large bag into a car’s trunk."
      },
      {
        "paragraph": "Mr. O’Neill said, “This bag can perfectly fit my client.”"
      },
      {
        "paragraph": "Shaun’s eyes narrowed slightly. Beside him, Sarah’s eyes flashed in panic as she subconsciously\ngrabbed Shaun’s arm."
      },
      {
        "paragraph": "“Shaun, are we going to lose?”"
      },
      {
        "paragraph": "Sarah patted the back of her hand and got up unhurriedly. “Ridiculous! You said that there’s a person\ninside this big bag, but that’s just your imagination. There’s no direct evidence to prove it.”"
      },
      {
        "paragraph": "The judge nodded. “I agree. Defense counsel, do you have any other evidence?”"
      },
      {
        "paragraph": "“Yes, there are plenty, ” Mr. O’Neill nodded and said, “We found several local farmers near the cave.\nThere are witnesses who said that early that morning, there were two suspicious-looking people walking\ntoward the mountain. They said Ms. Sarah Neeson was walking behind them. She was not kidnapped.”"
      },
      {
        "paragraph": "“You’re talking nonsense…” Sarah stood up in anger and indignation. “You’ve gone too far! I’m clearly\nthe victim, but you’re slandering me like this.”"
      },
      {
        "paragraph": "“Plaintiff, be quiet.” The judge knocked the gavel and warned Mr. O’Neill with a frown, “Defense counsel,\ndo you have the evidence to back your words?”"
      }
    ]
  },
  {
    "title": "Chapter 894 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“There is— ”"
      },
      {
        "paragraph": "Mr. O’Neill had not finished speaking. However, Shaun suddenly said harshly, “Mr. O’Neill, you said that\nthe witnesses saw this scene early in the morning but I remember that the morning sky nowadays isn’t\nbright, much less in the forest where the incident happened. You said the witness saw Sarah Neeson\nwalking into the forest behind two men and was not kidnapped. In that lighting, could they have seen\nclearly if Sarah Neeson didn’t have her hands tied?”"
      },
      {
        "paragraph": "Mr. O’Neill was stunned for a moment. “ I think we can let them come to court first…”"
      },
      {
        "paragraph": "Shaun said aggressively, “The local farmers must be very short of money. It’d be easy to buy them off\nwith money to get them to change their confessions.”"
      },
      {
        "paragraph": "“I object…”"
      },
      {
        "paragraph": "Shaun sneered, “Mr. O’Neill, I don’t need to remind you that buying false witnesses is illegal. In fact,"
      },
      {
        "paragraph": "it’s ridiculous for them to say in their statements that Sarah Neeson wasn’t tied up with anything."
      },
      {
        "paragraph": "“Your Honor, please take a look at my client’s hands. The bruises on her hands are still fresh. These\nmarks were due to her hands being bound that day.”"
      },
      {
        "paragraph": "Shaun lifted Sarah’s hands as he spoke, and Sarah immediately bit her lip. Her eyes reddened, causing\nthe people in the courtroom to pity her."
      },
      {
        "paragraph": "Shaun continued to attack coldly, saying, “Whether you’re a lawyer or a person, there should be a bottom\nline. My client has suffered a lot of injuries this time, but now, you’re implying that she deliberately framed"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Logan Law. You’re going too far.”"
      },
      {
        "paragraph": "“Yes, that’s a little overboard.”"
      },
      {
        "paragraph": "The people in the audience whispered."
      },
      {
        "paragraph": "Catherine stared at Shaun, her beautiful eyes showing disgust."
      },
      {
        "paragraph": "Freya was furious. “Shaun Hill is really despicable. He’s inciting the judge’s emotions and making him\nhave a negative impression of Mr. O’Neill. The witnesses Austin tried so hard to find can’t even enter the\ncourthouse now.”"
      },
      {
        "paragraph": "“With Shaun’s eloquence and aura, I’m guessing that even if those eyewitnesses came in, he’d make\nthem appear as if they had been bribed by us."
      },
      {
        "paragraph": "Fortunately, Wesley found more evidence for us, or we’d definitely lose, ” Catherine lamented."
      },
      {
        "paragraph": "“Wesley is still the best. Shaun Hill is just a pile of dogsh*t,” Freya cussed."
      },
      {
        "paragraph": "Catherine frowned deeply as her body tensed up."
      },
      {
        "paragraph": "Just when everyone thought that Mr. O’Neill was at a loss, he said again, “Mr. Hill, we’ve never bought\nany witnesses. You may not be aware, but we’ve found the vehicle that was used to kidnap Ms. Sarah\nNeeson. It’s this black one, right?”"
      },
      {
        "paragraph": "Mr. O’Neill took out a photo. Shaun looked at it and nodded."
      },
      {
        "paragraph": "Sarah suddenly had a very bad feeling."
      },
      {
        "paragraph": "Mr. O’Neill said, “We got the attorney-general’s department to do the appraisal. What’s strange is that\nthere was a large bag in the backseat of the kidnapper’s car that’s exactly the same as the one\nphotographed by the dashcam before.”"
      },
      {
        "paragraph": "Mr. O’Neill let the court personnel bring up the first video footage submitted before and paused it at the\nspecific scene. The large bag carried by the delivery man and the other man in the frame was identical to\nthe large bag in the photo of the car."
      },
      {
        "paragraph": "Shaun’s handsome face changed slightly. His slender fingers could not help but grab the pen on the\ntable, gripping it tightly."
      },
      {
        "paragraph": "Mr. O’Neill said, “In addition, Logan Law’s fingerprints were found inside the bag but the fingerprints on\nthe handles of the bag don’t belong to my client but two unknown men."
      },
      {
        "paragraph": "“ In other words, you claim that it was Logan Law who kidnapped Ms. Sarah Neeson, but when she was\nkidnapped, Mr. Law was stuffed in a bag. Could there be such a kidnapper, Mr. Hill? Or are you trying to\nsay that this is something my client has staged?”"
      }
    ]
  },
  {
    "title": "Chapter 895 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun pursed his thin lips sharply."
      },
      {
        "paragraph": "He knew that as a lawyer, Sarah would definitely lose if he did not speak up."
      },
      {
        "paragraph": "However, when the evidence was in front of him, it forced him to falter."
      },
      {
        "paragraph": "Thomas anxiously advised when he saw that Shaun was not moving. “Eldest Young Master Hill, hurry up\nand defend Sarah. Logan will be released if you don’t argue back.”"
      },
      {
        "paragraph": "Mr. O’Neill saw this and said, “Mr. Hill, I know you’re a famous legend in the legal world and have never\nlost, but as you said, lawyers also need to be conscientious. In terms of sophistry, I’m definitely inferior to\nyou."
      },
      {
        "paragraph": "“However, there are many points of doubt in this case. Logan Law is just a young man who’s only 21\nyears old. If he ends up going to jail for this, he’d have missed the golden years of his life after he’s\nreleased. The most tragic thing is that he’s clearly a victim. He was drugged when he was in the cave. ”"
      },
      {
        "paragraph": "When this remark was spoken, the audience was in a n uproar."
      },
      {
        "paragraph": "Shaun’s chest heaved. What Liam said suddenly flashed in his mind. The police were investigating the\ncase, but he had not even given Catherine a chance to clear her name."
      },
      {
        "paragraph": "His mind suddenly went blank."
      },
      {
        "paragraph": "His eyes subconsciously looked at Catherine who was sitting in the audience, but she was not even\nlooking at him. She was only focused on Mr. O’Neill."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "His heart surged with an overwhelming sense of uncertainty and loss."
      },
      {
        "paragraph": "He had never felt this way before."
      },
      {
        "paragraph": "At that time, Mr. O’Neill spoke again, “This is the blood test report from the hospital. Logan Law was\ntested positive for drug addiction, but his blood composition showed that he had only taken drugs very,\nvery few times. In other words, that day was most likely his first time, but he was injected with a strong\ndrug that caused him hallucinations, which was why he assaulted Sarah Neeson.”"
      },
      {
        "paragraph": "“Let me see. ” The judge reached out and took Mr. O’Neill’s report."
      },
      {
        "paragraph": "After Mr. O’Neill took a sip of water, he concluded, “"
      },
      {
        "paragraph": "Actually, the sequence of events in this case is very simple. Logan Law ate the meal delivered to him by\nthe delivery man in the apartment and fainted. Two people then brought him to the cave and drugged\nhim. After waking up, Ms. Neeson was also there and he lost control.”"
      },
      {
        "paragraph": "The judge looked at the pale Sarah. “ Plaintiff, do you still remember what happened in the cave at that\ntime?”"
      },
      {
        "paragraph": "Sarah’s brain was buzzing. She knew that with so much evidence, it would be difficult to convict Logan.\nNow, the most important thing was to clear their suspicions of her."
      },
      {
        "paragraph": "“I… I had also fainted, and when I woke up, I was in the cave. When I opened my eyes, I saw that Logan\nLaw was trying to… take off my clothes.”"
      },
      {
        "paragraph": "Thomas swore in anger, “In other words, Logan Law was trying to assault my sister!”"
      },
      {
        "paragraph": "“Audience, be quiet! ” The judge gave Thomas a warning glare."
      },
      {
        "paragraph": "Sarah nearly vomited blood. Thomas never knew how to judge the situation. He would die because of his\nstupidity sooner or later."
      },
      {
        "paragraph": "Mr. O’Neill smiled. “As far as I know, Ms. Neeson and Logan Law are also somewhat involved.”"
      },
      {
        "paragraph": "“We don’t have any connections. I don’t know him at all. Shaun, say something.” Sarah anxiously pulled\non the silent Shaun."
      },
      {
        "paragraph": "Thomas also said, “Yeah, Eldest Young Master Hill. If you lose this lawsuit, you’ll become a laughing\nstock.”"
      },
      {
        "paragraph": "Shaun was distracted and tightened his fist. He was just about to open his mouth when Mr. O’Neill spoke\nfirst, “Mr. Hill, in fact, this involvement is related to you. Do you want to hear it?”"
      }
    ]
  },
  {
    "title": "Chapter 896 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“It’s related to me?” Shaun frowned subconsciously."
      },
      {
        "paragraph": "“Yes.” Mr. O’Neill nodded. “Logan Law is Miss Catherine Jones’ bodyguard. As far as I know, you were\ndating Miss Jones until some days ago and Sarah Neeson is your ex-girlfriend. You caught Logan Law\ntrying to assault Sarah Neeson red- handed, so you thought that it was Catherine Jones who asked\nLogan Law to do it."
      },
      {
        "paragraph": "“Therefore, you flew into a rage and had a fierce conflict with Miss Jones. The two of you even broke up\nagain. You went to Sarah Neeson, the victim, again out of guilt. At the same time, you decided in your\nheart that Catherine Jones was a vicious woman not worthy of your love— ”"
      },
      {
        "paragraph": "“What do you mean by that?” Sarah stood up in agitation. “ I was almost ruined by someone else, but\nyou’re speaking as if I deliberately framed Logan Low. Please, look at my injuries. I almost died. If I had\nknown that I would be vilified like this, I should never have let the doctor save me in the first place.”"
      },
      {
        "paragraph": "“Sarah, calm down.” Thomas immediately grabbed her. “Don’t be rash. Your Honor, that’s simply\nimpossible. My sister slammed her head on the wall to kill herself due to the unbearable humiliation. She\nwould’ve died if she wasn’t sent to the hospital in time.”"
      },
      {
        "paragraph": "“What a coincidence,” Freya suddenly stood up and said loudly, “I remember that one of the witnesses is\nChester Jewell, a world-famous doctor, right?"
      },
      {
        "paragraph": "How could she have died?”"
      },
      {
        "paragraph": "As soon as this remark was uttered, everyone began to look at Sarah differently."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun’s brain felt like it was close to exploding."
      },
      {
        "paragraph": "A thought he had not dared to imagine flashed by."
      },
      {
        "paragraph": "What if all this was indeed deliberately planned by Sarah? Yes, she had attempted suicide at that time,\nbut Chester was there. It was impossible that she would die."
      },
      {
        "paragraph": "However, not many women could plot such a ruthless scheme, right?"
      },
      {
        "paragraph": "“That’s enough, stop talking! ” Sarah interrupted with a pained cry. “What you’re saying is that I framed\nLogan Law, but what about the evidence? Have you ever thought that if the people who came to save\nme at that time were even a minute later, I would’ve really been ruined? How many women would dare to\nsacrifice their innocence and gamble with their own bodies? You have no idea how much pain I’ve been\nin lately.”"
      },
      {
        "paragraph": "She cried bitterly."
      },
      {
        "paragraph": "The judge frowned and looked at Mr. O’Neill warningly. “Do you have evidence for what you said?”"
      },
      {
        "paragraph": "“I’m just guessing. After all, there needs to be a motive for Logan Law to be framed, but it’s certain that it\nwas another person who kidnapped Ms. Neeson. Mr. Law is also a victim.”"
      },
      {
        "paragraph": "The judge nodded. “I declare that Logan Law is not guilty of the crime. As for Sarah Neeson’s real\nkidnapper, I will hand these videos and information to the police to investigate the two suspicious people.\nIn addition, after Logan Law’s injuries have healed, he’s to be sent to the drug rehabilitation center.”"
      },
      {
        "paragraph": "After the court hearing, everyone was stunned."
      },
      {
        "paragraph": "Everyone could not believe that an unknown lawyer like Mr. O’Neill had defeated the industry legend,\nShaun Hill."
      },
      {
        "paragraph": "Mr. O’Neill was even more excited. “Miss Jones,"
      },
      {
        "paragraph": "this is incredible! I actually defeated Shaun Hill! Hahahaha, am I dreaming?”"
      },
      {
        "paragraph": "“It’s not a dream, Mr. O’Neill. Thank you.” Catherine was sincerely grateful."
      },
      {
        "paragraph": "“No, no, no, I know I didn’t do anything. It’s because you found all the evidence.” Mr. O’Neill laughed."
      },
      {
        "paragraph": "At the same time, Logan also limped over. His handsome and unruly face appeared emotional. “ Boss,\nthere’s nothing else to say. I’ll live as your subordinate for the rest of my life. Even my ghost will belong to\nyou.”"
      },
      {
        "paragraph": "Austin laughed. “Yeah. The boss had less than three hours of sleep for five consecutive nights because\nof you.”"
      },
      {
        "paragraph": "“Thank you.” Logan’s eyes were red."
      }
    ]
  },
  {
    "title": "Chapter 897 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“No, I should be saying sorry to you instead.” Catherine’s eyes fell on his missing finger and deep guilt\nsurged in her eyes. “If it weren’t for me, you wouldn’t have been targeted in the first place.”"
      },
      {
        "paragraph": "“That’s normal. I only blame myself for being too careless.” Logan smiled bitterly. “I only realized\nsomething when you showed the footage just now. The backs of the two kidnappers were similar to\nthose men who were involved with Lucifer’s death that night.”"
      },
      {
        "paragraph": "Catherine was stunned. “Looks like they’re the same group of people. It’s a shame that we still haven’t\nuncovered the person behind Sarah.”"
      },
      {
        "paragraph": "“We have to take it one step at a time.” Logan hissed. “My wound hurts too much. I should go back to the\nhospital.”"
      },
      {
        "paragraph": "“Come back after getting better,” Catherine reminded him in a low voice."
      },
      {
        "paragraph": "“Yeah. Austin, take good care of the boss. If anything happens to her, I’ll make you pay when I come\nback,” Logan warned before leaving with the police."
      },
      {
        "paragraph": "On the other hand, Shaun sat in the chair expressionlessly. His eyes were locked on Catherine."
      },
      {
        "paragraph": "Everyone thought that he was upset because his reputation as a legendary lawyer was lost because of a\nsmall lawyer."
      },
      {
        "paragraph": "This was not true. It was not that he did not have a chance to win. With his eloquence, he could have\nfound a reason to fight back no matter what the evidence was."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "However, when the evidence was laid out in front of him, he realized that Logan might really have been\nframed."
      },
      {
        "paragraph": "In fact, he should have investigated it clearly from the beginning. It was just that in the cave that day, he\nhad seen Logan assaulting Sarah and causing her to attempt suicide. Hence, he jumped to conclusions."
      },
      {
        "paragraph": "Later, he learned that Logan worked for Catherine. In addition, Logan and Catherine had met in a bar the\nother day, so he thought Catherine had given him the order."
      },
      {
        "paragraph": "It was because Catherine had a criminal motive, and she hated Sarah and him."
      },
      {
        "paragraph": "He forgot about collecting fingerprints from the car and forgot that there was no footage that showed\nLogan’s face during the entire process of the kidnapping."
      },
      {
        "paragraph": "It was all a conspiracy."
      },
      {
        "paragraph": "Maybe Mr. O’Neill was right. It was a conspiracy to completely destroy the relationship that Catherine\nand he had just established."
      },
      {
        "paragraph": "In fact, it should not have gone this far. When did it start?"
      },
      {
        "paragraph": "When he cut off Logan’s finger?"
      },
      {
        "paragraph": "When he decided to personally take on the lawsuit for Sarah?"
      },
      {
        "paragraph": "Both Elle and Hadley had said that Catherine treated Logan like a family member. In the end, he cut off\nher family member’s finger."
      },
      {
        "paragraph": "Hadley had said that if he took on the lawsuit for Sarah, it would bring their relationship to a complete\nend."
      },
      {
        "paragraph": "His every ruthless step had pushed their relationship over the edge."
      },
      {
        "paragraph": "However, he had not wanted to do these things either. It was Sarah who said that she wanted"
      },
      {
        "paragraph": "Logan’s finger, and it was Thomas who said only he could win the lawsuit or Logan would get away with\nit. Hence, he agreed."
      },
      {
        "paragraph": "“Shaun, let’s go…”"
      },
      {
        "paragraph": "Sarah uneasily and apprehensively watched his handsome face go blank. He was lost in thought, and\nthen he suddenly became cold and gloomy."
      },
      {
        "paragraph": "She reached out to grab his hand, but before she could, he avoided her."
      },
      {
        "paragraph": "Her body stiffened, and Thomas quickly said, “ Eldest Young Master Hill, why are you like this? Sarah is\nalready very miserable. Hasn’t she been hurt enough today?”"
      },
      {
        "paragraph": "“Yes, she’s already very miserable.” Shaun smiled."
      }
    ]
  },
  {
    "title": "Chapter 898 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "When he thought about it carefully, did Sarah lose her chastity to Logan? No. On the contrary, what\nabout Logan? His finger was cut off, he became addicted to drugs, and his body was scarred."
      },
      {
        "paragraph": "“ Shaun, you don’t believe me?” Sarah miserably looked at him with a pale face."
      },
      {
        "paragraph": "Shaun also stared at her."
      },
      {
        "paragraph": "This was the woman he used to love. Even if he did not love her anymore, he also wanted to protect her\nwell. However, he suddenly found that he could not understand her at all anymore."
      },
      {
        "paragraph": "Lucifer was the first time he felt this way."
      },
      {
        "paragraph": "As for this time, she was suddenly kidnapped just as Catherine and he were getting along well. Then,\neverything changed."
      },
      {
        "paragraph": "If not for these siblings, he would not have cut off Logan’s finger and he would not have taken on this\nlawsuit either."
      },
      {
        "paragraph": "If all this was really planned by Sarah, it would make his hair stand on end."
      },
      {
        "paragraph": "“Sarah, your case will be officially taken over by the police in the future. They’ll try their best to help you\nfind the two kidnappers. I’ve already broken up with you, so don’t come to me again in the future. ”"
      },
      {
        "paragraph": "Shaun lowered his eyes and finished speaking before stepping away, preparing to leave."
      },
      {
        "paragraph": "Sarah grabbed his arm and cried out, “Shaun, it doesn’t matter if others doubt me, but we’ve known each\nother for 20 years. Don’t you believe me? I’m just a weak woman. How could I have the ability to kidnap\nLogan Law? His combat ability is on par with Chance Ziegler’s. Besides, I really didn’t know that Logan\nwas also kidnapped. The first thing I saw when I opened my eyes was him.”"
      },
      {
        "paragraph": "When he thought about it carefully, did Sarah lose her chastity to Logan? No. On the contrary, what\nabout Logan? His finger was cut off, he became addicted to drugs, and his body was scarred."
      },
      {
        "paragraph": "“That’s right, ” Thomas hurriedly said, “Even if I mess around, I only mess around with some small punks.\nI’ve never touched drugs before. These people are obviously an organized force. What would happen if\nthey lay their hands on Sarah again?”"
      },
      {
        "paragraph": "Sarah looked at Thomas in appreciation. This guy had finally said something useful."
      },
      {
        "paragraph": "Shaun’s temples twitched at the siblings’ yelling."
      },
      {
        "paragraph": "He had never been so fed up before. He felt like he was floating in mid-air, powerless and fearful."
      },
      {
        "paragraph": "He became especially jittery when he saw Catherine walking out of the courtroom."
      },
      {
        "paragraph": "“I’ll find someone to protect you for some time, but please don’t contact me again.”"
      },
      {
        "paragraph": "Shaun shook off Sarah’s arm. “Sarah, you have to get it clear. When I broke up with you, I gave you a\nhouse, a car, and billions of dollars in cash. As for you, Thomas, I’ve protected your family for so many\nyears and even saved you multiple times. I don’t owe you anymore.”"
      },
      {
        "paragraph": "Sarah’s face showed defeat and was pale as snow. Her tears came streaming down."
      },
      {
        "paragraph": "However, Shaun was unable to care. He was too tired because he realized that his bond with Sarah had\ncompletely ruined the feelings that Catherine and he painstakingly built."
      },
      {
        "paragraph": "“Sarah, stop tying your life and death to me.”"
      },
      {
        "paragraph": "Shaun retreated step by step and turned around to g o after Catherine without looking back."
      },
      {
        "paragraph": "In the corridor, Freya and Catherine stood waiting for the elevator."
      },
      {
        "paragraph": "Shaun took big strides toward Catherine. His pace was eager, but before he got close, Austin blocked\nhim."
      },
      {
        "paragraph": "“Get out of the way. I need to talk to her.”"
      },
      {
        "paragraph": "Shaun only stared at Catherine anxiously. He realized that even though only a few days had passed\nwithout seeing her, she had become haggard. Her eyes were red and bloodshot. Plus, there were dark\ncircles under her eyes."
      },
      {
        "paragraph": "She must have been very worried about Logan’s case and probably did not sleep for several nights."
      },
      {
        "paragraph": "His heart ached fiercely."
      },
      {
        "paragraph": "He had forced all this to happen. If he had more trust in her, things would not have come to this."
      },
      {
        "paragraph": "Freya sneered, “Eldest Young Master Hill, how can you be so shameless to come over here? When you\nhurt Cathy, you were ruthless and merciless, calling her a vicious woman. You didn’t spare her the\nslightest affection. Now that you’ve realized you misunderstood her, you want to come and make peace\nagain?”"
      }
    ]
  },
  {
    "title": "Chapter 899 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun’s chest ached at Freya’s words."
      },
      {
        "paragraph": "He looked at Catherine’s cold face and suddenly remembered that just a short while ago, the two of them\nwere still swimming at Mount Wellington."
      },
      {
        "paragraph": "Her bright and clear eyes, the way she occasionally acted coquettishly with him, and how sweet her\nlaugh was…"
      },
      {
        "paragraph": "How did it all change in the blink of an eye?"
      },
      {
        "paragraph": "“I’m…”"
      },
      {
        "paragraph": "“You don’t have to say that you’re sorry.” Catherine’s clear and cold voice interrupted him. “ Because I’ll\nnever forgive you.”"
      },
      {
        "paragraph": "“You’d better go protect your precious Sarah, ” Freya mockingly said, “After all, if something happens to\nher, you’ll always and unconditionally go out of your way to accompany her and protect her. Shaun Hill,\nin your eyes, Sarah’s position is just too special. Why can’t you admit it?"
      },
      {
        "paragraph": "“On the one hand, you think you don’t love her, yet you want to protect her. On the other hand, you want\nCatherine’s love, yet you want her to come back to you no matter how much you hurt her. Do you think\nyou’re filming a drama?”"
      },
      {
        "paragraph": "Shaun’s delicate and handsome face became pale."
      },
      {
        "paragraph": "Freya was indescribably happy at his expression. “By the way, I accidentally heard that you gave Sarah a\nhouse, a car, and billions of dollars when you broke up with her? My God. That must be the world’s"
      },
      {
        "paragraph": "most expensive break-up fee. May I ask what you gave to Cathy when you divorced her?”"
      },
      {
        "paragraph": "Shaun’s chest ached at Freya’s words."
      },
      {
        "paragraph": "“Cathy, I won’t do it again. I swear! ” Shaun panicked."
      },
      {
        "paragraph": "The more Freya spoke, the more he became acutely aware that he had been unfair to Catherine."
      },
      {
        "paragraph": "“Stop swearing. Your promises make me sick. Shaun Hill, stay away from me in the future. What you can\ngive me isn’t happiness; it’s pain that drives me into the abyss time and again. I can never forgive you,\nso don’ t come looking for me again. You disgust me.”"
      },
      {
        "paragraph": "Catherine went into the elevator without looking back."
      },
      {
        "paragraph": "Shaun’s legs felt like they were filled with lead when he faced her hateful eyes. He tried to approach her\nbut was unable to move."
      },
      {
        "paragraph": "It was not until she left that he felt that his body was drained of all energy."
      },
      {
        "paragraph": "He did not know how he walked out of the courthouse."
      },
      {
        "paragraph": "He walked alone on the street for a long time until he was tired of walking. He sat on a chair by the street\nlike a puppet without a soul."
      },
      {
        "paragraph": "Hadley walked over with an umbrella. “Eldest Young Master Hill, it’s too sunny. You should go back to the\ncar first.”"
      },
      {
        "paragraph": "“Hadley, do you think she’ll forgive me?” Shaun looked down at his hands."
      },
      {
        "paragraph": "These hands had cut off Logan’s finger."
      },
      {
        "paragraph": "She had begged him time and again to believe her."
      },
      {
        "paragraph": "What about him? He said that he loved her, but he never once gave her an ounce of trust."
      },
      {
        "paragraph": "He even inflicted all the wounds that Sarah suffered on Catherine. He tried to lock Logan and her in the\nbasement as well."
      },
      {
        "paragraph": "If Catherine had not used Suzie to escape with Logan, maybe he would never have realized the truth."
      },
      {
        "paragraph": "It was no wonder she had asked why he was not locked up in the mental hospital with so much\nresentment."
      },
      {
        "paragraph": "How could he be so blind?"
      },
      {
        "paragraph": "Yes, how did he become so blind? What kind of madness was he afflicted with for him to hurt a woman\nhe loved like that?"
      },
      {
        "paragraph": "Hadley looked at Shaun’s absent-minded appearance and realized that it was his first time seeing Shaun\nlike this. It was as if he had lost his most beloved treasure and was at a loss."
      }
    ]
  }
]