[

  {
    "title": "Chapter 1700 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“You didn’t lose your memory. During our marriage, you frequently contacted your ex- girlfriend, and\nyou relied on her and trusted her. She was the reason that we got divorced. Because you had a mental\ndisorder, she took the opportunity when she was treating you to tamper with the memory in your mind.\nAll you remembered was the unpleasant things between us, and you deleted the good times we had\nlike a computer. It was a very tough time for me. Later, we divorced and got back together, but not long\nafter, you ended up like this…”"
      },
      {
        "paragraph": "Shaun was so shocked that he remained silent for a long time."
      },
      {
        "paragraph": "The complexity of the past probably caught him off guard."
      },
      {
        "paragraph": "He had simply listened to Rodney talk about the past, but he did not know that the reason for the\ndivorce was so complicated."
      },
      {
        "paragraph": "Furthermore, he could tell that Cathy somewhat resented him when she recounted the story."
      },
      {
        "paragraph": "“Cathy… Did I used to make you very tired?” It seemed like he was finally aware of this problem."
      },
      {
        "paragraph": "“It would be a lie if I said no.”"
      },
      {
        "paragraph": "Catherine’s voice was filled with bitterness. “Your memory may never be restored. You’ll have a new\nlife, and you shouldn’t be responsible for the past. Shaun, perhaps you relying on me and wanting to\nsleep with me is like a baby bird depending on its mother. At the same time, I’m the first young woman\nyou’ve come in contact with, so it’s normal for you to have your needs when you’re with me. It’s just an\ninstinctive reaction of your body.”"
      },
      {
        "paragraph": "“I’m the children’s father. Of course I have to take responsibility,” Shaun hurriedly said."
      },
      {
        "paragraph": "“Of course you do, but only for the children. You can teach them how to read, write, and play. You can\npay for their tuition fees and buy clothes for them. You can fulfill your duty as a father.”"
      },
      {
        "paragraph": "Catherine said softly, “ I hope you can go to work and expose yourself. That way, you can make friends\nand meet more women. Maybe one day, you’ll understand what your feelings for me are now.\nRemember, I don’t need you to take responsibility for me. We’re divorced, so no one is responsible for\nthe other.”"
      },
      {
        "paragraph": "Then, she turned and left."
      },
      {
        "paragraph": "Although she felt depressed and in pain, she felt inexplicably relaxed."
      },
      {
        "paragraph": "It seemed like the uncertainty and fear she felt in the past few days had been relieved."
      },
      {
        "paragraph": "Shaun stared at her back and suddenly said in a low voice, “Cathy, you said all that because you don’t\nwant to be with me anymore, right?”"
      },
      {
        "paragraph": "“ Shaun, I’m scared that if I get together with you and finally see a ray of hope, you’ll forget me again.\nIt’s because you’ve never given me a sense of security. I care about you, but I’m always the one being\nleft behind. That’s how you used to be, and now, you don’t even know what love is. How will I dare to\nentrust my future to you?”"
      },
      {
        "paragraph": "Once Catherine finished speaking, she went downstairs to look for the children."
      },
      {
        "paragraph": "Shaun stood rooted to the ground for a long time before entering the other bedroom like a robot."
      },
      {
        "paragraph": "Then, he sat on the bed."
      },
      {
        "paragraph": "When he thought about what Catherine said, his heart hurt like it was whipped."
      },
      {
        "paragraph": "However, he did not blame Cathy. He did not blame her at all."
      },
      {
        "paragraph": "In the end, the old him was to blame for being too useless."
      },
      {
        "paragraph": "After all, he could not even protect his woman. Since something went wrong with his brain time and\ntime again, he really could not give Cathy happiness."
      },
      {
        "paragraph": "He wanted to be a powerful man. He wanted to protect Cathy."
      },
      {
        "paragraph": "His dark eyes flashed with resolute determination."
      }
    ]
  },
  {
    "title": "Chapter 1701 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "At night."
      },
      {
        "paragraph": "Catherine tossed and turned but could not fall asleep."
      },
      {
        "paragraph": "Although she was firm when talking to Shaun, she was still worried that he would overthink all the\ntruths he learned in the last two days."
      },
      {
        "paragraph": "Furthermore, she was a little unaccustomed to the sudden absence beside her."
      },
      {
        "paragraph": "The next day, she woke up at 6:00 a.m. When she came out, she saw that the light in the second-floor\nstudy was on."
      },
      {
        "paragraph": "She walked over and gently opened the door to see Shaun sitting on the desk in his pajamas, carefully\nflipping through a pile of thick documents on the desk."
      },
      {
        "paragraph": "“What are you doing?” she asked aloud, stunned."
      },
      {
        "paragraph": "At her voice, Shaun turned around. Under his slightly ruffled black hair, his dark eyes were as calm as\nspring water. “I’m looking at some information and documents related to Hill Corporation.”"
      },
      {
        "paragraph": "“Where did you get them?”"
      },
      {
        "paragraph": "“ I had Hadley send them over last night,” Shaun said in embarrassment."
      },
      {
        "paragraph": "Catherine was surprised. It meant that late last night after their talk, Hadley must have come over, and\nshe might have been asleep by then. “Did you stay up all night…”"
      },
      {
        "paragraph": "“No, I slept. I’m going to Hill Corporation today, so I don’t want to fight an unprepared battle, ” Shaun\nsaid seriously."
      },
      {
        "paragraph": "Catherine pursed her pretty lips."
      },
      {
        "paragraph": "Mixed feelings and self-mockery washed over her. It seemed like he had adapted well and accepted it\nquickly. She was the one who was overthinking."
      },
      {
        "paragraph": "Perhaps he felt relieved after thinking through what she had said yesterday."
      },
      {
        "paragraph": "“I’m fine. Why don’t you… sleep in?” Shaun looked at her and felt that she looked very tired."
      },
      {
        "paragraph": "“No, I want to go for a run. ” Catherine shook her head. “Oh, I’ll accompany you to the company after\nbreakfast.”"
      },
      {
        "paragraph": "“No need. Hadley will pick me up later. Besides, I’m planning to go there early. You should go and do\nyour own thing, Cathy.”"
      },
      {
        "paragraph": "Shaun refused. Since he knew that Hill Corporation was his, he could not rely on her all the time."
      },
      {
        "paragraph": "Furthermore, if she went to Hill Corporation, she might be humiliated and looked down upon by Wade."
      },
      {
        "paragraph": "He did not want her to go through that."
      },
      {
        "paragraph": "The old him might have been very impressive since he was the richest man in the country. However, in\nhis eyes now, that person was schemed against"
      },
      {
        "paragraph": "time and time again and lost his memories. He may have given Catherine love, but he also left her with\na lot of burdens and pain."
      },
      {
        "paragraph": "If a man could not protect his memory, what right did he have to love a woman?"
      },
      {
        "paragraph": "Of course, he was not who he used to be. However, not everything was all talk and no action."
      },
      {
        "paragraph": "He was sure that the old him was quite good at talking to have captured her heart."
      },
      {
        "paragraph": "However, he did not want that. He wanted to clear all the obstacles and then walk up to tell her that he\nwas worthy of loving her."
      },
      {
        "paragraph": "“…Okay.”"
      },
      {
        "paragraph": "Catherine did not know what he was thinking. All she knew was that Shaun seemed different after a\nnight."
      },
      {
        "paragraph": "When she left the study and went downstairs, she was in a daze."
      },
      {
        "paragraph": "If it were in the past, Shaun would have insisted on following her if he heard she was going for a run."
      }
    ]
  },
  {
    "title": "Chapter 1702 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "In the past, Shaun would never separate from her, and he always wanted her accompaniment."
      },
      {
        "paragraph": "Heh. Although Catherine knew that he would grow up, she was still disappointed that he was growing\nso fast."
      },
      {
        "paragraph": "Fortunately, she was clear-headed enough."
      },
      {
        "paragraph": "She understood that what Shaun had for her was dependence, not love."
      },
      {
        "paragraph": "Just as Catherine came back from her run, she happened to see Shaun get into a black car and leave."
      },
      {
        "paragraph": "She stared in a daze for a long time before coming back to her senses."
      },
      {
        "paragraph": "After sending the children to the preschool, she drove to Militaire Hospital."
      },
      {
        "paragraph": "She walked in after parking her car and saw the burly Titus in the private garden. With his back to her,\na withered leaf fell on his shoulder and made the big man look a little bleak."
      },
      {
        "paragraph": "“Uncle Titus…” Catherine called out softly."
      },
      {
        "paragraph": "Titus snapped back to his senses. “Why are you here?”"
      },
      {
        "paragraph": "“I contacted your assistant on the phone, and he let me in.” Catherine noticed his bloodshot eyes. “Did\nyou sleep?”"
      },
      {
        "paragraph": "Titus rubbed his eyebrows. “I had to deal with something until late last night…”"
      },
      {
        "paragraph": "“Are you worried about Matthew?” Catherine interrupted him, her eyes sharp and bright."
      },
      {
        "paragraph": "“Like I said, as my son, he couldn’t even protect himself. He deserves to be kidnapped. The weak\naren’t allowed in the Costner family.” Titus’s majestic voice was cold and heartless."
      },
      {
        "paragraph": "Catherine thought about Matthew’s young and handsome face, and her heart ached. She did not dare\nto imagine how Matthew would look like when she saw him again. “Uncle Titus, you’re saying those\nwords as the head of the Costner family, but what about as Matthew’s father? You must be a strict\nfather, but I believe that you love your child more than anyone else. In fact, what you did at the meeting\nyesterday was very satisfying and pleasing. However, I’m worried that Wesley will take out his\nembarrassment and hatred on Matthew…” “It’s enough for me if I can rescue him alive.”"
      },
      {
        "paragraph": "Titus interrupted her and stared into her eyes. “"
      },
      {
        "paragraph": "Other than a family dispute when I was young, I have never suffered such a big loss. I have been\ntricked to the point I have to lock my wife up, and my son is nowhere to be found. Do you know what it\nwould mean if I compromise and retreat?”"
      },
      {
        "paragraph": "“It means that the powerful Costner family has been manipulated by a puny guy called Wesley Lyons in\nAustralia. We’ll become a global laughing stock, and the Costner family reputation will be in ruins. The\nforces I’ve managed to get under my thumb after a lot of effort will think that I’ve grown old, and they’ll\nbegin to stir up trouble. If that happens, Neah Bay will be in a bloody storm again. In the past, it was a\ndog-eat-dog place.”"
      },
      {
        "paragraph": "Catherine was shocked. She really did not expect that so much would be at stake."
      },
      {
        "paragraph": "“You didn’t think of that, did you? Neither did Wesley. That was why he used Matthew to threaten me,\nthinking that he could restrain me. I can’t retreat, but at most, I can give him a chance to live.”"
      },
      {
        "paragraph": "Titus laughed coldly. “Besides, do you think he’ll immediately let Matthew go if I don’t get involved in"
      },
      {
        "paragraph": "Hill Corporation’s matters? You’re wrong. He’ll be afraid of my revenge and use Matthew to threaten\nme for at least five or six years. Once he has Hill Corporation in one hand and Golden Corporation in\nanother, he’ll become a poweful figure not only in Austalia but in the world. Then, he’ll support Gavin\nMead to run for the next term and get rid of the Snow family. By then, he can decide whether he wants\nto return Matthew to me or not. In any case, I wouldn’t be able to do anything to him.”"
      },
      {
        "paragraph": "Cathenrine’s hair stood on end as she listened."
      },
      {
        "paragraph": "Wenley’s scheme was… truly terrifying."
      },
      {
        "paragraph": "What was even more terrifying was that Titus completely was through Wesley. “How do you…”"
      },
      {
        "paragraph": "“You’ll know about these kinds of things when you see them more often.” Titus said faintly, “Why else\ndo you think Gavin helped him? Both of them have an exchange of interests.”"
      },
      {
        "paragraph": "Catherine fell silent, not knowing what to say. In front of these big shots, she felt tiny."
      }
    ]
  },
  {
    "title": "Chapter 1703 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Do you… want to see Sheryl?” Titus suddenly asked."
      },
      {
        "paragraph": "“…No need. If I see her, she’ll definitely scold me and say I’m seducing you again. She has nothing\ngood to say to me anyway.” Catherine shook her head firmly."
      },
      {
        "paragraph": "“It seems like… you’re very disappointed in this mother.” Titus smiled intriguingly. “But do you know\nhow rich she is? She might be even richer than me.”"
      },
      {
        "paragraph": "“I know. She’s the owner of Soromon Island, which has tons of oil reserves. She’s extremely wealthy.”\nCatherine shrugged."
      },
      {
        "paragraph": "Titus was surprised. “ Since you know, you should understand that as her daughter, you’ll be the richest\nwoman in the world just by inheriting a fraction of her wealth.”"
      },
      {
        "paragraph": "“What’s the point in that? I’d have to hire a bunch of bodyguards to protect me from jealous people. If\nI’m not careful, I’ll be blackmailed and kidnapped.” Catherine shrugged and said in amusement, “I’ve\nnever been short of money since I was a child. I have been living very well, and h many people in the\ncountry are envious of me. I have everything I need and can buy anything I want. I live in a mansion\nand drive a sports car. I don’t want anything else.”"
      },
      {
        "paragraph": "“You’re really…” Titus’s deep eyes revealed a smile. “You’ re very clear-headed. Unfortunately, many\npeople are greedy.”"
      },
      {
        "paragraph": "“Perhaps it’s because I grew up with my grandparents. When I was young, they would give me\nwhatever I wanted.” Catherine said a little ruefully, “I’ll leave now.”"
      },
      {
        "paragraph": "After she left, Warren came over with a heavy expression. “Ms. Jones just left?”"
      },
      {
        "paragraph": "“Her affection for Sheryl probably ran out long ago.” Titus sighed and shook his head. “Sherry was a\nfool.”"
      },
      {
        "paragraph": "“That’s a shame. Ms. Jones is a good lady.” Warren was silent for a moment before pulling out a paper\nbag and a note from behind him. “Wesley sent a note over. He said that for each day you refuse to give\nup Hill Corporation and allow Golden Corporation to do business in Country Y, he’ll… cut off one of\nYoung Master’s fingers.”"
      },
      {
        "paragraph": "Titus’s eyes fell on the finger in the paper bag. It was his son’s finger, and there was a scar on it too."
      },
      {
        "paragraph": "He had to admit that Wesley really knew how to pick the finger."
      },
      {
        "paragraph": "“President Costner…” Warren looked pained."
      },
      {
        "paragraph": "“Go and urge Nathan Snow to speed up the progress of the case. Also, create more bad medical press\nabroad against Golden Corporation.” A hostile glint flashed across Titus’s eyes before he said,“ Also,\ntell Wesley that he can cut off Matthew’s fingers if he wants to. But when he’s at the end of his rope, I’ll\nmake his fate ten thousand times worse than Matthew.”"
      },
      {
        "paragraph": "“ …Understood,” Warren replied stiffly."
      },
      {
        "paragraph": "After he left, no one saw Titus hammer his fist on a nearby tree. Blood then flowed out from his joints."
      },
      {
        "paragraph": "He said coldly, “Wesley Lyons, I’ll make you suffer a fate worse than death.”"
      },
      {
        "paragraph": "In the hospital."
      },
      {
        "paragraph": "Hannah carried a fruit basket into the luxuriously decorated VIP ward."
      },
      {
        "paragraph": "Wesley was leaning on the headboard with a computer on the small bed table. She did not know what\nhe was reading, but his elegant face was extremely cold and sinister."
      }
    ]
  },
  {
    "title": "Chapter 1704 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "However, when Wesley saw Hannah come in, he immediately kept the coldness on his face and smiled\nwarmly. “Ms. Mead, what brings you here?”"
      },
      {
        "paragraph": "“We heard something happened to you, so my father told me to come to see you.” Hannah tossed the\nfruit basket on the table and said with an indifferent expression."
      },
      {
        "paragraph": "To be honest, she hated Wesley. He may look elegant, but he was full of schemes. As a woman,\nalthough she was jealous of Catherine, she also understood Catherine’s feelings. Wesley was not half\nas manly as Shaun, and his business acumen was not as good as Shaun’s either. Instead, he liked to\ntake shortcuts and was a crook."
      },
      {
        "paragraph": "However, her father said that he needed a venomous snake like Wesley to act as the vanguard.\nOtherwise, how could she become a princess in the future?"
      },
      {
        "paragraph": "“Please thank Minister Mead for me.” Wesley smiled faintly. “Have a seat, Ms. Mead.”"
      },
      {
        "paragraph": "Hannah said indifferently, “No need for that. My father was furious in his office this morning. He has\nlearned about Golden Corporation’s scandal abroad and wants me to ask you a question. Is Golden\nCorporation ruined?”"
      },
      {
        "paragraph": "Wesley secretly clenched his fists."
      },
      {
        "paragraph": "He had just sent Titus Matthew’s finger over this morning, so he never expected that Titus would send\nhim such a large gift in the afternoon."
      },
      {
        "paragraph": "Now, the trending searches abroad were full of news that Golden Corporation’s medicine had killed\npatients. At present, Golden Corporation’s drugs were considered prohibited drugs in various countries,"
      },
      {
        "paragraph": "and no country was allowed to use Golden Corporation’s medicine anymore. Any enterprise that used\nthe drugs and equipment produced from Golden Corporation’s raw materials would also be blacklisted."
      },
      {
        "paragraph": "From 2:00 p.m., his phone had been blowing up with many domestic and foreign manufacturers\nrequesting to return the products and terminate their cooperation with Golden Corporation."
      },
      {
        "paragraph": "The stock price plummeted the moment the market opened, and many investors panicked."
      },
      {
        "paragraph": "His net value also dropped significantly. The worst thing was that many of his partners abroad with"
      },
      {
        "paragraph": "whom he had a good relationship refused to pick up his calls."
      },
      {
        "paragraph": "Internationally, he was completely at his wits’ end."
      },
      {
        "paragraph": "“Ms. Mead, you can tell Minister Mead to rest assured. I’ll do my best to solve this matter…”"
      },
      {
        "paragraph": "“How are you going to solve it? Everyone knows that Titus Costner made the move. Didn’t you say that\nhe wouldn’t dare to do anything to you because his son is in your hands?” Hannah interrupted him with\na mocking expression. “And now, all the Mead family’s relatives abroad are in trouble. Those relatives\nare hounding the Mead family all day, asking my dad to find a way, but what can my dad do? The\nconfidants he has supported for decades have all been ruined by you.”"
      },
      {
        "paragraph": "Wesley looked extremely embarrassed."
      },
      {
        "paragraph": "His fists under the quilt clenched tightly. He took a deep breath, feeling his ribs ache faintly. “Don’t\nworry. I’ll take over Hill Corporation. Wade is one of my men, and Shaun’s brain is damaged. He’s just\na fool now.”"
      },
      {
        "paragraph": "“So what if Wade is one of your men? Jeffery didn’t get Hill Corporation’s shares, and Titus has urged\nthe court to speed up their progress. As long as Titus fights this lawsuit, Jeffery has no chance of\nwinning. Sheryl gave Rebecca goo billion dollars, not g dollars or a house. The judge will definitely give\nthe shares to Titus. After all that you’ve done, you’re letting the Costner family benefit instead.” Hannah\nsneered."
      },
      {
        "paragraph": "“No. When Titus and Sheryl got married, they signed a prenuptial agreement. That goo billion dollars\nbelong to Sheryl. He has no right to recover it,” Wesley suddenly said grimly."
      },
      {
        "paragraph": "Hannah paused. “But that’s a private agreement between Sheryl and him. The judge doesn’t know\nabout it, and we have no evidence, so it’s useless unless Sheryl comes out. But she’s locked up in\nMilitaire Hospital now for treatment.”"
      },
      {
        "paragraph": "“Then we’ll let her out.” Wesley looked at her deep in the eyes."
      },
      {
        "paragraph": "“Do you have a way?” Hannah raised her brows."
      }
    ]
  },
  {
    "title": "Chapter 1705 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Yes. Tell Minister Mead to give me a little more time,” Wesley said in a low voice."
      },
      {
        "paragraph": "“Okay. By the way, my dad said not to leave Matthew alone. The harder you push Titus, the crueler his\nrevenge will be. Titus is a formidable and ruthless person. He is different from ordinary people.”\nHannah warned him before leaving."
      },
      {
        "paragraph": "In the ward, Wesley lowered his eyes and looked at his phone."
      },
      {
        "paragraph": "From the start, when he used Catherine’s hair to pass Rebecca off as Sheryl’s daughter, he was\nalready stepping on a tightrope."
      },
      {
        "paragraph": "Now that he had come this far, he could no longer retreat."
      },
      {
        "paragraph": "Sheryl was his only hope."
      },
      {
        "paragraph": "In Militaire Hospital."
      },
      {
        "paragraph": "Sheryl was drowsy after being given an injection. As she was falling asleep, she felt someone touching\nher hair."
      },
      {
        "paragraph": "“Sherry, I’m sorry. I really didn’t want to do this to you… Seeing you like this hurts me more than\nanyone… but I don’t have a choice… I think that if you’re clear-headed, you wouldn’t want to see\nyourself like this either… You must stay strong… I hope…”"
      },
      {
        "paragraph": "It was Titus’s voice."
      },
      {
        "paragraph": "She did not pay attention to the words toward the end. All she felt was hatred and anger."
      },
      {
        "paragraph": "It hurt him more than anyone? Who was it who made her like this?"
      },
      {
        "paragraph": "Titus Costner. Titus Costner…"
      },
      {
        "paragraph": "She really did not think he would be so vicious. These days, he had locked her up here every day on\nthe basis that he was trying to treat her."
      },
      {
        "paragraph": "However, she was not sick at all. It was him who wanted to drive her crazy."
      },
      {
        "paragraph": "After living in a place like Neah Bay, where people fought and schemed against each other, she had\nseen all kinds of darkness before."
      },
      {
        "paragraph": "Yet, she had never expected her beloved husband to do this."
      },
      {
        "paragraph": "She was in pain, so much pain that she felt like she was going crazy."
      },
      {
        "paragraph": "Eventually, she passed out from the pain."
      },
      {
        "paragraph": "When she woke up again, a nurse was drawing blood from her. Upon seeing that she was awake, the\nnurse quickly stuffed a note into Sheryl’s hand."
      },
      {
        "paragraph": "Sheryl was stunned for a moment and did not move."
      },
      {
        "paragraph": "After the nurse left, she turned around, curled up, and opened up the note. ‘Titus locked Rebecca up.\nWhile she was trying to escape, she accidentally fell down from the balcony and died.’"
      },
      {
        "paragraph": "Her brain exploded."
      },
      {
        "paragraph": "She felt like the string she had been holding on to suddenly snapped."
      },
      {
        "paragraph": "Rebecca was dead?"
      },
      {
        "paragraph": "Her daughter was dead?"
      },
      {
        "paragraph": "Although she had only known Rebecca for a short amount of time, she was her daughter."
      },
      {
        "paragraph": "She had not even fulfilled her duty as a mother, yet her daughter was already gone."
      },
      {
        "paragraph": "Rebecca had gone through so much to return to her side, only to have Titus kill her."
      },
      {
        "paragraph": "Why? Why did this happen?"
      },
      {
        "paragraph": "Rebecca came to her, but not only could she not protect her as a mother, but she even brought harm to\nRebecca."
      }
    ]
  },
  {
    "title": "Chapter 1706 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "‘Titus Costner, you’re so cruel. You’re so cruel.’"
      },
      {
        "paragraph": "Sheryl’s brain buzzed. She had only one thought in her mind and that was to escape."
      },
      {
        "paragraph": "She wanted to see Rebecca one last time. The following night."
      },
      {
        "paragraph": "When the doctor came in and injected Sheryl with sedatives as usual. Just as everyone thought that\nshe was about to fall asleep, she suddenly knocked the doctor and the bodyguards at the door\nunconscious. Then, she jumped out of the window and escaped via the pipe next to the outer wall."
      },
      {
        "paragraph": "When Titus rushed there, all he saw was the doctor and bodyguards in charge of Sheryl standing\noutside guiltily."
      },
      {
        "paragraph": "“I’m sorry, Mr. Costner. The Madam was very skilled. We…” The bodyguard captain bowed his head in\nguilt. They were experts from the Snow family and thought keeping watch of a woman would be easy.\nNever did they expect that a woman could get away under five men’s noses."
      },
      {
        "paragraph": "Titus’s expression turned cold, and he clenched his jaw."
      },
      {
        "paragraph": "As his wife and the owner of Soromon Island, Sheryl was definitely formidable. She had been well\ntrained by the previous owner of the island, so her skill was not inferior to these bodyguards."
      },
      {
        "paragraph": "However…"
      },
      {
        "paragraph": "Titus looked at the doctor coldly. “Hasn’t she been taking medicine and injections every day? How did\nshe have the strength to resist?”"
      },
      {
        "paragraph": "“I… I don’t know either.” The doctor said, “ Logically, it’s not possible…”"
      },
      {
        "paragraph": "Titus’s cold eyes swept over the group of doctors and nurses. “I don’t want to hear your excuses."
      },
      {
        "paragraph": "There are only two reasons why the medicine didn’t work. One, she overcame the side effects with\namazing perseverance, or two, the medicine you injected into her didn’t work.”"
      },
      {
        "paragraph": "The doctor froze and burst into a cold sweat."
      },
      {
        "paragraph": "The medicine was useful before, so it could not be useless. That left the second possibility."
      },
      {
        "paragraph": "“ Since Prime Minister Snow highly recommends your hospital, I hope you don’t let Nathan and your\ndean down. I want to know the reason before dawn“ tomorrow.”"
      },
      {
        "paragraph": "With that, Titus turned around and left."
      },
      {
        "paragraph": "Warren hurriedly followed after him. “President Costner, should we ask Prime Minister Nathan to send\nhelp to find her?”"
      },
      {
        "paragraph": "“No need. I know where she’ll go.” Titus strode to the car."
      },
      {
        "paragraph": "Two hours later, the car appeared at the funeral home."
      },
      {
        "paragraph": "Titus walked into the mourning hall just in time to see Sheryl holding an urn with her back to him. She\nwas still wearing a white hospital gown, and in the late-night, the sight of her made him shudder."
      },
      {
        "paragraph": "At one side, Sally was crying while wiping her tears. “Why are you here? You’re the cause of her death.\nIf I had known that this would happen… I wouldn’t have allowed Rebecca to acknowledge you. After\nshe found out her identity, she scoured across the world to find her mother. But after she did, she lost\nher life instead… Rebecca… Your life was so miserable. ”"
      },
      {
        "paragraph": "Sheryl clutched the urn tightly as tears of guilt and pain filled her eyes. She still could not accept the\nfact. “She’s really…”"
      },
      {
        "paragraph": "“I also wish that it was fake, but I personally sent her to be cremated.” Sally sobbed. “Jeffery said he\nwanted to wait until you came out, so she was frozen until yesterday when Titus forced us and even\nsent someone to destroy her body. We couldn’t stop him, so we had to cremate her.”"
      },
      {
        "paragraph": "“I sent someone to destroy her body?” Titus’s cold voice suddenly echoed in the memorial hall."
      },
      {
        "paragraph": "Sally jumped in fright when she saw him and hurriedly hid behind Sheryl. “You… Why are you here?”"
      },
      {
        "paragraph": "Seeing Sally’s frightened expression, Sheryl turned around and looked at Titus’s tall and handsome"
      },
      {
        "paragraph": "face without concealing the hatred in her eyes. “ Titus, we’ve been married for 2o years. Why do you\nwant to exterminate my family? It’s fine if you’ve had a change of heart. I can give up my position,"
      },
      {
        "paragraph": "but what did Rebecca do wrong? What did my brother and sister-in-law do wrong?”"
      },
      {
        "paragraph": "“It’s… It’s because he wants to take over your assets. ” Sally said boldly, “He locked you up and sued\nyour brother in your name to recover the money you gave to Rebecca, saying that it was your joint\nasset as husband and wife. Your brother and I aren’t money-minded people, but we just can’t stand\nhow he protects Catherine. He has let you down.”"
      },
      {
        "paragraph": "“ Shut your mouth. Stop twisting what’s right and wrong.”"
      },
      {
        "paragraph": "Warren rebuked them angrily as he could not bear to listen to it anymore. “You and Jeffery are money-\nhungry ones, and Rebecca isn’t our Madam’s daughter at all. It’s all a lie fabricated by your family.”"
      }
    ]
  },
  {
    "title": "Chapter 1707 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Drop it. You mean to say Catherine is Sheryl’s daughter, don’t you? You guys killed Rebecca and\ndrove Sheryl crazy so Catherine can impersonate Sheryl’s biological daughter and legitimately get her\ninheritance. Titus Costner, why did Sheryl marry such a wicked, scheming man like you?”"
      },
      {
        "paragraph": "Sally snorted. “I really have no idea how Catherine has bewitched you guys. What’s so great about\nher? Just because she’s younger than Sheryl? How unfaithful of you.”"
      },
      {
        "paragraph": "The word ‘younger’ resembled a needle that pricked Sheryl’s temples all of a sudden."
      },
      {
        "paragraph": "Even her fragile body began to totter."
      },
      {
        "paragraph": "“Sherry…” Worried, Titus wanted to hold her up."
      },
      {
        "paragraph": "“Don’t come near me,” Sheryl glowered at him as if he was filthy. “Seeing you makes me feel like\npuking.”"
      },
      {
        "paragraph": "Titus was frozen to the spot. Despite having established himself as a masterful figure for years, he was\ndeeply hurt by his wife’s words at this"
      },
      {
        "paragraph": "moment."
      },
      {
        "paragraph": "His azure eyes carried a heavy sense of melancholy."
      },
      {
        "paragraph": "However, Sheryl felt that he was putting on an act now. “Titus Costner, you locked me up and even\ncaused Rebecca’s death. I’ ll settle the scores with you one by one. As for Rebecca’s spending, it was\nup to her to acquire or buy anything. I’m the only person who has the right to ask her back for the\nmoney. Nobody else can do that, and you’re no exception. Before we got married, we signed a"
      },
      {
        "paragraph": "prenuptial agreement, which states that my assets have nothing to do with you. Even if I want to\ndistribute them to my brother, it’s my business.”"
      },
      {
        "paragraph": "Warren was anxious. “Madam, you’re senile…”"
      },
      {
        "paragraph": "“Let’s drop it. You’ll never wake up from your deep sleep,” Titus interrupted him."
      },
      {
        "paragraph": "“Enough. Stop pretending, ” Sheryl snorted. “The personal vendetta between us will never end. I’ll soon\nsend the divorce papers over to you and divorce you as soon as possible.”"
      },
      {
        "paragraph": "“I won’t divorce you.”"
      },
      {
        "paragraph": "As soon as Titus finished speaking, he darted a menacing glance at Sally before he turned around and\nwalked away."
      },
      {
        "paragraph": "Only after Titus left did Sally heave a sigh of relief. God knew how frightened she was whenever she\nfaced Titus, especially after she learned that he had beaten Wesley up unscrupulously in the meeting\nroom."
      },
      {
        "paragraph": "Sheryl rested her startled gaze on the ashes in her hand, which reminded her of the other missing son."
      },
      {
        "paragraph": "She could not figure out why things had ended up this way after her visit to Australia."
      },
      {
        "paragraph": "Recently, she had been suffering from dizzy spells but she held on to keep herself from fainting."
      },
      {
        "paragraph": "She still had a revenge to serve."
      },
      {
        "paragraph": "“By the way, Sister-in-law, I forgot to ask Titus whether he has any news about Matthew.”"
      },
      {
        "paragraph": "Sally shook her head. “Your brother has gotten his friends to ask around in Melbourne but is still\nclueless about where Matthew is. We suspect that it has to do with Catherine because she was the one\nwho persuaded Matthew to head to Melbourne."
      },
      {
        "paragraph": "Only Catherine would know his whereabouts.”"
      },
      {
        "paragraph": "“Isn’t Titus bothered about it?” Sheryl could not believe it, given that Matthew was Titus’s biological son."
      },
      {
        "paragraph": "“He doesn’t even buy it. He thinks of Catherine as a kind woman,” Sally sighed. “Gosh. Why did I give\nbirth to such a woman? I should’ve strangled her the moment she was born. You don’t know how she\nused to deny her connections with Jeffery and me. At the onset of Hill Corporation’s shares to be\ntransferred to us after Rebecca passed, she started approaching us and called us Dad and Mom. It\nreally filled us with disgust.”"
      },
      {
        "paragraph": "“That’s quite disgusting.” Sheryl’s eyes gleamed with rage. She felt the need to kill Catherine."
      }
    ]
  },
  {
    "title": "Chapter 1708 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Sheryl was set on putting Catherine through absolute hell."
      },
      {
        "paragraph": "The Hill family’s manor."
      },
      {
        "paragraph": "Just as Catherine was about to go to bed after bathing the two kids, her phone rang."
      },
      {
        "paragraph": "She walked to the balcony with her phone. “Uncle Titus, you’re calling me at such a late hour. What’s\nthe matter?”"
      },
      {
        "paragraph": "“Sheryl has escaped, ” Titus’s hoarse voice was heard. “The first place she went to was the funeral\nparlor. Sally tried to tear us apart by telling her that I killed Rebecca. She even said I locked Sheryl up\npreviously to drive her mad on purpose, instead of treating her illness, but for the purpose of…”"
      },
      {
        "paragraph": "“You don’t have to explain further. I understand everything.” Catherine’s expression was somber. It was\nmost likely that Sheryl thought she was having an affair with Titus."
      },
      {
        "paragraph": "“Don’t get me wrong. She’s not herself. It’s because of the drug…”"
      },
      {
        "paragraph": "Catherine forced a smile. Titus was even speaking up for Sheryl at this point. “Uncle Titus, I don’t mind\nas I haven’t really spent time with her. It’s up to her to behave however she wants. As for you, you need\nto get over it, given that you’ve been her husband for many years.”"
      },
      {
        "paragraph": "Her words warmed Titus’s heart, and he let out a long sigh. “I never thought our relationship would end\nup here after her visit to Australia. Now, she totally believes everything Jeffery and Sally said. Besides,\nshe’ll probably turn against us at all costs. I’m worried Hill Corporation will…”"
      },
      {
        "paragraph": "Catherine rubbed her temples. “ Is there really no other way?”"
      },
      {
        "paragraph": "“Sheryl must have contacted the people in Soromon Island. If I lock her up to treat her illness at this\npoint, the Soromon Islanders will definitely get even with the Costners. My status and background are\npretty much the same as Sheryl’s. If we have a falling-out, the consequences would be unimaginable, ”\nTitus said, feeling powerless."
      },
      {
        "paragraph": "“ So all we can do is… Leave her alone?” Catherine added, “If she’s not cured, the effects of her\ncondition must be far-reaching…”"
      },
      {
        "paragraph": "“ Sheryl can sense that something isn’t right with her body, but I guess she must’ve assumed it was\ncaused by the shot I gave her in the hospital. When she returns to Soromon Island, I’m sure she’ll hire\na professional medical team to treat her illness. She can be cured for sure, but now isn’t the time.”"
      },
      {
        "paragraph": "Titus paused for a moment before he added dejectedly, “Even if she’s fully recovered and regained her\ncomposure, it’s a fact that I took the initiative to lock her up. Also, for the fact that Rebecca isn’t her\ndaughter has been exposed, she’ll probably still assume that we want to hurt her.”"
      },
      {
        "paragraph": "Catherine was startled. It was her first time hearing Titus speak in such despondence."
      },
      {
        "paragraph": "It seemed that Sheryl had made some hurtful remarks."
      },
      {
        "paragraph": "“Uncle Titus, at the end of the day, we don’t have any evidence. She won’t believe in whatever we say.\nEven if I take a DNA test, she’ll think that we fake the result. Perhaps the only person she’ll somewhat\ntrust is her son. It’d be great if we could save Mathew. But after a long investigation, we still don’ t know\nMatthew’s whereabouts, ” Catherine huffed."
      },
      {
        "paragraph": "When their conversation ended, Catherine went to look for Shaun in the bedroom next door."
      },
      {
        "paragraph": "When she opened the door, she noticed Shaun was shirtless with his key parts wrapped in a towel. The\nwater droplets on his honey-colored chest trickled down his pees until they disappeared in his thin\ntowel…"
      },
      {
        "paragraph": "The sight of him left Catherine’s eyes burning."
      },
      {
        "paragraph": "Although she had seen and touched every part of his, she could not help but tingle with a strange\nfeeling when she looked at this familiar body."
      },
      {
        "paragraph": "“Are you bathing?”"
      },
      {
        "paragraph": "At the sight of her flushed face, Shaun could not resist making fun of her. Since she had seen his body\nbefore, why was she blushing?"
      },
      {
        "paragraph": "Furthermore, she looked so cute when she was blushing. It gave him an overwhelming urge to pull her\ninto his arms and kiss her however he wished."
      }
    ]
  },
  {
    "title": "Chapter 1709 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Nevertheless, he held back at the thought that he was still not powerful enough."
      },
      {
        "paragraph": "“Mm.” Shaun asked with a deep voice, “What’s the matter?”"
      },
      {
        "paragraph": "What did that mean? Could she not casually look for him?"
      },
      {
        "paragraph": "When Catherine observed his expression carefully, she noticed his deep -set eyes were infinitely dark.\nShe could already sense his increasing indifference after two days."
      },
      {
        "paragraph": "This realization ached her heart. All of a sudden, it dawned on her that she preferred the previous\nShaun who was silly compared to the current version of him."
      },
      {
        "paragraph": "However, since she had made it clear, it would be pointless to dwell on it."
      },
      {
        "paragraph": "“Uncle Titus gave me a call and told me Sheryl had escaped.”"
      },
      {
        "paragraph": "Catherine told Shaun their analysis on the issue. “If Sheryl withdraws the charge, things will be\ntroublesome when Rebecca’s shares go to Jeffery or herself.”"
      },
      {
        "paragraph": "“I know.”"
      },
      {
        "paragraph": "Shaun nodded, his handsome, calm face was giving nothing away. “It’s late. You should sleep early\nwith Lucas and Suzie.”"
      },
      {
        "paragraph": "Was he tacitly kicking her out again?"
      },
      {
        "paragraph": "Catherine was inexplicably sulky. “You might not know how serious this issue is. You’ll be brought down\nagain regardless of whether Jeffery or Sheryl obtains the shares…”"
      },
      {
        "paragraph": "“Hill Corporation has nothing to do with you.” At the sight of her worried expression, Shaun could not\nhelp but interrupt her. “You don’t have to worry so much.”"
      },
      {
        "paragraph": "Dumbfounded, Catherine felt as if her chest was punched. She was so furious that she said reluctantly,\n“Do you think I want to worry about it? I couldn’t help but feel that you offended Rebecca and Sheryl all\nbecause of me. I think I’m responsible for it…”"
      },
      {
        "paragraph": "“You’re not responsible for it. With Hill Corporation’s might, even if Rebecca and Wesley hadn’t been\neyeing it, other people would’ve done the same. Hostile takeovers are commonplace in all parts of the\nworld. Since I failed to secure Hill Corporation earlier, it means that I wasn’t capable enough and that\nthe Hills weren’t united.”"
      },
      {
        "paragraph": "Shaun’s brows furrowed. “As a business powerhouse, I should be mighty enough to go through all the\nups and downs. If I lose, it just shows that I’m incapable. Even if I don’t lose Wesley today, I would’ve\nlost to someone else the next day. You don’t have to feel guilty, nor take the responsibility for Hill\nCorporation and the Hill family.”"
      },
      {
        "paragraph": "For a long while, Catherine was silent. His words left her speechless."
      },
      {
        "paragraph": "In fact, what Shaun said made sense. Given his head"
      },
      {
        "paragraph": "injury and lack of experience, how could he possibly deal with the lunatic Sheryl and Wesley?"
      },
      {
        "paragraph": "“But…”"
      },
      {
        "paragraph": "She finally said something."
      },
      {
        "paragraph": "“Cathy, you’re exhausted because you always take responsibility for everything. I asked you to be my"
      },
      {
        "paragraph": "girlfriend back then, but I’m not planning on marrying you. You need to be selfish, ” Shaun said all of a\nsudden."
      },
      {
        "paragraph": "Catherine was stunned. After a while, she chuckled. “I got it. I won’t be a busybody anymore.”"
      },
      {
        "paragraph": "Shaun frowned. He did not mean to blame her for being a busybody. Rather, he did not want her to\nexhaust herself. “Cathy, you should learn to trust me.”"
      },
      {
        "paragraph": "“Mm. I’ll try.”"
      },
      {
        "paragraph": "Catherine nodded perfunctorily."
      },
      {
        "paragraph": "She turned around and walked back to her room."
      },
      {
        "paragraph": "She wished she could trust him too but after all, he had just stepped into the business world. Besides,\nthe professor had still been giving him business lessons these few days."
      },
      {
        "paragraph": "Regardless of his capability, how would he be able to solve the crisis this time?"
      },
      {
        "paragraph": "Fine. She did not want to poke her nose into his business anymore."
      },
      {
        "paragraph": "He was right. After all, Hill Corporation was not her company."
      },
      {
        "paragraph": "What did it have to do with her?"
      }
    ]
  },
  {
    "title": "Chapter 1710 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "As he watched Catherine leave, Shaun furrowed his brows sympathetically."
      },
      {
        "paragraph": "He was aware that his remarks might have sounded nasty, which had slightly hurt her, but he had no\nright to talk about relationships until the issue with Hill Corporation was solved."
      },
      {
        "paragraph": "He made a call when entered his room, “Elle, when are you coming back?”"
      },
      {
        "paragraph": "“Tomorrow morning, Young Master Hill. It’s starting to take shape.”"
      },
      {
        "paragraph": "“Alright.”"
      },
      {
        "paragraph": "The next day. In the evening."
      },
      {
        "paragraph": "After a long day, Sonya returned to her high-end duplex apartment feeling weary."
      },
      {
        "paragraph": "As the apartment was situated downtown, every inch of land was worth a fortune. A lot of people\ngreatly admired the bustle of the city."
      },
      {
        "paragraph": "However, no one knew the pain she was suffering deep down. When she returned to the apartment,\nshe was engulfed in aloneness."
      },
      {
        "paragraph": "When she switched on the lights today, she caught sight of a tall figure seated in the living room. She\nscreamed in fear."
      },
      {
        "paragraph": "“Calm down, Mrs. Lyons.”"
      },
      {
        "paragraph": "The man sounded hoarse and cool as if he was the owner of this place. He exuded a sense of nobility\nand authority."
      },
      {
        "paragraph": "Sonya took a deep breath before she went completely silent."
      },
      {
        "paragraph": "She stared at the man in front, who was wearing a black T-shirt and a pair of long black pants. His\nbroad shoulders and long legs made up his perfect body. With his strikingly handsome face, she would\nnever ever forget it."
      },
      {
        "paragraph": "Shaun Hill!"
      },
      {
        "paragraph": "The person who used to be the most respectable and successful man in Australia."
      },
      {
        "paragraph": "However, she heard he had become a fool. With his current demeanor… Was he a fool?"
      },
      {
        "paragraph": "She somehow felt that he was scarier than before."
      },
      {
        "paragraph": "“You… Why are you in my apartment?” Sonya struggled to speak. “ I know you’re fighting with Wesley.\nAre you thinking of holding me hostage? Dream on. My brother is capable of anything to achieve his\ngoals. Even if you were to kill me, he won’t give in.”"
      },
      {
        "paragraph": "“It seems like you understand your brother very well. That’s good. ” Shaun’s thin lips curled into a\nsmile. Then, he adjusted his posture to make himself comfortable."
      },
      {
        "paragraph": "Sonya was stunned. She shuddered and looked around to check if there was anyone else in her\napartment so that she could flee."
      },
      {
        "paragraph": "“Don’t worry. I’m not planning on holding you hostage since you’re nothing to Wesley. Even if I kidnap\nhis parents, he won’t bat an eyelash. After all, he could go as far as hurting his biological nephew.”"
      },
      {
        "paragraph": "Shaun’s indifferent voice resembled a thorn that pricked Sonya’s chest."
      },
      {
        "paragraph": "Her eyes suddenly reddened."
      },
      {
        "paragraph": "“Don’t you wish to avenge your son?” Shaun looked at her."
      },
      {
        "paragraph": "“Of course, I do. But you don’t think about taking"
      },
      {
        "paragraph": "advantage of me. Earlier, Catherine said Wesley was the one who caused Ethan’s death. Despite a\nlong investigation into the matter, I still can’t find any evidence regarding that,” Sonya said furiously."
      },
      {
        "paragraph": "“What if I have evidence indicating his motive?”"
      },
      {
        "paragraph": "After Shaun tossed his phone to her, Sonya saw a video in it. She tapped to play, and a woman\nappeared… It was Wesley’s secretary, Regina. Later, Catherine even exposed the video of Wesley and\nRegina messing around in the office."
      },
      {
        "paragraph": "When she played the video, Regina was seen speaking in fear, “ I… I’m not sure if Ethan’s death has to\ndo with Wesley. All I know is that Ethan caught Wesley and me messing around in the office the other\nday. At that time, Wesley and Catherine had just gotten married. At the sight of the scene, Ethan had a\nrow with Wesley before he left. But a few hours later, I heard he died in an accident."
      },
      {
        "paragraph": "Unexpectedly, it happened when he was on his way to Catherine’s office…”"
      },
      {
        "paragraph": "Regina’s words sent a chill down Sonya’s spine. “This… This is impossible. ” Sonya shook her head.\nHer eyes were red with venomous hatred. “You coerced her into saying that, didn’t you?”"
      }
    ]
  },
  {
    "title": "Chapter 1711 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“When their love affair was exposed, Wesley’s reputation was tarnished while Regina was sent\noverseas. Indeed, it took me quite an effort to hunt her down.”"
      },
      {
        "paragraph": "Shaun gestured to Sonya with his chin. “Watch the next video.”"
      },
      {
        "paragraph": "Trembling, Sonya scrolled the screen. It turned out to be a video featuring Regina again. “The car\nwhich Ethan drove during the accident was some high- end smart car invented by another country.\nWesley seemed to be acquainted with a top executive of the car company. I even accompanied Wesley\nand the top executive for a meal in the States the year before last. I have… Their photo here. They\nwere having karaoke at a clubhouse at that time.”"
      },
      {
        "paragraph": "Sonya tapped open the album. There was a photo of Wesley and a middle-aged male foreigner."
      },
      {
        "paragraph": "However, the lighting was poor as they were in a private room."
      },
      {
        "paragraph": "Sonya could recognize the foreigner at first sight. The police initially claimed Ethan’s accident was due\nto the autopilot malfunctioning in his car."
      },
      {
        "paragraph": "Later, the car company compensated her a considerable amount of money but money was what she\nneeded the least."
      },
      {
        "paragraph": "Since then, she had been following the car company closely. It was through a car website that she\ncame across the foreigner, who was said to be the global CEO of the car company."
      },
      {
        "paragraph": "Little did she expect that Wesley would know him before the incident."
      },
      {
        "paragraph": "Wesley, however, had never mentioned it to her. The thought of it sent chills down her spine."
      },
      {
        "paragraph": "Her own brother was too vicious."
      },
      {
        "paragraph": "“I believe I don’t have to explain further. You should’ve gotten the picture.”"
      },
      {
        "paragraph": "Shaun lifted his leg and said coldly, “After discovering Wesley and Regina’s affair, Ethan wanted to\ninform Catherine that Wesley’s feelings for her were fake, but Wesley didn’t want Catherine to find out\nbecause she was useful to him. Hence, he orchestrated this accident.”"
      },
      {
        "paragraph": "“Everyone assumed it was the car’s issue. Even the car company had admitted and compensated for\nit. But little did everyone know that Wesley had been"
      },
      {
        "paragraph": "acquainted with the CEO of the car company before this. They’re probably involved in some secret\ndealing for personal gains. Your son… Died in vain.”"
      },
      {
        "paragraph": "“ I want revenge. I want to avenge Ethan.” Sonya started weeping ferociously. “Send me these videos. I\nwant to sue Wesley.”"
      },
      {
        "paragraph": "“These videos aren’t enough to prove Wesley’s doing. If Regina appears in court, she might claim that I\nkidnapped, coerced, and lured her. As for the CEO, he’s not even an Australian. He’s quite powerful\noverseas, and he won’t even come to Australia. The photo won’t be of any help without any\ninterrogation. In the end, the case might remain unsolved.”"
      },
      {
        "paragraph": "Shaun raised his brows impassively. “Wesley did a wonderful job in killing Ethan. We hardly have any\nhold over him.”"
      },
      {
        "paragraph": "“So what should I do?” At this moment, Sonya began to cool down. It occurred to her that there was no\npoint in getting mad over her son’s death. “ Actually, what’s the purpose of me staying alive? I just want"
      },
      {
        "paragraph": "justice for my son. I just want the person who killed him to be punished. I’m ready to do anything for\nthat.”"
      },
      {
        "paragraph": "Shaun nodded. This was the moment he had been waiting for. “Wesley has kidnapped someone in"
      },
      {
        "paragraph": "Melbourne, and I want to know what happened to him.”"
      },
      {
        "paragraph": "He drew the photo from his pocket and handed it to Sonya."
      },
      {
        "paragraph": "“He’s Titus’s son. You might not know who Titus is, so let me put it this way, the Costner family is the\nwealthiest and most mysterious family in the"
      },
      {
        "paragraph": "world. It’s easy for him to kill Wesley, but Wesley has kidnapped his son and is threatening him.”"
      },
      {
        "paragraph": "Sonya was dumbfounded. She realized that she had a different understanding of Wesley time and\nagain."
      },
      {
        "paragraph": "Was Wesley her biological brother? He was utterly terrifying and crazy."
      },
      {
        "paragraph": "“He’s crazy. He’s planning to destroy the Lyons family, huh?”"
      },
      {
        "paragraph": "“You’re wrong. Wesley’s taking his life into his hands. If he succeeds, his global rank will improve so\nsignificantly that even the Australian prime minister has to obey him. But if he fails, the Lyons family will\nend up suffering horrible consequences. Of course, if you’re willing to help me, Titus will let you and\nyour parents off.”"
      },
      {
        "paragraph": "Shaun raised his brows and looked at her with a discreet smile. “Think about your son’s death."
      },
      {
        "paragraph": "When he was pulled from the crash, his appearance was beyond recognition…” ”Just drop it. I’ll help\nyou. ”"
      }
    ]
  },
  {
    "title": "Chapter 1712 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Sonya held the photo tightly, her eyes filled with intense hatred. “As the general manager of Golden\nCorporation in Melbourne, I’ve always been in charge of the company’s matters. Even so, I do know\nwhat’s happening to the branch here."
      },
      {
        "paragraph": "Whenever Wesley comes to Melbourne, he always gives orders to certain people. As long as I pay\nattention to those people, I believe I’ll be able to bring something to light soon.”"
      },
      {
        "paragraph": "“Hurry up. This man has been locked up, but Wesley won’t kill him yet. He’ll probably have his\nconfidant visit the man once in a while.” Shaun said complicatedly, “Wesley is making a big move in\nCanberra lately. If he succeeds, don’t even think about taking revenge on your son’s behalf anymore.”"
      },
      {
        "paragraph": "Sonya nodded violently and clenched her fists. “I will.”"
      },
      {
        "paragraph": "“Also, make sure your face doesn’t betray your hatred. Don’t let others find out about it.” After Shaun\nreminded her, he rose to his feet and left."
      },
      {
        "paragraph": "Once Shaun headed downstairs and got into the car, Elle asked, “Young Master Hill, will she make it?\nWe’re pinning all our hopes on her now.”"
      },
      {
        "paragraph": "“Don’t belittle a mother’s hatred.”"
      },
      {
        "paragraph": "Shaun threw a stony glance at Elle. “Even if she fails, as long as she’s able to see Wesley at the last\nminute, she’ll probably choose to die with him.”"
      },
      {
        "paragraph": "Elle gaped, feeling dumbfounded."
      },
      {
        "paragraph": "“That’s why… We shouldn’t go beyond other people’s limits at times.” Shaun leaned on the leather seat\nand shut his eyes to rest them."
      },
      {
        "paragraph": "Elle stared at the bridge of his nose."
      },
      {
        "paragraph": "Although he was still their Young Master Hill, she felt he was much more manipulative than he used to\nbe."
      },
      {
        "paragraph": "However, no one would have thought that Shaun was a fool with a mental age of two a week ago."
      },
      {
        "paragraph": "Sure enough, some people’s growth proved to be terrifying."
      },
      {
        "paragraph": "Only at 10:00 p.m. did Shaun return to the Hill family’s manor."
      },
      {
        "paragraph": "When he walked past Catherine’s bedroom, he stopped in his steps. The room was so quiet that no\none seemed inside."
      },
      {
        "paragraph": "“Catherine has taken the two kids back to the Yule family’s house tonight, ” Brennan said as he walked\nup to Shaun."
      },
      {
        "paragraph": "“Mm.” Shaun frowned and opened the door to his bedroom."
      },
      {
        "paragraph": "“What’s wrong with you? Are you really planning to break up with Catherine?” Brennan’s brows\nfurrowed."
      },
      {
        "paragraph": "“No. I just want to settle everything in hand before officially wooing her. I’ll woo her just like how a man\nmeets the woman he loves.” Shaun entered his room and closed the door after that."
      },
      {
        "paragraph": "Brennan was momentarily stunned, but he felt glad."
      },
      {
        "paragraph": "He had been worried that Shaun did not know what love was. Nevertheless, he was relieved to hear\nShaun’s words."
      },
      {
        "paragraph": "8:00 a.m. the next day."
      },
      {
        "paragraph": "Shaun arrived at Hill Corporation."
      },
      {
        "paragraph": "Soon after, Hadley ran in and said, “Eldest Young Master, Sheryl, Jeffery, and Sally are here. Wade\npersonally took them upstairs, and they’re now in the meeting room. They said they’re waiting for you\nto have a meeting.”"
      },
      {
        "paragraph": "“Let’s go then.” Shaun got up."
      },
      {
        "paragraph": "Hadley looked at him with mixed feelings. “Sheryl came with quite many bodyguards whom she\nprobably sent here from overseas.”"
      }
    ]
  },
  {
    "title": "Chapter 1713 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“That was quick.” Shaun’s lips curved into a restrained smile."
      },
      {
        "paragraph": "Hadley felt unsettled. “Given that Titus beat Wesley up in the meeting room the other day, I’m afraid\nJeffery will drive a wedge between you and the others. What if he also gets someone in the meeting\nroom to…”"
      },
      {
        "paragraph": "“But I can’t absent myself just because of fear. Otherwise, what will everyone in the company think of\nme?”"
      },
      {
        "paragraph": "Shaun got up, his tall and imposing physique exuding an authoritative presence."
      },
      {
        "paragraph": "Hadley followed him silently. Deep down, he became calm somehow."
      },
      {
        "paragraph": "Whenever Shaun behaved like this back then, Hadley knew that Shaun was confident with his plan."
      },
      {
        "paragraph": "Five minutes later, Shaun pushed open the door of the meeting room."
      },
      {
        "paragraph": "It was his first time meeting Sheryl, who was Catherine’s biological mother."
      },
      {
        "paragraph": "He had only heard about their personal vendetta from Hadley."
      },
      {
        "paragraph": "According to Hadley, this woman had been tricked by Rebecca and refused to acknowledge her\nbiological daughter."
      },
      {
        "paragraph": "Dressed in a white outfit, Sheryl was sitting in the main seat today. Her features were rather similar to\nCatherine’s. However, her face was much thinner, and her eyes were so grim that she looked like she\nwas surrounded by darkness."
      },
      {
        "paragraph": "Especially when Shaun entered the meeting room, Sheryl made no pretense of hiding the graveness\nand hatred in her eyes."
      },
      {
        "paragraph": "Shaun furrowed his brows. Although Sheryl was Catherine’s mother, he felt that Catherine was\nwonderful and pure, whereas Sheryl was the opposite extreme."
      },
      {
        "paragraph": "Wade and Jeffery sat on Sheryl’s left and right sides respectively. Even Sally was here."
      },
      {
        "paragraph": "“Chairman Hill, you’re finally here. We’ve waited for you for long. ” Wade sprang to his feet and said\nwith a grin, “Well, let me introduce them to you."
      },
      {
        "paragraph": "This is Chairwoman Jones. She has been working on the petroleum business overseas, so her net\nworth is extraordinary. Mr. Jones is Chairwoman Jones’s brother, while Mrs. Lennon is her sister-in-law."
      },
      {
        "paragraph": "The purpose of this meeting is to distribute Rebecca’s shares after her passing.”"
      },
      {
        "paragraph": "Shaun casually dragged a chair to sit on before he asked indifferently, “As far as I know, isn’t there’s\nconflict over the shares?”"
      },
      {
        "paragraph": "Wade replied with a smile, “Titus previously wanted to sue us and recover his wife’s assets. But\naccording to Chairwoman Jones, she has signed a prenuptial agreement with him. This means that\nPresident Costner has no right to ask for the money Chairwoman Jones offered to Rebecca. So,\nChairwoman Jones went to court in person and dismissed the case. Although Rebecca acquired Hill\nCorporation using Chairwoman Jones’s money, Jeffery is Rebecca’s father. After some discussion on\nthe distribution of the 70 percent of the shares Rebecca owns, 50 percent will be given to Jeffery and\n20 percent to Sheryl.”"
      },
      {
        "paragraph": "Shaun raised his brows in surprise. He glanced at Sheryl and noticed that she looked rather composed,\nseemingly satisfied with the decision."
      },
      {
        "paragraph": "However, Jeffery said bashfully, “Sherry, since you were the one who paid for the acquisition of the\ncompany, you should receive more shares. Yet, you’re giving me 5o percent of the shares. I… Sigh…\nWhy don’t you take back some of it?”"
      },
      {
        "paragraph": "“No need, Jeffery. After all, Australia isn’t my focus, so I won’t manage Hill Corporation much. What’s\nmore, it hasn’t been easy for you to look after Rebecca and Mom over the years. This is a token of my\nappreciation.”"
      },
      {
        "paragraph": "As Sheryl was speaking, she cast a look at Wade. “ From now on, you need to assist Jeffery, the\nchairman, to the best of your abilities.”"
      },
      {
        "paragraph": "Wade widened his eyes. “Do you mean Jeffery will be the chairman?”"
      },
      {
        "paragraph": "“Duh. ” Sheryl shot an indifferent look at Shaun. “ Considering that Jeffery and my shares add up to 70\npercent, we have the right to appoint a new chairperson. Am I right, Chairman Hill?”"
      },
      {
        "paragraph": "“Yes.” Shaun nodded with a smile."
      },
      {
        "paragraph": "Shaun seemed so obedient, without the slightest arrogance he had before. At that, Jeffery was very\nconceited, but he could not express it. Hence, he pretended to look guilty. “Sheryl, but I—”"
      },
      {
        "paragraph": "“Don’t worry, Jeffery. I know quite a lot of people overseas. I’ll get some powerhouses to support Hill\nCorporation, ” Sheryl interrupted him."
      },
      {
        "paragraph": "Jeffery looked touched, but deep down, he was already walking on air."
      }
    ]
  },
  {
    "title": "Chapter 1714 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Wade said emotionally, “Well, let me congratulate you in advance, Chairman Jones. But there’s\nsomething…”"
      },
      {
        "paragraph": "He held back and glanced at Shaun. “A few days ago, Chairman Hill said that I’m not eligible to be the\ngeneral manager of the company due to the conflict over the shares. Catherine also said that I have\npoor management skills. Now that Young"
      },
      {
        "paragraph": "Master Hill is the new president of the company, I At the mention of Catherine, Sheryl’s eyes were filled\nwith resentment. She looked at Shaun resentfully as well. “What gives Catherine the right to be\ninvolved in our company’s affairs? Shaun, to put it bluntly, you’re incapable of managing Hill\nCorporation. If you were, you wouldn’t have failed to keep it. After the meeting, you can pack your\nthings and go home. The company no longer needs the Hills’ involvement.”"
      },
      {
        "paragraph": "“Sheryl… I don’t think this is good,” Jeffery promptly said."
      },
      {
        "paragraph": "“Jeffery, you’re too soft—hearted. Some people are ambitious even though Hill Corporation no longer\nbelongs to them. By the way, I think it’s time to change Hill Corporation’s name. From now on, Hill\nCorporation will be renamed… Jere Corporation.”"
      },
      {
        "paragraph": "Jere Corporation."
      },
      {
        "paragraph": "It was made up of the first two letters of Jeffery’s and Rebecca’s names. ‘"
      },
      {
        "paragraph": "Jeffery’s and Sally’s eyes lit up."
      },
      {
        "paragraph": "Shaun fixed his eyes on Sheryl, his lips slowly curling into a sarcastic smile."
      },
      {
        "paragraph": "“What gives? Are you dissatisfied?” Sheryl looked at him coldly."
      },
      {
        "paragraph": "Shaun chuckled. “I just don’t understand how some people can do big businesses overseas with their\nbrains full of crap?”"
      },
      {
        "paragraph": "Sheryl’s face turned somber, and the bodyguards behind her roared, “How dare you insult our island\nowner.”"
      },
      {
        "paragraph": "“Teach him a lesson.” Sheryl shot a look at the bodyguards behind her."
      },
      {
        "paragraph": "The eight bodyguards immediately walked up to Shaun."
      },
      {
        "paragraph": "Jeffery and the others just sat back and watched the scene."
      },
      {
        "paragraph": "Hadley panicked. “Young Master…”"
      },
      {
        "paragraph": "“You guys want to fight, huh? There are so many people here. Please don’t blame me if I accidentally\nhurt anyone.” Grinning, Shaun rolled up his sleeves."
      },
      {
        "paragraph": "Sheryl snorted. “Break his leg.”"
      },
      {
        "paragraph": "At first, she just watched on coldly. She wanted to teach Catherine a lesson, yet Catherine still had not\nshown up. She heard that Catherine had also deceived Shaun. Since Shaun was Catherine’s ex-\nhusband, Sheryl would make a move against him first."
      },
      {
        "paragraph": "Nevertheless, Sheryl’s expression shifted after three minutes."
      },
      {
        "paragraph": "Shaun was such a sly person. Knowing that he could not deal with the eight bodyguards, he had taken\nJeffery and Sally as his shields, which made the bodyguards hesitate before attacking him."
      },
      {
        "paragraph": "“Three of you, protect my brother and sister-in- law.” Sheryl changed her plan."
      },
      {
        "paragraph": "Without the three bodyguards, however, the five bodyguards were no match for Shaun. Soon, he broke\nall of their legs."
      },
      {
        "paragraph": "“Oh no. I’m sorry. You guys were too brutal, so I had no choice but to counterattack.” Shaun smiled a s\nhe stepped on a bodyguard’s face."
      },
      {
        "paragraph": "Seeing his arrogant behavior, Sheryl was so exasperated that she slapped the table and leaped to her\nfeet. She picked up a cup and hurled it at Shaun before instructing the three remaining bodyguards,\n“You guys have to beat him to death. ”"
      },
      {
        "paragraph": "The three bodyguards were in agony. The five bodyguards could not even defeat Shaun, let alone the\nthree of them."
      },
      {
        "paragraph": "Considering that Sheryl had lost her temper, the three of them bit the bullet and made a move against\nShaun. In the end, they were beaten up horrifically."
      }
    ]
  },
  {
    "title": "Chapter 1715 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Chairwoman Jones, these people are too sh*tty, ” Shaun tutted as he shook his head. Then, he turned\naround and swaggered out with his hands in his pockets."
      },
      {
        "paragraph": "When he walked out the door, he heard Sheryl snapping at them inside. “You useless trash. I’ve spent\nso much money nurturing you guys, but it’s all a waste of my money. All of you, go to hell.”"
      },
      {
        "paragraph": "Shaun furrowed his brows."
      },
      {
        "paragraph": "Hadley said, “Sheryl’s illness is getting more serious, yet she’s not having it treated.”"
      },
      {
        "paragraph": "“Yeah. She’s so foolish to help someone else too. Hah, Jere Corporation. When she becomes sensible,\nI reckon she’ll cry over the silly things she has done.”"
      },
      {
        "paragraph": "Soon after Shaun walked into his office, Wade came in with a group of security guards to kick him out. “\nYoung Master Hill, I know we’re no match for you, but you’ve been dismissed. If you insist on staying\nhere, no one is going to care about you either. It’s better for you to leave now. There’s no point in\nstaying here shamelessly.”"
      },
      {
        "paragraph": "“Don’t worry. I’ll leave.” With a grim expression, Shaun had Hadley pack his things before they left\ntogether."
      },
      {
        "paragraph": "Only after Wade watched Shaun step out the door did he call Wesley. “President Lyons, Shaun has\nbugged off.”"
      },
      {
        "paragraph": "“Excellent.” Wesley could not hide the smugness in his voice."
      },
      {
        "paragraph": "The day he had been waiting for had finally arrived. Once Jeffery became the chairman, Wesley would\nbe able to take control of Hill Corporation since he had a hold over Jeffery."
      },
      {
        "paragraph": "In the car."
      },
      {
        "paragraph": "Shaun looked at the time and saw that it was only 11:00 a.m."
      },
      {
        "paragraph": "He did not expect himself to be chased out so soon after he arrived."
      },
      {
        "paragraph": "He looked out and saw a mall. “Head over there. I want to buy some toys for Lucas and Suzie.”"
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "He had no idea which floor the toy department was located on. When he took the elevator up, he\nspotted a female clothing store at the side. The clothes were beautiful, especially the dress in the\ndisplay case. He was certain that Catherine would look pretty in it."
      },
      {
        "paragraph": "He strode toward the salesperson. Just as he was about to speak, a young woman’s voice suddenly\nsounded from behind."
      },
      {
        "paragraph": "“Miss, I’d like to buy this dress…”"
      },
      {
        "paragraph": "He turned around, only to see a luxuriously dressed woman who looked like a young lady from a\nwealthy family. She had striking features and appeared to be in her early 20s."
      },
      {
        "paragraph": "The moment the woman saw him, her eyes lit up. She suddenly smiled. “Young Master Hill, how have\nyou been?”"
      },
      {
        "paragraph": "After pausing for a moment, she covered her lips. “ Oops, that’s not right. Since Hill Corporation will\nsoon be renamed, I’m afraid you’ll no longer be addressed as Young Master Hill.”"
      },
      {
        "paragraph": "Shaun’s gaze was cold. “Who are you?”"
      },
      {
        "paragraph": "The young woman froze before she reacted. “Oh, I forgot that you’ve become a fool some time ago,\nand you’ve forgotten many things. That’s alright. Let me introduce myself again. I’m Hannah Mead, and\nMinister Mead is my dad.”"
      },
      {
        "paragraph": "After that, the corners of her mouth turned smug. “ Well, look at you. When I pursued you previously,\nyou weren’t interested in me. Now that the Hill family is in trouble, what can Catherine do for you?”"
      },
      {
        "paragraph": "Shaun blinked, and his eyes flashed with faked surprise. He even curved his mouth into a carefree\nsmile. “I didn’t expect you’d be Miss Mead. My bad.”"
      },
      {
        "paragraph": "At the sight of his captivating smile, Hannah was dazed for a few seconds. By the time she recovered\nfrom her musings, she felt smug."
      },
      {
        "paragraph": "Back then, Shaun was not interested in her. However, now that her identity was different, his attitude\ntowards her was different as well."
      },
      {
        "paragraph": "She knew that Shaun was a shadow of his former self. Moreover, he had lost his memory, so it was\nusual for him to think of buttering her up."
      },
      {
        "paragraph": "If it had been someone else, she might not be interested, but Shaun was different. Despite his crew\ncut, his features appeared more prominent and attractive."
      },
      {
        "paragraph": "Although he did not deserve her, she surely did not mind having him."
      },
      {
        "paragraph": "Women and men were inherently similar. Whatever they had failed to obtain would stir up interest in\nthem."
      }
    ]
  },
  {
    "title": "Chapter 1716 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Hah. Sure enough, you’ve changed. You were so offhand with me back then,” Hannah said on\npurpose."
      },
      {
        "paragraph": "“Back then, I was… not smart indeed.” Shaun shot a neutral look at the dress in the display case. “If\nyou like it, I can give it to you as a gift.”"
      },
      {
        "paragraph": "“Aren’t you afraid that Catherine will find out?” Hannah’s red lips curled."
      },
      {
        "paragraph": "“Our relationship ended long ago. ” Shaun looked impassive."
      },
      {
        "paragraph": "“…Forget it. I don’t want the dress.” Hannah suddenly raised her brows and said pensively, “I was\ninterested in the dress, but it hit me that it wouldn’t suit me.”"
      },
      {
        "paragraph": "“Alright, then. I won’t bother you further, Miss Mead.” Shaun immediately turned around."
      },
      {
        "paragraph": "At the sight of his tall and noble figure, Hannah gritted her teeth with discontent. “Shaun, why bother?\nYou were only in the company for three days, and you had been chased out. It did not take long for the\nnews to spread throughout Canberra and make you the object of ridicule.”"
      },
      {
        "paragraph": "“So…” Shaun turned sideways, but his handsome face remained indifferent."
      },
      {
        "paragraph": "“As long as you please me, no one will dare look down on you anymore. My dad is a minister, and he’s\nhighly regarded by the prime minister. He is said to be high above the masses, ” Hannah said smugly."
      },
      {
        "paragraph": "“That’s interesting.” Shaun nodded and walked up to her. His mouth curved into a charming smile."
      },
      {
        "paragraph": "Hannah’s heart raced at the sight of him. He approached her until she stopped at the display case.\nThen, he pressed one hand against the case and gazed down at her with his dazzlingly handsome"
      },
      {
        "paragraph": "face."
      },
      {
        "paragraph": "“Tell me how I should please you.” Shaun pinched her chin gently."
      },
      {
        "paragraph": "As Hannah fixed her eyes on his dark eyes, her heart was thumping madly."
      },
      {
        "paragraph": "Who said he had become a fool? Could a fool be this charming?"
      },
      {
        "paragraph": "It dawned on Hannah that this imposing man in front of her was head and shoulders above her\npursuers."
      },
      {
        "paragraph": "“Well… Have a meal with me then…” “…Sure.”"
      },
      {
        "paragraph": "Shaun’s thin lips quivered, and a dull gleam flashed across his eyes without her noticing it."
      },
      {
        "paragraph": "At the Hill family’s manor."
      },
      {
        "paragraph": "When Catherine drove into the manor, Aunty Yasmine walked out. “Miss Jones, you’re back from the\nYule family’s house.”"
      },
      {
        "paragraph": "“Mm.”"
      },
      {
        "paragraph": "Catherine glanced around the car park. When she was in the Yule family’s house, Freya told her on the\nphone that Shaun was chased out of Hill Corporation this morning and that Hill Corporation had been\nrenamed Jere Corporation."
      },
      {
        "paragraph": "Shortly after, the news had spread like wildfire across Canberra."
      },
      {
        "paragraph": "She was hesitant for some time. However, she was worried that Shaun could not get over it, so she\ndecided to come over."
      },
      {
        "paragraph": "“Young Master Hill has gone to the office. ” Aware of her intention, Aunty Yasmine said, “He’s been"
      },
      {
        "paragraph": "busy recently. He only came back at 10 p.m. last night.”"
      },
      {
        "paragraph": "Catherine frowned. Shaun asked her not to be bothered with matters related to Hill Corporation, but\nshe did not have the faintest idea of what he had been busy with."
      },
      {
        "paragraph": "Nevertheless, Shaun may no longer need to go to work from today onward."
      },
      {
        "paragraph": "“Aunty Yasmine, please prepare more of his favorite dishes later.” After a moment’s hesitation,\nCatherine said with a deep voice."
      },
      {
        "paragraph": "“Look, Miss Jones. You’re still concerned about Young Master Hill. I really don’t understand what’s\ngoing on between both of you young people. The two of you were so close with each other a few days\nago, yet now… Alas, forget it. I’m going to start cooking.”"
      },
      {
        "paragraph": "Aunty Yasmine wanted to poke fun at Catherine at first. Upon noticing Catherine’s embarrassed\nexpression, Aunty Yasmine bit her tongue and went to cook instead."
      }
    ]
  },
  {
    "title": "Chapter 1717 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Aunty Yasmine had prepared many dishes by noon, yet Shaun did not return."
      },
      {
        "paragraph": "“ Is Young Master… not planning to come back for lunch?” Aunty Yasmine stole a glance at Catherine."
      },
      {
        "paragraph": "Catherine turned her eyes to Lea. “Aunty Lea, since something so serious happened in the company\ntoday, would Shaun take it too hard…”"
      },
      {
        "paragraph": "“Let me call him.” Worried, Lea took out her phone to call Shaun."
      },
      {
        "paragraph": "Shortly after, Shaun’s deep voice sounded. “Mom, what’s the matter?”"
      },
      {
        "paragraph": "“Shaun, I’ve heard what happened in the company. Where have you been after you left the office this\nmorning? Aren’t you coming home for lunch?” Lea said softly, “Don’t stress yourself out. Your grandpa,\ngranny, I have gotten over it. We can sit pretty even without Hill Corporation.”"
      },
      {
        "paragraph": "“Mom, you’re overthinking it. Since I’ve lost my memory, I don’t feel very strongly about Hill\nCorporation. I’ve failed despite having done my best, but there’s nothing else I can do. Don’t think too\nmuch. I’m just having lunch outside with a friend.”"
      },
      {
        "paragraph": "Shaun’s relaxed voice made Lea heave a sigh of relief. As she was about to speak, a woman’s tender\nvoice suddenly sounded from the other end of the phone. “Young Master Hill, try this dish. It’s\ndelicious.”"
      },
      {
        "paragraph": "Lea’s expression froze."
      },
      {
        "paragraph": "“Mom, I’m still having lunch. I’m going to hang up now.”"
      },
      {
        "paragraph": "After the call ended, Lea looked at Catherine opposite her and instantly felt awkward."
      },
      {
        "paragraph": "She never thought that Shaun would have lunch with another woman at noon."
      },
      {
        "paragraph": "Did he not know that Catherine would be concerned about him?"
      },
      {
        "paragraph": "Even so… What if he knew it? Having forgotten most of his past, Shaun was just like a growing kid."
      },
      {
        "paragraph": "Perhaps he no longer had any feelings for Catherine. He may have been reliant on her before this\nbecause she was good-looking. Similar to a newborn, it was normal for him to rely on the person he\nfirst saw. As he gradually grew up, he"
      },
      {
        "paragraph": "would learn more things and stop clinging to Catherine like how he did earlier."
      },
      {
        "paragraph": "Nevertheless, as a woman and mother herself, she felt that Shaun was too cruel to Catherine."
      },
      {
        "paragraph": "“Aunty Lea, what did he say?” Catherine’s pure eyes were fixed on her."
      },
      {
        "paragraph": "Deep down, Lea was gripped by guilt. “He said he’s having lunch outside with a friend. Don’t worry,\nhe’s fine. He said he doesn’t feel very strongly about Hill Corporation. Furthermore, he has tried his\nbest, so he’s not too upset.”"
      },
      {
        "paragraph": "After that, she let out a sigh."
      },
      {
        "paragraph": "Catherine thought that Lea felt sorry about what happened to Hill Corporation, so she said softly, “\nAunty Lea, there’s a great saying that goes, ‘while there’s life, there’s hope.’ Shaun is a talented\nbusinessman. He can rebuild another company like Hill Corporation in the future.”"
      },
      {
        "paragraph": "“Mm. Let’s eat.”"
      },
      {
        "paragraph": "Lea nodded absent-mindedly."
      },
      {
        "paragraph": "She had no idea who the woman was."
      },
      {
        "paragraph": "She felt the need to chide Shaun when he returned."
      },
      {
        "paragraph": "Catherine, who somehow found Lea odd, finished her meal inattentively. When it was time for dinner,\nShaun had still yet to return. At 10:00 p.m., the kids had fallen asleep, and that was when she heard\nthe sound of the car engine from outside."
      },
      {
        "paragraph": "Standing at the balcony, she saw the well-dressed Shaun getting out of the sports car."
      },
      {
        "paragraph": "As if he had noticed her presence, he lifted his head and darted a glance at her. Then, he nodded\nindifferently before entering the house and then his room."
      },
      {
        "paragraph": "Catherine pursed her lips. Apparently, she had worried about him for nothing."
      },
      {
        "paragraph": "During breakfast the next day, Shaun came downstairs in a gray shirt and a pair of black pants. With\nthe attire matching his cool presence, he gave off a sense of masculine and mature attractiveness."
      }
    ]
  },
  {
    "title": "Chapter 1718 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Daddy, come and have breakfast, ” Suzie muttered as she was chewing a ravioli."
      },
      {
        "paragraph": "Lea quickly arranged for Shaun to do something. “"
      },
      {
        "paragraph": "Since you’ve had nothing to do recently, please send Suzie and Lucas to preschool after breakfast. You\nhave to be responsible for your own kids.”"
      },
      {
        "paragraph": "Catherine did not say a word. All she did was keep her head down, eating porridge."
      },
      {
        "paragraph": "After glancing sideways at her, Shaun smiled. “ Alright. I’ll send them to preschool. But I have\nsomething to do later, so you don’t have to cook for me, Aunty Yasmine.”"
      },
      {
        "paragraph": "Old Madam Hill asked, “What are you busy with? Isn’t Hill Corporation—”"
      },
      {
        "paragraph": "Old Master Hill interrupted gravely, “Shaun, haven’t you given up yet?”"
      },
      {
        "paragraph": "“Grandpa, Granny, please leave me alone. It’s my business. Considering that I’m already an adult, I\nhave to think of ways to make money. I can’t possibly be living off the Hills forever.” Shaun"
      },
      {
        "paragraph": "planted himself in the seat next to Lucas before picking up a spoon and starting having breakfast."
      },
      {
        "paragraph": "Everyone exchanged glances, not knowing what to say. After all, his thoughts were not illogical."
      },
      {
        "paragraph": "After breakfast, Catherine handed Shaun the kids’ school bags and reminded him, “Remember to\nremind the teacher to get Suzie to pee before she naps, lest she wet the bed.”"
      },
      {
        "paragraph": "“Mm.”"
      },
      {
        "paragraph": "Shaun lowered his head to look at Catherine, who was a lot shorter than him. As she did not put on any\nmakeup on her face in the morning, her skin was as clear as a shelled boiled egg. Even her eyelashes\nwere bushy without any makeup. He could not help but recall the perfume that Hannah wore yesterday,\nwhich was so strong that his nose could barely endure it. Besides, Hannah’s skin was not as good as\nCatherine’s."
      },
      {
        "paragraph": "He breathed lightly. Afraid of resting his eyes on her any longer, he took over the bags and left straight\naway."
      },
      {
        "paragraph": "After Catherine returned to her bedroom, she suddenly realized that she was quite bored."
      },
      {
        "paragraph": "During the journey to preschool. The two kids sat in the rear seat."
      },
      {
        "paragraph": "Shaun shot a look at the two of them at the back. Ever since he found out that they were his kids, he\nhad not spent much time with them. Before this, he even foolishly addressed them as brother and\nsister."
      },
      {
        "paragraph": "Now that Shaun remembered it, he was at his wits’ end."
      },
      {
        "paragraph": "“Have you forgotten what happened between you and Mommy? Are you planning to break up with\nMommy?” Lucas asked out of the blue."
      },
      {
        "paragraph": "Shaun was stunned. He spotted Lucas’s cool, serious, adult-like face through the rear-view mirror.\n“This is the adults’ matter.”"
      },
      {
        "paragraph": "“But we’re your children. We have the right to know.” Lucas threw a glance at Suzie. “Am I right?”"
      },
      {
        "paragraph": "“Yeah.” Suzie was biting a doughnut, and her mouth was stained with sugar. “If you don’t want to be\nwith Mommy, make it clear to her. Don’t waste her time.”"
      },
      {
        "paragraph": "“Also, don’t you ever ask Mommy to be with you again. ” Lucas snorted. “You always break up and get\ntogether with Mommy. It’s annoying.”"
      },
      {
        "paragraph": "Shaun looked composed. “Don’t you hope that Daddy and Mommy get back together?”"
      },
      {
        "paragraph": "“Since you’ve forgotten Mommy, it means that you don’t like her anymore. You don’t have to take\nresponsibility for her, and I’ll advise Mommy to move out of the Hill family’s  manor.  She  can’t afford to\nwaste any more time on you,” Lucas said somberly."
      },
      {
        "paragraph": "Shaun’s temples pulsed, and he pressed them hard. “If she moves out of the manor, you guys won’t be\nable to see her every day. But if you guys leave with her, can you bear to part with Grandpa and\nGranny?”"
      },
      {
        "paragraph": "“This is just a small issue. We can stay at each place for a few days, which is quite a good idea.\nAnyway, Grandpa’s house isn’t very far from Sherman Mountain.” Suzie ate the last doughnut\nnonchalantly."
      },
      {
        "paragraph": "Shaun coughed."
      },
      {
        "paragraph": "These two kids had an exceptionally positive mindset."
      }
    ]
  },
  {
    "title": "Chapter 1719 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "When Shaun came out of the preschool after sending the kids there, he received a call from Hannah."
      },
      {
        "paragraph": "At the sight of the incoming call on his phone, his gaze was indifferent. Nevertheless, he still pressed\nthe answer button calmly in the end."
      },
      {
        "paragraph": "In the evening."
      },
      {
        "paragraph": "After dinner, Catherine felt idle all of a sudden."
      },
      {
        "paragraph": "When she had to look after the kids, manage Hudson Corporation, and spend time dating back then, it\nalways felt like she was running out of time. Now that the kids had gone to preschool and she did not\nneed to go to work nor on a date, she appeared to have plenty of spare time."
      },
      {
        "paragraph": "Just as she was hesitating whether to ask Freya out for shopping, Freya gave her a call. “Cathy, where\nare you?”"
      },
      {
        "paragraph": "“In the manor.”"
      },
      {
        "paragraph": "“Where’s Shaun?” Freya hurriedly asked."
      },
      {
        "paragraph": "“He has gone out this morning. He probably has something to deal with. ” Catherine casually picked up\na pear from the table and took a bite of it."
      },
      {
        "paragraph": "“Bullsh*t.” Freya raged. “Do you know why he went out?”"
      },
      {
        "paragraph": "Speechless, Catherine frowned without saying a word."
      },
      {
        "paragraph": "“He’s playing golf with Hannah, that b*tch. When I attended a banquet earlier, I met a few young ladies\nand even joined their group chat. I saw them chatting away in the group today. Someone even took a"
      },
      {
        "paragraph": "photo of Hannah and Shaun at the golf course. I’m going to send it to you.”"
      },
      {
        "paragraph": "As Freya was speaking, she sent Catherine the photo."
      },
      {
        "paragraph": "Upon hearing a ‘ding’ from her phone, Catherine clicked open the photo to take a look."
      },
      {
        "paragraph": "Dressed in a white sports skirt, Hannah looked graceful and sexy. She was holding a golf club in her\nhand while Shaun was standing behind with his hands on hers. Their intimate posture made him look\nlike he was hugging her from behind."
      },
      {
        "paragraph": "One was young and petite, whereas the other was tall and handsome. With the sunlight shining on their\nhair, they looked like a romantic couple."
      },
      {
        "paragraph": "Catherine continued to rest her eyes on the photo. Looking at Shaun’s exquisite side profile, she felt as\nif her heart had been bitten by an insect, which left her in pain and breathless."
      },
      {
        "paragraph": "Freya was still infuriated. “What the f*ck. I’ve never seen such an ungrateful wretch. Has he forgotten\nthat you were the one who looked after him tirelessly when he was a fool? You’re his girlfriend. You’ve\neven given birth to his children. You’ve worked so hard assisting the Hills, yet he has gone to hit on\nanother woman just because he lost his memory. What’s worse, the person he is hitting on is the\nshameless Hannah.”"
      },
      {
        "paragraph": "“Freya, I’ve made it clear to him.”"
      },
      {
        "paragraph": "With a lump in her throat, Catherine said, “He has the right to be with another woman. Losing his\nmemory has made him a blank slate, so it’s normal for him to fall for someone else again. I can’t\nforcibly keep him by my side because of what happened in the past. He doesn’t remember loving me.”"
      },
      {
        "paragraph": "“Normal, my *ss.”"
      },
      {
        "paragraph": "Freya could not help but insult. “Do you know what they’ve been talking about in the group chat?\nSomeone spotted Shaun and Hannah having lunch together in a mall yesterday, and Shaun was the\none who sent her home at night. Now that Hill Corporation has changed hands and Shaun has been\ndriven out of the company, all the wealthy people in Canberra are saying that he’s trying to fawn on\nHannah so that he can soon become Minister Mead’s son-in-law. A lot of people are making fun and\nlooking down on him.”"
      },
      {
        "paragraph": "“It just baffles me why he’s behaving like this. Hannah isn’t a good woman either. What’s more, Hill\nCorporation’s current state has to do with Minister Mead. In this case, the Mead family should be the\nHills’ enemy. Has Shaun no integrity? How has he become like this?”"
      },
      {
        "paragraph": "Catherine remained quiet. Her mind was a mess."
      },
      {
        "paragraph": "She had long since foreseen that Shaun would interact with other women, but she did not expect it to\nhappen so soon. More surprisingly, the woman was Hannah."
      },
      {
        "paragraph": "However, Catherine believed that Shaun did not get close to Hannah purely because he was attracted\nto her."
      }
    ]
  },
  {
    "title": "Chapter 1720 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun probably had an ulterior motive."
      },
      {
        "paragraph": "Freya continued, “Let me tell you that Minister Mead is a schemer. He doesn’t even care about Shaun.\nAt most, Hannah is just fooling Shaun, but don’t you tell him about it. Leave him to the woman. It\nserves him right.”"
      },
      {
        "paragraph": "“Oh, by the way, as your friend, I sincerely advise you to move out of the Hill family’s manor. With\nShaun’s current antics, other people will laugh at you if you continue staying there.”"
      },
      {
        "paragraph": "Freya was very indignant at the unfair treatment Catherine received."
      },
      {
        "paragraph": "“Mm. Thank you for reminding me, Freya. I was originally hesitant about moving back to the Yules’\nhouse,” Catherine said with a deep voice, “but it seems that there’s no need to hesitate further.”"
      },
      {
        "paragraph": "“Cathy, you should treat yourself better. Besides, you’ve done more than enough for Shaun. You don’t\nhave to put all your eggs in one basket.”"
      },
      {
        "paragraph": "At this point, Freya wished she could get Catherine to distance herself from Shaun as soon as possible\nso that he would regret his actions."
      },
      {
        "paragraph": "“Yeah, I understand.”"
      },
      {
        "paragraph": "After the call ended, Catherine snuggled on the couch for a while before she rose to her feet and\npacked her suitcase."
      },
      {
        "paragraph": "Soon after, she had packed a large suitcase."
      },
      {
        "paragraph": "When she carried it downstairs, Aunty Yasmine yelled at the sight of the scene, “Cathy, why are you\ncarrying such a large suitcase? Are you planning to move out?”"
      },
      {
        "paragraph": "Aunty Yasmine recalled that Catherine only carried a small suitcase when she left two days ago. To all\nappearances, Catherine was going to move out rather than going on an outing."
      },
      {
        "paragraph": "“Yeah, Aunty Yasmine. In fact, I have been contemplating moving out.” Catherine smiled at her. “I didn’t\nmove out before this because Shaun’s condition was unstable. Now that he’s getting better and can\nstart a new life, I’m planning on moving back into the Yules’ house.”"
      },
      {
        "paragraph": "Her words sent Aunty Yasmine into a panic. “No way. What’s going to happen to Young Master Hill and\nthe kids if you leave?”"
      },
      {
        "paragraph": "“I’ve discussed this matter with the kids. They said they could stay with the Yules’ and the Hills’ for a\nfew days each. With you and Aunty Lea here, I feel relieved.”"
      },
      {
        "paragraph": "Catherine tucked her hair behind her ear and smiled. However, a sense of melancholy slowly surfaced\nin her eyes. “Aunty Yasmine, Shaun is now a growing child who’ll develop new relationships, so it’s\ninappropriate for me to stay here. As time passes, other people will gossip about me.”"
      },
      {
        "paragraph": "Aunty Yasmine could not bear to part with her. “ Who will gossip about you? Everyone in the Hill family\ntreats you like Young Madam Hill.”"
      },
      {
        "paragraph": "“But I’m not. Shaun and I don’t have a romantic relationship with each other anymore. Aunty Yasmine,\nplease tell Aunty Lea that I’m leaving.”"
      },
      {
        "paragraph": "After that, Catherine lugged her suitcase out without looking back."
      },
      {
        "paragraph": "Anxious, Aunty Yasmine could not help but call Shaun. “Young Master Hill, Miss Jones has just moved\nout. She’s going to move back to the Yules’ house.”"
      },
      {
        "paragraph": "Only after a moment of silence from the other end of the phone did Shaun respond indifferently. “I\n“Huh?” Aunty Yasmine froze as she did not expect Shaun to be so apathetic."
      },
      {
        "paragraph": "Before she could say anything else, Shaun had hung up the call."
      },
      {
        "paragraph": "She was dazed."
      },
      {
        "paragraph": "Could it be that Young Master Hill had no feelings for Miss Jones anymore?"
      },
      {
        "paragraph": "When Catherine arrived at the gate of the Yule family’s villa with her suitcase, she happened to hear a\nsmash from inside."
      },
      {
        "paragraph": "“How dare Shaun do this? He was the one who pursued my daughter shamelessly in the beginning, yet\nhe decided to dump her now just because he has lost his memory. What does he take my daughter\nfor?”"
      }
    ]
  },
  {
    "title": "Chapter 1721 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Joel lost his temper in the villa. “As I said earlier, Catherine shouldn’t have gotten back together with\nShaun. I’d rather she stayed single forever than be hurt by him time and time again.”"
      },
      {
        "paragraph": "The housekeeper sighed. “Miss Jones is just a little unlucky when it comes to relationships.”"
      },
      {
        "paragraph": "With a lump in her throat, Catherine knocked on the door."
      },
      {
        "paragraph": "When Joel caught sight of Catherine, his face stiffened for a moment before he walked up to her with a\nsmile. “Cathy, you’re back. Why didn’t you let me know? Wow. You even carried your suitcase back.\nThat’s great. I feel bored staying here alone anyway.”"
      },
      {
        "paragraph": "He did not mention the matter between Shaun and Hannah at all, and it filled Catherine with warmth."
      },
      {
        "paragraph": "She knew Joel was worried that she would be embarrassed and upset."
      },
      {
        "paragraph": "“Dad, I heard everything you just said. In fact, I’ve made it clear to Shaun a few days ago, telling him"
      },
      {
        "paragraph": "that he can try to be with another woman. He has forgotten me and might not be able to remember the\npast, so I shouldn’t force him to stay by my side for the sake of the kids.”"
      },
      {
        "paragraph": "Pretending to appear nonchalant, she said, “What’s more… I don’t like the current Shaun.”"
      },
      {
        "paragraph": "“Cathy, you…” Joel sighed.  “You’re  still speaking  up for him even at this point in time. I know you too\nwell. Forget it, and drop the subject. It’s great that you’re back. If you continue staying in the Hills’\nhouse, other people will gossip about you. After all, there are still other men in the world.”"
      },
      {
        "paragraph": "“Thanks for being understanding, Dad.” Catherine grinned and hooked her arm through his."
      },
      {
        "paragraph": "Joel patted her on the back of her hand. “I noticed that you’ve been quite idle recently. Why don’t you\ncome to my company and assist me? You’ll come to my inheritance ultimately anyway, and I’m already\nold. You need to help me out.”"
      },
      {
        "paragraph": "Catherine frowned. “Dad, I can’t go to your office to help you at this time. Now that Rebecca is dead,\nSheryl hates me to the core and will definitely do something to me. If I join your company, she’ll cause\ntrouble for you, especially since you’re currently expanding your logistics business internationally. She’s\nso powerful overseas that she"
      },
      {
        "paragraph": "can easily destroy your international business. Let’s forget it.”"
      },
      {
        "paragraph": "“How did your mom end up in this state?”"
      },
      {
        "paragraph": "A look of disappointment and distress washed over Joel’s face. “She can’t recognize her own daughter,\nand what’s worse, she’s assisting her enemy to act against you. Sigh. I shall meet her and have a talk\nwith her.”"
      },
      {
        "paragraph": "“Hah. She has been brainwashed by Jeffery and Sally. ” Catherine scoffed. “For your information, she\nhas transferred over 5o percent of the shares to Jeffery and the woman who killed her mother.”"
      },
      {
        "paragraph": "The mention of this issue made Catherine’s blood boil."
      },
      {
        "paragraph": "Jeffery and Sally had hurt Catherine and her grandmother so badly, yet Sheryl helped those people\nover and over again. At this point, Catherine really hated Sheryl to the core."
      },
      {
        "paragraph": "Upon noticing the hatred in the depths of her eyes, Joel’s heart clenched."
      },
      {
        "paragraph": "That was exactly why he was insistent on meeting Sheryl."
      },
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "Hill Corporation."
      }
    ]
  },
  {
    "title": "Chapter 1722 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Sheryl was in the company for inspection. Although it was called an inspection, she did not actually\nexamine everything closely as her headache had worsened over the past few days."
      },
      {
        "paragraph": "Sally expressed her concern about Sheryl. “Sherry, are you feeling unwell again? How wicked of Titus\nto torture you like this. I think you should return to the island and get treated as soon as possible. You\ncan come again once you’ve fully recovered. Your brother and Manager Middleton will look after the\ncompany.”"
      },
      {
        "paragraph": "“I won’t leave until Matthew has been found and I take revenge on Rebecca’s behalf.”"
      },
      {
        "paragraph": "Walking in a pair of high heels, Sheryl quickened her pace back to her office to rest. As soon as she\nstarted feeling better with her eyes closed, Jeffery walked in with an elegantly suited man. However,\nthe man’s face was slightly scarred and pale. It appeared that he had just recovered from a serious\nillness."
      },
      {
        "paragraph": "“Hi, Chairwoman Jones. Your reputation precedes you,” Wesley greeted her courteously. “I’m Wesley\nLyons from Golden Corporation.”"
      },
      {
        "paragraph": "Sheryl rubbed her temples. The name rang a bell, but she could not recall it."
      },
      {
        "paragraph": "“He’s technically Catherine’s husband, but Catherine tortured him very badly. ” Jeffery gave a detailed\nintroduction to Wesley. “Just like us, President Lyons came from Melbourne. He has been looking after\nus before this. He couldn’t endure Catherine’s behavior earlier, so he decided to join Hill Corporation\nwith me to assist me in obtaining Rebecca’s shares. But he ended up being beaten so horrifically by\nTitus that he was admitted to the hospital for one week.”"
      },
      {
        "paragraph": "Sheryl nodded. “I think you’ve mentioned it before.”"
      },
      {
        "paragraph": "Jeffery sighed. “On top of that, Titus messed up all of Wesley’s overseas businesses as well, which has\nruined Golden Corporation’s reputation. Now, none of the countries want to work with him. Sally, please\nhelp him…”"
      },
      {
        "paragraph": "Sheryl fixed her eyes on Wesley thoughtfully. It seemed like Matthew had told her some things about\nWesley, but she could not recall what exactly those were. If she was not mistaken, those things were\nnasty…"
      },
      {
        "paragraph": "“Chairwoman Jones, forget it if you feel torn.” Wesley tugged on Jeffery and shook his head before\nsaying to Sheryl, “ Sorry for bothering you today, Chairwoman Jones. I’ll take my leave.”"
      },
      {
        "paragraph": "Once Wesley finished speaking, he turned around and left desolately."
      },
      {
        "paragraph": "Anxious, Jeffery walked up to Sheryl. “ Sherry, he’s very pitiful. While Catherine was in a relationship\nwith him previously, she also flirted with Shaun. Wesley spent several years waiting for Catherine, and\nwhen he finally married her, Catherine slept with Shaun on their wedding day. Everyone knows about\nthis. Later, Catherine destroyed Wesley’s reputation in order to divorce him. Considering that his\ncompany has eventually progressed a little…"
      },
      {
        "paragraph": "Please help him. He’s an honest man. If Titus hadn’t oppressed him and forced him to divorce\nCatherine, his company wouldn’t have ended in this state.”"
      },
      {
        "paragraph": "Upon hearing it, Sheryl scoffed. “Titus is hoping for Catherine to divorce this man so that he can marry\nher, huh? Since Titus wants to destroy him, I’m going to work against the former by helping the latter. I\nbelieve Titus won’t dare to bring a married woman into the Costner family.”"
      },
      {
        "paragraph": "“Sally, does it mean that you’ve agreed to help him?” Jeffery looked surprised. “But Titus is wealthy and\npowerful. Will you be able to defeat him?”"
      },
      {
        "paragraph": "“Jeffery, you’re belittling me.” Sheryl was provoked by his words. “My connections are comparable to\nhis.”"
      },
      {
        "paragraph": "After that, she said to her assistant, “Go and investigate Golden Corporation’s condition. Then, inform\nother countries that if they refuse to work with Golden Corporation, it means that they’re against\nSoromon Island.”"
      },
      {
        "paragraph": "“…Alright.” Her assistant nodded with mixed feelings."
      },
      {
        "paragraph": "Jeffery’s heart was full of joy. After walking out, he headed downstairs to meet Wesley secretly. “Sheryl\nhas agreed to help you.”"
      },
      {
        "paragraph": "“Thanks, Uncle Jeffery. ” Wesley was in raptures, but he hid it very well. “Let’s work together, and we’ll\nboth occupy the Australian business industry in the future.”"
      },
      {
        "paragraph": "“Haha. Wesley, you’re welcome.” At the thought of Wesley’s scheme, Jeffery shuddered deep down. “\nAnyway, I know nothing. I’m counting on you to manage Hill Corporation in the future. As for me, I’ll just\nget some bonuses and boss people around.”"
      },
      {
        "paragraph": "”No problem at all. With my presence, you can do whatever you want in Australia, Uncle Jeffery."
      }
    ]
  },
  {
    "title": "Chapter 1723 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "After Wesley said pensively, he began to laugh smugly with Jeffery."
      },
      {
        "paragraph": "After all, he had waited for this day to come for a very long time now."
      },
      {
        "paragraph": "Upstairs."
      },
      {
        "paragraph": "Just as Sheryl was about to leave, her secretary came in and said, “Chairwoman  Jones, the chairman\nof Joule Corporation, Joel Yule, would like to meet you.”"
      },
      {
        "paragraph": "“Joel Yule?” After some careful thought, it struck Sheryl that he was the man who abandoned her over\n20 years ago."
      },
      {
        "paragraph": "She had never thought of looking for him, but he came looking for her. “Let him in.”"
      },
      {
        "paragraph": "Five minutes later, a middle-aged man dressed in a black suit walked in. He looked like he was in his\n40s, but he kept in good shape. Although he was not as tall and sturdy as Titus and had a rather thin\nphysique, he had a high nose bridge and prominent"
      },
      {
        "paragraph": "features. He still looked elegant despite the creases below his mature eyes."
      },
      {
        "paragraph": "A hint of hatred subconsciously flashed across Sheryl’s face."
      },
      {
        "paragraph": "This foolish man, who failed to recognize his biological daughter, even treated Catherine as his\ndaughter."
      },
      {
        "paragraph": "Unlike Sheryl, Joel was emotional and in a daze when he saw her."
      },
      {
        "paragraph": "He recalled her looking pretty when he saw her not long ago. However, it had only been less than a\nmonth, and she appeared a lot paler and thinner than before."
      },
      {
        "paragraph": "“Sherry—”"
      },
      {
        "paragraph": "“Shut up. You have no right to address me this way, ” Sheryl interrupted him with a dominating\npresence."
      },
      {
        "paragraph": "“I’m sorry.”"
      },
      {
        "paragraph": "Despondent, Joel promptly dropped his head and apologized. “M-Madam Costner…”"
      },
      {
        "paragraph": "“You’re not allowed to call me that either. ” Sheryl grabbed a cup and hurled it at the floor in front of\nhim."
      },
      {
        "paragraph": "The word ‘Costner’ agonized her."
      },
      {
        "paragraph": "Joel took two steps backward. He was stunned at the sight of her ferocious, pretty face."
      },
      {
        "paragraph": "He could not believe that the agitated woman in front of him was his unforgettable first love."
      },
      {
        "paragraph": "“Well… C-Chairwoman Jones.” Joel said with difficulty, “Let’s… calm down, okay? I came here to\ndiscuss our daughter’s matter.”"
      },
      {
        "paragraph": "“I’m sorry, but Rebecca is my only daughter.”"
      },
      {
        "paragraph": "Sheryl glowered at him resentfully. “Why did I fall for such a dumb*ss like you who can’t even recognize\nyour own daughter? Catherine isn’t your daughter. You treat the person who murdered our daughter as\nyour darling. Are you senile? Wait, you’re not only senile but also scummy. You fooled around with\nother women and never fulfilled your duty as a father. If you had been responsible, Rebecca wouldn’t\nhave been kidnapped and tortured.”"
      },
      {
        "paragraph": "Joel gaped at her. “No, no. You’re the one who is mistaken. Catherine really is our biological daughter.\nLook how alike both of you are. What’s more, when I acknowledged her and asked her to return to the\nYules’ house, I did a DNA test with her.”"
      },
      {
        "paragraph": "“I’ve also done a DNA test proving that Rebecca is m y daughter.” Sheryl leaped to her feet. “All of you\nare trying to make me acknowledge Catherine as my daughter. Well, you can dream on. I won’t be so\nfoolish as to mistake her for my daughter. Also, she killed Rebecca, and I’ll take revenge on her. I\nswear that I must kill Catherine.”"
      }
    ]
  },
  {
    "title": "Chapter 1724 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Sheryl’s eyes filled with intense hatred."
      },
      {
        "paragraph": "Joel was taken aback by how stubborn Sheryl was to behave so neurotically in front of him."
      },
      {
        "paragraph": "He was really worried that Sheryl and Catherine would kill each other one day."
      },
      {
        "paragraph": "“Chairwoman Jones, these are… Catherine’s hairs.”"
      },
      {
        "paragraph": "Joel placed the few hairs on her desk. “ If you don’t believe me, you can send these hairs back to\nSoromon Island for DNA testing. They’re your trusted people, and they won’t be able to fake the result.\nAs for Rebecca and your DNA test, may I know if you did it yourself?”"
      },
      {
        "paragraph": "“My son personally did it. Are you saying that even my son can’t be trusted?” Sheryl did not believe\nJoel at all."
      },
      {
        "paragraph": "“Chairwoman Jones, perhaps the hair was real, but have you ever thought that it might not belong to\nRebecca? Did you watch her pluck it from her head with your own eyes?”"
      },
      {
        "paragraph": "“Zip it. Rebecca is already dead, yet you guys continue to slander her.” Sheryl could not help but slam\nher hands on the table and stood up."
      },
      {
        "paragraph": "Joel said impatiently, “Chairwoman Jones, I want to have a clear idea who my biological daughter\nactually is as well. You said your result shows that Rebecca is the one, but mine proves that it’s\nCatherine instead. In fact, we share the same goal, which is to find the daughter whom we lost back\nthen. If Catherine is the one who faked it, I’ll personally deal with her before you do. Since Rebecca\nhas been cremated, I can’t possibly get her hair. I personally plucked these hairs from Catherine’s\nhead, and it’s pointless for me to  lie. Both of us simply want the truth.”"
      },
      {
        "paragraph": "After pausing for a moment, Joel noticed the frown on Sheryl’s face. She seemed to be pondering over\nit. With that, he quickly added in a deep voice,“ Perhaps you’re suspecting that  your  husband, Titus,\nhas feelings for Catherine because she looks like you when you were younger. You might reckon that\nTitus has an ulterior motive. Given that there’s no romance involved in my relationship with Catherine, I\nwon’t make up something just to win your trust. There’s no point in doing it.”"
      },
      {
        "paragraph": "Sheryl stared at him thoughtfully without saying a word."
      },
      {
        "paragraph": "Seeing her reaction, Joel said, “Chairwoman Jones, all you need to do is make a call to have these\nhairs sent over there. At the same time, you need to keep this a secret. Don’t let anyone else know\nabout it aside from your bodyguards and yourself. No matter how far Catherine and Titus interfere, they\ncan’t possibly have a hand in the affairs in your territory."
      },
      {
        "paragraph": "“To be honest, it’s impossible for two people to look so alike. Not only does Catherine look like you, but\nher eyes also take after mine. She also looks like my niece, Melanie.”"
      },
      {
        "paragraph": "Once Joel finished speaking, he slid five photos out of his pocket. “Look at these five photos. This is\nCatherine, and this is my niece, Melanie. Another photo here is how Rebecca looked before she\nunderwent plastic surgery. The other two are our photos when we were in a relationship. You can\ncompare them. I just want to remind you that every child takes after their parents, and I won’ t go on\nanymore. I’m leaving now.”"
      },
      {
        "paragraph": "With that, he turned around and closed the door before he left."
      },
      {
        "paragraph": "When Joel walked out the door, he darted a glance at Sheryl and sighed. He hoped that she had a\nsense of judgment. From his understanding of Sheryl, she probably would not let the drugs run her own\nlife."
      },
      {
        "paragraph": "In the office, Sheryl subconsciously rested her eyes on those photos."
      },
      {
        "paragraph": "As much as she wanted to fling them away, she froze at the sight of both photos of Catherine and the\nyounger Joel side by side."
      },
      {
        "paragraph": "Sheryl could see why Catherine took after her since she was her aunt."
      },
      {
        "paragraph": "However, Catherine’s eyes were indeed similar to Joel’s."
      },
      {
        "paragraph": "Sheryl picked up Melanie’s and Catherine’s photos, only to find the close resemblance between them\neven though she thought that they were not related by blood."
      },
      {
        "paragraph": "After that, she grabbed the photo of Rebecca before she underwent plastic surgery. Surprisingly, she\ncould not see any resemblance between Rebecca and Joel at all. Rebecca was not similar to Melanie\nin appearance either."
      },
      {
        "paragraph": "Sheryl’s heart did a flip."
      },
      {
        "paragraph": "How could Catherine possibly resemble Joel and Melanie? It reminded her of Joel’s remark — every\nchild takes after their parents."
      }
    ]
  },
  {
    "title": "Chapter 1725 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "A thought popped up in Sheryl’s head. Just as she was about to grab hold of it, her head began to hurt\nterribly."
      },
      {
        "paragraph": "The photos in her hand fell onto the floor."
      },
      {
        "paragraph": "“Chairwoman Jones.” The assistant beside her was shocked. “Let me send you to the hospital, okay?”"
      },
      {
        "paragraph": "“No need. Take me inside for a short rest. ” Sheryl waved her hand with a pale face."
      },
      {
        "paragraph": "The assistant promptly held her up and took her into the lounge. Sheryl lay on the bed with her eyes\npartly closed. “Send those few hairs back to Soromon Island, and get our doctor to conduct a DNA\ntest.”"
      },
      {
        "paragraph": "“Alright. ” The assistant nodded. As she had been following Sheryl for years, she was treated as the\nlatter’s confidant."
      },
      {
        "paragraph": "After Jeffery saw Wesley off in the car park, he was ready to head upstairs when he suddenly spotted\nan elegant middle -aged man coming out of the office."
      },
      {
        "paragraph": "That face…"
      },
      {
        "paragraph": "He had come across that face on TV before. The man was none other than Joel Yule."
      },
      {
        "paragraph": "Nevertheless, why was Joel here? Did he come to look for Sheryl?"
      },
      {
        "paragraph": "Jeffery began to panic. Considering that Joel was Sheryl’s unforgettable first love, could she have\nremembered something at the sight of him?"
      },
      {
        "paragraph": "After going upstairs, Jeffery swiftly called over Sheryl’s secretary from her office."
      },
      {
        "paragraph": "It was Wade who assigned this secretary to keep a watchful eye on Sheryl. However, she acted on\nJeffery’s and Wesley’s instructions in secret."
      },
      {
        "paragraph": "“Let me ask you. Did Joel come to look for Sheryl just now?” Jeffery asked fiercely."
      },
      {
        "paragraph": "The secretary nodded. “They had a brief talk in the office. There were bodyguards outside the door, so\nI have no idea what they talked about. But once Joel left, Sheryl’s head hurt very badly. When I went\ninto her office to fetch some warm water for her, I saw several photos on her desk.”"
      },
      {
        "paragraph": "“What photos?” Jeffery asked fretfully."
      },
      {
        "paragraph": "“Sheryl’s assistant was there, so I dared not move too close. I only caught a glimpse of the photos. All I\ncould recognize was a photo of a young girl who looked like Sheryl.”"
      },
      {
        "paragraph": "Deep down, Jeffery shuddered. He quickly searched for Catherine’s photo on the Internet and showed\nit to the secretary. “Is she the one?”"
      },
      {
        "paragraph": "“Yeah. It’s her.” The secretary nodded."
      },
      {
        "paragraph": "“Okay. You may go out.” Jeffery waved his hand. As soon as the secretary left, he called Wesley\nanxiously to inform him about it. “Well, what do you think Joel is planning to do by bringing those\nphotos here? As soon as he left, Sheryl’s head began to hurt so bad that she had to rest. Do you think\nshe’ll recall something? After all, Titus has had her treated for some time.”"
      },
      {
        "paragraph": "“For now, I don’t think she will.”"
      },
      {
        "paragraph": "Amid his thoughts, Wesley said, “Even so, I’m sure Joel has done something. How many photos did he\nbring here?”"
      },
      {
        "paragraph": "“Yeah. The secretary only saw Catherine’s photo.”"
      },
      {
        "paragraph": "A moment of silence befell over the other end of the phone before suddenly, Wesley laughed grimly, “I\nknow whose photos Joel brought. It seems like he’s not senile after all. Catherine  bears a\nresemblance  to both Sheryl and Joel, and it’s normal for a"
      },
      {
        "paragraph": "daughter to look like her parents. However, Rebecca doesn’t look like Joel at all. Even Catherine has a\npassing resemblance to Melanie.”"
      },
      {
        "paragraph": "“ So… So what should we do?” Jeffery grew edgy. “ Sheryl won’t suspect us, right?”"
      },
      {
        "paragraph": "“Now that she’s slow and her head has been aching badly, I reckon she won’t suspect us yet, but she’ll\nprobably investigate it. You need to hurry up and coax Sheryl into settling the matter regarding Golden\nCorporation for me. After that, do away with her.”"
      },
      {
        "paragraph": "It made Jeffery’s blood curdle. “Are you out of your mind? But she’s…”"
      },
      {
        "paragraph": "“We can’t allow her to leave Australia. She and Titus happen to be cutting each other’s throats now,\naren’t they? Let’s accuse Titus of killing her. If the Soromon Islanders were to take revenge, they’d do it\nto the Costner family. We can just reap the benefit from their fight by then. What’s more, Titus\ngenuinely loves his wife. Sheryl’s death would mean that half of his life is gone, so there’s nothing to\nfear,” Wesley said in a light-hearted manner."
      }
    ]
  },
  {
    "title": "Chapter 1726 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "As Jeffery listened to Wesley, he grew increasingly petrified."
      },
      {
        "paragraph": "Wesley was really terrifying. He was just like a devil."
      },
      {
        "paragraph": "Would Wesley kill him one day without him realizing it?"
      },
      {
        "paragraph": "“What’s wrong? Are you scared?” Wesley began to laugh. “Uncle Jeffery, from the day I came looking\nfor you in jail to have you acknowledge Catherine as your daughter in front of Sheryl, there is no turning\nback. Oh, by the way, since Sheryl might have begun suspecting you, I need to create some drama\nbetween Catherine and her. I can’t let them acknowledge each other so soon.”"
      },
      {
        "paragraph": "“What are you trying to do again?” The words escaped Jeffery’s mouth."
      },
      {
        "paragraph": "“I want to fuel the hatred between them.”"
      },
      {
        "paragraph": "Once Wesley finished speaking, he hung up the call. Jeffery shuddered."
      },
      {
        "paragraph": "Once the issue was over, he planned to take a few hundred billion dollars and leave Australia\nafterward. He did not mind giving up on Hill Corporation."
      },
      {
        "paragraph": "In the evening."
      },
      {
        "paragraph": "Catherine picked up the two kids from the preschool and went back to the Yule family’s villa."
      },
      {
        "paragraph": "When she was getting ready to cook soon after arriving home, she suddenly received a call from Joel’s\nassistant. “Miss Jones, a fire suddenly broke out in No. 36 port warehouse when Mr. Yule went there\nfor an inspection. A cargo fell on his leg and injured him. He has been sent to the hospital.”"
      },
      {
        "paragraph": "Catherine was shocked. “Why was there a fire outbreak in the warehouse?”"
      },
      {
        "paragraph": "“The police said that one of the packages in the warehouse had alcohol in it. Because the warehouse\nhas overstocked a lot of goods and the weather has been boiling hot. when the warehouse keeper\nsmoked there, it…”"
      },
      {
        "paragraph": "“I’ll come right away.”"
      },
      {
        "paragraph": "Once Catherine hung up the call, the two kids stared at her nervously."
      },
      {
        "paragraph": "“Your grandpa is slightly injured. You both just wait at home. I can’t take care of you both now,” she said\ngently."
      },
      {
        "paragraph": "Just as Suzie was about to speak, Lucas pulled on her. “Listen to Mommy.  Don’t  cause  trouble  for\nher. Mommy has a lot of enemies out  there who want to hurt her. Do you want to be kidnapped again?”"
      },
      {
        "paragraph": "Suzie pouted. “Why have we been getting into trouble lately? Is it because someone’s trying to hurt\nGrandpa?”"
      },
      {
        "paragraph": "Catherine pursed her lips. She had her doubts, but she could not express them in front of the kids."
      },
      {
        "paragraph": "When she arrived at the hospital, Joel was receiving IV infusion on the bed with a cast on his leg. He\ndid not look too well."
      },
      {
        "paragraph": "“Dad, is your leg seriously injured?” At the thought of his healthy look when he left this afternoon, her\nheart ached in spite of herself."
      },
      {
        "paragraph": "“Nothing much. It’s just a minor injury. The doctor said I can remove my cast in a month’s time.” A smug\nexpression crossed Joel’s face."
      },
      {
        "paragraph": "However, Catherine was upset over his condition. “ Dad, why was there a package containing alcohol\nin"
      },
      {
        "paragraph": "the warehouse? Could it be that someone wanted to hurt you on purpose? Also, what was wrong with\nthe warehouse keeper? How dare he smoke in the warehouse. Given your strictness, why did you hire\nsuch a person?”"
      },
      {
        "paragraph": "“I’m not very sure as well. ” Joel knitted his brows. “ I have specified the rule that smoking isn’t allowed\nin the warehouse before this. As for the alcohol in the package— ”"
      },
      {
        "paragraph": "“Dad, I suspect that someone’s  trying to harm you,” Catherine interrupted him. “Otherwise, why would\nthe fire break out just as you were there?"
      },
      {
        "paragraph": "Perhaps the warehouse keeper has been bribed.”"
      },
      {
        "paragraph": "After staying silent for a long while, Joel said, “ Considering how rapid our company has been\ndeveloping recently, it’s normal for other people to be jealous.”"
      }
    ]
  },
  {
    "title": "Chapter 1727 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“No, this is far from normal. You were fine previously, but why did this occur to you at this moment in\ntime? Perhaps you were dragged into the mess because of me.” Catherine clenched her teeth and said\nresentfully, “ Sheryl has long since wanted to take revenge on me because of Rebecca’s passing.\nSince I haven’t really gone out, she has chosen to attack you.”"
      },
      {
        "paragraph": "Joel’s assistant suddenly said, “That’s possible. Chairman Yule, didn’t you meet Sheryl this afternoon?\nCould it be—”"
      },
      {
        "paragraph": "“Absolutely not,” Joel interrupted him as his elegant face went pale. “Sherry couldn’t possibly have\ndone such a thing. What’s more—”"
      },
      {
        "paragraph": "“Dad, she’s no longer the Sheryl you knew back then. She’s a wicked madwoman who can even\nkidnap Suzie, let alone you.”"
      },
      {
        "paragraph": "Catherine broke in, saying furiously, “She doesn’t even remember who you are. Don’t expect her to\nconsider her past relationship with you. I reckon she’s planning to take revenge on Titus as well.”"
      },
      {
        "paragraph": "“Cathy, drop it. I don’t believe it. ” Joel shook his head. “Today, I went to look for her to tell her that\nyou’re her daughter. I think she somewhat believed what I said.”"
      },
      {
        "paragraph": "“You’re too naive. She’s just a lunatic who can’t even think straight. Yet, you thought you could\npersuade her.” Catherine thundered, “A madwoman like her should really go to hell.”"
      },
      {
        "paragraph": "“Cathy… ” Joel warned her in exasperation, “You can’t say that. After all, she’s your mom.”"
      },
      {
        "paragraph": "“ I don’t have such a wicked mom.” At the sight of his injured leg, Catherine’s eyes filled with hatred. “\nShe’s foolish and mean. She has been drugged, cheated, tricked, and can’t even tell what’s  right and\nwrong. You shouldn’t look for her anymore."
      },
      {
        "paragraph": "I’m not keen on being her daughter at all.”"
      },
      {
        "paragraph": "“You…”"
      },
      {
        "paragraph": "Joel was so agitated that his leg kept aching. Knock, knock."
      },
      {
        "paragraph": "A series of knocks suddenly sounded on the door. They did not know when Shaun had come with\nsome tonics and fruits in his hands."
      },
      {
        "paragraph": "When Catherine saw him, she was rather upset."
      },
      {
        "paragraph": "“Why are you here?” Joel asked with resentment."
      },
      {
        "paragraph": "“Uncle Joel, I heard you got slightly injured from an accident. I… came to visit you. ” This was the first\ntime Shaun met Joel after he lost his memory. He could tell that Joel disliked him very much."
      },
      {
        "paragraph": "However, it was understandable considering those things he had done back then. No parents would\nlike it."
      },
      {
        "paragraph": "“I don’t need you to visit me. Get out with your stuff.” The sight of Shaun made Joel fly into a fury."
      },
      {
        "paragraph": "Shaun stood still with his stiff, handsome face. “ Uncle Joel, these are high-quality tonics.”"
      },
      {
        "paragraph": "Joel snorted and said, “We’re not short of money, and we can afford tonics. Eldest Young Master Hill,\nyou’d better focus your effort on pleasing Minister Mead’s daughter. Perhaps you can soon become\nMinister Mead’s son-in-law and climb the social ladder.”"
      },
      {
        "paragraph": "Shaun’s face darkened faintly. He subconsciously shifted his gaze to Catherine, only to see her\nnonchalant expression from her side profile, as though the situation had nothing to do with her."
      },
      {
        "paragraph": "A deep sense of agony welled up in his heart. Did she not care about him anymore?"
      },
      {
        "paragraph": "“Please leave.”"
      },
      {
        "paragraph": "Upon noticing that Shaun had gone silent, Catherine turned to look at him. “Since you’ve decided to be\nwith Hannah, you should avoid causing her any misunderstanding. Hannah is petty. If she decides to\ndeal with the Yules out of jealousy, we’re no match for the Mead family.”"
      },
      {
        "paragraph": "She was right."
      },
      {
        "paragraph": "Sheryl already had wanted to take revenge on her. If Catherine offended the Mead family, there was no\nway she could beat them."
      },
      {
        "paragraph": "She had to take account of Joel’s and the kids’ safety. “Cathy, let’s go outside and have a quick word.”\nShaun said in distress, “Once I’m done, I’ll leave.”"
      }
    ]
  },
  {
    "title": "Chapter 1728 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine hesitated for a while before she walked out with Shaun."
      },
      {
        "paragraph": "As the wards here were for VIPs, there was barely anyone in the long corridor."
      },
      {
        "paragraph": "Catherine leaned against the window. Her pretty face looked cool and serene."
      },
      {
        "paragraph": "As Shaun recalled her sorrowful and exasperated expression when he entered the ward, his heart\nclenched in spite of himself. “Cathy, soon, what happened today won’t happen ever again. Give me a\nlittle more time.”"
      },
      {
        "paragraph": "Once Wesley’s and Jeffery’s true colors were exposed, Sheryl would discover the truth and forget\nabout taking revenge on Catherine."
      },
      {
        "paragraph": "Upon hearing his words, Catherine stared at Shaun earnestly, “Shaun, I don’t want to know what you’re\nplanning to do. We don’t have to meet each other in the future unless it’s about the kids. We"
      },
      {
        "paragraph": "can just talk on the phone. Also,  you’re not obliged to visit my dad. Please leave.”"
      },
      {
        "paragraph": "Seeing her indifferent gaze, Shaun subconsciously tightened his fists. “I’m not into Hannah. I’m doing\nthis for—”"
      },
      {
        "paragraph": "“I know you have an ulterior motive, ” Catherine interjected. “And that’s precisely why you need to keep\na distance from me. If you flirt with Hannah while staying in touch with me, your ex-wife, how are other\npeople going to perceive me? If Hannah finds out about it, I’ll suffer the consequences too. ”"
      },
      {
        "paragraph": "Stung by her criticisms, Shaun was at a loss for words."
      },
      {
        "paragraph": "He had no choice but to suppress his feelings as he looked at her. Aunty Yasmine already informed\nhim that she had moved back to the Yules’ house today."
      },
      {
        "paragraph": "At the thought that he would not see her in the manor anymore, he did not feel like going home tonight."
      },
      {
        "paragraph": "To him, a place without her felt empty. “I’m going in now.”"
      },
      {
        "paragraph": "With that, Catherine turned around and walked into the ward."
      },
      {
        "paragraph": "Just as Shaun was about to tag along, his phone rang. The minute he saw the name ‘Hannah Mead’,\nhatred flashed across his eyes. Even so, he picked up the call. “What’s the matter?”"
      },
      {
        "paragraph": "“I should be the one asking you that.” Hannah replied coquettishly, “Didn’t we agree to have dinner\ntogether tonight? Yet, you stood me up at the last minute. Don’t think I don’t know that you’ve gone to\nvisit Joel. Am I right?”"
      },
      {
        "paragraph": "Hannah snorted. “Is it because you still can’t get over Catherine? Otherwise, why would you go over\nthere just because something happened to her dad? Shaun, have you been fooling me for the past two\ndays?”"
      },
      {
        "paragraph": "“I’m coming to meet you now, ” Shaun answered."
      },
      {
        "paragraph": "He cast a look at the door, and his dark eyes drooped. Then, he turned around and walked away\nwithout looking back."
      },
      {
        "paragraph": "That night, Catherine kept Joel company in the hospital."
      },
      {
        "paragraph": "The next day, Joel’s assistant came to give him a report of the situation. “President Yule, according to\nthe police’s investigation, it was a deliveryman who signed the package containing alcohol. The"
      },
      {
        "paragraph": "deliveryman claimed that he did not notice the"
      },
      {
        "paragraph": "alcohol label at the bottom of the package when he checked it. Then, the warehouse was in flames\nbecause the warehouse keeper secretly smoked, and you just happened to arrive at that moment. He\nwas so shocked that he tossed the cigarette onto the floor. In the end, he forgot to step on the cigarette\nto put it out, which resulted in the fire. However, the police investigated both their bank accounts and\ndetected suspicious money transfers from overseas into their accounts.”"
      },
      {
        "paragraph": "“When did the transfer take place?” Catherine asked."
      },
      {
        "paragraph": "The assistant paused for an instant and shot a complicated look at Joel before he responded, “ Seven\nto eight minutes after you left Hill Corporation.”"
      },
      {
        "paragraph": "Joel’s heart trembled, and his face became ashen."
      },
      {
        "paragraph": "Catherine closed her eyes and scoffed. “Dad, you must accept the fact now, right?”"
      },
      {
        "paragraph": "A dazed look washed over Joel’s face. In this world, there was probably nothing more painful than\nknowing that the woman he used to be deeply in love with wanted to kill him."
      }
    ]
  },
  {
    "title": "Chapter 1729 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "hapter 1733"
      },
      {
        "paragraph": "Catherine took the elevator directly to the car park."
      },
      {
        "paragraph": "She then started the car and sped out of the hospital."
      },
      {
        "paragraph": "These days, she had been feeling something burning in her chest, probably because her emotions had\nbeen repressed for a long time."
      },
      {
        "paragraph": "With her inability to defeat some people over certain things, she had considered giving in. However,\nwhy were those people insistent on targeting the people around her?"
      },
      {
        "paragraph": "She gritted her teeth and called Titus. “Uncle Titus, please tell me Sheryl’s address.”"
      },
      {
        "paragraph": "“What are you planning to do?” Titus frowned. “ Don’t go there rashly. She has assigned quite a\nnumber of bodyguards from overseas to be by her side.”"
      },
      {
        "paragraph": "“I’d like to have a talk with her.”"
      },
      {
        "paragraph": "Catherine did not plan to tell Titus the issue because Joel was his love rival. Another reason was that\nshe did not want Titus to be caught in the middle, considering that Sheryl was his wife."
      },
      {
        "paragraph": "“She’s now emotionally unstable, so it’s useless to talk to her.” Titus rejected her request outright. “I\nwon’t tell you for the sake of your safety.”"
      },
      {
        "paragraph": "Catherine was at the end of her tether. “Will I be safe if you don’t tell me? It’s impossible. A wicked\nwoman like her won’t let me off just like that.”"
      },
      {
        "paragraph": "Titus was deeply distressed by her words because she took his beloved wife for a wicked woman."
      },
      {
        "paragraph": "hapter 1733"
      },
      {
        "paragraph": "“Uncle Titus, this is Australia. You can’t protect me. At this point, no one can protect my family and me,”\nCatherine said, feeling powerless. “If  I can ensure my family’s safety by sacrificing myself, I’m ready to\ndo that.”"
      },
      {
        "paragraph": "Titus’s heart clenched. For a long time, he did not say a word."
      },
      {
        "paragraph": "“Even if you don’t tell me her address, I can get it on my own.”"
      },
      {
        "paragraph": "After hanging up the call, Catherine drove straight to Hill Corporation."
      },
      {
        "paragraph": "Just as she walked up to the door, the receptionist blocked her. “I’m sorry, Miss Jones. You’re not our\nstaff member, and you didn’t make an appointment, so you can’t enter.”"
      },
      {
        "paragraph": "“What if I’m set on going in?” Catherine narrowed her eyes."
      },
      {
        "paragraph": "“We’ll have no choice but to deal with you. ” The security manager came with a group of security\nguards. With a grim smile, he said, “Miss Jones, Shaun isn’t here with you this time. He beat us up so\nbadly last time, and you were even haughty enough to tell the president on us. Unfortunately, now that\nShaun has bugged off, we’re back. Now that I am here, don’t ever think about stepping in.”"
      },
      {
        "paragraph": "Catherine’s dark eyes were somber, and she clenched her fists tightly."
      },
      {
        "paragraph": "All of a sudden, Wesley’s laughter rang out behind her. “Wifey, what brings you here? Is it because\nShaun has dumped you that you can’t step into Hill Corporation? Wait, that’s not right. This company  is\nno longer called Hill Corporation. It should be Jere Corporation. What a nice name.”"
      },
      {
        "paragraph": "Catherine turned to look at him with disgust. “Oh. Judging from your cheerful laugh, I thought it was\nnamed Lyons Corporation.”"
      },
      {
        "paragraph": "Wesley did not seem to get her sarcasm. He slowly walked up to her and whispered with a note of\nsmugness, “Now isn’t the time yet, but it’s going to happen very soon.”"
      }
    ]
  },
  {
    "title": "Chapter 1730 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine lifted her head and saw Wesley’s smug expression. At this point, Wesley made no pretense\nof hiding his emotions."
      },
      {
        "paragraph": "“Cathy, how beautiful of you to look at me this way.” Wesley held her gaze. The glint of hatred in her\nonce bright, large eyes gave him an indescribable sense of pleasure."
      },
      {
        "paragraph": "He stretched out his hand and slid it across her chin."
      },
      {
        "paragraph": "However, Catherine slapped his hand off disgustedly. “Stop touching me. You’re disgusting.”"
      },
      {
        "paragraph": "“I’m disgusting?” Wesley chuckled coldly. “How great is Shaun? The high and mighty Eldest Young\nMaster of the Hill family has been around Hannah like a dog every day. Does he think he can marry\ninto the Mead family by playing up to Hannah?"
      },
      {
        "paragraph": "Dream on. Gavin will never accept him. At most, he’ll just let Hannah sleep with Shaun. You’re lucky\nthat you’re still my wife.”"
      },
      {
        "paragraph": "“I don’t give a d*mn about it. I just want you to get a divorce with you.” Catherine said indifferently, “I\nadvise you to get the divorce proceedings settled as"
      },
      {
        "paragraph": "soon as possible. With your current status,"
      },
      {
        "paragraph": "marriage can be used as your best bargaining chip. ”"
      },
      {
        "paragraph": "“Haha. You’re wrong. With my current status, there’ll be countless wealthy ladies  trying to play up to\nme. I reckon Gavin wants to marry her"
      },
      {
        "paragraph": "daughter off to me as well. Sadly, I’m not interested in her. I’ve married you, but I haven’t gotten to\nsleep with you. What a shame.”"
      },
      {
        "paragraph": "Wesley sized her up avariciously."
      },
      {
        "paragraph": "As Catherine had been taking care of Joel in the hospital earlier, she was wearing a pair of plain jeans\nand a T-shirt. Even so, her outfit did not hide her attractive curves, and her beautiful but pale face\nevoked sympathy for herself."
      },
      {
        "paragraph": "“I’m sorry, but I’m worried that I’ll catch a disease.” A look of disgust washed over Catherine’s face."
      },
      {
        "paragraph": "Wesley’s eyes became frosty, and he sneered. “I don’t think you understand. At present, nobody in\nAustralia can do anything to me, including Prime Minister Snow. I forgot to let you know that Titus’s\nearlier attempt to ruin Golden Corporation’s overseas businesses has been in vain. I asked your mom\nfor a favor yesterday, and she has already helped me overcome the problem I encountered abroad.\nRight now, a lot of countries are willing to"
      },
      {
        "paragraph": "work with me again. Really… I appreciate you for that.”"
      },
      {
        "paragraph": "He moved closer to her ear again. “What a wonderful mom you have. She’s willing to help me with\nanything. That’s very sweet of her.”"
      },
      {
        "paragraph": "Not only did he disgust her, but he also made her infuriated."
      },
      {
        "paragraph": "Every word of his resembled a needle that pricked her heart."
      },
      {
        "paragraph": "Unable to tolerate him further, she tried to slap him."
      },
      {
        "paragraph": "Nevertheless, Wesley seized her wrist and said with a smile, “Don’t be mad. You can’t be mad just\nbecause your mom didn’t help you. Sigh. Speaking of it, your mom is really vicious. She has always\nwanted to take revenge on Rebecca’s behalf, and I heard she currently hates you to the core. But if she\nkills you just like that, it’ll be too easy for you. She wants you to experience the torment of losing your\nloved ones.”"
      },
      {
        "paragraph": "Catherine widened her eyes, which did not contain the slightest trace of warmth. In fact, they were\ntrembling."
      },
      {
        "paragraph": "Wesley continued to whisper in her ear, “As far as I know, what happened yesterday was just a minor\nissue. How fortunate Joel was! Having said that, he might not be able to escape from your mom next\ntime since she’s quite capable and well-connected.”"
      },
      {
        "paragraph": "“You guys have been trying to tear us apart in front of her, haven’t you?”"
      },
      {
        "paragraph": "Catherine’s dark eyes slowly turned dull, and they were filled with frustration and helplessness. “\nWesley, you’ve been making use of me to rise to the top. Honestly, if it weren’t  for me,  all you would\nhave right now is just an ordinary transnational company. Do you think you could’ve been who you are\ntoday without me? Don’t tell me that you love me. This isn’t how you should love someone. You’ve had\nthe intention to take advantage of me right from the beginning, but haven’t you taken full advantage of\nme by now? I beg you to let go of me. I’ll stay as far away as possible from you guys. As for the matter\nregarding Rebecca, I’ll never expose it."
      },
      {
        "paragraph": "This was her first time surrendering to Wesley."
      }
    ]
  },
  {
    "title": "Chapter 1731 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“You’re finally begging me.”"
      },
      {
        "paragraph": "At the sight of how defeated Catherine looked, Wesley was so elated that words could not describe\nhow smug he was. “But the way you’re begging me seems far too casual. Um, you should at  least \ntake off your clothes and wait for me in bed.”"
      },
      {
        "paragraph": "He whispered in her ear, “Why don’t… you give it a try now? If I’m satisfied with the way you serve me,\nI might speak up for you in front of your mom.”"
      },
      {
        "paragraph": "Catherine raised her head and almost threw up at the sight of his sleazy expression."
      },
      {
        "paragraph": "A moment later, she forcefully escaped his grip. “Do you think you deserve to sleep with me? Look at\nyour disgusting face. You’re ugly and old.”"
      },
      {
        "paragraph": "“Catherine Jones, do you have a death wish?” At that moment, Wesley’s good mood was ruined, and\nthere was a look of exasperation in his eyes. “Do you know the consequences of offending me? Don’t\nexpect Titus to save you. Although he’s on friendly terms with Prime Minister Snow, his men can’t enter\nAustralia because I have Gavin backing me."
      },
      {
        "paragraph": "Currently, even Prime Minister Snow is too scared to offend Gavin. If you’re expecting Freya and\nTitus’s help, you can dream on. You’re all on your own right now.”"
      },
      {
        "paragraph": "He approached her step by step with a grim smile. “ Don’t expect your family to take you abroad as\nwell. All I need to do is pull some strings with Minister Mead and your family won’t be able to get the\ninternational travel formalities done overnight. I can simply drag it on for a month, but who knows\nwhat’s going to happen in the next one month?”"
      },
      {
        "paragraph": "Catherine shuddered."
      },
      {
        "paragraph": "This man was like a devil. No, he was more vicious than a devil."
      },
      {
        "paragraph": "“I’ll wait for your call. I’ve never changed my number because of you.” Wesley snorted softly before he\nstrode out."
      },
      {
        "paragraph": "Looking at Wesley’s figure, Catherine wished she could knock him over with a car."
      },
      {
        "paragraph": "Luckily, she did not drive today."
      },
      {
        "paragraph": "After leaving Hill Corporation, her heart felt heavy."
      },
      {
        "paragraph": "Having come this far, she felt nothing but exhaustion. She had an overwhelming urge to kill herself.\nHowever, what would happen to her kids and Joel, then?"
      },
      {
        "paragraph": "She wandered along the road in a daze."
      },
      {
        "paragraph": "Not far away, a Bentley was driving toward her."
      },
      {
        "paragraph": "Hannah, who was in the car, happened to be gazing out of the window when she immediately spotted\nthe abstracted Catherine outside."
      },
      {
        "paragraph": "She glanced sideways at Shaun, who was looking at his phone. Then, she quietly shot a look at the\ndriver in front."
      },
      {
        "paragraph": "The driver deliberately turned the steering wheel to one side. Coincidentally, a puddle of water by the\nroadside splashed onto Catherine’s pants and shirt."
      },
      {
        "paragraph": "The driver suddenly slammed the brakes."
      },
      {
        "paragraph": "Shaun lifted his head, and Hannah said with a grin, “Did you get a fright? The driver was driving too\nfast just now, and I think a puddle of water at the roadside has hit someone. I’m going to apologize to\nthat person.”"
      },
      {
        "paragraph": "Shaun looked out of the window, only to catch sight of Catherine drenched to the skin. His eyes were\nriveted on her for a moment."
      },
      {
        "paragraph": "“Don’t you know how to drive?” Catherine lost her temper. When she looked up, she saw Hannah\nstrutting out of the rear seat in a coat."
      },
      {
        "paragraph": "“Hey. Aren’t you Miss Jones? I’m sorry.” Hannah covered her nose, feigning disdain. “It smells so bad.”"
      },
      {
        "paragraph": "Catherine’s face darkened. She instantly said, “If I had known earlier that I’d come across an ugly\ncreature here, I wouldn’t have left my house.”"
      },
      {
        "paragraph": "“Stop it. You’re just a little wet, aren’t you? I’ve come to apologize to you just because I’m well-\nmannered. In fact, I’d say you deserve this for walking so close to the puddle.” Hannah’s expression\nshifted. Then, she turned around and opened the rear door, where she said to the man inside in an\naggrieved yet coquettish manner, “ Shaun, did you hear what she said? It’s humiliating. She must\napologize to me today.”"
      }
    ]
  },
  {
    "title": "Chapter 1732 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "The car was silent for a moment before a tall and handsome figure stepped out."
      },
      {
        "paragraph": "Catherine looked up at the man standing beside Hannah. The dark blue shirt he wore was the same\none she bought him a few days ago. Back then, she thought that it looked very nice. Looking at it again\nnow, it brought out the man’s mature temperament when he wore it. However, Hannah was holding his\narm now."
      },
      {
        "paragraph": "Even though he was just acting, Catherine felt that this scene was extremely sore to the eyes."
      },
      {
        "paragraph": "“Do you think I need to apologize to her as well?” She knew that she should not have asked, but she\ndid it anyway."
      },
      {
        "paragraph": "Shaun looked down at her with bottomless eyes, remaining silent for a long time."
      },
      {
        "paragraph": "“Say something.” Hannah shook his arm. “Shaun, don’t forget that you’re pursuing me now. Don’t tell\nme you can’t let go of your ex-wife?”"
      },
      {
        "paragraph": "“You’re overthinking it,” Shaun said faintly."
      },
      {
        "paragraph": "“Then make her apologize to me. How dare she call me an ugly creature? She’s just jealous that you’re\nwith me.” Hannah snorted coldly. “If you don’t make her apologize, it means that you haven’t let g o of\nher at all.”"
      },
      {
        "paragraph": "Catherine’s eyes flashed with disgust. “Enough, don’t force him. I’ll apologize to you. I’m sorry, I\nshouldn’t have called you an ugly creature. I insulted all the ugly people in the world by saying that.”"
      },
      {
        "paragraph": "Then, she turned around and left."
      },
      {
        "paragraph": "Hannah stomped her feet in fury. “Stop right there. Apologize again!”"
      },
      {
        "paragraph": "Catherine ignored her. Her dismissive attitude completely angered Hannah. “Shaun, why didn’t you say\nanything? Who’s more important? Me or her?”"
      },
      {
        "paragraph": "Shaun raised his brows indifferently. “What do you want me to say? You suddenly got the driver to drive\nthe car over and deliberately splashed her with water. You just wanted to show off in front of"
      },
      {
        "paragraph": "her and make me humiliate my ex-wife. Sorry, but if you want me to play the role of a man who throws\nrocks at others while they’re down, I can’t do it. ”"
      },
      {
        "paragraph": "His unfathomable eyes seemed to see through everything and Hannah became a little annoyed. “ You\njust can’t bear to hurt her.”"
      },
      {
        "paragraph": "“ If that’s what you think, then there’s nothing I can do about it.”"
      },
      {
        "paragraph": "Shaun turned around and left."
      },
      {
        "paragraph": "Hannah was angry and wanted to let him leave, but when she saw his cold attitude and handsome\nback, she could not help but grab his arm. “Fine, I admit that I went too far just now. I was just jealous.”"
      },
      {
        "paragraph": "“Good girl. Don’t be jealous.” Shaun pinched her chin gently, his low and soft voice melting Hannah’s\nheart."
      },
      {
        "paragraph": "This man was like poppies. Although she knew that he was poisonous, she could not help but indulge\nin him anyway."
      },
      {
        "paragraph": "Although she could not see it, coldness flashed in the depths of Shaun’s eyes."
      },
      {
        "paragraph": "At night, after driving Hannah back."
      },
      {
        "paragraph": "Shaun got into the car that Hadley drove over."
      },
      {
        "paragraph": "Hadley said in a low voice, “There’s been news about Sonya Lyons recently. These days, she has been\nkeeping an eye on the executives who are close to Wesley. She found that one of them often goes to a\nkaraoke bar in Melbourne. He went over this afternoon and brought another person with him. It seems\nto be the Lyons family’s doctor.”"
      },
      {
        "paragraph": "“Karaoke bar?” Shaun raised his brows. “With a doctor?”"
      },
      {
        "paragraph": "“Yes.” Hadley nodded. “Didn’t Wesley have Matthew’s finger cut off? He’s getting injured over and over\nagain, so it’s normal to call a doctor in for treatment.”"
      }
    ]
  },
  {
    "title": "Chapter 1733 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun pondered for a while. “Go do a background check on that karaoke bar. Tell Sonya to keep an\neye on it for now but don’t make any rash moves for the time being.”"
      },
      {
        "paragraph": "Hadley was a little anxious. “When are we going to save Matthew? Joel almost got killed yesterday and\nit’s clear that either Jeffery or Sheryl is behind it. Unfortunately, they’re supported by Minister Mead, so\nnot even the Snow family can do anything. Currently, Wesley is at the peak of his power, and I heard\nthat Sheryl helped him solve his business problems abroad. Nowadays, the big shots and politicians in\nCanberra are all trying their best to curry favor with him.”"
      },
      {
        "paragraph": "“That’s why… he must think that he has won.”"
      },
      {
        "paragraph": "A cold smile spread on Shaun’s lips. “The more complacent a person is, the more he drops his guard\nand reveals his tail.”"
      },
      {
        "paragraph": "Hadley froze."
      },
      {
        "paragraph": "“Let him be complacent for a few more days, ” Shaun said, “We only have one chance, so we have to\nfinish him in one blow and make sure that he can never make a comeback.”"
      },
      {
        "paragraph": "Hadley’s heart stirred. “Eldest Young Master, you’re wise. Should we… tell Miss Jones about this?\nShe… She should be under a lot of pressure now.”"
      },
      {
        "paragraph": "“… No. The more Wesley forces her, the more she’ll be at a loss, which will make Wesley think that\nhe’s in control of everything. Otherwise, why do you think I’m pursuing Hannah?”"
      },
      {
        "paragraph": "Shaun placed his hands on the backrest and said with a voice devoid of warmth. “ I want him to feel\nlike he has defeated me, leaving me with no choice but to curry favor with Hannah out of desperation.\nAt the same time, I can also paralyze the Mead family.”"
      },
      {
        "paragraph": "Hadley was shocked. “You want to deal with the Mead family too?”"
      },
      {
        "paragraph": "“The Mead family helped Wesley do many things. Shouldn’t they be punished as well?” Shaun\nlaughed. “Just watch. These days, the Mead family and Wesley will bask in glory after thinking that\ntheir victory is guaranteed. What do you think they’ll do after winning?”"
      },
      {
        "paragraph": "Hadley thought about it. After he figured it out, his heart trembled."
      },
      {
        "paragraph": "Gavin Mead had been supporting Wesley for a long time. Now that Wesley had become the richest\nman in the country and overpowered Snow Corporation, which was behind Prime Minister Snow, Gavin\nwould definitely be tempted to overtake Prime Minister Snow and be the one pulling the strings of this\ncountry."
      },
      {
        "paragraph": "“Eldest Young Master Hill, you’re so wise.”"
      },
      {
        "paragraph": "Hadley sighed in admiration. He initially thought that Eldest Young Master Hill would be worse than\nbefore after losing his memory, but unexpectedly, the current Eldest Young Master Hill was wiser and\nmore decisive."
      },
      {
        "paragraph": "The next day in the hospital, Catherine turned on her mobile phone and saw that the internet was full of\nnews about the fire in Joule Corporation’s warehouse. After this incident was exposed, the internet was\nfull of negative news about Joule Corporation."
      },
      {
        "paragraph": "[Are you kidding me? I used to think that Joule Express was good. They had good service and fast\nspeed, but I didn’t expect that they couldn’t even find alcohol in the parcels. That’s too careless. I’ll\nnever use Joule again in the future.]"
      },
      {
        "paragraph": "[The president of Joule Corporation, Joel Yule, was originally an executive of Yule Corporation and\ncreated Joule Corporation from the ground up. Yule Corporation is a mess now, so how would Joule\nCorporation be any better?]"
      },
      {
        "paragraph": "[My parcel was in the warehouse where the fire broke out. It contained a watch that my friend sent to\nme from abroad and had a value of 50,000 to 60,000 dollars. I’m furious. Don’t ever use Joule’s\nservices.] Joel sat on the hospital bed as his phone rang non- stop. They were all from the company’s\nexecutives, saying that several e-commerce companies that were working with Joule Corporation were\nclamoring to cancel their cooperation."
      }
    ]
  },
  {
    "title": "Chapter 1734 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“President Yule, we had already spent some money and instructed the media. They promised us they\nwon’t make a big deal out of this matter. However, the number one news station in the country\nbroadcasted this matter last night. What should we do now?”"
      },
      {
        "paragraph": "“Now that this has happened, we’ll just apologize to the public and then release the results of the police\ninvestigation.” Joel hung up the phone. His face was already pale, but now he looked even worse."
      },
      {
        "paragraph": "At the side, the assistant said, “President Yule, the police said that the warehouse manager was bribed.\nBut until the mastermind is caught, it’s just the police’s words. Without any written proof, the public\nmight not believe it. I think that there are powerful people behind the scenes deliberately suppressing\nour company.”"
      },
      {
        "paragraph": "“Haha, you’re right.”"
      },
      {
        "paragraph": "A man’s triumphant laugh came from outside as Wesley kicked the door open and walked in."
      },
      {
        "paragraph": "Catherine and Joel’s faces instantly darkened."
      },
      {
        "paragraph": "“What are you doing here? Get the hell out.” Catherine blocked his path."
      },
      {
        "paragraph": "“I’m here to see our dad, of course.” Wesley pushed up his glasses and grinned. “Dad, do you need my\nhelp? I know many people in the media. Yesterday, they came to my house to send me a lot of gifts. In\nfact, I just need to say a few words in order to solve this matter.”"
      },
      {
        "paragraph": "Catherine snorted a laugh in anger. “My dad already suppressed this matter but it was you who made a\nbig deal out of it.”"
      },
      {
        "paragraph": "“That’s right.” Wesley looked at her approvingly and admitted it boldly. “As long as you obediently come\nback to my villa tonight, I can consider sparing Joule Corporation. This is a new company founded by\nyour father and contains all his blood, sweat, and tears— ”"
      },
      {
        "paragraph": "“Dream on!” Joel straightened up and interrupted him in anger."
      },
      {
        "paragraph": "If he had not broken his leg, he would have gotten up to hit Wesley. “Even if I lose everything today, I\nwon’t let my daughter be with a despicable villain like you. You don’t even like her. You’re obviously\ndoing this because she rejected you. You’re"
      },
      {
        "paragraph": "unhappy about it, so you want to destroy her and torture her, asking her to live like a dog in order to\nsatisfy your vanity. When people like you gain power, you’ll take revenge on everyone who had once\nhumiliated you. To put it bluntly, you’re just a pervert.”"
      },
      {
        "paragraph": "“How dare you scold me?!”"
      },
      {
        "paragraph": "Wesley’s expression changed. He laughed as he stared at Joel’s legs. “Old man, it seems like you’re\ntired of living.”"
      },
      {
        "paragraph": "He grabbed a chair and was about to throw it at Joel’s legs."
      },
      {
        "paragraph": "“Wesley Lyons, don’t you dare!” Catherine was one step faster and kicked him to the side."
      },
      {
        "paragraph": "Wesley took a few steps back as anger rushed straight to his brain. “How dare you kick me? Catherine,\ndo you think you’re still the woman under Shaun’s protection? I’ll teach you a lesson today. Guards…”"
      },
      {
        "paragraph": "At his exclaim, several tall bodyguards rushed in. “Trash this place…”"
      },
      {
        "paragraph": "“This is the Jewell family’s hospital. It’s not a place where you can cause trouble as you like.”"
      },
      {
        "paragraph": "At that moment, Chester calmly walked in while dressed in a white coat and with a stethoscope\nhanging around his neck. A thin and shallow smile hung on his face, but it only gave him a chilling look."
      },
      {
        "paragraph": "Wesley narrowed his eyes. Chester was close to Shaun and had once humiliated him as well, so he\nnever liked him. “Chester Jewell, are you going against me because of these two people?”"
      }
    ]
  },
  {
    "title": "Chapter 1735 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“If you destroy my hospital and injure our patients, I can call the police.”"
      },
      {
        "paragraph": "Chester slowly raised his eyes. “President Lyons, I know you have the Mead family backing you, so it’s\npointless to call the police, but you should know that this is a hospital with countless patients. Your\nbehavior counts as a disruption of a healthcare facility. If people in this country can’t even be\nguaranteed treatment, what do you think the outside world will think of you and how they’ll look at you?\nThis is a country with a developed network. I’m afraid nothing good will happen to you if you make a big\nfuss here.”"
      },
      {
        "paragraph": "After a pause, he said with a vague smile, “After all… although the Mead family is ambitious, they\nhaven’t become the ones in charge behind the scenes yet.”"
      },
      {
        "paragraph": "Wesley shook a little before he laughed. “Since you already know so much, you should know that you\nneed to choose to stand on the right side now. You should’ve also noticed the direction the wind is\nblowing. If you join the right side too late, it might"
      },
      {
        "paragraph": "not do you any good.” Catherine froze."
      },
      {
        "paragraph": "Wesley made no effort to conceal the ambition in his words."
      },
      {
        "paragraph": "Has he already become this rampant?"
      },
      {
        "paragraph": "“The Jewell family never takes sides,” Chester said indifferently."
      },
      {
        "paragraph": "“Really? I remember that you have quite a good relationship with Rodney.” Wesley smiled. “What’s\nmore, you stopped me today. Do you think anyone will believe you? Chester, a wise man submit to\ncircumstances. Look, even your good friend Shaun is trying to please Hannah Mead like a good dog."
      },
      {
        "paragraph": "He’s much smarter than you.”"
      },
      {
        "paragraph": "Chester’s expression changed slightly. “Wesley, as a human, one should have morals.”"
      },
      {
        "paragraph": "“Morals?” Wesley laughed maniacally. “As long as I’m powerful, what’s the point of morals?”"
      },
      {
        "paragraph": "“In that case, we have conflicting opinions. Go. As long as I’m here today, don’t even think about\ntouching these two people.” Chester’s icy face was firm."
      },
      {
        "paragraph": "“Fine, just you wait.” Wesley’s lips pulled into a sinister line as he led the people away."
      },
      {
        "paragraph": "“He’s too rampant.” Joel was simply furious. He was already in his 40s yet it was the first time he\nencountered such a person."
      },
      {
        "paragraph": "“Young Master Jewell, thank you, but…” Catherine’s expression showed her deep concern. “ From your\ntone earlier, is the Snow family in a bad situation now?”"
      },
      {
        "paragraph": "“Most of the wealthy families in the capital have defected to Wesley’s side, and you’re also aware that\nhe has Minister Mead behind him. ” Chester frowned. “When Minister Mead decided to work together\nwith Wesley, it was destined that this would not simply be a competition in the business world anymore.\nJudging from Wesley’s words, he’s not even bothering to hide his intentions anymore. I’m afraid that\nMinister Mead will soon make a move against the Snow family.”"
      },
      {
        "paragraph": "Joel’s heart trembled as he listened. “Gavin Mead is too cruel. He wouldn’t be where he is today if\nPrime Minister Snow hadn’t worked with him and helped him.”"
      },
      {
        "paragraph": "“When a person’s position rises, they’ll become dissatisfied with the status quo. What’s more, with the\ncollapse of the Hill family, Wesley’s strong and sudden rise, as well as Sheryl’s help, Minister Mead has"
      },
      {
        "paragraph": "the qualifications to make a comeback now,”"
      },
      {
        "paragraph": "Chester said worriedly, “No one knows what will happen in the future. Once Prime Minister Snow really\nbecomes a puppet, with Wesley’s despicable character, he’ll no longer be afraid of anyone. Uncle Joel,\nMs. Jones, I advise you to leave Australia as soon as possible.”"
      },
      {
        "paragraph": "Joel could not help but sigh unwillingly. “If we leave now, my company…”"
      },
      {
        "paragraph": "“Do you think you can keep your company by staying here?” Chester shook his head. “It’s useless. I’ve\nalready heard rumors that the various influential families will spare no effort to suppress Joule\nCorporation. However, where there’s life, there’s hope.”"
      },
      {
        "paragraph": "Joel was at a loss for words, and Catherine said bitterly, “It’s not that I don’t want to go, but I can’t go.\nWesley said that he won’t let my visa get approved so quickly. If he delays it by a month, maybe the\nperson in charge of the country will have changed by then.”"
      },
      {
        "paragraph": "Chester frowned. “That’s possible. The Mead family has won over many dignitaries in private, so it’ll be\neasy to delay your visa.”"
      },
      {
        "paragraph": "Catherine fell into deeper despair when she heard those words. “Actually, I’m not worried about myself.\nI’m mainly worried about the two children.”"
      }
    ]
  },
  {
    "title": "Chapter 1736 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Don’t worry. Since they’re Shaun’s children, I’ll think of a way,” Chester said grimly."
      },
      {
        "paragraph": "Joel was furious. “You’re Shaun’s friend so you’re willing to think of a way, but what about Shaun? He\nhas completely abandoned his children at a time like this.”"
      },
      {
        "paragraph": "Chester said, “Uncle Joel, don’t be angry. I’ve always felt that Shaun isn’t like other people. He should\nhave his own plan.”"
      },
      {
        "paragraph": "“He does have a plan. He’s smart, so he must have anticipated the Mead family’s thoughts before all of\nus. That’s why he went to please Hannah Mead."
      },
      {
        "paragraph": "With Hannah around, the Hill family will be safe.”"
      },
      {
        "paragraph": "Joel sneered."
      },
      {
        "paragraph": "“Dad, don’t get angry. He lost his memory, so he naturally doesn’t have much affection for us. It’s\nnormal for people to act in their own interest.” Although Catherine’s heart felt uncomfortable, she still\nforced a smile to comfort her father."
      },
      {
        "paragraph": "After Chester left, Catherine’s mood became worse."
      },
      {
        "paragraph": "If Chester had not appeared, she could not imagine how badly the situation earlier would have turned\nout."
      },
      {
        "paragraph": "She called Freya. “Freya, what are you doing?”"
      },
      {
        "paragraph": "“I’m in the villa. Cathy, I’m sorry. I heard that your dad got into an accident but I can’t go over. The\nSnow family said… that I can’t go out for now, ” Freya said in a low voice."
      },
      {
        "paragraph": "“I know, I heard.” Catherine gripped the phone. “ The Snow family— ”"
      },
      {
        "paragraph": "“Cathy, some things aren’t convenient to say on the phone.”"
      },
      {
        "paragraph": "Freya interrupted her."
      },
      {
        "paragraph": "Catherine froze. Yes, the Snow family might be being monitored now and Freya’s phone might be\nbugged. “Okay. I haven’t seen you for a long time, so I’ll go see you later.”"
      },
      {
        "paragraph": "She quickly drove to the villa where Freya lived."
      },
      {
        "paragraph": "When she got there, she saw that the place was heavily guarded."
      },
      {
        "paragraph": "She was extremely upset. Due to Shaun and Wesley, she forgot to care about her friend, Freya. When\nshe entered the villa, Freya stood in the garden wearing loose lounge clothes. Her stomach was getting\nbigger and bigger. She should be giving birth soon."
      },
      {
        "paragraph": "“Where’s Rodney?”"
      },
      {
        "paragraph": "“He went out for some matters. He’s been very busy lately.” Freya looked troubled. She did not gripe\nabout Rodney like she did in the past."
      },
      {
        "paragraph": "“Freya…” Catherine held her hand and whispered, “ Did the Snow family realize that this place is no\nlonger safe? They should send you abroad.”"
      },
      {
        "paragraph": "“I can’t leave just because I want to. The immigration bureau is filled with the Mead family’s men, so I\ncan’t leave.” Freya had a headache. “ Everyone else thinks that marrying into the Snow family is the\nsame as becoming a person who can lord over others, but danger lurks on every side here.”"
      },
      {
        "paragraph": "Catherine was shocked. “ How did Prime Minister Snow allow the Mead family to get this far?”"
      },
      {
        "paragraph": "“It couldn’t be helped. The Snow and Mead family were close partners. After my godfather came to\npower, Minister Mead received a lot of credit and many old ministers shared good relationships with\nMinister Mead from the start. My godfather was wary of him long ago, but he couldn’t get rid of Minister\nMead immediately after rising to power since it would chill people’s hearts. Hence, Minister Mead took\nadvantage of that. Coupled with Wesley’s rapid rise, many people have switched sides to the Mead\nfamily.”"
      }
    ]
  },
  {
    "title": "Chapter 1737 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Freya sighed. “Now, the only way is to get rid of Wesley because he’s the constant source of funds\nbehind the Mead family.”"
      },
      {
        "paragraph": "Catherine fell silent."
      },
      {
        "paragraph": "No one wanted to get rid of Wesley more than she did."
      },
      {
        "paragraph": "However, the problem was that Sheryl had been helping Wesley behind the scenes."
      },
      {
        "paragraph": "She really did not know what kind of bad luck she had to have such a mother."
      },
      {
        "paragraph": "“What about you guys?” Catherine became even more worried. “Gavin is going to rebel sooner or later.”"
      },
      {
        "paragraph": "“Yes, it’ll be Gavin’s birthday in three days. I heard from Rodney that he plans to do it on that day.”\nFreya’s expression was unpleasant. “The Snow family is also making arrangements. Once they lose, my\ngodfather will become Gavin’s puppet and Snow Corporation will be swallowed up by Wesley and\nGavin.”"
      },
      {
        "paragraph": "Catherine’s scalp tingled. If even Snow Corporation fell into Wesley’s hands, her two children and Joel\nwould be in danger. No one would be able to protect them."
      },
      {
        "paragraph": "“Cathy, if there’s a chance, escape on your own. ” Freya grasped her hand."
      },
      {
        "paragraph": "“What about you?” Catherine gritted her teeth. Freya was her best friend."
      },
      {
        "paragraph": "Freya was at a loss, but when she saw Catherine’s worried eyes, she assured her. “Don’t worry. The\nSnow family has a hundred-year-old foundation and won’t collapse that easily. Besides, the prime\nminister has already been elected, so Gavin will be illegitimately conferred if he harms the Snow family."
      },

      {
        "paragraph": "At most, he’ll just put us under house arrest. What’s really dangerous is the election four years later.\nWhen that time comes, he’ll get rid of us after he becomes prime minister.”"
      },
      {
        "paragraph": "Catherine froze. Thinking about it now, it was possible that this was exactly Gavin’s plan."
      },
      {
        "paragraph": "If he dared to openly kill the prime minister and ascend to power, it would definitely arouse national\ndiscontent."
      },
      {
        "paragraph": "Gavin certainly did not have the guts to do that."
      },
      {
        "paragraph": "“Forget it, it’s useless to talk about this. Even if I wanted to escape, I can’t escape now. ” Catherine\nshrugged and smiled bitterly."
      },
      {
        "paragraph": "Freya grew anxious. Catherine was in a much more dangerous situation than her."
      },
      {
        "paragraph": "However, she could not help at all."
      },
      {
        "paragraph": "After leaving Freya’s villa, Catherine went back to the Yules’ residence."
      },
      {
        "paragraph": "“Mommy, how’s Grandpa? When are you taking us to visit him?”"
      },
      {
        "paragraph": "Suzie and Lucas ran over and immediately hugged her legs."
      },
      {
        "paragraph": "Catherine squatted down and looked at her two precious children, a suffocating pain enveloping her\nheart."
      },
      {
        "paragraph": "She gave birth to them but was unable to protect them. She really felt useless."
      },
      {
        "paragraph": "“Mommy, what’s wrong?” Lucas tilted his head and looked at her. “Did Shaun bully you?”"
      },
      {
        "paragraph": "“No.” Catherine hugged them tightly, secretly vowing to protect the two children even at the cost of her\nlife."
      },
      {
        "paragraph": "Just then, her phone suddenly rang. When she saw the name ‘Eliza Robbins’ on the screen, her heart\nthumped."
      },
      {
        "paragraph": "Eliza rarely appeared on TV after she was injured by her father. Catherine heard that she had gone back\nto her hometown to recover. Besides, she was not that familiar with Eliza, so why was she suddenly\ncalling?"
      },
      {
        "paragraph": "After hesitating, Catherine still answered the call. “ Eliza, have you recovered?”"
      },
      {
        "paragraph": "“Yes, I’m fine now. I came back to Canberra yesterday.” Eliza’s voice sounded gentle. If it were in the\npast, Catherine would have invited her out to dinner, but with so many things happening recently, she\nwas not in the mood at all. “Eliza, I’m sorry. I—”"
      }
    ]
  },
  {
    "title": "Chapter 1738 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Do you need my help?” Eliza suddenly interrupted her. “The situation in the capital seems to have\nchanged. I heard that Wesley is quite powerful now.”"
      },
      {
        "paragraph": "Catherine was dumbfounded for a moment, slightly shocked."
      },
      {
        "paragraph": "She had always thought that Eliza was just an ordinary actress. How did she…"
      },
      {
        "paragraph": "“Thank you for your kindness, but you can’t help me.” She refused wryly. Even Chester was still figuring\nout what to do, so what could Eliza do?"
      },
      {
        "paragraph": "“I have a friend who has wide connections. I can ask him to find someone to bring you and your family\naway from the border even if you don’t have a visa or passport, ” Eliza said in a low voice."
      },
      {
        "paragraph": "Catherine was stunned and felt her breathing speed up due to her excitement. “Really?”"
      },
      {
        "paragraph": "“Yeah,” Eliza said, “No matter what the situation is, it’s always good to avoid potential problems.”"
      },
      {
        "paragraph": "“Eliza, how did you meet such a person? You even know so much. Who exactly are you?” Catherine was\nfilled with bewilderment. She was not that close to Eliza. They only had dinner together once."
      },
      {
        "paragraph": "After a moment of silence, Eliza said, “All you need to know is that I won’t harm you.”"
      },
      {
        "paragraph": "“Okay, I believe you.”"
      },
      {
        "paragraph": "Catherine did not hesitate as she was not left with another choice."
      },
      {
        "paragraph": "“Alright. Gavin Mead’s birthday is in three days. That night, a car will come to pick you up.”"
      },
      {
        "paragraph": "“Why does it have to be three days later?” Catherine was a little anxious. According to Freya, Gavin\nmight carry out his grand plan on his birthday. It would be like trying to escape in the middle of a storm."
      },

      {
        "paragraph": "Eliza sighed softly. “Have you not noticed that Wesley has sent people to spy on you and your family?”"
      },
      {
        "paragraph": "Catherine’s expression changed. She had thought about it before, but even when she paid attention, she\ndid not spot any suspicious people following her."
      },
      {
        "paragraph": "“He didn’t get people to tail you because he knows that you’re very vigilant. Instead, he got people to\nkeep an eye on the Yule family and your children. I’m guessing he’s also afraid that you’ll take the\nchildren with you and go into hiding.”"
      },
      {
        "paragraph": "Eliza said, “Three days later is Gavin’s birthday, and they’ll have their own plans then. Even if Eugene\ndoesn’t deploy all of his men, they’ll still let down their guard somewhat. That’ll be your chance to leave.”"
      },
      {
        "paragraph": "Catherine was completely stunned. Just who was Eliza? How did she know so much?"
      },
      {
        "paragraph": "“Okay, I’ll listen to you, but I want to leave with my two children and my father. He can’t move his legs\nnow…”"
      },
      {
        "paragraph": "“It doesn’t matter. The person will send you all the way out of the border. Don’t tell anyone about this\nmatter.”"
      },
      {
        "paragraph": "After the call ended, Catherine still could not calm down after a long time."
      },
      {
        "paragraph": "For one, she was shocked at Eliza’s contacts. She was also excited that she could take her family and\nleave safely."
      },
      {
        "paragraph": "She looked at her two children. However, she could not tell them about this yet."
      },
      {
        "paragraph": "Especially Suzie, who was a blabbermouth."
      },
      {
        "paragraph": "When she went to the hospital, she said to Joel, “ Dad, don’t worry about the company for now. Even if\nyou stay, with Wesley suppressing the company, you can’t turn the tide no matter how capable you are.”"
      },
      {
        "paragraph": "“Sigh, I know.” Joel was disheartened."
      },
      {
        "paragraph": "He had put in a lot of blood, sweat, and tears to establish Joule Corporation."
      },
      {
        "paragraph": "“Dad, when you go abroad, you can start a new company again. Staying alive is the most important thing\nnow. Do you want Wesley to threaten me with you and the children?” Catherine hated to be threatened."
      },
      {
        "paragraph": "“Alright. I can’t help you, but I know that I can’t hold you back either. ” Joel nodded. “I’ll leave the hospital\nthis afternoon.”"
      },
      {
        "paragraph": "Catherine nodded and helped him with the discharge procedures."
      }
    ]
  },
  {
    "title": "Chapter 1739 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "At night."
      },
      {
        "paragraph": "In the elegant and quiet restaurant, Shaun slowly and methodically cut the steak on his plate."
      },
      {
        "paragraph": "The gorgeous crystal lamp cast a pale light, outlining his handsome and dignified features."
      },
      {
        "paragraph": "He wore a white shirt, and his waistcoat was wrapped around his sturdy and upright figure. He looked\nhandsome and domineering like he was the noblest of all."
      },
      {
        "paragraph": "Hannah sat across him with burning eyes."
      },
      {
        "paragraph": "She had seen too many men, within the country and also abroad. However, she had never seen a man\nwho looked as good as Shaun when wearing a white shirt with a waistcoat."
      },
      {
        "paragraph": "She must have this man."
      },
      {
        "paragraph": "“Shaun…” Her fingers slowly inched  toward  his hand, and her charming voice was full of seduction.\n“Tonight… Do you want to go to my place  for a cup of coffee?”"
      },
      {
        "paragraph": "“Do you want coffee or do you want me to sleep with you?” Shaun elegantly placed a piece of steak into\nhis mouth and chewed on it, his thin lips curling into a wicked smile."
      },
      {
        "paragraph": "He said it too bluntly, but instead of getting angry from embarrassment, Hannah smiled. She grew up in a\nforeign country, so her personality was bold and unrestrained. She was not a prude at all. “ I really want\nyou to sleep with me, but I heard that you—”"
      },
      {
        "paragraph": "“I’m cured.” Shaun swallowed the steak and confidently interrupted her."
      },
      {
        "paragraph": "“Really?” Hannah’s eyes lit up. Her leg immediately crawled up his calf restlessly. “Let me try.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun’s hands holding the knife and fork stiffened as an imperceptible trace of disgust flashed across his\neyes."
      },
      {
        "paragraph": "He knew that Hannah was testing him. However, he had no reaction to her at all."
      },
      {
        "paragraph": "He tightened his grip on the knife and fork, closing his eyes. The image of Catherine bathing him\nemerged in his mind, and his throat instantly burned."
      },
      {
        "paragraph": "“Wow…” Hannah laughed in surprise. “You’re really cured.”"
      },
      {
        "paragraph": "“Can you take your foot away now?” Shaun stared at her tightly."
      },
      {
        "paragraph": "Hannah smiled smugly and got up, going around to sit down beside him. Her hands roamed up his chest.\n“You look like you’re in pain. Why don’t we… try it now? No one will dare to come in anyway.”"
      },
      {
        "paragraph": "Shaun was revolted. This woman truly made him “No.” Shaun lowered his head and grabbed her hand,\nsaying in a deep voice, “I don’t want to be casual when it comes to you.”"
      },
      {
        "paragraph": "Hannah looked at his long eyelashes and her heart raced in infatuation. She really wanted to pounce on\nhim, but since he said so, she could not act too casually either. It would make him think that she had no\nself-respect. “Then, what do you propose?”"
      },
      {
        "paragraph": "“Of course… I want to meet your parents. ” Shaun’s gaze was dark. “Otherwise, I’ll think that you’re just\ntoying with me.”"
      },
      {
        "paragraph": "“Of course not. I really love you. ” Hannah smiled and wrapped her arms around his neck. “How about\nthis? The day after tomorrow is my dad’s birthday. Why don’t you join the party? By the way, you have\ntwo children, right? Since I’ll become their stepmother sooner or later, you can bring them along as well\nso I can get to know them.”"
      },
      {
        "paragraph": "“It’s not a good idea for me to bring two children to your father’s birthday party, ” Shaun said\nexpressionlessly. “Besides, there’s no need for you to get to know them. I don’t want them anyway."
      },
      {
        "paragraph": "After we get married, we’ll have another child.” “That won’t do. I can’t let people talk about me. Don’t\nworry, I’ll be a good stepmother. ” Hannah kissed him on the cheek flirtatiously."
      }
    ]
  },
  {
    "title": "Chapter 1740 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun stared at her. “What do you want to do, Hannah? Just spit it out.”"
      },
      {
        "paragraph": "“Shaun, I want to formally introduce you to my parents on that day, but you’re skilled and my dad is\nhelping Wesley. I’m afraid that you’ll make a move on my dad on the day of the birthday party. Don’t\nworry, as long as you’re obedient, my family will definitely not hurt you or the children,”"
      },
      {
        "paragraph": "Hannah said with a smile."
      },
      {
        "paragraph": "Shaun lowered his head and smiled. “What if I refuse?”"
      },
      {
        "paragraph": "“Then I can’t let you come to my dad’s birthday party. Sorry. ” Hannah enticed him, saying, “ But Shaun,\nyou’re a smart man. You should know that my father will become prime minister sooner or later. Marrying\nme will be of great benefit to you. To be honest, I don’t like Wesley. I think you’re much better than him.”"
      },
      {
        "paragraph": "Shaun chuckled and pinched her chin. “Since you’ve said so, what else can I say?”"
      },
      {
        "paragraph": "At 10:00 p.m., after Shaun returned to Hill Manor, Hadley immediately came over. “Young Master Hill,\nI’ve checked that karaoke bar. It was invested in by a real estate big shot in Melbourne. I found out that\nthe boss was just an ordinary project manager on a construction site three years ago, but after a brief\nmeeting with Wesley, he suddenly took over two major projects and his net worth rose sharply.”"
      },
      {
        "paragraph": "“In other words, Wesley had begun to take action as early as three years ago.” Shaun tapped the desk.\n“No wonder the police and Liona couldn’t find anything despite searching for so long. There were no\nclues at all because Wesley had hidden his people there long ago.”"
      },
      {
        "paragraph": "“Yes. Who would’ve thought that Wesley stationed his men in a karaoke bar where people come and go?\nI’m guessing that there must be secret passages in it. That building was also developed by the real\nestate big shot, so it’ll be easy to hide things in there."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Hadley was a bit anxious now. “We only have two days to save him. The entire capital is jittery now.”"
      },
      {
        "paragraph": "“Do it in the early hours of the day after tomorrow. Remember, take down all the people in the karaoke\nbar without letting them alert the others. I don’t want Wesley to hear any news about what happened.”"
      },
      {
        "paragraph": "Shaun stretched his body and slowly approached the leather seat, his eyes appearing deep and gloomy.\n“After all, my goal isn’t just to take down Wesley but the entire Mead family. The Mead family’s doom was\ndestined the moment they went against Prime Minister Snow."
      },
      {
        "paragraph": "Hadley was struck by a realization."
      },
      {
        "paragraph": "Even if Wesley was gone, Gavin would have lost an arm at most. The Snow family needed to have\nenough evidence to remove the Mead family. Once the Mead family made their move during the birthday\nparty the day after tomorrow, Prime Minister Snow could take the opportunity to eradicate the people\nwho were on the same boat as the Mead family."
      },
      {
        "paragraph": "At that time, there would be a great cleansing in the capital."
      },
      {
        "paragraph": "La’Jour Karaoke Bar was the most luxurious karaoke bar in Melbourne."
      },
      {
        "paragraph": "At 3:00 a.m., there were still many youngsters singing."
      },
      {
        "paragraph": "The attendant on duty looked inside through the glass door and yawned before walking to the security\nguard at the entrance. “What time is it? Those brats are still singing.”"
      },
      {
        "paragraph": "The burly security guard threw away a cigarette and said meaningfully, “Keep your guard up.”"
      },
      {
        "paragraph": "“I know, I know.” The attendant chuckled."
      },
      {
        "paragraph": "“Hey, handsome… Can you help us get a few more drinks?” A beautiful woman with a slim figure came\nup to them, seemingly slightly drunk."
      },
      {
        "paragraph": "The attendant’s eyes brightened as he walked over to her, touching her waist with a chuckle. “Sure, you\ncan have as much as you want.”"
      },
      {
        "paragraph": "“Thanks.” The beautiful woman looked at him and giggled before suddenly pulling out an object from her\npocket, tasing him."
      }
    ]
  },
  {
    "title": "Chapter 1741 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "The security guard’s expression changed, but before he could do anything, his vision went blurry and he\nfelt a pain in the back of his head. He soon lost consciousness."
      },
      {
        "paragraph": "Before long, a group of youngsters dressed like punks walked over."
      },
      {
        "paragraph": "“Master Charlton, all the people inside have been taken care of,” a man with permed hair said with a grim\ntone. “We were fast enough, so we managed to knock them out before they could contact anyone.”"
      },
      {
        "paragraph": "“Well done.”"
      },
      {
        "paragraph": "Elle gave him an appreciative look. Who knew that an attendant in a karaoke bar would be so skilled?\nFortunately, they were able to make the people inside lower their guard by disguising themselves as a\ngroup of punks."
      },
      {
        "paragraph": "“There’s definitely something wrong with this karaoke bar, but the place is too big. We need to find the\nsecret passages or storage units before dawn. There might be enough time, so capture the manager on\nduty and interrogate him. No matter what method you use, get him to spill the truth.”"
      },
      {
        "paragraph": "“Understood.”"
      },
      {
        "paragraph": "The Liona members swiftly dragged a manager into a room. Elle stood outside and listened to the\nmiserable muffled sounds coming from inside."
      },
      {
        "paragraph": "Then, one of her men came out. “Master Charlton, he talked. There’s a secret passage in the warehouse\ndownstairs.”"
      },
      {
        "paragraph": "Elle immediately led the men to the warehouse. It was very messy there and the place was filled with all\nkinds of alcohol and snacks, as well as abandoned sofas, coffee tables, and the like. There was a thick"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "layer of dust blanketing the place."
      },
      {
        "paragraph": "One of her subordinates sighed. “Thank God we interrogated him. No one would think it’s in a place like\nthis.”"
      },
      {
        "paragraph": "“Yes.” Elle had to admire Wesley’s caution. The place was too messy and seemed like no one would\ncome here. However, there was actually a hidden passage here."
      },
      {
        "paragraph": "She found a dial inside the bottom drawer of a cabinet. After turning it, the cabinet moved to the side and\nrevealed a very thick door."
      },
      {
        "paragraph": "She pushed it open, revealing a dark tunnel inside."
      },
      {
        "paragraph": "She used her phone’s flashlight and walked in. After about ten meters, a dim light finally appeared inside.\nShe carefully walked in to see a square cage about ten square meters large. Inside the cage, there was\na man who gave off a strong odor. Two of the man’s fingers had been chopped off, and there was also a\nlong chain wrapped around his arms."
      },
      {
        "paragraph": "Those who did not know might think that he was a feral man."
      },
      {
        "paragraph": "Elle was stunned. Wesley was simply inhumane. Even Liona was not that cruel in the past. A normal\nperson would go crazy if he were tortured like this."
      },
      {
        "paragraph": "She apprehensively used the light to shine on the man’s head. “Are you… Matthew Costner?”"
      },
      {
        "paragraph": "The chain suddenly moved as the man strained to lift his head. Beneath his rough and messy hair, his\nblue eyes revealed a deep and refined light after a brief moment of cloudy confusion."
      },
      {
        "paragraph": "“Who are you?” he spoke weakly, straining to open his eyes and look at the woman in front of him. She\nwas dressed in leather and had heavy makeup on. She had an afro as well."
      },
      {
        "paragraph": "He had been locked here for a long time, but this was the first time he saw a woman like that."
      },
      {
        "paragraph": "Elle sighed in relief. Fortunately, he had not gone crazy. It would be troublesome if he had. “My name is\nElle Charlton. Eldest Young Master Hill sent me to save you.”"
      },
      {
        "paragraph": "“Eldest Young Master Hill…”"
      },
      {
        "paragraph": "Matthew’s deep blue eyes flashed with consternation and bitterness."
      },
      {
        "paragraph": "He had been living in hell these days. He thought the person who came to save him would be his father\nor mother, but he never thought it would be Shaun."
      },
      {
        "paragraph": "He had never liked Shaun much."
      },
      {
        "paragraph": "“You’re hurt badly. I’ll bring you away. ” Elle took out a steel wire and swiftly unlocked the locks on the\ncage and his hands."
      },
      {
        "paragraph": "“Beautiful lady, I didn’t expect that… you’d be a master lock picker too.” Matthew let out a low laugh."
      }
    ]
  },
  {
    "title": "Chapter 1742 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“How can you still laugh?” Elle was a little speechless. An ordinary person would have gone crazy."
      },
      {
        "paragraph": "“What should I do instead? Cry? Men… aren’t allowed to cry.” Matthew’s dry lips were pulled into a grin\nwith much difficulty. Seeing him about to faint, Elle forcefully shook him."
      },
      {
        "paragraph": "“You can’t faint now. You have to go back to Canberra with me. Your mother is almost insane. She’s\nhelping Wesley, Jeffery, and Jeffrey’s wife to g o against Miss Jones and Eldest Young Master Hill. Now,\nWesley’s power is as strong as could be. He intends to make a move against Prime Minister Snow with\nGavin Mead tonight. Once Prime Minister Snow becomes a puppet, he’ll definitely torture Miss Jones to\ndeath. She’s your sister.”"
      },
      {
        "paragraph": "“W- What? ” Matthew could not keep up and was stunned when he heard her words. “My mom… Why\ndid she…”"
      },
      {
        "paragraph": "“Your mother has been brainwashed by Jeffery. You have to stop her. You’re our only hope now.”"
      },
      {
        "paragraph": "Elle hurriedly had the others carry Matthew on a stretcher and put him in a private plane before dawn\nbroke."
      },
      {
        "paragraph": "In Canberra."
      },
      {
        "paragraph": "In the presidential suite of a five-star hotel."
      },
      {
        "paragraph": "The waiter brought up plates of hearty breakfast. Sheryl sat in a chair and looked at the breakfast, but\nshe had no appetite at all."
      },
      {
        "paragraph": "“Sherry, this is the birthday invitation sent over by Minister Mead. Today is his birthday. Do you want to\ngo over for a while?” Jeffery put the invitation in front of her."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Sheryl glanced at it and said in annoyance, “He’s just a small minister. I’m not going.”"
      },
      {
        "paragraph": "“You don’t know this but Minister Mead is quite powerful in Australia now. We have to go,” Jeffery said\nwith a wry smile, “If the company wants to grow, we’ll need to have a good relationship with these\npeople.”"
      },
      {
        "paragraph": "“Then you go. I never had the intention of managing the company anyway.” Sheryl waved her hand.\n“Jeffery, go to the company. Don’t stay with me here.”"
      },
      {
        "paragraph": "“I’m just worried that you won’t eat breakfast. Look at how thin you’ve gotten recently. I have to see you\neat before I leave.”"
      },
      {
        "paragraph": "Jeffery showed a look of concern."
      },
      {
        "paragraph": "Sheryl’s heart warmed slightly. When she thought of her son’s disappearance and her husband’s\nbetrayal, the only people around her who seemed to care about her were her brother and sister-in-law."
      },
      {
        "paragraph": "She forced herself to eat a few bites before persuading Jeffery to leave."
      },
      {
        "paragraph": "When she was about to return to rest, the doorbell outside suddenly rang."
      },
      {
        "paragraph": "The assistant answered the door and said to Sheryl awkwardly, “President Jones, Mr. Costner is here.”"
      },
      {
        "paragraph": "Sheryl’s expression changed and she stood up. However, she suddenly felt dizzy."
      },
      {
        "paragraph": "“Be careful, Sherry.” Titus hurriedly rushed forward to hold her but was stopped by the bodyguard."
      },
      {
        "paragraph": "“Titus Costner, how dare you appear in front of me?! ” Sheryl turned around and glared at him coldly after\nshe regained her balance. “Actually, this is good. We can settle our accounts today. Since you’re here,\ndon’t even think about going back intact.”"
      },
      {
        "paragraph": "When Titus saw her looking at him with eyes full of hatred, he felt a pang of pain in his heart. “Sure, I’ll do\nwhatever you want. Can you close the door first? I have something important to tell you. You wouldn’t\nwant to argue and have the entire hotel know about it, right?”"
      },
      {
        "paragraph": "Sheryl hesitated for a moment, and the attendant who followed Titus in suddenly closed the door of the\nsuite."
      },
      {
        "paragraph": "Then, the attendant lifted the wig on his head, revealing a slim and miserable-looking face. “ Mom, it’s\nme…”"
      },
      {
        "paragraph": "“Matt…”"
      }
    ]
  },
  {
    "title": "Chapter 1743 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Matt…”"
      },
      {
        "paragraph": "Sheryl was shocked and rushed over. If she were not seeing it with her own eyes, she would not believe\nthat her handsome son had really become like this. His face was sallow and bony. She quickly grabbed\nhis arm, but he immediately trembled in pain."
      },
      {
        "paragraph": "“Matt, what happened to you?” Sheryl was overwhelmed. When she looked down, she saw that two\nfingers were missing from his hand. Her pupils shook violently as she almost went mad. “Where are your\nfingers? Who cut them off? Was it you, Titus?”"
      },
      {
        "paragraph": "She pushed Titus in fury. Titus’ face showed disbelief."
      },
      {
        "paragraph": "Matthew hurriedly stopped Sheryl. “Mom, it wasn’t Dad. It was Wesley who captured me and cut off my\nfingers to threaten Dad.”"
      },
      {
        "paragraph": "“Wesley?” Sheryl was stunned. Her head hurt so much that she did not dare to think too deeply. “ That’s\nimpossible.”"
      },
      {
        "paragraph": "“Why is it impossible? Wesley, Rebecca, Jeffery,"
      },
      {
        "paragraph": "and Jeffery’s wife are all in it together. Do you know why your health is so bad? It’s because Rebecca\ndrugged your food previously.” Titus could not hold back his low roar."
      },
      {
        "paragraph": "“Shut your mouth! That’s impossible.” Sheryl interrupted him hysterically with reddened eyes. “ I’m\nperfectly normal. It’s because you gave me drugs that I turned out like this.”"
      },
      {
        "paragraph": "Titus was deeply dismayed. He felt a burst of powerlessness."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "When Matthew saw Sheryl’s sharp and unreasonable expression. There were complicated emotions in\nhis heart. He never expected that his family would end up like this during the time he was locked up."
      },
      {
        "paragraph": "“Mom, Dad’s telling the truth.”"
      },
      {
        "paragraph": "He grabbed Sheryl’s arm. “I’m your son, your biological son. Don’t you believe me? Look at my fingers.\nThey were chopped off by Wesley Lyons himself. I watched him chop them off with my own eyes. Do you\nknow why he captured me? It’s because I suspected Rebecca, so I went to Melbourne and re-\ninvestigated her past. Over there, I discovered that we were all lied to."
      },
      {
        "paragraph": "“Yes, Rebecca was abducted back then but after she was brought back by the Jones family, Jeffery and\nhis wife were very good to her and even drove Catherine out of the house. Rebecca also deliberately\nstole Catherine’s ex-boyfriend, Ethan Lowe. But after Ethan got struck by misfortune, Rebecca looked\ndown on him and immediately kicked him away. Then, she found another young man from a wealthy\nfamily but when she dated him, she slept around with other men too. Her reputation in Melbourne’s\nupper class circle is terrible."
      },
      {
        "paragraph": "“Jefferey and his wife deserved to go to jail. They weren’t framed by Catherine at all. They really did kill\nGrandma, so they were arrested by the police."
      },
      {
        "paragraph": "“Mom, Rebecca isn’t your daughter. She’s Jeffery Jones and Sally Lennon’s daughter. Your daughter i s\nCatherine."
      },
      {
        "paragraph": "“When I was caught by Wesley, I heard it from him. He went to Neah Bay a few years ago and saw you.\nHe started to suspect your identity when he saw that you looked so similar to Catherine. Then, he"
      },
      {
        "paragraph": "secretly investigated you. He wanted to marry Catherine and then bring her to find you, her mother. That\nway, he could become your son-in- law."
      },
      {
        "paragraph": "“However, Catherine didn’t like him at all, so he simply tricked Catherine into marrying him and took\nadvantage of the time they lived together after their wedding to take her hair and give it to Catherine’s\nsworn enemy, Rebecca. Rebecca took her hair and went to Neah Bay, where she deliberately dangled\nherself in front of me to catch my attention.”"
      },
      {
        "paragraph": "Matthew fell into deep remorse and pain. “It’s all m y fault. Back then, when I let the attendant take\nRebecca’s hair for the DNA test, Rebecca had put Catherine’s hair on her comb and her pillow. Hence,\nthe DNA test showed that you’re her biological daughter.”"
      },
      {
        "paragraph": "“No, that can’t be.”"
      },
      {
        "paragraph": "Sheryl covered her head, almost going crazy."
      },
      {
        "paragraph": "Rebecca was not her daughter? Her daughter was Catherine?"
      }
    ]
  },
  {
    "title": "Chapter 1744 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "What had she done to her biological daughter? She beat her up and called her a b*tch."
      },
      {
        "paragraph": "She also ruined Hill Corporation and allowed Rebecca to kidnap her granddaughter."
      },
      {
        "paragraph": "She even avenged Rebecca’s death."
      },
      {
        "paragraph": "“Mom, think about it. You used to be so calm and intelligent. Why did you become more and more\nsuspicious recently? You even started to quarrel with Dad all the time despite seldom quarreling with him\nbefore. It’s because Rebecca drugged your meals previously. Do you know why she drugged you? It’s\nbecause you said that Melbourne brought you a sense of familiarity when we arrived and you started to\nrecall some of your memories. She was afraid that if you recovered your memory, you’d remember that\nyou gave your daughter the name Catherine, so she used a drug to prevent you from recovering.\nHowever, the drug has heavy side effects.”"
      },
      {
        "paragraph": "The more Sheryl listened, the more frightened she was."
      },
      {
        "paragraph": "She seemed to have vague recollections of what Matthew said but was unable to clearly grasp those\nmoments."
      },
      {
        "paragraph": "She felt that her memory was very poor lately and she had forgotten many details."
      },
      {
        "paragraph": "She only remembered that Titus had betrayed her. She remembered that Titus fell in love with Catherine."
      },
      {
        "paragraph": "He hated that she was old and past her prime."
      },
      {
        "paragraph": "Those thoughts made her crazier and crazier. Sometimes, she even wanted to kill Catherine and Titus."
      },
      {
        "paragraph": "Suddenly, she felt her body shudder. She clutched her head hard."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Mom, when Jeffery and his wife were locked up in"
      },
      {
        "paragraph": "prison, Wesley must have visited them. They already started colluding back then.”"
      },
      {
        "paragraph": "Matthew held Sheryl. “Dad suppressed Wesley’s company abroad, but you helped him again. Jeffery and\nWesley are in cahoots, and now, Hill Corporation and Golden Corporation are both in Wesley’s hands.\nHe’s working together with Gavin Mead and they plan to make a move against Prime Minister Snow\ntonight. When that happens, he’ll"
      },
      {
        "paragraph": "take control of the country. Dealing with Catherine will be as easy as dealing with an ant when that time\ncomes. He’ll use your grandchildren to torture Catherine. Right now, only you can solve this problem.”"
      },
      {
        "paragraph": "“That’s right,” Titus quickly said, “As long as you no longer oppose me and we stop Golden Corporation’s\nexpansion and development abroad, Wesley will lose an arm. Currently, the relevant certificates for the\ndistribution of Hill Corporation’s shares haven’t been completed yet. You can cancel the shares\ndistributed to Jeffery. If you do that, Wesley won’t be able to do anything.”"
      },
      {
        "paragraph": "“Is… that true?” Sheryl looked at them blankly."
      },
      {
        "paragraph": "She could not believe it. All this time, she had been in the middle of Jeffery and Sally’s scam."
      },
      {
        "paragraph": "She could not accept that she had hurt her daughter like that."
      },
      {
        "paragraph": "How could she face Catherine again?"
      },
      {
        "paragraph": "“Mom, why would I lie to you? Wouldn’t I know who cut off my fingers?” Matthew could not help but roar\nas his eyes reddened. “Do you know what I went through? I was locked in a dark cage, and all I had to\neat was stale bread and dirty water. I lived like a dog every day. Wesley rarely came, but every time he\ndid, he punched and kicked me. Look at the injuries on my body…” He took off his clothes, revealing\nbruises all over his body. There were even traces of cigarette burns."
      }
    ]
  },
  {
    "title": "Chapter 1745 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Wesley is a pervert. He’s a devil! He wants to be someone who can lord over others, so the nobler my\nstatus, the more satisfying it is for him when he tramples on me and humiliates me. He said that you’re\nall stupid idiots who are dancing in the palm of his hand. Sooner or later, he’ll become the"
      },
      {
        "paragraph": "richest person in the world. He wants to make the Costner family and Soromon Island yield to his feet.”"
      },
      {
        "paragraph": "Matthew’s body trembled unbearably."
      },
      {
        "paragraph": "Since he was a child, he had never suffered such humiliation."
      },
      {
        "paragraph": "If it were not for his strong endurance, he would not have lasted until now."
      },
      {
        "paragraph": "Sheryl’s pupils contracted sharply."
      },
      {
        "paragraph": "This was her son. Although she was strict with him when she was raising him, she would just hit the back\nof his hand at most whenever he was naughty."
      },
      {
        "paragraph": "However, he was actually hurt to this extent now. Sheryl almost lost her footing."
      },
      {
        "paragraph": "These years, she had been in a high position and thought that everything was in her hands."
      },
      {
        "paragraph": "She suddenly realized that she was a fool. She was so foolish that she could not even protect her own\nson and daughter. She even became an accomplice and hurt them so badly."
      },
      {
        "paragraph": "At that moment, rage filled Sheryl’s chest. She wanted nothing more than to kill Jeffery and Wesley."
      },
      {
        "paragraph": "“Sherry, call your subordinates.” Titus held her shoulders tightly. “But don’t startle the enemy. Wesley will\nmake a move tonight, but if he knows that his business abroad has gone wrong, he’ll suspend his plan to\nescape. What the Snow family needs is evidence that the Mead and Lyons families intend to rebel.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Okay, I’ll make the call right away.” Rebecca trembled as she took out her phone and called her most\nloyal secretary abroad. “Contact the other countries and send word to cancel the cooperation with\nGolden Corporation. Do this in secret and don’t alert the enemy before tonight.”"
      },
      {
        "paragraph": "After hanging up the phone, her mind was still blank."
      },
      {
        "paragraph": "After a long time, she looked at Titus in a dazed and confused manner. Her thin lips moved as she asked\nin a trembling voice, “ Is she… really my daughter?”"
      },
      {
        "paragraph": "Titus nodded. “When you were in the hospital,  I took her child’s hair and your hair back to Neah Bay for\na DNA test. You’re definitely the child’s grandmother, so Catherine is your daughter. When Joel Yule\naccepted her back into the Yule family,  they had also done a DNA test. Sherry, when I first saw her, it\nwas like seeing you when you were younger. She’s related to you by blood, so how would I have\ninappropriate thoughts about her?"
      },
      {
        "paragraph": "From start to finish, the woman I love has always been you.”"
      },
      {
        "paragraph": "“That’s right, ” Matthew could not help but add, “ Don’t you know Dad’s feelings for you by now?  If you\nwere gone, it’d be normal for him to find a substitute  who looks like you, but you’re still around, so how\ncould he have fallen in love with someone else?”"
      },
      {
        "paragraph": "“I’m sorry. I’m sorry. ” Sheryl burst into tears. “ I don’t know what happened to me. There were all sorts of\nhallucinations in my head. I thought that I’ve become old and you hated me. I thought you fell in love with\na woman younger than me. I even hurt her. How is it possible that she would have such vile and\ndisgusting thoughts? She’s my daughter! ”"
      },
      {
        "paragraph": "After her heart-wrenching wail, her vision went black and she could not hold on any longer. She fainted."
      },
      {
        "paragraph": "“Mom…” Matthew got a fright."
      },
      {
        "paragraph": "Her assistant quickly said, “The madam has been having headaches recently. I wanted her to go to the\nhospital, but she refused.”"
      },
      {
        "paragraph": "“Take her to the hospital. Matthew and I can’t reveal ourselves for the time being. There are Wesley’s\npeople secretly watching outside. We can’t let him know that Sheryl already knows the truth.” Titus\nreluctantly pushed Sheryl into her assistant’s arms."
      },
      {
        "paragraph": "Several bodyguards immediately sent Sheryl to the hospital."
      },
      {
        "paragraph": "Matthew was anxious. “Dad, I’ll make Wesley suffer a fate worse than death. Mom used to be in such\ngood health but she was tortured to this state.”"
      },
      {
        "paragraph": "“Yes.” The bottom of Titus’ eyes was filled with murderous hostility."
      },
      {
        "paragraph": "In the Yule family’s villa."
      }
    ]
  },
  {
    "title": "Chapter 1746 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "In the bedroom, Catherine put the clothes in the suitcase while Suzie swung her little legs by the side.\n“Mommy, why are you suddenly packing? Are we going on a trip?”"
      },
      {
        "paragraph": "At the side, Lucas threw her a cold look. “It’s so nice to be simple-minded.”"
      },
      {
        "paragraph": "“Why do I feel like you’re criticizing me?” Suzie put her hands on her small waist."
      },
      {
        "paragraph": "“Nope, you’re overthinking.” Lucas turned his face away."
      },
      {
        "paragraph": "“Miss, Young Master Hill is here.”"
      },
      {
        "paragraph": "There was a sudden knock on the door outside."
      },
      {
        "paragraph": "Catherine was dazed for a few seconds. Before she could get up, Lucas and Suzie were quicker than\nher and went out first."
      },
      {
        "paragraph": "Shaun stood in the living room downstairs, dressed in an expensive claret red tailored suit. The suit had\nbeen ironed meticulously without any wrinkles, and with his hands in his trouser pockets, his aura looked\ncold and cheerless."
      },
      {
        "paragraph": "Lucas ran downstairs and stared at him warily. “ What are you doing here?”"
      },
      {
        "paragraph": "Suzie also stood beside Lucas and crossed her hands across her chest. “I won’t go back with you, but if\nyou’re here to deliver candy, just put it at the side and leave.”"
      },
      {
        "paragraph": "Lucas, “…”"
      },
      {
        "paragraph": "Who was it who said that she did not want to eat candy anymore after being kidnapped last time?"
      },
      {
        "paragraph": "Sure enough, a leopard could not change its spots."
      },

      {
        "paragraph": "Shaun looked at the two lovely children and a warm current surged through his heart."
      },
      {
        "paragraph": "Footsteps came from upstairs, and he looked up to see Catherine wearing pink lounge clothes. Her black\nhair was casually draped over her shoulders. With her beautiful and charming face, it did seem as if she\nhad given birth to children before."
      },
      {
        "paragraph": "“Eldest Young Master Hill, do you need something?” She looked at him coldly."
      },
      {
        "paragraph": "They were standing so close to each other, but the distance  between  them was like heaven  and earth."
      },
      {
        "paragraph": "Shaun’s heart flooded with a stifling pain, but he told himself that everything would be over soon. “"
      },
      {
        "paragraph": "Cathy, I want to bring the children out to play tonight.”"
      },
      {
        "paragraph": "“No.”"
      },
      {
        "paragraph": "Catherine’s expression changed. She wanted to leave with the children tonight. How could she let him\ntake them away?"
      },
      {
        "paragraph": "“Cathy, they’re also my children. Don’t I have the right as their father to bring them out to play?” Shaun\nlooked at her pleadingly."
      },
      {
        "paragraph": "“ If you really wanted to fulfill your fatherly duty, why did you only come today?” Catherine slowly\ndescended the stairs and met his gaze with clear, cold eyes. “Shaun, you might not have recovered your\nmemory, but you still know that the children are yours. Have you visited them and accompanied them\nthese days?”"
      },
      {
        "paragraph": "“Yeah, you never fulfilled your fatherly duty at all.” Lucas snorted. “We’re not at your beck and call.”"
      },
      {
        "paragraph": "Shaun’s handsome face flushed with embarrassment and remorse. “Cathy, I have to bring them away\ntonight.”"
      },
      {
        "paragraph": "“Where are you taking them?” Catherine was not a fool. As she thought about it, she instantly seemed to\nunderstand something but it only made her furious. “Today is Minister Mead’s birthday. Don’t tell me\nyou’re taking my children to his birthday party.”"
      },
      {
        "paragraph": "Shaun let out a low hum, making Catherine so angry that she gave him a slap across his face."
      },
      {
        "paragraph": "“Listen here, Shaun Hill. I don’t care why you approached Hannah Mead, but I won’t put my children in\nany danger. Go ahead if you want to please the Mead family and earn their trust, but I won’t let the\nchildren go.” Catherine’s body trembled with anger."
      }
    ]
  },
  {
    "title": "Chapter 1747 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Shaun accepted the slap without flinching. “I’m sorry, Cathy. If I don’t bring the children with me tonight,\nthe Mead family won’t let me through the door. Don’t worry, I’ll protect the children.”"
      },
      {
        "paragraph": "“How will you protect them?” Catherine laughed in anger. “Why do they want you to bring the children?\nThey want to threaten you with the children because they’re afraid you’ll cause trouble at the banquet?\nShaun, you might not know what’s happening, but they’re planning to rebel at today’s banquet.”"
      },
      {
        "paragraph": "“So… you already know.”"
      },
      {
        "paragraph": "Shaun gave her a deep look. “Cathy, I won’t hide it from you. The Snow family and I have plans for\ntonight. Also… I’ve rescued Matthew Costner.”"
      },
      {
        "paragraph": "Catherine’s eyes widened. She was clearly in disbelief. “How did you do it?”"
      },
      {
        "paragraph": "“Sonya Lyons.” His thin lips spat out two words and Catherine understood everything."
      },
      {
        "paragraph": "“Shaun, I underestimated you before.”"
      },
      {
        "paragraph": "She sighed emotionally. She thought that after he lost his memory, he would not be able to compare to\nhis past self anymore."
      },
      {
        "paragraph": "Unexpectedly, he was smarter and more decisive than before."
      },
      {
        "paragraph": "Even though he was standing in front of her, she realized that she could not see through him at all."
      },
      {
        "paragraph": "“Shaun, have you… recovered your memory?” A flash of bewilderment was seen in her eyes."
      },
      {
        "paragraph": "“I’m sorry, I haven’t.” He had not…"
      },
      {
        "paragraph": "Catherine’s lips curled in mockery. What was she hoping for?"
      },

      {
        "paragraph": "“Why didn’t you tell me anything about your plan?” She tilted her head and looked at him."
      },
      {
        "paragraph": "“I didn’t want to put too much pressure on you, and I needed you to numb Wesley. ” Shaun looked at her\nwith a hint of guilt. “After I learned about your entanglement with Wesley, I understood that he’s\npossessive of you. He has victory in his grasp and thinks that the whole country is under his control now.\nIt makes sense that he’ll look for contentment from you. The more afraid you are, the more complacent\nhe becomes. The more desperate you"
      },
      {
        "paragraph": "are, the happier he’ll be. This will let him drop his guard.”"
      },
      {
        "paragraph": "“You *sshole.”"
      },
      {
        "paragraph": "Catherine was furious and slapped him again."
      },
      {
        "paragraph": "The slap this time was very heavy, and a red slap print was left on his handsome face."
      },
      {
        "paragraph": "Shaun did not move or get angry. “It’s been proven that my plan so far is successful. Wesley has held\nhimself back for too long. His heart is dark, and if he’s humiliated, he’d think about it every moment of the\nday. When he gains power, he would retaliate against those who once humiliated him. He’s incredibly\narrogant now, and the powerful people in the capital are all desperately trying to curry favor with him. On\none hand, he’s humiliating those dignitaries, and on the other hand, he’s pleased as punch. Oh, of\ncourse, what he finds most satisfying is seeing me fawning over Hannah Mead like a dog. ”"
      },
      {
        "paragraph": "Catherine was slightly stunned. Her mood was so complex that she did not know what to say."
      },
      {
        "paragraph": "“Cathy, trust me. I’ve saved Matthew and sent him back to Titus. Titus already brought him to look for\nSheryl. Sheryl knows the truth now. Titus and she have informed their people abroad to secretly destroy\nGolden Corporation’s business. Although they plan to rebel at tonight’s banquet, it’s also a banquet that\nwill let Gavin and Wesley show their true colors. Tonight is the only chance to catch them.”"
      },
      {
        "paragraph": "Shaun gently pressed his arm against her. “After today, Wesley will get his due retribution.”"
      },
      {
        "paragraph": "Catherine’s mind was in chaos."
      },
      {
        "paragraph": "She was going to leave tonight with her children and Joel. She had already packed everything. “Will this\nplan succeed?”"
      },
      {
        "paragraph": "“Yes, it definitely will. ” Shaun’s eyes were deep. “ With me around, I won’t let him escape.”"
      },
      {
        "paragraph": "“But the children…”"
      },
      {
        "paragraph": "“Mom, let me go,” Lucas, who had been standing on the side, suddenly said, “Suzie can stay. I’ve been\nlearning martial arts these days and Uncle Brennan also said that I’m very strong. I can protect myself.\nMoreover, since I’m small, many people at the banquet will definitely overlook me. I’ll be able to catch\nthem off guard.”"
      },
      {
        "paragraph": "“Alright. Lucas, you’re a brave boy.”"
      },
      {
        "paragraph": "Shaun squatted down and patted him on the shoulder. “I believe in you.”"
      },
      {
        "paragraph": "Lucas pouted. “I’m doing this for Mommy. I want Mommy to hurry up and divorce Wesley. I don’t want\npeople to keep calling her Wesley’s wife.”"
      }
    ]
  },
  {
    "title": "Chapter 1748 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine’s throat was feeling tight. She looked down at Lucas. “Lucas, it’ll be dangerous tonight. Are\nyou sure?”"
      },
      {
        "paragraph": "“I’m not scared, Mommy. I don’t want to hide behind you all the time. It’ll make me look useless,” Lucas\nsaid seriously."
      },
      {
        "paragraph": "Catherine smiled bitterly. She really did not want the children to give themselves too much pressure, but\nLucas was determined. She was helpless."
      },
      {
        "paragraph": "“Cathy, I promise you with my life. I’ll ensure Lucas ‘ safety.”"
      },
      {
        "paragraph": "Shaun swore solemnly."
      },
      {
        "paragraph": "Catherine’s mind was in turmoil. “Will the Mead family agree if you only bring one of them?”"
      },
      {
        "paragraph": "“Hannah hasn’t gotten me yet, so she’ll speak up for me.” A mocking smile appeared on Shaun’s face."
      },
      {
        "paragraph": "Catherine was slightly speechless."
      },
      {
        "paragraph": "However, when she looked at his handsome face, she could somewhat understand Hannah’s thoughts."
      },
      {
        "paragraph": "Shaun had rejected Hanah before, and she was unhappy that she could not obtain him. Moreover,\nShaun really was the cream of the crop. After all, he was once the richest man in the country. Any\nwoman would want to conquer him."
      },
      {
        "paragraph": "She stopped paying attention to him and lowered her head to hug Lucas. “Promise me this. No matter\nwhat happens, your safety is the most important.”"
      },
      {
        "paragraph": "“Okay. Don’t worry, Mommy.”"
      },

      {
        "paragraph": "Lucas kissed her and turned around to give Shaun a side glance. “Let’s go.”"
      },
      {
        "paragraph": "Shaun did not move. He looked at Catherine a little unnaturally. “Cathy, do you have anything to say to\nme?”"
      },
      {
        "paragraph": "“Like what?” Catherine’s face was indifferent as she pretended not to see the expectant light in his eyes."
      },
      {
        "paragraph": "Shaun, “…”"
      },
      {
        "paragraph": "“Your safety is not that important to my mom.” Lucas stabbed him coolly."
      },
      {
        "paragraph": "Shaun gritted his teeth. Forget it. After he finished solving the matter at hand, he would pursue her again."
      },
      {
        "paragraph": "After they left, Catherine dialed Eliza’s phone number. “I’m sorry. I… can’t leave tonight…”"
      },
      {
        "paragraph": "Even-ing, 6:3o p.m."
      },
      {
        "paragraph": "Outside the manor, there were rows of luxurious but low-key cars parked."
      },
      {
        "paragraph": "Shaun parked the car and opened the passenger door. Lucas jumped out from inside while dressed in a\nhandsome little suit."
      },
      {
        "paragraph": "“Darling, you’re here.” Hannah walked over in a long blue dress, looking elegant and dignified."
      },
      {
        "paragraph": "When she saw Lucas, a dark glint of displeasure flashed in the depths of her eyes."
      },
      {
        "paragraph": "This was her first time seeing Shaun’s son. He looked so much like Catherine."
      },
      {
        "paragraph": "She was deeply revolted."
      },
      {
        "paragraph": "However, it did not matter. As long as she was around, this child’s life would not be easy in the future."
      },
      {
        "paragraph": "“Why did you only bring one? Aren’t they twins?” Hannah held Shaun’s arm and said unhappily, “I told\nmy parents that you’ll bring a son and a daughter over.”"
      }
    ]
  },
  {
    "title": "Chapter 1749 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Do you think I didn’t want to? Catherine refused. I even argued with her.” Shaun looked at Hannah\nmeaningfully. “Besides, is a daughter or a son more important?”"
      },
      {
        "paragraph": "“You’re right. ” Hannah immediately understood. The richer people were, the more they valued sons."
      },
      {
        "paragraph": "Since Shaun had brought his son here, it was clear that he was putting his heart into expressing his\nloyalty to the Mead family."
      },
      {
        "paragraph": "She bent down and looked at Lucas. “What’s your name?”"
      },
      {
        "paragraph": "“Lucas Jones,” he said expressionlessly."
      },
      {
        "paragraph": "“What a good boy.” Hannah grinned. “How about I be your stepmother in the future? Don’t worry, I’ll treat\nyou well.”"
      },
      {
        "paragraph": "Lucas was shocked by this woman’s shamelessness."
      },
      {
        "paragraph": "“I think he’s overjoyed to hear that, ” Shaun rubbed Lucas’ head and said with a doting face."
      },
      {
        "paragraph": "Lucas, “..”"
      },
      {
        "paragraph": "This man was also quite shameless."
      },
      {
        "paragraph": "“I’ll bring you guys in.” Hannah held Shaun’s hand and walked inside. “There are many guests tonight.\nPrime Minister Snow’s family is here too, as well as Wesley… You won’t mind, right?”"
      },
      {
        "paragraph": "She stole a glance at Shaun and said helplessly, “My dad trusts Wesley a lot. You’d better avoid Wesley\nlater.”"
      },

      {
        "paragraph": "“I know.” Shaun nodded and smiled mockingly. “I don’t remember much about the past, but the winner\nmakes the rules while the losers live by them. I’m willing to gamble.”"
      },
      {
        "paragraph": "“Look at how sensible you are now. You were too stubborn before. ” Hannah grinned. “Back then, I was\nthe one who pursued you but you didn’t like me. If you had gotten together with me back then, you’d be\nmy dad’s favorite now. Wesley wouldn’t even be in the picture.”"
      },
      {
        "paragraph": "Shaun smiled without saying anything."
      },
      {
        "paragraph": "After entering the banquet hall, he was amazed by the luxurious scene inside."
      },
      {
        "paragraph": "It was a buffet, but every dish was incredibly expensive. Each dish was worth a house, and some of the\nsnacks were even more expensive than diamonds."
      },
      {
        "paragraph": "A female guest on the side held a plate of chocolate cake and said emotionally, “This cake is so\ndelicious. I’ve never had such a delicious cake before.”"
      },
      {
        "paragraph": "The waiter said, “These desserts were all handmade by the top patissiers in Country Y, and the\ningredients used, from chocolate to caviar, are all top quality. This Fortress Stilt Fisherman Indulgence\nalso uses the best cream from the country of Aller. They’re all fresh ingredients that were flown in this\nmorning.”"
      },
      {
        "paragraph": "“I see. It seems like I’ll be able to enjoy some delicacies thanks to Minister Mead tonight.”"
      },
      {
        "paragraph": "The guests all ate extremely happily and had a new perception of the Mead family’s status."
      },
      {
        "paragraph": "Hannah also said to Shaun proudly, “My dad invited the world-famous chef, Charles. Most of the dishes\ntonight were prepared by him. You definitely haven’t tried them before, so I’ll let you try them now.”"
      },
      {
        "paragraph": "“Wait.” Shaun held her hand. “Since I’m here, I should go and congratulate your father first."
      },
      {
        "paragraph": "Otherwise, it would seem too rude.”"
      },
      {
        "paragraph": "Maybe later. My dad is meeting a guest upstairs. It’s not a good idea to go up and disturb him now.”"
      }
    ]
  },

  {
    "title": "Chapter 1750 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Hannah glanced at the second floor and a complicated look flashed in her eyes."
      },
      {
        "paragraph": "“Okay.” Shaun pretended not to notice. After nodding, he bent down and said to Lucas, “I’ll get you\nsomething to eat.”"
      },
      {
        "paragraph": "Lucas was not interested in the food but nodded obediently."
      },
      {
        "paragraph": "After eating some seafood, he could not help but think that it would be good if Suzie were here. That\nglutton would definitely love to be able to eat these things."
      },
      {
        "paragraph": "It seemed that he would have to bring some food back with him when things were over."
      },
      {
        "paragraph": "After he was full, Hannah said to Shaun, “There’s a small playground at the back where many of the\nguests’ children are playing. I’ll ask the waiter to bring him there and let him play.”"
      },
      {
        "paragraph": "“It’s fine for him to stay by my side.” Shaun looked at Hannah with a deep gaze."
      },
      {
        "paragraph": "“We’ll be meeting my dad later. There’ll be many dignitaries and celebrities. It won’t be convenient to\nbring the child along. Let him go and play. Boys should experience more. My little nephews are also\nthere, so don’t worry.”"
      },
      {
        "paragraph": "Hannah finished with a smile and called a waiter over. “ Bring little Lucas to the playground at the back.”"
      },
      {
        "paragraph": "Shaun’s eyes could not help but darken, but Lucas suddenly stood up. “I’ll go and play, then. It’s boring\nto stay here anyway.”"
      },
      {
        "paragraph": "“… Take care. ” Shaun tightened his grip on the arm of the chair and stared closely at his young son."
      },
      {
        "paragraph": "“I know. You’re such a nag.” Lucas swaggered away."
      },

      {
        "paragraph": "“Your son is quite arrogant in front of you.” Hannah teased with a vague smile."
      },
      {
        "paragraph": "“He doesn’t think too highly of me.” Shaun rubbed his eyebrows and sighed softly."
      },
      {
        "paragraph": "After a while, Hannah got a call and said to Shaun, “ My dad is done. Let’s go up and meet him.”"
      },
      {
        "paragraph": "Shaun nodded and followed her upstairs."
      },
      {
        "paragraph": "On the second floor of the large parlor, in addition to Gavin and his wife, a man in a black suit and\nwearing elegant glasses was sitting on the sofa. It was Wesley Lyons."
      },
      {
        "paragraph": "“Dad… Why is he here?” Hannah’s expression changed slightly after seeing Wesley."
      },
      {
        "paragraph": "“Wesley is your future fiancée. It’s normal for him to be here.” Gavin chuckled and lit a cigarette. He\nglanced at Wesley and said, “Right?”"
      },
      {
        "paragraph": "Wesley smiled. “It’s my honor to marry Miss Mead.”"
      },
      {
        "paragraph": "“Wesley, you’re too modest.” Madam Mead, wearing her glittering jewels, laughed. “With your status now,\nmy daughter and you are a match made in heaven.”"
      },
      {
        "paragraph": "“Mom, Dad, what are you talking about? He’s Catherine’s wife. They’re not divorced  yet.” Hannah\nstomped anxiously. She did not like Wesley at all. She admitted that the Mead family was where it was\nnow because they had cooperated with Wesley, so she did not mind the Mead family having Wesley as a\npartner. However, she disapproved of Wesley being her significant other. This man was too sinister and\ndark. He was not a good choice for a spouse."
      },
      {
        "paragraph": "Furthermore, in terms of temperament and looks, Wesley could not compare to Shaun."
      },
      {
        "paragraph": "Gavin said, “He’ll divorce her. Catherine isn’t worthy of Wesley now. Besides, that woman is long\noverdue for a lesson.”"
      },
      {
        "paragraph": "“That’s right.” Wesley nodded with a smile. “ Minister Mead, Catherine cheated on me. I don’t plan on\nletting her off easily.” “Haha, I know.” Gavin smiled. “She shouldn’t be let off easily. As it happens, Shaun\nbrought his child here. You can use the child as a threat. After the divorce, you can make her your\nmistress, but my daughter has to be your legal wife. You can play with catherine however you want, but\nyou can’t let her give birth to illegitimate children."
      }
    ]
  }
]