
[
  {
    "title": "Chapter 1550 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Chester thought he could get some information from Cindy, but Cindy did not know much either."
      },
      {
        "paragraph": "“Chester, I can introduce Rebecca to you. As long as you ride on the connections behind her, the\nJewell family will rise to the next level, ” Cindy said as she plucked up the courage to wrap her arms\naround his waist from behind."
      },
      {
        "paragraph": "Chester flung her hands away mercilessly. “Cindy, do you know that four years ago, Rebecca changed\nher face to another person’s using cosmetic surgery and lurked around Shaun as a nurse? She added\ndrugs to his meals every day and made his conditions worse.”"
      },
      {
        "paragraph": "He turned around slowly and looked at her with eyes devoid of warmth. “After being exposed, she\nthrew a simple and innocent person into the fire in order to make her escape, so we all thought that the\nperson who burned to death was her. Then, she joined hands with Mason Campos. The person that\nwas burned to death was Charity Neeson.”"
      },
      {
        "paragraph": "Cindy’s body trembled."
      },
      {
        "paragraph": "She had heard about those things, but she did not know that Rebecca was involved, much less that\nCharity was wrongly accused."
      },
      {
        "paragraph": "She did not even know Charity that well."
      },
      {
        "paragraph": "She only vaguely heard that Charity used to be with Chester."
      },
      {
        "paragraph": "However, when she thought about it, Charity was probably just another woman that Chester got tired of\nplaying with."
      },
      {
        "paragraph": "“Do you know who Charity is?” Chester pulled his lips. His voice was icy cold. “She was my first\nwoman.”"
      },
      {
        "paragraph": "Then, he raised his long legs and sunk his foot in Cindy’s stomach."
      },
      {
        "paragraph": "Cindy was sent flying back and fell to the ground. She trembled in pain."
      },
      {
        "paragraph": "Chester walked over step by step, making her feel like the grim reaper was approaching."
      },
      {
        "paragraph": "“The person I hate the most in this world is Rebecca. She played me like a fool and made me send\nCharity to prison personally, yet you’re still so close with her and became best friends with her?”"
      },
      {
        "paragraph": "Chester sneered cruelly. “Cindy Turner, not only"
      },
      {
        "paragraph": "did you cross the line this time, you took the line and ran with it. You’re not satisfied with having a good\nlife. It’s not enough if you’re just Mrs. Jewell. You also want to completely monopolize me. Do I need\nyou to introduce connections to me? Even if I want to climb up the social ladder, I will never cling to\nRebecca. If you like her so much, then go to her instead. I’m not going to marry you.”"
      },
      {
        "paragraph": "His words poured down on her like icy water."
      },
      {
        "paragraph": "Cindy was genuinely frightened and quickly grabbed onto his pants, sobbing, “No, I can’t live without\nyou. I love you, Chester. I didn’t know. I didn’t know you had so much hatred for her.”"
      },
      {
        "paragraph": "“Cindy, I warned you time and time again to be content with your lot, but you clearly turned a deaf ear\nto my words. Of course, maybe you just thought I was easy to fool. This time, I will not tolerate you\nagain.”"
      },
      {
        "paragraph": "Chester bent down and pried her hands off. He turned around and walked to the door with indifference."
      },
      {
        "paragraph": "“Don’t go, Chester. I won’t dare to do it anymore. I really won’t dare to. ” Cindy climbed up and hugged\nhis long legs again."
      },
      {
        "paragraph": "“Tsk tsk, look at how you’re acting now. You’re like a dog. Cindy, can’t you save some dignity for\nyourself?” The disdain in Chester’s eyes grew stronger."
      },
      {
        "paragraph": "“I really love you too much. I love you so much that I don’t need dignity. ” Cindy sobbed and shouted."
      },
      {
        "paragraph": "“Forget it. What you love is my body. You love my identity and status, and you love the glory and\nrespect I can bring you.” Chester’s calm eyes were not moved in any way."
      }
    ]
  },
  {
    "title": "Chapter 1551 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Cindy, be smart. Everything you have was given to you by me, and I can take it all away without\nmercy. Don’t expect Rebecca to help you. She’s close to you because you’re going to marry me, but\nwhen you lose the title of Mrs. Jewell, do you think she’ll continue associating herself with you?”"
      },
      {
        "paragraph": "Chester flung her off and opened the door."
      },
      {
        "paragraph": "Cindy finally could not bear it. “Chester, if you don’t marry me, I’ll never donate blood to your mother\nagain.”"
      },
      {
        "paragraph": "Chester’s eyes flashed with deep disgust. “Cindy, you’ve become an insatiable devil because of my\nindulgence. Ask yourself. Over the years, I’ve given you countless wealth and a prosperous career, but\nyou’re not satisfied. You wanted to be my girlfriend, and I agreed. Then, you wanted to marry me, and I\nalso agreed. No one has dared to threaten me like that for a long time. The last person who"
      },
      {
        "paragraph": "threatened me was reduced to ashes. You can go ahead and try me.”"
      },
      {
        "paragraph": "Then, he left withoutlooking back."
      },
      {
        "paragraph": "Cindy looked at the empty door and shuddered."
      },
      {
        "paragraph": "She knew how much Chester hated being threatened by others."
      },
      {
        "paragraph": "However, she had no choice."
      },
      {
        "paragraph": "If Chester broke off his engagement with her, the people in the entertainment circle would no longer\nhold her up and respect her. She would become a joke."
      },
      {
        "paragraph": "No, she did not want that. Cindy clenched her fists tightly. She would not give up like this. She still had\na chance."
      },
      {
        "paragraph": "Cindy quickly called an ambulance, and the ambulance rushed over and quickly sent her to a nearby\nhospital."
      },
      {
        "paragraph": "The next day, news that the big celebrity Cindy Turner was sent to the hospital late at night made\nheadlines."
      },
      {
        "paragraph": "Cindy waited an entire night, and her phone finally rang."
      },
      {
        "paragraph": "When she answered it, she called in a low voice, “"
      },
      {
        "paragraph": "Aunty.”"
      },
      {
        "paragraph": "“Cindy, why did you suddenly go to the hospital at night? Are you feeling unwell? Is Chester with you?”\nMadam Jewell’s concerned voice resonated."
      },
      {
        "paragraph": "“Aunty… ” Cindy bit her lip and her voice became hoarse."
      },
      {
        "paragraph": "“Why are you crying?” Madam Jewell could not bear it. “Did Chester provoke you?”"
      },
      {
        "paragraph": "“Aunty, Chester kicked my stomach yesterday. It hurts.” Cindy’s tone was full of pain. “He also said that\nhe won’t marry me.”"
      },
      {
        "paragraph": "“What?” Madam Jewell was furious. “How could he do such a thing? He knows that you donated your\nkidney to me yet he still kicked your stomach. He’s too much! He even wanted to cancel the\nengagement? Everyone knows about this marriage. All the wedding invitations have been printed.\nDoes he think he can refuse to get married just because he doesn’t want to?”"
      },
      {
        "paragraph": "“I don’t know why he’s being like this suddenly, ” Cindy said in a low and pitiful voice. “Maybe it has\nsomething to do with that female artist he took a liking to recently.”"
      },
      {
        "paragraph": "“Female artist?” Madam Jewell was stunned. “ Cindy, you might have misunderstood. Chester has\nnever taken relationships seriously. It’s just for fun. To him, those things aren’t even worth mentioning.”"
      },
      {
        "paragraph": "“ I’ve never seen him so serious before. Recently, that female artist was hospitalized, and he goes to\nthe hospital every day. He doesn’t even reply to the text messages I sent him, ” Cindy cried. “He also\nmisunderstood that I harmed that woman, but I didn’t do anything. I know what kind of person he is. I\nnever hoped for his attention to only be on me. I just want to stay with him.”"
      },
      {
        "paragraph": "“Cindy, don’t worry. The marriage will definitely not be canceled. His father and I will talk to him. This\nisn’t a joke. As for that female artist, she won’t hinder your marriage.”"
      },
      {
        "paragraph": "After Madam Jewell hung up the phone, Cindy lay on the bed and sneered."
      },
      {
        "paragraph": "She knew that if Chester found out about her complaint to Madam Jewell, he would be even angrier."
      }
    ]
  },
  {
    "title": "Chapter 1552 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "However, there was nothing else Cindy could do."
      },
      {
        "paragraph": "She could only use the Jewell family to pressure Chester. She felt like the reason why Chester wanted\nto cancel the engagement with her was more or less related to Eliza."
      },
      {
        "paragraph": "In the past, no matter how he hated her, he would not do this to her."
      },
      {
        "paragraph": "She could not tell when it started, but Chester had become more cruel to her."
      },
      {
        "paragraph": "On the other side, Chester woke up in the morning and saw the news of Cindy’s hospitalization."
      },
      {
        "paragraph": "A cold light flashed in his eyes and he called Shedrick’s number. “Why didn’t you tell me that Cindy was\nhospitalized last night? She made it to the trending search.”"
      },
      {
        "paragraph": "Shedrick was a little stunned. “I thought she wanted to promote some hype. She used to do stuff like\nthat often, and you never said anything in the past.”"
      },
      {
        "paragraph": "“Remember this. I’ve decided to break off my engagement with that woman. If anything happens with\nher in the future, let me know as soon as possible. I don’t want to see any woman playing tricks in my\nhands.”"
      },
      {
        "paragraph": "Chester hung up the phone."
      },
      {
        "paragraph": "After changing into a clean shirt and pair of trousers, he drove to the hospital."
      },
      {
        "paragraph": "Instead of going to the office, he went directly to the doctor on duty at the emergency room that\nmorning. “Where’s Eliza? Which ward did you send her to?”"
      },
      {
        "paragraph": "The doctor gave him a strange look. “She was discharged from the hospital at six in the morning.”"
      },
      {
        "paragraph": "Anger flashed in Chester’s eyes. “She fainted last night, but you let her out of the hospital just like\nthat?”"
      },
      {
        "paragraph": "“She insisted on leaving, so we couldn’t do anything about it, ” the doctor cried. “This is a hospital, not a\nprison. As long as she signs the discharge papers, we can’t force her to stay.”"
      },
      {
        "paragraph": "Chester’s handsome face was unusually cold."
      },
      {
        "paragraph": "However, he understood that what the doctor said was reasonable."
      },
      {
        "paragraph": "If she wanted to leave the hospital, the hospital could not stop her."
      },
      {
        "paragraph": "However, when he thought of how she fainted last night, a surge of anger welled up in his chest."
      },
      {
        "paragraph": "She bit him last night and then left without a word. ‘Eliza Robbins, you really did it this time.’"
      },
      {
        "paragraph": "Chester left the hospital and got into his car without a word."
      },
      {
        "paragraph": "Just as he was about to start the engine, his father, Michael Jewell, called him. “Get your *ss back\nhome right now.”"
      },
      {
        "paragraph": "“If you want to talk about Cindy, then I don’t think it’s necessary. ” Chester knew Cindy’s little tricks very\nwell. The more she played her tricks, the more he hated her."
      },
      {
        "paragraph": "“What do you mean by that? Cindy is your mother’s savior. Having her around is a safeguard for your\nmother’s illness, ” Michael said furiously. “ It’s just a woman. Marry her and leave her in the house as\ndecoration. If she wants a career, then give her a career. If she wants money, then give her money. It’s\nnot like the Jewell family can’t give her all that.”"
      },
      {
        "paragraph": "“Dad, I’m sick of being threatened and manipulated by that woman over and over again,” Chester said\nindifferently. “If not for Mom’s sake, I would’ve killed her long ago.”"
      },
      {
        "paragraph": "Michael sneered. “I think that’s just an excuse. You’re infatuated by Eliza Robbins, aren’t you? The\nhospital is abuzz with rumors. Last night, you took her to the lounge on the top floor and caused her to\nfaint. You also played until you injured yourself, Chester, how did you become like this because of a\nwoman?”"
      },
      {
        "paragraph": "“It has nothing to do with her. My decision isn’t something a woman can influence. It was Cindy who\ncrossed the line,” Chester’s voice was filled with disgust."
      },
      {
        "paragraph": "Michael frowned and asked, “If you don’t marry her, what happens if your mother relapses and needs\nblood? Do you want your mother to die?”"
      }
    ]
  },
  {
    "title": "Chapter 1553 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“So… You want me to be controlled by that woman my entire life?”"
      },
      {
        "paragraph": "There was a chill in Chester’s indifferent voice. “I said this before. As long as she knows her place, she\ncan sit in the position of Mrs. Jewell, but she clearly wants more than this position. Today, she wants a\nmarriage. Tomorrow, she’ll want a child. The day after tomorrow, she’ll want me to love her and no one\nelse. Sorry, but I’d rather draw all the blood out of this woman than be threatened by her.”"
      },
      {
        "paragraph": "Then, he hung up the phone."
      },
      {
        "paragraph": "However, Michael’s call deeply affected his mood."
      },
      {
        "paragraph": "He called Shedrick again. “Cancel all the work assigned to Cindy.”"
      },
      {
        "paragraph": "Shedrick was shocked. “What are you doing?” “Some women should be taught a lesson.”"
      },
      {
        "paragraph": "After Chester hung up, he drove straight to Eliza’s apartment and knocked for a long time, but no one\nopened the door."
      },
      {
        "paragraph": "He took out his phone and dialed her manager, Hailey. “Where did Eliza go after being discharged?”"
      },
      {
        "paragraph": "Hailey was stunned. She had heard about Chester’s obsession with Eliza before, but she never\nexpected him to come to her. “ She… She was discharged? I didn’t know.”"
      },
      {
        "paragraph": "“Are you even her manager?” Chester’s cold tone made her tremble in fear."
      },
      {
        "paragraph": "“I’ll call and ask,” Hailey said quickly."
      },
      {
        "paragraph": "Three minutes later, instead of a call from Hailey, he got a call from an unknown number."
      },
      {
        "paragraph": "He pressed the answer button, and Eliza’s cold voice was on the other end. “Don’t trouble Hailey. I’m\nnot in Canberra now. I went back to my hometown with my mom to recuperate.”"
      },
      {
        "paragraph": "“Eliza, you suffered such a heavy injury yet you’re still running about? Are you trying to ruin your\nbody?” Chester’s tone sounded like an order. “If you don’t want me to trouble Hailey, then come back\nright now.”"
      },
      {
        "paragraph": "“Go back and do what? Let you make me faint again?” Eliza sneered. “Young Master Jewell, I’ve\nalready rested for more than a week. I don’t have time left. I need to rest and heal my injuries so I can\njoin the filming crew as soon as possible.”"
      },
      {
        "paragraph": "Chester frowned. “Eliza, if you hadn’t deliberately stimulated me last night and bit me, I wouldn’t have\npushed you. Your injury wouldn’t have worsened and I wouldn’t have gotten injured in the first place.\nCome back and see for yourself what my lips look like after being bitten by you.”"
      },
      {
        "paragraph": "“Isn’t that good? It’ll help Young Master Jewell clear his mind for a while, so as to avoid being too\naddicted to the charm of a woman and hollowing out your body, ” Eliza still spoke in a casual tone."
      },
      {
        "paragraph": "Chester frowned. If this woman was beside him, he really wanted to grab her and beat her up."
      },
      {
        "paragraph": "“Eliza, why do you hate me so much?” he suddenly blurted out this question."
      },
      {
        "paragraph": "Eliza clenched her phone. She could not tell him that she hated him because she was Charity Neeson.\n“Because I hate men like you. You’re clearly getting married, yet you’re going around hooking up with\nother people. I told you, you can play with women, but you should go to like -minded women who are\nwilling to be your mistress.”"
      },
      {
        "paragraph": "“You hate it so much because Monte Patterson hurt you. ” An inexplicable flame smothered Chester’s\nheart. “You care about him that much.”"
      },
      {
        "paragraph": "“I don’t care about him, but the hurt I suffered was a lesson. It reminded me that I can’t repeat the same\nmistake.”"
      },
      {
        "paragraph": "Eliza was silent for a while as she thought about how vicious she was last night. Frankly speaking, she\nwas quite afraid that Chester would retaliate, so she said in a low voice, “Young Master Jewell, I\napologize to you about last night, but it’s better for us to keep our distance in the future.”"
      },
      {
        "paragraph": "“I know what you mean. You don’t want to be a mistress, right? Eliza, I already decided to cancel m y\nengagement with Cindy. Why don’t… we have a talk?” Chester felt slightly surprised at himself after he\nspoke."
      },
      {
        "paragraph": "However, what came after the surprise was a feeling of relief."
      },
      {
        "paragraph": "It turned out that his unwillingness to marry Cindy ran deeper than he thought."
      },
      {
        "paragraph": "He did not know if he really liked Eliza, but he suddenly wanted to give it a try."
      }
    ]
  },
  {
    "title": "Chapter 1554 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Maybe, he could learn to have a normal relationship like Shaun and Rodney."
      },
      {
        "paragraph": "On the other side of the phone, Eliza was dumbstruck."
      },
      {
        "paragraph": "Chester was not a person who lied. If he said he would cancel his engagement with Cindy, he really\nwould."
      },
      {
        "paragraph": "The corners of her mouth suddenly curled with mockery."
      },
      {
        "paragraph": "He used to say the same thing when they were young."
      },
      {
        "paragraph": "Have a good talk."
      },
      {
        "paragraph": "She believed him. After entrusting him with all she had, what she got in return was his cold and\nheartless abandonment."
      },
      {
        "paragraph": "Now, he was saying that to another woman. Although the soul was still her, it was completely different."
      },
      {
        "paragraph": "How could she be moved so foolishly?"
      },
      {
        "paragraph": "“How about it? Do you agree?” Chester smiled charmingly. He still had confidence in himself. He\nbelieved that she must be ecstatic now."
      },
      {
        "paragraph": "“No.”"
      },
      {
        "paragraph": "Eliza refused. “You suddenly don’t want to get married to Cindy, and then start dating me. If word gets\nout, what will the public think of me? They’ll say I’ m a mistress who got promoted. This is the most\ntaboo kind of thing in the entertainment industry. I just want to build my career.”"
      },
      {
        "paragraph": "Chester’s handsome face immediately turned cold. “ We can keep it under wraps. Besides, with me\nsuppressing it, who would dare to write bad words about you?”"
      },
      {
        "paragraph": "“Young Master Jewell, you want to pursue me now, so of course you’ll say sweet words. What about\nafter you get tired of playing with me? Who knows if you’ll continue to protect me? When Monte\npursued me before, his sweet nothings were even better than yours. Once bitten, twice shy. It wasn’t\neasy for me to be where I am now, and I learned something; that it’s better to build a career than to\nhave a relationship. At least the money in my hand truly belongs to me.”"
      },
      {
        "paragraph": "Eliza spoke righteously as if she was disillusioned with society, but Chester was so sullen he wanted to\ndie. “Eliza, don’t be ignorant. If you refuse me again, I’ll ruin your career.”"
      },
      {
        "paragraph": "“If I can’t build my career in showbiz, I can do something else. It’s not like I can only be an actor. ”"
      },
      {
        "paragraph": "Eliza spoke nonchalantly and comfortably. She really did not care if she could not be an actor. After all,\nshe had a BA and a Master’s degree from a world"
      },
      {
        "paragraph": "-famous university, and she once managed a listed company before. Entrepreneurship was not that\ndifficult."
      },
      {
        "paragraph": "Chester choked from her self-confidence. “You graduated from an ordinary university. Aren’t you\noverestimating yourself?”"
      },
      {
        "paragraph": "Eliza replied, “Maybe you don’t know because you haven’t studied much.”"
      },
      {
        "paragraph": "Chester sneered. “I understand. You don’t want to go out with me at all, do you?”"
      },
      {
        "paragraph": "“I already told you that you’re not my type, ” Eliza said honestly."
      },
      {
        "paragraph": "“Fine, you have guts.”"
      },
      {
        "paragraph": "Chester finally hung up the call. Then, he kicked the door of her apartment hard several times."
      },
      {
        "paragraph": "The neighbor opposite her unit was so frightened he quickly got into the elevator. Although Chester\nwas well-dressed and put on airs, he had such a nasty temper. How terrifying."
      },
      {
        "paragraph": "After coming out of the elevator, Chester chuckled in disbelief."
      },
      {
        "paragraph": "He lived for more than thirty years, but this was the first time he pursued a woman seriously and got\nrejected."
      },
      {
        "paragraph": "Eliza Robbins. He would remember this."
      },
      {
        "paragraph": "If he did not obtain this woman, his name was not Chester Jewell."
      }
    ]
  },

  {
    "title": "Chapter 1555 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Chester gnashed his teeth."
      },
      {
        "paragraph": "Just then, Rodney called him. “Chester, my dad will hold a feast at Jubilee International Hotel tomorrow\nnight. I have an invitation for your family. Where are you?”"
      },
      {
        "paragraph": "Chester paused and quickly understood."
      },
      {
        "paragraph": "Nathan was now the prime minister, and his brother Jason was the supporting force backing him.\nJason was hosting a feast now both to celebrate and to win over the big shots in the business circle\nagain."
      },
      {
        "paragraph": "“I’m out…”"
      },
      {
        "paragraph": "“Are you going to the hospital? I’m going to bring Freya for a checkup so I’ll pass the invitation to you,”\nRodney said."
      },
      {
        "paragraph": "Chester hummed."
      },
      {
        "paragraph": "At 11:00 a.m., Rodney came to the hospital with Freya. This was the first time he was accompanying\nher to a checkup, and she would be doing a 4D color Doppler ultrasound. Apparently, this ultrasound\nwould allow them to see the child’s appearance clearly. He wondered if the child looked more like him\nor Freya."
      },
      {
        "paragraph": "The two of them had just entered the elevator when a large group of people suddenly poured in from\noutside."
      },
      {
        "paragraph": "Seeing how they were about to collide with Freya, Rodney quickly stepped in front of her and shouted\nin an angry tone, “Stop squeezing. There’s a pregnant woman here.”"
      },
      {
        "paragraph": "A lady by the side saw Rodney’s pretty face and brightened. “Young man, you’re so caring for your\nwife. Your wife is so fortunate that she found such a hottie.”"
      },
      {
        "paragraph": "The corners of Freya’s lips twitched at the words."
      },
      {
        "paragraph": "Hottie?"
      },
      {
        "paragraph": "She looked up and saw Rodney’s sexy Adam’s apple and clavicles. His hands propped up above her,\nlike a hen protecting her chick."
      },
      {
        "paragraph": "A large number of people crowded behind him, but Rodney’s body did not budge. He did not let anyone\nflock to her side."
      },
      {
        "paragraph": "She felt very comfortable in the crowded elevator."
      },
      {
        "paragraph": "The last few times she came, she was accompanied by Wendy and their bodyguards. It was not a bad\nfeeling to be grandiose, but she always felt an emptiness in her heart."
      },
      {
        "paragraph": "Actually, it was a different feeling to be accompanied by a husband as the baby grew in her."
      },
      {
        "paragraph": "Of course, although Rodney and she were only married via a contract, the child in her belly was still\nhis."
      },
      {
        "paragraph": "When the elevator arrived at their floor, everyone exited one after another, and the two of them were\nthe last to leave."
      },
      {
        "paragraph": "Chester stood outside with his white coat, wearing a mask and glasses."
      },
      {
        "paragraph": "“Why are you wearing a mask? I’m not used to seeing you like that.” Rodney found it strange."
      },
      {
        "paragraph": "“ Invitation, ” Chester said as he held out his hand."
      },
      {
        "paragraph": "Rodney passed the invitation to him. “Shaun and Catherine will also be attending tomorrow. I think you\nshould just come with your dad. Don’t bring Cindy along. Cindy doesn’t see eye to eye with Catherine\nand Freya."
      },
      {
        "paragraph": "Freya looked at him in surprise."
      },
      {
        "paragraph": "She had to admit that his proposal to Chester moved her heart. She really did not want to see Cindy."
      },
      {
        "paragraph": "“Yeah, I won’t bring her. I’m not marrying her anymore,” Chester said casually."
      },
      {
        "paragraph": "Freya was shocked, and Rodney was surprised too. “"
      },
      {
        "paragraph": "Are you serious? Everyone already knows about your marriage. Did Cindy agree?”"
      },
      {
        "paragraph": "“She’s too controlling and demanding. My mind is set.” Chester clearly did not want to talk about it.“\nLet’s go. I’ll bring you to the OB-GYN department.”"
      },
      {
        "paragraph": "Halfway there, they met Doctor Kendall, who nodded with a smile. “Doctor Jewell, is the wound on your\nmouth better? Remember to apply the ointment today too.”"
      },
      {
        "paragraph": "Chester’s long legs froze, but Doctor Kendall left after greeting them."
      },
      {
        "paragraph": "Rodney yelled, “Your mouth is injured? No wonder you’re wearing a mask. Let me see.” As he spoke,\nRodney reached out to grab Chester’s arm, but Chester caught his wrist immediately."
      }
    ]
  },
  {
    "title": "Chapter 1556 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“What are you doing? Let go. I’m just concerned about you as a brother, ” Rodney yelled."
      },
      {
        "paragraph": "Chester’s dark eyes behind his glasses became increasingly gloomy."
      },
      {
        "paragraph": "Freya frowned and quickly pulled Rodney. “He doesn’t want you to see. Why do you care so much?\nYoung Master Jewell cares about his reputation. ”"
      },
      {
        "paragraph": "Rodney wanted to look, but when he saw the soft little hand holding his left hand, he felt like floating."
      },
      {
        "paragraph": "Her hand was so small and slender. It was much smoother than his."
      },
      {
        "paragraph": "Just as he wanted to grasp her hand, Freya quickly withdrew."
      },
      {
        "paragraph": "Rodney pursed his lips in dissatisfaction. Next to them, Chester was speechless as he saw the scene.\nWas there a need to act like that? It was as if he never touched a woman before. Just touching his\nhand made him fall into a daze."
      },
      {
        "paragraph": "“Hey, Chester, how did your mouth get hurt?” Rodney came to his senses and joked casually. “Was it\ndone by a woman?”"
      },
      {
        "paragraph": "“ It’s none of your business. We’re at the OB-GYN Department,” Chester stopped in his tracks."
      },
      {
        "paragraph": "Rodney was about to follow Freya in, but he was stopped by the intern at the door. “Men can’t go in.”"
      },
      {
        "paragraph": "He could only wait outside sullenly."
      },
      {
        "paragraph": "After Freya went in, Chester gave him a sideways glance and saw his nervous expression. “You’re very\nconcerned about her now.”"
      },
      {
        "paragraph": "“We’re married, after all, and she’s pregnant with my child. I really want to live a grounded life, ”\nRodney said meaningfully."
      },
      {
        "paragraph": "“You’ve let go of Sarah?” Chester asked."
      },
      {
        "paragraph": "Rodney’s expression stiffened. After a moment, he said stiffly, “ Sarah isn’t worthy of my care at all. The\nten years that I spent protecting her went to sh*t. In the future, I want to be responsible for my family.\nThe feelings between Freya and I can also be cultivated. In the past, I only had Sarah in my heart and\ncouldn’t see the goodness of other women at all, but now, I feel that… she’s actually… quite good.”"
      },
      {
        "paragraph": "She was just a little too fierce, and if he did not look after her properly, she might possibly end up\ncuckolding him."
      },
      {
        "paragraph": "Of course, he did not say that to Chester. Men needed to maintain their egos."
      },
      {
        "paragraph": "“By the way, seriously, what happened to your mouth?” Rodney asked suspiciously, “Were you bitten\nby a woman?”"
      },
      {
        "paragraph": "Chester was quiet."
      },
      {
        "paragraph": "Seeing him silent, Rodney became excited. “Cindy definitely doesn’t have the guts to do that. It was\nEliza, right?”"
      },
      {
        "paragraph": "“You wait here. I’m going to work,” Chester said as he turned to leave."
      },
      {
        "paragraph": "Rodney refused to give up and grabbed him. “Come on, spill the tea.”"
      },
      {
        "paragraph": "“Get lost. You’d better not mention that woman to me again.” Chester flung him away in annoyance and\nwalked away with dark eyes."
      },
      {
        "paragraph": "Rodney clicked his tongue and raised his eyebrows. I t was the first time he saw Chester so angry at a\nwoman. It seemed that there was something going on."
      },
      {
        "paragraph": "“Where’s Young Master Jewell?” Freya suddenly came out from inside with a medical record in her"
      },
      {
        "paragraph": "hands."
      },
      {
        "paragraph": "“He left.” Rodney grinned and said, “Guess who bit his lips.”"
      },
      {
        "paragraph": "Freya.“ ”"
      },
      {
        "paragraph": "“I’m guessing it was Eliza.” Rodney cackled. “I never thought I’d see the day.”"
      },
      {
        "paragraph": "Freya immediately understood and snorted, “ Eliza’s trick isn’t bad. If anyone dares to forcefully kiss me\nin the future, I can learn from her.”"
      },
      {
        "paragraph": "Rodney. “ ”"
      },
      {
        "paragraph": "If he had known, he would not have told her."
      },
      {
        "paragraph": "“Go pay the bill,” Freya shoved the consultation card into his hand. “You can use your phone to link\nyour account.”"
      },
      {
        "paragraph": "“You should have linked your account since the previous checkups. ” Rodney refused to do it. It was\ntoo troublesome to link the account to his phone. He wanted to be lazy."
      },
      {
        "paragraph": "Freya looked at him with a fake smile on her face. “I did, but since you want to acknowledge the child,\nwhy would I need you if you’re not even willing to pay with your phone?”"
      }
    ]
  },
  {
    "title": "Chapter 1557 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“…It’s my fault. I’ll pay right now,” Rodney felt like biting his tongue off."
      },
      {
        "paragraph": "He linked the consultation card to his phone clumsily according to the instructions on the wall about the\nmobile payment."
      },
      {
        "paragraph": "After paying the bill, he accompanied Freya for a blood test."
      },
      {
        "paragraph": "Seeing so much blood being drawn, he began to feel annoyed. “Why do you need to draw so much\nblood for a prenatal test?”"
      },
      {
        "paragraph": "The nurse who was drawing Freya’s blood gave him an innocent look. “It’s necessary. As the baby\ngrows older, more screening tests are needed to ensure that the baby and the mother are healthy and\nsafe.”"
      },
      {
        "paragraph": "Rodney pursed his thin lips. Only after the blood test was over did he say to Freya seriously, “I’m going\nto buy a chicken and cook you some broth to help replenish your blood.”"
      },
      {
        "paragraph": "Freya cast a confused look at him. “Thank you. Your words suddenly reminded me of my mom.”\nRodney was speechless."
      },
      {
        "paragraph": "His words reminded her of her mom? What did it mean?"
      },
      {
        "paragraph": "Was he like her mom?"
      },
      {
        "paragraph": "Rodney, who was treating her tenderly, felt as though a bucket of cold water was poured over him.\n“Please keep your mouth shut.”"
      },
      {
        "paragraph": "“How dare you ask me to shut my mouth,” Freya’s eyes narrowed."
      },
      {
        "paragraph": "“No. I feel that… You really deserved to be single for many years, ” Rodney teased her."
      },
      {
        "paragraph": "Freya, who had indeed been single for many years, was furious instantly. “What gives you the right to\ninsult me? You deserved to be single for over ten years too. At least I wasn’t single for as long as you\ndid.”"
      },
      {
        "paragraph": "“That’s because I’m older, okay?”"
      },
      {
        "paragraph": "“It’s good that you know you’re old. It’s your honor to be able to marry such a pretty young woman like\nme,” Freya mocked."
      },
      {
        "paragraph": "The nurse at the window stared at them. “If you guys want to argue, please move to the other side and\ndo it there. There are a lot more people queueing here.”"
      },
      {
        "paragraph": "Rodney and Freya were stunned. They turned their heads around, only to find a long queue with seven\no r eight people behind them. Everyone fixed their eyes on them as if they were watching a drama\nunfold."
      },
      {
        "paragraph": "An old lady smiled and said, “Enough. Stop arguing. I think the two of you are quite a good match. With\nyour good looks, your baby must be beautiful.”"
      },
      {
        "paragraph": "“Exactly. Since the man got the woman pregnant, it’s normal for the pregnant woman to be bad-\ntempered. My wife’s temper was even more explosive,” a man who had been in their shoes chimed in."
      },
      {
        "paragraph": "Those remarks made Rodney and Freya flush with embarrassment."
      },
      {
        "paragraph": "In the end, Rodney swiftly bowed his head remorsefully. Then, he quickly dragged Freya away and left."
      },
      {
        "paragraph": "When they were upstairs, he coughed lightly. “I’ve decided to put up with you from now on. I won’t\nargue with you anymore.”"
      },
      {
        "paragraph": "“What do you mean? As if I wanted to argue with you. You were the one who attacked me first,”"
      },
      {
        "paragraph": "Freya disputed indignantly."
      },
      {
        "paragraph": "Rodney’s head ached a little. Freya was already capable of arguing like a fighter before she was\npregnant. Now, her argument skills had leveled up."
      },
      {
        "paragraph": "“ Sorry. It was my fault. I shouldn’t have insulted you that way. In fact, I was quite fond of you when you\nwere single. Otherwise, why would I have pursued you?” Rodney forced a smile weakly."
      },
      {
        "paragraph": "Only then did Freya feel better. “It’s good that you’re aware.”"
      },
      {
        "paragraph": "With that, she went for an ultrasound scan. Rodney kept following her."
      },
      {
        "paragraph": "However, when Freya underwent the Doppler ultrasound, the baby was uncooperative as its face could\nnot be seen. The test did not turn out well."
      },
      {
        "paragraph": "As such, Freya ate chocolates while climbing the stairs for an hour. Only then did that damn baby turn\naround, revealing its face."
      }
    ]
  },
  {
    "title": "Chapter 1558 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "However, once the report of the Doppler ultrasound was out, Rodney was pleased about it. “Is this my\ndaughter? She’s really pretty.”"
      },
      {
        "paragraph": "Freya asked in astonishment, “How do you know it’s a girl? Did you ask Chester?”"
      },
      {
        "paragraph": "Rodney was stunned. “Chester didn’t tell me. By the look of the baby’s pretty features, I feel that she’s\na girl.”"
      },
      {
        "paragraph": "The corners of Freya’s mouth twitched. “ I didn’t know you could determine the gender of the baby. ”"
      },
      {
        "paragraph": "Freya touched his nose embarrassedly before he purposely took a photo of the Doppler ultrasound\nreport. “You damn brat, who allowed you to cover your face? Because of you, your mom had to climb u\np and down wearily for a long time. After you’re born, you have to be filial to your mom, okay?”"
      },
      {
        "paragraph": "Upon hearing his words, Freya shot him a complicated look. She probably did not expect him to be so\nconsiderate."
      },
      {
        "paragraph": "She was quite tense at first, but his words lifted her mood all of a sudden."
      },
      {
        "paragraph": "Rodney suddenly approached her and said earnestly, “Freya, I used to think that prenatal tests were\neasy. When I saw your blood being drawn and that you climbed the stairs, I really think that I was\noverboard back then. I didn’t even fulfill my duty as a husband. I won’t behave like this anymore. I’ll\ntreat you and the baby well. I’ll also accompany you to every checkup. If you’re not well, you can let me\nStunned, Freya turned her head around and looked a t his handsome face, which was very close to\nher. The man’s red lips were elegant, and he looked as attractive as a fox."
      },
      {
        "paragraph": "Based on the entertainment magazine she read earlier, it seemed that his type of lips was suitable for\nkissing as it would provide a great feel."
      },
      {
        "paragraph": "Suddenly, her heart raced madly in spite of herself. She kept cursing herself internally."
      },
      {
        "paragraph": "What was she thinking about?"
      },
      {
        "paragraph": "He was just good-looking, but could he make money with his good looks?"
      },
      {
        "paragraph": "She should not be swayed by his words just because of his good looks."
      },
      {
        "paragraph": "“Freya…” Rodney suddenly called her as he moved closer to her."
      },
      {
        "paragraph": "“What are you doing?” His action raised a panic in Freya. She wondered if she was blushing."
      },
      {
        "paragraph": "She could not help but touch her face, which seemed to be burning."
      },
      {
        "paragraph": "“You seem… to have grown slightly fatter, ” Rodney said out of the blue. “Your cheeks look chubby, ” he\nwas too shy to instead say that she was quite adorable."
      },
      {
        "paragraph": "Freya did not know what to say."
      },
      {
        "paragraph": "Rodney’s words made her heart pound and her face flush. She must be crazy."
      },
      {
        "paragraph": "This man would not behave himself unless he got a punch."
      },
      {
        "paragraph": "“Yeah. I’m fat. I’ve gained five kilograms since I’m pregnant with your child.” Freya stomped on\nRodney’s foot. After he bellowed in pain, she left in a huff."
      },
      {
        "paragraph": "Once Freya returned to the villa, she called Catherine to vent her anger. “Rodney, that dumbhead, said\nI deserved to be single. I think the same applies to him too. Even without Sarah’s involvement, I guess\nhe wouldn’t have gotten a girlfriend as well.”"
      },
      {
        "paragraph": "Catherine was speechless. “ In my view, the two of you deserved to be single, so stop taunting each\nother.”"
      },
      {
        "paragraph": "Freya was glum. “Are you actually my best friend?”"
      },
      {
        "paragraph": "“I’m just telling the truth,” Catherine sighed. “ Although Rodney has his weaknesses, he donated his\nblood to you. He also planned to buy you a chicken to help replenish your blood, so he’s considered a\ngood househusband. But you mentioned that he reminded you of your mom, which was like a wet\nblanket. You might as well say that he looks like your mom.”"
      },
      {
        "paragraph": "Freya was at a loss for words."
      },
      {
        "paragraph": "Uh. Now that Catherine mentioned it, Freya realized that her comment did seem like a wet blanket."
      },
      {
        "paragraph": "“Hold on. Why are you standing up for Rodney now? You disliked him back then, didn’t you?” Freya\nsuddenly asked. “When he accompanied us to the clubhouse the other day, he fought with Bryce to\nprotect you. His actions made me think that he’s quite manly. He might’ve done a lot of things wrong,\nbut he’s slowly trying to be a good father and husband.”"
      }
    ]
  },
  {
    "title": "Chapter 1559 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine added helplessly, “Of course, it’s mainly because you’re pregnant with Rodney’s child and\nboth of you are officially married. If he’s really remorseful, can’ t you give him another chance? ”"
      },
      {
        "paragraph": "Freya pouted and moaned, “Given that he speaks so meanly, would I die early if I live with him for the\nrest of my life?”"
      },
      {
        "paragraph": "“Isn’t that good? If he lives with you for the rest of his life, he might die early due to your provocation as\nwell. It’s nice to have someone die with you.”"
      },
      {
        "paragraph": "When the scornful laughter resounded, Freya lost her temper. “Catherine Jones…”"
      },
      {
        "paragraph": "“Enough. Be content that you have a chicken to eat. From the moment Shaun and I married, split up,\nand gave birth, he has never cooked any chicken broth for me, ” Catherine said in a grim tone, “\nThanks to you, I don’t feel good. After I made peace with Shaun, he said he’ll make time to cook for\nme. In the end, he’s been tied up all the time. What a liar that man is. It turned out to be a trick.”"
      },
      {
        "paragraph": "Freya could not help but giggle secretly. Catherine and Shaun had always been the ones who acted all\nlovey-dovey in front of her. Little did she expect that she would one day do the same to Catherine."
      },
      {
        "paragraph": "“Fine. I’ll stop here now. I’m going to check if Rodney bought a chicken. If I don’t get to drink the\nchicken broth, I’m going to kill him.”"
      },
      {
        "paragraph": "Freya hung up the phone like a queen."
      },
      {
        "paragraph": "Luckily, Rodney made it even though it was not known where he got a fresh chicken. Wearing an\napron, he was trying hard to cut the chicken into chunks."
      },
      {
        "paragraph": "Moved by his act, Freya could not resist snapping a photo of him secretly. She then sent the photo to\nCatherine to show off."
      },
      {
        "paragraph": "A moment later, Catherine sent a sticker that read ‘ We’re not friends anymore’."
      },
      {
        "paragraph": "Freya pursed her lips and smiled."
      },
      {
        "paragraph": "Shortly after, Catherine sent another WhatsApp message. [I admire you guys so much. It’s been a long\nwhile since Shaun and I had a joyful meal together. I don’t even feel like preparing a meal sometimes.]"
      },
      {
        "paragraph": "Freya felt a twinge of guilt. Compared to the pressure Catherine and Shaun were facing at this point,\nFreya and Rodney were much more fortunate."
      },
      {
        "paragraph": "With the Snow family backing them, Freya and Rodney were not stressed."
      },
      {
        "paragraph": "Seemingly… She should be content."
      },
      {
        "paragraph": "Well… She would treat Rodney slightly better then."
      },
      {
        "paragraph": "At noon, Rodney cooked a big pot of golden chicken broth. He had simmered it for more than an hour\nin a cooker. The broth smelled good."
      },
      {
        "paragraph": "As Freya had a baby in her belly, she naturally became hungry once she sensed the aroma of the\nbroth."
      },
      {
        "paragraph": "“ It was my fault… in the hospital this morning, ” Rodney took the initiative to apologize to her\nunexpectedly. “ I shouldn’t have said that you’re fat. Actually, I didn’t mean to taunt you. There’s nothing\nwrong with being plump. Your chubby face looks quite… cute.”"
      },
      {
        "paragraph": "As soon as he finished speaking, he turned his face away. His ears were burning."
      },
      {
        "paragraph": "F*ck. As if it was his first time saying such cheesy words to her, he found it really awkward."
      },
      {
        "paragraph": "Freya felt weird too."
      },
      {
        "paragraph": "She had long since gotten used to the way of getting along with him where they would argue several\ntimes a day. All of a sudden, he came to her and called her cute."
      },
      {
        "paragraph": "That feeling made it seem as though pigs might fly."
      },
      {
        "paragraph": "Although it was strange, she… she was a little heartened."
      },
      {
        "paragraph": "After all, who would hate being complimented? In particular, she was a pregnant woman who was\nstarting to grow in size."
      },
      {
        "paragraph": "“I’m naturally cute.” Freya took a ladle and snorted in a self-righteous manner. “ Back then, I was so\npretty that my cuteness was invisible. Now that my prettiness has faded a little, my cuteness has\nbecome irresistible.”"
      },
      {
        "paragraph": "“Ahem. ” Rodney felt lucky that he had not drunk the soup. Otherwise, he would have choked."
      },
      {
        "paragraph": "“Is there anything you disagree with? You can voice it out, ” Freya said with a grin."
      }
    ]
  },

  {
    "title": "Chapter 1560 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“I’m fine with it, ” Rodney replied as he subconsciously withdrew his leg for fear that it would be\nstepped on again."
      },
      {
        "paragraph": "Freya nodded in contentment. She gulped down two bowls of soup in feeling good."
      },
      {
        "paragraph": "The following night. Jubilee International Hotel."
      },
      {
        "paragraph": "A modest yet grand banquet was being held in the dining hall located on the top floor."
      },
      {
        "paragraph": "Rows of cars filled the hotel’s parking lot."
      },
      {
        "paragraph": "Although the Snow Corporation was said to be the organizer of the banquet, a lot of people were under\nno illusions that Nathan was the one backing the company. Those who could attend the banquet were\nno ordinary people."
      },
      {
        "paragraph": "Given that Freya was pregnant, the Snow family did not ask her to serve the guests. Instead, they\nmade Rodney accompany her. The two of them only arrived at the banquet hall at 7:30 p.m."
      },
      {
        "paragraph": "Shortly after, Shaun and Catherine showed up."
      },
      {
        "paragraph": "Shaun was dressed in a three -piece dark gray suit with one hand in his pocket while the other rested\non Catherine’s shoulder. In contrast, Catherine wore a floral dress with embroidered butterflies. The\nbutterflies seemed so real as if they were about to flutter. The color of the dress might seem dull, but\nwhen it was matched with her curvy figure, she looked elegant and alluring."
      },
      {
        "paragraph": "As Catherine and Shaun were walking, many people gazed at them in amazement."
      },
      {
        "paragraph": "Freya could not help but glance at Shaun’s tall and sturdy figure. When she shifted her eyes to the\nflashy Rodney who was dressed in a green suit, she clicked her tongue feeling conflicted."
      },
      {
        "paragraph": "“Why did you ‘ tsk’?” Rodney felt humiliated. “Do I look worse than Shaun?”"
      },
      {
        "paragraph": "“No, ” Freya said and sighed from the bottom of her heart. “Clearly, Shaun is the handsome, arrogant\npresident that one would find in a novel, whereas you just look like an effeminate man. You’re the so-\ncalled eye candy.”"
      },
      {
        "paragraph": "Rodney was at a loss for words."
      },
      {
        "paragraph": "He lost his temper. He scowled at the handsome and cool Shaun who was walking toward him."
      },
      {
        "paragraph": "Shaun approached Rodney, only to find Rodney staring at him resentfully. “Did I offend you?”"
      },
      {
        "paragraph": "Rodney sized him up and down with disgust. “Why are you always dressed in dull and plain clothing?\nPlease. It’s boring.”"
      },
      {
        "paragraph": "Shaun did not get mad. He fixed his eyes on Rodney impassively and teased, “I’ll be in trouble if you’re\ninterested in me. After all, I’m not into men.”"
      },
      {
        "paragraph": "Freya giggled, and a smile flashed across Catherine’s face as well. “Young Master Snow, you shouldn’t\nargue with him. He’s brutal.”"
      },
      {
        "paragraph": "“How am I brutal? When I speak to you, I’m always very sweet, ” Shaun immediately turned to look at\nhis wife affectionately."
      },
      {
        "paragraph": "Catherine rolled her eyes at him. “Oh well, you spoke harshly to me a lot back then.”"
      },
      {
        "paragraph": "“Enough. I didn’t ask you guys over to act all lovey- dovey. ” Then, Rodney gestured to them with his\nchin. “Chester is here.”"
      },
      {
        "paragraph": "Everyone turned their eyes in that direction, yet Shaun and Catherine looked at him strangely. With a\ntall and sturdy figure, he looked handsome in a maroon suit. Nevertheless, he was wearing a face\nmask. What was wrong with him?"
      },
      {
        "paragraph": "“Well, Eliza bit Chester and injured his mouth,” Rodney grimaced like a busybody."
      },
      {
        "paragraph": "Shaun raised his brows, yet Catherine frowned before she said, “It serves him right.”"
      },
      {
        "paragraph": "“Aw. Don’t say that. Chester has decided not to marry Cindy, so technically, he’s not playing the field.”\nRodney stood up for his buddy. Catherine was astonished. Even so, she was pleased to hear the news.\n“Can Cindy accept it?”"
      }
    ]
  },
  {
    "title": "Chapter 1561 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rodney scoffed and said, “ If Cindy can’t accept it, I guess Chester will make her kneel and accept it. ”"
      },
      {
        "paragraph": "Catherine and Freya exchanged glances."
      },
      {
        "paragraph": "Shaun placed his hand around Catherine’s waist. “In terms of viciousness, I can’t compare with\nChester.”"
      },
      {
        "paragraph": "Rodney might appear somber, while Chester seemed like an elegant doctor in a white coat, but no one\namong the three of them could be as vicious as Chester."
      },
      {
        "paragraph": "When Chester caught sight of them from a distance, he waved his hand but did not walk toward them."
      },
      {
        "paragraph": "Rodney chuckled and said, “I bet Chester is too shy to come here. Damn… Isn’t that Wesley, that b*\nstard? Why did he come with Gavin?”"
      },
      {
        "paragraph": "Gavin was the then Senator Mead. Now that he had risen to the rank of Minister Mead, a lot of people\nwent to flatter him the minute he showed up."
      },
      {
        "paragraph": "Wesley, who was right beside Minister Mead, looked quite different than before. At this point, he looked\nlike Minister Mead’s favorite person as Minister Mead kept introducing the guests to him."
      },
      {
        "paragraph": "No matter how terrible Wesley’s reputation was, everyone at the banquet was so shrewd that they did\nnot bring up his past. Instead, they shook hands with Wesley and chatted happily with him."
      },
      {
        "paragraph": "Catherine became glum at the sight of the scene. She had spent a lot of effort destroying Wesley’s\nreputation, only to see him regain his power in Canberra by taking advantage of Minister Mead."
      },
      {
        "paragraph": "Wesley seemed to have caught sight of her. He raised his brows and shifted his gaze to her."
      },
      {
        "paragraph": "A moment later, he whispered to the others before he walked up to Catherine."
      },
      {
        "paragraph": "“Wifey, come over, ” Wesley said as he waved at Catherine with a loving expression. “As my wife, how\ndare you stay with another guy and sleep at his place. Even if you don’t care about your dignity, I do.\nYou have to follow me home later.”"
      },
      {
        "paragraph": "Catherine was extremely put out by his words. “ I remember that our divorce papers have been sent to\nyour place. The lawyer in charge of our divorce should’ve received it as well. I sincerely hope that you’ll\nsign it as soon as possible.”"
      },
      {
        "paragraph": "“You’re still my wife as long as I don’t sign the papers. ” Wesley adjusted his glasses. “ Normally, I’ll\nturn a blind eye to it. But on this important occasion, everyone’s with their wives and official girlfriends.\nCathy, you’d rather attend this banquet bearing the identity of Shaun’s lover, huh? Are you so\nshameless?”"
      },
      {
        "paragraph": "A hint of hatred flashed across Catherine’s eyes."
      },
      {
        "paragraph": "Shaun held her hands tightly with his grave, handsome face. “She’s the mother of my child and the\nwoman I love the most. Well, you’re the one who made tonight’s banquet seem so cheap.”"
      },
      {
        "paragraph": "After a pause, Shaun turned around and looked at Rodney. He then asked, “Rodney, why did the Snow\nfamily invite such an ill-mannered person here?”"
      },
      {
        "paragraph": "“I have no idea either. Perhaps he came here with no shame by taking advantage of Minister Mead.”"
      },
      {
        "paragraph": "Rodney was so cooperative that he even ran to Minister Mead on purpose and said so loudly that many\npeople could hear, “Uncle Gavin, how could you bring Wesley here? You look down on the Snow’s\nbanquet, huh? It’s not that I don’t respect him, but he cheats on women."
      },
      {
        "paragraph": "“After he got stabbed, he bluffed by saying that his kidney had been damaged for the sake of saving a\nwoman when, in fact, he was all well. Not only that,"
      },
      {
        "paragraph": "he claimed that he loved his wife when he secretly made out with his female secretary. They even\nacted indecently in the office from time to time."
      },
      {
        "paragraph": "After he was exposed, he even physically abused Catherine…”"
      },
      {
        "paragraph": "After Minister Mead heard Rodney’s words, his face turned grim. After all, he was the one who brought\nWesley in. Seeing those disdainful looks of people around him, he immediately said, “It could be a mis\n— ”"
      }
    ]
  },
  {
    "title": "Chapter 1562 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "However, Rodney did not give Minister Mead the chance to continue. With his voice raised, he said,“\nUncle Gavin, don’t get me wrong. I’m not saying this to blame you. I’m just worried that the naive young\nladies would fall for Wesley’s appearance of a polite, business elite and end up being cheated on.\nPlaying with their feelings and bodies is one thing, but the scariest thing is when he abuses or betrays\nthem. That’ll be terrible.”"
      },
      {
        "paragraph": "“Uh… Minister Mead, I see Director Snow is there. I’m going to greet him. ” A political dignitary pulled\nhis daughter away immediately after giving the excuse."
      },
      {
        "paragraph": "Subsequently, other political dignitaries and wealthy figures made their excuses and left."
      },
      {
        "paragraph": "Although Wesley’s pharmaceutical group was doing well, it would be troublesome if their daughters fell\nfor such an odious character."
      },
      {
        "paragraph": "Minister Mead was embarrassed and infuriated. “ Young Master Snow, how dare you make me look so\nbad.”"
      },
      {
        "paragraph": "“Uncle Gavin, don’t say that. I did this only because I take you as my biological uncle.”"
      },
      {
        "paragraph": "Indeed, Rodney was extremely shameless. He even cast a look at Hannah behind and waved at her. “\nHannah, it’s been a while since we met. You’ve grown much prettier, but you should stay away from\nWesley, that beast. Don’t let him play with your body and feelings.”"
      },
      {
        "paragraph": "“I’m not that stupid.” The words escaped Hannah’s mouth."
      },
      {
        "paragraph": "She wanted to tease Catherine for being stupid. However, only after she finished speaking did it occur\nto her that the Mead family was the one who brought Wesley here."
      },
      {
        "paragraph": "“Yeah. You’re not that stupid, and I’m relieved to hear that.” Rodney cackled."
      },
      {
        "paragraph": "Minister Mead, who had been acting complacent of late, instantly became so exasperated that his face\nflushed. He glared at Rodney before he turned around and walked away."
      },
      {
        "paragraph": "Wesley’s temples twitched. He had originally planned to get acquainted with some noblemen using\nMinister Mead’s identity. Nevertheless, Rodney had destroyed his plan."
      },
      {
        "paragraph": "Clenching his fists, Wesley suddenly walked up to Rodney. Then, he said with a mirthless smile, “\nYoung Master Snow, as the eldest young master of the Snow family, I honestly think that you’ve\ndragged the Snows’ name down with your behavior. Do you know what this behavior of yours is?\nYou’re like Shaun’s dog that does whatever he instructs.”"
      },
      {
        "paragraph": "“You’re trying to provoke me and destroy my relationship with Shaun, huh? Haha. Dream on. ” Rodney\nchuckled. “But come to think of it, judging from the way you came in with Minister Mead just now, you\nlook exactly like a dog. Only the bark was missing.”"
      },
      {
        "paragraph": "Wesley’s facial expression contorted for a moment before he suddenly flashed a smile at Catherine."
      },
      {
        "paragraph": "“Cathy, you’re my wife, and this is the fact. ” With that, Wesley took out a marriage certificate from his\npocket. “Want to be with Shaun legally? I don’t think that’s ever going to be possible. Well, let’s see\nhow much longer Shaun can protect you. One day, I’ll make you go to bed with me.”"
      },
      {
        "paragraph": "After he was done speaking, he tagged along with Minister Mead to the other side."
      },
      {
        "paragraph": "Shaun fixed his eyes on Wesley’s back. His grim gaze made him look as if he was going to tear Wesley\ninto pieces."
      },
      {
        "paragraph": "He had to admit that the sight of the marriage certificate pierced his heart."
      },
      {
        "paragraph": "Back then, he did not know how to appreciate her. However, now that Catherine shared the marriage\ncertificate with someone else, it felt extremely infuriating."
      },
      {
        "paragraph": "“Damn. Is he crazy? Shaun, he’s obviously trying to provoke you by carrying the marriage certificate\naround with him, ” Rodney said sympathetically."
      },
      {
        "paragraph": "“To be honest, it’s just a marriage certificate. He can’t change my mind with it.” Catherine held Shaun’s\nhands in a surprisingly cool manner."
      }
    ]
  },
  {
    "title": "Chapter 1563 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun caressed Catherine’s head."
      },
      {
        "paragraph": "He also fought back his unpleasant feelings."
      },
      {
        "paragraph": "He knew that the most upset person should not be him but Catherine."
      },
      {
        "paragraph": "Nobody would want to be married to Wesley, that b* stard."
      },
      {
        "paragraph": "“Let’s go. I’ll take you to greet Elder Snow.” Shaun pulled her into his arms and left."
      },
      {
        "paragraph": "Freya darted a glance at Rodney, who was beside her, and suddenly gave him a thumbs up. “You did a\npretty good job just now.”"
      },
      {
        "paragraph": "“Ahem. ” Rodney was on cloud nine. “Of course. I have quite a lot of strengths.”"
      },
      {
        "paragraph": "“Yeah. Hardly any man’s mouth can compare to yours. When you used to criticize Catherine and me, I\nreally wished I could throw you into the toilet bowl. But when I saw you lashing out at the person I hate,\nI was quite pleased, to say the least. ” Now that Freya looked at Rodney, he was much less of an\neyesore."
      },
      {
        "paragraph": "Rodney was at a loss for words. Was she praising him or condemning him?"
      },
      {
        "paragraph": "After Catherine accompanied Shaun to entertain the guests, the hotel staff took the two of them to the\nhighest floor of the hotel."
      },
      {
        "paragraph": "Tonight’s banquet was held on two floors."
      },
      {
        "paragraph": "The guests on the first floor could dance and chat. However, not anyone could step onto the second\nfloor."
      },
      {
        "paragraph": "Of course, everyone knew full well that Nathan, the prime minister, was on the second floor."
      },
      {
        "paragraph": "When Catherine and Shaun arrived at the door to the lounge, a secretary shot Catherine a troubled\nlook. “The prime minister has something to discuss with Young Master Hill…”"
      },
      {
        "paragraph": "“I’ll wait outside then.”"
      },
      {
        "paragraph": "Catherine instantly understood that there were some confidential and important matters between\nNathan and Shaun. It was only normal that Nathan did not want her to learn about it."
      },
      {
        "paragraph": "“Don’t go down. Wait for me here. ” Worried that she would bump into Wesley, Shaun reminded her"
      },
      {
        "paragraph": "before he entered the lounge."
      },
      {
        "paragraph": "With that, Catherine wandered along the corridor, enjoying the night view of the city."
      },
      {
        "paragraph": "This hotel had over 1oo floors. When she gazed out of the French window, she could see the\nilluminations of the whole city, whose beauty was otherworldly. However, Catherine did not move closer\nto the window due to her fear of heights."
      },
      {
        "paragraph": "After wandering around for a while, there was a spacious balcony in front of her. A sturdy figure\ndressed in white was seated on the couch, looking down at the chess pieces on the table and\ncontemplating the game."
      },
      {
        "paragraph": "It was him…"
      },
      {
        "paragraph": "Catherine was taken aback. She did not expect Titus’s presence here."
      },
      {
        "paragraph": "However, as Matthew had hinted to her before, she knew the Costner family’s background was\nunusual."
      },
      {
        "paragraph": "After hesitating for two seconds, she turned around to walk away."
      },
      {
        "paragraph": "Titus’s throaty voice then sounded behind her. “ Seeing me and leaving without a greeting? Don’ t you\nhave basic manners, Miss Jones?”"
      },
      {
        "paragraph": "Catherine rubbed her forehead. She turned around and replied, “I’m afraid you’ll suspect that I’m\napproaching you with a purpose, Mr. Costner.”"
      },
      {
        "paragraph": "“As far as I know, you’ve just helped Hill Corporation overcome an obstacle with your skillful\nperformance. I’m aware of your intention. At this point, you won’t be bothered to ask me for anything. ”\nTitus picked up the wine glass beside him and took a sip of red wine."
      },
      {
        "paragraph": "Catherine smiled openly. “Mr. Costner, since you can’t see the value in Hill Corporation, I don’t think I\ncan get you to help it in any way. That’s why I don’t wish to approach you, only for you to find me\nannoying. Of course, it’ll be good if I can solve it myself. After all, no one likes to beg people.”"
      },
      {
        "paragraph": "“Do you think Hill Corporation has weathered the storm?” Titus asked tauntingly."
      }
    ]
  },
  {
    "title": "Chapter 1564 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine was startled. “You seem to know something, Mr. Costner.”"
      },
      {
        "paragraph": "Titus kept quiet."
      },
      {
        "paragraph": "Catherine laughed and said, “Look how silly I am. Considering that you could come to this floor and\nplay chess, your identity must be far different from mine. You should be at least as powerful as the\nprime minister.”"
      },
      {
        "paragraph": "“You don’t have to probe me.” Titus turned his head around and glanced at the woman in a dress. Her\nastuteness and intelligence reminded him of the scene when he first met Sheryl back then. “ Come and\ntake a seat. Have a look at this game with me.”"
      },
      {
        "paragraph": "Catherine walked up to him nonchalantly. She was quite familiar with chess."
      },
      {
        "paragraph": "However, Titus seemed to have come to a dead position in the game."
      },
      {
        "paragraph": "“I was playing chess with someone just now. Please think of a way out for me. I’m going to lose.”"
      },
      {
        "paragraph": "Titus’s azure eyes expressed a sense of helplessness. “ I’m not good at this type of chess. ”"
      },
      {
        "paragraph": "“ If I help you, I should be rewarded in some way, ” Catherine replied with a grin."
      },
      {
        "paragraph": "Titus threw her a look. “You really do know how to push your luck, huh?”"
      },
      {
        "paragraph": "“Given your unusual identity, I’m asking for a reward so that I can take advantage of you. I definitely\nwon’t want to miss this opportunity.” Catherine said with a smile, “Besides, I believe the person who is\nplaying this game with you has an outstanding identity too. He’s Prime Minister Snow, right?”"
      },
      {
        "paragraph": "Titus chuckled. Many people wanted to take advantage of him."
      },
      {
        "paragraph": "Even Sheryl’s daughter, Rebecca, wanted to take advantage of him. Nevertheless, none of them was\nas frank as Catherine, and frank and clever people would never annoy him."
      },
      {
        "paragraph": "“ If I help you to defeat the prime minister in this game without being rewarded, I don’t think that’s fair.”\nCatherine raised her brows."
      },
      {
        "paragraph": "“Fine. If you manage to win this game for me, I’ll help you save one person when you encounter a\nproblem next time. But it’s only limited to one person,” Titus said after some thought. “Alright.”"
      },
      {
        "paragraph": "Catherine nodded before she spontaneously bent over and moved one of the pawns in front of him."
      },
      {
        "paragraph": "After fixing his eyes on it for a while, Titus burst out laughing. “Amazing. This is amazing. Why didn’t I\nthink of it?”"
      },
      {
        "paragraph": "“It’s not because you didn’t think of it. You’re just not familiar with this type of chess,” Catherine\nanswered with a smile."
      },
      {
        "paragraph": "“Fine. Everyone has their own strengths, and chess is my weakness. I’m not shy to admit it.”"
      },
      {
        "paragraph": "Titus waved his hand in a light-hearted manner."
      },
      {
        "paragraph": "A trace of admiration shone in Catherine’s eyes. “Mr. Costner, I think my boyfriend is done, so I have to\ngo now, lest he comes over and disturbs you.”"
      },
      {
        "paragraph": "Titus asked playfully, “How sure are you that he’ll disturb me when he comes over?”"
      },
      {
        "paragraph": "“I don’t know. But considering your status, I don’t think you’ll want to meet any random person. Of\ncourse, if Shaun performs well, he’ll be able to get acquainted with a powerhouse like you. But if the\ncontrary happens, you’ll see us as having scheming minds. ” Catherine expressed her worries candidly."
      },
      {
        "paragraph": "“You’re right.” Titus nodded, his eyes flashing with praise. “But don’t you need any proof of the promise\nI made just now?”"
      },
      {
        "paragraph": "“Given your status, I don’t think it’s warranted, Mr. Costner. What’s more, if you really plan to go back\non your word, there’s nothing I can do about it. Even writing a note as proof will be useless.” Catherine\nglanced at the time. “Goodbye, Mr. Costner.”"
      },
      {
        "paragraph": "Soon after she left, someone walked out from a dark corner."
      },
      {
        "paragraph": "Wesley lowered his head and gazed at the photos in his hand. From these photos, Catherine and Titus\nwere seen standing at one side of the chessboard, with one of them standing and the other sitting."
      },
      {
        "paragraph": "Titus’s lips were smiling with satisfaction."
      },
      {
        "paragraph": "Resentment filled Wesley’s heart."
      },
      {
        "paragraph": "He did not expect Catherine to run into Titus, who was supposed to hate her. However, he actually had\na pleasant chat with her."
      }
    ]
  },
  {
    "title": "Chapter 1565 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "No way."
      },
      {
        "paragraph": "Wesley must not let Titus and Catherine get close, or they would ruin his plans."
      },
      {
        "paragraph": "As for these few photos, he could make good use of them."
      },
      {
        "paragraph": "Amid his messy thoughts, he suddenly heard footsteps behind him."
      },
      {
        "paragraph": "Hence, he immediately dashed to the other side."
      },
      {
        "paragraph": "Nathan soon walked up to Titus and said courteously, “President Costner, I’m sorry to keep you\nwaiting.”"
      },
      {
        "paragraph": "“No worries. This game has been solved.” Titus gestured at the chess with his chin."
      },
      {
        "paragraph": "After catching a glimpse at it, Nathan was stunned. “That’s amazing. I didn’t know you were so\nknowledgeable about this type of chess, President Costner.”"
      },
      {
        "paragraph": "Titus gave a faint smile but did not reveal that someone taught him. “Actually, I’m here because of the\nmatter with the Zeller family. Anyhow, you’ve achieved what you wanted, and the Zeller family can’t\nthreaten you anymore. So can you help me out, Prime Minister Snow?”"
      },
      {
        "paragraph": "“Okay, Mr. Costner. Since you’ve made this request, I’ll definitely fulfill it. However, this issue is too\nserious. If I don’t punish two people, I can’t answer to the public, ” Nathan said helplessly."
      },
      {
        "paragraph": "Titus frowned before he finally said, “In that case, you can arrest two random indirect descendants of\nthe Zeller family and punish them. After all, the Zeller family offended Shaun and the Snow family\nbecause of me…”"
      },
      {
        "paragraph": "After he finished speaking, he darted Nathan a pensive look. “Shaun is quite closely connected to the\nSnow family, huh?”"
      },
      {
        "paragraph": "Upon hearing it, Nathan felt ill at ease. He could not afford to offend the person in front of him."
      },
      {
        "paragraph": "Otherwise, Australia’s global development might regress to how it was ten years ago. “Mr. Costner, I’m\nnot clear about the personal vendetta between you and Shaun, but as you can see, Shaun is no\nordinary man. He has dirt on the Zeller family and perhaps on me too. If Australia gets a new prime\nminister again, the country will be in turmoil."
      },
      {
        "paragraph": "There’s really no need to disrupt the citizens’ lives just because of the personal vendetta between you\nboth.”"
      },
      {
        "paragraph": "Titus smiled thinly. “Prime Minister Snow, you’re quite a good negotiator. Fine, I’ll stop pressuring you\nthen. But I can’t guarantee that I’ll behave the same again next time.”"
      },
      {
        "paragraph": "At that, he rose to his feet. “By the way, I hope you’ll keep my identity under the hat.”"
      },
      {
        "paragraph": "Only after Titus left did Nathan heave a sigh of relief."
      },
      {
        "paragraph": "At 9:00 p.m."
      },
      {
        "paragraph": "In the villa, Rebecca knocked on the master bedroom door with a glass of milk in her hand."
      },
      {
        "paragraph": "“Come in.”"
      },
      {
        "paragraph": "As soon as Sheryl’s voice rang from the room, Rebecca walked in. “Mom, I realized that your appetite\nhasn’t been great, so I made a glass of milk for you.”"
      },
      {
        "paragraph": "“Mm. ” Sheryl had dried her hair after a bath and was now rubbing her temples."
      },
      {
        "paragraph": "“Mom, are you feeling uncomfortable? Let me give you a massage. ” Rebecca put the glass of milk in\nfront of her. Then, she walked behind Sheryl and massaged her temples."
      },
      {
        "paragraph": "“Perhaps I haven’t acclimatized to Canberra. The weather here is a bit dry. Since I’ve been here, I\nseem to have lost my appetite.”"
      },
      {
        "paragraph": "Sheryl took a sip of milk. For some reason, she found herself always grumpy recently."
      },
      {
        "paragraph": "“The weather here isn’t as nice as Neah Bay’s. It always feels like autumn over there.” After Rebecca\nwatched Sheryl gulp down the milk, her eyes flashed with unease."
      },
      {
        "paragraph": "Of course, she was aware of what was wrong with Sheryl. Every night, Sheryl would drink the milk that\nshe had drugged. Little by little, Sheryl was getting grumpier. It made Rebecca worried that it would\narouse Titus and Matthew’s suspicions."
      },
      {
        "paragraph": "However, if she reduced the dosage of the drug, she was afraid that Sheryl would soon recover her old\nmemories."
      },
      {
        "paragraph": "“Mom, why don’t you head back to Neah Bay early?” Rebecca asked with a concerned look on her\nface. “I haven’t taken revenge on your grandmother’s behalf yet. I’m in no mood to return.”"
      }
    ]
  },
  {
    "title": "Chapter 1566 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "After Sheryl finished speaking, Rebecca’s phone suddenly vibrated."
      },
      {
        "paragraph": "Rebecca took out her phone, only to see two photos of Titus and Catherine that Wesley had sent. She\nwondered when did Titus meet Catherine. They even seemed to be on good terms."
      },
      {
        "paragraph": "She grasped Wesley’s point in an instant."
      },
      {
        "paragraph": "“What’s the matter?” Sheryl turned around upon noticing that Rebecca had remained still."
      },
      {
        "paragraph": "“Mom, my friend bumped into Catherine at tonight’s banquet, but why was she with Uncle Titus?”\nRebecca feigned confusion and showed her the photos."
      },
      {
        "paragraph": "Sheryl was stunned to see the photos."
      },
      {
        "paragraph": "Titus was usually a cold fish, but he seemed very close to Catherine in the photo. Sheryl wondered\nwhat Catherine had told him to make him smile."
      },
      {
        "paragraph": "Having slept beside him for more than ten years, Sheryl could tell whether it was a sincere smile or not."
      },
      {
        "paragraph": "In fact, countless young women had been deliberately trying to approach Titus over the years.\nHowever, she was under no illusion that he was loyal to her. The woman in the photo… bore a closing\nresemblance to her— no, the woman looked very much like her younger self."
      },
      {
        "paragraph": "Although Sheryl was still beautiful and in good shape, what were women most sensitive to?"
      },
      {
        "paragraph": "They were afraid that their husbands would meet a woman who resembled them and looked much\nyounger than them."
      },
      {
        "paragraph": "This would make it easy for men to substitute their wives with a younger woman."
      },
      {
        "paragraph": "Sheryl’s pretty face immediately stiffened for a moment."
      },
      {
        "paragraph": "At that moment, a sense of panic and irritation that she had never felt before welled up inside her."
      },
      {
        "paragraph": "Nevertheless, she tried hard to suppress it."
      },
      {
        "paragraph": "Rebecca glanced at Sheryl’s expression and said, “I need to text this friend to tell him that it’s okay to\ntake photos of Catherine. But if Uncle Titus finds out about it, he’ll be in trouble.”"
      },
      {
        "paragraph": "After that, Rebecca pretended to text seriously in front of Sheryl. Upon sending the message, she said\nplayfully, “Mom, please don’t ever tell Uncle Titus about it. I’m afraid he’ll cause my friend trouble.\nHaving said that, you should remind Uncle Titus that Catherine is very cunning. I’m worried he’ll be\nswayed after seeing someone who looks like you. ”"
      },
      {
        "paragraph": "“Rebecca. ” Sheryl leaped to her feet. “ I won’t tell him about it. You can head to your room and rest.”"
      },
      {
        "paragraph": "“Mm. You should rest early too. ” Rebecca then left with the glass in her hand."
      },
      {
        "paragraph": "Once the door was closed, Sheryl picked up her phone to call Titus. However, after she found his\nnumber, fury burned within her for some inexplicable reason, and she tossed the phone onto the floor\nstraight away."
      },
      {
        "paragraph": "Only at 1o:oo p.m. did Titus sneak into the bedroom. All of a sudden, Sheryl sat up on the bed."
      },
      {
        "paragraph": "Titus was shocked. He quickly smiled and hugged her. “Wifey, did I wake you up?”"
      },
      {
        "paragraph": "However, Sherly only felt as though she smelled a woman’s scent on his body. She then pushed him\naway forcefully. “Get lost. I’m disgusted by the woman’s scent on your body.”"
      },
      {
        "paragraph": "Titus was puzzled. Nevertheless, he lowered his head and sniffed at himself. “No. This is my scent,"
      },
      {
        "paragraph": "isn’t it?”"
      },
      {
        "paragraph": "“Stop arguing. I can smell it.” Sheryl kept an impassive face."
      },
      {
        "paragraph": "Titus felt aggrieved for being wronged. He immediately took off his suit and threw it at her. “ Smell it\nproperly. Where’s the woman’s scent?"
      },
      {
        "paragraph": "Something must be wrong with your nose.”"
      },
      {
        "paragraph": "Those photos flashed across Sheryl’s mind once again. She could not help but sweep the suit to the\nfloor. “ Let me ask you. Where did you go today? ”"
      },
      {
        "paragraph": "“The Snow family invited me to their banquet. I discussed something with Nathan and asked him to let\nthe Zeller family off the hook.”"
      },
      {
        "paragraph": "“Really?” Sheryl scoffed. With that, she was more convinced that he was lying. He was having a\npleasant chat with Catherine instead. “So have you discussed your plans to handle Shaun and\nCatherine?”"
      }
    ]
  },
  {
    "title": "Chapter 1567 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Nathan doesn’t want to have a hand in it, and the Hill family has dirt on him. Given that it’s our\npersonal vendetta, there’s no need to cause social unrest,” Titus said honestly. Besides, he had a\nfavorable impression of Catherine."
      },
      {
        "paragraph": "Sheryl snorted. “If that’s the case, when can I take revenge on behalf of my mom and Rebecca? If you\ncan’t do it or you don’t feel like doing it, I’ll do it myself. There are still certain things I can handle\nwithout you.”"
      },
      {
        "paragraph": "Titus found those words nasty. “Sherry, if you want to deal with Shaun and Catherine quickly, all you\ncan do is pressure Nathan. I know what methods you’re planning to solve it with. It’s going to cause\nglobal turmoil, and it’s really unnecessary to go to that extent.”"
      },
      {
        "paragraph": "“I guess it’s because you don’t want to deal with them. Is it because you’ve met Catherine? You can’t\nbear to do it to her, huh?” Sheryl suddenly teased him and said, “She looks very much like me when I\nwas younger.”"
      },
      {
        "paragraph": "Titus was shocked. Staring at the cold woman on the bed who refused to believe him, he suddenly felt\na sense of unfamiliarity and disappointment. “ Sherry, what do you mean?”"
      },
      {
        "paragraph": "“I’ve seen Catherine’s looks.” Sheryl replied nonchalantly, “ Some nieces look similar to their aunts, and\nshe does look quite like me. Perhaps you can’t bear to deal with her after meeting her. If you take her\nas my younger self, what’s going to happen to me? After all, I’m not as young as her.”"
      },
      {
        "paragraph": "Titus finally grasped her point. However, he also lost his temper. “Sheryl, am I such a dirty man to\nyou?” His eyes were filled with fury."
      },
      {
        "paragraph": "At the sight of his exasperated look, Sheryl felt aggrieved and heartbroken. As far as she could\nremember, Titus had never been so fierce to her. However, he was now furious with her because of\nCatherine."
      },
      {
        "paragraph": "“Titus Costner, what a b*stard you are.” Sheryl lifted a pillow and hurled it at him. “Get out.”"
      },
      {
        "paragraph": "Titus gnashed his teeth. Then, he bit the bullet and calmed her with a soft tone, “Sherry, it really\nsaddens me that you perceive me this way. Don’t you know my feelings for you by now?”"
      },
      {
        "paragraph": "Upon noticing that his tone had softened, Sheryl began to pull herself together. “ I won’t believe you\nunless you bring Catherine here and let me teach her a lesson, or you send her to jail.”"
      },
      {
        "paragraph": "Titus went quiet."
      },
      {
        "paragraph": "He knew the lesson that Sheryl wanted to teach Catherine was certainly not a simple one."
      },
      {
        "paragraph": "He must have proof before sending Catherine to jail. Otherwise, why did he need the Zeller family to\noppress Shaun?"
      },
      {
        "paragraph": "“Sherry, you’re not talking sense…”"
      },
      {
        "paragraph": "“If you can’t do it, get out,” Sheryl roared in agitation when she caught him hesitating."
      },
      {
        "paragraph": "He never used to hesitate when she ordered him to do things back then. Yet this time, he actually\nhesitated."
      },
      {
        "paragraph": "Titus pursed his thin lips grimly before turning around and walking out of the room."
      },
      {
        "paragraph": "In the dark, Sheryl could not resist tossing and pulling her blanket."
      },
      {
        "paragraph": "She had no idea what was wrong with herself either. Perhaps it was her insecurities about her marriage\nthat contributed to it."
      },
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "When Matthew stretched his body and walked out, he suddenly saw his father coming out of the study."
      },
      {
        "paragraph": "He widened his eyes and swiftly approached him. “ Dad, did Mom kick you out of the room?”"
      },
      {
        "paragraph": "Sheryl used to do that to him, but it was always with reason. However, this time, it was different."
      },
      {
        "paragraph": "Annoyed, Titus criticized in a low voice, “ I have no idea what’s on your mom’s mind. She actually\nsuspects that I’m interested in Catherine.”"
      },
      {
        "paragraph": "“What?” Matthew froze."
      },
      {
        "paragraph": "He could not understand his mother either. Was she not aware of Titus’s feelings for her? Titus was\nalmost her slave."
      }
    ]
  },
  {
    "title": "Chapter 1568 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "During breakfast, the usually warm atmosphere felt as though the air conditioner was switched on."
      },
      {
        "paragraph": "Sheryl suddenly said, “After sleeping on it, I’ve decided that the two of you shouldn’t get involved in our\nJones family’s personal vendetta.”"
      },
      {
        "paragraph": "Matthew choked on his egg. “Mom, what are you planning to do?”"
      },
      {
        "paragraph": "“Mom, what happened between you and Uncle Titus?” Rebecca also had a confused look on her face\nwhen, in fact, she was secretly pleased. She did not expect her plan to work out so soon."
      },
      {
        "paragraph": "Thanks to the drug, Sheryl had become temperamental. Otherwise, the sensible Sheryl would not have\ngotten cheated so easily."
      },
      {
        "paragraph": "“This is the adults’ matter. You guys shouldn’t bother with it.”"
      },
      {
        "paragraph": "At that, Sheryl put down her cutleries and walked away."
      },
      {
        "paragraph": "Matthew discreetly shifted his gaze to his father. Titus rubbed his brows before turning around and"
      },
      {
        "paragraph": "saying to Matthew, “Have someone keep an eye on Catherine in case something happens to her.”"
      },
      {
        "paragraph": "“Dad…” Matthew was slightly surprised. “ Previously, didn’t you…”"
      },
      {
        "paragraph": "“I objected to it previously. But after talking to her a few times, I’ve somewhat understood your\nviewpoint.” Titus said, “What’s more, through this incident, I’ve realized that Shaun isn’t that simple. If\nsomething happens to Catherine before we deal with him, he’ll drag us down and make us suffer\ntogether. By then, we might not be able to leave Australia safely, considering that most of our"
      },
      {
        "paragraph": "people aren’t here.”"
      },
      {
        "paragraph": "“Dad, you’re brilliant.” Matthew raised his thumb."
      },
      {
        "paragraph": "Little did Catherine know that she was already in someone’s crosshairs."
      },
      {
        "paragraph": "Ever since Hudson Corporation was transferred to Freya, Catherine did not have to go to the office. So,\nevery day, she would come up with some architectural sketches and keep her two kids company at\nhome."
      },
      {
        "paragraph": "Sometimes, she would watch the news. Hill Corporation had been low-profiled recently. On the\ncontrary, Golden Corporation suddenly came into"
      },
      {
        "paragraph": "prominence by setting up three branches and taking on 80 percent of the production of local vaccines."
      },
      {
        "paragraph": "Within a week, Golden Corporation had become one of the top five enterprises in Australia."
      },
      {
        "paragraph": "Wesley was now at the height of his career."
      },
      {
        "paragraph": "Who would have expected that the then infamous Wesley would be able to turn things around so\nrapidly?"
      },
      {
        "paragraph": "Catherine understood that the moment Wesley began to take revenge on her would signify the end of\nShaun and her peaceful life."
      },
      {
        "paragraph": "At this thought, she strongly yearned for the peaceful life she was currently having with Shaun. Shaun\nhappened to be too busy to come back for lunch again, so Catherine prepared two more dishes and\nbrought them to him straight away."
      },
      {
        "paragraph": "She went all the way to the top floor, only to find that Shaun had gone down for a meeting. After she sat\nin his office waiting for half an hour, he returned at last."
      },
      {
        "paragraph": "“Cathy, what brings you here?” A look of delight washed over Shaun’s face."
      },
      {
        "paragraph": "“I came to make a spot check. I want to check if you’re keeping a mistress here. ” Catherine joked with\na grin."
      },
      {
        "paragraph": "“I do keep one here, and here she is.” Shaun hugged her and gave her a kiss."
      },
      {
        "paragraph": "Catherine instantly turned shy and pushed him away. “Please. Aren’t you afraid that the tigress in your\nhouse finds out about it?”"
      },
      {
        "paragraph": "“Is the tigress as fierce as you?” Shaun pinched her face. “The tigress is fierce in bed and out of bed. ”"
      },
      {
        "paragraph": "“What a pervert.” Catherine rolled her eyes at him before she passed him a lunchbox. “Here’s your\nlunch.”"
      },
      {
        "paragraph": "“Thanks, my wife. Let’s eat together.” Just as Shaun opened the lunchbox, he suddenly heard a\nsecurity guard’s voice outside."
      },
      {
        "paragraph": "“Stop there. You guys can’t enter. This is the chairman’s office.”"
      },
      {
        "paragraph": "“Get lost. It’s up to us to enter as we please.”"
      },
      {
        "paragraph": "After the pompous shout, the half—closed office door was kicked open."
      },
      {
        "paragraph": "Two Black bodyguards, who looked sturdily built and threatening, first came in and stood at the door.\nAfter that, Rebecca strutted into the office in a red skirt. She was also wearing a pair of sunglasses, a\nhat while holding a purse."
      }
    ]
  },
  {
    "title": "Chapter 1569 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Behind Rebecca was a middle-aged male foreigner. He was wearing a black suit, oozing an aura akin\nto that of a Wall Street business elite."
      },
      {
        "paragraph": "“Rebecca Jones, are you out of your mind? What gives you the right to enter this place as you please?”\nCatherine immediately got up from Shaun’s lap."
      },
      {
        "paragraph": "Looking at Rebecca’s dramatic entrance, Catherine had a sinking feeling."
      },
      {
        "paragraph": "Shaun’s thoughts were similar to hers, but he looked much graver and calmer. His eyes swept over the\nforeigner behind Rebecca whom he found familiar."
      },
      {
        "paragraph": "With his good memory, Shaun instantly recalled who the foreigner was. A hint of surprise flashed\nacross his dark gaze."
      },
      {
        "paragraph": "“Apparently, you came prepared.” Shaun knitted his brows together, his eyes darkening."
      },
      {
        "paragraph": "“It seems that you recognize me, Chairman Hill.” The middle -aged man said with a smile, “Let me\nofficially introduce myself once again. I’m Julian Grayson.”"
      },
      {
        "paragraph": "Rebecca smiled smugly at the sight of Shaun’s sullen expression. “Catherine Jones, you’re such a\ndumb*ss. Let me introduce him to you. He’s Julian Grayson, the top merger and acquisitions specialist\nin the world. With the help of Mr. Grayson’s team, we’ve acquired 5o percent of Hill Corporation’s\nshares.”"
      },
      {
        "paragraph": "Catherine’s head buzzed. As she was not familiar with finance-related matters, she was slightly\nconfused after hearing it. “This is impossible. How could the shareholders of Hill Corporation have\ngiven you their shares?”"
      },
      {
        "paragraph": "Moreover, it was extremely unlikely that Shaun had not received any news about such a serious issue."
      },
      {
        "paragraph": "“It’s because they acquired it with evil intentions. ”"
      },
      {
        "paragraph": "Shaun put his hand on Catherine’s shoulder heavily. Seemingly, he was trying hard to fight back the\nrage inside him."
      },
      {
        "paragraph": "Catherine turned around and realized that Shaun’s expression was still calm. However, there was a\nsurge of bottomless grimness in the depths of his eyes."
      },
      {
        "paragraph": "All of a sudden, she took pity on Shaun as he had put a lot of blood, sweat, and tears into Hill\nCorporation. To the Hills, the company was their everything. He had taken great pains to overcome the\nobstacle when the company was under investigation, only to discover that Rebecca now owned half of\nHill Corporation."
      },
      {
        "paragraph": "“You don’t have to know how I acquired Hill Corporation. Anyway, I’m now on an equal footing with you\nin the company. In this case, why can’t I come to your office? I can even…”"
      },
      {
        "paragraph": "Rebecca strutted toward the desk and pressed her hands on it. “I can even demand this office.”"
      },
      {
        "paragraph": "“You b*tch.” Unable to tolerate Rebecca’s behavior, Catherine lifted her hand to slap Rebecca."
      },
      {
        "paragraph": "Nevertheless, the bodyguard behind Rebecca was quicker in grabbing hold of Catherine’s hand."
      },
      {
        "paragraph": "As much as Catherine wanted to escape his grasp, she noticed that the bodyguard was much stronger\nthan her."
      },
      {
        "paragraph": "This realization began to fill her with fear. To her, she was considered very skillful."
      },
      {
        "paragraph": "Where on earth did Rebecca meet such a person?"
      },
      {
        "paragraph": "“Let go of her.” Shaun punched the Black bodyguard."
      },
      {
        "paragraph": "The bodyguard could not be bothered about Shaun either until his nose began to bleed. That was when\nhe furiously called out to another colleague to attack Shaun together."
      },
      {
        "paragraph": "They got into a fight in the office in a flash. With that, Hadley dashed in with his bodyguard."
      },
      {
        "paragraph": "As Rebecca was happily watching the scene, her head suddenly hurt. Catherine had pulled her and\nstretched out her hand to slap her."
      },
      {
        "paragraph": "“Catherine Jones, I definitely will not let you off the hook.” Rebecca yelled hysterically, “Quickly, save m\ne and kill her.”"
      }
    ]
  },
  {
    "title": "Chapter 1570 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Shut up.” Catherine directly pulled Rebecca toward her. In a state of panic, the two bodyguards\nstopped fighting."
      },
      {
        "paragraph": "Oh no. They were going to watch the First Young Lady get beaten up."
      },
      {
        "paragraph": "“Hurry up, and let go of First Young Lady, or I’ll put you through hell, ” one of the bodyguards shouted."
      },
      {
        "paragraph": "At the sight of the situation, Shaun was the first to say, “There’s no need to continue fighting. Let’s set\nour hands free at the same time.”"
      },
      {
        "paragraph": "After Catherine exchanged glances with Shaun, she shoved Rebecca to that bodyguard."
      },
      {
        "paragraph": "At this moment, Rebecca’s image of an eminent young lady was gone. She pointed at Catherine and\nsaid in exasperation, “Kill her— no, pull all her hair off and slap her ten times.”"
      },
      {
        "paragraph": "“First Young Lady…” The two bodyguards, who were in a dilemma, pointed to the back. “Look… ”"
      },
      {
        "paragraph": "“What is there to look at?” Rebecca turned around, only to see a crowd of bodyguards at the door. She\nscowled."
      },
      {
        "paragraph": "She covered her painful face and said with dissatisfaction, “Catherine Jones, just wait. I’ll definitely\nsettle this score with you. I didn’t come here today to fight. I just want to let you guys know that I own\nhalf of Hill Corporation from today onward, so I have every right to manage it.”"
      },
      {
        "paragraph": "After she was done speaking, she asked someone to toss the agreement onto the desk. “From today\nonward, my team will be stationed in Hill Corporation. To be honest, I’m not happy with you being the\nchairman, and I seriously doubt your ability. Hill Corporation has been established for over 1oo years\nbut has only brought in so little profit every year. I think something’s wrong with"
      },
      {
        "paragraph": "the management, so there’s a need to restructure it.”"
      },
      {
        "paragraph": "Shaun cast an indifferent look at Rebecca in front of him. Then, he suddenly scoffed and said,\n“Rebecca Jones, I regret my decision. Back then, I shouldn’t have sold you to the mountains and made\nyou marry the old man.”"
      },
      {
        "paragraph": "At the mention of the incident, Rebecca’s face turned ghastly."
      },
      {
        "paragraph": "That was the worst humiliation in her life."
      },
      {
        "paragraph": "Shaun added cruelly, “I should’ve killed you by dumping you into the sea.”"
      },
      {
        "paragraph": "“Unfortunately, I’m still alive. Shaun, you tortured me so terribly back then. I swore that I’d come back\nand take revenge on you one day. Just wait. This is only the beginning.” After Rebecca provoked him,\nshe turned around. “Now, I’m going to take a tour. By the way, I’ve never been to the factory and lab.”"
      },
      {
        "paragraph": "Once she left, Shaun called Hadley over. “Get a group of people to follow her to the lab and factory.\nDon’t let her enter those places.”"
      },
      {
        "paragraph": "Hadley felt uneasy. “I can stop her today, but what if she brings in more people tomorrow? Besides, the\ntwo bodyguards are as good as our Liona members.”"
      },
      {
        "paragraph": "“Get Liona members here then. Let’s see how she can still boss people around in Hill Corporation by\nthen,” Shaun responded coldly."
      },
      {
        "paragraph": "Seeing him stifling his anger, Hadley nodded."
      },
      {
        "paragraph": "“Shaunny, what on earth is going on?” At this moment, Catherine still could not figure out how or why\nRebecca owned half of Hill Corporation."
      },
      {
        "paragraph": "Shaun thumped his fist on the table."
      },
      {
        "paragraph": "He admitted that he had never failed or fumed so badly. He had never been this exasperated even\nwhen Hill Corporation fell."
      },
      {
        "paragraph": "“The person you saw just now is Julian Grayson, the top merger and acquisitions specialist in the\nworld. He has a team of financial specialists who’ll do everything to acquire other companies. However,\nnot everyone can hire such a team.”"
      },
      {
        "paragraph": "Shaun forced a smile and explained, “As far as I know, it requires at least 200 billion dollars to hire\nJulian Grayson.”"
      },
      {
        "paragraph": "Catherine looked dumbfounded. No one would spend 200 billion dollars hiring his team unless they\nwere the wealthiest people in the world."
      }
    ]
  },
  {
    "title": "Chapter 1571 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Of course, since they’ve successfully acquired many shareholders’ shares without my knowledge, it\nmeans the price they’ve offered must be attractive. They could have threatened or enticed the\nshareholders too.”"
      },
      {
        "paragraph": "Shaun clenched his fists. “The price they offered was definitely much higher than the market price. The\nperson behind Rebecca is not simple at all and must be one of the few wealthiest people in the world.”"
      },
      {
        "paragraph": "Catherine was astounded. “Why would that person let Rebecca waste so much of their money?”"
      },
      {
        "paragraph": "“You’re right. Spending so much money acquiring Hill Corporation to let Rebecca vent her anger is\nsuch a waste. ” Shaun was baffled. “They must be crazy. They’re not even her biological parents.”"
      },
      {
        "paragraph": "Catherine also found those people to be crazy."
      },
      {
        "paragraph": "At this moment, she wished she could meet the person behind Rebecca and beat him up."
      },
      {
        "paragraph": "“How many shareholders are left in Hill"
      },
      {
        "paragraph": "Corporation?” Catherine asked anxiously"
      },
      {
        "paragraph": "Shaun glanced at her helplessly. “My mom, aunt, uncle, and I.”"
      },
      {
        "paragraph": "Catherine was speechless."
      },
      {
        "paragraph": "In this regard, all the shareholders’ shares had been acquired except for the Hill family’s."
      },
      {
        "paragraph": "“In other words, Rebecca has become the largest shareholder in Hill Corporation, right?” A while later,\nshe stated the fact in agony."
      },
      {
        "paragraph": "Shaun scowled as he nodded. Beneath his eyelashes was nothing but grimness. “Let’s head to the Hill\nfamily’s residence.”"
      },
      {
        "paragraph": "During their journey, Director Owens took the initiative to call Shaun. His words were filled with\napologies. “Shaun, I’m really sorry…”"
      },
      {
        "paragraph": "Shaun’s thin lips curled up indifferently. “Director Owens, you were my grandpa’s best friend back then,\nand that was why you became the largest shareholder in Hill Corporation. How dare you betray the\ncompany in secret.”"
      },
      {
        "paragraph": "The other end of the phone was quiet for a while before Director Owens replied in embarrassment, “\nShaun, I was left with no choice. My sons’ business investments out there have been failing one after"
      },
      {
        "paragraph": "another. At this point, everyone in the Owens family is counting on me. Given that I have so many\ndescendants, I need to leave something for them.”"
      },
      {
        "paragraph": "“Haven’t you gotten huge bonuses from Hill Corporation over the years?” Shaun could no longer hold\nback his anger. “Moreover, the future of Hill Corporation was very promising…”"
      },
      {
        "paragraph": "“No, Shaun. The person targeting Hill Corporation is no ordinary person. Even if I didn’t sell my shares,\nHill Corporation wouldn’t be able to hold out for one year.” Director Owens said with embarrassment,\n“When Hill Corporation collapses after a year, how much do you think it can be sold for?”"
      },
      {
        "paragraph": "“Director Owens, don’t you know my ability?” Shaun said furiously, “No matter how many setbacks Hill\nCorporation has suffered, I’ve managed to overcome all of them with my leadership. I even made Hill\nCorporation the top company in Australia again.”"
      },
      {
        "paragraph": "“Shaun, the glory that Hill Corporation has right now is only superficial.” Director Owens sighed and\nsaid, “Although you have a good relationship with the Snow family, it’s only temporary. You don’t even\nunderstand the person behind this issue. Their decisions can simply affect the world. Can you afford to\nprovoke such a person?” Shaun’s body stiffened."
      },
      {
        "paragraph": "Catherine, who was holding his hand beside him, was at her wits’ end as well."
      },
      {
        "paragraph": "“Besides, it was the other party who offered the price. I couldn’t reject it.” Director Owens laughed\nwryly. “They offered to buy the 3o percent of shares I had for goo billion dollars, and what was more,\nthey paid me the amount straight away. Well, how could I not sell the shares? Even if I chose not to sell\nthem, my sons would think of ways to kill me so that they would come into my inheritance and sell\nthem.”"
      },
      {
        "paragraph": "Shaun was so shocked that his eyes widened. For a long time, he did not utter a word."
      }
    ]
  },
  {
    "title": "Chapter 1572 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Indeed, that was an amount that no one could reject. “Even other minor shareholders could easily get a\nfew hundred billion dollars, let alone me.” Director Owens’s tone was apologetic and filled with guilt.“\nShaun, I watched you grow up after all. Listen to me. Give up on Hill Corporation. Take your\ngrandparents and the others and leave. Don’t end u p with nothing in the end.”"
      },
      {
        "paragraph": "With that, Director Owens ended the call."
      },
      {
        "paragraph": "Shaun put his phone down. He lowered his head and hugged Catherine tightly. After a long while, he\nsaid in a low voice, “Cathy, take the children and my family with my dad to Country Y first.”"
      },
      {
        "paragraph": "“What about you?” Catherine lifted her head and asked."
      },
      {
        "paragraph": "“I’ll go over after I wrap up everything here.”"
      },
      {
        "paragraph": "Shaun patted her hair helplessly. “Director Owens is right. With our current ability, we won’t be able to\ngo against the other party. They’re obviously using money to crush us and leaving us with no choice.\nSo just leave Australia first. Didn’t we talk about this before?”"
      },
      {
        "paragraph": "Catherine stared at Shaun for a moment before she suddenly said, “I don’t want to.”"
      },
      {
        "paragraph": "“Cathy…” Shaun’s tone became stern."
      },
      {
        "paragraph": "Catherine got out of his embrace. “Do you think I don’t know? Your worries will be gone once I take\nyour family and leave. Then, you’ll expose the person behind Rebecca and kill Rebecca even if you\nhave to risk everything or even die with her, right? Shaun, you’re discontented.”"
      },
      {
        "paragraph": "“Cathy, I won’t. I will look for you guys as soon as possible,” Shaun said in a low voice."
      },
      {
        "paragraph": "“Forget it. I won’t believe you. You could still accept the investigation the last time. But now that\nRebecca has snatched your company away, she’ll ruin your efforts. Hill Corporation is your heart and\nsoul. Your hard work all these years will become"
      },
      {
        "paragraph": "Rebecca’s props, and this isn’t what you want to see. That is why you want to stay behind to destroy\nHill Corporation and use Liona’s power to settle this once and for all, right?”"
      },
      {
        "paragraph": "Catherine stared at him. “ Shaun, I know you well.”"
      },
      {
        "paragraph": "He was not just an entrepreneur. He was also a person with dreams."
      },
      {
        "paragraph": "Hill Corporation was Shaun’s dream. Catherine had seen how happy he was these days because of\nthe new product development."
      },
      {
        "paragraph": "Moreover, he was such a prideful person. Running away after getting defeated by Rebecca multiple\ntimes was not his way of doing things."
      },
      {
        "paragraph": "Catherine had seen through all of Shaun’s little thoughts, which made him a little annoyed. “That’s\nright. It’s just as what you said. Cathy, you have to think for the children. Do you wish for them to be\nwithout a mother? As for me, their father, the time I’ve spent with them hasn’t been long. They depend\non you more.”"
      },
      {
        "paragraph": "“Shaun, your words make me very disappointed. ”"
      },
      {
        "paragraph": "Catherine let go of his hand. There was now an angry look in her eyes. “The children aren’t mine alone.\nYou have the responsibility too. Since you don’t want to see through it, you shouldn’t have looked for\nme to make up with you back then.”"
      },
      {
        "paragraph": "Shaun was hurt and ashamed by the accusation. “ What can I do? Cathy, Hill Corporation isn’t just my\nheart and soul. The advanced technology there consists of the fruits of many years of research in my\ndad’s company. Do you want me to surrender everything to Rebecca? That disgusting woman is doing\nwhatever she wants to in Australia. I feel f*cking nauseated just by seeing it.”"
      },
      {
        "paragraph": "Catherine felt at a loss too."
      },
      {
        "paragraph": "He was right. How did an ant like Rebecca grow to be where she was today?"
      },
      {
        "paragraph": "“You should leave. I’ll deal with Rebecca and the person behind her back. I’ll destroy them.” There was\na bloodthirsty coldness in Shaun’s eyes."
      }
    ]
  },
  {
    "title": "Chapter 1573 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "When the car arrived at the Hill family’s manor, Shaun and Catherine had not settled the problem yet."
      },
      {
        "paragraph": "Catherine got down from the car and left first. She was slightly angry."
      },
      {
        "paragraph": "Shaun looked at her from behind for a while before he strode ahead and followed her."
      },
      {
        "paragraph": "When he reached the door, Valerie’s angry yelling came from the inside. “Catherine, your cousin gave\nme a call. You’re the one who brought all these troubles. Hill Corporation was investigated because of\nyou too. Shaun hid the truth from us. If I were you, I’d put myself out there voluntarily so that Rebecca’s\nanger could quell and see if things could be settled peacefully. Anyway, you shouldn’t drag our Hill\nfamily’s 1oo-year-old business down with you.”"
      },
      {
        "paragraph": "Catherine stood in the middle of the living room. Her straight back was trembling slightly."
      },
      {
        "paragraph": "Shaun found the scene unbearable to watch. “ Enough. This issue can’t be solved simply by putting\nCatherine out there. Rebbeca is targeting me for throwing her into the mountains last time because I\nwanted to teach her a lesson. I didn’t expect her to escape. We don’t know who she has met overseas\nin the last few years too.”"
      },
      {
        "paragraph": "“Anyway, if you didn’t meet Catherine, we wouldn’t have offended Rebecca. Second Brother, don’t you\nthink so?” Valerie asked Spencer."
      },
      {
        "paragraph": "Annoyance was written all over Spencer’s face. However, his wife, Yvette, stepped forward. Her eyes\nwere bloodshot."
      },
      {
        "paragraph": "“I’m on Valerie’s side this time. I’ve really had enough. It seems like ever since Catherine showed up,\nthe Hill family has never had a day of peace."
      },
      {
        "paragraph": "Willie’s illness still hasn’t improved either. If this goes on, will the Hill family be able to pay for Willie’s\nmedical fees one day?”"
      },
      {
        "paragraph": "After she spoke, she turned around and looked toward Catherine in agony. “I beg you to go find\nRebecca and solve the problems between yourselves. Don’t get us involved in this. My son has already\nbecome a retard. If something happens to us, his parents, what should he do for the rest of his life?”"
      },
      {
        "paragraph": "There was a lump in Catherine’s throat."
      },
      {
        "paragraph": "Yvette’s words were like chains wrapping around her."
      },
      {
        "paragraph": "Was it her fault?"
      },
      {
        "paragraph": "Perhaps she should not have gotten back together with Shaun."
      },
      {
        "paragraph": "“Enough, Aunt Yvette. I’ve said it before that even if I didn’t get back together with Catherine, Rebecca\nwould still come looking for me.” Shaun placed his long torso in front of Catherine. His voice was tense\nwith anger. “ If you’ve had enough, just leave. I’ll shoulder everything regarding Hill Corporation.”"
      },
      {
        "paragraph": "“How will you shoulder the responsibility? If we leave this place, besides some money we still have i n\nour hands, the most valuable asset we have is Hill Corporation’s shares.” Yvette said angrily, “Unless\nwe can sell the shares to Rebecca like the other shareholders.”"
      },
      {
        "paragraph": "“Sister-in-law is right.” Valerie stepped up too.“ I have 8 percent of the shares, and Rebecca has\noffered me 400 billion dollars. Mind you, this is a sky-high price.”"
      },
      {
        "paragraph": "Seeing Valerie speaking up, Yvette raised her head too. “That’s right. This sum of money is enough for\nus to leave Australia and live without worry. We can look for skilled doctors overseas to treat Willie’s"
      },
      {
        "paragraph": "illness too.”"
      },
      {
        "paragraph": "Shaun looked at his family members in utter disappointment. “So Rebecca has looked for you guys to\nsell your shares too.”"
      },
      {
        "paragraph": "“She only came to us today.” Valerie said, “Besides, the other directors have called me too. We’re\ndefinitely not her opponent. If we keep the shares, maybe Hill Corporation’s stock prices will depreciate\nnext month. By then, our shares will be worthless. Selling them off now is the best timing.”"
      },
      {
        "paragraph": "“Shut your mouth.” Old Master Hill could no longer stand it and threw a cup at Valerie. “Did I give you\nthe shares just to give it away? Do you know what situation Hill Corporation will face if you sell the\nshares?”"
      },
      {
        "paragraph": "Valerie avoided the cup frantically. She cried out, “ Dad, can you be more realistic? I’m still young. I still\nhave Queenie to take care of. Even if I don’t sell the shares, Hill Corporation won’t be able to hold on.”"
      },
      {
        "paragraph": "“You… ” Old Master Hill’s fingers trembled out of anger. Finally, he looked toward his son, who had\nbeen keeping his head low. “Spencer, what do you think?”"
      },
      {
        "paragraph": "“Dad, I just want more money. Actually, with the high price they have offered, we can take that money\nand establish another Hill Corporation overseas…” Spencer stammered."
      },
      {
        "paragraph": "“You unfilial son, do you know they’re buying the shares just to humiliate the Hill family? Are you willing\nto throw away your pride and dignity for the sake of money” Old Master Hill rapped the walking stick on\nthe floor agitatedly."
      }
    ]
  },
  {
    "title": "Chapter 1574 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Grandpa.” Shaun walked forward and patted the agitated Old Master Hill’s back. “Just let them be.\nSecond Uncle and Aunt Valerie have their own family and kids. Everyone has their own choices.”"
      },
      {
        "paragraph": "Valerie and Spencer both let out a sigh of relief when they saw Shaun agreeing. However, Valerie still\nmuttered discontentedly, “We didn’t want to sell the shares at first, but we were forced to. Why did\nShaun and Catherine have to offend such powerful people?”"
      },
      {
        "paragraph": "“Get lost.” Old Master Hill desperately wanted to hit her to death with his walking stick. “Since you’ve\nsold the Hill family’s properties, don’t ever come back.”"
      },
      {
        "paragraph": "“Dad, why don’t you and Mom leave with us?” Spencer said hesitantly."
      },
      {
        "paragraph": "“I’d rather hit my head and die than leave with you who sold your ancestors’ properties, ” Old Master\nHill said furiously."
      },
      {
        "paragraph": "Lea did not say a word from the beginning until the end as she sat on the chair. She still had not fully"
      },
      {
        "paragraph": "recovered from her injuries the last time. After the two people left, she said, “Shaun, what are you\nplanning to do?”"
      },
      {
        "paragraph": "“I’ve discussed this with cathy. You and Cathy can take Grandpa, Granny, and the children to settle\ndown at Country Y. I’ll go over after taking care of the things here,” Shaun explained the arrangements\ncalmly."
      },
      {
        "paragraph": "Catherine glanced at Shaun with mixed feelings."
      },
      {
        "paragraph": "Other people might not know what he was thinking, but she could see through him with just a glance."
      },
      {
        "paragraph": "“I can’t believe the Hill family has ended up in tatters.” Old Master Hill let out a long sigh."
      },
      {
        "paragraph": "Old Madam Hill consoled him, “Why haven’t you got over it? It’s fine as long as everyone is still alive.”"
      },
      {
        "paragraph": "During dinner, the two children had just come back from preschool."
      },
      {
        "paragraph": "Lea suddenly called them to her. “Suzie, Lucas, are you both willing to come with us to Country Y and\nlive there?”"
      },
      {
        "paragraph": "“Why do we suddenly have to leave?” Suzie was confused. “Where is Country Y? Is it very far?”"
      },
      {
        "paragraph": "“It’s quite far.” Shaun said gently, “It’s where your grandpa lives. The scenery there is very picturesque.”"
      },
      {
        "paragraph": "“Will sc*mmy dad and Mom go too?” Lucas asked nervously."
      },
      {
        "paragraph": "Shaun patted his head. His eyes were downcast. “We will.”"
      },
      {
        "paragraph": "“That’s fine then.” Suzie smiled brightly upon hearing that. “As long as our family is together, going\nanywhere is fine.”"
      },
      {
        "paragraph": "Catherine gripped her fork tightly."
      },
      {
        "paragraph": "After the children fell asleep at night, Shaun came out of the bathroom from his shower, only to see the\nwoman standing in front of the French windows. She was wearing white pajamas, and her long hair\nrested on her shoulders like silk. She exuded soft and fresh fragrance."
      },
      {
        "paragraph": "“Are you waiting for me…” Shaun walked over and extended his hands to hug her."
      },
      {
        "paragraph": "However, Catherine pushed him away. “ Shaun, if you don’t leave with me, I’ll break up with you\ntonight.”"
      }
    ]
  },
  {
    "title": "Chapter 1575 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun pretended not to hear her as he continued to walk over and hug her."
      },
      {
        "paragraph": "However, Catherine kept pushing, and both of them continued to shove each other in the dark."
      },
      {
        "paragraph": "In the end, the man was still stronger. As soon as Shaun pulled her into his embrace, he lowered his\nhead and kissed her deeply."
      },
      {
        "paragraph": "“Mm… Shaun, I’m not… joking.” Catherine kept avoiding him. Finally, with much difficulty, she blocked\nhis face with her hand."
      },
      {
        "paragraph": "“Cathy, if I don’t stay behind to finish off Rebecca and the person behind her, do you think Rebecca\nwon’t chase after you once you’ve escaped overseas with the children?”"
      },
      {
        "paragraph": "Shaun said with a hoarse voice, “I’ve discussed this with Nathan a few days ago. The force behind\nRebecca isn’t too influential in Australia. However, we’re stepping into their territory if we go overseas.\nEven with my dad protecting you guys, squashing all of you will be as easy as squashing an ant for\nthem. That’s why I must eliminate them in Australia. Do you understand?” Catherine was taken aback."
      },
      {
        "paragraph": "She understood."
      },
      {
        "paragraph": "Was that why Shaun wanted to use himself in exchange for her and the children’s safety?"
      },
      {
        "paragraph": "“Then I’ll stay behind. You leave.” Catherine choked softly, “I won’t help you to take care of your\ngrandparents and parents. I’ve been taking care of the children alone for the past few years. You\nhaven’t even fulfilled your responsibilities as a father…”"
      },
      {
        "paragraph": "“Cathy, listen to me. Compared to me, the children need you more.” Shaun cupped her small face."
      },
      {
        "paragraph": "Catherine could not see him clearly at all as her eyes were filled with tears. “Your aunt is right. I\nshouldn’t have come to the Hill family. You shouldn’t have met me too…”"
      },
      {
        "paragraph": "“Don’t say that, Cathy. Regarding Rebecca, I’ve never once regretted doing those things I did. From the\nstart, she was the one hurting you. She hurt your granny and Charity. People like that deserve it for the\nsins they have done.” Shaun interrupted her firmly."
      },
      {
        "paragraph": "Catherine was about to break down. “Why is this world so unfair? She’s so evil, yet someone is still\nhelping her like a lunatic. What exactly did we do wrong?”"
      },
      {
        "paragraph": "Shaun looked bitter. “Cathy, listen to me. I’ve hurt you so much in the past. There’s no need to deprive\nthe children and yourself of your future for me.”"
      },
      {
        "paragraph": "After he spoke, he kissed her hard. It was as if that was their last kiss."
      },
      {
        "paragraph": "However, Catherine did not push Shaun away anymore. Instead, she hugged him tight."
      },
      {
        "paragraph": "He carried her to the bed."
      },
      {
        "paragraph": "On the bed, their silhouettes tangled with each other tightly like vines."
      },
      {
        "paragraph": "The next day, when Catherine woke up, Shaun had already changed his clothes and walked out of the\ndressing room."
      },
      {
        "paragraph": "He was wearing a sapphire blue suit, which made him look handsome and very sophisticated."
      },
      {
        "paragraph": "Catherine’s heart could not help but throb in pain. “ Don’t go to the company today.”"
      },
      {
        "paragraph": "Rebecca was already so arrogant after just acquiring 5o percent of the shares. If she had obtained\nValerie"
      },
      {
        "paragraph": "and Spencer’s shares yesterday, she would be more arrogant today."
      },
      {
        "paragraph": "If Shaun went, he would surely be humiliated by Rebecca."
      },
      {
        "paragraph": "“Cathy, I have to go. I’ve nurtured every single employee in Hill Corporation myself. I can’t let someone\nelse trample all over them.”"
      },
      {
        "paragraph": "Shaun caressed her hair with a determined gaze.“ Pack your stuff and leave tomorrow. I’ve already\ninformed my dad. You’ll leave in his private airplane. Currently, everyone still doesn’t know that I’m the\nson of Garson Corporation’s director.”"
      },
      {
        "paragraph": "Catherine unconsciously tightened her grip on the bedsheets. Shaun kissed her forehead before he\nleft."
      },
      {
        "paragraph": "In the empty bedroom, Catherine gritted her teeth. Finally, she took her phone and dialed a number. “\nMatthew, I want to meet your father. Tell him that he still owes me a favor.”"
      }
    ]
  },
  {
    "title": "Chapter 1576 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Matthew was astonished. Actually, he knew everything Rebecca had done, but he really could not\nmeddle in those affairs. He also hoped that he could help Catherine, so he immediately agreed after\nlistening to her request. “Okay, I’ll contact my dad.”"
      },
      {
        "paragraph": "At that time, Matthew had just woken up."
      },
      {
        "paragraph": "He immediately went downstairs to the study to look for Titus. “Dad, Catherine called me just now. She\nsaid you still owe her a favor. She wants to meet you.”"
      },
      {
        "paragraph": "Titus understood. He did promise her that he could save a life."
      },
      {
        "paragraph": "He just did not expect her to look for him so quickly."
      },
      {
        "paragraph": "Matthew studied Titus’s unpredictable expressions and could not help but complain softly, “Dad, you\nshould know by now, right? Mom has used a huge sum of money to hire Julian Grayson’s team for\nRebecca. She even spent a few hundred billion"
      },
      {
        "paragraph": "dollars to acquire Hill Corporation. She must’ve gone crazy.”"
      },
      {
        "paragraph": "Titus rubbed his forehead. He just got to know about it not long ago too. After all, Sheryl’s actions were\nso quick that even he did not expect it."
      },
      {
        "paragraph": "Matthew got angrier as he thought about it. “How can Mom do such an irrational thing? Is there a need\nto go that far just to humiliate Shaun? Yes, she is rich, and the Costner family is rich too. However,\nmoney shouldn’t be simply spent. Moreover… She even placed all of Hill Corporation’s shares under\nRebecca’s name. I don’t really care about that little bit of asset, but Mom has just reunited with\nRebecca for a short time.”"
      },
      {
        "paragraph": "Titus glanced at his son with mixed feelings."
      },
      {
        "paragraph": "Matthew rarely complained to him about those matters, so it was obvious that he was really pissed off."
      },
      {
        "paragraph": "Titus stood up and patted Matthew’s shoulder. “It’s not convenient for me to speak up. Your mom has\nhad a lot of complaints about me lately, but you can advise your mom.”"
      },
      {
        "paragraph": "Matthew nodded. “Are you going to meet Catherine?”"
      },
      {
        "paragraph": "“I will since I promised her back then. Also, I’m curious as to what she’ll do in the face of your and\nRebecca’s oppression.”"
      },
      {
        "paragraph": "After Matthew came out of the study, he returned to his room with his phone in hand. He gave\nCatherine a call. “Sis Catherine, my dad has agreed. He says he can meet you in the afternoon.”"
      },
      {
        "paragraph": "Unbeknownst to him, Rebecca, who was in the room next to his, had just come out after he went in.\nWhen she saw him entering his room with his phone, she walked over and lightly placed her ear on the\ndoor. She could hear what Matthew said."
      },
      {
        "paragraph": "Rebecca’s heart skipped a beat."
      },
      {
        "paragraph": "Matthew knew Catherine and even called her “ Sis Catherine”."
      },
      {
        "paragraph": "How could that be?"
      },
      {
        "paragraph": "Did Catherine want to meet Titus to ask him for help?"
      },
      {
        "paragraph": "No, Rebecca could not let Catherine have her way."
      },
      {
        "paragraph": "Moreover, since the Costner family’s father and son had somehow gotten to know Catherine, it seemed\nlike Rebecca could only stir up trouble in the Costner family. Most of Hill Corporation’s shares were\nalready under her name anyway."
      },
      {
        "paragraph": "In the afternoon, Sheryl was taking a nap. Just as she was fast asleep, there was a knock on the door."
      },
      {
        "paragraph": "“Mom, are you sleeping?” Rebecca pretended to be shocked and said, “I just saw Uncle Titus going\nout. I thought you had gone out with him.”"
      },
      {
        "paragraph": "Sheryl did not have a good rest as of recent nights. Furthermore, she was just woken up from her\nsleep, so her whole head felt groggy. After listening to Rebecca’s words, she became annoyed."
      },
      {
        "paragraph": "She remembered that before they came to Australia, Titus would tell her in detail no matter where he\nwas going. Even if they got into a fight, he would coax her immediately. They had never slept on\ndifferent beds for more than three days."
      },
      {
        "paragraph": "However, Titus did not come to coax her this time, and he did not even inform her when he went out."
      },
      {
        "paragraph": "This made Sheryl very upset."
      }
    ]
  },
  {
    "title": "Chapter 1577 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rebecca grabbed the opportunity and said, “Mom, did you get into a fight with Uncle Titus recently? He\nhas been sleeping in the study. I don’t think it’s good for a married couple to sleep on separate beds for\ntoo long. It makes it easier for feelings to change. Many books that I’ve read said the same thing. You\nshould take note of this.”"
      },
      {
        "paragraph": "“Enough, you don’t have to worry about Titus and me.” Sheryl asked half-heartedly, “You went to Hill\nCorporation this morning. How was it?”"
      },
      {
        "paragraph": "“I wanted to go to Hill Corporation’s laboratory and factory to have a look, but Shaun had Liona’s\nmembers stop me. They didn’t allow me to enter. It’s so infuriating.” Rebecca was upset. “I didn’t dare\ngo against them by force. My face already"
      },
      {
        "paragraph": "hurts a lot from Catherine slapping me yesterday.”"
      },
      {
        "paragraph": "Sheryl looked at Rebecca’s face, which was covered in a thick layer of foundation, and was\nimmediately overwhelmed by anger. Her daughter had been bullied by people time and time again.\n“Take more people with you. If you meet Catherine, return her the slap.”"
      },
      {
        "paragraph": "“Mom, thank you. No one has ever treated me as well as you do.” Rebecca acted as if she was\ntouched. “But I heard people saying that Catherine didn’t go to the company this afternoon. Shaun\nlooked fearless as well. Maybe he has a trick up his sleeve.”"
      },
      {
        "paragraph": "“I’m here. What are you worried about? Just do what you want.”"
      },
      {
        "paragraph": "Sheryl patted the back of Rebecca’s hand to console her."
      },
      {
        "paragraph": "“Thank you, Mom.” After Rebecca left, Sheryl’s pretty face darkened."
      },
      {
        "paragraph": "Catherine did not go to the company, Titus just so happened to have gone out, and Shaun had a bold\nlook on him."
      },
      {
        "paragraph": "Had Titus gone out to meet Catherine?"
      },
      {
        "paragraph": "When that suspicion arose, Sheryl could not control it anymore."
      },
      {
        "paragraph": "She immediately dialed the number of her bodyguard. “Find out where Titus went.”"
      },
      {
        "paragraph": "At a cafe in a five-star hotel."
      },
      {
        "paragraph": "Catherine sat on the seat beside the French windows. After waiting for more than ten minutes, she saw\nTitus and Matthew arriving together. Both of them were more than two meters tall. Moreover, with those\nwell-defined, handsome features, they looked more like brothers rather than father and son."
      },
      {
        "paragraph": "Titus had really maintained himself well. He only looked like he was 37 or 38 years of age. Even the top\nmale models overseas might not be able to compare to his mature figure and presence."
      },
      {
        "paragraph": "“Mr. Costner, Matthew. ” Catherine immediately stood up and greeted them politely."
      },
      {
        "paragraph": "“Catherine, why did you call my dad over?” Matthew greeted her familiarly."
      },
      {
        "paragraph": "“Have a seat first. I don’t know what you guys like to drink, so I didn’t dare to order.” Catherine opened\nthe menu."
      },
      {
        "paragraph": "“I’ll just have a cup of coffee.” Titus sat down and crossed his long legs."
      },
      {
        "paragraph": "“My dad doesn’t like sugar in his, but I’ll have more sugar in mine.” Matthew waved his hand. “You two\ncan talk first. I’m going to the bathroom. I had too many watermelons at home.”"
      },
      {
        "paragraph": "After ordering three cups of coffee, Catherine did not beat around the bush and got straight to the point.\nShe said, “You promised me last time that you would save a life for me.”"
      },
      {
        "paragraph": "“Is it your life?” Titus’s gaze fell on Catherine’s stunning face. However, the bright face he saw the last\ntime was now shrouded in a layer of gloominess. She seemed to have a lot of worries on her mind."
      },
      {
        "paragraph": "“No.” Catherine shook her head. “Shaun’s life.”"
      },
      {
        "paragraph": "Titus raised his eyebrows in astonishment. “Do you know how precious this favor of mine is? You better\nnot regret using it on other people.”"
      },
      {
        "paragraph": "FranHy speaking, Shaun was not her husband at all. He was even a man who had hurt and betrayed\nher before."
      },
      {
        "paragraph": "“There’s nothing to regret.” Catherine smiled bitterly and said, “Recently, a lunatic has spent a huge\nsum of money to acquire a big portion of Hill Corporation’s shares. In fact, I know that there’s still a\npowerful force trying to target us, but Shaun wants to stay behind. He can’t bear to see the company\nthat he has painstakingly managed destroyed by someone else. Secondly, he wants to prepare a path\nfor the children and me to escape. He doesn’t care about his own safety. However, to me, he’s the\nperson I love. He’s also the father to my children. I hope you can save his life when I leave.”"
      },
      {
        "paragraph": "Titus’s expression was dark."
      },
      {
        "paragraph": "The lunatic that Catherine spoke of was his wife."
      }
    ]
  },
  {
    "title": "Chapter 1578 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "The way she addressed Sheryl made Titus very unhappy. However, he had to admit that what Sheryl\nhad done was indeed too unreasonable."
      },
      {
        "paragraph": "However, Catherine might not have guessed that he was the force behind the scenes that she was\ntalking about."
      },
      {
        "paragraph": "That must be why she told him her plans."
      },
      {
        "paragraph": "“Are you sure you can leave safely?” Titus could not help but raise his eyebrows."
      },
      {
        "paragraph": "Catherine pursed her lips together. She could not tell him that she would be boarding Brennan’s private\nairplane to leave, right?"
      },
      {
        "paragraph": "“I’ll just go with the flow. If I can leave, I’ll leave. If I can’t, worse comes to worst, they can take my life\naway. I just hope that person still has some last bit o f humanity left to spare the innocent children.”\nCatherine laughed bitterly. “But that person probably doesn’t have any humanity to speak of at all. Mr.\nCostner, if…”"
      },
      {
        "paragraph": "After giving it some thought, Catherine shook her head uneasily. “If I can’t leave safely in the end,\nplease change the plan and save my two kids, Mr. Costner. I know that’s two lives, but they’re still\nyoung. They’re only three years old.”"
      },
      {
        "paragraph": "Titus felt slightly uncomfortable hearing that. “ There’s no need for that, right? The people who owe the\ndebt should pay it themselves. They can’t involve the younger generation too.”"
      },
      {
        "paragraph": "“ Some people are evil by nature. They won’t care whether their children or not because they’re\ninhumane and don’t have any conscience.” Catherine laughed mockingly."
      },
      {
        "paragraph": "Titus frowned."
      },
      {
        "paragraph": "Inhumane? No conscience?"
      },
      {
        "paragraph": "Was Catherine talking about Rebbeca, Sheryl, or herself?"
      },
      {
        "paragraph": "She was the one who caused the death of her biological grandmother. She was the one who drove\nRebecca into a corner, pretended to be Sheryl’s daughter, and acknowledged Joel as her father. She\neven hogged the company that used to be Sheryl’s."
      },
      {
        "paragraph": "However, for some reason, Titus would forget everything Catherine had done whenever he looked at\nher face."
      },
      {
        "paragraph": "Rather, he did not quite believe that Catherine was such an evil person."
      },
      {
        "paragraph": "“Titus, so you’re here.”"
      },
      {
        "paragraph": "A cold voice laced with anger suddenly rang."
      },
      {
        "paragraph": "Titus’s heart leaped. He quickly turned his head back and stood up."
      },
      {
        "paragraph": "Sheryl walked in with her high heels, and there was a scowl on her fury-filled face."
      },
      {
        "paragraph": "She really did not expect Titus would look for Catherine as soon as he went out."
      },
      {
        "paragraph": "They were even drinking coffee and having a serious chat in the cafe."
      },
      {
        "paragraph": "Uncontrollable jealousy welled up in Sheryl."
      },
      {
        "paragraph": "It was especially after she saw Catherine. She had seen her before on the phone, but Catherine was\nmore beautiful, stunning, and younger in person than on the phone."
      },
      {
        "paragraph": "Moreover, Catherine really looked like Sheryl’s young self."
      },
      {
        "paragraph": "This was the face that made Titus sneak out again and again to meet her. It was also this face that\nmade Sheryl no longer look youthful in comparison and attracted Titus. It was why he no longer coaxed\nSheryl anymore."
      },
      {
        "paragraph": "Sheryl walked over angrily."
      },
      {
        "paragraph": "Catherine watched as she came nearer, and her eyes widened."
      },
      {
        "paragraph": "The woman in front of Catherine had a face like a blooming red rose. She had seen it before in Joel’s\nphoto. In the past, Sheryl was cheerful and youthful, just like a sunflower that was about to bloom."
      }
    ]
  },
  {
    "title": "Chapter 1579 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Although more than 20 years had passed and Sheryl’s face was now mature, it also became more\nfeminine and charming."
      },
      {
        "paragraph": "However, her nose and eyes remained the same. Catherine would not be mistaken."
      },
      {
        "paragraph": "That person might be… Her…."
      },
      {
        "paragraph": "Slap."
      },
      {
        "paragraph": "A resounding slap landed on Catherine’s face, and she was pushed onto the sofa by the force of the\nslap. Her whole head was buzzing."
      },
      {
        "paragraph": "She was in disbelief and at a loss."
      },
      {
        "paragraph": "Catherine had just thought that the woman might be the one whom Joel had seen. That woman most\nprobably was her biological mother."
      },
      {
        "paragraph": "Yet before she could say a word, she was slapped by the person who might be her mother."
      },
      {
        "paragraph": "She would not be upset if she was slapped by someone else."
      },
      {
        "paragraph": "However, that person was probably her mother."
      },
      {
        "paragraph": "Catherine’s mother may not have been by her side ever since she was young, but she admired Sheryl\nfrom the stories that other people had told her. She had once imagined the scene of her and her\nmother reuniting as well. Would her mother be happy or emotional?"
      },
      {
        "paragraph": "She did not expect that she would be slapped once they met each other."
      },
      {
        "paragraph": "“How dare you seduce my husband. I don’t think you need this face anymore. ” Sheryl took the hot\ncoffee from the table and was about to splash it on Catherine’s face."
      },
      {
        "paragraph": "At that moment, Titus reacted quickly by grabbing onto Sheryl’s wrist. “Stop. I was just discussing some\nthings with her. It’s not what you think it is.”"
      },
      {
        "paragraph": "“Titus, do you remember what I told you a few days ago? Yet you’re still sneaking out to meet her.” Fury\nburned in Sheryl’s eyes. “Don’t you like young and pretty women? Since you like her so much, why\ndon’t you be with her?”"
      },
      {
        "paragraph": "Titus looked at Sheryl’s face, which was slightly twisted from anger. He felt a sense of confusion and\nunfamiliarity. In his memories, Sheryl would never act like that. “ Sherry, can you calm down? Nothing\nhappened between Catherine and me. Moreover, I didn’t come alone.”"
      },
      {
        "paragraph": "“Of course you’re not alone. You even brought your bodyguard and assistant. Let go, Titus. If you really\nhave nothing to do with her, let me teach her a proper lesson today.” Sheryl struggled against Titus\nwhile holding the cup of hot coffee."
      },
      {
        "paragraph": "As they were pushing, some coffee spilled out all of a sudden. Some of it fell on the back of Catherine’s\nhand, which immediately turned red from the pain."
      },
      {
        "paragraph": "Titus felt bad seeing it, so he let go of Sheryl’s hand in a hurry."
      },
      {
        "paragraph": "Taking the chance, Sheryl splashed the coffee at Catherine."
      },
      {
        "paragraph": "Luckily, Catherine had quick reflexes. She managed to take the menu from the side in a hurry and\nblocked the coffee. However, some of it still splattered on her legs, and they burned in pain from being\nscalded."
      },
      {
        "paragraph": "Nevertheless, that pain could not compare to the pain she felt in her heart."
      },
      {
        "paragraph": "Catherine found it hilarious. Was that person her mother?"
      },
      {
        "paragraph": "No. It could not be. Her mother would not be like a lunatic or a madwoman."
      },
      {
        "paragraph": "“Catherine, are you okay?” Titus was startled. He did not expect Sheryl would do that."
      },
      {
        "paragraph": "“Titus, you’re still concerned about her? Just die.” Hot-headed, Sheryl threw the cup at Titus."
      },
      {
        "paragraph": "The cafe was in a mess. When Matthew, who had just returned from the bathroom, saw that scene, he\nwas stunned."
      },
      {
        "paragraph": "“Mom, what are you doing?” Matthew rushed over hurriedly and hugged Sheryl."
      }
    ]
  },
  {
    "title": "Chapter 1580 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Matthew, let go of me. You actually hooked up with this b*tch, Catherine behind my back. You should\nknow about my relationship with Catherine. She’s a shameless woman.” Sheryl was so exasperated\nthat she simply blurted some words."
      },
      {
        "paragraph": "Catherine’s head buzzed upon hearing that."
      },
      {
        "paragraph": "That woman said she had a relationship with her? What relationship?"
      },
      {
        "paragraph": "Could that woman have known from the start that she was her daughter?"
      },
      {
        "paragraph": "Matthew was utterly astonished. His mom’s imagination was too much. “Mom, it’s not what you think it\nis. Catherine is my friend. She came to look for me regarding some problems. I came over with Dad\ntoday.”"
      },
      {
        "paragraph": "“Are you covering up for your dad?” Sheryl did not believe him at all. “Also, you’re surprisingly treating\nher as a friend. You, father and son, have been fooled by her. Matthew, you disappoint me.”"
      },
      {
        "paragraph": "Matthew bit his lips in frustration. Why did his tongue slip just now? “Mom, I can swear it. There’s really\nnothing between Dad and her. Dad only has you in his heart.”"
      },
      {
        "paragraph": "“You’re just helping your dad and this woman. It’s no wonder you failed to deal with Hill Corporation the\nlast time. It must’ve been because you two can’t bear to hurt her, right?” Sheryl had no trust in them at\nall."
      },
      {
        "paragraph": "“What is she talking about?” Catherine looked toward Matthew in a daze. “What is that about dealing\nwith Hill Corporation?”"
      },
      {
        "paragraph": "Seeing her eyes on him made Matthew feel strangely awkward and ashamed."
      },
      {
        "paragraph": "When Sheryl heard Catherine’s words, she yanked Titus to her side and sneered. “Didn’t my son tell\nyou? Hill Corporation getting investigated was his and his father’s doing. I was the one who asked\nthem to ruin Hill Corporation.”"
      },
      {
        "paragraph": "Catherine’s face paled. She glanced at Matthew, stunned. Then, she glanced at Titus, whose\nexpression was grim."
      },
      {
        "paragraph": "The force behind Rebecca that kept targeting her and Shaun was the Costner family?"
      },
      {
        "paragraph": "Yet, she knew nothing about it. She foolishly treated Matthew as a brother and a friend. She was even\ncounting on Titus to save Shaun’s life."
      },
      {
        "paragraph": "What was she doing? Catherine felt like a fool."
      },
      {
        "paragraph": "Moreover, why did the woman in front of her hate her so much? She was her mother."
      },
      {
        "paragraph": "Matthew looked at Catherine’s disoriented expression, and a pang of inexplicable guilt welled up in his\nheart. However, since Sheryl was there and Matthew was afraid of stimulating her, he could only say,\n“Mom, you’ve really misunderstood. I knew she was Catherine from the start. I"
      },
      {
        "paragraph": "deliberately approached her to get some information.”"
      },
      {
        "paragraph": "“It’s really not what you think it is.”"
      },
      {
        "paragraph": "At that moment, Titus could only coax Sheryl as he did not want to continue the argument. He knew\nthat if he said Catherine was not bad of a person, everything would spiral out of control. “Sherry, don’t\nyou know my feelings for you? She is so young that she can pass off as my daughter."
      },
      {
        "paragraph": "Matthew came along with me today. He was in the bathroom just now.”"
      },
      {
        "paragraph": "“Really?” Sheryl still did not believe it. “If Matthew deliberately approached her to get information, then\nwhat is your reason for approaching her?"
      },
      {
        "paragraph": "You’re obtaining information too?”"
      },
      {
        "paragraph": "Titus’s face was red."
      },
      {
        "paragraph": "He had never felt so awkward and embarrassed for the last 4o years he had lived."
      },
      {
        "paragraph": "It was especially since Catherine was standing at the side."
      },
      {
        "paragraph": "“Enough, stop interrogating them.” Catherine laughed wryly. She even laughed until her eyes\nreddened. For the past few days, she felt just like an idiot. “Indeed, nothing is going on between Mr.\nCostner and me. I just thought his identity must be special after listening to Matthew’s tone and that he\nmight be able to help Hill Corporation. So, I begged him for help, but he flat-out refused.”"
      },
      {
        "paragraph": "Titus glanced at Catherine in astonishment upon hearing her words. She was clearly smiling, but she\nsomehow made people pity her."
      },
      {
        "paragraph": "“May I ask if you’re Sheryl Jones?” Catherine suddenly stared at the woman before her who was\nlooking at her in disdain and asked softly."
      },
      {
        "paragraph": "Sheryl’s expression was cold. “That’s right. I’m Sheryl Jones. Don’t even think of getting close to me. If\nit’s possible, I don’t even want to have anything to do with you.”"
      }
    ]
  },
  {
    "title": "Chapter 1581 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Boom."
      },
      {
        "paragraph": "It was as if a hammer had hit Catherine’s chest hard."
      },
      {
        "paragraph": "No matter how strong she was, she could not stop herself from crying."
      },
      {
        "paragraph": "From Sheryl’s tone, she sounded as if she knew Catherine was her daughter. However, if it was\npossible, she would rather not have any ties with Catherine nor want Catherine, her daughter?"
      },
      {
        "paragraph": "Was that what she meant?"
      },
      {
        "paragraph": "“Alright, Madam Costner. It’s okay even if you don’t wish to know me. It may be presumptuous of me,\nbut how did I offend you exactly?” Catherine suppressed her sobbing and asked, “Why do you keep\nscheming to target Hill Corporation? Even the Hill Corporation’s hostile takeover is related to you,\nright? What grudges do I have with you?”"
      },
      {
        "paragraph": "“Enough, Catherine. Stop pretending.” The hatred in Sheryl’s eyes intensified. “You should know full\nwell about what you have done. I’m warning you, stay away from Matthew and my husband. If not,"
      },
      {
        "paragraph": "not only you, but I’ll make the life of every single person around you a living hell.”"
      },
      {
        "paragraph": "“ I’m already in a living hell. ” Catherine could not tolerate it anymore. She broke down and yelled, “\nNever mind if you don’t want to acknowledge me, but why are you helping such an evil woman like\nRebecca? I’m your biological daughter.”"
      },
      {
        "paragraph": "Slap."
      },
      {
        "paragraph": "What replied was another slap from Sheryl."
      },
      {
        "paragraph": "“I think you’re addicted to acting. Do you really think you can fool everyone?”"
      },
      {
        "paragraph": "After Sheryl spoke coldly, she yanked Matthew along with her and quickly left. Titus’s lips moved, but\nhe then looked at Sheryl’s angry expression. As he was afraid a fight would break out again, he quickly\nfollowed after her."
      },
      {
        "paragraph": "In the cafe, people were surrounding Catherine and pointing fingers at her."
      },
      {
        "paragraph": "Luckily, at that time, there were not many people in the cafe."
      },
      {
        "paragraph": "“Is she a mistress?”"
      },
      {
        "paragraph": "“What mistress? Didn’t you see the person’s son was here too?”"
      },
      {
        "paragraph": "“But why did that person slap her? It can’t be for no reason, right?”"
      },
      {
        "paragraph": "Catherine could not hear other people’s voices at all. Her face hurt, and her legs were in burning pain\nfrom getting scalded."
      },
      {
        "paragraph": "However, that pain could not compare to the pain in her heart."
      },
      {
        "paragraph": "Why did it turn out like that? Why did her biological mother hate her so much?"
      },
      {
        "paragraph": "If she had known better, she would rather her mother died more than 20 years ago."
      },
      {
        "paragraph": "It was better than receiving hate and two slaps when she reunited with her mother."
      },
      {
        "paragraph": "“Pretty lady, this is… your bill.” A waiter stepped forward hesitantly with a sympathetic expression."
      },
      {
        "paragraph": "When the waiters saw two mixed-race guys walking toward Catherine’s table, they were utterly\nenvious. Those two guys were of the best quality. One of them was young, and the other one was\nmature and charismatic."
      },
      {
        "paragraph": "Unfortunately…"
      },
      {
        "paragraph": "Sure enough, not just anyone could afford to have good-looking men."
      },
      {
        "paragraph": "“Give me the bill.” Catherine paid the money. She took the elevator down in a daze."
      },
      {
        "paragraph": "After going down, she sat in the car. She still could not accept that reality at all. She just felt so upset\nthat she wanted to cry. However, she could not call Shaun. She knew that his situation was definitely\nworse than hers."
      }
    ]
  },
  {
    "title": "Chapter 1582 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine found it hard to tell Shaun that everything was caused by her biological mother."
      },
      {
        "paragraph": "It was too ridiculous."
      },
      {
        "paragraph": "Finally, she could not resist calling Joel. “Dad…” Once she spoke, she started sobbing."
      },
      {
        "paragraph": "Joel was startled. “Cathy, what’s wrong? Are you worrying over Hill Corporation’s matters? Don’ t\noverthink it. My logistics company is quite profitable. Worse comes to worst, I’ll provide for you in the\nfuture.”"
      },
      {
        "paragraph": "“It’s not that… ” Listening to Joel’s concerned voice and comparing it to Sheryl’s cold, harsh words,\nCatherine felt even more upset. “Dad, I just want to know… Is my mom… really that good of a person?”"
      },
      {
        "paragraph": "She did not want to admit that the madwoman earlier was her mother."
      },
      {
        "paragraph": "Joel was stunned. He did not understand why Catherine would suddenly ask that. “Cathy, of course,\nyour mom is a very good person.”"
      },
      {
        "paragraph": "“Dad, she might have been good 2o years ago. But after 20 years, who knows what she has become?\nMaybe I’ve become a burden and a dead weight in her heart. Maybe she even desperately wants me to\ndisappear. ” Catherine lifted her lips sarcastically with tears in her eyes."
      },
      {
        "paragraph": "“Cathy, what happened to you?” Joel’s heart tightened. “Did you… meet your mom?”"
      },
      {
        "paragraph": "“Yes, I met her.”"
      },
      {
        "paragraph": "Catherine touched her face that was swollen from being slapped. She said softly, “She looked just like i\nn your photo. She’s maintained her looks very well and only looks like she’s in her 30s. She has a"
      },
      {
        "paragraph": "handsome rich husband and a dashing son. But she acted like a madwoman when she saw me,\nslapping me twice. She even splashed coffee at my face. She hates me and said I was putting up an\nact. She also said I wanted to seduce her husband and she didn’t want to have anything to do with\nme.”"
      },
      {
        "paragraph": "Joel was stunned upon hearing that."
      },
      {
        "paragraph": "Although he had figured everything out in these few days and accepted the fact that Sheryl might have\nalready remarried and had children, he still felt wistful and hurt."
      },
      {
        "paragraph": "However, that was nothing compared to what Sheryl did to Catherine."
      },
      {
        "paragraph": "“Cathy, are you mistaken? That’s impossible.”"
      },
      {
        "paragraph": "There was no reason the Sheryl that Joel knew would do such a thing."
      },
      {
        "paragraph": "“I’m not mistaken. She knows about her relationship with me. She’s even helping Rebecca to go\nagainst me. Hill Corporation being targeted and its hostile takeover is because Sheryl is helping\nRebecca to manipulate everything behind the scenes.”"
      },
      {
        "paragraph": "Catherine wailed in deep agony, saying, “ I’d rather not have a mother at all. You said my mom was\nnice. I can imagine that. However, after she appeared, she shattered all my thoughts about having a\nmother.”"
      },
      {
        "paragraph": "“Cathy, don’t be like this. Calm down.”"
      },
      {
        "paragraph": "Joel’s heart was in pain from listening to her. It was his first time seeing Catherine losing control."
      },
      {
        "paragraph": "Actually, he understood the thoughts a child would have for their mother. “This is impossible. Rebecca\ntreated you so badly. How could she help Rebecca and not you? Rebecca is just her niece at most.”"
      },
      {
        "paragraph": "Catherine was stunned. Joel’s words made her calm down a little."
      },
      {
        "paragraph": "Joel said, “Even if she doesn’t want to acknowledge you as her daughter and wants to erase her past,\nthere’s no need for her to help her niece to target you, right? I heard you say before that Rebecca is\ncunning and has a lot of schemes. Is there possibly a misunderstanding?”"
      },
      {
        "paragraph": "Catherine was at a loss. Misunderstanding?"
      },
      {
        "paragraph": "Joel felt sorry for her and said, “Cathy, people might change. However, when I knew your mother, she\nwas a kind person. Also, I find it a bit weird. We didn’t even know that your mom is still alive. How did\nRebecca find that out?”"
      },
      {
        "paragraph": "Something flashed in Catherine’s head."
      },
      {
        "paragraph": "That was right. How did Rebecca know that her mother was still alive?"
      },
      {
        "paragraph": "Could it be that Rebecca had been looking for her mother when she was hiding overseas?"
      },
      {
        "paragraph": "After calming down, Catherine suddenly realized that that matter was very strange."
      },
      {
        "paragraph": "Sheryl could dislike her, but Jeffery and Sally had caused Granny’s death. However, Sheryl still got\nthem out of jail."
      },
      {
        "paragraph": "Rebecca must have used some kind of method to trick Sheryl. Joel sighed. ”Do you know where your\nmother is staying now? Let me see her and talk to her.”"
      }
    ]
  },

  {
    "title": "Chapter 1583 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine said resignedly, “Dad, I don’t think she’ll agree. She cares a lot about her current family. Or\nrather… She cares a lot about her husband. I just talked to her husband for a while when she started\nscolding me, saying that I was seducing her husband.”"
      },
      {
        "paragraph": "Joel’s heart felt very bitter. “Your mom did get jealous over me in the past, but she has always been\nvery calm…”"
      },
      {
        "paragraph": "Could it be that… Sheryl did not love him enough back then?"
      },
      {
        "paragraph": "After that thought flashed across Joel’s mind, he became even more upset. “If that’s the case, just\nforget it. However, if she hits you again next time, contact me. Even if she’s the woman I can’t forget\nabout, I won’t let her hurt you. Moreover, she can’t act like that as a mother.”"
      },
      {
        "paragraph": "“Mm.”"
      },
      {
        "paragraph": "Catherine could not bear to tell her father that Titus was very, very handsome. He was even more\nhandsome than Joel."
      },
      {
        "paragraph": "After ending the call, Catherine had calmed down a lot. She found Matthew’s number and dialed it."
      },
      {
        "paragraph": "However, after a few rings, Matthew rejected her call."
      },
      {
        "paragraph": "Catherine could only smile bitterly."
      },
      {
        "paragraph": "To be honest, if it were not because she wanted to get some information on Sheryl and Rebecca, she\nwould not even want to contact him anymore."
      },
      {
        "paragraph": "She did not expect that Matthew had approached her with other motives when she genuinely treated\nhim as a brother. Titus had other intentions too."
      },
      {
        "paragraph": "She even stupidly told Titus her plans."
      },
      {
        "paragraph": "That was how the Costner family got to know about her plans. They would definitely not let her leave\nAustralia."
      },
      {
        "paragraph": "Thinking about how despicable the Costner family was, Catherine felt slight contempt for them."
      },
      {
        "paragraph": "After some thought, she drove to Hill Corporation. Rebecca would surely be there. Catherine wanted to\nhave a look at what Rebecca was up to."
      },
      {
        "paragraph": "Hill Corporation."
      },
      {
        "paragraph": "Valerie and Spencer were holding a bunch of stuff while standing in the office. They awkwardly looked\nat Shaun."
      },
      {
        "paragraph": "After a long silence, Spencer spoke first, “ Shaun, we’ll be leaving first. We’re no longer a part of Hill\nCorporation now.”"
      },
      {
        "paragraph": "Shaun concealed the sarcasm in his eyes and said calmly, “You can leave.”"
      },
      {
        "paragraph": "Valerie added, “We didn’t want to sell off the shares we had but we really had no choice—”"
      },
      {
        "paragraph": "“Aunt Valerie, there’s no need to tell me that. Grandpa was the one who gave you the shares. It’s fine\nas long as you’re happy.” Shaun cut her off coldly. “After taking so much money, you can’t possibly\nwant me to console you too, right?”"
      },
      {
        "paragraph": "Valerie’s face flushed red in embarrassment. In the end, she and Spencer left without saying a word."
      },
      {
        "paragraph": "Not long after, sounds of footsteps came from outside."
      },
      {
        "paragraph": "“Come, President Lyons, let me show you my office in the future.” Rebecca and Wesley entered while\nchatting and laughing."
      },
      {
        "paragraph": "That scene…"
      },
      {
        "paragraph": "There was mockery in Shaun’s eyes as his lips lifted in sarcasm. “Wesley, you’re quite close to\nRebecca."
      },
      {
        "paragraph": "You can’t possibly have taken care of her in bed as well, right?”"
      }
    ]
  },
  {
    "title": "Chapter 1584 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“President Hill, don’t have such dirty thoughts regarding other people’s relationships.” Wesley adjusted\nhis glasses. “Moreover, Miss Rebecca is Hill Corporation’s major shareholder now. You, a minor\nshareholder, had better be more polite when you speak to her.”"
      },
      {
        "paragraph": "“That’s right. Do you think this is still your territory, Shaun?” Rebecca eyed the office while smiling. “The\nview here is quite nice. I’ve decided that this office is mine from now on. Shaun, your office will be\nmoved to the first floor.”"
      },
      {
        "paragraph": "After speaking, Rebecca beckoned to the bodyguards behind her with her fingers. “ Come, help\nPresident Hill move his stuff. After all, he’s only the previous chairman of Hill Corporation. His hard\nwork and contributions are considerable. By the way, I forgot to tell you this. You’re no longer the\nchairman of Hill Corporation. However, considering that you’ve made great contributions to Hill\nCorporation, I’ll let you be the general manager of the public relations department. I believe that with\nyour looks, you can do well in the public relations department.”"
      },
      {
        "paragraph": "“He won’t just do well. Young Master Hill’s looks are amazing. The rich women and some men who\nhave special interests like men like him a lot.” Wesley agreed with Rebecca while smiling."
      },
      {
        "paragraph": "Both of Shaun’s hands were in his pockets. He was looking down at those two people from a higher\neye level."
      },
      {
        "paragraph": "His hawk—like eyes were cold."
      },
      {
        "paragraph": "Those two people used to be like ants in his eyes. They had now become so brazen and arrogant in\nfront of him."
      },
      {
        "paragraph": "He wanted to kill both of them."
      },
      {
        "paragraph": "“General Manager Hill, why are you looking at me? With my identity, you have to lower your head\nrespectfully when you see me. Do you understand…”"
      },
      {
        "paragraph": "Before Rebecca could finish her sentence, Shaun suddenly stepped forward with a cold expression."
      },
      {
        "paragraph": "Rebecca’s heart trembled. She instinctively hid behind a bodyguard and warned, “What are you going\nto do? Get lost and go down immediately. You don’t have the right to stay here anymore. You guys…\nquickly move his things.”"
      },
      {
        "paragraph": "Many people started getting busy in the office."
      },
      {
        "paragraph": "Someone even threw Shaun’s photo with Catherine, which was placed on the office table, onto the\nfloor. He then raised his foot to step on it on purpose."
      },
      {
        "paragraph": "However, before he could step on it, he was kicked away by Shaun."
      },
      {
        "paragraph": "Shaun bent over and picked up the photo. The glass of the frame had already shattered. He took out\nthe photo inside it."
      },
      {
        "paragraph": "Rebecca said meaningfully, “President Lyons, isn’t that your wife? A certain person shamelessly has\nyour wife to himself.”"
      },
      {
        "paragraph": "“Yes, that b*tch cheated on me. She’s disobedient. I’ll have someone bring her back later and teach her\na proper lesson,” Wesley said coldly."
      },
      {
        "paragraph": "“Really? You can try.” After Shaun laughed creepily, his gaze settled on the spot below Wesley’s belt. “If\nyou anger me, be careful that I might make you lose your d*ck.”"
      },
      {
        "paragraph": "Wesley looked at Shaun’s wild gaze. He sneered. “ It’s still better than you. Can you still even use your\nd*ck? I heard you’re often at the hospital visiting doctors to treat it, right?”"
      },
      {
        "paragraph": "“Is it true?” Rebecca acted surprised and covered her mouth."
      },
      {
        "paragraph": "“Of course, it’s true. President Hill is incapable of s*x.” Wesley laughed smugly. “I guess Catherine\nmust be very lonely. Don’t worry. After some time, I’ll help you to satisfy her properly.”"
      },
      {
        "paragraph": "Shaun’s fist made a cracking sound."
      },
      {
        "paragraph": "Wesley said haughtily, “Hit me. As long as you dare to hit me, I’ll have the police take you away today.\nJust nice, I can kidnap Catherine back tonight."
      },
      {
        "paragraph": "Haha.”"
      },
      {
        "paragraph": "Shaun took a few deep breaths. He suppressed his anger with all his might."
      },
      {
        "paragraph": "Rebecca looked even smugger looking at that. “By the way, I’m the majority shareholder in the\ncompany now. The position of chairman is mine in the future. I’ve already decided to have a close\ncollaboration with Golden Corporation."
      },
      {
        "paragraph": "Furthermore, I’m planning to transfer the medical technology and equipment that the company\ndeveloped this year to President Lyons.”"
      },
      {
        "paragraph": "“Excuse me, but you probably don’t have the right to transfer those technologies,” Shaun said coldly,“\nWhen I collaborated with Garson Corporation, they had stated it clearly in the contract. The\ntechnologies were transferred to me and not Hill Corporation. No one has the right to have them except\nme.”"
      },
      {
        "paragraph": "Rebecca was stunned. She did not really understand this kind of stuff. However, Wesley understood it.\n“So what? As long as the laboratory is ours, Miss Rebecca can take whatever technology she wants\nfrom there. Your men should’ve already barged in, right?”"
      }
    ]
  },
  {
    "title": "Chapter 1585 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun’s pupils constricted."
      },
      {
        "paragraph": "Just as he was thinking about it, the phone rang. Hadley was calling him. “Young Master Hill, things are\nbad. Some people came to the laboratory’s entrance and injured the members of Liona who were\nstanding guard there. They’ve barged inside now and a few of our technical staff have sustained major\ninjuries too.”"
      },
      {
        "paragraph": "“I understand. ” Shaun glanced at Rebecca coldly. He turned around and walked outside."
      },
      {
        "paragraph": "At the door, three bodyguards suddenly blocked him."
      },
      {
        "paragraph": "Rebecca took pleasure in Shaun’s misery and said, “ Do you intend to go to the laboratory? How can I\npossibly let you go there to help them? Shaun, I know that you treasure your efforts a lot. I’m going to\nsnatch them all away. Weren’t you very great all along and thought you were high up? Back then in\nMelbourne, you treated me like an ant. I remember how you tortured me. From today onward, I’ll settle\nour debts one by one.”"
      },
      {
        "paragraph": "“Not just yours.” Wesley stepped forward slowly, his eyes filled with cruelty. “Mine too. Shaun, I vividly\nremember all the humiliation you’ve caused me. On my wedding night, Catherine should’ve been mine,\nyet you took her away. I swore that I’d return that humiliation to you one day. I’ll make your life a living\nhell too.”"
      },
      {
        "paragraph": "Shaun looked at their contemptuous gazes which were directed at him. He just found them ridiculous."
      },
      {
        "paragraph": "Those people did not even think about how many things they did in the past to hurt Catherine."
      },
      {
        "paragraph": "“You two are quite a good match for each other. ” Shaun suddenly laughed and said, “You guys only\nallow yourselves to hurt others. If other people resist and take revenge, you make yourselves look as"
      },
      {
        "paragraph": "though you’re the victim. After all the things you guys have done, do you think you still deserve to be\nhumans?”"
      },
      {
        "paragraph": "Rebecca raised her eyebrows. “My dad is the Jones family’s eldest son. I had the right to inherit\neverything owned by the Jones family from the very start. Who asked Catherine to steal Hudson\nCorporation away? She brought everything upon herself. This is called retribution.”"
      },
      {
        "paragraph": "Wesley let out a snort too. “It’s her honor to be picked by me. Moreover, I kept acting as if I had lost a\nkidney for her sake and even cared for her. I’ve never pleased a woman like that in my whole life.”"
      },
      {
        "paragraph": "“Your shameless words are really an eye-opener for me.”"
      },
      {
        "paragraph": "Catherine’s mocking laugh suddenly rang out at the door."
      },
      {
        "paragraph": "The three of them looked at the door. They realized that Catherine was there, being blocked by the\nbodyguards. Her petite stature could not be seen."
      },
      {
        "paragraph": "“Cathy…” Shaun walked over in long strides and tugged her hand. He said hastily, “Let’s go to the\nlaboratory.”"
      },
      {
        "paragraph": "“We don’t have to go there anymore.”"
      },
      {
        "paragraph": "Catherine stopped Shaun. She entered and laughed when she saw Wesley and Rebecca’s smug\nfaces. “ Shaunny, don’t worry. I’ve already asked Elle to bring some people over to back them up on my\nway here. At the same time, I borrowed more than ten highly skilled people from Young Master Jewell."
      },
      {
        "paragraph": "They must’ve already arrived at the laboratory by now.”"
      },
      {
        "paragraph": "Wesley and Rebecca’s faces stiffened, especially Rebecca’s. In order to claim the laboratory that day,\nshe had mobilized almost two-thirds of the people Sheryl and Titus brought from Neah Bay."
      },
      {
        "paragraph": "“No matter how many people you both bring today, I’ll make them leave while crawling. ” Catherine’s\neyes contained a chilly look."
      },
      {
        "paragraph": "Even Shaun could not help looking at her in astonishment. He felt that Catherine was really furious. It\nseemed that she could kill Rebecca."
      },
      {
        "paragraph": "“I don’t believe you.” Rebecca was distressed. She shouted agitatedly, “Catherine Jones, don’t you\ndare! I can call the police to apprehend you. Hill Corporation is mine now. It’s completely legal for my\npeople to enter the laboratory. If you guys dare to hurt my people, that’s breaking the law.”"
      },
      {
        "paragraph": "“Although the laboratory is Hill Corporation’s, all the data inside belongs to me alone. You had your\npeople to barge in forcefully. Obviously, you’re trying to steal my data. ” Shaun was well-versed in the\nlaw. He warned coldly, “Even if we go to the police station, we can say that this was self- defense. As\nfor your bodyguards, never mind if they’re disabled. Worst comes to worst, I’ll just pay more\ncompensation.”"
      }
    ]
  },
  {
    "title": "Chapter 1586 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“In your dreams! If your men dare to hurt my people, I won’ t let you have an easy death in this life.”\nRebecca warned fiercely, “You don’t even know who you’ve offended. Even if Nathan Snow intervenes,\nhe won’t be able to protect you.”"
      },
      {
        "paragraph": "Catherine looked at Rebecca’s haughty look. The anger in her heart grew. “No, Rebecca. I know who\nI’ve offended. Don’t think I don’t know that the people you brought aren’t your subordinates at all. They\nbelong to the Costner family. Haven’t you been acting all domineering these days because you’re\nrelying on the Costner family now?”"
      },
      {
        "paragraph": "Shaun was puzzled upon hearing that. The Costner family?"
      },
      {
        "paragraph": "Rebecca laughed smugly. “That’s right. I have the Costner family behind me. You, a country bumpkin,\nwon’t even know how strong the Costner family is.”"
      },
      {
        "paragraph": "“Rebecca, I admit that you’re the strongest opponent I’ve ever met in my whole life. Of course, it’s not\nbecause you’re great, but it’s because you’re too despicable and shameless.”"
      },
      {
        "paragraph": "Catherine tried to restrain herself and calm down. She wanted to get some things clear. “How exactly\ndid you find my mother and what did you say to her?”"
      },
      {
        "paragraph": "Shaun was shocked."
      },
      {
        "paragraph": "Rebecca acted innocent and widened her eyes. “ What are you talking about? I don’t understand it at\nall.”"
      },
      {
        "paragraph": "“Stop pretending. I’ve already met my mom.”"
      },
      {
        "paragraph": "Speaking of that, Catherine’s heart started hurting badly. “What exactly did you say to her to make\nher… hate me so much?”"
      },
      {
        "paragraph": "“Oh, you’re talking about her slapping you twice, right?” Rebecca happily looked at the mask Catherine\nwas wearing on her face. “You can’t blame her for that. Who asked you to seduce her husband so\nshamelessly? In the end, you got slapped and can’t even show your face now.”"
      },
      {
        "paragraph": "Rebecca had received a call from Sheryl about that on her way to Hill Corporation."
      },
      {
        "paragraph": "When Rebecca thought of Catherine getting scolded and slapped in her face by her biological mother,\nshe felt very satisfied."
      },
      {
        "paragraph": "Although Catherine and Sheryl had finally met each"
      },
      {
        "paragraph": "other, Rebecca had already done a DNA test with Sheryl earlier on. No matter what Catherine said,\nSheryl would not believe her."
      },
      {
        "paragraph": "Not to mention that Sheryl had taken Rebecca’s drug. She was not able to reason anymore."
      },
      {
        "paragraph": "“Cathy, what’s going on?” Shaun got more confused. What did it mean that Catherine got slapped by\nher mother?"
      },
      {
        "paragraph": "Was her mother still alive? Shaun was utterly stunned."
      },
      {
        "paragraph": "As for what Rebecca said about Catherine seducing another person’s husband, Shaun did not believe\nit at all."
      },
      {
        "paragraph": "Catherine did not reply to Rebecca. Instead, she stared at Rebecca coldly. “I wasn’t expecting you to\ntell the truth anyway. Actually, I can more or less guess what’s going on. You must’ve twisted the truth"
      },
      {
        "paragraph": "and said many bad things about me in front of my mom. I didn’t know she was still alive in the past, so\nyou could make up all the rumors you wanted. I’ll explain everything to her in the future. After all, I’m\nher real biological daughter.”"
      },
      {
        "paragraph": "“Haha.”"
      },
      {
        "paragraph": "Rebecca looked as if she had heard a joke."
      }
    ]
  },


  {
    "title": "Chapter 1587 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Wesley smirked, looking at Catherine like she was a clown."
      },
      {
        "paragraph": "“Oh, I’m looking forward to that day,” Rebecca said with a smile, “But so far, she’s given me hundreds\nof billions and even bought Hill Corporation for me. She’s very good to me.”"
      },
      {
        "paragraph": "Catherine could not stop her body from shaking with anger."
      },
      {
        "paragraph": "She did not know who the person behind Rebecca was before, so she was not that angry, but now that\nshe knew it was her mother, she really wanted to vomit blood."
      },
      {
        "paragraph": "“Catherine, don’t you like stealing my things very much? First, it was the architectural company, and\nthen it was Hudson Corporation. But I don’t care about all those now. ” Rebecca curled her red lips.\nShe just wanted to see what Catherine looked like when she went mad with jealousy. She had waited\nfor this day for too long."
      },
      {
        "paragraph": "“Rebecca, although I don’t know what lies you told, I believe that the truth will not be hidden forever."
      },
      {
        "paragraph": "I’ll stay and reveal your true colors little by little. I’ll let the Costner family see just how disgusting you\ncan be.”"
      },
      {
        "paragraph": "Catherine spat out word after word and sneered. “As for now, I advise you to go to the lab and have a\nlook. When you brought those men from the Costner family, they were in one piece. But you’ll be going\nback with them all battered and bruised. Will Titus not mind at all?”"
      },
      {
        "paragraph": "Rebecca’s heart shook when she thought of Titus’ domineering and dignified face."
      },
      {
        "paragraph": "She was sure that Sheryl would not mind, but Titus…"
      },
      {
        "paragraph": "“Of course, he won’t mind. You don’t know just how much Uncle Titus loves me.”"
      },
      {
        "paragraph": "Rebecca was stubborn, but she did not dare to stay any longer. She had to see if what Catherine said\nwas true or not."
      },
      {
        "paragraph": "“President Lyons, let’s go. I’ll give you a tour of the lab downstairs.” Rebecca gave Wesley a look."
      },
      {
        "paragraph": "Wesley nodded. When he passed by Catherine, he stopped and said with a fake smile, “Wife, as long\nas you’re willing to go back to my bed, I can guarantee that your children won’t get hurt. After all, I\nwatched them grow up.”"
      },
      {
        "paragraph": "Catherine’s eyes went cold."
      },
      {
        "paragraph": "How dare he threaten her with her children?"
      },
      {
        "paragraph": "“Wesley, are you unwilling to get lost? Then, let me teach you a lesson.” Shaun viciously kicked\nWesley’s knees. Wesley was caught off guard and immediately fell to the ground."
      },
      {
        "paragraph": "Shaun took the opportunity to kick him in his back, making Wesley fall flat on his face miserably once\nmore."
      },
      {
        "paragraph": "Catherine could not help but laugh out loud as she watched the scene."
      },
      {
        "paragraph": "“Shaun, you…” Wesley felt his face burn as his shame turned into raging anger."
      },
      {
        "paragraph": "He got back up and was just about to fight back when Shaun pulled out a wad of money from his\npocket, throwing it at Wesley’s face. “Sorry, my leg suddenly cramped up. That money is to\ncompensate you.”"
      },
      {
        "paragraph": "“Sorry, President Lyons.” Catherine gloated. “He probably got a leg cramp from anger when he heard\nyou use the children as a threat.”"
      },
      {
        "paragraph": "“You know me best, Cathy. ” Shaun shook his leg and said with a vague smile, “President Lyons, you\nshould go quickly. I’m afraid my leg will cramp and I’ll lose control again if you say anything else.”"
      },
      {
        "paragraph": "“If I were you, I’d behave myself by tucking my tail in between my legs. But it seems you’re the type\nwho won’t shed tears until you see the coffin.”"
      },
      {
        "paragraph": "After a deep chill flashed in the bottom of Wesley’s eyes, he turned around and left together with\nRebecca."
      }
    ]
  },
  {
    "title": "Chapter 1588 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine looked at Wesley’s back. That man could still endure it despite being humiliated to this\nextent, proving that his schemes were not shallow a t all. This man was probably more trouble than\nthey thought."
      },
      {
        "paragraph": "“Cathy, where did you go today? What happened?” Shaun turned her body and took off her mask."
      },
      {
        "paragraph": "When he saw that her tender fair face was not only swollen but also had a handprint on it, his eyes\ninstantly flooded with a burst of hostility."
      },
      {
        "paragraph": "“Was it really your mom who hit you?”"
      },
      {
        "paragraph": "He still could not believe that her mother was alive."
      },
      {
        "paragraph": "“… Yeah.” Although Catherine did not want to admit it, she nodded painfully. “I didn’t expect it either. I\nalways thought my mom had died, but she greeted me by slapping me twice on our first meeting.”"
      },
      {
        "paragraph": "Catherine was controlling her emotions, but maybe it was because she was talking about someone she\nloved so as she spoke, her eyes could not help but get red."
      },
      {
        "paragraph": "Shaun hugged her, feeling distressed. “Cathy, you don’t need a mother like that.”"
      },
      {
        "paragraph": "“That’s not it. I thought the same thing as you at first. But after talking to my dad on the phone, I calmed\ndown and thought about it. Rebecca probably did something. Rebecca’s reaction was very strange just\nnow. I don’t know what she did, but it seems like she’s fearless.” Catherine was at a loss."
      },
      {
        "paragraph": "She had wanted to meet Sheryl and explain to her about Grandma’s death and the evil deeds Jeffery,\nSally, and Rebecca did. However, Rebecca’s attitude made her start to doubt herself. Would Sheryl\nbelieve her?"
      },
      {
        "paragraph": "Shaun snorted coldly. “No matter what Rebecca did to sow dissension, as your biological mother, she\nbelieved what others said so casually. She’s not worthy of being your mother at all.”"
      },
      {
        "paragraph": "He did not care about Sheryl’s status. He hated anyone who dared to hurt his woman."
      },
      {
        "paragraph": "Catherine was dumbfounded. Shaun’s words touched her heart."
      },
      {
        "paragraph": "Yes, someone else could incite Sheryl, but did she not have her own ability to distinguish right from\nwrong? Besides, Sheryl was her mother, but she indiscriminately hit her own daughter and even hated\nher so much."
      },
      {
        "paragraph": "How could Catherine not be disappointed in her?"
      },
      {
        "paragraph": "“Shaunny, there are some things we have to get to the bottom of,” Catherine said with a bitter face. “My\nmom has been helping Rebecca to suppress us. If we don’t expose Rebecca’s true face, we’ll forever\nbe suppressed by them. Even Wesley and Rebecca have joined hands. After what Wesley said just\nnow, I’m afraid that he’ll do something to the children. ”"
      },
      {
        "paragraph": "“That’s why I want you to take the children and leave first,” Shaun said without thinking."
      },
      {
        "paragraph": "Catherine parted her red lips. In the end, she lowered her eyes and said guiltily, “There’s one thing I\nforgot to tell you. I just learned about this. Matthew is actually my half-brother.”"
      },
      {
        "paragraph": "Shaun froze. Catherine had mentioned the Costner family, but he did not expect her to bring up\nMatthew."
      },
      {
        "paragraph": "“Matthew deliberately approached me in Melbourne.”"
      },
      {
        "paragraph": "Catherine bit her lip. “He already knew my true identity. Later, when Hill Corporation was being\ninvestigated, I went to him for help. He said he couldn’t do it, but he could ask his father, Titus, for help.\nTitus refused back then, but during the banquet held by Nathan, you were called away and I saw Titus\non the top floor. He was playing chess and I helped him reverse the game, so he said that he would\nhelp me once."
      },
      {
        "paragraph": "“Today, I went to see him in hopes that he would help you after I leave, but I didn’t expect my mom to\nsuddenly appear. Now I know that this was all orchestrated by the Costner family. I was so stupid.”"
      }
    ]
  },
  {
    "title": "Chapter 1589 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun understood. His expression sank. “So… Titus knows about your plan?”"
      },
      {
        "paragraph": "“… Yeah.” Catherine admitted with difficulty. “But he doesn’t know about your relationship with Uncle\nBrennan. I didn’t tell him that we’re leaving on Uncle Brennan’s private plate because I was afraid that\nthey would take precautions. I’m sorry, I— ”"
      },
      {
        "paragraph": "“Don’t apologize. It’s not your fault.” Shaun stroked her dark hair. “We didn’t expect the Costner family\nto be so shameless.”"
      },
      {
        "paragraph": "After all, they let Matthew deliberately approach them and the same happened with Titus."
      },
      {
        "paragraph": "Wait, Titus’ name sounded familiar. It seemed Brennan had mentioned him before."
      },
      {
        "paragraph": "Brennan said that he had seen a woman in Neah Bay who looked very much like Catherine."
      },
      {
        "paragraph": "However, he did not have any evidence, so he did not mention it to Catherine because he did not want\nher to be disappointed."
      },
      {
        "paragraph": "In that case, the wife of the head of the Costner family in Neah Bay was really Sheryl Jones."
      },
      {
        "paragraph": "Rebecca had gone over in advance to meet Sheryl first. However, how did Rebecca know that Sheryl\nwas still alive?"
      },
      {
        "paragraph": "According to Brennan, the Costner family was extremely powerful and they could be said to be the\nrichest family in the world. It was no wonder that Nathan did not dare to offend them."
      },
      {
        "paragraph": "“Cathy, I’ll take you to see my dad. He knows about some things, ” Shaun suddenly grabbed\nCatherine’s hand and said eagerly."
      },
      {
        "paragraph": "Catherine was confused, but seeing Shaun’s handsome and unpredictable face, she nodded."
      },
      {
        "paragraph": "Just as they left the office, a group of executives came up to meet them and were at a loss."
      },
      {
        "paragraph": "“Chairman Hill, Rebecca’s group came over and said that they want us all to get out. Is that true?”"
      },
      {
        "paragraph": "“Chairman Hill, have you really been ousted as chairman?”"
      },
      {
        "paragraph": "“Chairman Hill, is it true that we can’t stay in the company anymore?”"
      },
      {
        "paragraph": "The group of executives was worked up. Some of them had worked in Hill Corporation for two or three\ndecades. They thought of Hill Corporation as their family, so all of them were reluctant when they were\nsuddenly asked to leave."
      },
      {
        "paragraph": "If they left, they would definitely not receive such generous treatment outside of Hill Corporation."
      },
      {
        "paragraph": "“Everyone, listen to me.”"
      },
      {
        "paragraph": "Shaun raised a hand, and the intimidating force emanating from him made the crowd quiet."
      },
      {
        "paragraph": "“It’s true that I’m no longer the chairman of the company, and I’m not quite sure what the company will\nbe like in the future. Maybe… it won’t be called Hill Corporation tomorrow.”"
      },
      {
        "paragraph": "Shaun’s voice revealed some bleakness. When the employees, especially the female executives,\nremembered how high -spirited and noble Shaun was in the past, they were heartbroken."
      },
      {
        "paragraph": "“Eldest Young Master Hill…” someone exclaimed, “ We believe in you. We believe that you’ll revive Hill\nCorporation sooner or later. We followed you because you said you wanted to be the best high- end\ntechnology company in the country.”"
      },
      {
        "paragraph": "“Thank you all for your trust in me.”"
      },
      {
        "paragraph": "Shaun’s dark eyes flowed with an exquisite ray of light. “If one day I rise again, I hope that I’ll be able to\nwork with you all once more. If I force you to stay now, you’ll only be humiliated because of me. But I’ve\nseen all your efforts over the years. Later, I’ll ask Hadley to handle the resignation formalities for you.\nEveryone will get an amount of compensation. I hope that all of you will have a bright future.”"
      },
      {
        "paragraph": "Shaun took out a card from his pocket and handed it to Hadley. “Split it.”"
      },
      {
        "paragraph": "Then, he took Catherine and left the office. Along the way, both of them were silent."
      },
      {
        "paragraph": "Catherine’s mind was filled with the scene from earlier."
      }
    ]
  },
  {
    "title": "Chapter 1590 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun had let all his employees go. What did that mean?"
      },
      {
        "paragraph": "Did it mean he was really giving up on Hill Corporation?"
      },
      {
        "paragraph": "This was all because of her mother."
      },
      {
        "paragraph": "Catherine was filled with chagrin, remorse, and heartache."
      },
      {
        "paragraph": "Their car arrived at Brennan’s villa. Shaun opened the car door and reached out to her. “Come on.”"
      },
      {
        "paragraph": "“ Shaunny, I’ll definitely try my best to solve this misunderstanding and have my mom return the\ncompany to you.” Catherine looked up with watery eyes."
      },
      {
        "paragraph": "“Heh.”"
      },
      {
        "paragraph": "Shaun ruffled her bangs as he said in a low and helpless voice, “Silly girl, your thinking is too simple.\nHill Corporation’s shares now belong to Rebecca. In other words, even if Sheryl regrets it in the future,\nit’ll be hard to take the company back.”"
      },
      {
        "paragraph": "Catherine was stunned. “Is my mom out of her mind?”"
      },
      {
        "paragraph": "“You say that about your mom, but a wise man like Titus also indulged in Rebecca and let her run amok\nwith so much money. Even though the money is from the Costner family, the shares are under\nRebecca’s name. But Titus didn’t stop it from happening. That’s a little strange.”"
      },
      {
        "paragraph": "Shaun gave her a deep look. “Frankly, I think that Rebecca didn’t just do something as simple as\nsowing dissension.”"
      },
      {
        "paragraph": "Catherine’s pale lips trembled. She did not know what to say."
      },
      {
        "paragraph": "“Let’s go in and see my dad.” Shaun led her into the villa."
      },
      {
        "paragraph": "Surprisingly, they found that Lea was also there."
      },
      {
        "paragraph": "When Lea saw the two of them, an embarrassed look flashed across her face. “I wanted to talk to your\nfather about some things regarding Country Y. I don’t know much about that place, and I don’t know\nwhere your grandparents should live after moving there, so I wanted to ask him to help us buy a villa\nthere.”"
      },
      {
        "paragraph": "If it were in the past, Shaun might want to be a little nosy."
      },
      {
        "paragraph": "He actually wanted his parents to talk privately more often since there was a possibility they would get\nback together. However, he had something on his mind now and did not have the heart to think about\nanything else. “Dad, do you remember telling me that you went to Neah Bay and saw a woman who\nlooked a lot like Cathy?”"
      },
      {
        "paragraph": "“Yeah.” Brennan nodded. “Why are you suddenly bringing that up?”"
      },
      {
        "paragraph": "Catherine was stunned. “So you’ve seen her before.”"
      },
      {
        "paragraph": "“It’s my fault. I should’ve told you earlier. I should’ve taken you to Neah Bay back then to meet that\nwoman.”"
      },
      {
        "paragraph": "Shaun said to Brennan with a bit of chagrin, “Did that woman remarry someone called Titus Costner\nand have a son called Matthew Costner?”"
      },
      {
        "paragraph": "“Her husband is Titus, but I don’t know her son’s name,” Brennan said."
      },
      {
        "paragraph": "“Dad, do you know who’s been secretly dealing with the Hill family all this while? It’s Titus and Sheryl. ”\nShaun smiled bitterly. “I don’t know what kind of despicable method Rebecca used. It’s like she’s\nbrainwashed Titus and Sheryl. They keep"
      },
      {
        "paragraph": "targeting Cathy, who’sSheryl’s biological daughter.”"
      },
      {
        "paragraph": "Brennan was shocked. It had just been his guess, but he did not expect that it would be true."
      },
      {
        "paragraph": "“Dad, you said before that Titus is a ruthless and shrewd person. Is it because he doesn’t like that\nSheryl gave birth to a daughter before so he’s deliberately trying to get rid of Cathy?” Shaun guessed."
      },
      {
        "paragraph": "“No, Titus is… I’ve only seen him once, but he’s not the kind of person who would target a young lady\nfor that reason.”"
      },
      {
        "paragraph": "Brennan thought about it. “Why don’t I talk to Titus? Maybe we can clear up the misunderstanding.”"
      },
      {
        "paragraph": "“No,” Catherine hurriedly said, “Uncle Brennan, you’re our last trump card. You can’ t reveal your\nrelationship with Shaun. If it really comes down to it, we have to count on you to leave with the two\nchildren and keep them safe and sound.”"
      }
    ]
  },
  {
    "title": "Chapter 1591 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“It won’t be that serious, right? After all, she’s still your biological mother.” Lea was a little puzzled. “\nSuzie and Lucas are her grandchildren too. Not even I was that vicious when Shaun and I were on bad\nterms.”"
      },
      {
        "paragraph": "At most, she said some unpleasant things and tried to get Liam to snatch the position of chairman."
      },
      {
        "paragraph": "When Shaun had children, she was still quite happy about it."
      },
      {
        "paragraph": "However, Catherine fell silent and did not reply."
      },
      {
        "paragraph": "Shaun sighed. “Cathy’s mother slapped her.”"
      },
      {
        "paragraph": "Brennan lit a cigarette. After a moment, he said, “In that case, I won’t go to Titus for the time being.\nAlso"
      },
      {
        "paragraph": "… you originally planned to leave next week. Are you still going?”"
      },
      {
        "paragraph": "Everyone looked at Catherine."
      },
      {
        "paragraph": "Catherine was silent for a while before shaking her head. “I want to stay and find out the truth.”"
      },
      {
        "paragraph": "Shaun touched her long hair. A sharp light flashed in his dark eyes as he gradually had an idea. “Dad,\nwhat’s the real power of the Costner family like?”"
      },
      {
        "paragraph": "Brennan hesitated for a moment before saying in a complicated way, “I remember I told you that Titus ‘\nwife is the owner of Soromon Island. After Sheryl got stranded there, she developed the oil on the\nisland. In terms of financial resources, Sheryl and Titus are on par. One of them is in control of the oil,"
      },
      {
        "paragraph": "and the other is in control of the shipping routes and banks. No matter which country they go to, their\nidentities are enough for the president of each country to personally receive them.”"
      },
      {
        "paragraph": "Catherine was shocked. “My mom didn’t get her current position because she married Titus?”"
      },
      {
        "paragraph": "“No, these two people are a strong alliance.” Brennan looked at her with a bit of pity. “You’re her\nbiological daughter. If Sheryl publicly acknowledges that you’re her daughter and she gives you even\none drop of her wealth, it’ll be enough to make you the richest young lady in the world.”"
      },
      {
        "paragraph": "“Dad, stop sprinkling salt on Cathy’s wound. She doesn’t care about money.” Shaun quickly interrupted.\n“Dad, I have an idea. We took out a significant number of Titus’ men today. I’m guessing that he’ll\ndefinitely send over more men from Neah Bay, but as long as those people can’t go through customs\nand enter the country, Titus and Sheryl will be helpless in Australia no matter how much money they\nhave. When that happens, we can deal with them however we want to.”"
      },
      {
        "paragraph": "Brennan was slightly surprised. “You’re very daring. If something happens to Titus and Sheryl in the\ncountry, Nathan will get into trouble. He won’t agree with what you’re doing. The Snow family can’t\nafford the Costner family’s revenge.”"
      },
      {
        "paragraph": "“Dad, you said that the Costner family and Soromon Island are two places of enormous power. Where\nthere’s money and power, there’ll be disputes. The Costner family is full of talents, so won’t there be\npeople who are jealous of Titus? As long as we can find the right person in the Costner family to\ncooperate with, Titus’ death might even be a happy thing for the people of the Costner family.”"
      },
      {
        "paragraph": "Shaun’s words were meaningful, and everyone understood."
      },
      {
        "paragraph": "Brennan looked at his son with eyes full of horror."
      },
      {
        "paragraph": "Catherine was a little stunned. “Is there… a need to go that far?”"
      },
      {
        "paragraph": "“This will be the last resort we use to protect ourselves. Don’t worry, even if that day comes, I won’t hurt\nyour mom. At most… I’ll put her under house arrest.” Shaun gently reassured her. “For now, we still\nhave to meet Titus and your mom to talk and find out what the misunderstanding is. It’s best if we can\nclear the misunderstanding. But if we can’t, then we won’t be left with a choice.”"
      },
      {
        "paragraph": "Catherine nodded. She would definitely figure out the truth as soon as possible."
      },
      {
        "paragraph": "Shaun turned to look at Brennan. “Dad, please go to Neah Bay and find out who’s the most ambitious\nmember in the Costner family as well as who’s the most jealous of Titus. You have to go to Soromon\nIsland too. Sheryl only appeared afterward, so there must be people on the island who don’t accept\nher.”"
      },
      {
        "paragraph": "“Okay, I’ll fly there tomorrow. ” Brennan nodded ruefully."
      }
    ]
  },
  {
    "title": "Chapter 1592 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "At the same time."
      },
      {
        "paragraph": "In the Costner family’s villa."
      },
      {
        "paragraph": "Titus looked at the two bodyguards who were kneeling in front of him. His face was as dark as ink."
      },
      {
        "paragraph": "“So of the 30 people I brought over from Neah Bay, only the two of you are still fine?”"
      },
      {
        "paragraph": "The two bodyguards trembled."
      },
      {
        "paragraph": "Rebecca also panicked a little in her heart. However, when she thought that Sheryl was on her side,\nher eyes reddened in grievance as she stood up. “It was Catherine. She brought everyone from Liona\nand even borrowed people from Chester. Liona and Chester’s men surrounded our people in the\nlaboratory and deliberately crippled them.”"
      },
      {
        "paragraph": "“Outrageous! ” Sheryl slammed the table in anger and stood up. “If I knew this would happen, I\nwould’ve crippled her on the spot.”"
      },
      {
        "paragraph": "“Mom, Uncle Titus, I’m sorry. I’m so useless.”"
      },
      {
        "paragraph": "Rebecca began to cry. “I just wanted to take over the laboratory earlier, but Shaun had the place\ncompletely surrounded. I wanted to bring more people in, I didn’t expect them to be so cruel.”"
      },
      {
        "paragraph": "“Alright, don’t cry. I underestimated that b*tch Catherine’s savageness. I’ll immediately get more people\nto come over from Neah Bay. I’ll make them pay for this.” Sheryl gnashed her teeth."
      },
      {
        "paragraph": "Titus rubbed his eyebrows. He really regretted coming to Australia now. “If I were Shaun, I wouldn’t\nallow our people to come into Australia. They won’t be able to pass through the customs.”"
      },
      {
        "paragraph": "Rebecca was stunned, while Sheryl frowned. “What do you mean? Will Shaun dare to stop our people\nfrom entering Australia?”"
      },
      {
        "paragraph": "“Sherry, the Hill family is an influential family here and they’re on the same boat as the Snow family.\nAlthough 70% Of Hill Corporation has been acquired, his connections aren’t ordinary.” Titus’s\nexpression was dark. “I advise you two to lay low for now. Our forces have been taken down now."
      },
      {
        "paragraph": "We’re trapped.”"
      },
      {
        "paragraph": "Sheryl sneered. “Titus, are you deliberately trying to scare me to help Catherine?”"
      },
      {
        "paragraph": "Titus looked at the intense look on Sheryl’s face and his heart flashed with a deep sense of\nunfamiliarity. “Sherry, when did you become so irrational? You’re not like how you were in the past at\nall.”"
      },
      {
        "paragraph": "“ I didn’t change. You’re the one who’s changed, ” Sheryl retorted sharply."
      },
      {
        "paragraph": "“Mom, Uncle Titus, don’t fight.” Rebecca hurriedly advised. “It’s all my fault. If it weren’t because of me,\nyou wouldn’t have come to Australia.”"
      },
      {
        "paragraph": "“It’s not your fault. If anyone is to blame, it’s Catherine, ” Sheryl said with disgust."
      },
      {
        "paragraph": "“President Costner, bad news.” At that moment, Titus’ assistant hurriedly rushed in from outside. “ The\nhospitals in Canberra won’t accept our injured bodyguards.”"
      },
      {
        "paragraph": "Rebecca was stunned, while Sheryl looked even more incredulous. “They’re not accepting our men?\nDo they want to close down?”"
      },
      {
        "paragraph": "The assistant smiled bitterly. “There’s a force behind all the hospitals in Canberra, and that’s the Jewell\nfamily. Chester Jewell and Shaun Hill are good friends.”"
      },
      {
        "paragraph": "Titus asked with a grave expression, “What if we send them to a hospital somewhere else?"
      }
    ]
  },
  {
    "title": "Chapter 1593 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“ If the treatment of their injuries is delayed, there might be serious consequences, such as… losing the\nmobility in their legs, ” the assistant said in a low voice."
      },
      {
        "paragraph": "Losing the mobility in their legs?"
      },
      {
        "paragraph": "Titus was so angry that he wanted to kill Rebecca. Those people were all his trusted aides."
      },
      {
        "paragraph": "Rebecca saw Titus’ furious expression."
      },
      {
        "paragraph": "She quickly thought of something and hurriedly said, “Chester’s fiancée is my good friend.”"
      },
      {
        "paragraph": "“Rebecca, I didn’t expect your friends to be so powerful. You should call and talk to her. ” Sheryl looked\nat her encouragingly."
      },
      {
        "paragraph": "Rebecca quickly nodded and called Cindy."
      },
      {
        "paragraph": "“Rebecca, what’s up?” Cindy was in a very bad situation recently. Many of her events and\nadvertisements had been canceled."
      },
      {
        "paragraph": "“Cathy, my uncle’s men were injured by Shaun and Chester told the hospitals in Canberra not to take\nthem in for treatment. Can you help me out?” Rebecca smiled. “Of course, I’ll owe you for this. If there\nare any good Hollywood movies after this, I can give you a referral.”"
      },
      {
        "paragraph": "Cindy was moved, but she could only say with a wry smile, “You think too highly of me. Chester and\nShaun are good friends. There’s no way he’ll listen to me…”"
      },
      {
        "paragraph": "Moreover, Chester said that he was going to break off the engagement with her, so she was incredibly\nanxious."
      },
      {
        "paragraph": "“You can go to Chester’s parents. Cindy, haven’ t you always been curious who’s the people behind\nme?” Rebecca said in a low voice. “The people behind me are the Costner family. They have control of\nthe world’s main shipping routes and own the largest bank in the world. My real mother is also the\nowner of Soromon Island, where many of the world’s gems come from. Do you really want to miss this\nopportunity to meet them?”"
      },
      {
        "paragraph": "Cindy’s heart thumped rapidly. “You… Isn’t your mother from Melbourne…”"
      },
      {
        "paragraph": "“They’re not my real parents. Don’t say anything about this, ” Rebecca said. “You can choose whether\nyou want to seize this opportunity or not. Only when you have powerful connections can you truly gain\na firm foothold in the Jewell family.”"
      },
      {
        "paragraph": "“I understand.” Cindy nodded. “Leave it to me.” Cindy quickly made a call to Michael Jewell."
      },
      {
        "paragraph": "When Michael heard that Cindy knew such a bigshot, his heart thumped with excitement as he\nimmediately called the hospitals to have them take in Titus’ bodyguards."
      },
      {
        "paragraph": "When the Costner family found out, Sheryl was full of praise for Rebecca. “You’re so capable.”"
      },
      {
        "paragraph": "“Don’t say that, Mom. This all started because of me. Michael said that he wants to have a meal with\nyou and Uncle Titus, ” Rebecca said, “As you can see, Chester and Shaun are good friends, but as\nlong as we win over Chester’s father, the Jewell family can no longer help Shaun.”"
      },
      {
        "paragraph": "“Yes, sure. It’s just a meal.” Sheryl readily agreed."
      },
      {
        "paragraph": "Titus and Matthew had been sitting silently on the side without saying a word. Matthew was very\nuncomfortable seeing Sheryl praise Rebecca incessantly."
      },
      {
        "paragraph": "It was clearly because of Rebecca’s recklessness that caused their men to be injured, but Sheryl only\npraised her for being capable. What was happening?"
      },
      {
        "paragraph": "Matthew got up and left."
      },
      {
        "paragraph": "Sheryl stopped him coldly and warned, “If you contact Catherine again, you don’t have to call me ‘\nMom’ in the future.”"
      },
      {
        "paragraph": "“Hah. I do call you my mother, but do you still remember that you have a son? I thought you only had\none daughter.”"
      },
      {
        "paragraph": "Matthew pulled a long face and walked away."
      }
    ]
  },
  {
    "title": "Chapter 1594 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Sheryl glared at Titus angrily. “Look at how you’ve disciplined your son!”"
      },
      {
        "paragraph": "Titus’ temples throbbed. He did not understand how the once smart, wise, calm, and generous Sheryl\nJones turned into this."
      },
      {
        "paragraph": "“Yes, I don’t know how to discipline him. ” Titus got up and left."
      },
      {
        "paragraph": "Looking at the indifferent attitudes of the father and son, Sheryl was so angry she wanted to smash\neverything in front of her."
      },
      {
        "paragraph": "It was all Catherine’s fault. It was Catherine who caused them to grow further and further apart."
      },
      {
        "paragraph": "After Matthew left the Costner residence, he took out his phone and saw missed calls from Catherine."
      },
      {
        "paragraph": "She had called him after leaving the cafe, but Sheryl was present then, so he did not dare to answer."
      },
      {
        "paragraph": "When he thought of Catherine’s swollen face, he guiltily returned the call."
      },
      {
        "paragraph": "Catherine’s mocking voice sounded from the other end. “Young Master Costner, what other information\ndo you need to extract from me?”"
      },
      {
        "paragraph": "“I… I’m sorry.” Matthew was very upset and mumbled an apology. “I deliberately said that to my mom. I\nwas afraid that she would be angry. When I first met you, I didn’t know that you were Catherine. You\nhad also lied and said that your name was Hera Imm.”"
      },
      {
        "paragraph": "“But didn’t you find out later? You came to Canberra to find me on purpose, and all those chance\nencounters at the shopping mall were planned by you.”"
      },
      {
        "paragraph": "Catherine was truly angry. “Your Costner family is so rich, but your father and you had to stoop to the\nlevel of spying to deceive me. I really don’t understand how I provoked your family.”"
      },
      {
        "paragraph": "“You didn’t provoke the Costner family. You provoked Rebecca and my mom. ” Matthew added silently\nin his heart, ‘Of course, you also harmed my grandmother.’"
      },
      {
        "paragraph": "However, he knew Catherine for a while now. In his bones, he felt that Catherine was not… that bad."
      },
      {
        "paragraph": "“I provoked Rebecca? She has always been the one who provoked me. She even killed a good friend\nof mine. There’s deep hatred between us,” Catherine said coldly, “But what does your mother have\nagainst me? I haven’t seen her for almost 20 years. It’s good enough that I’m not blaming her for it.”"
      },
      {
        "paragraph": "“Rebecca is my mother’s daughter. If you mess with Rebecca, it’s the same as messing with my mom, ”\nMatthew said."
      },
      {
        "paragraph": "“What?” Catherine was completely dumbfounded. She even thought that her ears were playing tricks\non her. “Rebecca is your mother’s daughter?”"
      },
      {
        "paragraph": "“Of course.” Matthew knew what she wanted to say and hurriedly said, “Don’t tell me that you’re\nactually her daughter and not Rebecca. I won’t believe you.”"
      },
      {
        "paragraph": "Catherine, “….”"
      },
      {
        "paragraph": "If this fool Matthew were standing in front of her right now, she would have grabbed his head and\nsmashed it against the wall to make him get things straight."
      },
      {
        "paragraph": "“She’s not Sheryl’s daughter. Rebecca is Jeffery Jones and Sally Lennon’s daughter! ” Catherine yelled\nagitatedly, “You bunch of idiots have all been tricked by her! ”"
      },
      {
        "paragraph": "“You’re the idiot.” Matthew got a little angry. “ Catherine, don’t think that everyone is as easy to fool as\nJoel Yule.”"
      },
      {
        "paragraph": "Catherine took a deep breath, worried that her brain would explode from anger. “Listen. I don’t know\nwhat Rebecca told you, but I really am Sheryl’s biological daughter. I’m your sister. If you don’t believe\nme, you can do a DNA test. You should be able to tell just by looking at our faces. I look more like\nSheryl, okay?”"
      },
      {
        "paragraph": "“It’s normal for a niece to look like her aunt sometimes.” Matthew scoffed. “And I won’t do a DNA test\nwith you. Chester and Shaun are good friends. It’d be a simple task for you to get Chester to tamper\nwith the test results.”"
      }
    ]
  },
  {
    "title": "Chapter 1595 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "There was sudden silence on the other end of the phone, and Matthew said coldly, “What, have you\nlost confidence because your plan was exposed by me?”"
      },
      {
        "paragraph": "“No, I was just rendered speechless by your imagination. ” Catherine’s voice carried a sense of\npowerlessness. “How about this? If you’re afraid that I’ll tamper with the evidence, you can take my\nblood and hair and send the samples to Neah Bay for the DNA test. The people there are all on your\nside, so I won’t be able to mess with the results. ”"
      },
      {
        "paragraph": "“Speaking of Neah Bay… that’s even more unnecessary, ” Matthew said faintly, “I already did a DNA\ntest for Rebecca and my mother in Neah Bay. She’s my mother’s biological daughter.”"
      },
      {
        "paragraph": "“How can that be?” Catherine was stunned."
      },
      {
        "paragraph": "“As you said yourself, the people in Neah Bay are all ours. It’s my territory, so not even Rebecca can\ntamper with the results.”"
      },
      {
        "paragraph": "Matthew’s tone was full of disappointment. “ Catherine, I admit that when I got along with you, my\nimpression of you was quite good. To be honest, sometimes I also hoped that you’re my sister but\nyou’re not. Moreover, you keep telling this lie to others. You’ve been telling lies for so long that even I\nbelieved you. I’m calling you today for only one reason, and that’s to explain to you that I didn’t know\nwho you were when I first met you. No matter what my mom or Rebecca does to you in the future, I\nwon’t intervene anymore.”"
      },
      {
        "paragraph": "Catherine thought about it. After forcing herself to calm down, she said, “Matthew, I can’t do anything if\nyou don’t believe me, but I just want to remind you that Rebecca isn’t a simple person. Maybe she said\na lot of bad things about me in front of you, but you should go to Melbourne to investigate carefully"
      },
      {
        "paragraph": "“Enough. I’ve already investigated both you and Rebecca in Melbourne. Everything she said is true, ”\nMatthew interrupted her."
      },
      {
        "paragraph": "“I don’t know how you did your investigation, but what you heard was probably hearsay from people\nunrelated to the Jones family. I suggest you go to the families of those with a little status in Melbourne\nto find out what kind of person Rebecca"
      },
      {
        "paragraph": "really is, especially the Campbell and Lowe families. The young masters of those two families dated\nRebecca before. There’s no way I could buy off people who used to date Rebecca, right?”"
      },
      {
        "paragraph": "Catherine gave him a final reminder. “I’m not trying to incite disharmony. Rebecca is very cunning.\nShe’s the best at pretending to be weak and kind. Think about it. If she’s really that incapable, how did\nshe coax your mother into using so much money to buy Hill Corporation for her?"
      },
      {
        "paragraph": "Even the shares are under her name.”"
      },
      {
        "paragraph": "Matthew had to admit that the last point hit a sore spot."
      },
      {
        "paragraph": "“You’re clearly trying to sow dissension.”"
      },
      {
        "paragraph": "“Matthew, you should know best. How long has it been since Rebecca returned to Sheryl’s side? At\nmost, it’s probably been two to three years. Let me ask you, has your mother ever given you hundreds\nof billions to spend?”"
      },
      {
        "paragraph": "“I can’t be bothered to listen to you anymore.” Matthew did not want to chat any further."
      },
      {
        "paragraph": "“Investigate Rebecca properly. Don’t let your family be torn apart because of Rebecca. Jeffery and\nSally aren’t easy people to deal with either. My grandmother was pushed down the stairs by Sally."
      },
      {
        "paragraph": "This was also the reason the couple went to jail. Even when they started a decoration company, they\noften cut corners and received bad reviews.”"
      },
      {
        "paragraph": "Catherine hung up the phone first."
      },
      {
        "paragraph": "Standing on the balcony, her clear and bright eyes seemed to be full of loss."
      }
    ]
  },
  {
    "title": "Chapter 1596 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "When Shaun came over, his large palm gently pressed on her shoulder. “I heard everything.”"
      },
      {
        "paragraph": "“Shaunny… ” Catherine buried her little face in his arms, suddenly feeling lost. “Matthew said that he\ndid a DNA test for Rebecca and Sheryl, and Rebecca is Sheryl’s daughter. What about me? Whose\ndaughter am I? Am I really Sheryl’s daughter?”"
      },
      {
        "paragraph": "She was very sure about this before, but now, she suddenly doubted herself."
      },
      {
        "paragraph": "“Silly girl. You look so similar to Sheryl. Who’s daughter could you be if not hers?” Shaun lowered his\neyes at the uneasy woman in his arms and said in a low gentle voice, “Did you forget that you did a\nDNA test with Joel?”"
      },
      {
        "paragraph": "Catherine paused as she remembered it. “But…? ”"
      },
      {
        "paragraph": "“You should’ve asked Matthew what Rebecca used for the DNA test with Sheryl. I’m guessing it must\nbe hair.” Shaun’s eyes flashed."
      },
      {
        "paragraph": "“What’s wrong with hair?” There was a confused look on Catherine’s face."
      },
      {
        "paragraph": "“ If it’s hair, it’s easier for her to pass off a fake as genuine,” Shaun said in a complicated tone, “\nActually, I’ve been thinking about something ever since I learned that Titus’ wife is your mom.”"
      },
      {
        "paragraph": "“What is it? Hurry up and tell me.” Catherine urged him."
      },
      {
        "paragraph": "“The real reason why Wesley pursued you so desperately.” Shaun stared at her and curled his lips\ndoubtfully. “At first, he might have pursued you because he really liked you and admired you, but what\nabout afterward? You married me and even had children, but he refused to give up on you. Even when"
      },
      {
        "paragraph": "he knew that you were with me on his wedding night, he still wanted to continue the marriage. He made\nit seem as though he was some sort of saint.”"
      },
      {
        "paragraph": "Catherine blinked. “ Isn’t it because he didn’t get me? He wanted to get revenge on me after he\nobtained me or make me fall in love with him.”"
      },
      {
        "paragraph": "“That’s what I thought at first too, but it’s possible that there’s another reason.”"
      },
      {
        "paragraph": "Shaun paused as his gaze turned sharp. “He may have known long ago that your mother is Titus’ wife.\nHer status is extraordinary, so if he marries you and Sheryl and you acknowledge each other in the\nfuture, his status would also rise. Think about it. He’d be the son-in-law of the owner of Soromon\nIsland. What would be his status in the world?”"
      },
      {
        "paragraph": "Catherine’s heart shook fiercely. “ If you put it that way, it really seems possible. He’s too shrewd and\ngood at hiding his true colors, after all.”"
      },
      {
        "paragraph": "Shaun nodded. “With how sinister he is, he probably thought that after he married you and got Sheryl\nto acknowledge you, he would be able to gain Titus and Sheryl’s trust. Then, he’d borrow their power to\nslowly become the richest man in the world. When Sheryl and her husband become useless to him\nafter that, he can dispose of you all.”"
      },
      {
        "paragraph": "Catherine became more horrified the more she listened. “I remember that Wesley often cooperated\nwith the assassins in Neah Bay. Logan said that a person here once went to Neah Bay and came back\nwith a bunch of assassins. Could that person… be Wesley?”"
      },
      {
        "paragraph": "“It was definitely him. Back then, Wesley was already working with Mason, and Mason told him to go to\nNeah Bay to look for the assassins. If he saw Sheryl there, then all the pieces connect. Besides, Sheryl"
      },
      {
        "paragraph": "looks very similar to you. Even my dad said that when he saw your mother and then you, he"
      },
      {
        "paragraph": "was confused and suspected that you were mother and daughter.”"
      },
      {
        "paragraph": "Shaun said, “Mason could have investigated it and found that your mother only went missing after\ngetting caught in a typhoon. If he went to Neah Bay to ask the local residents about Sheryl’s past, it\nwould’ve been easy to find clues.”"
      }
    ]
  },
  {
    "title": "Chapter 1597 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine opened her mouth with difficulty. “ If I hadn’t found out that something was off with him, he\nprobably would’ve kept pretending.”"
      },
      {
        "paragraph": "“Maybe not. Maybe he wouldn’t want to keep enduring and would slowly expose his nature to you.”\nShaun wrapped his arms around her waist. “ Because he found another way to get back at you while\nalso letting his career continue to rise.”"
      },
      {
        "paragraph": "Catherine’s gaze darkened. “You mean… Rebecca?”"
      },
      {
        "paragraph": "Shaun lowered his head. His large palm gently weaved through her long hair, and two strands of inky\nblack hair fell into his palm. “A woman’s hair falls easily. When you stayed in Wesley’s villa, wouldn’t\nyou have shed strands of hair there? You stayed with him for a period of time, and cleaners came in\ndaily to clean the place up. Wouldn’t it be easy for Rebecca to use your hair for the DNA test if your\nhair was collected and sent to her?”"
      },
      {
        "paragraph": "Catherine was shocked. She bowed her head and looked at the hair in Shaun’s palm."
      },
      {
        "paragraph": "Yes, although her hair was thick, her hair would inevitably fall when she washed, combed, and blow-\ndried her hair."
      },
      {
        "paragraph": "In the past, she always thought that Wesley wanted to marry her because he wanted to get back at her\nand torture her."
      },
      {
        "paragraph": "The closer she got to the truth, the more she felt her hair stand on end."
      },
      {
        "paragraph": "How could a person be so terrifying?"
      },
      {
        "paragraph": "“I think that what you said is probably true.”"
      },
      {
        "paragraph": "Catherine murmured, “When Wesley married me in the beginning, he acted like he had deep feelings\nfor me. Afterward, his hatred for me became more and more obvious. It was probably because he\nalready had a feeling that I would never like him, so he might as well let Rebecca impersonate me."
      },
      {
        "paragraph": "Rebecca and I are cousins and we look slightly similar. Furthermore, she was abducted as a child and\nmany people in Melbourne don’t really know her, so they had room to pull off some tricks.”"
      },
      {
        "paragraph": "“That’s right.” Shaun nodded. “Rebecca used Wesley and made her into Sheryl’s biological daughter.\nThat’s why Wesley’s career soared after Rebecca came back. The two of them are tied to the same\nboat.”"
      },
      {
        "paragraph": "Catherine felt increasingly upset and unreconciled as she listened. “ It’s all my fault. How could I have\nbeen stupid enough to marry Wesley back then?”"
      },
      {
        "paragraph": "“Everyone has moments when they’re confused. Don’t blame yourself, ” Shaun comforted her softly."
      },
      {
        "paragraph": "Catherine smiled bitterly. “So what if we know the truth now? Matthew didn’t believe me when I told him\nthat Rebecca is a fake, and Sheryl thinks I’m a vixen who seduced Titus. She was probably\nbrainwashed by Rebecca. She doesn’t like me at all, and she even thinks of me as a vicious woman\nwho hurt Rebecca.”"
      },
      {
        "paragraph": "“I’m actually worried that it’s more than that…”"
      },
      {
        "paragraph": "Shaun’s handsome face was dark. “Do you remember when Rebecca came to me disguised as Shelley\nNeeson and secretly drugged my milk?”"
      },
      {
        "paragraph": "Catherine was shocked. “You think she gave it to my mom?”"
      },
      {
        "paragraph": "“It’s just a possibility.” Shaun expressed his concern. “The drug can cause people to become irrational.\nThink about it. Since your mother gave birth to you, she should know that your name is Catherine. How\ncould she have completely forgotten about that?”"
      },
      {
        "paragraph": "“You’re right. She lost her memory.” Catherine finally understood. She had ignored many details\nbecause she was upset at being hit by Sheryl."
      }
    ]
  },
  {
    "title": "Chapter 1598 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Yes, people with amnesia are like blank sheets of paper. Rebecca can manipulate her memories as\nshe wishes. Even Jeffery and Sally can discredit you."
      },
      {
        "paragraph": "Jeffery is Sheryl’s brother. Since she lost so many years’ worth of her memories, Sheryl must have\nbeen very happy to suddenly find her older brother. She probably wouldn’t think that these relatives of\nhers are actually vicious people.”"
      },
      {
        "paragraph": "Catherine’s eyes dimmed. Suddenly, she hated Sheryl. “Then why are you worried that Rebecca\ndrugged my mom?”"
      },
      {
        "paragraph": "“It’s very simple. Rebecca did the same thing before. If she’s no longer able to control or sway Sheryl,\nit’s not impossible that she’ll drug Sheryl in order to maintain her wealth and rank.”"
      },
      {
        "paragraph": "Shaun sighed. “Outsiders can see things more clearly than those involved. Sheryl finally found her\ndaughter who was missing for many years. This is the time when she’ll treasure her daughter the most.\nIt’s clear from the way Sheryl gave Rebecca so much money to buy Hill Corporation. If we want to find\na solution to this matter, we have to start with Titus and Matthew. You’ve dealt with Titus before. What\nkind of person do you think he is?”"
      },
      {
        "paragraph": "Catherine thought about it. “Unfathomable.”"
      },
      {
        "paragraph": "“That’s good. A person like that won’t be easily deceived by Rebecca. He’s not related to Rebecca by\nblood, so he can think about this matter rationally. I hope that what you said can make Matthew\nconduct a deeper investigation into things. The things that Rebecca did all those years ago can’t\nremain hidden if he investigates.”"
      },
      {
        "paragraph": "Catherine felt comforted and breathed out a sigh of relief."
      },
      {
        "paragraph": "Shaun hugged her and suddenly received a call from Hadley. “Eldest Young Master, the Costner\nfamily’s bodyguards have all been admitted to Jewell Hospital. I heard that it was Michael Jewell who\narranged it.”"
      },
      {
        "paragraph": "Shaun frowned and quickly called Chester. “The injured bodyguards from the Costner family have been\nadmitted into your hospital. Did Titus Costner contact your dad?”"
      },
      {
        "paragraph": "“ I just finished an operation so I’m not sure about this. I’ll go find out.”"
      },
      {
        "paragraph": "Chester’s face was cold, and he immediately called Michael. “Dad, why did you accept those\nbodyguards?”"
      },
      {
        "paragraph": "“You little brat. You still have the nerve to mention this?”"
      },
      {
        "paragraph": "Michael scolded him, “What’s the status of the Costner family? How many people around the world\nwant to build relations with them? But what did you do? You offended the Costner family instead."
      },
      {
        "paragraph": "Fortunately, I found out about this and the Costner family isn’t angry. They even intend to be friends\nwith us. We’ve already agreed on a time. Tomorrow night, you’ll come to dinner with us and personally\napologize to the Costner family.”"
      },
      {
        "paragraph": "“I just want to know who told you about this,” Chester asked expressionlessly."
      },
      {
        "paragraph": "“I’m your father. Of course, I’m well-informed…” “It was Cindy, wasn’t it?” Chester asked icily."
      },
      {
        "paragraph": "Cindy and Rebecca were good friends. When the Jewell family’s hospital refused to take in the\nbodyguards, Rebecca would definitely have contacted Cindy. It was Cindy who approached his father.\nEverything made sense."
      },
      {
        "paragraph": "Michael choked and snapped coldly, “Cindy did the right thing. She’s doing this for the good of our\nfamily. Do you know how big the Costner family is? All the banks in the world and the important\nshipping routes are in that family’s control. Compared to them, the Jewell family is as small as a fly.\nWhy are you interfering in the feud between Shaun and the Costner family? Shaun isn’t even your real\nbrother. He’s just your friend. Besides, more than half of Hill Corporation was bought over. His status in\nCanberra isn’t what it used to be. He no longer has the qualifications to be your friend.” “Dad, you don’t\nneed to care about who I’m friends with. As for the hospital, I’ll tell them that from now on, no one can\ndisobey my orders. You can go and befriend the Costner family if you want to, but I’m not interested in\nthem."
      }
    ]
  },
  {
    "title": "Chapter 1599 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Chester hung up after he spoke."
      },
      {
        "paragraph": "He did not care how angry Michael would be."
      },
      {
        "paragraph": "After hanging up the phone, he called another number. “Bring Cindy to my villa in an hour.”"
      },
      {
        "paragraph": "“Yes.”"
      },
      {
        "paragraph": "However, the person soon called him back. “Young Master Jewell, Cindy is with the madam.”"
      },
      {
        "paragraph": "Chester laughed at that."
      },
      {
        "paragraph": "On the other end, the subordinate had goosebumps from hearing his laugh. Every time Chester was\ntruly angry, he would laugh like this."
      },
      {
        "paragraph": "It was so low and cold that it caused people to shudder."
      },
      {
        "paragraph": "“Stop all the projects Cindy is involved in. I remember that Cindy signed a contract with Felix Media. If\nshe wants to bypass Felix and cooperate with big foreign productions, it’s considered a breach of\ncontract as long as Felix Media doesn’t agree to it. She can dream on if she wants to cooperate with\nanyone.”"
      },
      {
        "paragraph": "The subordinate immediately understood."
      },
      {
        "paragraph": "This time, Cindy had truly pissed Young Master Jewell off. If he wanted to completely put a halt to\nCindy’s career, it did not matter even if she had other contacts and could work in Hollywood. As long as\nCindy’s contract was in the hands of Felix Media, anyone who tried to cooperate with Cindy would"
      },
      {
        "paragraph": "encounter all sorts of problems. In that case, no film or television company would consider Cindy\nanymore.”"
      },
      {
        "paragraph": "“Oh, one more thing.”"
      },
      {
        "paragraph": "After a pause, Chester said, “Send the order that next time, all staff should ignore my father or mother\neven if they personally call any of the subsidiary companies. As for the person in the hospital who\nagreed to my father’s request to accept the Costner family’s bodyguards, find out who it is and fire\nthem. I don’t want to see that person ever again.”"
      },
      {
        "paragraph": "“Yes.”"
      },
      {
        "paragraph": "The subordinate understood that Chester was making a deliberate show of his power as well as\nsending a message to the people in Jewell Corporation."
      },
      {
        "paragraph": "No one in the Jewell family was allowed to disobey his orders, and Michael was no exception."
      },
      {
        "paragraph": "He could not help but secretly sigh."
      },
      {
        "paragraph": "Under Chester’s leadership, the Jewell family had expanded their business in a low-profile manner."
      },
      {
        "paragraph": "Chester was not high-profile like Shaun, but the Jewell family had never been inferior to the Hill family."
      },
      {
        "paragraph": "It was because Chester was ruthless enough that he did not bother sparing even his own father."
      },
      {
        "paragraph": "In the Jewell residence."
      },
      {
        "paragraph": "Cindy walked with Mrs. Jewell in the garden."
      },
      {
        "paragraph": "She had changed her method to please Mrs. Jewell."
      },
      {
        "paragraph": "“You’re such a clever and obedient child. Don’t worry, I’ll definitely make Chester marry you.”"
      },
      {
        "paragraph": "Mrs. Jewell held her hand and smiled comfortingly. In her eyes, Cindy was a mobile blood bank."
      },
      {
        "paragraph": "She would not let this blood bank leave her."
      },
      {
        "paragraph": "Humans were like that. The longer they lived, the more afraid of death they were—especially powerful\nand influential people like Mrs. Jewell."
      },
      {
        "paragraph": "“Aunty, thank you. ” Cindy sighed. “I’m just afraid that Chester will be angry at me for helping the\nCostner family.”"
      },
      {
        "paragraph": "“He’s not being sensible. The Hill family has already fallen. It’d be foolish to offend a powerful family\nlike the Costners for Shaun. You did the right thing.” Mrs. Jewell was full of praise."
      },
      {
        "paragraph": "Then, Cindy’s manager suddenly called. “Cindy, what the hell did you do? The company has canceled\nall the projects you’re involved in."
      },
      {
        "paragraph": "Remember the famous Hollywood director recommended by Ms. Jones who agreed to let you star in\nhis new film? The company called him and said that they don’t agree with you starring in their film. If\nthey insist on casting you, they’ll have to pay 80 million dollars to the company. The director was so\nscared that he immediately stopped the cooperation.”"
      },
      {
        "paragraph": "Cindy felt like she was drenched in cold water. “"
      }
    ]
  }
]