[


  {
    "title": "Chapter 1250 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Upon hearing Shaun’s voice, Catherine only felt like a venomous snake had slithered on her."
      },
      {
        "paragraph": "That day, Wesley beat her like he was the devil. However, he was as gentle as a lover today. “You’re\nout of jail?” She asked coldly."
      },
      {
        "paragraph": "“Yeah, the police also sympathized with me, but I had a really bad time in jail this past week. Cathy, I\nmiss you…”"
      },
      {
        "paragraph": "The last three words were particularly uttered meaningfully."
      },
      {
        "paragraph": "“What a coincidence. I quite miss you too, ” Catherine said in low tones. “But I don’t dare to meet you\nanymore. Who knows if you’ll add something to my water, or beat me up again.”"
      },
      {
        "paragraph": "“Cathy, I didn’t do it on purpose. I lost control that day. It’s because I care about you too much. You’re\nnot… going to talk about divorce, right?” Wesley sighed. “I won’t say too much on the phone. Who\nknows if you’re recording it?”"
      },
      {
        "paragraph": "Catherine glanced at the phone that was recording the call and sighed that Wesley was really too\ncunning and thorough."
      },
      {
        "paragraph": "“If you don’t meet me, then I won’t have to divorce you,” Wesley smiled. “It’s good if we’re tied up\ntogether like this. You’ll always be my wife. Even if you die, you’ll still belong to the Lyons family.”"
      },
      {
        "paragraph": "Catherine laughed and  said,  “Wesley,  don’t threaten me. That won’t work on me. Do you think"
      },
      {
        "paragraph": "I’m holding the evidence to negotiate for a divorce with you? That was what I originally planned, but\nyour shamelessness changed my mind. You like acting and performing, right? I’m looking forward to\nhow others will look at you the moment your mask is ripped off.”"
      },
      {
        "paragraph": "Wesley’s breathing was heavier, “Cathy, what evidence are you talking about? Have I done something\nwrong?”"
      },
      {
        "paragraph": "“Yeah, keep acting, Wesley. I want to tell you that you don’t know me very well.”"
      },
      {
        "paragraph": "Catherine hung up."
      },
      {
        "paragraph": "In the car."
      },
      {
        "paragraph": "The call ended and Wesley felt gloomy."
      },
      {
        "paragraph": "What did Catherine mean? Did she want to release the video of Regina and him?"
      },
      {
        "paragraph": "How dare she."
      },
      {
        "paragraph": "If she dared to release it, he would never divorce her even if he were to die."
      },
      {
        "paragraph": "“President Lyons, these two cameras were found in your office, ” Regina was pale as she took out the\ntwo small cameras."
      },
      {
        "paragraph": "She did not dare to imagine that her absurd acts with Wesley these days were filmed."
      },
      {
        "paragraph": "Wesley looked at the cameras and slapped her across the face. “You fool. Who let you seduce me in\nthe office unscrupulously?”"
      },
      {
        "paragraph": "Regina was aggrieved from the beating. Yes, she did take the initiative sometimes, but it took two to\ntango."
      },
      {
        "paragraph": "If she did not initiate, he would go to Sarah instead. She just wanted to secure her position."
      },
      {
        "paragraph": "“ I’m sorry, President Lyons.” Regina did not dare to retort and could only apologize in a hushed voice."
      },
      {
        "paragraph": "Wesley took a deep breath. At that moment, Mason called him suddenly."
      },
      {
        "paragraph": "“Wesley, your situation with Catherine has been a hot topic recently.”"
      },
      {
        "paragraph": "Wesley tensed up and uttered,  “President Campos “I just want to know if Catherine has anything\nunfavorable against you up her sleeve,” Mason said coldly. “I don’t want my family to get into trouble.”"
      },
      {
        "paragraph": "“No, she just got a hold of something regarding my affair,” Wesley said in a low tone. “President"
      },
      {
        "paragraph": "Campos, can you help me? I don’ t want this to be exposed.”"
      }
    ]
  },
  {
    "title": "Chapter 1251 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Haven’t I helped you enough already?” Mason laughed coldly. “Do you think I didn’t know?"
      },
      {
        "paragraph": "Previously, you wanted that group of assassins to kill Catherine’s twins.”"
      },
      {
        "paragraph": "Wesley clenched his fist."
      },
      {
        "paragraph": "“Wesley, you’re not even sparing three -year-old children. My ruthlessness can’t compare to yours,”\nMason said intently. “You want me to help you, but how am I supposed to help? Kidnap Joel Yule? Or\nkidnap the two children to threaten Catherine? Do you think they’ll be unprepared? Do you think I’m i n\ncharge of the country or that I have the means to hoodwink the public and do whatever I please?”"
      },
      {
        "paragraph": "Wesley’s heart skipped a beat. “That’s not what I meant.”"
      },
      {
        "paragraph": "Mason sighed. “The last time you urged Charlie to harm Shaun, you almost killed Hannah Mead. Do\nyou know how much it cost me to settle that?”"
      },
      {
        "paragraph": "“I’m sorry, President Campos. I didn’t know it"
      },
      {
        "paragraph": "would end up like that. I saw that Young Master Campos wanted Shaun to die…”"
      },
      {
        "paragraph": "“I’m telling you, people aren’t fools. When the two kids almost got into an accident the last time, it had\nraised the police’s suspicion. If the same thing happens again, the police will definitely follow the clues.\nYou should think it over and don’t cause any trouble.”"
      },
      {
        "paragraph": "Mason ended the call."
      },
      {
        "paragraph": "Wesley was so angry he wanted to crush his phone."
      },
      {
        "paragraph": "He could certainly tell that Mason did not want to help him."
      },
      {
        "paragraph": "He did so many things for the Campos family in the past."
      },
      {
        "paragraph": "Now that the Campos family reached a high position, they no longer valued him."
      },
      {
        "paragraph": "Fortunately, he made other plans, but something else had to be done at the same time."
      },
      {
        "paragraph": "He quickly dialed Sarah’s number."
      },
      {
        "paragraph": "Half an hour later, the two of them met up in Wesley’s private villa."
      },
      {
        "paragraph": "“President Lyons, welcome back,” Sarah looked at him with a smile. “What’s wrong? Are you in a bad\nmood?”"
      },
      {
        "paragraph": "“How is Rodney now? Is the Snow family still ignoring him?” Wesley asked coldly."
      },
      {
        "paragraph": "Sarah’s face stiffened. She knew that Wesley only helped her back then because of the Snow family\nbehind Rodney. “The Snow family is still angry, but don’t worry. After all, Rodney is Jason’s son. It’s\nimpossible for them to ignore him.”"
      },
      {
        "paragraph": "“How many years will that take?”"
      },
      {
        "paragraph": "Wesley took out a bottle of wine and opened it. The reflection of his eyes in the dark red wine looked\nvery strange. “ Sarah, sometimes, you have to use your brain. If Rodney goes on like this, are you\npatient enough to stay with him for a few more years?”"
      },
      {
        "paragraph": "Sarah was suddenly at a loss."
      },
      {
        "paragraph": "The only thing she could do now was to firmly hold onto a big tree like Wesley."
      },
      {
        "paragraph": "“Leave Rodney temporarily and let him go back to the Snow family.”"
      },
      {
        "paragraph": "Wesley poured a glass of wine for her and advised her, “As long as he leaves you, the Snow family will\ngive him another chance. Nathan Snow will soon ascend to the presidency. With an uncle like him"
      },
      {
        "paragraph": "backing Rodney, his future is limitless. He’s the oldest of the Snow family’s grandchildren. Sooner or\nlater, he’ll take over the Snow family. The higher a man climbs, the more he’ll miss his first love.”"
      },
      {
        "paragraph": "Sarah’s eyes brightened."
      },
      {
        "paragraph": "Wesley smiled. “ If you continue accompanying him like a fool, even if you have his child, the Snow\nfamily might not accept it. But one day when he has power, with me secretly helping him, the position of\nthe future Mrs. Snow will be none other than yours.”"
      },
      {
        "paragraph": "Sarah became excited by his words."
      },
      {
        "paragraph": "Wesley looked at her. “Sarah, you have to understand that it’s impossible for me to marry you. You\nwere with Rodney and Shaun, and the young men from influential families will fool"
      },
      {
        "paragraph": "around with you at most and it’s unlikely for them to marry you. Now, the only thing you can do is  to let\nRodney return to the Snow family.” “I got it.”"
      }
    ]
  },
  {
    "title": "Chapter 1252 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Sarah’s face turned pale from Wesley’s words. She knew that her reputation was not good, but Wesley\nwas talking about an opportunity."
      },
      {
        "paragraph": "After leaving, Wesley quickly went to the Yule family villa."
      },
      {
        "paragraph": "However, he was blocked by the guard just as he arrived at the gate. Joel immediately rushed out with\nthe security guard after learning about his arrival."
      },
      {
        "paragraph": "“Wesley, you’re just in time. I was just about to go find you. You beast, how dare you raise your hands\nagainst my daughter.” Joel was so angry that he greeted Wesley with a broom."
      },
      {
        "paragraph": "“Dad, go ahead and hit me. It was my fault for hurting Cathy.” Wesley did not dodge and kneeled on the\nground with a pained expression."
      },
      {
        "paragraph": "Wesley froze, but he immediately understood when he saw several reporters hiding nearby."
      },
      {
        "paragraph": "“Wesley, you’re insidious. If I hit you, I’ll see in tomorrow’s headlines that Joel Yule bullied you without\ndistinguishing right from wrong. I’ll also suffer a torrent of abuse, ” Joel sneered."
      },
      {
        "paragraph": "“Dad…” Wesley suddenly said in a low voice, “I came to tell you that if a person goes crazy, he can do\nanything. Shaun isn’t who he used to be. He can’t protect your elders or grandchildren, especially the\ntwo Yule family elders. You should tell Catherine to consider it carefully.”"
      },
      {
        "paragraph": "Joel’s expression changed. “You beast. How dare you use my parents to threaten me?”"
      },
      {
        "paragraph": "“Dad, persuade her. Take the evidence and let’s sit down and have a talk. She might even be able to\ndivorce me sooner, ” Wesley bowed his head to the ground and left."
      },
      {
        "paragraph": "Joel held back the urge to beat him to death and returned to the villa to tell Catherine about this."
      },
      {
        "paragraph": "“ Cathy, Wesley is a madman. He’s insane. How about… you divorce him first?” “Let me think about it,\nDad.”"
      },
      {
        "paragraph": "Catherine pretended to be annoyed and sighed."
      },
      {
        "paragraph": "Logan looked at her. When they went upstairs, he asked, “Are you just going to drop it?”"
      },
      {
        "paragraph": "“Of course not. I just lied to my dad. He’s always timid and indecisive when it comes to his family. I\ndon’t want to be threatened by Wesley. Besides, the person who’s threatening me won’t let the people\naround me go just because I compromise.”"
      },
      {
        "paragraph": "Catherine added coldly, “The more Wesley threatens me, the more he cares. Since he messed with\nme,"
      },
      {
        "paragraph": "I’ll never let him have it easy even if I  have to fight to the bitter end.”"
      },
      {
        "paragraph": "Logan looked at her admirably. “I find that you’re making me more and more impressed. If you were a\nman, I might even fall for you.”"
      },
      {
        "paragraph": "The corners of Catherine’s mouth twitched. “Don’t speak as if you’re a woman. By the way, I was\nconfused that day. I didn’t do anything to you, right? I’m afraid that Austin hates me.”"
      },
      {
        "paragraph": "Probably no one besides her knew that the two men liked each other."
      },
      {
        "paragraph": "When she saved Logan back then, Austin was also grateful to her. He did not want to leave Logan, so\nhe stayed behind to work for her too."
      },
      {
        "paragraph": "Catherine was open-minded and did not care much about these things."
      },
      {
        "paragraph": "After all, love had no gender."
      },
      {
        "paragraph": "Logan’s handsome face flushed with embarrassment. “You were… very excited that day. I f I hadn’t\ndesperately protected myself, I would have been stripped naked by you.”"
      },
      {
        "paragraph": "Catherine. “….”  Was she that crazy?"
      },
      {
        "paragraph": "“So you sent me to Shaun?”"
      },
      {
        "paragraph": "“Well… When you stripped my clothes, you kept calling Shaun’s name,” Logan said faintly."
      }
    ]
  },
  {
    "title": "Chapter 1253 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“…How is that possible?” Catherine’s eyes widened. She refused to believe she did that."
      },
      {
        "paragraph": "Logan glared at her silently as if he was saying “ How is that impossible?”."
      },
      {
        "paragraph": "“I’m sorry…”"
      },
      {
        "paragraph": "Catherine lowered her head apologetically."
      },
      {
        "paragraph": "Shaun cut off Logan’s finger, but not only did she not avenge him, but she was also still entangled with\nShaun."
      },
      {
        "paragraph": "“Forget it, I’m not that petty. It’s just a finger. You can be with whoever you want, so don’t have\nmisgivings because of me. Besides, Shaun also fell into Sarah and Wesley’s schemes.” Logan waved\nhis hand with a carefree expression."
      },
      {
        "paragraph": "That just made Catherine feel worse."
      },
      {
        "paragraph": "How could she have called Shaun’s name at that time?"
      },
      {
        "paragraph": "He could not do it anymore. What was the point of calling him?"
      },
      {
        "paragraph": "Catherine sighed in depression. Did she really get used to Shaun’s body?"
      },
      {
        "paragraph": "“By the way, cut some of Wesley’s perverted and exciting scenes and edit them with mosaic for me,”\nCatherine smiled. “Tomorrow, I’ll show the public Wesley’s true face.”"
      },
      {
        "paragraph": "8:00 a.m. the next morning. Catherine had not done anything."
      },
      {
        "paragraph": "However, her Facebook was blown up by netizens. [Didn’t you say you’ll show it to us at 8? Where is\nit?"
      },
      {
        "paragraph": "[There’s jack sh*t. I think you’re deliberately fooling us.]"
      },
      {
        "paragraph": "[Yesterday, someone even said that she had disadvantageous evidence against Wesley. I told you\nguys that it was a lie.]"
      },
      {
        "paragraph": "[I almost thought that she was really going to turn the tides. Thinking about it now, Wesley really is a\ngentleman.]"
      },
      {
        "paragraph": "Catherine looked at their heated discussion and smiled. She knew that their appetites had been\nwhetted, so it was time."
      },
      {
        "paragraph": "She posted a video and added a caption."
      },
      {
        "paragraph": "[As a matter of fact, you don’t have to reiterate that you love me. You told me before that due to your\nlove for me, you don’t touch other women and avoid immorality. However, when the lie was uncovered,\nit was repulsive. When I looked back at the man who told me he waited in silence for me, all I could see\nwas someone scheming. I didn’t want to raise a commotion initially as I only wanted to use this\nevidence to force you into a divorce, but your over-the-top affection was revolting.]"
      },
      {
        "paragraph": "Once the video was uploaded, there were hundreds of millions of views in less than one minute."
      },
      {
        "paragraph": "She had to admit that Logan’s editing skills were really good."
      },
      {
        "paragraph": "In the video, Wesley and Regina were on top of the office desk. The important parts were covered by\nmosaic, but Wesley’s face was enlarged meticulously. The bulging veins, fierce, and insatiable look\nwere completely contradicting his gentlemanly image."
      },
      {
        "paragraph": "The netizens were dumbfounded when they saw this."
      },
      {
        "paragraph": "[What did I just see? Is that Wesley?]"
      },
      {
        "paragraph": "[It’s him. I almost couldn’t recognize him. Why do I suddenly feel like he’s so hypocritical?]"
      },
      {
        "paragraph": "[That’s his office, right? He even did it in the office. How horny was he?]"
      },
      {
        "paragraph": "[Didn’t he say he had always loved Catherine? Why would he cheat on her with his secretary if he\nloved her?]"
      },
      {
        "paragraph": "[He’s deliberately flaunting his deep affections, but deep down, he’s not a good man at all. Scumbag.]"
      },
      {
        "paragraph": "[The commenter above must be a woman, right? I’m a man. I think a powerful man like Wesley was\nalready extremely benevolent to Catherine. After all, she cheated on him. Why can’t he be with another\nwoman?]"
      },
      {
        "paragraph": "[That’s right. If my wife cheated on me, I definitely won’t be faithful anymore either. Wesley isn’t good,\nbut I think that Catherine is more disgusting.]"
      }
    ]
  },
  {
    "title": "Chapter 1254 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "The netizens argued endlessly."
      },
      {
        "paragraph": "Some said that they could understand Wesley, while others continued chastizing Catherine."
      },
      {
        "paragraph": "Catherine could not care less and made another"
      },
      {
        "paragraph": "post. [There’ll be an even more exciting one at 6:00 p.m. tonight.]"
      },
      {
        "paragraph": "Once posted, she washed up and went downstairs."
      },
      {
        "paragraph": "Joel looked at her conflicted, “Cathy, you still uploaded it.”"
      },
      {
        "paragraph": "“Dad, I understand your concern,  but  I don’t want  to be led by the nose,” Catherine said bluntly."
      },
      {
        "paragraph": "Joel was silent for a moment before sighing. “Your personality is very similar to your mother’s.”"
      },
      {
        "paragraph": "Catherine paused. Truthfully, although Joel was her father, she did not like his character very much."
      },
      {
        "paragraph": "“Dad, what kind of person was my mom? I didn’t seem to have asked you much before.”"
      },
      {
        "paragraph": "Joel’s face was melancholic. “She was a… very bold person. Between us, it was she who courted me.\nShe was like a flame that could set people on fire. She always complained that I was not decisive\nenough in Nicola’s affairs. She was also very business- minded and extremely smart. I think if she was\nstill around, Hudson would have become one of the largest companies in the world. It’s a shame.”"
      },
      {
        "paragraph": "Catherine was surprised. “Was my mom that amazing? I didn’t expect you to think so highly of her.”"
      },
      {
        "paragraph": "“Of course she was. The Jones family was just a company involved with architecture and decoration,\nbut your mother founded a real estate group alone. Your mother once told me that she was very"
      },
      {
        "paragraph": "optimistic about the development  of  real estate in Australia. She said for the next twenty  years at\nleast, it would be a golden period for development, and she was right. Unfortunately, she left too soon\nand didn’t catch up with that golden age.”"
      },
      {
        "paragraph": "Joel said, “Thereafter, I secretly got people supporting Hudson, but the managers that the Jones family\nhired were incompetent. Otherwise, Hudson Corporation would have become the number one real\nestate group in the country long ago.”"
      },
      {
        "paragraph": "Catherine did not say anything for a long time. The tide in her heart rose and ebbed."
      },
      {
        "paragraph": "It turned out that her mother was so wise and intelligent."
      },
      {
        "paragraph": "As a daughter, she was proud from the bottom of her heart. It was a shame that God took her away too\nearly, and she had not found the enemy who killed her mother yet."
      },
      {
        "paragraph": "“Forget it, go to work. I’ll find someone to protect your grandparents, ” Joel waved his hand. “By the\nway, Shaun is outside. I told the guard to not let him in.”"
      },
      {
        "paragraph": "Catherine walked out."
      },
      {
        "paragraph": "Shaun stood at the door dressed in white casual trousers and a checkered shirt, looking elegant and\nnoble."
      },
      {
        "paragraph": "Behind him was a gray sports car. He looked dashing and handsome just like a prince."
      },
      {
        "paragraph": "Catherine felt that Shaun, who had experienced so many things, had become younger and more\nenergetic. His depressed look from the previous days seemed like an illusion."
      },
      {
        "paragraph": "“Cathy, I saw it. You did a great job. ” Shaun gave her a thumbs up and opened the passenger door for\nher. “You’re going to work, right? I’ll send you to the office.”"
      },
      {
        "paragraph": "Catherine sighed helplessly. “You keep accompanying me these days. Don’t you need to care about\nyour own company?”"
      },
      {
        "paragraph": "“My mom is managing it,” Shaun said righteously. “She provoked Mason, so it’s time for her to redeem\nherself. She said that she’ll let me pursue m y future wife first.”"
      },
      {
        "paragraph": "Catherine did not believe that Lea would say something like that."
      },
      {
        "paragraph": "“Come on, I’ll send you to work. I’ll pick you up after work to go to the Hill residence for dinner,” Shaun\nsaid while pushing her towards the car. “ Suzie and Lucas will flip if they don’t see you again. I\npromised them that I’ll bring you over to them in the afternoon…”"
      },
      {
        "paragraph": "Catherine glared at him unhappily."
      },
      {
        "paragraph": "Shaun shrugged, “I can’t help it since I don’t dare to bring them out now. Don’t you want to see them?”"
      }
    ]
  },
  {
    "title": "Chapter 1255 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“…Fine,” Catherine finally gave in. Her son and daughter were her beloved."
      },
      {
        "paragraph": "Shaun was very pleased. “Then I’ll tell Aunty Yasmine to buy more groceries and cook what you like.”"
      },
      {
        "paragraph": "Catherine rolled her eyes at him."
      },
      {
        "paragraph": "Did he think that she was as thick-skinned as him?"
      },
      {
        "paragraph": "They were already divorced, but she was going to the Hill family for dinner. What would others think of\nher?"
      },
      {
        "paragraph": "“Aunty Yasmine always talks about you.” Shaun ignored her glare and added enthusiastically, “She\nmisses you a lot.”"
      },
      {
        "paragraph": "Catherine’s heart warmed. At that time, Aunty Yasmine always helped her. “ She’s still around?”"
      },
      {
        "paragraph": "“Always has been. After Hill Manor was sold, many servants were dispersed, but Aunty Yasmine\nstayed. She thinks of the Hill family as her home. ” Shaun bent down to fasten her seatbelt."
      },
      {
        "paragraph": "When he saw her slightly distracted, he took the opportunity to steal a kiss from her lips."
      },
      {
        "paragraph": "“Peach-flavored lipstick, ” Shaun raised his handsome brows. His elite business appearance made it so\nthat people would find him doing such a thing completely unexpected."
      },
      {
        "paragraph": "Catherine’s cheeks could not help but burst with hot air."
      },
      {
        "paragraph": "She was already completely exasperated at this scoundrelly leech. “Hurry up and drive. I have a\nmeeting.”"
      },
      {
        "paragraph": "Shaun’s eyes brightened."
      },
      {
        "paragraph": "He thought that she would glare at him or scold him."
      },
      {
        "paragraph": "However, nothing happened. Did she get a little used to it?"
      },
      {
        "paragraph": "This could be considered… a good development, right?"
      },
      {
        "paragraph": "“Okay, I’ll be sure to get you to the office within half an hour, wife.”"
      },
      {
        "paragraph": "Shaun got into the driver’s seat happily."
      },
      {
        "paragraph": "Catherine gritted her teeth. “Shaun Hill, don’t be so shameless. I’m not your wife.”"
      },
      {
        "paragraph": "“Can you be my wife if I’m not shameless?” he retorted."
      },
      {
        "paragraph": "“In your dreams,” she sneered back."
      },
      {
        "paragraph": "Shaun smiled and shrugged. “You won’t be my wife if I’m not shameless, but if I’m shameless, I can still\ncall you my wife. In that case, I’d rather be shameless.”"
      },
      {
        "paragraph": "Catherine. “….”"
      },
      {
        "paragraph": "Forget it. She could not argue with him. She would go crazy with anger."
      },
      {
        "paragraph": "Catherine simply closed her eyes."
      },
      {
        "paragraph": "After arriving at the company, Shaun drove all the way into the parking lot."
      },
      {
        "paragraph": "Suddenly, a blue sports car sped towards them with a boom."
      },
      {
        "paragraph": "Catherine looked over and saw that it was Wesley’s sports car."
      },
      {
        "paragraph": "Shaun frowned, but he unhurriedly let the car rush at him without hiding."
      },
      {
        "paragraph": "Just as the car was about to hit him, the blue sports car suddenly braked."
      },
      {
        "paragraph": "Wesley slammed the door as he got out. His elegant face was full of rage and he strode to the\npassenger seat and opened the door. “Catherine Jones, come out. You b*tch. You’re not divorced yet\nyou’re already showing up with Shaun. You make me sick.”"
      },
      {
        "paragraph": "“Wesley, are you trying to pick a fight with me? ”"
      },
      {
        "paragraph": "Shaun got out of the car immediately and grabbed Wesley’s wrist. “Sure. Don’t you like beating people\nup? You could even beat a woman until she’s black and blue. Come on, fight me today. I want to see\nhow good you are.”"
      },
      {
        "paragraph": "“Who do you think you are, Shaun Hill? Are you worthy for me to beat up?"
      }
    ]
  },
  {
    "title": "Chapter 1256 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Wesley tried to fling him away, but Shaun’s hand was stuck to his arm, unable to be shaken off no\nmatter what."
      },
      {
        "paragraph": "Wesley’s expression changed slightly, “Shaun Hill, let go.”"
      },
      {
        "paragraph": "“You want me to let go? Sure, but show me your face. I’m going to let you go back the same way you\nhit Cathy that day.”"
      },
      {
        "paragraph": "Shaun’s eyes burst with cold anger. “Wesley, you were pretty arrogant just now. If I didn’t come today,\nwere you gonna beat her up again? Do you like slapping people that much?”"
      },
      {
        "paragraph": "Then, he slapped Wesley’s face mercilessly."
      },
      {
        "paragraph": "Wesley did not expect that he would get hit and could not react for a while. When he finally felt the\nburning pain on his face, he was furious."
      },
      {
        "paragraph": "“How dare you hit me. You’re asking to die.” He used his other hand to hit Shaun."
      },
      {
        "paragraph": "Shaun caught his hand and kneed him unexpectedly."
      },
      {
        "paragraph": "Wesley bent over in pain, and Shaun pressed him down on the car hood and slapped him again. “\nDamn it, your face is really freaking hard. It’s like pigskin. No wonder you like pretending to be\naffectionate while fooling around  with  other women behind her back. There’s no way of reaching that\nlevel unless someone has a face as thick as yours.”"
      },
      {
        "paragraph": "“Shaun Hill, I won’t forgive you,” Wesley roared like he had lost all rationality. His eyes were filled with\ngloom."
      },
      {
        "paragraph": "“Great. I wanted to say the same to you. Wesley Lyons, since you dared to hit the person I love, my\nhatred of you will never end.” Shaun slapped Wesley several times in succession."
      },
      {
        "paragraph": "Catherine watched from the side, dumbfounded. Although she was not fond of men slapping others,\nshe had to admit that Shaun’s beating was quite beautiful."
      },
      {
        "paragraph": "She finally understood that there was still a great disparity in strength between men and women."
      },
      {
        "paragraph": "Seeing how Wesley’s face was swollen, she pulled Shaun away. “That’s enough. There’s surveillance\nhere. We’ll be in the wrong if word gets out.”"
      },
      {
        "paragraph": "“That’s right. I picked a fight and I’m in the wrong,"
      },
      {
        "paragraph": "so I’ll turn myself in.”"
      },
      {
        "paragraph": "Shaun took out his phone and dialed 000, and even turned it on speakers. “Hi, is this the police? Here’s\nthe thing, I’m turning myself in. Just now, I met a lunatic who suddenly tried to crash his car against\nours. He almost crashed into us and I suffered a fright. Then, the lunatic started getting physical the\nmoment he got out of the car. He scolded my female companion, so I got angry and slapped him a few\ntimes. I felt like I did something wrong, so I took the initiative to call the police.”"
      },
      {
        "paragraph": "Catherine almost burst into laughter."
      },
      {
        "paragraph": "As expected of a lawyer. His tongue was really sharp and his words were concise. Even when reporting\nthe incident, it was simple and clear."
      },
      {
        "paragraph": "Wesley’s face went black with anger."
      },
      {
        "paragraph": "On the other end of the call, the police officer was stunned. “You did do something wrong, but it was the\nright thing to surrender yourself. I think you have a good attitude of admitting your mistakes, so just\nsettle it privately.”"
      },
      {
        "paragraph": "“Yes, yes, yes, that’s  what  I  thought  too, ”  Shaun said like a good citizen. “I can compensate him\nwith 5o,ooo. It’s more than enough to repair his face. The excess can be regarded as psychological\ncompensation.”"
      },
      {
        "paragraph": "The officer agreed. “50,000 is enough.”"
      },
      {
        "paragraph": "“I think so too, but his identity isn’t normal. I’m afraid he’ll cause trouble for me,” Shaun sighed faintly."
      },
      {
        "paragraph": "“Who is he?” The officer asked doubtfully."
      },
      {
        "paragraph": "“He said his name is Wesley Lyons. By the way, I’m Shaun Hill, ” Shaun replied politely."
      },
      {
        "paragraph": "The officer. “…”"
      },
      {
        "paragraph": "Shaun Hill? Wesley Lyons?"
      },
      {
        "paragraph": "The two men that had been making the hottest news lately?"
      },
      {
        "paragraph": "“But I’m talking about the case. I’m not lying. I can also submit the surveillance video later. I’m a law-\nabiding good citizen.”"
      },
      {
        "paragraph": "Shaun calmly hung up the phone and took out a pen from his pocket before writing a check and\nthrowing it at Wesley’s face. “You heard that, right?"
      },
      {
        "paragraph": "The officer said that 50 grand is enough.”"
      },
      {
        "paragraph": "“Just you wait, Shaun. I’ll make you regret this… ” Wesley was so angry that his body was shaking."
      },
      {
        "paragraph": "He had not been humiliated like this for a long, long time."
      },
      {
        "paragraph": "Especially by a person who was his rival in love."
      },
      {
        "paragraph": "Shaun blinked and looked at him from head to toe before pulling Catherine to the side. “Cathy, is he\nsick? Why is he shaking like that? Is he having an epilepsy?”"
      }
    ]
  },
  {
    "title": "Chapter 1257 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun’s voice was deliberately loud."
      },
      {
        "paragraph": "Catherine noticed clearly Wesley’s facial muscles twitching violently when he heard Shaun."
      },
      {
        "paragraph": "She almost shed tears from laughter."
      },
      {
        "paragraph": "To be honest, she never knew that Shaun had the potential to antagonize people like this."
      },
      {
        "paragraph": "However, seeing how angry Wesley was, she felt quite happy."
      },
      {
        "paragraph": "She did not forget how savage Wesley was a few days ago. She had never been beaten like that\nbefore."
      },
      {
        "paragraph": "“Let’s ignore him and go. When you’re up, tell the guard at the door to strengthen the security, lest a\nrandom person runs in.” Shaun pushed her into the elevator."
      },
      {
        "paragraph": "“You… be careful too.” Catherine pressed the button and saidLet me go Mr. Hill by Shallow South\nChapter 1260 hesitatingly."
      },
      {
        "paragraph": "She knew Wesley’s personality too well. He would not just forget this humiliation."
      },
      {
        "paragraph": "He could even kill Ethan, let alone Shaun."
      },
      {
        "paragraph": "“Are you concerned about me?” Shaun’s handsome face immediately overflowed with joy."
      },
      {
        "paragraph": "“ I just… don’t want you to die because of me. Also, would you die if you stop projecting your desires\non me for a day?” Catherine pushed him out in annoyance and pressed on the button for the doors to\nclose."
      },
      {
        "paragraph": "Shaun watched the elevator door closed and smiled happily."
      },
      {
        "paragraph": "Women. Their favorite thing to do was saying things they did not mean. He understood."
      },
      {
        "paragraph": "At that moment, footsteps approached behind him."
      },
      {
        "paragraph": "Shaun turned around to see Wesley’s cold eyes."
      },
      {
        "paragraph": "“Wesley, if you dare to do it again, I’ll beat you up until your teeth are scattered on the floor under the\npretense of self-defense.” Shaun narrowed his eyes and replied, “You’re no match for me at all. With\nyour impractical skills, you can only bully a woman at most.”"
      },
      {
        "paragraph": "Wesley clenched his fists subconsciously. He had originally wanted to launch a sneak attack."
      },
      {
        "paragraph": "“Although the Hill family has fallen, it’s not that easy to kill me, especially if you want to make it seem\nlike an accident or ask someone to do the"
      },
      {
        "paragraph": "dirty work for you.” Shaun’s eyes were indifferent. “ Don’t assume that I don’t know that the elevator\nincident happened because you secretly encouraged Charlie Campos.”"
      },
      {
        "paragraph": "“You have a rich imagination, ” Wesley held back the shock in his heart and retorted calmly."
      },
      {
        "paragraph": "“Wesley, if you want to kill me, you should have all the assassins in Neah Bay to come for me. Even if I\ndie, I’ll wipe them all out too. You won’t have a good ending either.”"
      },
      {
        "paragraph": "Shaun shoved his hands in his pockets and approached him step by step. “Charlie doesn’t have the\nguts to find someone to assassinate me because he knows me better than you do. He knows my skills,\nso he wanted to use Liam to frame me and put me in jail. Unfortunately, I’m a lawyer. No one knows the\nlaw better than me.”"
      },
      {
        "paragraph": "When he said his piece, Shaun got into the car and left."
      },
      {
        "paragraph": "Wesley stared at his back with ferocious eyes."
      },
      {
        "paragraph": "Shaun Hill. He thought that after Hill Corporation went downhill, killing Shaun would be as easy as\ncrushing an ant."
      },
      {
        "paragraph": "However, Wesley underestimated him time and time again."
      },
      {
        "paragraph": "No matter. Go ahead and act wildly. You won’t be able to stay wild for long."
      },
      {
        "paragraph": "In the morning, Catherine held a departmental meeting."
      },
      {
        "paragraph": "All the senior executives arrived. These days, Hudson Corporation had been boycotted and abused by\nthe public, and everyone was not having a good time."
      },
      {
        "paragraph": "“President Jones, there are people causing trouble and insulting you at more than a dozen of our sales\ncenters all over the country. Many people even said that… that they want to withdraw from the\nproperties. They probably do not believe that you’ll build good houses,” the general manager of the\nsales department said awkwardly."
      },
      {
        "paragraph": "“President Jones, we believe you. Wesley isn’t a good person. Not only is he violent towards women,\nbut he’s also simply a scumbag. Everyone saw the video this morning,” a female manager said. “I\nbelieve that Hudsons’ crisis is only temporary. ”"
      },
      {
        "paragraph": "“President Jones, we support you. We were all tricked by Wesley.”"
      },
      {
        "paragraph": "”President Jones, are you going to upload more exciting news at 6:00 p.m.? You’re not bluffing, right?”"
      }
    ]
  },
  {
    "title": "Chapter 1258 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Yeah, we’ re eager to watch how you’re going to turn things around.”"
      },
      {
        "paragraph": "“Can you tell us what you’ll be revealing this evening? We’re already not in the mood to work hard.”"
      },
      {
        "paragraph": "With all these arguments going on in the meeting room, Catherine was at a loss for words."
      },
      {
        "paragraph": "This was quite different from her expectations. She thought that these executives would, to a certain\nextent, blame her."
      },
      {
        "paragraph": "Who knew the situation would turn out to be more like a press conference that’s filled with paparazzi?"
      },
      {
        "paragraph": "She clenched her fists, coughing lightly. “Can all of you behave yourselves? We’re supposed to discuss\nmatters related to the company during the meeting instead of my private affairs.”"
      },
      {
        "paragraph": "General Manager Wolfe said with a grin, “We can’t help ourselves. Almost everyone in Australia is\ntalking about the love triangle you’re involved in."
      },
      {
        "paragraph": "Everyone’s saying that your love life can be turned into a romance movie that’s full of ups and downs.”"
      },
      {
        "paragraph": "“Exactly. A well-known writer contacted me this morning, saying that he’d like to have a brief interview\nwith you. He wants to write about your story and turn it into a novel.”"
      },
      {
        "paragraph": "“My friends who know that I work in Hudson came to me to ask about you too. They’re really curious\nabout the big news you’ll be revealing this evening.”"
      },
      {
        "paragraph": "“Same here. Everyone’s discussing this in my WhatsApp groups.”"
      },
      {
        "paragraph": "“The producers of a variety show would also like to invite you over. They said that you’re now even\nmore popular than those celebrities with huge fan bases.”"
      },
      {
        "paragraph": "“The public just wants to find out whether you’re set on being with Shaun forever.”"
      },
      {
        "paragraph": "Catherine was speechless."
      },
      {
        "paragraph": "While momentarily dazed, she wondered if she was hosting a press conference right now."
      },
      {
        "paragraph": "When in fact, it was the company’s annual general meeting."
      },
      {
        "paragraph": "“Enough. Let’s get back to business, alright?’"
      },
      {
        "paragraph": "Catherine directly stood up and raised her hand to calm everyone. “Well, if we’re still not doing well with\nthe houses, we can consider reducing the prices. Although we might earn less that way, I plan to put\ntogether some funds and have Hudson venture into the tourism industry in the future.”"
      },
      {
        "paragraph": "“Tourism industry? Sounds great.”"
      },
      {
        "paragraph": "A manager approved of her idea, saying, “ Chairwoman Jones, if you’re planning to develop the\ntourism industry, I’m sure you can attract many people’s attention considering your impressive\nreputation at this point.”"
      },
      {
        "paragraph": "“Yup. Regardless of the unfavorable news, I believe you’ll soon be able to expose Wesley’s true colors.\n”"
      },
      {
        "paragraph": "“You can attend a variety show and promote our company when the time comes.”"
      },
      {
        "paragraph": "“You can also promote it in your autobiographical romance novel.”"
      },
      {
        "paragraph": "“It’ll surely be a hit.”"
      },
      {
        "paragraph": "Catherine did not know what else to say."
      },
      {
        "paragraph": "She felt disinclined to carry on with the meeting, given that the executives in this room were completely\nseeing eye to eye with her."
      },
      {
        "paragraph": "There was nobody singing a different tune, was there?"
      },
      {
        "paragraph": "She kind of missed how those shareholders had kept turning against her back then."
      },
      {
        "paragraph": "When Catherine finally got back to her office, she was so exhausted that she felt as if she had just\nparticipated in a large press conference. “chairwoman Jones, why are you choosing to develop the\ntourism industry all of a sudden? I’ve never heard you mention it. When did you decide on it?” At last,\nGeneral Manager Wolfe raised a proper question."
      },
      {
        "paragraph": "Catherine sipped on her coffee. “I decided on it when I was on my way here.”"
      },
      {
        "paragraph": "General Manager Wolfe went quiet."
      },
      {
        "paragraph": "Catherine’s random yet determined behavior left him speechless."
      },
      {
        "paragraph": "“I always had this idea, but I just hadn’t made up my mind. This morning, I heard my dad recounting my\nmom’s past. I want to be resolute like my mom.” Catherine’s eyes narrowed. She wanted to honor\nSheryl and realize her unfulfilled ambitions."
      }
    ]
  },

  {
    "title": "Chapter 1259 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "General Manager Wolfe raised his thumb. “You’re truly brilliant and resolute. I’m sure Hudson will rise\nto international heights under your leadership. “Don’t say that.” Catherine’s face darkened.“ General\nManager Wolfe, what happened to you guys? All of you are like brown nosers now.”"
      },
      {
        "paragraph": "“No, Chairwoman Jones. You’re currently a well- known figure in Australia. Everyone knows your\nname, and the public has been paying attention to everything you do,” General Manager Wolfe replied\nwith a smile."
      },
      {
        "paragraph": "Catherine sighed, feeling mentally exhausted. “ Enough. I understand. Do keep an eye on our\ncompany’s employees because Charlie’s spy is definitely among us. When Shaun came to my office to\nlook for me last time, Charlie arrived right after him.”"
      },
      {
        "paragraph": "“Alright.” When General Manager Wolfe walked to the door, he could not help looking back with\nanticipation. “Chairwoman Jones, I’ll be waiting for"
      },
      {
        "paragraph": "your big news at six o’clock.” Catherine was speechless."
      },
      {
        "paragraph": "If she did not announce anything later, was she going to be beaten to death on the streets?”"
      },
      {
        "paragraph": "At 6:00 p.m., Catherine turned on her phone to have a look, only to find herself having more than 30\nmillion followers."
      },
      {
        "paragraph": "She shared a video of Wesley and Regina after sorting it out. Compared to the one shared earlier, this\nvideo clearly showed Wesley’s perverted character."
      },
      {
        "paragraph": "Of course, she wrote a caption as well. [Some people might call me horrible for planting a mini camera\nin my partner’s office, but you guys haven’t seen people who are more horrible than me. From the\nmoment I started living with Wesley, there have been surveillance cameras at every corner of his villa,"
      },
      {
        "paragraph": "including the living room, bedroom, dining room, and corridors. I learned this trick from him. I just\nwanted to have a better understanding of his real character. This goes to show that one can’t\nnecessarily tell whether a person is a hypocrite even after a long time.]"
      },
      {
        "paragraph": "Sure enough, it triggered a heated discussion again after the netizens saw the post."
      },
      {
        "paragraph": "[After watching the video, I don’t know what to say anymore. I used to think of Wesley as a gentleman!]"
      },
      {
        "paragraph": "[I think Wesley might’ve suppressed his feelings for too long, that’s why he turned into a pervert. Did\nyou guys see his facial expression? He looked ferocious.]"
      },
      {
        "paragraph": "[Thankfully, the video is pixelated. Otherwise, it would’ve filled me with total disgust.]"
      },
      {
        "paragraph": "[Is he really in love with Catherine? If he is, why is he fooling around with his secretary? He doesn’t\nknow his place at all.]"
      },
      {
        "paragraph": "[My God! Is this for real? Their house is full of surveillance cameras?! Did he marry his wife or is he\nkeeping an eye on a criminal?]"
      },
      {
        "paragraph": "[All of a sudden, I sympathize with Catherine. How unfortunate of her to have Wesley fall for her.]"
      },
      {
        "paragraph": "[Ah, I’d rather look at Shaun. Unlike the hypocritical Wesley, at least Shaun is openly scummy.]"
      },
      {
        "paragraph": "When Catherine was reading the netizens’ comments, Shaun called her. “Come down. I’m downstairs.”"
      },
      {
        "paragraph": "Ten minutes later, she got into Shaun’s car."
      },
      {
        "paragraph": "Shaun would turn around and look at her with a frown from time to time."
      },
      {
        "paragraph": "“Can you stay focused while driving? Otherwise, I’ll be too scared to get into your car next time,”\nCatherine reminded him in a huff."
      },
      {
        "paragraph": "Shaun promptly looked at the front of the road seriously. However, his brows had not relaxed. “Is it true\nthat Wesley’s villa is full of surveillance cameras?”"
      },
      {
        "paragraph": "“Mm.”"
      },
      {
        "paragraph": "“Could he have set one up in the bathroom as well?” Shaun suddenly asked."
      },
      {
        "paragraph": "“ .. No.” Catherine’s pretty face fell. “ Is that why you kept staring at me just now?”"
      },
      {
        "paragraph": "“Ahem. Just in case he threatens you with those photos. ” Shaun kept a somber expression. “Wesley is\nsuch a pervert. When did you become aware of it? How could you continue living with him for so long?”"
      },
      {
        "paragraph": "“ Soon after Ethan passed away.” Catherine gazed impassively out of the window."
      }
    ]
  },
  {
    "title": "Chapter 1260 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun’s eyes flashed with misery. He stretched out one hand to hold her hand and squeezed it gently."
      },
      {
        "paragraph": "“ I can take over the role of searching for evidence. I don’t want you to suffer so much.”"
      },
      {
        "paragraph": "“Can you stop… groping me?” Catherine lifted her hand that was held in his palm, her eyes looking\nhelpless."
      },
      {
        "paragraph": "“Cathy, don’t get me wrong.” Shaun blinked innocently. “I was afraid that you were cold, so I just\nwanted to warm your hand.”"
      },
      {
        "paragraph": "His shameless behavior made the corners of Catherine’s mouth twitch. “ It’s 25 degrees Celsius today.”"
      },
      {
        "paragraph": "“No, it’s freezing. If you don’t believe  me,  let’s see.” As Shaun was speaking, he turned on the air\nconditioner in his car and set it at 16 degrees Celcius."
      },
      {
        "paragraph": "Since it was a superb car, the air conditioner immediately buzzed. The cool air blew on her, nearly\ncausing her to have goosebumps."
      },
      {
        "paragraph": "Catherine completely lost to him."
      },
      {
        "paragraph": "She swiftly turned off the air conditioner before glaring at him fiercely. “Childish.”"
      },
      {
        "paragraph": "Shaun laughed, his thin lips curling into a sweet smile. There seemed to be stars shining in his deep-\nset eyes. He emanated an attractive, charming aura that could make one melt."
      },
      {
        "paragraph": "Catherine’s heart skipped a beat, and she instantly looked away."
      },
      {
        "paragraph": "Deep down, she thought, ‘Damn it. It’s all this alluring man’s doing.’"
      },
      {
        "paragraph": "It was Catherine’s first time officially stepping into the Hill household."
      },
      {
        "paragraph": "This house might not be as outstanding and luxurious as the previous Hill Manor, but the plants in this\ncourtyard were neatly trimmed. It was also filled with children’s laughter, which made it seem\nharmonious."
      },
      {
        "paragraph": "The moment Catherine got out of the car, Suzie and Lucas happily ran to her."
      },
      {
        "paragraph": "“Mommy, I miss you so much! ” The two little kids hugged her and rubbed themselves against her\narms."
      },
      {
        "paragraph": "Catherine would be swelling with joy if Shaun was not a wet blanket who went over out of the blue…"
      },
      {
        "paragraph": "“I miss you too, darlings.” Shaun wrapped his arms around the three of them from behind while resting\nhis chin on the top of Catherine’s head."
      },
      {
        "paragraph": "“Shaun, what are you doing?” He was hugging her in front of the children in the courtyard, which made\nher face flush with anger."
      },
      {
        "paragraph": "After all, they were divorced. With so many people in the Hill household, it was going to be\nembarrassing if someone spotted them like this."
      },
      {
        "paragraph": "“Didn’t you hear what I just said?” Shaun hugged the children with one hand on their backs and\nwrapped his other hand around Catherine’s waist. “ I said I miss my darlings. Why can’t I hug my\ndarlings? You’re not the only one who can do this to them.”"
      },
      {
        "paragraph": "“You can, but you’re supposed to wait until I finish hugging them first. Are you hugging them or… me?”\nCatherine warned him with a sullen, hoarse voice."
      },
      {
        "paragraph": "“I’m hugging the three of you because all of you are my darlings.” Shaun grinned and kissed Catherine\non the forehead."
      },
      {
        "paragraph": "Catherine was at a loss for words."
      },
      {
        "paragraph": "“You’re shameless.” Lucas expressed what was on Catherine’s mind. “You’re just taking advantage of\nMommy.”"
      },
      {
        "paragraph": "Suzie nodded. “Scummy dad, what happened to you? Are you still the fierce, indifferent, and silly\nscummy dad I know?”"
      },
      {
        "paragraph": "Catherine nodded as this was what she wanted to say too."
      },
      {
        "paragraph": "“You guys are overthinking things. Why would I need to take advantage of your mommy? I’ve hugged\nher from head to toe,” Shaun responded confidently."
      },
      {
        "paragraph": "Suzie and Lucas were stunned at his words. Suzie blinked. “Mommy, does it mean that you’ve gotten\nback together with scummy dad?”"
      }
    ]
  },
  {
    "title": "Chapter 1261 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine was speechless."
      },
      {
        "paragraph": "Before she could speak, Old Madam Hill’s agitated voice rang out. “What? You guys have gotten back\ntogether?”"
      },
      {
        "paragraph": "Aunty Yasmine grinned from ear to ear. “That’s great! If it weren’t for those misunderstandings, you\nguys wouldn’t have separated in the first place.”"
      },
      {
        "paragraph": "Lea sighed with mixed feelings. “That’s good. The children will be able to grow up healthily in a\ncomplete family.”"
      },
      {
        "paragraph": "Old Master Hill, who was seated in a wheelchair, gave a light cough. “Now that you guys have gotten\nback together, don’t break up so easily anymore. ”"
      },
      {
        "paragraph": "Catherine was speechless when she saw the large group of people from the Hill family behind her."
      },
      {
        "paragraph": "What made her even more speechless was when Shaun said earnestly, “I’ll definitely treat Cathy well.\nAfter all the obstacles we’ve been through,"
      },
      {
        "paragraph": "I’ve already realized my mistakes—”"
      },
      {
        "paragraph": "Before he could finish his sentence, Catherine caught him off guard by stepping on his foot forcefully."
      },
      {
        "paragraph": "“You guys have misunderstood. We haven’t made peace with each other. I’m just here to visit the kids,”\nCatherine casually explained."
      },
      {
        "paragraph": "“Yeah. We haven’t made peace with each other, but I won’t give up.” Shaun nodded while enduring the\npain. “Cathy, can you lift your foot first?”"
      },
      {
        "paragraph": "“It serves you right.” Catherine moved her lips without making a sound. Nevertheless, those who were\ndiscerning could tell what was going on."
      },
      {
        "paragraph": "“Alright. It’s fine even if you guys haven’t made peace. He deserves it.” Old Madam Hill laughed and\nsaid, “Come in and let’s eat together. These kids always talk about how much they miss you.”"
      },
      {
        "paragraph": "“Mommy, let’s go in.” Lucas and Suzie held Catherine’s hands on each side."
      },
      {
        "paragraph": "Catherine walked in."
      },
      {
        "paragraph": "In truth, she was not holding a grudge against the others in the Hill family."
      },
      {
        "paragraph": "Although she had previously gotten married to Shaun, the Hills had not agreed to their marriage at first.\nIt was only after she got pregnant that the Hills took her side. At that time, however, Shaun refused to\nlisten to his parents at all."
      },
      {
        "paragraph": "Once Catherine entered the house, she realized there were a lot of toys around."
      },
      {
        "paragraph": "She even noticed a slide on the lawn when she came in just now."
      },
      {
        "paragraph": "With the house looking this way, she could tell that the kids had been living well here. The Hill family\ntreated them well."
      },
      {
        "paragraph": "“Cathy, thanks for giving birth to these cute darling kids, ” Old Madam Hill said from the bottom of her\nheart, “They’ve brought us a lot of joy. Because of them, the two of us aren’t bored anymore.”"
      },
      {
        "paragraph": "Old Master Hill nodded. “The Hill family owed you too much previously. You’re a good person.”"
      },
      {
        "paragraph": "“Grandpa, Granny, it’s all in the past,” Catherine replied in a light-hearted manner."
      },
      {
        "paragraph": "A gentle smile spread across Lea’s face. “To you, it’s in the past. But to some people… it’s not.”"
      },
      {
        "paragraph": "She darted a thoughtful glance at Shaun who was beside her."
      },
      {
        "paragraph": "Catherine felt awkward."
      },
      {
        "paragraph": "Luckily, Lea did not explain further. She just said with a sigh, “I’ve heard about the matters between you\nguys. You’re cleverer than me. You discovered it soon enough and have evidence of Wesley’s\ncheating, unlike me…”"
      }
    ]
  },
  {
    "title": "Chapter 1262 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine had heard about Lea’s suffering."
      },
      {
        "paragraph": "She was fortunate that Ethan had tried to warn her and Tracy let her know about it. Otherwise, she\nwould have ended up in the same situation as Lea."
      },
      {
        "paragraph": "“Mommy, draw with us, okay?” Suzie ran to her with some pencils and pestered her."
      },
      {
        "paragraph": "Catherine immediately turned all her attention to the kids."
      },
      {
        "paragraph": "Due to her presence, the kids ate obediently, which was a rare occurrence."
      },
      {
        "paragraph": "After finishing their meals, the kids dragged her to play football."
      },
      {
        "paragraph": "Toward the end of the activity, Catherine was exhausted, so she just watched Shaun play with them at\nthe side."
      },
      {
        "paragraph": "Lea walked to Catherine and gazed at those figures on the lawn. With a smile, she said, “It’s been a\nwhile since these two kids were this happy. Although they call Shaun ‘scummy dad’, they’ve slowly\naccepted him. Lucas is no exception.”"
      },
      {
        "paragraph": "Catherine bit her thin lip. “Aunty Lea, what are you trying to say?”"
      },
      {
        "paragraph": "“I just hope that you’ll give Shaun a chance.”"
      },
      {
        "paragraph": "Lea added in agony, “As Shaun’s mother,  I’m largely responsible for what happened between you and\nhim. When I built another family back then, I didn’t care about him, which caused him to feel lonely and\nlack affection. Sarah appeared right when he was most miserable and helpless, so he treated her like\nthe gleam of light in his life. But just like me, he didn’t know that some people"
      },
      {
        "paragraph": "might’ve approached him with a hidden agenda.”"
      },
      {
        "paragraph": "Catherine was momentarily startled. “What do you mean?”"
      },
      {
        "paragraph": "“I found out that Sarah was admitted into the same mental hospital as Shaun one month after his\nadmission. I heard it was because she was traumatized by her mom’s death, so she voluntarily stayed\nthere for treatment. Among all the kids in the mental hospital, she happened to be interested in Shaun\nand only played with him…”"
      },
      {
        "paragraph": "Catherine was dumbfounded. “Are you saying that Sarah already knew who Shaun was back then and\ndeliberately got into that hospital to approach him?"
      },
      {
        "paragraph": "“How could this be? She was still a little kid back then…”"
      },
      {
        "paragraph": "Lea shook her head. “At that point, the Neeson family couldn’t be bothered about Sarah. Also, there\nwas Charity in the family, so she needed to search for a strong backing. Hence, she thought she should\ntry to hold onto Shaun. Even though he was mentally ill, he was still the young master of the Hill family.\nHis future was limitless. The facts today have proven that Sarah seized the chance.”"
      },
      {
        "paragraph": "Catherine went silent for a moment before she asked, “But how did Sarah find out that Shaun was in\nthat mental hospital? Shaun’s illness was kept a secret back then.”"
      },
      {
        "paragraph": "“I forgot to tell you that Sarah’s aunt worked as the office manager of the mental hospital for a year."
      },
      {
        "paragraph": "Later, she was transferred, ” Lea responded with her eyes resting on Catherine."
      },
      {
        "paragraph": "For a long time, Catherine did not utter a word. Sarah already had such thoughts when she was still so\nyoung. What a scheming person she was."
      },
      {
        "paragraph": "“Does Shaun know about it?”"
      },
      {
        "paragraph": "Lea shook her head. “No. He already hates Sarah so much. Just let it be. I don’t want him to know that\nSarah has been plotting against him for more than 20 years.”"
      },
      {
        "paragraph": "Catherine was at a loss for words."
      },
      {
        "paragraph": "If she were in Shaun’s shoes, she felt that she would erupt with rage after the truth dawned on her."
      },
      {
        "paragraph": "“If I had provided him with a complete family, he might not have been taken advantage of.” Lea\nsuddenly looked at her. “Just like Wesley and your marriage. Even though Lucas and Suzie gave you\ntheir blessings, they refused to stay there with you. They might be young, but they know that’s your\nhome, not theirs.”"
      },
      {
        "paragraph": "Somehow, Catherine’s heart clenched and her face paled a little."
      },
      {
        "paragraph": "Lea continued, “I’ve talked to Suzie. She was actually afraid that you’d be pregnant with Wesley’s"
      },
      {
        "paragraph": "child and not love her and Lucas as much as you do now. But they didn’t want to let you know about it\nfor fear that you’d be unhappy.”"
      },
      {
        "paragraph": "“Shaun isn’t a good person. Considering that he has done many wrong things, it’s only normal that he\ndoesn’t expect to get your forgiveness. Having said that, you guys already know each other well. If you\nlook for another partner in the future, can you be sure that you guys will know each other this well?\nThat other men won’t be like Wesley?”"
      },
      {
        "paragraph": "”Granny, Mommy, I just scored a goal. Did you see  it?” All of a sudden, Suzie ran to them excitedly."
      }
    ]
  },

  {
    "title": "Chapter 1263 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine nodded and praised Suzie, “I saw it. Well done, Suzie.”"
      },
      {
        "paragraph": "“Mommy, come and play with us.”"
      },
      {
        "paragraph": "Suzie dragged Catherine toward the lawn."
      },
      {
        "paragraph": "In the end, the two little kids were drenched in sweat."
      },
      {
        "paragraph": "With that, Catherine stayed there to bathe the kids."
      },
      {
        "paragraph": "Suzie and Lucas felt particularly elated, probably because it had been a long while since Catherine\nspent time with them. They played around and even had a water fight in the bathtub. Catherine was\nsoaked to the skin."
      },
      {
        "paragraph": "“Stop making noise!” Catherine kept yelling, but the kids did not listen to her."
      },
      {
        "paragraph": "Shaun came in upon hearing the noise."
      },
      {
        "paragraph": "“What’s going on? Why are you guys making so much noise?” Shaun pushed the door open, only to\nsee Suzie and Lucas playing in the bathtub."
      },
      {
        "paragraph": "Catherine stood at the side with a towel in her hand."
      },
      {
        "paragraph": "Her body and hair were all wet."
      },
      {
        "paragraph": "Coincidentally, she was wearing a bodycon dress today. Now that she was soaking wet, the dress\nclung to her curves where her undergarments could be seen."
      },
      {
        "paragraph": "After Shaun glanced at her, he could not seem to avert his eyes. There was a flame in his gaze upon\nseeing her like this."
      },
      {
        "paragraph": "He had known her for several years. When he met her three years ago, she was still young and pretty.\nAfter she gave birth to the kids, her curves looked even more wonderful and she exuded an aura of\nfemininity. Her beauty, coupled with her chubby cheeks and black hair, was a feast for the eyes."
      },
      {
        "paragraph": "“What are you looking at?” Upon noticing his burning gaze, Catherine felt her face flushing. She\nsubconsciously covered her chest with her hands and glared at him. “Get out.”"
      },
      {
        "paragraph": "Shaun’s thin lips twitched. When he was about to speak, he was suddenly splashed with water on his\nface."
      },
      {
        "paragraph": "“Watch out. ” Lucas lifted his water gun. Then, he raised his brows and looked at Shaun provocatively."
      },
      {
        "paragraph": "“You’re not allowed to stare lustfully at Mommy.”"
      },
      {
        "paragraph": "Catherine and Shaun were both awkward."
      },
      {
        "paragraph": "Shaun wiped the water off his face and said grumpily, “You know nothing, you brat. I was just amazed\nby your mommy’s beauty.”"
      },
      {
        "paragraph": "“No. Your gaze was similar to how a dog looks at a bone.” Lucas exposed him mercilessly. “My\ngodmother said that’s how a man looks at a woman lustfully.”"
      },
      {
        "paragraph": "Shaun felt embarrassed after his son retorted so abrasively."
      },
      {
        "paragraph": "Catherine chuckled and praised Lucas while touching his head, “Lucas, you’re really clever.”"
      },
      {
        "paragraph": "“Cathy…” Shaun whined, his tone filled with dissatisfaction and grievance."
      },
      {
        "paragraph": "Catherine shuddered, while Suzie teased, “Scummy dad, are you learning from me? You’re disgusting.\n”"
      },
      {
        "paragraph": "Stung by another cruel remark, Shaun was speechless."
      },
      {
        "paragraph": "His heart almost broke into pieces."
      },
      {
        "paragraph": "“Get out.” Catherine chased him out with contempt."
      },
      {
        "paragraph": "“The two of you should stop playing now. You’ve drenched your mommy, and she might catch a cold\nlike this,” Shaun reminded the kids before he left reluctantly."
      },
      {
        "paragraph": "The kids instantly went silent as they recalled their scummy dad’s pathetic gaze. Suzie kept the water\ngun with a somber look. “Mommy,  will you get back together with scummy dad?”"
      },
      {
        "paragraph": "Lucas gazed nervously at Catherine as well. “ Mommy, don’t get back together with him. When I grow\nup, I’ll protect you. All the men in this world are bad.”"
      },
      {
        "paragraph": "Suzie rolled her eyes upon hearing it. “By the time you’ve grown up, Mommy will already be old.”"
      },
      {
        "paragraph": "Lucas kept a frosty expression. “But at least it’s better than Mommy getting another boyfriend who will\nhurt her even more. Don’t  forget  that  Shaun has hurt Mommy before.”"
      },
      {
        "paragraph": "“It should be okay as long as he learns from his mistakes…” Suzie mumbled."
      }
    ]
  },
  {
    "title": "Chapter 1264 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Useless.” Lucas flicked a disdainful glance at Suzie. “Yes, scummy dad is aware of his mistakes."
      },
      {
        "paragraph": "But if Mommy hadn’t exposed Sarah’s  true colors, he would’ve married Sarah.”"
      },
      {
        "paragraph": "“Lucas, don’t you want Mommy and scummy dad to get back together?” Suzie blinked her big eyes. “"
      },
      {
        "paragraph": "After all, they’re our biological dad and mom. If they get back together, they won’t need to give birth to\nany more babies because they already have us. No one will snatch Mommy away from us.”"
      },
      {
        "paragraph": "Lucas bit his lip. Undeniably, he was a little swayed by what Suzie said, yet… He knitted his brows."
      },
      {
        "paragraph": "“ Anyway, I’ll respect Mommy’s decision. It depends on whether Mommy likes him or not.”"
      },
      {
        "paragraph": "“Fine. I agree  too.”  Suzie nodded."
      },
      {
        "paragraph": "Then, they fixed their big eyes on Catherine and repeated the earlier question, “Mommy, are you guys\ngoing to get back together?”"
      },
      {
        "paragraph": "Catherine felt speechless."
      },
      {
        "paragraph": "Well, it turned out that the kids wanted her to get back together with Shaun just because she did not\nneed to be pregnant with more babies."
      },
      {
        "paragraph": "Anyway, the kids had revealed their concern that Catherine would not love them as much if she had\nanother child in the future."
      },
      {
        "paragraph": "The kids were very insecure."
      },
      {
        "paragraph": "She sighed inwardly and whispered, “Don’t worry. I’m not planning to get married in the future. Even if I\nget into a relationship  again, I won’t get pregnant. I’ll only have the two of you as my darling children in\nmy life.”"
      },
      {
        "paragraph": "“Oh…” Suzie sounded regretful. “So does it mean that you won’t get back together with scummy dad?”"
      },
      {
        "paragraph": "“Even if we get back together… that doesn’t mean we have to get married,” Catherine said."
      },
      {
        "paragraph": "“Why? According to TV dramas, if you love someone, you should marry them, right?” Suzie said\nearnestly, “If you don’t marry him, you’re considered scummy.”"
      },
      {
        "paragraph": "“Ahem. Suzie, you’ve watched too many romance dramas.” Embarrassed, Catherine reminded her, “\nYou’re only three years old. You shouldn’t watch"
      },
      {
        "paragraph": "too much TV, alright?”"
      },
      {
        "paragraph": "Suzie completely ignored her last sentence. After some thought, she said, “Mommy, I understand. You\njust want to take liberties with scummy dad, but you don’t want to take responsibility for him, right?”"
      },
      {
        "paragraph": "Catherine was at a loss for words."
      },
      {
        "paragraph": "Lucas shot a complicated look at her. “That’s fine too. We’ll support you.”"
      },
      {
        "paragraph": "“Mommy, we don’t mind it as long as you’re happy.” Suzie shrugged."
      },
      {
        "paragraph": "“… Enough. Put on your clothes, please.” Catherine’s head hurt. She just wanted to drop this topic as\nsoon as possible."
      },
      {
        "paragraph": "Catherine finally wiped their bodies and put on their pajamas for them. After that, she walked out while\nholding their hands."
      },
      {
        "paragraph": "Shaun happened to come in with a new set of female pajamas in his hand. “Cathy, I noticed that your\nclothes are wet, so I went to get a new set of pajamas from my mom. Take a bath and get changed.”"
      },
      {
        "paragraph": "“Scummy dad, you came at the right time,” Suzie suddenly said, “ I’ve asked mommy just now. She\ndoesn’t want to get back together with you. She just wants to take liberties with you.”"
      },
      {
        "paragraph": "Catherine, who was about to blow dry the kids’ hair, did not know what to say."
      },
      {
        "paragraph": "F*ck. She wished a bolt of lightning could strike her to death."
      },
      {
        "paragraph": "When did she make such a remark?"
      },
      {
        "paragraph": "The air was filled with an awkward silence."
      },
      {
        "paragraph": "Shaun’s handsome face slightly reddened. He gazed at Catherine flirtatiously. “Cathy, it’s not good to\nsay this to the kids.”"
      },
      {
        "paragraph": "“ I didn’t. Suzie misunderstood me — ” Catherine was at her wit’s end."
      },
      {
        "paragraph": "“Okay, Cathy. Go and take a bath. I’ll blow dry their hair,” Shaun interrupted her."
      },
      {
        "paragraph": "Catherine immediately took the pajamas and scurried into the bathroom. She was afraid that her\ndaughter would slander her further if they continued chatting."
      }
    ]
  },
  {
    "title": "Chapter 1265 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Once Catherine stepped into the bathroom, Shaun asked the kids with a somber face and a gruff voice,\n“What did your mommy actually tell you guys?”"
      },
      {
        "paragraph": "Catherine refused to get back together with him but wanted to take liberties with him?"
      },
      {
        "paragraph": "This stressed him out."
      },
      {
        "paragraph": "After all, he had not fully recovered just yet."
      },
      {
        "paragraph": "Lucas glanced at his eager gaze. “We won’t tell you. It’s a secret.”"
      },
      {
        "paragraph": "“Yeah. It’s a secret.” Suzie nodded. “What’s more, I just told you.”"
      },
      {
        "paragraph": "“I’m sure that’s not all.” Shaun took out two pieces of chocolate from his pocket. “If you tell me, this will\nbe your reward.”"
      },
      {
        "paragraph": "“You can give me both pieces since Lucas wants to keep it a secret. Let me tell you.” Suzie swiftly\ngrabbed the two pieces of chocolate for fear that Lucas would take the other piece away."
      },
      {
        "paragraph": "Lucas was speechless."
      },
      {
        "paragraph": "Who was the one who claimed that it was a secret right after him? In the blink of an eye, she betrayed\nLucas because of chocolate."
      },
      {
        "paragraph": "Why did he have such an unbridled sister?"
      },
      {
        "paragraph": "Suzie tore the chocolate wrapper. While chomping on the chocolate, she said, “Mommy said that she’s\nnot planning to get married again even if she gets back together with you. She doesn’t mind if you"
      },
      {
        "paragraph": "take liberties with her. As for marriage, you can forget it.”"
      },
      {
        "paragraph": "“Seriously?” Shaun was dazed."
      },
      {
        "paragraph": "He could not tell if he was surprised, delighted, excited, or gloomy."
      },
      {
        "paragraph": "Regardless, this showed that Catherine was more accepting of him than before. In this case, there was\na likelihood that he could get back together with her."
      },
      {
        "paragraph": "Shaun’s eyes shone as he seemed to see a glimmer of hope."
      },
      {
        "paragraph": "He never expected that Catherine would have such thoughts about him. She wanted to take liberties\nwith him…"
      },
      {
        "paragraph": "Ahem. How could he possibly say this to the kids?"
      },
      {
        "paragraph": "“Of course.” Suzie nodded and waved her hand. “Go ahead and pursue Mommy. But she said that\nshe’s not planning to give birth anymore. You get it, don’t you?”"
      },
      {
        "paragraph": "“Yup, yup.” Shaun glanced at Suzie approvingly. “ Suzie, you’re awesome.”"
      },
      {
        "paragraph": "“Your chocolate is awesome too. It’s yummy. You can bribe me with this again next time.” Suzie happily\ntore the wrapper of the second piece of chocolate."
      },
      {
        "paragraph": "Watching Shaun and Suzie at the side, Lucas was completely at a loss for words."
      },
      {
        "paragraph": "He was absolutely amazed by Suzie’s mouth. When did Mommy say that she allowed their scummy\ndad to take liberties with her?"
      },
      {
        "paragraph": "Fine. He could not be bothered about it."
      },
      {
        "paragraph": "When Mommy came to deal with Suzie, he was not going to save her."
      },
      {
        "paragraph": "In the bathroom."
      },
      {
        "paragraph": "Catherine came out after her shower, only to realize that her undergarments were drenched as well."
      },
      {
        "paragraph": "Since the hairdryer in the bathroom had been given"
      },
      {
        "paragraph": "to the kids to blow dry their hair, she had no choice but to leave a small gap in the door. She shouted\nwith a deep voice, “Suzie…”"
      },
      {
        "paragraph": "“Suzie and Lucas are downstairs.” Shaun’s tall figure came over. His eyes settled on her shoulder,\nwhich was partly visible behind the door. “What’s wrong?”"
      }
    ]
  },
  {
    "title": "Chapter 1266 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“… Pass me the hairdryer.” Catherine felt awkward when Shaun gazed at her. With that, she\nsubconsciously made the gap at the door smaller."
      },
      {
        "paragraph": "“What are you trying to hide? Didn’t I bathe you a few days ago? I’ve seen every part of you.” Shaun’s\neyes darkened, and he raised his brows. “Why do you need a hairdryer? Didn’t I just pass you clean\nclothes?”"
      },
      {
        "paragraph": "He even got her new panties."
      },
      {
        "paragraph": "“None of your business.” Catherine glowered at him grumpily. “Are you getting the hairdryer for me?”"
      },
      {
        "paragraph": "“Yes. Since my wife requested it, I’ll surely obey.” Shaun promptly passed her the hairdryer with a grin."
      },
      {
        "paragraph": "After Catherine took it, she slammed the door shut."
      },
      {
        "paragraph": "Despite spending a long time drying her undergarments using the hairdryer, she realized that it was too\nwet to dry completely."
      },
      {
        "paragraph": "Ultimately, she had no choice but to blow dry her hair before she walked out. Due to Shaun’s presence,\nshe awkwardly covered her chest with her dirtied clothes."
      },
      {
        "paragraph": "After throwing her a glance, Shaun soon grasped the situation. He laughed and said, “We’re already\nvery close. Why are you so shy?”"
      },
      {
        "paragraph": "“ .. I’m not as shameless as you! ” Catherine told him off gloomily, “Help me get a coat from your mom.\nI can’t possibly go home like this.”"
      },
      {
        "paragraph": "Even if she could leave like this without the Hill family realizing it, Joel and the servants were in the\nYule family’s house. It was really inappropriate for her to look like this."
      },
      {
        "paragraph": "“Since it’s already so late, just stay here tonight and accompany Suzie and Lucas to sleep. If you eave,\nthey’ll be unhappy.” Shaun reached out to"
      },
      {
        "paragraph": "her. “Let’s sleep here. I’ll dry your clothes for you.”"
      },
      {
        "paragraph": "“No way. It’s inappropriate for me to stay here,” Catherine said furiously, “I haven’t divorced Wesley."
      },
      {
        "paragraph": "Plus, this is the Hills’ household. Your grandparents are here. How can I possibly stay here?”"
      },
      {
        "paragraph": "Shaun smiled vaguely. “No one believes that nothing is going on between us anyway. Don’t forget that\nyou kissed me in a domineering manner in front of the reporters the day you were discharged. As the\neldest young lady of the Jones family, do you even care about what others think? What’s more, even if\nothers find out about it, so what? All kinds of nasty remarks have been posted o n the internet anyway.”"
      },
      {
        "paragraph": "Catherine knitted her brows together. Even though what he said made sense. “But…”"
      },
      {
        "paragraph": "“No buts. If you leave tonight, Suzie, that little girl, will definitely cry. Furthermore, you’re their mom. You\ncan’ t abandon them and leave them to me, ” Shaun interrupted her bluntly."
      },
      {
        "paragraph": "Catherine’s spirits sank. “How am I abandoning them?”"
      },
      {
        "paragraph": "“Well, how long haven’t you eaten with them? How long haven’t you told them bedtime stories? How\nlong haven’t you accompanied them to sleep?” Shaun asked."
      },
      {
        "paragraph": "Catherine went silent in an instant, and her face felt hot."
      },
      {
        "paragraph": "Shaun looked grave. “Cathy, I’ve long since wanted to tell you something. You said you want to risk\nstaying by Wesley’s side in order to find out the cause of Ethan’s death. But have you thought about"
      },
      {
        "paragraph": "how Wesley will treat you if he finds out the truth? Did you take the two kids into consideration? Are\nyou under the impression that since they’ve acknowledged me as their dad, there’s nothing to worry\nabout because they’ll have someone to look after them even after you’re gone?”"
      },
      {
        "paragraph": "Catherine bit her lip in spite of herself. Admittedly, it was because of Shaun that she could do\neverything without worries and even risk her life."
      },
      {
        "paragraph": "“Sure enough…”"
      },
      {
        "paragraph": "At the sight of her expression, Shaun knew what it meant. “Cathy, you think too highly of me. If you’re\nnot around one day or something happens to you, will I be in the mood to take care of the kids after\nlosing my beloved?”"
      },
      {
        "paragraph": "“Shaun, weren’t you very glad to have kids previously? Now that you have these kids, you should\ncherish them and fulfill your duty as a father, ” Catherine said helplessly."
      },
      {
        "paragraph": "“ I’m glad to have these kids only because you’re the one who gave birth to them.”"
      },
      {
        "paragraph": "Shaun said sternly, “I love them because of you. If you’re gone, I’ll probably drown my sorrows every\nday and lead my life in a daze. I won’t even want to get sober, much less make money to raise the kids.\n”"
      },
      {
        "paragraph": "“You…”"
      },
      {
        "paragraph": "His words made Catherine’s blood boil. At the same time, she was beside herself. There was a feeling\nthat could not be explained."
      },
      {
        "paragraph": "“Cathy, I just want to remind you that you can investigate the truth. But the bottom line is that you need\nto treasure your life.” With a serious expression, Shaun added, “Although you’re responsible for Ethan’s\ndeath, you don’t have to shoulder all of the responsibility. After all, Ethan was the one who failed to see"
      },
      {
        "paragraph": "through the devil and worked for him. By the way, how dare you make Ethan’s death your top priority. If\nSuzie and Lucas find out, they’ll be very upset.”"
      }
    ]
  },

  {
    "title": "Chapter 1267 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Knock it off. I’ll place my highest priority on the kids in the future. Don’t worry, I’m just leaving the kids\nwith you for the time being. I’ll take them back after Wesley is sent to jail.”"
      },
      {
        "paragraph": "Shaun’s words made Catherine feel increasingly ashamed."
      },
      {
        "paragraph": "She felt that she had been a scummy mother these days."
      },
      {
        "paragraph": "“That’s good.” Shaun nodded. After pausing for an instant, he added gravely, “Don’t forget to bring me\nwith you too.”"
      },
      {
        "paragraph": "Speechless, Catherine glared at him."
      },
      {
        "paragraph": "“Pass me my clothes.” Shaun directly took her clothes away."
      },
      {
        "paragraph": "By the time Catherine came to her senses, she recalled that her undergarments were also in his hands."
      },
      {
        "paragraph": "Her cheeks flushed, and she promptly replied, “It’s fine. I’ll dry them.”"
      },
      {
        "paragraph": "“No way. With your current state, you’d better not head out. ” Shaun glanced at her chest flirtatiously."
      },
      {
        "paragraph": "Catherine froze right away."
      },
      {
        "paragraph": "When Suzie and Lucas learned that Catherine would be spending the night here, they were overjoyed."
      },
      {
        "paragraph": "She told the kids some stories and coaxed them to sleep. After that, she lay down and took a rest."
      },
      {
        "paragraph": "Although she was unfamiliar with this environment, she soon felt sleepy. She could smell the kids’ milky\nscent."
      },
      {
        "paragraph": "Amid her deep sleep, there seemed to be a dip in the mattress. Subsequently, she was wrapped in a\nwarm embrace from behind."
      },
      {
        "paragraph": "When Catherine turned around drowsily, her arm ended up snaking around a man’s waist."
      },
      {
        "paragraph": "Suddenly, she opened her eyes."
      },
      {
        "paragraph": "Under the moonlight that poured in from the window, Shaun’s deep-set eyes were fixed on her. His\ngaze was filled with affection and an unknown glint."
      },
      {
        "paragraph": "“Cathy…” The word came out of his elegant, thin lips softly."
      },
      {
        "paragraph": "Catherine’s sleepiness instantly vanished. If she had not considered the two kids who were sleeping\nsoundly beside her, she would have certainly leaped out of bed and kicked him in the crotch."
      },
      {
        "paragraph": "However, she could only try her best to control her emotions at this point. She kept her voice low and\nasked with her teeth clenched, “Who gave you the permission to sleep here?”"
      },
      {
        "paragraph": "“Didn’t you say that you’re willing to get back together with me?” Shaun’s luscious lashes fluttered\ninnocently."
      },
      {
        "paragraph": "Catherine zoned out at the sight of his fluttering lashes."
      },
      {
        "paragraph": "To her surprise, this man’s lashes were longer and more luscious than hers."
      },
      {
        "paragraph": "As his luscious lashes got closer to her, so did the man’s breath."
      },
      {
        "paragraph": "Seeing that he was about to kiss her, Catherine covered his mouth at once. She gnashed her teeth and\nasked, “Who agreed to get back together with you?”"
      },
      {
        "paragraph": "Shaun did not utter a word. He stared affectionately at her while holding her slim waist."
      },
      {
        "paragraph": "“Shaun…” Catherine kicked him in exasperation."
      },
      {
        "paragraph": "The noise on the bed made Suzie flip her body. Her hand then landed on Catherine’s arm."
      },
      {
        "paragraph": "At that moment, Catherine did not dare move around for fear that Suzie would be awake."
      },
      {
        "paragraph": "Shaun moved her hand away and whispered, “How can I speak if you’re covering my mouth? Cathy,\nyou’re not planning to remarry me, right? I understand that marriage has left a traumatic experience for\nyou, so I won’t force you. Let’s get back together first. We can slowly build our relationship. No matter\nhow many years it’ll take to build our relationship, I’ll always be here for you. We’ll only get married\nwhen you feel like it. You can take liberties with me if you wish. I won’t mind.”"
      },
      {
        "paragraph": "Catherine was frustrated with his behavior, yet she could not raise her voice. She had no choice but to\ntell him off in a whisper, “Suzie  is still immature yet you actually believed in her words? Who wants to\ntake liberties with you? Get lost.”"
      },
      {
        "paragraph": "“I’m not going to get lost.” Shaun continued to hug her slim waist stubbornly."
      },
      {
        "paragraph": "“Get lost.”"
      },
      {
        "paragraph": "“No.”"
      },
      {
        "paragraph": "He even pushed his luck by lowering his head and locking lips with her."
      },
      {
        "paragraph": "His shameless behavior angered Catherine."
      },
      {
        "paragraph": "Her eyes wandered a little before she suddenly extended her hand and gripped Shaun’s neck."
      },
      {
        "paragraph": "Shaun shuddered and became so excited that his heartbeat immediately quickened. Then, he\nmuttered, “Cathy, my darling…”"
      }
    ]
  },
  {
    "title": "Chapter 1268 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Stop talking.” Catherine lifted her head and kissed him back."
      },
      {
        "paragraph": "Shaun felt like a young man again and shuddered."
      },
      {
        "paragraph": "It felt as though he had eaten something sweet, like honey."
      },
      {
        "paragraph": "Barn! All of a sudden, he was ruthlessly kicked to the carpet."
      },
      {
        "paragraph": "“Mommy, what was that noise?” Lucas woke up with a start, while Suzie continued sleeping like a baby."
      },
      {
        "paragraph": "“Nothing. I flung some trash onto the floor just now. You can continue sleeping.” Catherine touched\nLucas gently."
      },
      {
        "paragraph": "Lucas vaguely uttered, “Mhm.” He then fell asleep again."
      },
      {
        "paragraph": "With a sulky expression, Shaun got up while feeling annoyed and glowered at Catherine. “Am I trash?”"
      },
      {
        "paragraph": "“It serves you right. You refused to budge even after I told you to get lost, ” Catherine said in a self-\nrighteous manner."
      },
      {
        "paragraph": "Shaun continued to look at her fixedly. Dressed in silk pajamas, she was unaware that she had\nrevealed a large part of her fair flesh below her collarbone as she was sleeping on her side."
      },
      {
        "paragraph": "His Adam’s apple bobbed. He was set on staying here tonight even if he were to die."
      },
      {
        "paragraph": "“Cathy, I just can’t bring myself to leave you, ” Shaun grumbled, “Stop giving me a hard time, okay?”"
      },
      {
        "paragraph": "“Are you planning to leave?” Catherine asked."
      },
      {
        "paragraph": "“No, I’m not.” Shaun shook his head. “Wherever you sleep, I’ll sleep there.”"
      },
      {
        "paragraph": "“… Suit yourself, but don’t think about getting onto the bed. You can sleep on the floor,” Catherine\nreplied coldly."
      },
      {
        "paragraph": "“Okay. I don’t mind as long as we’re sleeping in the same bedroom.” With that, Shaun lay on the floor."
      },
      {
        "paragraph": "To Catherine, he was a real pain in the neck."
      },
      {
        "paragraph": "With fall drawing nearer, he might easily catch a cold if he were to lie on the floor at night without a\nblanket, though it was scorching hot during the day."
      },
      {
        "paragraph": "“Cathy, you can sleep. Don’t worry about me. I’m strong, so I won’t catch a cold.” Shaun grinned at her."
      },
      {
        "paragraph": "Catherine promptly bit her tongue. “You’re overthinking. I can’ t be bothered about you. Suit yourself.”"
      },
      {
        "paragraph": "Once she finished speaking, she tucked herself into bed and ignored him."
      },
      {
        "paragraph": "After dealing with the fuss, she was incredibly sleepy."
      },
      {
        "paragraph": "Shortly after, she fell asleep again."
      },
      {
        "paragraph": "The next day, Catherine woke up to Suzie’s yell. “ Scummy dad, why are you sleeping on the floor?"
      },
      {
        "paragraph": "You look so miserable. When did you come in? Why didn’t you sleep on your bed?”"
      },
      {
        "paragraph": "“I didn’t want to sleep alone.” Shaun sat up and shuddered."
      },
      {
        "paragraph": "He did not expect last night to be so cold."
      },
      {
        "paragraph": "Lucas said mercilessly, “How childish of you. You’re not a kid! ”"
      },
      {
        "paragraph": "Shaun did not take his remark to heart.  “Lucas, you’ll understand it in the future. A man in love is a\nkid.”"
      },
      {
        "paragraph": "Suzie belched. “How disgusting he is, Mommy.”"
      },
      {
        "paragraph": "“Yes, he’s pretty disgusting. ” Catherine nodded in agreement."
      },
      {
        "paragraph": "Shaun rose to his feet, feeling aggrieved. When he was about to speak, his nose suddenly itched and\nhe sneezed twice in a row."
      },
      {
        "paragraph": "“Scummy dad, are you having a cold? Suzie asked sympathetically."
      },
      {
        "paragraph": "“Don’t infect the kids.” Catherine merely thought he was being dramatic."
      },
      {
        "paragraph": "“Alright. I’ll get out right now.” Shaun was stung by her warning."
      },
      {
        "paragraph": "While covering his nose, he walked out the door and happened to bump into Lea."
      },
      {
        "paragraph": "Lea darted a teasing glance at him. “Good job! You managed to sleep in there so soon.”"
      },
      {
        "paragraph": "Shaun laughed at how Lea thought  so highly of him. In fact, he had spent the night sleeping on the\nfloor."
      }
    ]
  },
  {
    "title": "Chapter 1269 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "When everyone was having breakfast together in the morning, Catherine was slightly embarrassed."
      },
      {
        "paragraph": "Despite being aware that she had spent the night, no one talked about it."
      },
      {
        "paragraph": "When Shaun was eating oatmeal, he would sneeze and cough from time to time."
      },
      {
        "paragraph": "Old Madam Hill said disdainfully, “Take your bowl and eat over there. Don’t infect old people like us and\nthe kids.”"
      },
      {
        "paragraph": "After looking at everyone’s expression that indicated approval of Old Madam Hill’s suggestion, Shaun\nfelt extremely upset."
      },
      {
        "paragraph": "It turned out that he was so insignificant in this house."
      },
      {
        "paragraph": "Everyone held him in contempt simply because of his cold."
      },
      {
        "paragraph": "Anyway, he ended up eating alone in the living room for the sake of the kids."
      },
      {
        "paragraph": "When he turned around, he heard Old Madam Hill grumble, “He’s already so weak even though he’s\nyoung. Aunty Yasmine, prepare some pomegranate juice for him tonight.”"
      },
      {
        "paragraph": "Shaun nearly choked on the porridge that he was about to swallow."
      },
      {
        "paragraph": "Now that he had caught a cold, he thought it was not a good idea for him to drink pomegranate juice."
      },
      {
        "paragraph": "Also, why pomegranate juice? He somehow felt that his grandmother had misunderstood him."
      },
      {
        "paragraph": "Catherine was utterly embarrassed, but all she could do was act calm."
      },
      {
        "paragraph": "Unexpectedly, Suzie chimed in, “Great-grandma, I want to drink it too.”"
      },
      {
        "paragraph": "“That isn’t meant for kids, ” Old Madam Hill said, “ It’s for adults to improve their health.”"
      },
      {
        "paragraph": "“Oh, I didn’t know scummy dad is so weak.” Suzie despised Shaun as well."
      },
      {
        "paragraph": "When Catherine finally finished her breakfast, she bid goodbye to the kids and left at once."
      },
      {
        "paragraph": "Since she did not drive here, Shaun sent her home."
      },
      {
        "paragraph": "When the car drove off, she saw the two darling kids standing still. Suzie even pouted and teared up."
      },
      {
        "paragraph": "Her heart clenched with pain all of a sudden."
      },
      {
        "paragraph": "If it were not for Wesley, the kids would not be hiding here without attending kindergarten."
      },
      {
        "paragraph": "If it were not for Wesley, Catherine would not have placed her kids here and neglected them."
      },
      {
        "paragraph": "For the first time, she hated Wesley so much."
      },
      {
        "paragraph": "She also hated herself to the core, wondering why she ever met him and got involved with him."
      },
      {
        "paragraph": "Was it because she had done something evil in her last life?"
      },
      {
        "paragraph": "“Cathy, you can always come and visit the kids whenever you miss them.” Shaun spotted the sorrowful\nlook in the depths of her eyes. “You can move in as well. My family will always welcome you.”"
      },
      {
        "paragraph": "Catherine shot a distressed look at him. “Of course, you’d wish I’d move in so that you could pester me\nevery night.”"
      },
      {
        "paragraph": "“Cathy, I just want the four of us to stay together. What’s more, the kids really miss you.” Shaun\nshrugged, looking innocent. “I understand your feelings. You’re more inclined to come over if I’m the\nonly one staying with the kids. But I need to work during the day, and the kids feel bored at"
      },
      {
        "paragraph": "home. With the company of my grandparents, both my grandparents and the kids will be happier.”"
      },
      {
        "paragraph": "“I didn’t even complain about it…” Catherine lowered her head."
      },
      {
        "paragraph": "Shaun’s eyes flashed with a hint of gentleness. He wore a mask for the rest of the journey. He\noccasionally coughed while he spoke."
      }
    ]
  },
  {
    "title": "Chapter 1270 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Chapter 1273"
      },
      {
        "paragraph": "When Shaun’s car arrived at Hudson’s parking lot, Catherine unfastened the seat belt to get out."
      },
      {
        "paragraph": "“Wait a minute…”  Shaun suddenly  handed her a file. “I asked Chester to investigate the hospital in\nMelbourne where Wesley went for treatment after he got stabbed when he saved you three years ago.\nIt turns out that he bribed the medical staff who was in charge of treating him in the emergency room.\nHe asked them to lie to you.”"
      },
      {
        "paragraph": "Catherine took over the file in a daze. “What… did they lie to me about?”"
      },
      {
        "paragraph": "“They lied to you saying that Wesley’s kidney was hurt and had to be removed.” Shaun stared intently\nat her. “In truth, his kidney wasn’t injured because he wasn’t even stabbed in the kidney at that time."
      },
      {
        "paragraph": "He deliberately lied to you to make you guilty and sympathize with him.”"
      },
      {
        "paragraph": "Catherine went silent, her lashes fluttering. The news did not come as a big shock."
      },
      {
        "paragraph": "Now that Wesley’s true colors had been exposed, more of his disgusting deeds had yet to be revealed."
      },
      {
        "paragraph": "In fact, she should have anticipated this earlier."
      },
      {
        "paragraph": "A person did not become bad in one or two days."
      },
      {
        "paragraph": "She could not have possibly been the one who made him a cruel pervert."
      },
      {
        "paragraph": "It was simply in his nature to be despicable."
      },
      {
        "paragraph": "However, he had been hiding his true colors too well since she met him."
      },
      {
        "paragraph": "Chapter 1273"
      },
      {
        "paragraph": "“The file contains the CT scan from when he underwent surgery after the incident three years ago. He\nstill has two kidneys. There are also records showing that he transferred money to those medical staff.\nEven after coming to Canberra, he would go to the hospital every month for a regular medical check-up\nto avoid getting suspected by you. He has also bribed the doctor who performs the check-ups on him.\nThe medication he usually takes for his kidney is fake. There’s a record of his check-up half a year ago\ninside.”"
      },
      {
        "paragraph": "“You did such a thorough investigation, huh?” Catherine was astonished."
      },
      {
        "paragraph": "“Yeah. Any ordinary person won’t be able to find out about it, considering that Wesley’s company deals\nwith pharmaceuticals. It’s all too easy for him"
      },
      {
        "paragraph": "to bribe people because a lot of medical staff are too afraid to offend him. Even so, the Jewell family\noccupies half of the medical industry. As long as Chester is the one investigating it, there won’t be any\nissues.”"
      },
      {
        "paragraph": "Shaun continued, “Although you have evidence of Wesley cheating on you, I suspect he’ll bring up\nlosing a kidney because of you. In that case, he’ll have an edge over you.”"
      },
      {
        "paragraph": "“Help me thank Chester,” Catherine lifted her head and said gratefully."
      },
      {
        "paragraph": "“Just Chester?” Shaun raised his brows and approached her enthusiastically. “Aren’t you supposed to\nthank me? If it weren’t for me, Chester wouldn’t have helped you.”"
      },
      {
        "paragraph": "“ So how do you want me to thank you?” Catherine stared at the lower half of his face that was covered\nwith the mask."
      },
      {
        "paragraph": "“You may… Ahem, ahem.” Before Shaun could finish his sentence, he began coughing uncontrollably\nuntil his chest was sore."
      },
      {
        "paragraph": "Catherine rolled her eyes. “Are you still not  going to behave yourself now that you have a cold?”"
      },
      {
        "paragraph": "Shaun was extremely gloomy. Initially, he wanted  to jump at the opportunity to ask for a kiss, yet he"
      },
      {
        "paragraph": "did not expect himself to catch a cold. Nevertheless, he did not want her to be infected. “Cathy, can you\nkiss me after I recover from my cold then?”"
      },
      {
        "paragraph": "“When did I agree to give you a kiss to thank you for your help?” A perplexed look washed over\nCatherine’s face."
      },
      {
        "paragraph": "“… But all I want is a kiss, ” Shaun added shamelessly."
      },
      {
        "paragraph": "Catherine asked. She suddenly approached him and touched his Adam’s apple flirtatiously."
      },
      {
        "paragraph": "Shaun’s Adam’s apple bobbed violently, while his burning eyes were fixed on her beautiful face. “\nCathy, don’t do this…”"
      },
      {
        "paragraph": "“You can’t even handle this, huh?” Catherine laughed like a sly fox. “Since you had the thought of\nhelping me, you shouldn’t be expecting me to return the favor, much less give you a kiss. If you want a\nkiss, you can press your upper and lower lips together. There’s your kiss.”"
      },
      {
        "paragraph": "As soon as she finished speaking, she noticed that his face had darkened. That was when she turned\naround and left with a smile."
      },
      {
        "paragraph": "Shaun just watched as the seductive vixen swaggered off."
      },
      {
        "paragraph": "He forcefully tugged on his tie. After that, he gave Chester a call in annoyance. “Have you contacted\nthe andrologist that you said you had booked for me? I want to see him and have my illness cured as\nsoon as possible.”"
      },
      {
        "paragraph": "“Why do you want to get it cured so soon?” Chester said lazily, “It’s not as if you can do it once you\nrecover.”"
      },
      {
        "paragraph": "“Who says I can’t do it?” Shaun was dissatisfied. “ Perhaps I can already do it tomorrow.”"
      },
      {
        "paragraph": "“Ha! My guess is that it’s only possible after one and a half years, at least, ” Chester responded firmly."
      }
    ]
  },



  {
    "title": "Chapter 1271 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Chester continued to mock Shaun, “You should be grateful that I didn’t say you can never do it again. ”"
      },
      {
        "paragraph": "“Shut  up.” Shaun could no longer put up with him."
      },
      {
        "paragraph": "“Fine. Rodney asked me out tonight and I’ve agreed to meet him. Do you want to come along? Are you\nreally not planning to see him anymore?” Chester suggested."
      },
      {
        "paragraph": "“I don’t want to hear that d*ckhead speak,” Shaun said indifferently,  “I’m afraid I’ll beat him to death.”"
      },
      {
        "paragraph": "“Rodney is quite pathetic now. Since getting kicked out of the Snow family, his fair-weather friends\nrarely talk to him now. I wonder what has been keeping Sarah occupied every day, making him come to\nmy place so often…” Chester could not help but sigh."
      },
      {
        "paragraph": "“Without the Snow family’s glory, do you think Sarah will continue her relationship with him? She\ndoesn’t even care about the poor Osher"
      },
      {
        "paragraph": "Corporation. This woman is greedy. Just wait and see. She might’ve already cuckolded Rodney a few\ntimes.” Shaun looked sarcastic."
      },
      {
        "paragraph": "“That’s not a bad thing. At least he’ll see her true colors, and the three of us can make peace again.”\nChester said jokingly, “You used to behave like Rodney, right? Just like you, he’ll see through Sarah\nsooner or later. Don’t keep blaming him. You went through this yourself, but you’re calling him a d*\nckhead when he’s following in your footsteps.”"
      },
      {
        "paragraph": "“Well, I used to be a d*ckhead too. But that doesn’t mean I can’t criticize him, right? Anyway, I won’t\ntalk to him if he’s still involved with Sarah.”"
      },
      {
        "paragraph": "Shaun hung up mercilessly as soon as he finished his sentence."
      },
      {
        "paragraph": "In the office."
      },
      {
        "paragraph": "Catherine flipped open the file that Shaun gave her and went through the documents thoroughly."
      },
      {
        "paragraph": "Shortly after, Harvey knocked on the door and came in. “Chairwoman Jones, Wesley Lyons from"
      },
      {
        "paragraph": "Golden Corporation is holding a press conference. It’s now being live-streamed.”"
      },
      {
        "paragraph": "“Let me watch it. ” Catherine went over to watch. Wesley was seen bowing and apologizing for his\nmistakes in the live stream. This man even choked up with reddened eyes while showing remorse."
      },
      {
        "paragraph": "“ I’m sorry for showing the public and society such a negative side of me.”"
      },
      {
        "paragraph": "A reporter said, “You didn’t wrong us, but you’ve wronged your wife. You claimed that she had an affair\nwith Shaun, yet you’ve been fooling around with your secretary every day and acting like a pervert.\nWhat’s worse, you even beat your wife up. Don’t you find yourself terrifying?”"
      },
      {
        "paragraph": "“I didn’t mean to behave like that.” Wesley suddenly covered his eyes and teared up."
      },
      {
        "paragraph": "At this moment, Sonya came out of nowhere and told the reporter off hysterically, “Why are you guys\ncriticizing him when he’s the victim?"
      },
      {
        "paragraph": "Catherine is an indecent mistress. Three years ago, my brother shielded her and was stabbed in order\nto save her. In the end, he lost a kidney. He loved her so much that he was willing to risk his life, only to\nbe pushed under the bus by her. Are you guys heartless?”"
      },
      {
        "paragraph": "The reporters were astonished. “Was there such an incident?”"
      },
      {
        "paragraph": "Sonya thundered, “Of course! Ever since he lost a kidney, he has been very weak. Catherine’s affairs\nhave also put him under a lot of stress. There’s no"
      },
      {
        "paragraph": "way he can vent his frustration. Also, his secretary likes him and has always been seducing him. That’s\nwhy things turned out this way.”"
      },
      {
        "paragraph": "After pausing for a moment, Sonya burst into tears. “My son’s death was also caused by Catherine,\nthat wicked woman. My son, Ethan, was her ex- boyfriend. She still contacted my son frequently even\nafter she married Wesley. My son went to look for her the other day and on his way to meet her, he got\ninto an accident and passed away."
      },
      {
        "paragraph": "“Catherine, you’ll be cursed with a horrible death sooner or later. Karma will get you for making the\nLyons family suffer so much."
      },
      {
        "paragraph": "“I pity my daughter-in-law who’s still pregnant.”"
      },
      {
        "paragraph": "Catherine saw a lot of criticisms on the screen. [I’ve heard of Ethan. He’s very handsome. It seemed\nthat he got in a relationship with Catherine when they were students.]"
      },
      {
        "paragraph": "[No wonder Wesley looked like a pervert in the video to me. It turns out that Catherine  forced him to\nthat state.]"
      },
      {
        "paragraph": "[Fair enough. If I risked my life and lost my kidney for a woman but she betrayed me over and over\nagain, I’d be so pissed and end up mentally ill too.]"
      },
      {
        "paragraph": "[I feel that Catherine is a scheming woman. Wesley has done so much for her, but ultimately, she\nsecretly kept him under surveillance to smear his reputation.]"
      },
      {
        "paragraph": "[The Lyons family is truly miserable, so is Ethan’s pregnant wife.] [Catherine is utterly heartless.]"
      }
    ]
  },
  {
    "title": "Chapter 1272 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Chairwoman Jones.” Harvey looked at Catherine’s expression anxiously. “Wesley is truly despicable.”"
      },
      {
        "paragraph": "“His despicable behavior is nothing new.”"
      },
      {
        "paragraph": "Gazing at the documents in her hand, Catherine felt lucky to have received these from Shaun in time."
      },
      {
        "paragraph": "Otherwise, she would have a tough time turning things around."
      },
      {
        "paragraph": "“Help me buy two packets of cold medicine and send them to Hill Corporation.” Catherine lifted her\nphone and said, “I’ll transfer the money to you.”"
      },
      {
        "paragraph": "“What?” Harvey was lost."
      },
      {
        "paragraph": "“Buy some medicine.” Catherine knocked on the table. “ Shaun is having a cold, and I shall be kind.”"
      },
      {
        "paragraph": "Harvey was speechless. “Chairwoman Jones, you’re in the mood to buy him medicine in spite of this\ncrucial period, huh? Even after you guys get back together, it won’t be of use…”"
      },
      {
        "paragraph": "“Hurry up and carry out the task.” Catherine did not want to hear him rattle on. Hill Corporation."
      },
      {
        "paragraph": "A supervisor walked out of the president’s office."
      },
      {
        "paragraph": "Hadley immediately went in while holding some packets of medicine. “President Hill…”"
      },
      {
        "paragraph": "After he handed Shaun the medicine, Shaun lifted his head from his laptop and glanced at them\nindifferently with a frown. “Why did you get me so much medicine? I’m not frail. There’s even\npeppermint tea, but I don’t have an upset stomach. Are you trying to feed me to death?”"
      },
      {
        "paragraph": "Hadley explained with a smile, “ I wasn’t the one who bought these. It was Miss Jones who asked\nSecretary York to send these here.”"
      },
      {
        "paragraph": "Shaun was momentarily stunned before his dark eyes lit up. “Really?”"
      },
      {
        "paragraph": "“Yeah. Secretary York just sent them here. You— ” Hadley was about to ask him to pick the ones that\nwould be helpful for his cold."
      },
      {
        "paragraph": "However, before he could finish his sentence, Shaun took the peppermint tea and downed it straight\naway."
      },
      {
        "paragraph": "After downing the peppermint tea, he gave a satisfied smile like how he looked when he was drinking it.\n“It tastes great.”"
      },
      {
        "paragraph": "Hadley was dumbfounded."
      },
      {
        "paragraph": "What the f*ck?! He had never seen anyone else drink peppermint tea so quickly."
      },
      {
        "paragraph": "What was more, he just said that he did not have an upset stomach, so why did he bother drinking it?"
      },
      {
        "paragraph": "Before Hadley came to his senses, Shaun had already opened a bottle of acyclovir oral suspension\nand took it with a few cold pills."
      },
      {
        "paragraph": "As Hadley watched him eat several kinds of medicine, he promptly said, “Eldest Young Master Hill, you\ndon’t have to take everything. There are ten types of medicine here. No one takes medication like what\nyou’re doing.”"
      },
      {
        "paragraph": "“Cathy bought me these, and it’s her first time doing it. I must appreciate her kindness.” Shaun took\nevery type of medicine just like that."
      },
      {
        "paragraph": "Hadley was completely at a loss for words. The man who was in love was just like a fool. After Hadley\nleft, he could not help but call Catherine. “Miss Jones, why did you buy so many kinds of medicine for\nEldest Young Master Hill? He took them all.”"
      },
      {
        "paragraph": "”That’s great, isn’t it?” Catherine said, ”He can only recover soon by taking medicine.”"
      }
    ]
  },
  {
    "title": "Chapter 1273 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“ .. No, the problem is he doesn’t have a fever or a stomach ache. He simply took everything such as\nthe peppermint tea and fever reducers without thinking.”"
      },
      {
        "paragraph": "Catherine went silent. She did not know Harvey had bought so much medicine."
      },
      {
        "paragraph": "It seemed that she had forgotten to tell Harvey about Shaun’s symptoms. Harvey could not possibly\nhave bought everything, right?"
      },
      {
        "paragraph": "Even if the medications were bought and sent over, did Shaun just take everything without considering\nhis symptoms?"
      },
      {
        "paragraph": "Did he think he was eating candy?"
      },
      {
        "paragraph": "Hadley laughed bitterly. “Please try to persuade Eldest Young Master Hill. If he does this for the whole\nday, he’ll get sick from taking the medications even though he was fine before.”"
      },
      {
        "paragraph": "“Is he a kid? Doesn’t he know how to look at the descriptions on the medications before taking them?”\nCatherine said angrily."
      },
      {
        "paragraph": "“Because those medications were from you. It’s the equivalent of men giving women chocolates. As\nlong as it’s from you, even peppermint tea would taste sweet, ” Hadley explained."
      },
      {
        "paragraph": "In the end, Catherine dialed Shaun’s number."
      },
      {
        "paragraph": "“Cathy, I’ve finished taking the medications you sent over to me. Thank you.”"
      },
      {
        "paragraph": "Shaun’s tone was as gentle as the warm breeze in May. It made Catherine a little embarrassed. As the\nperson who gave the medications, had she been too half-hearted?"
      },
      {
        "paragraph": "If something went wrong with his brain, she would have to take responsibility."
      },
      {
        "paragraph": "“No need to thank me. It’s a token of gratitude from me for the evidence you gave me this morning, ”\nCatherine put on a bold face and said."
      },
      {
        "paragraph": "“ So… those medications were a reward to thank m e?” Shaun’s tone lowered all of a sudden."
      },
      {
        "paragraph": "“Mm.”"
      },
      {
        "paragraph": "Shaun immediately said, “Then I don’t want them. I’ll ask Hadley to refund them. The reward I want is a\nkiss. I can buy medications myself. And don’t tell me to press my upper lip and lower lip together. The\nfeeling of kissing you is different.”"
      },
      {
        "paragraph": "“Shaun, did the testosterones f*cking clog your brain?” Catherine was exasperated because of him."
      },
      {
        "paragraph": "“No, I’m just dizzy from love. ” Shaun chuckled. As he had a cold, his throat was more hoarse."
      },
      {
        "paragraph": "Catherine’s throat choked. “Fine,  those medications don’t count, okay? I just want to remind you that\nyou can’t simply take the medications. If you’re coughing, you should take the medicine for the cough.\nWhy did you take the fever medicine and drink peppermint tea? Do you think you’re drinking Coke or\nhaving jelly beans?”"
      },
      {
        "paragraph": "“Cathy, I know that medications can’t be simply taken. But… it’s the first time you bought medicine for\nme. I didn’t expect that I could still receive this treatment in this lifetime. It feels like a dream.”"
      },
      {
        "paragraph": "Shaun suddenly said, “When I take the medications you give me, my heart feels so sweet that it’s\nabout to melt.”"
      },
      {
        "paragraph": "“Enough.” Catherine was almost defeated by Shaun. “I’ll buy a packet of jelly beans later and"
      },
      {
        "paragraph": "have it delivered to your place. At least it won’t be m y fault if you get a problem from eating jelly\nbeans.”"
      },
      {
        "paragraph": "She hung up after she finished speaking."
      },
      {
        "paragraph": "Within half an hour, Shaun received a delivery of a small packet of chocolate jelly beans from a\nsupermarket nearby."
      },
      {
        "paragraph": "He took a picture with his phone and posted it on Facebook to let everyone know about it. [Sweet jelly\nbeans gifted by a certain someone. They’re very sweet.]"
      },
      {
        "paragraph": "The netizens, who were initially cursing Catherine, went to his post and started cursing him in an\ninstant."
      },
      {
        "paragraph": "[Shameless! You hooked up with another person’s wife, yet you still dare to be  lovey-dovey  in public.]"
      },
      {
        "paragraph": "[Brother, wake up. Catherine isn’t a good woman. She even had an ambiguous relationship with Ethan."
      },
      {
        "paragraph": "[Did Catherine cast a spell on you? You weren’t like this in the past.]"
      },
      {
        "paragraph": "[You and Catherine should just die.]"
      }
    ]
  },
  {
    "title": "Chapter 1274 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun simply let them curse at him all they wanted. He did not care about it at all."
      },
      {
        "paragraph": "The only thing he cared about was the jelly beans."
      },
      {
        "paragraph": "On the other hand."
      },
      {
        "paragraph": "When Catherine was working, she suddenly received a call from Freya. Freya’s tone was ambiguous.\n“Ah, you’re progressing so quickly with Shaun, eh? Are we still sisters? You didn’t even tell me.”"
      },
      {
        "paragraph": "“Tell you what?” Catherine was puzzled."
      },
      {
        "paragraph": "“Hey, stop pretending. Everyone in Australia knows that you gave Shaun jelly beans. They look quite\nyummy. I want to have some  too. Maybe  it’s because I’m pregnant, but everything looks appetizing to\nme,” Freya said with a smile."
      },
      {
        "paragraph": "“How do you know about this?”"
      },
      {
        "paragraph": "“Shaun posted it on Facebook.” Freya was astonished. “You didn’t know?”"
      },
      {
        "paragraph": "Catherine opened her Facebook and had a look. She was speechless."
      },
      {
        "paragraph": "She really had to give it to Shaun. It was a critical time, yet he still fearlessly displayed his affection\nonline."
      },
      {
        "paragraph": "Catherine explained the reason to Freya. Freya laughed and said, “Shaun is too childish.”"
      },
      {
        "paragraph": "“Yes, he’s even as childish as Suzie.” Catherine laughed bitterly."
      },
      {
        "paragraph": "“But when are you going to reveal the evidence? The netizens are cursing you again. It seems like\nthey’re even crazier than last time.”"
      },
      {
        "paragraph": "“This evening. Wesley and Sonya are putting so much effort into acting. Let’s not expose them too\nquickly,” Catherine said while smiling."
      },
      {
        "paragraph": "“Then I’ll be looking forward to it.”"
      },
      {
        "paragraph": "It was 5:00 p.m."
      },
      {
        "paragraph": "Catherine uploaded the information she had prepared on the internet. She counter-attacked right away."
      },
      {
        "paragraph": "[I heard that a certain someone lost a kidney to save"
      },
      {
        "paragraph": "1. I just want to know that since you lost a kidney three years ago, why did a recent CT scan from the\nhospital show that your two kidneys are perfectly fine? When you secretly went for body check-ups\nin these three years, both your kidneys were fine. Why did you transfer a large amount of money to\na doctor in Melbourne who told me back then that you lost a kidney?"
      },
      {
        "paragraph": "[Do you think you can continue to deceive the public since you managed to deceive me for three\nyears? I just want to say that you’ve really put on a good show. You would act as if your body was\nunwell in front of me every single time and made m e feel guilty. In truth, your body is f*cking healthier\nthan mine. Your fighting skills are more excellent than mine too. A slap from you could even make half\nof my face swollen."
      },
      {
        "paragraph": "[It wasn’t the first time you hit me that way. The last time you slapped me, you begged for my\nforgiveness while crying. I forgave you, yet I got a violent beating a second time in return."
      },
      {
        "paragraph": "[Wesley, stop pretending. If it weren’t for me thinking that you really lost a kidney for my sake back\nthen, I wouldn’t have felt guilty and forced myself to accept you over and over. It’s proven that love is"
      },
      {
        "paragraph": "unobtainable through calculating, scheming, and deceiving."
      },
      {
        "paragraph": "[Don’t involve me in your perverted and extremist acts. It’s none of my business. You were a terrible\nperson from the start. On the other hand, I think that I’m very unlucky. What sin did I commit in my\nprevious life to have you fall in love with me?"
      },
      {
        "paragraph": "[Furthermore, Madam Sonya Lyons, I do carry some responsibility for your son’s death. It was because\nhe saw Wesley having an affair with his secretary that day. He wanted to look for me to warn me of\nhim. However, before he could arrive at my company, he got into an accident on the way."
      },
      {
        "paragraph": "[Why do I know all of this? Because Ethan sent me a message a few minutes before the accident\nhappened. He told me to be careful of Wesley. From that day onward, I began to secretly investigate\nWesley."
      },
      {
        "paragraph": "[I’m very thankful for Ethan. If he hadn’t tried to warn me with his life, I would still be deceived by\nWesley until now."
      },
      {
        "paragraph": "[At the same time, I hope everyone will stop making malicious guesses about Ethan. He’s no longer\nalive. Everyone’s slanderous remarks are hurting his wife and child."
      },
      {
        "paragraph": "[We used to date, but we broke up peacefully three years ago. He was my childhood sweetheart and\nhe"
      },
      {
        "paragraph": "became my good friend afterward. We have nothing to hide."
      },
      {
        "paragraph": "[This is the last time I’ll release a statement on this matter. I’ll not voice out anymore in the future. I just\nwish to divorce Wesley now.]"
      }
    ]
  },
  {
    "title": "Chapter 1275 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "This was the first time Catherine released such a lengthy statement."
      },
      {
        "paragraph": "Everybody thought Catherine would definitely be unable to turn the situation around. They did not\nexpect that she would launch a stronger counter- attack."
      },
      {
        "paragraph": "She even stripped the last bit of Wesley’s disguise clean."
      },
      {
        "paragraph": "The netizens went wild. [Could this CT scan be fake?]"
      },
      {
        "paragraph": "[Fake my *ss, don’t you see the timestamp in black and white? It’s clearly stated.]"
      },
      {
        "paragraph": "[I’m a professional doctor. That CT scan should be real. The timestamp and the name of the patient are\non it. It’s hard to fake. The body check-up result looks real based on the seal too. Some doctors really\ndon’t have any ethics. I think Wesley has been acting for such a long time that he’s even convinced\nhimself that he only has one kidney.]"
      },
      {
        "paragraph": "[Wesley is the big shot of a medical corporation. It’s indeed very easy for him to bribe a doctor.]"
      },
      {
        "paragraph": "[So Wesley pretended that he lost a kidney for Catherine’s sake to deceive her and make her feel\nguilty. F*ck, what kind of person is this? He’s so pretentious. I watched the video of him crying this\nmorning. It’s too disgusting.]"
      },
      {
        "paragraph": "[It’s easy to understand. Wesley having an affair with his secretary is a solid fact. He wants to use the\nmatter about his kidney for emotional blackmail. Surprisingly, Catherine had already investigated\neverything thoroughly in secret. Catherine did well. It’s a good slap on Wesley’s face.]"
      },
      {
        "paragraph": "[No, I think the point is that it’s not the first time Wesley committed domestic violence. I said before that\nhe’s mentally twisted. You guys didn’t believe me.]"
      },
      {
        "paragraph": "[I have a bold suspicion. Ethan sent a message to warn Catherine of Wesley before he died. Could"
      },
      {
        "paragraph": "Ethan’s death have been caused by Wesley because he wanted to silence him?]"
      },
      {
        "paragraph": "[The one on top, you must be crazy. Ethan is Wesley’s biological nephew. He didn’t need to go so far\nand kill Ethan to silence him for such a matter.]"
      },
      {
        "paragraph": "[What the f*ck do you know? Wesley can go to any length to set up and hit the woman he loves. This"
      },
      {
        "paragraph": "kind of person is insane. How kindly do you expect him to treat his nephew?]"
      },
      {
        "paragraph": "The netizens’ imagination got wilder and wilder. Catherine was quite happy seeing this."
      },
      {
        "paragraph": "She thought that Wesley would probably want to vomit out blood at that moment."
      },
      {
        "paragraph": "Haha, she would see whether he would keep pretending in the future."
      },
      {
        "paragraph": "A grown-up man sobbing while repenting in front of the reporters… She did not believe that Wesley\nwould have the face to do it."
      },
      {
        "paragraph": "When Catherine was about to get off work, she suddenly received a call from a stranger."
      },
      {
        "paragraph": "If it were before, she would not pick up calls from strangers. Today…"
      },
      {
        "paragraph": "The corners of Catherine’s mouth lifted. Sonya’s hysterical scolding came from the phone. “ Catherine"
      },
      {
        "paragraph": "Jones, I don’t believe what you said is true. Wesley is my biological brother. How could he have done\nsomething that would hurt Ethan? You b*"
      },
      {
        "paragraph": "tch, are you deliberately driving a wedge between us."
      },
      {
        "paragraph": "“Aunty Sonya, if you don’t believe in the things I posted on the internet, why are you calling me?”\nCatherine refuted calmly with a smile."
      },
      {
        "paragraph": "Sonya hesitated for a moment. Then, she said fiercely, “You’re framing Wesley on purpose, right? You\nsaid Ethan sent a message to you before he died, but I had looked through his phone before."
      },
      {
        "paragraph": "There are no records of it at all.”"
      },
      {
        "paragraph": "“Maybe he deleted it immediately after he sent it. Think about it, would he dare to keep such an\nimportant thing in his phone after sending it?”"
      },
      {
        "paragraph": "Catherine’s tone softened a lot. “Aunty Sonya, I know that you don’t like me. But no matter what, I grew\nup with Ethan since we were young. We’ve known each other since preschool. Although many things\nhappened afterward, our childhood friendship is unerasable. I’m distraught over his death too.\nFurthermore… I’m angry at how miserable his death had been.”"
      },
      {
        "paragraph": "Toward the end, her throat was slightly hoarse. She was genuinely upset."
      },
      {
        "paragraph": "Sonya was agitated. “It’s impossible. Wesley would never do such a thing.”"
      }
    ]
  },
  {
    "title": "Chapter 1276 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Aunty Sonya, let me ask you this. Does Wesley have a gentlemanly  image in your heart?” Catherine\nretorted. “Did you think he loved me a lot? Did you know about his affair with Regina?”"
      },
      {
        "paragraph": "Sonya was stunned by her questions."
      },
      {
        "paragraph": "She had indeed thought that Wesley was madly in love with Catherine. She had advised him to give up\nbefore. It was not like there were no other women in the world. However, Wesley always looked as if\nthe woman by his side had to be Catherine and Catherine only."
      },
      {
        "paragraph": "Sonya had watched the video too. To be honest, she was surprised, but was that not the nature of\nmany men? Just like Ethan’s father—he even had an illegitimate child outside."
      },
      {
        "paragraph": "Catherine continued asking, “Did you know that he never lost a kidney for my sake?”"
      },
      {
        "paragraph": "Sonya and her family all thought that Wesley really lost a kidney."
      },
      {
        "paragraph": "Seeing that Sonya was silent, Catherine laughed. “ That means you don’t understand your biological\nbrother at all. Then on what grounds can you say that he wouldn’t hurt Ethan?”"
      },
      {
        "paragraph": "“Can you show me the message Ethan sent you before he died?” Sonya asked coldly."
      },
      {
        "paragraph": "“Sorry, I can’t.” Catherine refused."
      },
      {
        "paragraph": "Sonya sneered, “Do you take me as a fool? After everything you said, you have no evidence at all.\nYou’re provoking the Lyons family on purpose.”"
      },
      {
        "paragraph": "“You can ask Tracy about this. However, she’s pregnant with the Lowe  family’s child now.  I suggest\nthat you don’t  look for her during this period. You can choose to send a message, but don’t harm your"
      },
      {
        "paragraph": "own grandson, ” Catherine said suddenly."
      },
      {
        "paragraph": "“What do you mean?” Sonya was stunned."
      },
      {
        "paragraph": "“Have you ever thought Wesley might know that you’ll contact me and suspect him after seeing my\nFacebook post? Is there anyone watching you from the dark? If Ethan’s death was caused by Wesley,\nthen how important do you think you,  a troublesome sister, are in his eyes?”"
      },
      {
        "paragraph": "Catherine said in a low voice, “There’s no harm in me asking you to be careful. I just… don’t want to"
      },
      {
        "paragraph": "drag Tracy and the baby in her belly into this mess. She’s a good person.”"
      },
      {
        "paragraph": "She hung up after she was done talking."
      },
      {
        "paragraph": "Catherine had said that Ethan sent her a message before he got into the accident but it was only\nbecause she could not let Wesley know that it was Tracy who told her the truth. Otherwise, Tracy would\nbe harmed."
      },
      {
        "paragraph": "However, if she did not say it, how would Sonya know the truth?"
      },
      {
        "paragraph": "Would the Lyons family be in a mess?"
      },
      {
        "paragraph": "Moreover, as a mother, Sonya did have the right to get revenge for her child."
      },
      {
        "paragraph": "Golden Corporation."
      },
      {
        "paragraph": "Inside the office on the top floor. The place was a mess from all the smashing."
      },
      {
        "paragraph": "These few days, Regina had not come to the company as she was suspended due to her scandal with\nWesley. There was only a secretary called Nash Thompson present."
      },
      {
        "paragraph": "Nash looked at Wesley, who was standing in front of the floor- to-ceiling windows and taking a long"
      },
      {
        "paragraph": "drag of a cigarette. He was at a loss. “ President… President Lyons.”"
      },
      {
        "paragraph": "“As expected of the woman I fell in love with.”"
      },
      {
        "paragraph": "Wesley suddenly chuckled. His face was cold and twisted from his laughter. It made people feel a chill\nrunning down their spine. “She could force me this far so calmly and destroy the good image I’ve\npainstakingly built over tens of years. Haha.” Nash shuddered."
      },
      {
        "paragraph": "“Then… Then what do we do now? Golden Corporation’s image has plummeted. Many businesses\nwho are collaborating with us called and said they don’t want the medicines that our company is\nmanufacturing. Everyone no longer has any trust in our brand. Also, many hospitals in Australia have\nalready made announcements that they’ll prohibit their doctors from prescribing our medicines to the\npatients.”"
      }
    ]
  },


  {
    "title": "Chapter 1277 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Why did this happen?”"
      },
      {
        "paragraph": "Wesley abruptly turned around. His eyes were menacing. “Who did it?”"
      },
      {
        "paragraph": "“ It should be… the Jewell family, ” Nash said, “You know as well that the Jewell family dominates half\nof Australia’s hospitals. With a word from the Jewell family…”"
      },
      {
        "paragraph": "“Chester Jewell.” Wesley squinted his eyes. He remembered that Chester and Shaun were good\nfriends."
      },
      {
        "paragraph": "Chester was so ignorant. He actually dared to go against him for Shaun. Very well."
      },
      {
        "paragraph": "After a moment, Wesley took a drag of the cigarette. He slowly said, “I remember that Chester is going\nto marry that celebrity named Cindy in the second half of the year, right?”"
      },
      {
        "paragraph": "“Yes, that’s right.” Nash nodded. He said, “ Somehow, Cindy got very lucky. Ever since she hooked up\nwith Chester, her career in the film industry became smooth-sailing. There were some scandals about\nher some time back, but Chester spent a huge amount of money for her to have a comeback.\nMoreover, I heard that Cindy and Chester’s parents are getting closer. Chester and Cindy’s wedding\nare in preparations too.”"
      },
      {
        "paragraph": "“Very great, indeed. Chester is very skilled with women, yet in the end, he fell for Cindy.”"
      },
      {
        "paragraph": "Wesley laughed. “Cindy has some ties with me. We’re both from Melbourne, and we’ve met a few\ntimes before.”"
      },
      {
        "paragraph": "Those years, Rebecca, him, Sarah, and Catherine were fighting each other endlessly. Right now, only\nCindy was unscathed. She was even marrying into the wealthy Jewell family."
      },
      {
        "paragraph": "Tsk."
      },
      {
        "paragraph": "It looked like it was time to use her too."
      },
      {
        "paragraph": "However, Wesley had to wait until Rebecca returned. Everything would become interesting."
      },
      {
        "paragraph": "“President Lyons, what do we do now? Do we need to seek help from the Campos family…” Nash\nasked tentatively."
      },
      {
        "paragraph": "“We do have to look for the Campos family. I couldn’t possibly have become their slave for so many\nyears for nothing.” Wesley hmphed. “ Since everyone has found out my true colors, then in the future…\nI don’t have to pretend anymore. I’m tired too after pretending for tens of years. By the way, where’s my\nsister?”"
      },
      {
        "paragraph": "“Manager Lyons?” Nash was taken aback. “In the company.”"
      },
      {
        "paragraph": "Wesley narrowed his eyes. He was about to say something."
      },
      {
        "paragraph": "Suddenly, someone knocked on the door outside. Sonya barged in hastily. “Wesley, is everything\nCatherine  said  true? You didn’t  lose your kidney?”"
      },
      {
        "paragraph": "“… Mm. Sorry, Sis. I wanted to be together with Catherine too much back then.” Wesley’s expression\nwas immediately replaced with agony and remorse. “I’ve worried you and our parents. ”"
      },
      {
        "paragraph": "“You… How could you lie about this?” Sonya showed a frustrated look. “You even asked me to help\nyou in the morning. Aren’t you just slapping your own face?”"
      },
      {
        "paragraph": "“I didn’t expect that Catherine would be able to acquire evidence so quickly. But, Sis, don’t ever believe\nthe things said about Ethan, ” Wesley said while observing Sonya closely."
      },
      {
        "paragraph": "“Wesley, I’m sorry. I was indeed a little suspicious just now. I even went and called Catherine, asking"
      },
      {
        "paragraph": "her to show me the evidence. But after asking her for a long time, she couldn’t even show me the\nmessage that Ethan sent to her before he died.”"
      },
      {
        "paragraph": "Sonya said with an angry expression, “I almost fell for her lies! ”"
      },
      {
        "paragraph": "“Sis, although Ethan called me  ‘Uncle’, we were just a few years apart. I’ve always treated him as a\nbrother. How could I hurt him because of the"
      },
      {
        "paragraph": "matter with Regina? That’s too ridiculous.”"
      },
      {
        "paragraph": "Wesley smiled bitterly while saying that, but he felt relieved inside. He found it weird too. How could\nCatherine possibly have received Ethan’s message? He had checked Ethan’s phone before. There\nweren’t any records."
      },
      {
        "paragraph": "“Yes, I saw it back then too. Luckily, I was mindful. By the way, the company’s situation isn’t good."
      },
      {
        "paragraph": "What are you planning to do about it?” Sonya asked."
      },
      {
        "paragraph": "Wesley fooled her with a few sentences. Only then could he make Sonya leave."
      },
      {
        "paragraph": "After she left, Wesley turned his head and said to his assistant, “Keep a close eye on her these days.”"
      },
      {
        "paragraph": "Nash was stunned.  “Are  you  still suspecting her?”"
      },
      {
        "paragraph": "“Just in case, ” Wesley said calmly. No accidents could happen at this critical moment."
      },
      {
        "paragraph": "Downstairs, Sonya had just returned to her office."
      }
    ]
  },
  {
    "title": "Chapter 1278 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Sonya felt weak all over."
      },
      {
        "paragraph": "She had already called Tracy. Tracy was not very straightforward, but she indirectly hinted that\nCatherine’s words were the truth."
      },
      {
        "paragraph": "That meant Wesley could have really killed Ethan."
      },
      {
        "paragraph": "One was Sonya’s son, while the other was her biological brother."
      },
      {
        "paragraph": "Sonya’s eyes reddened from agony. When Ethan died, she had found life to be meaningless."
      },
      {
        "paragraph": "However, now she had to get revenge for her son."
      },
      {
        "paragraph": "It was just that Catherine’s reminder made her not dare to act recklessly."
      },
      {
        "paragraph": "That was because Sonya suspected Wesley was already keeping an eye on her. He could even kill\nEthan, so he could eliminate her, his sister, as well."
      },
      {
        "paragraph": "The most important thing was for Sonya to clear Wesley’s suspicions about her and regain his trust.\nOnly then could she find evidence to go against Wesley."
      },
      {
        "paragraph": "She also wanted to find out why her brother became so terrifying."
      },
      {
        "paragraph": "He kept hiding things. What was he scheming?"
      },
      {
        "paragraph": "At the bar."
      },
      {
        "paragraph": "In an exclusive private room, Chester was wearing a pair of gold-rimmed glasses on the bridge of his\nnose. The light from his phone was reflected on his striking, handsome face."
      },
      {
        "paragraph": "Cindy sent a voice message: “Chester, I’m at your villa. Where are you? When are you coming back?”"
      },
      {
        "paragraph": "Chester just replied with four words right away: [ I’m not going back.] Then, he threw the phone on the\ntable."
      },
      {
        "paragraph": "Rodney gave him a sidelong glance. He could not help but place his arm around Chester’s shoulders\nand say with a touched expression, “Good brother, you know that I’m in a bad mood, so you’re not\neven going to have sex with your girlfriend. Come, cheers. Let’s sleep together tonight.”"
      },
      {
        "paragraph": "“Get lost. I’m  not interested in you.” Chester glanced at him with disdain. “Go find Sarah if you want to\nhave s*x.”"
      },
      {
        "paragraph": "“Ah, I’ve never slept with Sarah before,” Rodney suddenly said awkwardly in a low voice."
      },
      {
        "paragraph": "Chester glanced at Rodney with a weird expression. “You’re incapable of sex too?”"
      },
      {
        "paragraph": "“Do you think I’m Shaun?” Rodney’s face flushed red from anger. “I just think that she’s the goddess of\nmy heart. I can’t really bring myself to do it. I want to sleep with her after we officially get married.”"
      },
      {
        "paragraph": "Chester laughed dryly."
      },
      {
        "paragraph": "Goddess? To hell with that. Sarah was already used goods. Who knew how many people had slept\nwith her by now?"
      },
      {
        "paragraph": "“I’m different  from you,” Rodney said while holding a wine glass, “To me, love is very sacred."
      },
      {
        "paragraph": "Although I usually like to have fun outside, I’m still a conservative, traditional person.”"
      },
      {
        "paragraph": "“Enough, stop talking. I’m afraid I’ll puke.”"
      },
      {
        "paragraph": "Chester was utterly speechless. “Since your love is so sacred, why don’t you go look for your love? You\nkeep calling me out instead.”"
      },
      {
        "paragraph": "Rodney’s gaze dimmed. “Sarah has been busy recently. Quite many patients require psychological"
      },
      {
        "paragraph": "treatment in the hospital.”"
      },
      {
        "paragraph": "“Really?” Chester did not believe it at all."
      },
      {
        "paragraph": "It was probably because Sarah looked down on Rodney after he was kicked out of the Snow family."
      },
      {
        "paragraph": "“What’s with your tone? Don’t you believe me?” Rodney was unhappy."
      },
      {
        "paragraph": "“ I didn’t say anything.” Chester drank some wine."
      },
      {
        "paragraph": "The two big guys sat there for a while. Suddenly, they felt pretty bored. In the end, they suggested\nchanging venues and went to have supper."
      },
      {
        "paragraph": "Just as they came out of the private room, Rodney suddenly saw Sarah walking into the elevator. Her\nwaist was circled by a slightly obese man."
      }
    ]
  },
  {
    "title": "Chapter 1279 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "That man had said something that made Sarah laugh happily."
      },
      {
        "paragraph": "That man bent down and lowered his head, about to kiss Sarah on her lips."
      },
      {
        "paragraph": "Rodney watched that scene in a daze. He could hear the rumbling sounds of thunder in his mind."
      },
      {
        "paragraph": "He did not dare to believe it. Why would the woman he had loved all along kiss such a tacky man?"
      },
      {
        "paragraph": "Was she not… his girlfriend?"
      },
      {
        "paragraph": "Did she not say that she was working extra hours in the hospital?"
      },
      {
        "paragraph": "How did it turn out like this?"
      },
      {
        "paragraph": "Chester followed Rodney’s gaze and looked over. His reflexes were quick. He walked over in long\nstrides and blocked the elevator doors that were about to close."
      },
      {
        "paragraph": "When Sarah, who was being kissed by that man in his embrace, saw Chester from the corners of her\neyes, she was so startled that she screamed. She quickly pushed that man away."
      },
      {
        "paragraph": "“Sarah…” Rodney came over as well. He looked like a wilted flower. There was shock, frustration, fear,\nand anger in his eyes."
      },
      {
        "paragraph": "“Why… Why did you lie to me? What’s going on between you and this man?”"
      },
      {
        "paragraph": "Rodney grabbed that man’s collar. It was as if he had gone mad. Just as he raised his fist and wanted\nto punch that man, Sarah came over in a hurry and grabbed his arm. “Don’t hit him.”"
      },
      {
        "paragraph": "Rodney jolted, his eyes glinting with tears. “Sarah, are you still the Sarah that I know?”"
      },
      {
        "paragraph": "“F*ck, how dare you want to hit me? Get lost!” That obese man shoved Rodney away. He said angrily,\n“Do you know who I am? You have a death wish.”"
      },
      {
        "paragraph": "“You’re the one who has a death wish.” Rodney was agitated. A murderous gleam shone in his eyes."
      },
      {
        "paragraph": "However, he was blocked by Chester. “Rodney, calm down. This is President Yard of Helios Investment\nGroup.”"
      },
      {
        "paragraph": "Rodney was stunned. He had not thought so much a s he was angered just now. Only at that moment\ndid he realize this man looked a little familiar. He had"
      },
      {
        "paragraph": "even met him before when he joined various business summits in the past."
      },
      {
        "paragraph": "“Young Master Jewell, you have a good eye.” President Yard glared at Rodney coldly and scolded,\n“The Snow family has already cut off all ties with you. If you dare to touch me today, I’ ll make you bear\nthe consequences.”"
      },
      {
        "paragraph": "“Fine, I’ll kill you first and see if I’ll suffer the consequences or not.”"
      },
      {
        "paragraph": "Rodney was exasperated. The anger on his face showed that he desperately wanted to fight with that\nman."
      },
      {
        "paragraph": "However, Sarah stood in front of President Yard the next moment. Her expression was indifferent. “\nRodney, it’s not his problem. It’s mine. I’m the one who doesn’t want to be with you anymore. I’m sorry.”"
      },
      {
        "paragraph": "“What did you say?” Rodney was in a daze. Although he had seen her making out with that Yard guy\njust now, he still did not want to accept it. “Sarah, tell me. Did he force you to do this?”"
      },
      {
        "paragraph": "“I forced her?” President Yard snorted and said, “ Forget it, Rodney. One should always aim high."
      },
      {
        "paragraph": "Sarah just found someone who has a brighter future than you. I’m not as handsome as you, but I’m"
      },
      {
        "paragraph": "richer. My future development is better than yours too.”"
      },
      {
        "paragraph": "“I don’t believe this!” Rodney roared. His eyes were bloodshot. “Sarah, I don’t believe that you’re that\nkind of person.”"
      },
      {
        "paragraph": "“Enough, don’t say any more.”"
      },
      {
        "paragraph": "Sarah was annoyed by  his yelling.  “Rodney, actually, I don’t like you at all. I hate your personality. I\njust treated  you as a backup in the past because you were the Snow family’s young master. But now, \nthe Snow family doesn’t  care about you at all. I don’t  want  to waste  any  more time on you. President\nYard is more powerful and influential than you. I’ve already gotten together with him.”"
      },
      {
        "paragraph": "“No, no.” Rodney shook his head. He was about to break down in frustration from the shock. “Sarah, I\nleft the Snow family for you.”"
      }
    ]
  },
  {
    "title": "Chapter 1280 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Anyway, I don’t want to tolerate you anymore. You’re too useless. When Shaun wanted to take my\nmoney, you couldn’t even be of any help. You’re just a piece of trash.”"
      },
      {
        "paragraph": "Sarah’s expression was full of contempt. “You’re not good enough for me at all. Initially, I didn’t want to\nmake things so ugly. I’ve been avoiding you lately, and I thought you would have some self-\nawareness. Don’t look for me anymore in the future.”"
      },
      {
        "paragraph": "“Did you understand that?” President Yard’s face was full of mockery. “A person has to have self-\nawareness. Get lost!”"
      },
      {
        "paragraph": "After he spoke, he shoved Rodney aside hard."
      },
      {
        "paragraph": "Rodney looked at Sarah absently. It was as if he had lost his soul."
      },
      {
        "paragraph": "Was this the woman he had loved this entire time? How did things become like this?"
      },
      {
        "paragraph": "Chester looked at Sarah coldly while frowning. “ Sarah, do you know that although President Yard is\ndivorced, he has a daughter?”"
      },
      {
        "paragraph": "Faced with Chester’s gaze, Sarah shuddered. Even so, she still forced herself and said, “I know. But do\nyou think I can marry a wealthy family’s young master with my current reputation? Rodney isn’t good\nenough for me. President Yard is great. He’s powerful and influential.”"
      },
      {
        "paragraph": "“Fine, just watch out. I hope you don’t regret this and pester Rodney again in the future.”"
      },
      {
        "paragraph": "Chester released his grip on the elevator doors, which then closed. The two people in the elevator\ncould no longer be seen."
      },
      {
        "paragraph": "“I don’t believe Sarah is this type of person. I don’t believe it.” Rodney came back to his senses and\nstumbled, wanting to go after them. However, Chester grabbed his arm."
      },
      {
        "paragraph": "“Rodney, snap out of it,” Chester warned him with a cold voice, “In any case, you’ re my good friend."
      },
      {
        "paragraph": "Does the young master of the Snow family need to lose the last bit of his pride for a woman?”"
      },
      {
        "paragraph": "Rodney’s body halted when he got scolded."
      },
      {
        "paragraph": "He looked at the elevator doors in a daze. It was as if he had lost the thing he loved the most. He was\nin agony and felt helpless."
      },
      {
        "paragraph": "Chester said coldly, “I hinted to you before that Sarah isn’t simple. Why do you think Shaun didn’t want\nher in the end? Because he saw through Sarah’s true nature. Think about it. If Sarah wasn’t a vain,\ngreedy woman, why is she fighting with all her might to file the lawsuit to keep Shaun’s 1oo billion\ndollars? She’s not even willing to give a penny back to Shaun. You’re the one who’s stubborn and can’t\nsee her true colors."
      },
      {
        "paragraph": "“Use your brain and think about it. Did Sarah’s attitude toward you change after the Snow family\npublicly cut all ties with you?"
      },
      {
        "paragraph": "“She could hook up with Lucifer when she was dating Shaun. Likewise, she can also cheat on you\neven after dating you."
      },
      {
        "paragraph": "“Why did your family keep refusing to let you be with Sarah? Was it just because they didn’t like her?"
      },
      {
        "paragraph": "No, the Snow family aren’t unreasonable people. It was because they saw through Sarah’s true nature.\nLetting a person like that marry into the Snow family would ruin the Snow family’s reputation."
      },
      {
        "paragraph": "“Do you know why I didn’t tell you these words before? Because I had already sensed it a long time\nago. A woman like Sarah wouldn’t be content with getting married to the president of Osher\nCorporation. She would want to climb even higher.”"
      },
      {
        "paragraph": "Chester’s words were like bombs. They exploded one after another in Rodney’s head."
      },
      {
        "paragraph": "His pretty, handsome face became paler."
      },
      {
        "paragraph": "Actually, it was not that he had never noticed Sarah’s changes. Sometimes, he also felt like she liked\nmoney a lot."
      },
      {
        "paragraph": "However, he ignored it as much as he could. It was because he loved her."
      },
      {
        "paragraph": "It was because he loved her."
      },
      {
        "paragraph": "He never expected that his selfless love would be trampled by someone so heartlessly."
      }
    ]
  },
  {
    "title": "Chapter 1281 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Let’s go. I’ll accompany you to drink until we drop tonight.”"
      },
      {
        "paragraph": "Chester patted Rodney’s shoulders. “No need. I want to cool down alone.” Surprisingly, Rodney shook\nhis head."
      },
      {
        "paragraph": "Chester did not stop him. Rodney’s feelings for Sarah were too deep. This matter was not something\nthat could be figured out in just a short while. However, as long as Sarah did not come back to pester\nRodney anymore, he would give up sooner or later."
      },
      {
        "paragraph": "After Rodney left in a wrecked state, Chester gave Shaun a call."
      },
      {
        "paragraph": "After Shaun heard about everything, he went silent for a moment and said, “I’m afraid that Sarah will\ncome back and pester Rodney again after he returns to the Snow family one day and becomes\nsuccessful i n his career.”"
      },
      {
        "paragraph": "Chester was taken aback. “Rodney shouldn’t be that silly. If he still can’t understand Sarah’s"
      },
      {
        "paragraph": "character after this incident, I don’t know what I should say about him.”"
      },
      {
        "paragraph": "“Let’s hope he really opens his eyes to everything,” Shaun spoke sincerely. He had personal\nexperience in this, after all."
      },
      {
        "paragraph": "“By the way, thank you for helping with the matter regarding Wesley this time,” Shaun smiled and said."
      },
      {
        "paragraph": "“Although I’ve informed every major hospital, I reckon this will just be temporary. If Wesley gets the\nCampos family to help him, I believe  he’ll have a way to overcome this crisis.” Chester did not dare to\nunderestimate Wesley."
      },
      {
        "paragraph": "“We’ll take it one step at a time. I understand.”"
      },
      {
        "paragraph": "After Rodney left the hotel, he did not know where to go."
      },
      {
        "paragraph": "He drove alone for a long time. Finally, he went to the place where Sarah worked."
      },
      {
        "paragraph": "He sat outside for the whole night. At 10:00 a.m., Sarah was sent back in a Bentley."
      },
      {
        "paragraph": "He saw Sarah bending over and giving President Yard a peck on the face after she got down the car.\nThat made President Yard roar with laughter."
      },
      {
        "paragraph": "Rodney simply glared at them. He glared at them to the point his eyes were bloodshot."
      },
      {
        "paragraph": "He only got down the car after the Bentley left. He gazed at Sarah in despair. “You were with him the\nentire night?”"
      },
      {
        "paragraph": "“What else?” Sarah ran her fingers through her hair. She was too lazy to deal with Rodney. “Didn’t you\nsee us going up the elevator yesterday?”"
      },
      {
        "paragraph": "“Sarah, how did you… become like this?” Rodney had thought about it for the whole night, but it was\nstill hard for him to accept it. “You weren’t like this before.”"
      },
      {
        "paragraph": "“How was I in the past? Gentle, kind, and generous?” Sarah laughed sarcastically, revealing her true\nself. “If I hadn’t acted that way, would you all have liked me? I was like this all along. To be honest, if it\nweren’t for Shaun not wanting me, I wouldn’t have chosen you either. Do you know that you’re the\nworst out of the three? But I had no choice. Chester treats me as a sister. He looks like he’s\naffectionate, but in fact, he’s the most cold- hearted person. Only you were the easiest to fool.”"
      },
      {
        "paragraph": "Rodney’s legs trembled from the shock. His heart was in so much pain that it was as if he could not\nbreathe. “It was really kind of you to keep acting around me. It… It must’ve been difficult for you.”"
      },
      {
        "paragraph": "“It’s true. I don’t want to act anymore. Rodney Snow, you’re an idiot. You said you love me, but didn’t\nyou have sex with Freya in the end? You merely looked as if you had deep feelings for me. Haha,\npretentious.” Sarah snorted bluntly."
      },
      {
        "paragraph": "Unbearable pain flashed across Rodney’s eyes."
      },
      {
        "paragraph": "How did he end up having sex with Freya in the first place? Was it not because of Thomas’ tampering?"
      },
      {
        "paragraph": "Rodney could even neglect his baby for Sarah’s sake. He lost his family, but in the end, he was belittled\nand humiliated by her."
      },
      {
        "paragraph": "Was that retribution?"
      },
      {
        "paragraph": "“Sarah, is power and money that important to you? You already have 1oo billion dollars. Many people\ncan’t get that much money even after working for a few lifetimes…” Rodney was at a loss."
      },
      {
        "paragraph": "“Is 1oo billion dollars a lot? Don’t you know that President Yard has a few hundred billion dollars? What\nabout you? What do you have? You’re not even as rich as me, yet you want to marry me. Are you even\nworthy?” After Sarah sneered, she turned around and went into the building."
      },
      {
        "paragraph": "Rodney did not go after her anymore."
      }
    ]
  },
  {
    "title": "Chapter 1282 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "At that moment, he had really given up."
      },
      {
        "paragraph": "The unrequited love that started from his youthful days lasted for more than ten years."
      },
      {
        "paragraph": "In the end, he realized that the person he had fallen in love with was such a terrible woman."
      },
      {
        "paragraph": "His life was a joke."
      },
      {
        "paragraph": "The next few days, Rodney did not go anywhere. He did not go to the company. He did not go out and\nstayed in his home, not eating or drinking."
      },
      {
        "paragraph": "After three days, he went to the Snow family’s residence and knelt in front of the door."
      },
      {
        "paragraph": "At 9:00 p.m., it started raining heavily."
      },
      {
        "paragraph": "There were many people sitting in the living room of the Snow family’s house. However, no one said a\nword. It was so silent that even the sound of a needle dropping could be heard."
      },
      {
        "paragraph": "“Dad…” Wendy looked at Old Master Snow worriedly."
      },
      {
        "paragraph": "“Are you asking me to take back the words I said?”"
      },
      {
        "paragraph": "Old Master Snow glared at her."
      },
      {
        "paragraph": "“That’s not what I meant…” Wendy sighed. “After all, Rodney is the flesh and blood of the Snow family.\nThe sun was strong during the day, and now it’s raining. I heard from Chester that Rodney hasn’t eaten\nor drank these few days. He might not be able to stand it.”"
      },
      {
        "paragraph": "“Then let him be. Ask him to get lost. ” Old Master Snow stood up. When he reached the stairwell, he\nturned his head and said, “Let’s see  if  he’ll kneel till tomorrow morning."
      },
      {
        "paragraph": "“Disperse.”"
      },
      {
        "paragraph": "Everyone was dismissed."
      },
      {
        "paragraph": "Wendy barely slept at night. When she woke up the next day, Rodney was still kneeling outside."
      },
      {
        "paragraph": "After Old Master Snow woke up, he asked someone to get Rodney to come in."
      },
      {
        "paragraph": "Rodney had knelt for a day and a night. In addition, he had not eaten or drunk for a few days. His face\nwas very pale. His legs shook when he walked too."
      },
      {
        "paragraph": "However, he steadied himself with all his might. After he went in, he knelt in front of Old Master Snow\nwith reddened eyes. “Grandpa, I’m sorry. I was wrong in the past. I didn’t listen to your words and loved\nthe wrong person. I was blind. I mistook trash for treasure.”"
      },
      {
        "paragraph": "After Old Master Snow slowly took a bite of bread, he said, “Keep kneeling. We’ll talk about this later\nafter Freya arrives.”"
      },
      {
        "paragraph": "Rodney was taken aback. He was momentarily puzzled."
      },
      {
        "paragraph": "Jason agreed and nodded his head. “ She’s part of the Snow family now. We have to wait until\neveryone is present. I’ve already asked Ryan to pick her up.”"
      },
      {
        "paragraph": "Afterward, nobody in the Snow family said anything."
      },
      {
        "paragraph": "Everyone was gathered at the table, eating breakfast. No one cared about Rodney, who was kneeling\non the floor."
      },
      {
        "paragraph": "Rodney had not eaten for a few days. Initially, he did not have any appetite. However, after seeing the\nbreakfast that the Snow family’s chef had prepared, his stomach strangely began to cramp as he\ninhaled the aroma. He was terribly hungry. His stomach even let out growling sounds that he could not\nhold back."
      },
      {
        "paragraph": "However, it was as if everyone could not hear them at all."
      },
      {
        "paragraph": "40 minutes later, Ryan and Freya walked in together."
      },
      {
        "paragraph": "Ryan wore a pair of long black pants paired with a white shirt. Freya wore a green dress, and there was\na white knitted cardigan on her shoulders. They were similar in age. One of them was a young man\nwho looked clean and gentle, while the other looked like a mixed-race beauty. At first glance, they\nlooked like a beautiful couple."
      },
      {
        "paragraph": "Rodney strangely felt ashamed when he looked at them."
      },
      {
        "paragraph": "He used to be the high and mighty young master of the Snow family. He did not expect there would\ncome a day when he would be kneeling on the floor while looking at Freya."
      },
      {
        "paragraph": "Moreover, he had been kneeling for a day and a night. He experienced the wind and the sun, even\ngetting wet in the rain at night. His appearance was awful. Sure enough, when Freya’s gaze swept\nacross him, there was blatant disdain in her eyes."
      }
    ]
  },
  {
    "title": "Chapter 1283 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Freya, you’re here. Have you eaten breakfast?” Old Master Snow waved while smiling. “Didn’t you say\nlast time that you like to eat the scones Aunty Layla makes? I asked her to make them for you. They’re\nstill piping hot.”"
      },
      {
        "paragraph": "“Thank you, Grandpa.”"
      },
      {
        "paragraph": "Freya took her seat naturally. She started eating the delicious scones."
      },
      {
        "paragraph": "After Rodney saw this, he felt more miserable."
      },
      {
        "paragraph": "After he was born, he became popular in the Snow family. He was everybody’s favorite wherever he\nwent."
      },
      {
        "paragraph": "Now… He had brought everything upon himself."
      },
      {
        "paragraph": "“Grandpa…” Rodney called out softly."
      },
      {
        "paragraph": "It was as if Old Master Snow finally remembered his existence. He said to Freya, “Freya, aren’t you\nvery curious as to why he suddenly came back to kneel and apologize? He was dumped by Sarah a\nfew days ago.”"
      },
      {
        "paragraph": "“No wonder… ” After Freya swallowed the scone, she sighed."
      },
      {
        "paragraph": "“Yes, no wonder, right? No wonder he suddenly came back.” Old Master Snow flashed an\nunpredictable smile and said, “He must be treating this place like a hotel. He can stay here if he wants\nto and leave when he doesn’t want to anymore. You young people nowadays are so clear about what\nyou want and don’t want. Anyway, we can make him come back sooner or later if we beg him and care\nabout him, right?”"
      },
      {
        "paragraph": "Rodney’s head was almost buried in his chest from his grandfather’s sarcasm. He was so ashamed.“\nGrandpa, it’s okay even if you don’t let me return to the Snow family. I’m kneeling here today because I\nwant to admit to my mistakes. I want to apologize to you all for my stupidity in the past. I was blind\nbefore. I’m sorry, I’m really sorry.”"
      },
      {
        "paragraph": "Wendy sighed."
      },
      {
        "paragraph": "Old Master Snow sneered. “Let me ask you. If it weren’t for Sarah not wanting you anymore, would you\nhave come to realize the truth? You might’ve gone against us your whole life for her, right?”"
      },
      {
        "paragraph": "“I’m sorry…” Rodney’s face flushed red from being criticized. He could only say that one sentence."
      },
      {
        "paragraph": "Jason could not help but say, “Your grandpa and I have much more experience in life than you. We\nsaid Sarah wasn’t good. But you? You thought we were framing her. We’re already so old. Do we need\nto frame her? You believed in everything Sarah said."
      },
      {
        "paragraph": "We brought you up, yet you were willing to abandon your parents who raised you for the sake of a\nwoman.”"
      },
      {
        "paragraph": "“Dad, I won’t do it again in the future.” Rodney was utterly embarrassed from being scolded. “I had\nnever thought of abandoning you guys. I thought I could fulfill my duties as a son again after some time\nwhen your anger has subsided.”"
      },
      {
        "paragraph": "Jason sneered. “After entering the house for so long, have you apologized to Freya and the baby in her\nstomach? In the past, you forced her to go to the hospital to have an abortion because of Sarah. That\nbaby almost died, you ungrateful b*stard.”"
      },
      {
        "paragraph": "Rodney’s face paled from the scolding."
      },
      {
        "paragraph": "He recalled the picture of the ultrasound Chester gave to him. That baby was almost gone."
      },
      {
        "paragraph": "As he thought about it, he thought that he was too cruel in the past."
      },
      {
        "paragraph": "His gaze slowly moved toward Freya."
      },
      {
        "paragraph": "Freya, who was having scones, did not expect that she would get involved in the argument. She quickly\nput down her fork and said with a serious"
      },
      {
        "paragraph": "tone, “You don’t have to apologize to me. The baby in my stomach has nothing to do with you at all.”"
      },
      {
        "paragraph": "Rodney’s lips moved. “In the past, I—” “Stop right there.”"
      },
      {
        "paragraph": "Freya raised her hand. She turned her head to Old Master Snow and said, “Grandpa, although I don’t\nunderstand why you called me here, I still wish to make clear some things. Everything that happened\nbetween Rodney and me in the past happened by mistake. I already had no feelings for this utterly\nirresponsible person from the moment he forced me to have an abortion. I have no opinion if he wants\nto return to the Snow family, but… my kid will have nothing to do with him because he’s unworthy.”"
      },
      {
        "paragraph": "She said that very calmly and indifferently."
      },
      {
        "paragraph": "Rodney’s face heated up upon hearing those words. He desperately wanted to dig a hole and hide\ninside it. “Grandpa, I’m done eating. I still have some things to do later, so I’ll be leaving first.” Freya\nstood up elegantly with composure."
      }
    ]
  },

  {
    "title": "Chapter 1284 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Sis, you didn’t drive here. Let me give you a ride.” Ryan followed after Freya."
      },
      {
        "paragraph": "Wendy said emotionally, “ I didn’t expect that Ryan and Freya’s relationship to be so good.”"
      },
      {
        "paragraph": "“Yes. ” Nathan nodded. “Too bad Freya is already pregnant. Otherwise…”"
      },
      {
        "paragraph": "He gave Rodney a sidelong glance. He felt a little bit of regret. “ I really don’t understand how a flower\nlike Freya was ruined by you, a pile of sh*t, back then.”"
      },
      {
        "paragraph": "“ Second Uncle…” Rodney felt rueful. In the past, Nathan had always said he was the Snow family’s\nmost handsome man and not many women in the world would be good enough for him. Why was\neveryone siding with Freya in the blink of an eye?"
      },
      {
        "paragraph": "“Your second uncle is right.” Old Master Snow hmphed. “According to the Snow family’s rules, if you\nwant to return to the family, you have to endure 81 whips.”"
      },
      {
        "paragraph": "Rodney’s body shuddered."
      },
      {
        "paragraph": "He knew about the Snow family’s disciplining tool."
      },
      {
        "paragraph": "It was not just any ordinary whip. The whip had to be soaked for a night. When its elasticity had\nreached its maximum, it was sprinkled with salt and chili powder. Toward the end of the punishment, it"
      },
      {
        "paragraph": "would feel more and more like a living hell."
      },
      {
        "paragraph": "If one could still walk out of it alive, it would be considered good enough."
      },
      {
        "paragraph": "Moreover, he had not gone through any suffering before."
      },
      {
        "paragraph": "“You can either choose to return or not, ” Old Master Snow said indifferently, “Of course, this is just the\nfirst hurdle.”"
      },
      {
        "paragraph": "“Could it be… There’s a second hurdle?” Rodney shivered from fear."
      },
      {
        "paragraph": "“Yes. You still have to marry Freya.”"
      },
      {
        "paragraph": "Old Master Snow suddenly sighed. “There’s no choice. We, the Snow family, need to keep our word.\nWe already said we would chase you out of the Snow family. If we let you come back, won’t the\noutsiders think that we were just fooling around? The younger generations of the Snow family will also\nthink that we don’t have any credibility. It’s impossible for us to re-acknowledge you if you return,\nunless… you marry Freya. She’s the Snow family’s goddaughter now. Marrying her is another way you\ncan return  to the Snow family. Others won’t say anything about it either.”"
      },
      {
        "paragraph": "Rodney was dumbfounded."
      },
      {
        "paragraph": "F*ck! At the end of the day, it was  impossible  for him to return to the Snow family. The only way was\nto marry the Snow family’s goddaughter and be the Snow family’s son-in-law."
      },
      {
        "paragraph": "He could not believe that he, Young Master Snow, would end up in this state. Even returning home was\nso troublesome."
      },
      {
        "paragraph": "“Mom…” He was on the verge of tears. He looked at Wendy."
      },
      {
        "paragraph": "Wendy cleared her throat awkwardly. “ It can’t be helped. Back then, your dad, uncle, and the rest all\ncut  ties with you on public platforms. What was done can’t be undone. If you’re not willing… Just go\nback. Actually, I can’t bear seeing you getting whipped 81 times either.”"
      },
      {
        "paragraph": "Jessica glanced at Rodney calmly. “Don’t worry. There’s still me and Carson to take care of Dad and\nMom. Having a funeral for you won’t be a problem.”"
      },
      {
        "paragraph": "Was that the problem here?"
      },
      {
        "paragraph": "That meant Rodney could not return in the future even if he had a family. He really could only be alone."
      },
      {
        "paragraph": "“Let’s go. It’s getting late. We still have to go to work.” Nathan waved his hand."
      },
      {
        "paragraph": "“Me too. I have a meeting to attend later.”"
      },
      {
        "paragraph": "Seeing that everybody was about to leave, Rodney was on the verge of tears. He said, “I accept your\nconditions.”"
      }
    ]
  },
  {
    "title": "Chapter 1285 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“You’d better think about it thoroughly. If you can’t pursue Freya, your 81 whips will be in vain, ” Old\nMaster Snow reminded, “Moreover, you can’t use despicable methods to coerce her. She must be\nwilling.”"
      },
      {
        "paragraph": "Rodney wanted to spit out blood."
      },
      {
        "paragraph": "Even if he got whipped 81 times, what he could obtain was only a chance to pursue Freya."
      },
      {
        "paragraph": "The Snow family was really pushing Rodney into a dead end. He refused to marry Freya before, and\nnow, he could not have her at all."
      },
      {
        "paragraph": "“Grandpa, is your image more important? Or your grandson?” Rodney said. He was on the verge of\ntears."
      },
      {
        "paragraph": "Old Master Rodney glanced at him indifferently. “Of course, my image is more important. If I lose a\ngrandson, I still have many other grandchildren. If I lose my image, it’ll be hard to get it back.”"
      },
      {
        "paragraph": "Rodney really wanted to spit out blood from receiving that blow."
      },
      {
        "paragraph": "He had just left for a short period, yet he was disliked by everyone now."
      },
      {
        "paragraph": "In the end, Rodney was brought to the punishment room."
      },
      {
        "paragraph": "After receiving 81 whips, he fainted right away. The Snow family called an ambulance and brought him\nt o the Jewell family’s hospital."
      },
      {
        "paragraph": "When Chester saw Rodney, who had his bottom badly whipped, he speechlessly asked Rodney’s\nbrother, Carson, “Did the Snow family agree to let him return?”"
      },
      {
        "paragraph": "Carson shook his head with a smile. “No, the Snow family allowed him to pursue Sister Freya and\nmarry into the Snow family.”"
      },
      {
        "paragraph": "As the saying went, nothing would happen if a person did not do unnecessary things."
      },
      {
        "paragraph": "When Freya heard Rodney was dumped by Sarah and was whipped 81 times, she was in a very good\nmood and gave Catherine a call.  “Let’s cook crayfish tonight to celebrate.”"
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "Catherine agreed."
      },
      {
        "paragraph": "There were too many things happening recently. She had not properly hung out with Freya in a long\ntime."
      },
      {
        "paragraph": "She got off work early, bought the crayfish, and drove over. On the way, she received Shaun’s call. “ Do\nyou want to come to my place to eat tonight?"
      },
      {
        "paragraph": "Suzie and Lucas— ”"
      },
      {
        "paragraph": "“Don’t keep using them as your excuses. I’ve promised Freya to have a meal with her tonight. ”\nCatherine could see through his plans immediately."
      },
      {
        "paragraph": "Shaun sounded rueful. “You’d rather accompany Freya than accompany your children when you have\ntime? Who’s more important, your friend or your children?”"
      },
      {
        "paragraph": "“Alright, stop nagging. I’ll bring some leftover crayfish and visit Suzie and Lucas later.” Catherine\nremembered that Suzie liked to eat crayfish."
      },
      {
        "paragraph": "“You guys are eating crayfish?” Shaun frowned. “ The children are still young. It’s not suitable for them\nto eat crayfish, right?”"
      },
      {
        "paragraph": "“ I’m cooking the crayfish myself, ” Catherine said bluntly, “I’ll make sure to clean the crayfish properly.\nDon’t worry.”"
      },
      {
        "paragraph": "“Cathy, cleaning crayfish is a laborious task. I think… it’ll be better for me to do that kind of job.” Shaun\nvolunteered. “I promise to wash each and every crayfish till they’re clean. I’ll even shell them for you.”"
      },
      {
        "paragraph": "“… Okay.”"
      },
      {
        "paragraph": "He was offering such great services for free. Catherine hesitated for a few seconds and agreed in the\nend."
      },
      {
        "paragraph": "She could not shake him off anyway. It would be better to torture him more."
      },
      {
        "paragraph": "After buying the crayfish, she brought them to Brighton Gardens right away."
      },
      {
        "paragraph": "Freya’s eyes widened when she saw the two bags of crayfish in Catherine’s hands. “How many\nkilograms of crayfish did you buy?”"
      }
    ]
  },
  {
    "title": "Chapter 1286 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Ten kilograms.”"
      },
      {
        "paragraph": "Catherine said with a smile."
      },
      {
        "paragraph": "Freya teared up from being too touched and hugged her. “Do you know that I’ve been eating nourishing\nfood every day lately? My tastebuds are becoming bland from all that nourishment. You specially\nbought so much crayfish for me. But I’m a pregnant woman, so I can only eat five kilograms at most.”"
      },
      {
        "paragraph": "The corners of Catherine’s mouth twitched. “You want to eat five kilograms of crayfish? You must be\ndreaming. You can only eat 2o pieces at most. I bought so much because I wanted to cook more and\nbring some back for Suzie and Lucas. Moreover… Shaun will be coming too.”"
      },
      {
        "paragraph": "“Why did you invite him too?” Freya’s expression was gloomy. “Are you bullying me for being pregnant\nand still single? You must be provoking me.”"
      },
      {
        "paragraph": "“You think too much. I just wanted to get someone else to wash the crayfish.” Catherine lifted a crayfish\nand showed Freya its abdomen. It was dirty."
      },
      {
        "paragraph": "“It’s so dirty. Why didn’t you ask the fishmonger to wash it for you?” After Freya said that, she looked a t\nCatherine with a weird gaze. “Did you do it on purpose?”"
      },
      {
        "paragraph": "“Haha, he said he wanted to wash the crayfish. I’m letting him do as he wishes.” Catherine grinned\nevilly. “ It’s not that easy to make me forgive him.”"
      },
      {
        "paragraph": "“If it’s not that easy, it means there’s still a chance.” Freya blinked ambiguously."
      },
      {
        "paragraph": "“Ahem, that’s because he’s clinging to me too tightly like chewing gum. I can’t even shake him off.”\nCatherine pouted."
      },
      {
        "paragraph": "The corners of Freya’s lips were lifted. She just smiled and did not say anything more."
      },
      {
        "paragraph": "About ten minutes later, Shaun arrived."
      },
      {
        "paragraph": "After Catherine opened the door, she brought him t o the kitchen. Shaun was dumbfounded when he\nsaw the two basins of live crayfish in the kitchen."
      },
      {
        "paragraph": "“Clean them as fast as possible. It’s already getting late. I want to cook the crayfish before 7:00 p.m."
      },
      {
        "paragraph": "Remember to devein the crayfish as well. Cut the shell in the middle open too. ” Catherine was afraid\nhe would not understand. After demonstrating it to him once, she handed the brush to him and left."
      },
      {
        "paragraph": "After Shaun stared into space silently for a few minutes, he had no choice but to accept reality."
      },
      {
        "paragraph": "He lowered his head and studied how to handle the crayfish in earnest."
      },
      {
        "paragraph": "He thought he was fearless. However, when he touched the pincers of the crayfish, he was filled with\nhelplessness and despair."
      },
      {
        "paragraph": "After cleaning them for about half an hour, Chester gave him a video call. Chester was in Rodney’s\nward."
      },
      {
        "paragraph": "He wanted to let Shaun look at Rodney’s injury, but he was stunned when he saw Shaun wearing an\napron. “You’re cooking?”"
      },
      {
        "paragraph": "“Hah! I don’t have the right to do such a pleasant thing like cooking. I’m cleaning crayfish. ” Shaun\nmoved the phone around to let Chester see how many more live, dirty crayfish he still had to clean."
      },
      {
        "paragraph": "The corners of Chester’s mouth twitched. “Where are you? How did you end up in this state?”"
      },
      {
        "paragraph": "“I’m at Freya’s place. Cathy said they wanted to have crayfish tonight. I impulsively said I would clean\nthe crayfish for them.”"
      },
      {
        "paragraph": "Shaun laughed bitterly. He lamented, “When I had a wife previously, I didn’t cherish her properly. In the\nend, I have no choice but to use this method to please my wife. It’s too difficult. Look at my hands. Five\nof my fingers are scratched from being pinched.”"
      },
      {
        "paragraph": "After a moment of silence, Chester handed the  phone to Rodney who was sleeping on his stomach.\n“Look at Shaun. His today is your tomorrow.”"
      },
      {
        "paragraph": "Rodney, whose butt was in pain, saw the scene."
      },
      {
        "paragraph": "F*ck, Catherine and Freya were good sisters. Surely, they would have the same ideas if they wanted to\nprank men, right?"
      },
      {
        "paragraph": "“It’s you, huh? Take a proper look at how I’m cleaning the crayfish. ” Shaun put the phone aside and\nstarted teaching Rodney. “Can you see it clearly? If you don’t learn, you’ll never have the chance to\nmarry into the Snow family your whole life.”"
      },
      {
        "paragraph": "“Get lost! Hang up the call. I don’t want to look at him,” Rodney said in despair."
      },
      {
        "paragraph": "Chester cleared his throat. After he hung up, he said, “Luckily, I’m not like you guys.”"
      },
      {
        "paragraph": "Rodney snorted and glared at Chester fiercely. “I’ll curse you that you’ll be more miserable than us in\nthe future.”"
      },
      {
        "paragraph": "After he spoke, he lay down on the bed listlessly. One of the reasons was because his body was in\nunbearable pain. Secondly, his heart that just went through heartbreak had not recovered yet. Thirdly…\nhe did not want to end up washing crayfish."
      }
    ]
  },
  {
    "title": "Chapter 1287 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Wait!"
      },
      {
        "paragraph": "Crayfish?"
      },
      {
        "paragraph": "Rodney endured the intense pain and raised his head with all his might. “Chester, call him back. Freya\nis pregnant yet she’s still eating dirty things like crayfish? What if my baby gets sick from the food?”"
      },
      {
        "paragraph": "Chester was speechless. “Didn’t you decide that you didn’t want this baby anymore? What does it have\nto do with you?”"
      },
      {
        "paragraph": "Rodney was stunned for a long time. Then, he said with a flushed face, “But the baby in Freya’s\nstomach is my flesh and blood. This is a fact.”"
      },
      {
        "paragraph": "“You dragged her to abort your flesh and blood. This is a fact too, ” Chester reminded him calmly. “ It’s\nnone of your business.”"
      },
      {
        "paragraph": "“Chester! ” Rodney was infuriated and raised his voice. As a result, his vision blackened for a moment\nfrom the pain. He almost fainted again."
      },
      {
        "paragraph": "He took a long time to recover. When he did, he said weaHy, “What right do you have to tell me off?\nYou fool around with women as though you’re changing clothes. The number of women you’ve hurt is\ncountless. Although I’m a scumbag, I’m not as scummy as you.”"
      },
      {
        "paragraph": "“You’re mistaken. I never fool around with women who love me.” Chester glanced at Rodney\nheartlessly. “Women who hang out with me usually have their eyes on my money. We’re just getting\nwhat we both need. Only a fool will get into a relationship.”"
      },
      {
        "paragraph": "“F*ck, try not falling in love with a woman if you can. By that time, you’ll understand my and Shaun’s\nagony.”"
      },
      {
        "paragraph": "Rodney glared at Chester for a while despite his gaze being weak. “Call Shaun again. Ask him not to\nlet Freya eat too much crayfish. She can only eat two or three at most. Also, ask him to properly clean\nthe crayfish.”"
      },
      {
        "paragraph": "“Ha, are you trying to make me get scolded by Shaun?” Chester turned around and walked toward the\ndoor. “It  seems like your condition isn’t too bad. I’ll be leaving first, then.”"
      },
      {
        "paragraph": "“How is my condition not bad? Can’t you see that I’m hurting to death? Hey, don’t go,” Rodney shouted\npitifully. However, Chester only showed him his cold silhouette."
      },
      {
        "paragraph": "Rodney sighed gloomily."
      },
      {
        "paragraph": "He did not expect that nobody from the Snow family would come and show their concern for him when\nhe was hit to this extent."
      },
      {
        "paragraph": "Thinking back, he used to be the apple of the Snow family’s eye. How did he end up in this state?"
      },
      {
        "paragraph": "Brighton Gardens."
      },
      {
        "paragraph": "Shaun cleaned the crayfish till his hands and waist hurt."
      },
      {
        "paragraph": "He finally cleaned the last one. Only then did he go out to look for Catherine."
      },
      {
        "paragraph": "In the living room, the two women were eating fruits while watching a variety show. Shaun did not know\nwhat was so funny that their faces were beaming with laughter."
      },
      {
        "paragraph": "“Hahaha, did you see that? How can my Matty be so cute? My heart totally went soft from looking at\nhim.” It was as if Freya’s eyes were glowing like a wolf’s."
      },
      {
        "paragraph": "“Yes, he’s so handsome. He’s too good -looking. How can he be so handsome?” Catherine stared at\nthe handsome young male celebrity in the show without moving her eyes away."
      },
      {
        "paragraph": "Shaun took deep breaths. If this were back then, he would have turned off the television straight away."
      },
      {
        "paragraph": "However, he could only stand in front of Catherine a t that moment."
      },
      {
        "paragraph": "Catherine raised her head. She saw that Shaun’s refined face was filled with resentment, making him\nlook just like a neglected husband."
      },
      {
        "paragraph": "“Cathy, the crayfish have been cleaned, ” Shaun reminded in a low tone."
      },
      {
        "paragraph": "Catherine looked at the time and waved her hand. “ Alright, I’ll cook them later. Move away. Let me\nfinish watching this part.”"
      },
      {
        "paragraph": "“I’m not moving. Is that guy as good-looking as me?” Shaun showed her the handsome and refined\noutline of his face. “Is he as tall as I am? Is his body as good as mine? Are his abs as good as mine?”\nCatherine watched as he stood in front of her coolly with his hands in his pockets. She could not help\nbut be speechless."
      },
      {
        "paragraph": "Freya cracked a sunflower seed. She held in her laughter and said, “Young Master Hill, Cathy likes\ndifferent male celebrities every year. No matter how handsome the guy is, she’ll get bored if she looks\nat him for a long time.”"
      }
    ]
  },
  {
    "title": "Chapter 1288 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Bored?” Shaun scoffed. “He just has good looks with no good qualities. It’s natural to get bored of\npeople like him after looking at them for a while. ”"
      },
      {
        "paragraph": "The implication was that he was different and had inner qualities."
      },
      {
        "paragraph": "Catherine smiled. “Someone who fell in love with Sarah Neeson does indeed have inner qualities.”"
      },
      {
        "paragraph": "Shaun, “….”"
      },
      {
        "paragraph": "Freya looked at Shaun’s frozen face and sniggered."
      },
      {
        "paragraph": "“Don’t laugh.” Shaun glanced at Freya. “At least I’ve come to my senses, unlike the father of the baby\nin your belly. He only realizes his mistakes when he’s been abandoned.”"
      },
      {
        "paragraph": "Freya could not laugh anymore. She glared at Shaun. “What’s that supposed to mean? Are you saying\nthat I can’t even compare to Sarah? It’s you stupid men who have feelings for two-faced and\nmanipulative b*tches. You guys don’t know how to appreciate pure and kind women like me.” “Alright,\nthat’s enough. I’m going to cook the crayfish.” Catherine stood up in exasperation."
      },
      {
        "paragraph": "“I’ll help, Cathy. ” Shaun hurriedly chased after her."
      },
      {
        "paragraph": "He was aware that pregnant women were capricious, so it was better not to provoke them."
      },
      {
        "paragraph": "In the kitchen, Catherine looked at the clean crayfish and was a little surprised."
      },
      {
        "paragraph": "“Cathy, what else do you need me to do? Should I peel the garlic?” Shaun asked diligently."
      },
      {
        "paragraph": "“No need. I already bought some. Wash some ginger for me,” Catherine replied."
      },
      {
        "paragraph": "When she washed the pot, Shaun washed ginger on the side. There were many fine wounds on his\nhand. There was a cut on his index finger that was quite long."
      },
      {
        "paragraph": "Catherine looked at it and narrowed her eyes."
      },
      {
        "paragraph": "After Shaun finished washing the ginger, he saw that she was struggling to open the can of beer and\nimmediately took it from her. “What’s the point of me standing here? Let me do stuff like this.”"
      },
      {
        "paragraph": "He opened the can of beer in three tries."
      },
      {
        "paragraph": "Catherine thought to herself, ‘Maybe calling him here today was the right decision.’"
      },
      {
        "paragraph": "While she cooked the crayfish, Shaun stood at the side and watched her silently."
      },
      {
        "paragraph": "“Enough, don’t stand there. Go out.” Catherine felt on edge because of his staring."
      },
      {
        "paragraph": "“Why should I go out? I’m not familiar with Freya, so there’s nothing for us to talk about, ” Shaun said\nfaintly, “Cathy, I don’t believe that the celebrity on TV earlier is more handsome than me.”"
      },
      {
        "paragraph": "Catherine did not want to answer him."
      },
      {
        "paragraph": "However, Shaun did not relent. “Say it. Who’s more handsome? Him or me?”"
      },
      {
        "paragraph": "“Shaun Hill, you’re so childish, ” Catherine spat out in exasperation."
      },
      {
        "paragraph": "Shaun frowned deeply. When he recalled Catherine’s tone when she praised the celebrity for being\nhandsome, his heart ached faintly. “Do you women like the celebrities on TV that much and think\nthey’re handsome? In that case, I can make m y debut in my spare time. It shouldn’t be a problem for\nme to get an award for Best Actor.”"
      },
      {
        "paragraph": "Catherine was stunned. “Is that supposed to be a joke?”"
      },
      {
        "paragraph": "“I’m not joking.” Shaun frowned. “Chester founded several film companies, so I can make my debut in a\nmatter of minutes. Don’t doubt me. In the past, many people from film companies used to scout me in\nbars.”"
      },
      {
        "paragraph": "“Enough. Your reputation is rotten enough and you’re already a father. How are you going to debut? If\neven you can debut, then my Lucas can become a child star.” Catherine did not even want to bother\nhitting him anymore."
      },
      {
        "paragraph": "“ I just have some relationship problems. It’s not like I owe debts or was involved in domestic violence."
      },
      {
        "paragraph": "I didn’t break the law either,” Shaun said lazily, “Those celebrities you see on TV are far worse than me\nbehind the scenes.”"
      }
    ]
  },
  {
    "title": "Chapter 1289 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“ I just praised that celebrity for being handsome once. Do you have to go on and on about it?”\nCatherine’s head hurt from his words."
      },
      {
        "paragraph": "Shaun used to speak a lot less. Now, he was more and more talkative."
      },
      {
        "paragraph": "“No, you praised him three times.” Shaun counted with his fingers. “He’s so handsome. He’s too\nhandsome. How can he be so handsome?”"
      },
      {
        "paragraph": "“ I don’t like you doing that. Besides, you’ve never praised me like that before.” Shaun looked at her\nwith a grumpy and bitter expression."
      },
      {
        "paragraph": "Catherine felt as though she had gotten struck by lightning."
      },
      {
        "paragraph": "She nearly suspected that he had been possessed by a spirit."
      },
      {
        "paragraph": "She had to admit that having an incredibly handsome man acting grumpy was, ahem, very hard to\nresist."
      },
      {
        "paragraph": "Especially a person like Shaun. He was clearly a man, but his eyes were large and his eyelashes were\nthick."
      },
      {
        "paragraph": "“You’re more childish than Suzie…” she said in exasperation."
      },
      {
        "paragraph": "Shaun immediately started to wax poetic. “The French novelist Balzac said that love is our second\ntransformation. Love is like bringing us back to childhood. When I see you now, I feel like I’ve become a\nboy again—naive, pure, childish, naughty “Alright, alright. Stop. I get it.” Catherine was going to faint."
      },
      {
        "paragraph": "Shaun ignored her and continued, “Wilful, mischievous…"
      },
      {
        "paragraph": "“Mmh— ”"
      },
      {
        "paragraph": "Before he could finish, Catherine yanked his collar and blocked his lips with hers."
      },
      {
        "paragraph": "Sure enough, Shaun fell silent the next second. His dark eyes blinked."
      },
      {
        "paragraph": "His woman was so domineering that his heart was pounding."
      },
      {
        "paragraph": "“Shaun, baby, please stop talking.” Catherine’s"
      },
      {
        "paragraph": "wide and charming eyes twinkled teasingly."
      },
      {
        "paragraph": "No matter how shameless Shaun’s face was, his face still turned red."
      },
      {
        "paragraph": "He was already 30, but he was still being called a baby."
      },
      {
        "paragraph": "What should he do? He did not feel like he was 30 at all. He felt like he was 18."
      },
      {
        "paragraph": "“Ahem. Weren’t you guys supposed to be cooking crayfish?” Freya’s voice sounded abruptly at the\ndoor."
      },
      {
        "paragraph": "Catherine’s face went hot as she immediately pushed Shaun away."
      },
      {
        "paragraph": "Shaun stumbled back two steps and saw Catherine stammer out an explanation while blushing, “… I\nam. Don’t you see that… I’m cooking it with the pot covered?”"
      },
      {
        "paragraph": "“I know. The waiting time was long, so you sneaked in a kiss in between. I didn’t mean to intrude. I just\ncame over to have a look because I smelled the fragrance. You two continue, I won’t disturb you.”\nFreya retreated tactfully and even closed the door considerately."
      },
      {
        "paragraph": "When she lay down on the sofa to continue eating melon seeds, she felt lonely once more."
      },
      {
        "paragraph": "It was lonely to eat melon seeds alone."
      },
      {
        "paragraph": "It was extremely lonely for a pregnant woman to eat melon seeds alone."
      },
      {
        "paragraph": "Poor thing. As a single pregnant woman, she suddenly wanted to get into a sweet relationship."
      },
      {
        "paragraph": "However… Damn it! It was all that b*stard Rodney’s fault for getting her pregnant."
      },
      {
        "paragraph": "Rodney had better never fall into her hands, or she would torture him to death."
      },
      {
        "paragraph": "In the kitchen."
      },
      {
        "paragraph": "The only sound was of the crayfish boiling in the pot."
      },
      {
        "paragraph": "Catherine’s face burned, and her mind was on fire. She had acted shamelessly."
      }
    ]
  },


  {
    "title": "Chapter 1290 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Cathy, what did you call me just now?” It just so happened that another shameless person was\npestering her now. “Did you… say that I’m too childish? Just call me Shaunny.”"
      },
      {
        "paragraph": "“Shaun Hill, I want you to shut up, okay?” Catherine glared at him in annoyance."
      },
      {
        "paragraph": "However, she did not know that her beautiful little face looked even more radiant because of her anger."
      },
      {
        "paragraph": "“You can shut me up like just now.” Shaun chuckled in a low voice. “I’ll give you one more chance.”"
      },
      {
        "paragraph": "“One more— ”"
      },
      {
        "paragraph": "This time, before Catherine could finish, Shaun took the initiative to lock lips with her."
      },
      {
        "paragraph": "Catherine initially resisted."
      },
      {
        "paragraph": "This was Freya’s house. What was Catherine doing"
      },
      {
        "paragraph": "with him here?"
      },
      {
        "paragraph": "If Freya came in again, Freya would laugh at her. However, this prick Shaun Hill refused to let her go."
      },
      {
        "paragraph": "She could not make too much noise either, so she could only let him do as he pleased."
      },
      {
        "paragraph": "Half an hour later, when the two of them came out o f the kitchen, Catherine’s mouth was red and\nslightly swollen despite not wearing lipstick."
      },
      {
        "paragraph": "Freya once again felt like she was being bullied for being single."
      },
      {
        "paragraph": "When they ate the crayfish, she felt ostracized once more."
      },
      {
        "paragraph": "Since Shaun did not like to eat crayfish, he peeled crayfish for Catherine the entire time."
      },
      {
        "paragraph": "“Stop it. Eat it yourself.” Catherine saw Freya’s jealous eyes and advised Shaun."
      },
      {
        "paragraph": "Shaun shook his head, his tone extremely gentle after kissing her earlier. “No, I like watching you eat. I\nfeel happy when I see you eat.”"
      },
      {
        "paragraph": "Freya shuddered and made a gagging action."
      },
      {
        "paragraph": "Catherine turned red and glared at Shaun, saying with her eyes, ‘Can you restrain yourself a little?’"
      },
      {
        "paragraph": "“What’s wrong with this? It’s not like Miss Lynch has never dated before.” Shaun disagreed."
      },
      {
        "paragraph": "Freya wanted to vomit blood. Was what she had before considered dating? She was covered in scars\nfrom her past."
      },
      {
        "paragraph": "“Ahem, enough. Let’s eat. ” Catherine felt that it would be better to speak less and eat more."
      },
      {
        "paragraph": "Freya also turned her grief and anger into hunger."
      },
      {
        "paragraph": "However, not long after eating, Catherine took away the crayfish from Freya’s hands. “I counted, you’ve\nalready eaten more than 20, so you can’t eat anymore. It’s not good for the baby.”"
      },
      {
        "paragraph": "Freya looked at her gloomily. “I’m all alone and pitiful enough. Can’t you let me eat one more?”"
      },
      {
        "paragraph": "“There’s a baby growing in your belly. Your baby is so cute and much more interesting than a man."
      },
      {
        "paragraph": "Don’t think about those things.” Catherine comforted her. “You don’t have to be afraid of not getting a\ngood man after giving birth. Remember, you’re going to be a princess. There’s a boatload of men for\nyou to choose from.”"
      },
      {
        "paragraph": "“That’s true.” Freya was comforted."
      },
      {
        "paragraph": "Shaun looked at them silently for a while before saying, “You won’t be alone in a few days. The Snow\nfamily said that if Rodney wants to return to the Snow family, the only way he can do that is to"
      },
      {
        "paragraph": "marry you and join the Snow family as their son-in-law.”"
      },
      {
        "paragraph": "Catherine and Freya were both dumbfounded."
      },
      {
        "paragraph": "“Don’t scare me like that. Didn’t he get whipped 81 times…”"
      },
      {
        "paragraph": "“That was just so that he would get a chance to pursue you.” Shaun smiled playfully. “The Snow family\nis quite benevolent.”"
      },
      {
        "paragraph": "“Benevolent?” Freya was depressed. “They clearly want me to be with Rodney. I don’t want to be with\nhim. He refused to acknowledge me before, so why should I pick up Sarah’s leftovers? It’s below my\nstatus and class.”"
      },
      {
        "paragraph": "Shaun raised his brows. “The Snow family isn’t forcing you. On the contrary, they’re giving you the\nopportunity to retaliate against him. You can torture him to death the same way he provoked you in the\npast, and when you’re done with him, you can make him scram.”"
      },
      {
        "paragraph": "Freya’s eyes brightened. “ Isn’t Rodney your good friend? Is it appropriate for you to be plotting this\nwith me?” “Brothers are like clothes, but the woman I love is my heart.” Shaun looked at Catherine\naffectionately. “It’s only because Cathy cares about you as a friend so much.”"
      }
    ]
  },
  {
    "title": "Chapter 1291 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Stop talking. Eat.” Catherine stuffed a crayfish into his mouth."
      },
      {
        "paragraph": "Shaun ate it and whispered in her ear, “I like it better when you use your mouth to shut me up. It’s\nsweeter.”"
      },
      {
        "paragraph": "Catherine stomped on his foot under the table. Freya was not a fool and felt it too."
      },
      {
        "paragraph": "At that moment, she felt incredibly invisible."
      },
      {
        "paragraph": "After eating, Shaun went to the kitchen to do the dishes. Freya said sadly, “I originally wanted to eat\ncrayfish to celebrate, but I ended up getting a full helping of PDA instead. Just leave.”"
      },
      {
        "paragraph": "Catherine was slightly embarrassed and whispered, “No, I’m not getting back together with him.”"
      },
      {
        "paragraph": "Freya gave her a look that seemed to say ‘do I look stupid to you?’ “You kissed him for such a long\ntime despite not planning on getting back together with him.”"
      },
      {
        "paragraph": "Catherine was so embarrassed that she could not speak."
      },
      {
        "paragraph": "After Shaun finished washing the dishes, she brought him away."
      },
      {
        "paragraph": "When they left, they brought back crayfish for Suzie and Lucas."
      },
      {
        "paragraph": "After being teased by Freya, Catherine did not show Shaun a pleasant expression the entire way back."
      },
      {
        "paragraph": "It was all his fault. He always embarrassed her no matter the occasion."
      },
      {
        "paragraph": "However, Shaun was not angry. Halfway through their journey, he said he was going to buy something\nand told her to wait."
      },
      {
        "paragraph": "Catherine saw him enter a convenience store and come out a while later holding ice cream."
      },
      {
        "paragraph": "“Cathy, I don’t know why you’re upset again, but it must be because I haven’t done enough. Eat some\nice cream so you’ll feel better.” Shaun put it in her hands."
      },
      {
        "paragraph": "Catherine looked down at the colorful ice cream that was topped with diced walnuts, strawberries, and\nchocolate. Any girl would like it very much."
      },
      {
        "paragraph": "Holding the ice cream were his injured hands."
      },
      {
        "paragraph": "He got injured when cleaning the crayfish earlier. Then, he peeled the crayfish and did the dishes. The\ntiny cuts were irritated and red."
      },
      {
        "paragraph": "“Try it. ” Shaun urged her. “There’s always a long line here every time I pass by, so it should be good.”"
      },
      {
        "paragraph": "Catherine lowered her head and licked it gently."
      },
      {
        "paragraph": "The ice cream was rich and silky. The walnuts and the fragrance of the cream were especially good."
      },
      {
        "paragraph": "“Is it good?” Shaun’s handsome and gentle face looked at her expectantly."
      },
      {
        "paragraph": "It was like he was trying hard to please her and was afraid that she would be dissatisfied."
      },
      {
        "paragraph": "Catherine lowered her eyes, and her long eyelashes blocked the light in her eyes. After a while, she\nnodded."
      },
      {
        "paragraph": "Shaun smiled, relieved. “That’s good.”"
      },
      {
        "paragraph": "“Do you… want to try?” Catherine lifted the ice cream to his mouth."
      },
      {
        "paragraph": "Shaun was stunned and looked at her beautiful face in disbelief. “You really want me to share it with\nyou?”"
      },
      {
        "paragraph": "“I’m just letting you try it. I can’t finish it all,” Catherine said faintly."
      },
      {
        "paragraph": "Shaun’s eyes stayed on her face for a few seconds before he lowered his head and took a bite of the\nice cream in her hands. “It’s sweet, just as sweet as you.”"
      },
      {
        "paragraph": "The air in the narrow space of the car suddenly warmed up a little."
      },
      {
        "paragraph": "Catherine could not stand it no matter how shameless she was. “Can you stop flirting all the time?”"
      },
      {
        "paragraph": "“I’m just doing what you did to me before. You used to tease me like this before too, ” Shaun suddenly\nsaid."
      },
      {
        "paragraph": "Catherine was stunned. “You remember the past?”"
      }
    ]
  },
  {
    "title": "Chapter 1292 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“I didn’t forget everything, but… I have some memories from before I fell in love with you. It’s just that\nmany things from after I fell in love with you are hazy, ” Shaun regretfully said the truth."
      },
      {
        "paragraph": "Those memories should have been their best memories, but he lost them."
      },
      {
        "paragraph": "“Cathy, you used to tease me, but now I’ll be teasing you instead, ” Shaun looked at her with a deep\ngaze and said in a low voice."
      },
      {
        "paragraph": "Catherine fell silent. She did not know what to say either, so she simply bowed her head and ate the ice\ncream silently."
      },
      {
        "paragraph": "Shaun started the car."
      },
      {
        "paragraph": "After eating half of the ice cream, Catherine could not finish it."
      },
      {
        "paragraph": "It was a shame to throw it away, so she gave it to the man beside her."
      },
      {
        "paragraph": "Shaun drove with one hand and used the other to finish her leftovers."
      },
      {
        "paragraph": "Catherine thought in her heart that although they were not back together, they had already done\neverything a couple would do."
      },
      {
        "paragraph": "Moreover, she used to be repulsed when she kissed Wesley, but she did not experience anything like\nthat with Shaun. Sometimes, it even felt natural."
      },
      {
        "paragraph": "At times, she felt like a butterfly  trying to fly, but no matter how hard she tried, she could not break free\nof Shaun’s web."
      },
      {
        "paragraph": "At the Hills’ residence, Catherine brought over the crayfish."
      },
      {
        "paragraph": "The two little kids were overjoyed. Catherine peeled the crayfish for Lucas while Shaun peeled it for\nSuzie."
      },
      {
        "paragraph": "Old Madam Hill was old and could not eat it, but she was very happy when she watched the children\neat. “Cathy, it’s so late now. Why don’t you sleep here? Shaun bought you some new clothes and put\nthem in the children’s closet.”"
      },
      {
        "paragraph": "“I…”"
      },
      {
        "paragraph": "Catherine felt embarrassed, but Suzie quickly said, “ Mommy, stay here tonight. I miss you so much. ”"
      },
      {
        "paragraph": "Catherine could no longer say anything."
      },
      {
        "paragraph": "After bathing, she saw Shaun sitting cross-legged on the bed reading a story to the two children."
      },
      {
        "paragraph": "However, Suzie and Lucas disliked his bad storytelling skills. When Lucas saw Catherine come out, he\nimmediately said, “Your storytelling skills are lacking. I want Mommy to read the story instead.”"
      },
      {
        "paragraph": "“Okay, Mommy will read while we listen.” Shaun patted the empty spot next to him."
      },
      {
        "paragraph": "Three pairs of expectant eyes landed on Catherine."
      },
      {
        "paragraph": "She went over and sat down on the bed helplessly. She took the book from Shaun’s hands before\nreading it."
      },
      {
        "paragraph": "The two children listened earnestly. Shaun piped up from  time  to time to make  the  story more\nmoving."
      },
      {
        "paragraph": "The children listened to the stories one after another. Shaun finally said seriously, “It’s late now. Your \nmommy  is tired  today,  so let  her rest early.”"
      },
      {
        "paragraph": "“Scummy dad, you go to sleep too. We’ll sleep with Mommy. ” Lucas looked at him vigilantly. “Don’t\nsneak in to sleep on the floor in the middle of the night and catch a cold.”"
      },
      {
        "paragraph": "“Then don’t make me go out. I’ll sleep on the floor to protect you,” Shaun said fawningly."
      },
      {
        "paragraph": "“Tsk, we don’t need your protection. Don’t think I don’t know that you just want to sleep with Mommy.”\nLucas’ words hit the nail on the head."
      },
      {
        "paragraph": "Catherine pushed Shaun out in embarrassment and locked the door."
      },
      {
        "paragraph": "However, she felt that locking the door would be useless when it came to Shaun."
      },
      {
        "paragraph": "Sure enough, after the children fell asleep, Shaun sneaked in with a blanket in his arms. However, he\nsaw that Catherine was awake on the bed. He felt a bit guilty at being caught."
      },
      {
        "paragraph": "“Cathy, don’t be angry. I’m not planning  to sleep on the bed. I can sleep on the floor. ” Shaun lay down\non the ground."
      },
      {
        "paragraph": "Catherine got up speechlessly and walked over to him. “Give me your hand.”"
      },
      {
        "paragraph": "Shaun lifted his hand obediently."
      },
      {
        "paragraph": "Catherine turned on the desk lamp and took out a bottle of iodine from the bedside table. She applied it\nto the cuts on his fingers."
      },
      {
        "paragraph": "The dim orange light poured on her face and hair. Her little pale face made his heart beat faster."
      },
      {
        "paragraph": "Shaun watched her in silence for a while. After she finished applying the medicine, he reached out and\npulled her into his chest"
      }
    ]
  },
  {
    "title": "Chapter 1293 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "The two of them were only wearing thin pajamas."
      },
      {
        "paragraph": "Catherine’s small face rested on his chest. His body heat seeped through their clothing, making her\nface also slowly warm up."
      },
      {
        "paragraph": "Fortunately, the lights in the room were turned off so her face could not be seen clearly."
      },
      {
        "paragraph": "Shaun’s heart thumped disorderly. He thought she would push him away like before, but she did not."
      },
      {
        "paragraph": "“Cathy…” His throat felt hot and his voice was hoarse."
      },
      {
        "paragraph": "“Mmh.” Catherine looked up with her big and beautiful eyes."
      },
      {
        "paragraph": "Shaun could not hold back anymore and lowered his head for a kiss. He asked, “Where did the\nmedicine come from?”"
      },
      {
        "paragraph": "“I asked for it from Aunty Yasmine.” Her soft voice escaped from between her thin lips."
      },
      {
        "paragraph": "Shaun’s heart felt as soft as cotton candy. “Cathy, I knew that you still cared about me.”"
      },
      {
        "paragraph": "He said and kissed her recklessly again. Catherine was in a trance."
      },
      {
        "paragraph": "Did she still care about him?"
      },
      {
        "paragraph": "When she saw the cuts on his hands earlier, she could not help but ask Aunty Yasmine for the\nmedicine after coming back here."
      },
      {
        "paragraph": "She also knew that he would sneak in at night, so she waited for him here."
      },
      {
        "paragraph": "In the past, she really wanted to completely distance herself from him."
      },
      {
        "paragraph": "However, after her experience with Wesley, she became afraid."
      },
      {
        "paragraph": "She would rather never get married in her life than meet another man again."
      },
      {
        "paragraph": "Maybe she should give him a chance for the sake of the children."
      },
      {
        "paragraph": "However, it would just be that. She would not get remarried."
      },
      {
        "paragraph": "Just as she was distracted by her thoughts, her mouth suddenly started hurting. Shaun looked at her\nwith displeasure. “Why are you being distracted when I’m kissing you?”"
      },
      {
        "paragraph": "Catherine blinked and then pried his hands away from inside her clothes."
      },
      {
        "paragraph": "Shaun chuckled and explained, “I couldn’t help it.”"
      },
      {
        "paragraph": "“Go back to your own room  and sleep,”  Catherine said in a low voice."
      },
      {
        "paragraph": "“No…” Shaun hugged her and kissed her hair again. “Tell me, am I dreaming?”"
      },
      {
        "paragraph": "He had done so many wrong deeds and never expected her to forgive him easily. He was already\nprepared to pester her till the end of time, but he never expected her to lay so meekly in his arms\ntonight."
      },
      {
        "paragraph": "“ Stop messing around and go to sleep.” Catherine raised her eyes with a vague smile. “You won’t be\nat peace if you stay. Think about it. Even if you tease me at night, can you satisfy me?”"
      },
      {
        "paragraph": "“Ahem.” Shaun coughed at the remark, but he had to admit that there was truth in her words. “Cathy,\nyou’re a woman. Isn’t that too crude?”"
      },
      {
        "paragraph": "“I’m telling the truth, ” Catherine said seriously. “ Shaun, with your body’s current state, I can consider\ngetting back together with you for the"
      },
      {
        "paragraph": "sake of the children.”"
      },
      {
        "paragraph": "“Are you… really agreeing to get back together with me?” Shaun was stunned. He felt like he was\ndreaming, and his entire body froze."
      },
      {
        "paragraph": "“So can you go back to sleep now?” Catherine said in a helpless tone. “ But I hope that you’ll restrain\nyourself. After all, I haven’t divorced Wesley yet.”"
      },
      {
        "paragraph": "“Okay, I understand. I promise that I’ll let you divorce Wesley as soon as possible. ” Shaun kissed her\nforehead happily. “Cathy, I love  you.  I  swear that I’ll never make  the  same  mistakes as before. No\none can keep us apart anymore. In the future, I’ll listen to everything you say.”"
      },
      {
        "paragraph": "“I told you to go back to your room and sleep, but you’re not going,” Catherine  poked him in the chest\nand said with a delicate tone."
      },
      {
        "paragraph": "Shaun’s throat bobbed. He really wanted to slap his own mouth."
      },
      {
        "paragraph": "“Okay, I’ll go back and sleep.” A few seconds later, he reluctantly let go of her and went back to the\nbedroom next door with a hint of regret but also delight."
      },
      {
        "paragraph": "Catherine exhaled. Finally, she could get a good night’s sleep."
      }
    ]
  },
  {
    "title": "Chapter 1294 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "Suzie and Lucas were very surprised when they woke up."
      },
      {
        "paragraph": "“ I thought scummy dad would sneak in again after we fell asleep, but he didn’t this time, ” Lucas said in\namazement."
      },
      {
        "paragraph": "Suzie snorted. “The door was locked. How could he get in?”"
      },
      {
        "paragraph": "Lucas laughed dryly. He did not think that the lock was useful against people like his scummy dad."
      },
      {
        "paragraph": "“Okay, sweethearts, go wash your faces and brush your teeth.”"
      },
      {
        "paragraph": "Catherine coaxed the two little rascals to wash up."
      },
      {
        "paragraph": "Downstairs, Shaun was already in the kitchen helping Aunty Yasmine make breakfast."
      },
      {
        "paragraph": "When they were eating breakfast, Old Madam Hill looked at Shaun in the kitchen and said with some\ndisdain, “What’s he doing in the kitchen? His"
      },
      {
        "paragraph": "cooking isn’t good anyway.”"
      },
      {
        "paragraph": "“That’s right. I almost died after eating the pasta he cooked before, ” Old Master Hill also attacked\nbluntly."
      },
      {
        "paragraph": "Suzie and Lucas told Aunty Yasmine directly,  “ Aunty Yasmine, we’ll eat what you made, not what\nscummy dad cooked.”"
      },
      {
        "paragraph": "Catherine only managed to hold back her laughter  by desperately holding it back."
      },
      {
        "paragraph": "Actually, the food cooked by Shaun was not that bad. It was just mediocre, so people would not feel\nlike eating more. When compared to Aunty Yasmine’s food, no one would want to eat his cooking."
      },
      {
        "paragraph": "Aunty Yasmine smiled at the children. “Don’t worry, your dad isn’t cooking for you. He’s only making a\nplate of ravioli that’s full of love.”"
      },
      {
        "paragraph": "At those words, everyone looked at Catherine with ambiguous gazes."
      },
      {
        "paragraph": "Catherine was embarrassed. “It might also be for the children.”"
      },
      {
        "paragraph": "“We won’t eat it.” Lucas and Suzie shook their heads."
      },
      {
        "paragraph": "Just then, Shaun came out with piping hot ravioli. “ Cathy, I made this for you. Try it.”"
      },
      {
        "paragraph": "He put the plate in front of her with an expectant face. There was even a heart-shaped egg on top of\nthe ravioli."
      },
      {
        "paragraph": "Suzie exclaimed. “Why is the egg heart —shaped? It’s my first time seeing this.”"
      },
      {
        "paragraph": "Shaun grinned. “You’ll have someone make it for you when you grow up.”"
      },
      {
        "paragraph": "Suzie was confused. “Why do I have to grow up first?”"
      },
      {
        "paragraph": "Old Madam Hill chuckled. “You’re too young to understand.”"
      },
      {
        "paragraph": "However, Lucas frowned and looked at Shaun silently."
      },
      {
        "paragraph": "“Cathy, eat it while it’s hot.” Shaun blew the food.  “ I got up early in the morning to make this.”"
      },
      {
        "paragraph": "“ I can testify, ” Aunty Yasmine said quickly, “He’s been in the kitchen for an hour.”"
      },
      {
        "paragraph": "Faced with the Hill family’s eyes, Catherine could only buckle up and try the food. The taste was\nneither good nor bad, but she still preferred to eat the breakfast made by Aunty Yasmine."
      },
      {
        "paragraph": "However, after eating Shaun’s ravioli, she was full."
      },
      {
        "paragraph": "“It’s good, right?” Shaun smiled. “ I’ll make more for you if you come tomorrow.”"
      },
      {
        "paragraph": "Lea snickered. “If you say that, maybe she won’ t dare to come anymore.”"
      },
      {
        "paragraph": "“Mom…” Shaun glared at her in displeasure."
      },
      {
        "paragraph": "“You’re too confident in your cooking, ” Lea spat at him, “I gave birth to you and your cooking skills are\nthe same as mine. We’re both unskilled.”"
      },
      {
        "paragraph": "“Don’t compare me to you.” Shaun counter- attacked and turned back to Catherine. “Cathy, ignore her.”"
      },
      {
        "paragraph": "Catherine took a sip of soy milk to calm herself down. “ It’s the thought that matters, but I’ll eat Aunty"
      },
      {
        "paragraph": "Yasmine’s breakfast next time. You don’t need to work so hard.”"
      }
    ]
  },
  {
    "title": "Chapter 1295 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "After Catherine and Shaun left."
      },
      {
        "paragraph": "Old Madam Hill sighed happily. “Something good is finally happening to the Hill family.”"
      },
      {
        "paragraph": "“Great-grandma, what are you talking about?” Suzie asked curiously."
      },
      {
        "paragraph": "Old Madam Hill stroked her head. “ Oh, little one. Couldn’t you tell? Your mom and dad have made up."
      },
      {
        "paragraph": "Suzie was confused. “They did?”"
      },
      {
        "paragraph": "Lucas gave her a disdainful look. “Mommy said that she would eat Aunty Yasmine’s breakfast next\ntime. She wouldn’t have said that in the past.”"
      },
      {
        "paragraph": "Only then did Suzie understand. She was a little happy but also felt slightly complicated. “Then…\nMommy will live with us in the future, right?”"
      },
      {
        "paragraph": "“Yes, but not now.” Old Madam Hill let out a long sigh.  She hoped  that Wesley would end the marriage\nsooner than later."
      },
      {
        "paragraph": "The sports car drove to the parking lot."
      },
      {
        "paragraph": "Catherine unfastened her seatbelt. Shaun handed her a business card with the name of a lawyer, Lilian\nGrant."
      },
      {
        "paragraph": "“She’s my junior,” Shaun explained, “She specializes in divorce cases. She’s pretty good.”"
      },
      {
        "paragraph": "“How good?” Catherine asked curiously."
      },
      {
        "paragraph": "“Well… she’s never lost before.” Shaun smiled. “ Many people want her to take on their divorce cases,\nbut you’re my woman, so you can look for her at any time.”"
      },
      {
        "paragraph": "“Okay.” Catherine took the business card and got out of the car."
      },
      {
        "paragraph": "Shaun pulled her, reluctant to part with her. “ Cathy, are you leaving just like that? Won’t you kiss me\nfirst?”"
      },
      {
        "paragraph": "Catherine turned back to him and said in amusement, “Do you know what you look like right now? You\nlook like Suzie when she asks me for sweets.”"
      },
      {
        "paragraph": "Shaun pouted. “Then… give me some candy, President Jones.”"
      },
      {
        "paragraph": "Catherine really admired his shamelessness and endured the spreading heat on her face to lean over\nand give him a kiss."
      },
      {
        "paragraph": "However, Shaun was not satisfied and hugged her, kissing her deeply for a long time before releasing\nher."
      },
      {
        "paragraph": "When Catherine went to the office, she took out the business card and dialed the number on it. “Hello,\nMiss Grant? I was introduced by Shaun Hill…”"
      },
      {
        "paragraph": "“You must be Miss Catherine Jones.” Lilian Grant smiled. “Shaun mentioned it to me. The whole\ncountry knows about your case.”"
      },
      {
        "paragraph": "“Where is your firm located? Can we meet?” Catherine asked politely."
      },
      {
        "paragraph": "“Of course.”"
      },
      {
        "paragraph": "Catherine made an appointment with Lilian."
      },
      {
        "paragraph": "At 2:00 p.m., they met in a coffee shop."
      },
      {
        "paragraph": "Catherine saw Lilian, who was dressed in a black professional suit. She looked gallant like a strong\ncareer woman."
      },
      {
        "paragraph": "Lilian smiled when she saw Catherine. “Shaun called me earlier and asked me to make sure you and"
      },
      {
        "paragraph": "Wesley Lyons get divorced in the shortest time possible. ”"
      }
    ]
  },

  {
    "title": "Chapter 1296 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine smiled. “I didn’t know Shaun knew such a powerful divorce lawyer.”"
      },
      {
        "paragraph": "“I didn’t have a choice. If I didn’t specialize in divorce lawsuits, I’d go against Shaun. I don’t want to go\nagainst him in court. I’d definitely lose.” Lilian shrugged. “What’s the situation with Wesley now?”"
      },
      {
        "paragraph": "“I’m guessing he won’t agree to divorce me so easily. He probably hates me very much now.”"
      },
      {
        "paragraph": "Catherine said, “We’ll have to talk about it. If it fails, then we’ll turn to the law.”"
      },
      {
        "paragraph": "“Okay, l’ll go with you.” Lilian nodded."
      },
      {
        "paragraph": "After that, Catherine and Lilian went straight to Golden Corporation. Logan and Austin followed to\nprotect her."
      },
      {
        "paragraph": "Wesley soon met her."
      },
      {
        "paragraph": "This was the first time Catherine and Wesley met after that night."
      },
      {
        "paragraph": "Nowadays, Wesley was no longer in hiding. His handsome face was full of gloom, and he looked at"
      },
      {
        "paragraph": "Catherine from across the desk with a cold smile on"
      },
      {
        "paragraph": "his lips. “Cathy, you’re very capable. You even encouraged Chester to go against me.”"
      },
      {
        "paragraph": "Catherine frowned. “Are you talking about the fact you lied about losing your kidney?”"
      },
      {
        "paragraph": "“Stop acting. The Jewell family recently warned many hospitals in the country, telling them to prohibit\nmedicine from Golden Corporation,” Wesley sneered brashly. “Do you think that you can beat me like\nthis?”"
      },
      {
        "paragraph": "Catherine was stunned. She really did not know about it. It seemed like Shaun had gone behind her\nback to talk to Chester."
      },
      {
        "paragraph": "Wesley saw her fall silent and took it as an admission. He gritted his teeth and cursed, “You b* tch! I\nheard you’ve been sleeping at Shaun’s place every day, you cheating couple.”"
      },
      {
        "paragraph": "Catherine found his words particularly harsh, but Lilian spoke before she could. “Everyone knows that\nyou’re fooling around with your own secretary. What right do you have to accuse others?”"
      },
      {
        "paragraph": "“Who do you think you are? How dare you speak in front of me?” Wesley looked at her unpleasantly."
      },
      {
        "paragraph": "“I’m the lawyer representing Miss Jones.” Lilian handed out her business card. “We’re here today to\ntalk about your divorce.”"
      },
      {
        "paragraph": "“Divorce?” Wesley sneered. “Dream on! I’ll never divorce you.”"
      },
      {
        "paragraph": "Lilian said faintly, “If you disagree, we’ll have to appeal. Both parties in this marriage have been\ndisloyal. You’ve cheated many times and even committed domestic violence. The judge will agree to\nyour divorce. Fortunately, you didn’t purchase"
      },
      {
        "paragraph": "any common property during your marriage, so there’ll be no disputes of interest. Miss Jones doesn’t\nwant a penny from you. She just wants to end this embarrassing marriage with you as soon as\npossible.”"
      },
      {
        "paragraph": "“Wow, it looks like you came prepared. ” Wesley’s eyes changed slightly as a trace of anger and\nunwillingness flashed in them. “Catherine Jones, you played with my feelings. You can dream on if you\nthink you can just throw me away like this.”"
      },
      {
        "paragraph": "“You’re insane.”"
      },
      {
        "paragraph": "Catherine could not bear it anymore. “ I don’t even know how I provoked you. I rejected you before, but\nit was you who deceived me using despicable means, saying that you lost a kidney. Now, you’re\nblaming me for playing with your feelings? I never even blamed you for deliberately deceiving me. How\nshameless can you be?”"
      },
      {
        "paragraph": "“So what if I’m shameless?”"
      },
      {
        "paragraph": "Wesley smiled at her vaguely with his thin lips. He looked extremely shameless. “Which part of me\ncan’t compare to Shaun Hill? He betrayed you and deceived you time and again, but you still want to\nbe with him. Catherine, you’re just a b*tch who doesn’t know what’s good for yourself.”"
      },
      {
        "paragraph": "“Watch your mouth,” Logan warned coldly."
      },
      {
        "paragraph": "Austin also scolded, “You’re just a piece of sh*t! You’re a disgrace to men.”"
      },
      {
        "paragraph": "Wesley seemed not to hear them and smiled darkly. “I’ll never sign the papers. If you want to go to\ncourt, then go ahead.”"
      },
      {
        "paragraph": "He stood up slowly and looked at Lilian before laughing again. “You’re her divorce lawyer, right? Let me\nask you, are you sure you want to go against me for her? Don’t regret it.”"
      },
      {
        "paragraph": "Then, he tore up Lilian’s business card directly. The smile in his eyes made people shudder. “Wait and\nsee.”"
      },
      {
        "paragraph": "Catherine felt her heart ache at his arrogant attitude. “Wesley, we’ll all be happier if you just sign it. You\ncan play with whatever woman you want. Why do you have to pester me? Because I didn’t fall in love\nwith you? Tell me, how am I supposed to fall in love with you when you’ve always been scheming\nagainst me?”"
      },
      {
        "paragraph": "“Cathy, my reputation is ruined because of you. Do you think I’m stupid enough to divorce just because\nyou tell me to? But it’s okay, at least I don’t have to pretend now.”"
      }
    ]
  },
  {
    "title": "Chapter 1297 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Wesley grinned and said, “Just wait. I’ll slowly play you to death and make your life worse than death. ”"
      },
      {
        "paragraph": "“Sure, I want to see how you intend to play this game.”"
      },
      {
        "paragraph": "Catherine was so furious that she left."
      },
      {
        "paragraph": "As she walked, her arms shook from anger."
      },
      {
        "paragraph": "She knew that Wesley was shameless, but he was also incredibly arrogant."
      },
      {
        "paragraph": "He had no sense of shame at all. How could there be such a man?"
      },
      {
        "paragraph": "Lilian frowned and said, “I’ve encountered many people in divorce cases, but Wesley gives me the\nimpression that he’s extremely selfish and distorted. People like him are the most challenging.”"
      },
      {
        "paragraph": "Catherine became worried at her words and fell silent for a moment. “Miss Grant, to tell you the truth,\nWesley is terrifying. He threatened you earlier. There are some things that he will really do."
      },
      {
        "paragraph": "It’s okay if you don’t want to take on this lawsuit…” “Miss Jones,  I’ve seen  too many people  like him.”"
      },
      {
        "paragraph": "Lilian interrupted her, “Why am I a divorce lawyer? The main reason is that I think that nowadays,\nwomen often encounter a lot of injustice in marriage. I only hope that I can help some victims of\nmarriage quickly escape. If I back out because of a little threat, then I don’ t deserve to be a lawyer. ”"
      },
      {
        "paragraph": "Catherine said with admiration, “Thank you. I’ll get someone to secretly protect you. If you don’t want \nto take on the case, you can tell me anytime.”"
      },
      {
        "paragraph": "“Sure.”"
      },
      {
        "paragraph": "After Lilian left, Catherine said to Austin, “Protect Miss Grant in secret these days.”"
      },
      {
        "paragraph": "Austin nodded, but he was still not at ease. “Miss, what do you think Wesley is up to? His reputation is\nin tatters yet he still dares to be so arrogant.”"
      },
      {
        "paragraph": "“The Campos family must be behind him.” Logan sighed. “If only someone can pull the Campos family\ndown.”"
      },
      {
        "paragraph": "Catherine fell silent."
      },
      {
        "paragraph": "Wesley was not a dumb person. Golden Corporation was not in good condition, but he still dared to talk\nviciously to her. She felt that Wesley must be planning something terrible behind her back."
      },
      {
        "paragraph": "After returning to the office, Shaun quickly called her. “I heard from Lilian that Wesley used a lot of\nnasty words to scold you today. Are you okay?”"
      },
      {
        "paragraph": "“I’m fine…” Catherine replied vaguely."
      },
      {
        "paragraph": "“Don’t lie to me. Lilian said that you were shaking with anger, ” Shaun comforted softly. “Don’t take"
      },
      {
        "paragraph": "Wesley’s words seriously. I’ll handle the big issues. I’ll also get someone to secretly protect Lilian.”"
      },
      {
        "paragraph": "Catherine smiled bitterly and said the truth, “You can’t even protect yourself now.”"
      },
      {
        "paragraph": "“You don’t believe me?” Shaun said a little bitterly, “Am I that incompetent in your eyes?”"
      },
      {
        "paragraph": "Catherine fell silent."
      },
      {
        "paragraph": "Now that the number one corporation in the country, Hill Corporation, had fallen to this state, she did\nnot know how to comment in a way that would not hurt his self-confidence."
      },
      {
        "paragraph": "Shaun said gloomily, “Say something.” “Well… Even though there was a traitor in Hill Corporation, you\nstill hold the most responsibility a s the person in charge, ” Catherine said faintly, “ Especially Yael, who\nwas clearly not trustworthy. But you never doubted her.”"
      },
      {
        "paragraph": "“Okay, okay, I know that I was blind before.” Shaun sighed. “When do you get off work? I’ll take you\nsomewhere to meet someone.”"
      },
      {
        "paragraph": "“It’s a secret.” Shaun kept her on tenterhooks. “… Okay.” Catherine hesitated but still agreed."
      }
    ]
  },
  {
    "title": "Chapter 1298 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "On the other side, Shaun hung up the phone and walked into the hospital building with his long legs."
      },
      {
        "paragraph": "He went directly to the andrology doctor introduced by Chester."
      },
      {
        "paragraph": "After a series of examinations, he came out with a dark expression."
      },
      {
        "paragraph": "Chester just so happened to pass by and smiled at him. “How did it go?”"
      },
      {
        "paragraph": "Shaun glared at him sullenly. “The andrology doctors in your hospital are useless.”"
      },
      {
        "paragraph": "“He’s already the top andrology doctor in the country.” Chester looked at him with great sympathy. “Don’t\nrush things. Take your time.”"
      },
      {
        "paragraph": "Shaun’s throat squeezed out a depressed voice, “I wasn’t in a hurry before because I didn’t have a\nchance, but I’m in a hurry now.”"
      },
      {
        "paragraph": "He remembered what Catherine had told him last night. He could not tease her, nor could he satisfy her."
      },
      {
        "paragraph": "When he kissed Catherine now, he had to be cautious and restrained."
      },
      {
        "paragraph": "Chester looked at him meaningfully and smiled. “ You got back together?”"
      },
      {
        "paragraph": "“Yeah, ” Shaun answered in a low voice."
      },
      {
        "paragraph": "Chester glanced at his legs with a vague smile. “ True love is pretty amazing. She’s willing to accept\neven a man like you.”"
      },
      {
        "paragraph": "“Are you envious of me or deriding me?” Shaun gritted his teeth."
      },
      {
        "paragraph": "“Half of each, ” Chester chuckled and told the truth. Shaun sneered and gave him the death glare."
      },

      {
        "paragraph": "“Fine, fine. Don’t say that I don’t care about you. This is a gift for you.” Chester looked around before\ntaking something out of his pocket."
      },
      {
        "paragraph": "Shaun curiously reached out to take it. After taking it, his expression instantly changed. “Chester Jewell,\nare you seeking death?”"
      },
      {
        "paragraph": "“No need to thank me.” Chester winked at him mischievously. “Sometimes, women are the same as men.\nIf you leave her waiting for too long, she might regret it and not want you anymore.”"
      },
      {
        "paragraph": "“Don’t compare her with those women you used to Shaun stood there stiffly and gritted his teeth."
      },
      {
        "paragraph": "“Whatever. I’ve given it to you, so it’s up to you if you want to keep it or not.” Chester shrugged. “ Let’s go\nvisit Rodney. He’s too pitiful. No one has come to see him these last two days.”"
      },
      {
        "paragraph": "After all, they were practically brothers. Even though they had fought, Shaun still thought of Rodney as\nhis friend."
      },
      {
        "paragraph": "When they reached Rodney’s ward, they pushed open the door to see Rodney reaching for the bedpan\nunder the bed in pain. However, no one was helping him, so he could not reach it."
      },
      {
        "paragraph": "“Where’s the nurse?” Chester helped him."
      },
      {
        "paragraph": "“She went out to take a call. Besides, she’s already so old, so I don’t want her to help me.” Rodney\nturned his head to the side. His expression turned unpleasant when he saw Shaun standing there. “ Why\nare you here?”"
      },
      {
        "paragraph": "“To see you make a fool of yourself. ” Shaun’s thin lips seem to spit out poisonous words. “Where’s\nSarah? Why don’t you let her take care of you? A simple, kind, and lovely girl like her shouldn’t have the\nheart to ignore you while you’re injured, right?”"
      },
      {
        "paragraph": "Rodney’s pale face instantly became paler. “Shaun Hill, enough. You’re here to laugh at me, aren’t you?”"
      },
      {
        "paragraph": "“Yeah.” Shaun nodded."
      },
      {
        "paragraph": "Rodney almost wanted to vomit out blood. “Get out. I’m cutting ties with you.”"
      },
      {
        "paragraph": "Shaun said faintly, “Haven’t we already cut ties? Because of Sarah.”"
      },
      {
        "paragraph": "Rodney’s face became even more uncomfortable at those words."
      },
      {
        "paragraph": "For a woman like Sarah, he lost his family, his baby, and his best friend."
      },
      {
        "paragraph": "Damn it! Shaun was just here to make things worse."
      }
    ]
  },
  {
    "title": "Chapter 1299 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Alright, stop provoking him. He’s not feeling well either.”"
      },
      {
        "paragraph": "Chester saw Rodney’s discouraged and depressed appearance and helped him out. “Besides, you were\ntricked by Sarah for more than ten years."
      },
      {
        "paragraph": "Fortunately, Rodney hasn’t spent any money on Sarah.”"
      },
      {
        "paragraph": "Shaun’s cold eyes swept over. Was Chester helping him or standing with Rodney?"
      },
      {
        "paragraph": "Chester smiled and shrugged."
      },
      {
        "paragraph": "Rodney suddenly looked up and said emotionally, “ Chester, your words have comforted me. Even\nthough my feelings and heart were deceived, at"
      },
      {
        "paragraph": "least I still have my money. These days, I couldn’t figure it out and felt that it was meaningless to\ncontinue living. But now I suddenly feel that I’m lucky compared to some people. I should be satisfied.”"
      },
      {
        "paragraph": "“It’s good that you think that way.” Chester sighed."
      },
      {
        "paragraph": "“If we really think about it, the three of us were fools. We were played like fiddles by Sarah.”"
      },
      {
        "paragraph": "“Yeah.” Rodney looked down bitterly. “To her, I’m just a backup guy. Tell me, am I… very useless? I feel\nlike Sarah looks down on me.”"
      },
      {
        "paragraph": "“Of course, she looks down on you?” Shaun sneered, “She’s vain and loves power. How much do you\nthink she liked me before? Also… what you’ve seen of Sarah is just the tip of the iceberg.”"
      },
      {
        "paragraph": "“What does that mean?” Rodney was a little puzzled."
      },

      {
        "paragraph": "Shaun looked at him. “Cathy told me she sent someone to track Lucifer before and they saw Lucifer\nbeing assassinated by the people from Neah Bay with their own eyes. The Neah Bay assassins in the\ncapital only listen to the Campos family and Wesley, but they don’t know Lucifer at all. Why did they kill\nhim? It’s very simple. The one who wanted to kill Lucifer was Sarah. Sarah definitely has some relations\nwith the Campos family or Wesley.”"
      },
      {
        "paragraph": "Rodney was stupefied. “But… But Sarah said she was threatened by Lucifer and his death had nothing\nto do with her.”"
      },
      {
        "paragraph": "“You still believe what she says?” Shaun said with a mocking expression."
      },
      {
        "paragraph": "Rodney’s heart sank."
      },
      {
        "paragraph": "Of course, he did not believe it. The thought that Sarah might be connected to the Campos family or\nWesley gave him the creeps."
      },
      {
        "paragraph": "After all, Mason had deliberately stolen Hill Corporation’s microchip data, while Wesley’s ugly colors\nwere recently exposed."
      },
      {
        "paragraph": "Those people were sc*mbags with no moral boundaries."
      },
      {
        "paragraph": "Shaun reminded faintly, “If Sarah’s backer abandons her one day and you regain an important position in\nthe Snow family, Sarah will probably come back to you. You had best have some awareness and stay\naway from that woman. If you can’t do that, then don’t go after Freya.”"
      },
      {
        "paragraph": "Rodney muttered, “I’m not a fool…” “You are a fool, ” Shaun said firmly."
      },
      {
        "paragraph": "Rodney was so angry that his bottom hurt again. “ Shaun Hill, will you die if you don’t provoke me?!”"
      },
      {
        "paragraph": "Shaun’s expression remained unchanged. “Freya is Cathy’s good friend. It wasn’t easy for me to get\nback together with Cathy, so I don’t want your"
      },
      {
        "paragraph": "matter with Freya to affect my relationship with Cathy. ”"
      }
    ]
  }
]