[


  {
    "title": "Chapter 1500 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya was stupefied."
      },
      {
        "paragraph": "She gawked at Rodney in front of her. His pretty face turned slightly red and he looked a little\nembarrassed. For some reason, she found that he was slightly… cute…?"
      },
      {
        "paragraph": "Rodney scoffed and pretended that he was still high and mighty as though he was a haughty peacock.\n“"
      },
      {
        "paragraph": "Since we’re married now, I can’t get another woman to solve my needs. Even if you agree, I can’t do it.”"
      },
      {
        "paragraph": "“Oh.”"
      },
      {
        "paragraph": "Freya suddenly did not know what to say. It was probably because she did not expect him to be so\naware. “You’re not saying that just to look good in front of me, are you?”"
      },
      {
        "paragraph": "Rodney, who was being questioned again, glared at her. “I’m serious. I’m also serious about this\nrelationship. Freya, I’ve never thought about divorcing you after getting married.”"
      },
      {
        "paragraph": "“What?” Freya was stunned. “ Didn’t we agree to wait until after your uncle became prime minister."
      },
      {
        "paragraph": "“I’ll tell you the truth. Since we’re married, I’m prepared to give my child a complete family."
      },
      {
        "paragraph": "Although we fight all the time, I don’t hate you. Yes, I made many mistakes before, but from start till the\nend, I belong to you. I want to carry on with this marriage, so don’t think about getting a divorce. It’s\nimpossible.”"
      },
      {
        "paragraph": "Rodney waved his hand, looking nonchalant."
      },
      {
        "paragraph": "Freya was outraged by his shamelessness. “Did you forget the agreement we signed before the\nmarriage?”"
      },
      {
        "paragraph": "“Was there a stamp? Is there a legal effect?” Rodney asked with a grin."
      },
      {
        "paragraph": "“You’re still a president. How shameless can you be?” Freya could not bear it."
      },
      {
        "paragraph": "“This is the only time in my life that I’m being shameless. What are you going to do about it?” Rodney\nraised his delicate brows. When he saw her furious expression, he shoved his hands in his pockets\nsmugly and went downstairs."
      },
      {
        "paragraph": "Freya had the impulse to kick him from behind and let him fall down the stairs."
      },
      {
        "paragraph": "She took a deep breath. Forget it. Now was not the time to be angry."
      },
      {
        "paragraph": "The most important thing now was to find Patrick."
      },
      {
        "paragraph": "That afternoon, she left the villa in her car. When she reached the area near Jackson Corporation, she\ncalled Patrick. “I’m downstairs at your company. Can we talk?”"
      },
      {
        "paragraph": "“Freya, haven’t you hurt me enough? What else do you want?” Patrick’s voice was cold as ice. “You’re\npregnant now. Do you want your husband to beat me up again?”"
      },
      {
        "paragraph": "“Patrick, this is the last time I’ll look for you,” Freya lowered her voice and said with sorrow, “ Don’t\nworry, I’m not looking for trouble. I just want to clear up some things from the past.”"
      },
      {
        "paragraph": "“… Fine.”"
      },
      {
        "paragraph": "Maybe it was because she mentioned the past and she had not spoken to him in that tone for a long\ntime, Patrick’s heart was deeply moved."
      },
      {
        "paragraph": "Freya was stunned. She did not expect Patrick to agree so quickly."
      },
      {
        "paragraph": "After hanging up the phone, she immediately called Catherine. “Patrick agreed to meet me. What\nshould I say?”"
      },
      {
        "paragraph": "“Don’t scold him as soon as you see him. Talk about the time you two spent together during university\nand tell him the real reason why you married Rodney. Make him feel guilty, ” Catherine instructed her\nlike a military advisor."
      },
      {
        "paragraph": "“Is that a good idea? It’ll be troublesome if he tells the media.” Freya hesitated."
      },
      {
        "paragraph": "“That’s why you have to make him feel guilty. If he feels guilty, he won’t say anything. Instead, he’ll feel\nindebted to you, ” Catherine said with a smile."
      }
    ]
  },
  {
    "title": "Chapter 1501 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“I hope everything will go according to your plan. ” Freya sighed."
      },
      {
        "paragraph": "“Freya, when it comes to people like Patrick, rather than preaching to him about reason, it’s better to\njust shed a few tears. This is why you lost to Linda and why you haven’t gotten back at her yet."
      },
      {
        "paragraph": "Freya was extremely depressed."
      },
      {
        "paragraph": "Although Catherine was right, she still found the truth a little hard to accept."
      },
      {
        "paragraph": "It seemed years of hard work and effort could not compare to a few tears."
      },
      {
        "paragraph": "Before long, Patrick appeared in her field of vision."
      },
      {
        "paragraph": "It was obvious that his previous time in prison had dealt a blow to him. He had lost a lot of weight and\nhis shirt looked loose. He used to look handsome and gentle, but now, he looked dejected and gloomy."
      },
      {
        "paragraph": "This Patrick was not the elegant and graceful young man Freya used to love."
      },
      {
        "paragraph": "She sighed in her heart and drove the car over. She wound down the window. “Get in. Let’s find a place\nto talk.”"
      },
      {
        "paragraph": "Patrick sat in the car and looked at her coldly. She was wearing a long purple dress today. He did not\nthink much about it before, but now when he thought about it, it seemed that she had worn looser\nclothes the previous two times they met."
      },
      {
        "paragraph": "She… really was pregnant."
      },
      {
        "paragraph": "Even as she sat there, he could see the small bulge of her belly."
      },
      {
        "paragraph": "However, her skin was as fair as before. People said that pregnant women would gradually become"
      },
      {
        "paragraph": "ugly, but she was an exception. Her face had become slightly rounder, making her look even more\nlovely."
      },
      {
        "paragraph": "At that moment, Patrick’s mood was complicated. He even felt a hint of pain."
      },
      {
        "paragraph": "When he was in prison, the only thoughts that filled his mind were ‘she’s pregnant’ and ‘she’s married’."
      },
      {
        "paragraph": "This woman, whom he once thought would be his wife, belonged to someone else now."
      },
      {
        "paragraph": "“Mrs. Snow, you’re already married yet you came to look for me. Does your husband know about this?”\nPatrick said sarcastically, “I don’t want to be targeted by the Snow family again. I can’t afford to.”"
      },
      {
        "paragraph": "Freya’s anger was almost ignited by his tone."
      },
      {
        "paragraph": "Even after spending a month in jail, Patrick still did not realize where he had gone wrong."
      },
      {
        "paragraph": "However, upon remembering Catherine’s words, she took a deep breath and forced her eyes to\nredden. “Fine, it was all my fault. I was the one who asked you to discredit the future prime minister. I\nwas the one who told you to collude with the future prime minister’s opponents. It was also me who told\nyou to post the video online to try to discredit the Snow family. Are you happy now?”"
      },
      {
        "paragraph": "Patrick was instantly rendered speechless. He opened his mouth, but when he saw her red eyes, his\nbody froze. “You…”"
      },
      {
        "paragraph": "“Patrick, why do we have to quarrel every time we meet?”"
      },
      {
        "paragraph": "Freya pinched her leg hard, causing tears to well in her eyes. “Do you know how much I was scolded\nby others when you posted the video online? Even in the Snow family, I almost became a sinner. Do\nyou know that if you had succeeded in bringing down"
      },
      {
        "paragraph": "the Snow family, I would’ve met a terrible end? We dated for a few years, but you… You never\nconsidered what would happen to me. Have you… ever loved me?”"
      },
      {
        "paragraph": "Patrick’s throat tightened when he saw her tears. “ What about you? Have you ever loved me? If you\nhave, why did you have to force Jackson Corporation like that? You know how much I care about\nJackson Corporation.”"
      },
      {
        "paragraph": "“It’s because I hate Linda. Why? Why did the two of you get together? You could’ve been with anyone\nelse, but I hate her. If it weren’t because of her, we wouldn’t have separated.”"
      }
    ]
  },
  {
    "title": "Chapter 1502 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya yelled. Coupled with the tears in her eyes, Patrick’s heart suddenly tightened."
      },
      {
        "paragraph": "“Freya, since you still care about me, why didn’ t you get back together with me when I went to you\nback then? If we got back together, we wouldn’t have ended up like this.”"
      },
      {
        "paragraph": "Patrick’s heart ached. How could he not have any regrets about their relationship?"
      },
      {
        "paragraph": "Yes, he was dating Linda, but it was not the same as when he was dating Freya."
      },
      {
        "paragraph": "He only agreed to date Linda because she had done too much for him, and because he knew that it\nwas impossible for Freya and him to be together anymore."
      },
      {
        "paragraph": "“Because I really couldn’t stand how you and Linda were always together. You’d spend more time with\nher than with me. I felt like you didn’t love me.”"
      },
      {
        "paragraph": "Freya lowered her head and told the truth. “If she were your real sister, then I’d have nothing to say, but\nshe isn’t. I can only support two people in a relationship, including myself. Later, I moved to Canberra\nbecause I wanted to slowly forget about you and start afresh, but… I met Thomas Neeson. ”"
      },
      {
        "paragraph": "Patrick shook."
      },
      {
        "paragraph": "Thomas’ name was still fresh in his memory. Four years ago, news of Freya being assaulted by\nThomas became sensational. There were even photos of her being sent to the hospital. Then, Thomas\nstepped forward and said that she had seduced him…”"
      },
      {
        "paragraph": "“At that time, Thomas pursued me but I couldn’t accept a scumbag like him. After multiple rejections,\nhe got angry and brought people over to break into my home. He beat me up and assaulted me…”"
      },
      {
        "paragraph": "“Freya…” Patrick clenched his fist."
      },
      {
        "paragraph": "Freya continued, “Fortunately, someone saved me i n time so he didn’t succeed, but I was severely\ninjured and sent to the hospital. Later, I reported the case to the police but Thomas was rich and\npowerful, so he slandered me instead. At that time, I had no power or influence. I was like a rat hated\nby everyone. I was clearly the victim, but I was scolded everywhere I went. In the end, I had to go\nabroad to escape."
      },
      {
        "paragraph": "“In fact, I didn’t have a good time when I first went"
      },
      {
        "paragraph": "abroad. I often thought of you. Back then, I wondered if you would send me a message or give m e a\ncall, but… there was nothing. At that time, I had also imagined that if you were to come looking for me\nwhen I was at my most helpless, I’d definitely get back together with you. Because I felt that even if\nothers didn’t believe me because they didn’t know me, you’d definitely believe me.”"
      },
      {
        "paragraph": "Freya smiled bitterly. What she said was the truth."
      },
      {
        "paragraph": "At that time, she really had fantasized about it. In the end, he never appeared."
      },
      {
        "paragraph": "Patrick’s handsome face burned in embarrassment."
      },
      {
        "paragraph": "He originally did not believe it, but then Linda said that she heard from the social circles in Melbourne\nthat this incident was true. It was said the Lynch family wanted to use the Neeson family to develop\ntheir business in the capital."
      },
      {
        "paragraph": "He believed it because Linda was the one who said it. At that time, he had been very disappointed and\nsad."
      },
      {
        "paragraph": "Once, he even got drunk because of it and accidentally slept with Linda…"
      },
      {
        "paragraph": "“I didn’t expect to see you and Linda together when I came back. I was even ridiculed by you.” Freya\nlooked at him with reddened eyes."
      },
      {
        "paragraph": "“Freya, I’m sorry.” Patrick was in agony."
      },
      {
        "paragraph": "Freya was stunned. Even after such a long time had passed, he had never apologized to her before."
      },
      {
        "paragraph": "It seemed like Catherine was right. Simply shedding a few tears was more effective than trying to\nreason with him."
      },
      {
        "paragraph": "If she did not cry, he would never believe her. The moment she cried, he believed her."
      },
      {
        "paragraph": "Hah."
      }
    ]
  },
  {
    "title": "Chapter 1503 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Don’t feel sorry. You have your own life.” Freya touched her belly. “Just like me now. I’m the\ngoddaughter of the future prime minister and the wife of Rodney Snow, but you should know that he\ndoesn’t love me.”"
      },
      {
        "paragraph": "Patrick’s eyes trembled. “Freya, are you… not doing well?”"
      },
      {
        "paragraph": "“Do you know how I became the goddaughter of the Snow family?”"
      },
      {
        "paragraph": "Freya looked at him. “After coming back, Osher Corporation held a banquet for a new product launch.\nThomas spiked my drink, and Rodney was drunk that night, so we ended up sleeping together after an\nunexpected turn of events. The Snow family didn’t want to let Rodney marry Sarah, so they deliberately\nmade a big deal out of that night and tried to make him take responsibility. They even switched out my\nbirth control pills."
      },
      {
        "paragraph": "“However, Rodney still refused to marry me and I later found out that I was pregnant. Then, the Snow\nfamily said that if I don’t give birth to the child,"
      },
      {
        "paragraph": "they’ll go after Lynch Corporation. But if I agree to give birth to the baby, I can be Nathan’s\ngoddaughter. I didn’t have a choice at all.”"
      },
      {
        "paragraph": "“The Snow family is despicable.” Patrick did not expect that so many unfair incidents would happen to\nher."
      },
      {
        "paragraph": "“Despicable?” Freya smiled bitterly. “I’m the prime minister’s goddaughter. Who wouldn’t be envious?”"
      },
      {
        "paragraph": "“But I know that you never wanted any of this, ” Patrick said in a low voice, “Then… how did you marry\nRodney?”"
      },
      {
        "paragraph": "“ It’s because Rodney was abandoned by Sarah and you posted that video online.” Freya looked at\nhim. “If a husband beat someone up because they hit his pregnant wife, won’t the netizens be more\nempathetic?”"
      },
      {
        "paragraph": "Patrick’s handsome face immediately turned pale."
      },
      {
        "paragraph": "It turned out that in the end, it was his actions that caused Freya to marry Rodney."
      },
      {
        "paragraph": "“Patrick, I really didn’t bully Linda that day. It was Linda who ran over and kneeled in front of me. I\nwanted to ignore her, but she refused to let me go. When you arrived, you thought that I forced her to\nkneel and hit me without saying a word.” Freya held her cheek and smiled mournfully."
      },
      {
        "paragraph": "“Freya, I’m sorry. It was… It was because you hit Linda four years ago, so I thought…” Patrick was at a\nloss."
      },
      {
        "paragraph": "“I hit her four years ago because she colluded with Rebecca to frame Cathy. There were many things\nthat happened, but you never believed me when I tried to explain them to you. You might not believe\nme now either, but let me ask you, who was the one who saved you this time?” Freya suddenly asked."
      },
      {
        "paragraph": "Patrick was stunned. “It was Linda. She said she has a friend who knows people from the executive\ncouncil…”"
      },
      {
        "paragraph": "“If my guess is correct, that person should be Rebecca Jones.”"
      },
      {
        "paragraph": "Freya said, “We could’ve caught Rebecca that year. She underwent cosmetic surgery. Do you\nremember when you met me in the hospital four years ago? I was doing a DNA test for Rebecca and\nJeffery, but because someone tipped Rebecca off, she managed to escape ahead of time. It even\nresulted in the death of my friend. That’s why I went to your company to find Linda.”"
      },
      {
        "paragraph": "Patrick was at a loss. He knew that Rebecca was a bad person, but how was she related to Linda? “\nFreya, is there some sort of misunderstanding?"
      },
      {
        "paragraph": "Linda doesn’t know Rebecca at all. Besides, how could Rebecca have the ability to save me?”"
      },
      {
        "paragraph": "“Rebecca isn’t who she used to be. I suspect that she appeared again to get revenge on Cathy and\nme. Of course, you can choose not to believe me, but you’ll find out for yourself if you keep a closer\neye on Linda.” Freya lowered her eyes and said, “I won’t say anything else, lest you think that I’m trying\nto drive a wedge between you two. Find out for yourself.”"
      },
      {
        "paragraph": "Patrick really could not believe it, but when he saw Freya’s expression, he suddenly could not say\nanything. “Freya, did you really come to me today because of this?”"
      },
      {
        "paragraph": "“ I won’t bother Linda anymore, but if she gets too close to Rebecca, that’s the same as going against\nthe Hill family. The Hill family is close to the Snow family, so it’s equivalent to going against the Snow\nfamily too. You’ve already made a mistake, so I hope that you won’t repeat the same mistake."
      },
      {
        "paragraph": "Rebecca might help you for now, but she can’t pull down the Snow family. After Rebecca leaves, the\nSnow family will settle the scores one by one. It won’t be easy to handle then.”"
      },
      {
        "paragraph": "Freya finished speaking and shrugged self- deprecatingly. “Of course, I can’t do anything if you don’t\nbelieve me, but think of your elderly parents. When you were locked up, they ran around all over the\nplace trying to help you.”"
      },
      {
        "paragraph": "Patrick felt something get stuck in his throat."
      },
      {
        "paragraph": "He opened the car door. When he got out, he gave her another deep look and said, “ Freya, are you…\nliving well?”"
      },
      {
        "paragraph": "“What do you think?” After Freya retorted, she deliberately added in a sad tone, “If… If Linda hadn’t\ncome between us, maybe we would have gotten married a long time ago.”"
      },
      {
        "paragraph": "Patrick’s heart ached."
      }
    ]
  },
  {
    "title": "Chapter 1504 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "A long while after Freya left, Patrick still had not recovered."
      },
      {
        "paragraph": "He wondered, ‘If only I had gone abroad to find her back then.’"
      },
      {
        "paragraph": "If it were not for those words Linda said… Linda?"
      },
      {
        "paragraph": "For the first time, Patrick seriously thought about the past."
      },
      {
        "paragraph": "If Linda had not added fuel to the fire in the police station that day, he would not have been crazy\nenough to cooperate with Nathan’s competitors."
      },
      {
        "paragraph": "As Freya had said, if Linda did not exist between them, maybe they would have gotten married a long\ntime ago. They might even have children now."
      },
      {
        "paragraph": "They would not have come to this point."
      },
      {
        "paragraph": "Patrick could not help but think, ‘If only I had kept my distance from Linda when I was with Freya back\nthen.’"
      },
      {
        "paragraph": "After returning to the company, Patrick walked to his office door, hesitated, and went to find Linda\ninstead."
      },
      {
        "paragraph": "He could not find her."
      },
      {
        "paragraph": "He remembered Freya’s reminder and opened her drawer. Inside, he saw a beautiful gift box that was\nwrapped tightly with a bow. It was clear that it was a gift from someone."
      },
      {
        "paragraph": "He looked at the brand on the box. It seemed very expensive. A bottle of perfume from this brand cost\nseveral tens of thousands of dollars."
      },
      {
        "paragraph": "“Patrick… ” Linda suddenly came in and froze when she saw the box in his hand."
      },
      {
        "paragraph": "“I was looking for a document but found this.” Patrick reacted quickly. “Is this a gift for someone?”"
      },
      {
        "paragraph": "“Yes. Remember I told you that my friend saved you? I owe her a favor, so I bought this for her,” Linda\ntook his arm as she spoke."
      },
      {
        "paragraph": "“We should return the favor. Why don’t we invite her to dinner sometime?” Patrick suddenly asked."
      },
      {
        "paragraph": "“There’s no need for that. She’s quite busy, and her identity isn’t ordinary. She already did me a favor\nby agreeing to help you.” Linda smiled. “By the way, I want to bring this gift to her later after work.”"
      },
      {
        "paragraph": "“Okay, go ahead.” Patrick nodded."
      },
      {
        "paragraph": "After he went back to the office in the afternoon, Linda made an appointment with Rebecca and left the\ncompany."
      },
      {
        "paragraph": "She did not notice that there was a taxi following her."
      },
      {
        "paragraph": "Patrick was sitting in the taxi."
      },
      {
        "paragraph": "He did not drive his own car because he thought that it would be more difficult to be detected in a taxi."
      }
    ]
  },
  {
    "title": "Chapter 1505 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "50 minutes later."
      },
      {
        "paragraph": "Linda’s car pulled into the parking lot of a skyscraper."
      },
      {
        "paragraph": "Patrick saw her park her car and enter a lobby with two tall security guards guarding the elevator doors."
      },
      {
        "paragraph": "After Linda showed them something, the security guards let her into the elevator and go upstairs."
      },
      {
        "paragraph": "Patrick was puzzled, and the driver explained to him, “There’s a luxurious club on the roof of this\nbuilding, and this elevator is the only way up. It’s said that only people worth more than 5o billion\ndollars are qualified to bring people up. Most of the people who enter are either rich and expensive\ntycoons, or people at the top of the entertainment circle. It seems that your girlfriend’s status isn’t\nsimple.”"
      },
      {
        "paragraph": "Patrick was startled."
      },
      {
        "paragraph": "He had only recently come to the capital, so he really did not know much about these things."
      },
      {
        "paragraph": "However, when he thought about it carefully, the identity of Linda’s friend was surely quite\nextraordinary. Hence, it was not strange for Linda to enter this place."
      },
      {
        "paragraph": "He certainly did not have the qualifications to go in. Just as he thought about leaving, he suddenly saw\na Rolls-Royce park at the entrance of the lobby. A woman in a long red dress got out of the car."
      },
      {
        "paragraph": "Patrick’s eyes widened. It really was Rebecca Jones."
      },
      {
        "paragraph": "He had seen Rebecca before when the Jones family held a wedding. Although it had been four years\nand Rebecca’s appearance seemed to have changed a lot, he still recognized her at a glance."
      },
      {
        "paragraph": "Linda went in just a moment ago, and coincidentally, Rebecca, who had been missing for many years,\nalso appeared here."
      },
      {
        "paragraph": "It turned out that Linda really did know Rebecca."
      },
      {
        "paragraph": "It turned out that Freya did not lie."
      },
      {
        "paragraph": "Four years ago, he thought that Freya went to his company to hit Linda because she was jealous and\nunreasonable."
      },
      {
        "paragraph": "Back then, Linda had said that she was not familiar with Rebecca at all."
      },
      {
        "paragraph": "She lied."
      },
      {
        "paragraph": "Did she only lie about this, or did she lie about a lot of other things too?"
      },
      {
        "paragraph": "Patrick was completely at a loss."
      },
      {
        "paragraph": "Then, the driver suddenly shouted, “That lady is definitely a celebrity.”"
      },
      {
        "paragraph": "Patrick looked over again. This time, it was a sports car. The woman who got off the car wore an\napricot- colored dress, as well as shades and a cap."
      },
      {
        "paragraph": "The way she deliberately hid her face definitely seemed like the behavior of a celebrity."
      },
      {
        "paragraph": "However, who was it?"
      },
      {
        "paragraph": "The person’s figure also looked very familiar."
      },
      {
        "paragraph": "Patrick frowned and was suddenly struck by a realization."
      },
      {
        "paragraph": "It was Cindy Turner."
      },
      {
        "paragraph": "During university, Cindy studied at the university next to Freya. Cindy would hang out with Freya if she\nwas free."
      },
      {
        "paragraph": "Later, when he started dating Freya in university, Cindy often accompanied them when they ate."
      },
      {
        "paragraph": "However, after Cindy became famous, she stopped associating herself with Freya and Catherine."
      },
      {
        "paragraph": "He remembered that when Freya and Cindy cut ties, he had not broken up with Freya yet. Apparently,\nshe had stolen Catherine’s music and joined hands with Rebecca many times to kick Freya and\nCatherine when they were down."
      },
      {
        "paragraph": "Patrick never had a good impression of Cindy."
      },
      {
        "paragraph": "Linda, Rebecca, and Cindy were all from Melbourne. Now, they were in the same venue at the same\ntime."
      },
      {
        "paragraph": "Patrick felt that it was too much of a coincidence."
      },
      {
        "paragraph": "It was so coincidental that he wondered if these three people had agreed to hold a get-together here."
      }
    ]
  },
  {
    "title": "Chapter 1506 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "However, what Patrick found even more unbelievable was that Linda was friends with these two vicious\nwomen."
      },
      {
        "paragraph": "“Please drive the car out.” Patrick was not qualified to enter the clubhouse and did not hope to go in\neither."
      },
      {
        "paragraph": "He got out of the car halfway and took out his phone. He hesitated for a long time before calling Freya."
      },
      {
        "paragraph": "“Patrick…”"
      },
      {
        "paragraph": "The familiar voice almost made him lose control."
      },
      {
        "paragraph": "However, he knew that he had completely lost his right. “Freya, I just saw Linda enter Zenith\nClubhouse. Not long after, a woman who looked a bit like Rebecca went in, and then it seemed like\nCindy also appeared…”"
      },
      {
        "paragraph": "“Cindy?” Freya was taken aback."
      },
      {
        "paragraph": "“I’m not sure either, ” Patrick hesitated and said, “ The woman looks like Cindy, but she was wearing a\ncap and shades.”"
      },
      {
        "paragraph": "“Maybe it really is her. She used to be close to Rebecca.” Freya gritted her teeth. The news Patrick told\nher surprised her greatly."
      },
      {
        "paragraph": "She had just finished talking to him, so she did not expect him to bring her news that evening itself."
      },
      {
        "paragraph": "She did not think that Patrick would actually go check on Linda."
      },
      {
        "paragraph": "“Does… Linda know?” she suddenly asked in a low voice."
      },
      {
        "paragraph": "“I… followed her secretly. Maybe your guess is right. ” Patrick was deeply chagrined. “Freya, I’m sorry\nabout four years ago. I shouldn’t have done that.”"
      },
      {
        "paragraph": "“Forget it, it’s in the past. I’m already very touched that you’re willing to help me this time. Thank you,\nPatrick.” Freya had just finished speaking when Rodney roared behind her."
      },
      {
        "paragraph": "“Freya Lynch, who are you talking to?”"
      },
      {
        "paragraph": "“I’ll hang up now. But thank you so much for this. ” Freya quickly hung up the phone."
      },
      {
        "paragraph": "Patrick had also heard Rodney’s voice. Rodney seemed to be very irritated, and Freya’s voice sounded\nflustered just now. It made him feel that"
      },
      {
        "paragraph": "Freya’s life in the Snow family was not good. It even seemed as if she constantly had to be careful."
      },
      {
        "paragraph": "The more he thought about it, the more upset he became."
      },
      {
        "paragraph": "If only they had not broken up back then. Then, she would not have to marry a man who did not care\nabout her at all."
      },
      {
        "paragraph": "In the villa."
      },
      {
        "paragraph": "Freya put down her phone and looked at Rodney who had an apron on. She raised her brows, asking,\n“Is the food ready?”"
      },
      {
        "paragraph": "“Freya, you have a lot of nerve to ask me for food now.”"
      },
      {
        "paragraph": "Rodney looked just like a jealous husband. “I’m busting my *ss cooking for you in the kitchen, but\nyou’re hiding on the balcony to call your old flame. Don’t think I didn’t hear you call out Patrick’s name\nso intimately. Did you forget how he beat you up before? Don’t be such a sucker.”"
      },
      {
        "paragraph": "“Didn’t I tell you this morning? I’m only doing this because I need to get inside information from him,”\nFreya snapped at him."
      },
      {
        "paragraph": "“Do you think he’s an idiot? With how you treated"
      },
      {
        "paragraph": "him before, why would he help you?” Rodney scolded her."
      },
      {
        "paragraph": "Freya chuckled. “You really don’t understand men. He already told me a piece of big news.”"
      },
      {
        "paragraph": "Rodney froze, and his expression darkened. “Why did he suddenly give you information? By the way, I\nheard you went out today. Freya Lynch, did you do anything with your old lover? Did you kiss him?"
      },
      {
        "paragraph": "Hug him? Did you say something ambiguous to him and let him think that you’re still in love with him?”"
      },
      {
        "paragraph": "“Don’t think so badly of me.” Freya gave him a side glance. “We just had a heart-to-heart chat.”"
      },
      {
        "paragraph": "“Heart- to-heart chat?” Rodney almost vomited blood. “You’re my wife, but you secretly met up with\nyour old lover. How shameless are you?"
      },
      {
        "paragraph": "Besides, don’t think I didn’t hear you. Your tone when you talked to him was incredibly gentle.”"
      },
      {
        "paragraph": "“I can’t help it. If I don’t do that, how will I make him feel guilty and be willing to help me?”"
      },
      {
        "paragraph": "“Freya. ” Rodney gnashed his teeth. “ I’m warning you, this is the last time. I don’t want to see you\ncontacting that man again. I’m not dead yet.”"
      },
      {
        "paragraph": "“Why are you getting so worked up?” Freya pouted. “Are you… jealous?”"
      }
    ]
  },
  {
    "title": "Chapter 1507 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Pfft. I’m jealous?”"
      },
      {
        "paragraph": "Rodney flew into a fury. “What’s wrong with me being jealous? Can’t I get jealous because of my wife?”"
      },
      {
        "paragraph": "Freya was dumbfounded."
      },
      {
        "paragraph": "This was contrary to her expectations. She thought Rodney would deny it stoutly, but…"
      },
      {
        "paragraph": "Her face was burning with shame instead."
      },
      {
        "paragraph": "Rodney felt humiliated at first, but as soon as he saw her blush without saying a word, the sense of\nhumiliation in him instantly disappeared. “ Anyhow, bear my words in mind. If this happens again, I’ll\nlook for Patrick and tell him that you’re taking advantage of him.”"
      },
      {
        "paragraph": "Freya felt a surge of emotions in her chest.“ Whatever. Go away. I’m going to call cathy.”"
      },
      {
        "paragraph": "“I’m not going away. Who knows whether you’re going to take the opportunity to call Patrick when I turn\naround.” Rodney directly dragged a chair over and sat on it."
      },
      {
        "paragraph": "He recalled overhearing Freya speak to Patrick so gently on the phone just now."
      },
      {
        "paragraph": "Yet to him, she either yelled or criticized."
      },
      {
        "paragraph": "What a huge difference in the way she treated them."
      },
      {
        "paragraph": "“Suit yourself. ” Freya gave up on him. So, she just turned a blind eye to him and called Catherine. “\nPatrick just called me and said that Linda went to Zenith Clubhouse. Shortly after, Rebecca and Cindy\nshowed up together.”"
      },
      {
        "paragraph": "“It really is her.”"
      },
      {
        "paragraph": "Catherine was overwhelmed with distress. She hoped her assumption was wrong, but it turned out that\nshe was right. “Cindy went too.”"
      },
      {
        "paragraph": "“What’s so strange about it? Rebecca has been close to Cindy ever since they were in Melbourne.”\nFreya said with a snort, “Rebecca surely knows that Cindy is going to marry Chester, so she wants to\nfawn over her since she’s well-connected. But Cindy, tsk, she’s terrible.”"
      },
      {
        "paragraph": "“We already have a grudge against these three people. If Sarah joins them…” Catherine’s head hurt."
      },
      {
        "paragraph": "“What are your plans? Why don’t we go to the clubhouse now and catch Rebecca to probe her? ”\nFreya suggested casually."
      },
      {
        "paragraph": "“Alright.”"
      },
      {
        "paragraph": "“Huh?” Freya was startled, thinking that she had heard it wrong. “I was joking. I thought you wouldn’t\nwant to sound the alarm now.”"
      },
      {
        "paragraph": "“I really didn’t want to. But when I got some people to tail Jeffery and Sally the last time, Logan and\nAustin ended up injured. What if something happens to the people who tail her again this time? I don’t\nwant to sacrifice any Liona members. I might as well go and meet Rebecca now. In the meantime, I can\nalso find out how powerful she is.”"
      },
      {
        "paragraph": "Catherine added, “Quickly finish off your meal. We’ll head there together afterward.”"
      },
      {
        "paragraph": "“Oh, okay.”"
      },
      {
        "paragraph": "Freya promptly nodded."
      },
      {
        "paragraph": "“Explain this to Rodney. I didn’t want to drag you into this at first because you’re pregnant, but… I’m\nworried that if I don’t bring you along, I might not be able to leave the place in one piece, ” Catherine\nexplained helplessly."
      },
      {
        "paragraph": "“I understand.”"
      },
      {
        "paragraph": "Upon ending the call, Freya turned her eyes to Rodney awkwardly."
      },
      {
        "paragraph": "Rodney looked grim as he had probably gotten the message. “Are you planning to head to Zenith\nClubhouse with your protruding stomach?”"
      },
      {
        "paragraph": "“I’m the goddaughter of the future prime minister. With my status, nobody would dare to do anything to\nme, ” Freya explained with a frown. “I must go there tonight.”"
      },
      {
        "paragraph": "“ I don’t get it. This is Catherine’s business. Why must you get yourself into this mess?” Rodney could\nnot help but moan."
      }
    ]
  },
  {
    "title": "Chapter 1508 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Shaun is your buddy. Now that Rebecca wants to target him, are you going to watch as he becomes\ndown and out?” Freya asked."
      },
      {
        "paragraph": "Rodney immediately went silent."
      },
      {
        "paragraph": "Only after Freya entered the house and finished her meal did he say helplessly, “You can go, but you\nmust bring me along.”"
      },
      {
        "paragraph": "Freya threw a glance at him and nodded in the end."
      },
      {
        "paragraph": "4o minutes later, Catherine drove to Freya’s villa."
      },
      {
        "paragraph": "After getting into the car, Rodney knitted his brows. “Why are you alone? Isn’t Shaun going?”"
      },
      {
        "paragraph": "“The police are at Hill Corporation again, and he’s tied up at the moment. I didn’t tell him, lest he\nworries about it,” Catherine replied."
      },
      {
        "paragraph": "“If you don’t tell him, he’ll worry even more if something happens,” Rodney said in a huff."
      },
      {
        "paragraph": "“Well, I have the two of you with me.” Catherine grinned. “No matter how far Rebecca goes, I believe"
      },
      {
        "paragraph": "she won’t be bold enough to attack the Snow family. What’s more, she has laid low for a long time\nbefore returning. I think she’s planning to torture me bit by bit and strip me of everything before she\npushes me into the abyss. It’ll be meaningless for her to kill me in an instant.”"
      },
      {
        "paragraph": "Rodney shot Catherine a complicated look."
      },
      {
        "paragraph": "He felt that Catherine had become increasingly unpredictable and good at figuring out what was on\npeople’s minds, just like Shaun."
      },
      {
        "paragraph": "Upon arriving at Zenith Clubhouse, Rodney flashed his membership card. Then, they went through\nseveral security checks before taking an elevator to the top floor."
      },
      {
        "paragraph": "“ It’s my first time here, but they have really tight security.” Freya sighed and said to Rodney, “You own\na clubhouse too, don’t you? It doesn’t seem as strict as this place.”"
      },
      {
        "paragraph": "Rodney answered with mixed feelings, “ Because the owner of this clubhouse is no ordinary person. ”"
      },
      {
        "paragraph": "“Who is it?” Catherine asked curiously."
      },
      {
        "paragraph": "“The current prime minister’s grandson, Bryce Zeller.” Rodney said, “Although he’s two years my junior,\nhe’s not simple. He even wanted to compete with my uncle to run for prime minister at first, but"
      },
      {
        "paragraph": "unfortunately, he’s too young. After my uncle steps down, Bryce and Ryan will surely run neck and\nneck for the post in the future election.”"
      },
      {
        "paragraph": "Freya was stunned. She found this matter complex."
      },
      {
        "paragraph": "Rodney continued indifferently, “With Snow Corporation as strong backing, the Snow family has an\nedge over Bryce. Having said that, Bryce privately hobnobs with many wealthy people, and this is the\nclubhouse where he serves them. That’s why we rarely come here.”"
      },
      {
        "paragraph": "“But Rebecca and Cindy came here too,” Catherine suddenly said, “Could Rebecca have played up to\nBryce?”"
      },
      {
        "paragraph": "Rodney shook her head with a frown. “Given that Bryce is very secretive, he won’t be bothered to\nsocialize with people whom he finds worthless. He won’t act impulsively for the sake of a woman either.\nBesides, he has tried to make friends with Shaun before. Although Shaun has been lukewarm to him,\nhe won’t be so foolish to the extent of attacking Shaun.”"
      },
      {
        "paragraph": "Catherine disapproved of his views. “What if Bryce i s interested in the force behind Rebecca?”"
      },
      {
        "paragraph": "Rodney instantly kept quiet."
      },
      {
        "paragraph": "Once the elevator arrived at the top floor, the three of them walked out."
      },
      {
        "paragraph": "This was the highest floor in the whole of Canberra, and Catherine seemed to have figured out why this\nplace was named Zenith Clubhouse. Standing here made her feel as if she was at the zenith of the sky.\nAny of the furnishings here was worth hundreds of billions of dollars."
      },
      {
        "paragraph": "“Young Master Snow, what brings you to Zenith"
      },
      {
        "paragraph": "Clubhouse?”"
      },
      {
        "paragraph": "A pretty female manager walked up to Rodney with a smile. When she caught a glimpse of Freya and\nCatherine, she was dumbfounded. “You even brought Madam Snow and Miss Jones over.”"
      },
      {
        "paragraph": "Catherine was secretly astonished. This female manager was not a simple person, considering that\nshe could recognize them instantly."
      },
      {
        "paragraph": "Rodney seized Freya’s waist and said with a grin, “ We happened to pass by this area. My wife said\nshe has never been to Zenith Clubhouse, and she’d like to have fun with her best friend, so I brought\nthem here.”"
      }
    ]
  },
  {
    "title": "Chapter 1509 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya felt awkward at how intimately Rodney was hugging her in public. However, she knew Rodney’s\nbehavior was only for show, so she did not push him away."
      },
      {
        "paragraph": "“You really love your wife a lot, Young Master Snow. ” The female manager was a clever person. She\nsaid while beaming, “You’re really blessed, Young Madam Snow.”"
      },
      {
        "paragraph": "Freya simpered without saying a word."
      },
      {
        "paragraph": "People like the female manager would be aware of what happened between Rodney and Sarah in the\npast, yet she still spoke sweetly to Freya. Freya could care less about them."
      },
      {
        "paragraph": "“By the way, I saw Young Master Zeller’s car downstairs. Since I’m here, I should go and say hi to him.\nWhere’s he?” Rodney lied, trying to probe the manager. In fact, he did not see Bryce’s car."
      },
      {
        "paragraph": "The female manager said with a smile, “Some of his friends happen to be here, so he has gone to\ngreet them.”"
      },
      {
        "paragraph": "“Oh, right. I might know his friends too, ” Rodney replied while grinning."
      },
      {
        "paragraph": "Catherine suddenly said softly, “Let’s not disturb them.”"
      },
      {
        "paragraph": "“Yeah, ” Freya whispered, “I just wanted to look around.”"
      },
      {
        "paragraph": "“You know nothing. This is common courtesy.” Rodney said with a snort, “Do you know who Young\nMaster Zeller is? He’s the prime minister’s grandson.”"
      },
      {
        "paragraph": "A dumbfounded look flashed across Freya’s face. “ Only if you could greet him.”"
      },
      {
        "paragraph": "After some thought, the female manager nodded. “ He’s on the second floor. Let me take you guys\nthere.”"
      },
      {
        "paragraph": "As soon as she finished speaking, she led the way."
      },
      {
        "paragraph": "Rodney moved closer to Freya’s ear from the back and whispered with a smirk, “Hey, don’t you think\nwe work well together?”"
      },
      {
        "paragraph": "He put his hand around her waist and murmured those coquettish words in her ear."
      },
      {
        "paragraph": "At that moment, Freya felt ticklish. As much as she tried to break free from him, Rodney’s grip around\nher waist was tight. “Stop moving around. If we don’t act lovey-dovey, other people might suspect us.”"
      },
      {
        "paragraph": "Freya secretly glowered at him."
      },
      {
        "paragraph": "She could not understand why she had to act lovey- dovey with him as though she was a spy when, in\nfact, she just came to the nightclub for a visit."
      },
      {
        "paragraph": "Soon, the female manager stopped in front of a private room and knocked on the door lightly."
      },
      {
        "paragraph": "A bodyguard-looking man soon opened the door. “ Who are you looking for?”"
      },
      {
        "paragraph": "“I’m looking for Young Master Zeller. I’m his friend.” Rodney pushed the bodyguard away and barged\nin. He ran directly to the man who was seated in the middle of the couch and greeted him\nenthusiastically, “Hi, Young Master Zeller. It’s been a while since we met.”"
      },
      {
        "paragraph": "Upon realizing that Rodney was friends with Young Master Zeller, the bodyguard lowered his guard."
      },
      {
        "paragraph": "Catherine and Freya also took the opportunity to enter the private room. There were only four people in\nthe spacious room."
      },
      {
        "paragraph": "Among these four people, Catherine knew everyone except Young Master Zeller."
      },
      {
        "paragraph": "The three people she knew were Cindy, Linda, and… Rebecca."
      },
      {
        "paragraph": "Today, Rebecca was wearing a red maxi dress and dressed much more beautifully than she did three\nyears ago. Her face was still the same at first glance. However, upon a closer look, it was quite different\nfrom before. Evidently, she had undergone plastic surgery. Although she looked pretty with a pointed\nchin, she appeared stiff and relatively unnatural compared to Cindy beside her."
      },
      {
        "paragraph": "Rebecca turned her eyes to Catherine, and her expression slightly shifted."
      },
      {
        "paragraph": "Nevertheless, her red lips soon curled up into a grin."
      },
      {
        "paragraph": "She did not expect Catherine would discover her whereabouts so soon. She might be a little surprised,\nbut it did not affect her much."
      },
      {
        "paragraph": "On the contrary, Cindy and Linda were visibly taken aback by Catherine and Freya’s coming."
      }
    ]
  },
  {
    "title": "Chapter 1510 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Young Master Snow, what brings you to Zenith today?” Bryce patted Rodney on the shoulder with a\ngrin. They seemed to be on friendly terms."
      },
      {
        "paragraph": "“I think Young Master Snow and his wife came here to look for me.”"
      },
      {
        "paragraph": "Rebecca’s lips curled up into a smile. Holding a glass of red wine, she cast a pensive look at Catherine\nand toasted her. “I wonder how you guys know I’m here.”"
      },
      {
        "paragraph": "Bryce’s face froze. Then, he shifted his confused gaze to Rodney. “Young Master Snow, this…”"
      },
      {
        "paragraph": "“Young Master Zeller, it seems like your friend knows my wife.” Rodney pretended to look surprised."
      },
      {
        "paragraph": "“Young Master Snow, stop pretending. Not only do we know each other, but we’re also deeply\nentangled with each other.” Could not be bothered to play along with him, Rebecca said bluntly, “My\ndear cousin, have you received the letter I asked someone to send you?”"
      },
      {
        "paragraph": "“Yeah. I didn’t expect you to be so wicked to destroy your biological aunt’s tomb.” Catherine moved\ncloser to Rebecca. A smile spread across her face as she gazed at Rebecca. “You’ve only grown\ncrueler in the four years you’ve been away. You’re still as ugly as ever.”"
      },
      {
        "paragraph": "Bryce’s face darkened, then he roared, “You’d better watch your words.”"
      },
      {
        "paragraph": "Catherine frowned, and Rodney immediately asked, “Young Master Zeller, what’s wrong? Is this\nwoman your girlfriend?”"
      },
      {
        "paragraph": "“I’m trying to make her my girlfriend.” Bryce answered with a mirthless smile, “That’s why you guys\nshould treat her with respect.”"
      },
      {
        "paragraph": "Upon hearing that, Rebecca chortled smugly. Linda immediately beamed and said, “Catherine, do you\nthink you can still bully Rebecca like how you used to? Young Master Zeller, if you’re really interested in\npursuing Rebecca, you need to deal with Miss Jones tonight. If it weren’t for her, Rebecca wouldn’t\nhave had to hide overseas.”"
      },
      {
        "paragraph": "Rebecca smirked in silence, implying her acknowledgment of Linda’s words."
      },
      {
        "paragraph": "Bryce responded with a grin, “That’s a piece of cake.”"
      },
      {
        "paragraph": "With that, his voice turned cold. “Guards.” “Young Master Zeller.”"
      },
      {
        "paragraph": "Subsequently, a few bodyguards walked in."
      },
      {
        "paragraph": "Bryce gestured at Catherine with his chin. “Treat Miss Jones nicely.”"
      },
      {
        "paragraph": "“Young Master Zeller, what are you trying to do?” Rodney stood in front of Catherine, his face turning\ngrave. “Let me remind you that she’s Shaun Hill’s woman.”"
      },
      {
        "paragraph": "“ Shaun Hill?” Bryce gave a condescending sneer. “ The Hill family is going to disappear from the\nAustralian scene in no time. Why would I care about him?”"
      },
      {
        "paragraph": "“But do you believe that I’ll make you disappear before he does?” Catherine asked with an indifferent\ntone. However, her eyes were cold and piercing."
      },
      {
        "paragraph": "Freya gasped with fright."
      },
      {
        "paragraph": "How dare Catherine make such a remark in front of Bryce? She was taking her life into her hands."
      },
      {
        "paragraph": "Even Rodney could not help but raise his thumb as if to say, “You’re f*cking amazing.”"
      },
      {
        "paragraph": "“What did you say?” Bryce laughed right away."
      },
      {
        "paragraph": "However, his laughter was filled with wickedness and astonishment."
      },
      {
        "paragraph": "Catherine glanced at Rebecca, who was watching the drama. “Although I have no idea why the prime\nminister’s grandson has chosen to curry favor with this woman who has undergone plastic surgery, I’m\nguessing it has to do with the person behind her. I’m sure this person isn’t an Australian. However, you\nneed to be clear that this is Australia. Hill Corporation might be subjected to investigation at this point,\nbut it’s not falling apart nor charged with anything either. I can still deal with you as long as Hill\nCorporation is around. If you want to deal with me, go ahead. But there is no need to hurry. Take your\ntime. You don’t have to get it done today. Otherwise, you could end up losing"
      },
      {
        "paragraph": "everything while someone else gets pleasure from it.”"
      },
      {
        "paragraph": "Bryce was used to having people currying favor with him. Catherine was considered the first person\nwho had the nerve to provoke him this way."
      },
      {
        "paragraph": "His face twisted with fury."
      },
      {
        "paragraph": "He wished he could slap her to death there and then."
      },
      {
        "paragraph": "Nevertheless, Catherine’s words were truly a menace to him."
      }
    ]
  },
  {
    "title": "Chapter 1511 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Having talked to Shaun twice, Bryce could tell that he was a cruel person."
      },
      {
        "paragraph": "This was evident when Shaun recently overcame Campos Corporation in the twinkling of an eye."
      },
      {
        "paragraph": "Bryce’s grandfather had initially objected to that person’s request to deal with Shaun because Hill\nCorporation was of paramount importance to Australia’s economy. He only agreed to take action a s\nthat person had an unusual identity."
      },
      {
        "paragraph": "Nevertheless, Shaun had always acted cautiously. After two days of investigation, nothing useful in\nconnection with Hill Corporation was found."
      },
      {
        "paragraph": "Hill Corporation had Liona behind it too. If Bryce hurt his woman, Shaun might go down with him,\nconsidering how brutal he was."
      },
      {
        "paragraph": "Of course, since that person had made this request, it was only a matter of time before Hill Corporation\nwas brought down. However, now was certainly not the time to have a falling-out."
      },
      {
        "paragraph": "Rodney jumped at the chance to scoff and say, “"
      },
      {
        "paragraph": "Also, are you treating us as dead people? Your grandfather is going to step down next month. I know\nyou’re ambitious, Bryce. But to put it bluntly, you have to wait until the day you become the prime\nminister before you can fulfill this ambition.”"
      },
      {
        "paragraph": "Stung by Rodney’s mockery, Bryce looked sullen."
      },
      {
        "paragraph": "Rodney and Catherine had stripped Bryce of his dignity in front of Rebecca."
      },
      {
        "paragraph": "“Take your time, Bryce.”"
      },
      {
        "paragraph": "With a vague smile, Rebecca rose to her feet and saved him from humiliation. “Actually, I think it’s quite\nmeaningless to kill her just like that. I enjoy locking people up and torturing them little by little to make\nthem suffer.”"
      },
      {
        "paragraph": "Linda also glared at Freya. “Don’t think you’re great just because you’re the best friend of the future\nprime minister’s goddaughter. To Rebecca,"
      },
      {
        "paragraph": "dealing with you is as easy as squashing an ant. To be honest, Catherine, if I were you, I’d drop on my\nknees and beg Rebecca straight away. Perhaps you’d be able to save Shaun’s life by doing so.”"
      },
      {
        "paragraph": "“Linda, has Patrick seen this side of you? ” Freya asked with a snort."
      },
      {
        "paragraph": "Linda snickered. “Freya Lynch, don’t think that you’re great just because you’re the prime"
      },
      {
        "paragraph": "minister’s goddaughter. In truth, you’re not even his biological daughter. The Snow family can’t afford to\nprovoke the force behind Rebecca. I advise you not to be a busybody.”"
      },
      {
        "paragraph": "“What a faithful dog you’ve got, Rebecca Jones. ” Freya raised her brows and said disdainfully."
      },
      {
        "paragraph": "Linda glowered at her furiously. Conversely, Rebecca raised her brows and snickered. “Speaking of\ndogs, I’m afraid no one is as faithful as you, Miss Lynch. You follow whatever Catherine asks you to do."
      },
      {
        "paragraph": "Feeling humiliated, Freya flew into a rage. Ever since she got pregnant, she had been more easily\noffended."
      },
      {
        "paragraph": "Rodney lost his temper as well. After all, Freya was his wife. “Shut up, you ugly b*tch. Hey, where did\nyou get your plastic surgery done? Your face looks extremely stiff. Bryce, how can you bring yourself to\nbutter up such a woman? Aren’t you worried that you’ll take her for a vampire at night?”"
      },
      {
        "paragraph": "Rodney’s words were like a slap in the face to Rebecca and Bryce."
      },
      {
        "paragraph": "Rebecca’s face, in particular, twisted in bitterness. Ever since Sheryl acknowledged her as her\ndaughter, she had been surrounded by people who tried to fawn over her. Even after she came to\nAustralia, she had been flattered by a lot of high- ranking people whom she never thought she could\never approach. What she resented most was people criticizing her face."
      },
      {
        "paragraph": "“Rodney Snow, are you asking for death?” Bryce became infuriated. He had to save Rebecca’s dignity,\nespecially in front of her."
      },
      {
        "paragraph": "Therefore, he immediately threw a punch at Rodney."
      },
      {
        "paragraph": "Although he could not deal with Catherine, fighting Rodney was not an issue."
      },
      {
        "paragraph": "Bryce, who came from an outstanding background, was rather deft and savage."
      },
      {
        "paragraph": "Rodney might not be as skillful as Shaun, but Shaun and Chester used to train him a lot when they\npunched him. With that, he became capable of enduring punches."
      },
      {
        "paragraph": "Just like that, Rodney and Bryce got into a fight."
      }
    ]
  },

  {
    "title": "Chapter 1512 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Bryce was no match for Shaun and Chester. However, he fought neck and neck with Rodney."
      },
      {
        "paragraph": "None of the bodyguards at the side dared to step up and help Bryce out. After all, Rodney had an\nunusual status. If Bryce and a group of bodyguards had beaten up someone from the Snow family, it\nwould be hard to settle the mess the next day."
      },
      {
        "paragraph": "Freya gaped at the scene. “ I didn’t expect Rodney to have some skills. He usually looks so\nflamboyant. ”"
      },
      {
        "paragraph": "“How can he possibly get along with Shaun and Chester if he doesn’t have skills?” Catherine, who had\nkeen eyesight, could soon tell that Rodney and Bryce were equally matched in the fight. None of them\nhad an edge over the other."
      },
      {
        "paragraph": "Sure enough, Rodney and Bryce parted in a sorry state after some time. Both their faces were injured."
      },
      {
        "paragraph": "Not wanting to make any more fuss tonight, Catherine slowly walked up to Rebecca. “In fact, you came\nback at the right time. I’ve spent a long time looking for you. I want to settle the scores with you\nregarding what happened four years ago."
      },
      {
        "paragraph": "There’ll be ample time for that.”"
      },
      {
        "paragraph": "Once she finished speaking, she turned around. As she was walking away, she caught a glimpse at\nCindy, who had been silent. “ I wonder if Chester knows you’re here.”"
      },
      {
        "paragraph": "After that, she left. She could not care less about the change in Cindy’s expression."
      },
      {
        "paragraph": "Rebecca did not heed Catherine’s warning. In her view, nobody was a match for her at this point."
      },
      {
        "paragraph": "After all, Titus and Sheryl’s background was just too powerful."
      },
      {
        "paragraph": "They were so powerful that even the prime minister’s grandson was following her around, trying to\nbutter her up."
      },
      {
        "paragraph": "“Sorry, Rebecca, ” Bryce promptly apologized as he walked up to her. “I initially planned for you and\nyour friends to have a good time in my clubhouse. Yet…”"
      },
      {
        "paragraph": "“How did they know we were here?” Rebecca suddenly turned her eyes to Cindy and Linda in\nsuspicion. “Were you guys tailed on your way here?”"
      },
      {
        "paragraph": "“I don’t think so.” Linda’s and Cindy’s hearts clenched."
      },
      {
        "paragraph": "“Fine. It doesn’t matter if they found out. I’d have to meet her sooner or later anyway.” Rebecca was\nuntroubled by the incident. In fact, she was pretty keen on meeting Catherine."
      },
      {
        "paragraph": "However, Cindy’s head hurt at the thought of what Catherine said to her before she left. She wondered\ni f Catherine would tell Chester something."
      },
      {
        "paragraph": "After thinking it through, Cindy was still inclined to foster a close relationship with Rebecca. Judging\nfrom how Bryce had been trying to please Rebecca, her background must be exceptionally powerful."
      },
      {
        "paragraph": "Furthermore, she was eagerly waiting for the day Catherine became down and out."
      },
      {
        "paragraph": "In the underground parking lot."
      },
      {
        "paragraph": "Rodney endured the pain of his injuries and bellowed indignantly, “What the f*ck. How dare he beat\nme? Just wait till his grandpa steps down, and I will kill him. Ouch… My mouth hurts…”"
      },
      {
        "paragraph": "Looking at Rodney’s bruised, handsome face, Freya finally thought of him as manly. “Why don’t you…\nlet me take you to the hospital to have your injuries treated?”"
      },
      {
        "paragraph": "“Sure. My strikingly handsome face cannot be damaged, ” Rodney gasped and nodded."
      },
      {
        "paragraph": "“Thank you for today, Young Master Snow.” Catherine started the car. The incident tonight had\ndrastically changed her impression of Rodney."
      },
      {
        "paragraph": "“Not at all. Freya is now my wife. Rebecca was trampling all over my dignity by criticizing Freya,”\nRodney said while scoffing."
      },
      {
        "paragraph": "With Rodney’s demeanor, Freya could not help but shift her eyes to him again."
      },
      {
        "paragraph": "“By the way, you previously said Rebecca might’ve played up to a foreign man with an unordinary\nstatus. From what I’ve observed today, even Bryce is trying to please her. That’s strange.” Rodney\nsuddenly said, “She doesn’t have power or beauty. Who on earth has she played up to?”"
      }
    ]
  },
  {
    "title": "Chapter 1513 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Exactly."
      },
      {
        "paragraph": "Who on earth had Rebecca played up to?"
      },
      {
        "paragraph": "Catherine could not get her head around it as well."
      },
      {
        "paragraph": "Could Rebecca have found her long-lost biological parents just like the soap operas aired on TV?"
      },
      {
        "paragraph": "However, Rebecca’s biological father was Jeffery."
      },
      {
        "paragraph": "“Let’s head to the hospital first,” Catherine eventually said."
      },
      {
        "paragraph": "She sent Rodney to a Jewell family hospital."
      },
      {
        "paragraph": "Freya directly said, “You can look for Shaun and tell him what happened tonight. I’ll keep Rodney\ncompany in the hospital.”"
      },
      {
        "paragraph": "“Yeah. Tell Shaun about it. We’ll get our chauffeur to send us home later, ” Rodney said."
      },
      {
        "paragraph": "Catherine nodded. She did indeed have a lot on her mind. So after thanking them, she left in a rush."
      },
      {
        "paragraph": "In the emergency room."
      },
      {
        "paragraph": "Dressed in a white coat, Chester came in and glanced at Rodney, whose wound was being bandaged.\nThen, he caught a glimpse of Freya who was accompanying him, which was a rare occurrence. “You\nwere the one who abused him, huh?”"
      },
      {
        "paragraph": "Feeling speechless, Freya glowered at Chester. “ How could a pregnant woman like me have possibly\nbeaten him up? You should ask your fiancée. She should know best.”"
      },
      {
        "paragraph": "At the mention of Cindy, Chester’s handsome face darkened. “What happened?”"
      },
      {
        "paragraph": "“It was Bryce, that simp, who beat me. But I beat that simp quite terribly as well.” Rodney endured the\npain on his cheeks and gasped while saying ,“ Shaun has been under investigation lately, and we\nfound out that it has to do with Catherine’s cousin, Rebecca, who’s from Melbourne. We heard she was\na t Zenith Clubhouse, so we headed there, only to see Bryce, Rebecca, and Cindy there too. Rebecca\nwas pretty arrogant. Even Bryce kept flattering her.”"
      },
      {
        "paragraph": "As Chester listened, he became increasingly dumbfounded."
      },
      {
        "paragraph": "He was aware that quite a rigorous investigation into Hill Corporation was underway. He also knew it\nwas initiated by the executive council. However, he never expected Bryce and Rebecca to be involved\nin the issue."
      },
      {
        "paragraph": "Chester was under no illusions that Rebecca impersonated Shelley to stay by Shaun’s side three years\nago. Later, she killed the real Shelley and framed Charity. She was also the main mastermind who\nfooled Charity and ultimately sent her to jail."
      },
      {
        "paragraph": "Unfortunately, Mason had died too soon, so there was no direct evidence proving that Rebecca was\nthe mastermind of the incident back then."
      },
      {
        "paragraph": "Yet, little did Chester expect that Cindy would be in contact with Rebecca."
      },
      {
        "paragraph": "A trace of grimness flashed across the depths of his eyes."
      },
      {
        "paragraph": "“What’s with Rebecca’s background? Bryce has always been narcissistic, right?” Chester asked coldly."
      },
      {
        "paragraph": "“We’re not sure.” Chester shook his head in frustration. “But I noticed Bryce and Rebecca speaking\npretty confidently as if they could defeat Shaun at any time. Think about it. Even the executive council"
      },
      {
        "paragraph": "is trying to please Rebecca. Who can that person behind her be?”"
      },
      {
        "paragraph": "Chester pursed his thin lips sternly."
      },
      {
        "paragraph": "Shaun would most likely be in deep trouble this time."
      },
      {
        "paragraph": "Nevertheless, what angered Chester was Cindy, that woman."
      },
      {
        "paragraph": "After Rodney had been bandaged, his chauffeur drove him and Freya back to the villa."
      },
      {
        "paragraph": "During the journey, Rodney pulled a long face. As he rarely got into a fight, this was his first serious\ninjury."
      },
      {
        "paragraph": "Freya darted a glance at his swollen and bruised face that had some medicine on it. It made his\nhandsome face look comical."
      },
      {
        "paragraph": "For the first time, she did not find the sight of him annoying. “Thanks… for today.”"
      },
      {
        "paragraph": "Rodney was stunned, probably because Freya hardly thanked him. Hence, this was unbelievable."
      },
      {
        "paragraph": "He swiftly turned his eyes to Freya, who mustered her courage to say awkwardly, “Anyway, you got into\nthe fight because of me. Also, if it weren’t for you, Cathy and I might not have been able to ride it out.”"
      },
      {
        "paragraph": "“Oh well. With Catherine’s authoritative personality."
      }
    ]
  },
  {
    "title": "Chapter 1514 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rodney’s thin lips moved as he muttered the words. After pausing for a moment, he said, “You don’t\nhave to thank me again. Didn’t you already say it just now?”"
      },
      {
        "paragraph": "With that, Freya stopped being coy. Now that she was married to Rodney, she felt that they were\nconsidered allies. There was no need to behave as though they were enemies."
      },
      {
        "paragraph": "Catherine was planning to drive to Hill Corporation at first, but she found out later through a call that\nShaun was already home."
      },
      {
        "paragraph": "She then drove back to the Hill family’s villa, only to find that Suzie and Lucas had gone to Old Madam\nHill’s place while Shaun was eating pasta."
      },
      {
        "paragraph": "However, she did not feel like eating, probably because she was in a bad mood."
      },
      {
        "paragraph": "As soon as Shaun noticed Catherine’s return, he put down his fork. “Where did you go? I heard Aunty\nYasmine say that you left in a hurry after your dinner.”"
      },
      {
        "paragraph": "“To investigate something. ” Catherine sat down and told him what happened tonight."
      },
      {
        "paragraph": "Upon hearing it, Shaun’s face turned grave. He even looked slightly annoyed. “Catherine Jones, why\ndidn’t you discuss such a serious matter with me?”"
      },
      {
        "paragraph": "“I noticed that you were tied up.” Catherine battered her innocent eyes. Apparently, any man who saw\nthose eyes could not bear to criticize her."
      },
      {
        "paragraph": "Nevertheless, Shaun lost his temper. “You don’t even know how wicked Bryce is. How dare Rodney\nhide it from me. Wasn’t he afraid that you’d be left suffering there?”"
      },
      {
        "paragraph": "“ Since I had the guts to go there, I was confident that I could ride it out.” With that, she shrugged\nhelplessly. “ If I didn’t go there, how can I be sure that Rebecca is related to the issue?”"
      },
      {
        "paragraph": "“I’ll ask Liona members to keep a close watch on Bryce. I’m sure Bryce knows the person behind\nRebecca, and he’ll go all out to flatter that person too. We’ll find out who it is by then, ” Shaun said\ncoldly."
      },
      {
        "paragraph": "He was worried not because Hill Corporation was under investigation but because he was clueless\nabout the other party’s background."
      },
      {
        "paragraph": "“Are you sure you can solve it?” Catherine looked at him anxiously."
      },
      {
        "paragraph": "Shaun was stunned for a few seconds before he pursed his thin lips. “If I can’t solve it, you can take the\nkids overseas.”"
      },
      {
        "paragraph": "Catherine’s heart did a flip."
      },
      {
        "paragraph": "Given that this man used to be so confident, his current manner made her feel lost."
      },
      {
        "paragraph": "“What about you?” she asked after a while."
      },
      {
        "paragraph": "“ I don’t care who’s backing Rebecca. Now that she has returned to Australia, I’ll destroy her.” Shaun’s\nbloodshot eyes flashed with a hint of cruelty. “ It was my mistake that made Rebecca who she is today.\nI won’t allow this mistake to happen again. I must protect you and the kids.”"
      },
      {
        "paragraph": "“Is it… really that bad?” A look of agony washed over Catherine’s face. She may seem confident in\nfront of Rebecca, but she was actually unsure of herself."
      },
      {
        "paragraph": "“Judging from how careful Bryce is toward Rebecca, I suspect the person behind Rebecca is of\nimmense significance to the global economy.”"
      },
      {
        "paragraph": "After Shaun spoke gravely, Catherine froze. It baffled her why God was so unfair to help such a wicked\nwoman like Rebecca time and time again."
      },
      {
        "paragraph": "“ Sorry, Cathy. ” Shaun suddenly hugged Catherine tightly, as if he was going to press her into his body.\n“How I wish I could be with you like this forever. ”"
      },
      {
        "paragraph": "Locked in his embrace, Catherine felt dissatisfied."
      },
      {
        "paragraph": "Catherine and Shaun had gone through a lot of hardships to get to this point. Although the kids called\nShaun ‘scummy dad’, they had long since accepted him."
      },
      {
        "paragraph": "No. She was unwilling to give up just like that. She had to put in some effort, at least."
      },
      {
        "paragraph": "All of a sudden, a person occurred to her."
      },
      {
        "paragraph": "When Shaun was taking a bath that night, Catherine gave Matthew a call."
      }
    ]
  },
  {
    "title": "Chapter 1515 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Matthew’s phone rang for quite a while before he answered it."
      },
      {
        "paragraph": "He sounded rather surprised, yet he kept his voice low. “Hi. I didn’t expect you to take the initiative to\ncall me.”"
      },
      {
        "paragraph": "“Am I interrupting your date?” As a sharp -witted person, Catherine guessed that it might be\ninconvenient for him to speak now."
      },
      {
        "paragraph": "“I’m not on a date. I was just chatting with my family. ” Matthew explained with a faint smile, “As I said, I\ndon’t have a girlfriend.”"
      },
      {
        "paragraph": "“Are your parents in Canberra?” Catherine was a little surprised. It was no wonder he rarely contacted\nher."
      },
      {
        "paragraph": "Indeed, he previously contacted her a lot to inquire about the villa and get familiar with Canberra."
      },
      {
        "paragraph": "“They came a few days ago.”"
      },
      {
        "paragraph": "Amid her thoughts, Catherine realized that was exactly when something happened to Hill Corporation.\n“Are you free for lunch tomorrow? I’d like to ask you something.”"
      },
      {
        "paragraph": "“That’s rare. I’ve always been the one to consult you,” Matthew said jokingly."
      },
      {
        "paragraph": "“Will you be available? Otherwise…”"
      },
      {
        "paragraph": "“Yes. Let’s make it at noon tomorrow.” Matthew agreed categorically."
      },
      {
        "paragraph": "After hanging up, Matthew felt quite uneasy while standing on the balcony. Could Catherine have found\nout about something since she called him at this time? It was unlikely as he had always been cautious."
      },
      {
        "paragraph": "Perhaps she wanted to ask him for help regarding Hill Corporation’s matter."
      },
      {
        "paragraph": "“Matthew, who were you talking to on the phone? Why are you so mysterious? You even walked away.”\nSheryl, who was in the living room, waved at him. “Come over. Your sister has brought home some\ngood food.”"
      },
      {
        "paragraph": "“ It’s from an old restaurant in Canberra that my friend recommended. Mom, I know you love spicy\nfood, and so do I. That’s why I ordered a set for takeaway,” Rebecca said while beaming."
      },
      {
        "paragraph": "“It seems that daughters are more caring.” Sheryl purposely shot a look at her son."
      },
      {
        "paragraph": "Matthew felt aggrieved. “Mom, if I care for you too much, Dad will find me annoying for being the third\nwheel.”"
      },
      {
        "paragraph": "Titus snorted. “I’m not as petty as you.”"
      },
      {
        "paragraph": "Matthew chuckled silently. ‘Who else in the world could be pettier than you?’"
      },
      {
        "paragraph": "“Enough. What’s the fuss between you guys?” Sheryl glared at Titus and Matthew. Then, she asked\nRebecca gently, “What did you do during your outing with Bryce today? How was it?”"
      },
      {
        "paragraph": "“We went to Zenith Clubhouse that he owns. I also invited two of my old friends there, but…” Rebecca\npaused. Suddenly, she furrowed her brows in annoyance."
      },
      {
        "paragraph": "“But what?” Sheryl thought Rebecca was taken advantage of."
      },
      {
        "paragraph": "“But halfway through the gathering, Catherine and two of her friends came to look for trouble. One of\nthem was the Eldest Young Master of the Snow family. Luckily, Young Master Zeller was around, but he\ngot into a fight with Eldest Young Master Snow because I was humiliated, ” Rebecca said pathetically."
      },
      {
        "paragraph": "Matthew was shocked, while Sheryl scowled. “Who i s the Snow family?”"
      },
      {
        "paragraph": "Matthew could not help but explain, “Nathan from the Snow family is going to be the new prime minister\nof Australia in half a month. Young Master Snow is Nathan’s nephew. Also, I heard Rodney and Shaun\nare as thick as thieves.”"
      },
      {
        "paragraph": "Sheryl said indifferently, “It’s a shame that I returned too late. If I’d come back earlier, I would’ve\nstopped Nathan from running for prime minister.”"
      },
      {
        "paragraph": "“Wifey, if you’re unhappy about it, I can make some trouble for the Snow family,” Titus immediately\nsuggested to please his wife."
      }
    ]
  },
  {
    "title": "Chapter 1516 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "It occurred to Rebecca that the Costner family was much more powerful than she imagined."
      },
      {
        "paragraph": "On the other hand, Matthew’s head hurt at the sight of his father’s behavior. “Dad, forget it. I know\nwe’re powerful, but this is Australia, after all. You guys are dealing with Shaun now and even planning\nto pick on the prime minister of Australia later. These two men are the most influential figures in\nAustralia. If the two of them band"
      },
      {
        "paragraph": "together to go down with us, we might not be able to leave Australia because no matter how capable\nwe are, we can’t get help from outside.”"
      },
      {
        "paragraph": "“Pfft. When I have the intention of bringing someone down, I won’t care about anyone else, ” Titus said\ngrumpily, feeling humiliated in front of his wife."
      },
      {
        "paragraph": "“Alright. What Matthew said makes sense too.” Sheryl remained cool. “I simply said that out of anger.\nI’m not going to destroy someone who slightly offends me.”"
      },
      {
        "paragraph": "Titus kept quiet at once."
      },
      {
        "paragraph": "Rebecca originally wanted to teach Freya a lesson. However, after hearing Sheryl’s words, she\nimmediately went along with her. “Mom is right. Actually, Young Master Zeller was only punched a few\ntimes. Rodney’s and his injuries are equally terrible.”"
      },
      {
        "paragraph": "“Considering his status, Young Master Zeller probably can’t get over the fact that he was punched a\nfew times.” Sheryl suddenly said, “How did Catherine find you?”"
      },
      {
        "paragraph": "“I’m not sure either.” A dazed look crossed Rebecca’s face."
      },
      {
        "paragraph": "“It looks like she hasn’t learned her lesson.” Sheryl said to Titus with displeasure, “It has been two days\nof investigation into Hill Corporation. Why aren’t the results out yet?”"
      },
      {
        "paragraph": "“Shaun has been acting cautiously. I heard the investigation hasn’t found anything important even after\nsome time.” Titus explained, “But don’t worry. I’ve given the order to bring down Hill Corporation\nregardless. They’ll find fault with the company even if everything is fine. As for Catherine, I’ll let her\nbounce around for two more days. She can’t do this for long anyway.”"
      },
      {
        "paragraph": "Sheryl then nodded in satisfaction. In the end, she said to Rebecca, “It seems like Bryce is interested in"
      },
      {
        "paragraph": "you.”"
      },
      {
        "paragraph": "Rebecca immediately blushed without saying a word."
      },
      {
        "paragraph": "Matthew said indifferently, “Bryce is ambitious. He’s going after her simply because of the Costner\nfamily’s power.”"
      },
      {
        "paragraph": "Although Rebecca was his sister, he felt that those wealthy and powerful men would not be interested\nin her solely based on her plastic face."
      },
      {
        "paragraph": "Nevertheless, Matthew did not say it bluntly."
      },
      {
        "paragraph": "Sheryl nodded and reminded Rebecca, “You can be friends with him, but he may not truly love you. ”"
      },
      {
        "paragraph": "“Mom, I know. I only treat him as a friend.”"
      },
      {
        "paragraph": "Deep down, Rebecca felt that her identity was more outstanding than Bryce’s. She was merely taking\nadvantage of him for now and enjoying the feeling of being pursued by the prime minister’s grandson."
      },
      {
        "paragraph": "A s for her future partner, she would be interested in someone who was either in a powerful position or\nranked as one of the top billionaires. Whereas others, she would turn her nose up."
      },
      {
        "paragraph": "The next day, Catherine and Matthew met in a restaurant at noon."
      },
      {
        "paragraph": "This time, she arrived there first. Only after she had waited for seven to eight minutes did Matthew\nshow up."
      },
      {
        "paragraph": "Mathew was wearing the sky-blue striped shirt she had chosen for him the other day and a pair of white\ncasual pants. Coupled with his mixed-race facial features and blue eyes, he looked just like an\ninternational model. He walked to Catherine while lapping up everyone’s attention on him in the\nrestaurant."
      },
      {
        "paragraph": "Although Catherine was faced with an attractive man like Shaun every day, she was stunned by\nMatthew’s good looks."
      },
      {
        "paragraph": "“Hey. Are you stunned by my good looks?” Matthew gestured at her with his eyebrows. “If you’re\nthinking about going after me, I might consider it.”"
      },
      {
        "paragraph": "“Stop kidding. I’m really not in the mood for it now.” Catherine forced a smile."
      },
      {
        "paragraph": "Matthew went quiet. He knew Catherine’s predicament better than anyone else because his father was\nthe one who was behind it all."
      },
      {
        "paragraph": "“Have you heard about what happened to Hill Corporation?” Catherine asked after noticing his silence."
      }
    ]
  },

  {
    "title": "Chapter 1517 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“ I know. Hill Corporation is under investigation.” Matthew sipped his coffee before he went quiet again."
      },
      {
        "paragraph": "Catherine fixed her eyes on him. He was a few years her junior, and she had always thought of him as\na brat. However, it now hit her that everyone was clever and not simple."
      },
      {
        "paragraph": "“Matthew, actually…” Catherine held the coffee cup tightly. As much as she found it embarrassing, she\nstill asked, “I know your background may be unique. But I was wondering if you had any connections\nthat could… come to Hill Corporation’s assistance? As you can see, Hill Corporation has a promising\nfuture, and Shaun is highly capable. His company will surely be able to make it into the top 30\nenterprises in the world within two years. We can work together and benefit immensely from it.”"
      },
      {
        "paragraph": "As soon as she started speaking, her face went red with shame."
      },
      {
        "paragraph": "Matthew raised his brows in astonishment. “ Indeed, my family’s background is quite outstanding. But\nit’s the Australian authorities who are investigating his company. We’ve only set up our companies in\nother countries, so we’re not familiar with Australia…”"
      },
      {
        "paragraph": "Catherine got the message."
      },
      {
        "paragraph": "He was turning her down tactfully."
      },
      {
        "paragraph": "Even so, she knew that he was right. Considering that he had just come to Australia, how could he\nhelp? Moreover, why should he help her?"
      },
      {
        "paragraph": "This time, she was at her wits’ end because even the most powerful person in Australia would not be\nable to deal with the oppressor."
      },
      {
        "paragraph": "“You’re right. Sorry for being abrupt.” Catherine forced a smile."
      },
      {
        "paragraph": "Matthew’s eyes lingered on her. He could tell that she had been quite stressed lately. There was a layer\nof powder covering the dark circles under her eyes, so it seemed that she had not been resting well at\nnight. Slightly swayed, he could not help but say, “ Actually, you and Shaun are already divorced. Why\nbother yourself with Hill Corporation that’s going to collapse? At this point, it’s better for you to keep\nyour distance from him. Who knows who Shaun has offended? You could be the next person the other\nparty is planning to deal with.”"
      },
      {
        "paragraph": "“I was the one who offended that person, and Shaun shouldn’t have been dragged into the mess. How\nnice it would’ve been if he hadn’t met me.” A tinge of agony crossed Catherine’s face."
      },
      {
        "paragraph": "Struck by a thought, Matthew deliberately asked, “ What on earth happened?”"
      },
      {
        "paragraph": "“ It has to do with some grudges in the past, which aren’t worth mentioning, ” Catherine replied\nimpassively."
      },
      {
        "paragraph": "Matthew knitted his brows. Was she too ashamed or embarrassed to explain it?"
      },
      {
        "paragraph": "“Since you sparked the trouble, you should end it. If you’ve offended and wronged that person, just\napologize and beg for forgiveness.” Matthew hinted pensively. Considering that she once helped him in\nMelbourne, that was all he could do."
      },
      {
        "paragraph": "“I won’t apologize or beg for forgiveness because I didn’t do anything wrong.” Catherine rejected\ncategorically."
      },
      {
        "paragraph": "“Since that person is your enemy, I think you can jump at the chance to escape immediately while that\nperson is dealing with Hill Corporation. If you’ve escaped to another country, I should be able to help\nyou.”"
      },
      {
        "paragraph": "Matthew purposely attempted to decoy Catherine on the assumption that she would consider it."
      },
      {
        "paragraph": "However, she frowned without a second thought. “I won’t. No matter what happens in the future, I’ll be\nwith Shaun through the highs and lows of his life.”"
      },
      {
        "paragraph": "“Is he so important? Is he more important than everything else?” Matthew was dumbfounded as he\nthought she would agree with his idea. After all, she was a despicable woman who would do anything\nto achieve her aims. It would be impossible for her to sacrifice for a man."
      },
      {
        "paragraph": "“Matthew, you’ve never loved someone. You won’t understand. It hasn’t been easy for us to come this\nfar. I don’t want to give up so easily. It’s fine. Just forget what I’ve just mentioned. Let’s eat.”"
      },
      {
        "paragraph": "Catherine had given up on the idea of asking for his help. She was just trying her luck anyway, so it\nwas no big deal even though she failed to get his help."
      },
      {
        "paragraph": "The dishes tasted delicious, yet Matthew ate with worry."
      },
      {
        "paragraph": "Catherine’s reaction was contrary to his expectations. He had probed her many times, but the longer\nhe spent time with her, the more he felt that she was the sort who valued relationships."
      },
      {
        "paragraph": "Could such a woman have betrayed her parents and killed her biological grandmother? He was a bit\nlost."
      },
      {
        "paragraph": "After finishing her food, Catherine visited the restroom and paid for the meal as well. When she\nreturned to the table, she bid goodbye to Matthew gently and politely. “Thanks, Matthew. If we get to\nmeet again, I’ll treat you to a meal again.”"
      },
      {
        "paragraph": "“Are you sure you don’t need me to send you overseas? As far as I know, you have kids, right?”\nMatthew asked while rising to his feet."
      }
    ]
  },
  {
    "title": "Chapter 1518 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "At the mention of the kids, Catherine’s face darkened. “ I’ll find a way to send my kids off. The person I\noffended is wicked, and I don’t think she’ll let my kids go. But for this matter, I should be able to settle it\nusing other means.” Matthew was stunned."
      },
      {
        "paragraph": "Catherine had labeled Rebecca as wicked. How could that be? Was Catherine not the wicked one?"
      },
      {
        "paragraph": "Matthew had a feeling that something was not right."
      },
      {
        "paragraph": "“Aren’t you going to leave with your kids?” Catherine shook her head. “I’ll head out first.”"
      },
      {
        "paragraph": "Matthew fixed his eyes on her silhouette. Deep down, he was feeling increasingly sympathetic and\ntorn. He could not make heads or tails of this woman. “Hang on.”"
      },
      {
        "paragraph": "Catherine looked back in confusion."
      },
      {
        "paragraph": "“Actually… There’s a way out.” Matthew suddenly said, “I might not be able to help you, but if you"
      },
      {
        "paragraph": "manage to convince my dad, he could save Hill Corporation.”"
      },
      {
        "paragraph": "Catherine froze."
      },
      {
        "paragraph": "Matthew gave an awkward cough. “I can’t introduce you to him, or he’ll beat me to death. But come to\nthis place at noon tomorrow.”"
      },
      {
        "paragraph": "As he was speaking, he handed her a business card with the address of a foreign bank written on it. “M\ny dad will inspect this place tomorrow. When you see him, you’ll know he’s my dad.”"
      },
      {
        "paragraph": "Catherine was a bit lost. She was just trying her luck, but she did not expect that…"
      },
      {
        "paragraph": "“Matthew, I…”"
      },
      {
        "paragraph": "“Don’t thank me. I’m just telling you my dad’s schedule. However, he has always been very cool, and\nhe won’ t help anyone. To him, I’ m probably just a complimentary product that he and my mom\ncreated, so I’m of no use actually. It all depends on you.” Matthew said as he shrugged, “It’s best not to\nlet Shaun know about it. If you’re eager to settle this issue, who knows if the opposite effect will\nhappen?”"
      },
      {
        "paragraph": "“Thank you.” Catherine held the business card firmly. “Thank you for offering me this chance. If I fail to\ngrab it, that’ll be my problem since you’ve helped me.”"
      },
      {
        "paragraph": "“You’re on your own.”"
      },
      {
        "paragraph": "Matthew was still filled with mixed emotions."
      },
      {
        "paragraph": "After all, it was his dad who had been inciting the incident. If Titus could change his mind, there might\nstill be hope for Hill Corporation."
      },
      {
        "paragraph": "Matthew thought that he would hate Catherine intensely, given that Rebecca was his own sister. Yet, to\nhis confusion, he did not feel any hatred for Catherine at all whenever he saw her. Instead, he enjoyed\nspending time with her."
      },
      {
        "paragraph": "As for Rebecca…"
      },
      {
        "paragraph": "He could not feel the sibling bond between them. Sometimes, he wondered if it was because they had\ndifferent fathers or if they grew up in different environments."
      },
      {
        "paragraph": "Sometimes, seeing Rebecca please Sheryl filled him with disgust."
      },
      {
        "paragraph": "It completely baffled him."
      },
      {
        "paragraph": "After Catherine finished her lunch, she watched the news, only to find the authorities releasing the\ninformation to the public. “Through our recent investigation of Hill Corporation, we found that their\nproducts failed to satisfy the relevant requirements. Operations at Hill Corporation have been\nsuspended at this point for rectification.”"
      }
    ]
  },
  {
    "title": "Chapter 1519 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "The news caused great commotion across Australia."
      },
      {
        "paragraph": "When the market opened at noon, Hill Corporation’s stock plummeted 20 points."
      },
      {
        "paragraph": "Catherine could not imagine how tumultuous Hill Corporation was right now."
      },
      {
        "paragraph": "She tried to call Shaun, but he did not pick it up. Hence, she called Hadley. That was when she learned\nShaun had been arrested by the authorities for investigation."
      },
      {
        "paragraph": "“Miss Jones, Young Master Hill asked you not to come to our office for the time being. Our office is\ncurrently flooded with reporters, as well as a group of business partners, who are kicking up a fuss, ”\nHadley said helplessly."
      },
      {
        "paragraph": "“What on earth is wrong with the product?” Catherine asked anxiously."
      },
      {
        "paragraph": "“Actually, there is nothing wrong with it. It is merely a pretense used to make Hill Corporation’s stock\nprices fall so that it would collapse.” Hadley explained gloomily, “You can ask Young Master Hill"
      },
      {
        "paragraph": "for further details.”"
      },
      {
        "paragraph": "Catherine was not in the mood to ponder over it, so she headed back to the Hill family’s manor early."
      },
      {
        "paragraph": "Only at 7:00 p.m. did she receive news about Shaun’s return."
      },
      {
        "paragraph": "She rushed to the main hall and discovered that Old Master Hill, Old Madam Hill, and Lea, who was\njust discharged from the hospital, had come to the manor. Even Brennan, who originally planned to\nleave the country, was here."
      },
      {
        "paragraph": "“Hadley told me that you were pulled in for investigation. Are you alright?” Catherine walked up to\nShaun and held his hands."
      },
      {
        "paragraph": "“ I’ m alright. They just kept trying to probe me.” Shaun pulled Catherine over and seated her beside\nhim. His handsome face looked calm. “But I’m not the sort who can be easily bullied.”"
      },
      {
        "paragraph": "“Don’t deceive me. They’re already trying to destroy Hill Corporation with devious means, ” Catherine\nsaid indignantly."
      },
      {
        "paragraph": "Not only was Catherine indignant, but Old Master Hill was also simmering with rage. “How shameless\nof them. Hill Corporation has been established for over 1oo years. It has been propelling Australia’s\neconomy and has created numerous job opportunities for the country. If we fell because we couldn’t\ncompete with other businesses, I’d surrender. But clearly, this oppression is unreasonable.”"
      },
      {
        "paragraph": "Lea was disappointed as well. “I heard those shareholders are thinking of pulling out, probably because\nthey’ve received some news. If this is exposed, the company’s stock will crash. Then, we’ll be required\nto restructure the company, and the Hill family might be kicked out.”"
      },
      {
        "paragraph": "Brennan’s grim eyes settled on Shaun. “The mastermind behind the incident is quite powerful. I know\nyou’re only planning to act after Nathan is appointed as the prime minister, but there’s still half a month\nto go. I’m sure the other party will go all out to defeat you within this period. Hill Corporation has just\nacquired Campos Corporation, so funds are limited. You won’t be able to get through this half a\nmonth…”"
      },
      {
        "paragraph": "Lea gazed at Shaun and opened her mouth. In the end, she chose to keep quiet."
      },
      {
        "paragraph": "Nevertheless, everyone else knew what she wanted to say, so Catherine took the initiative to speak\nup,“ Uncle Brennan, what about getting Garson Corporation to lend us a hand? The mastermind might\nnot know Shaun’s and your identities.”"
      },
      {
        "paragraph": "“No way.” Shaun shook his head firmly. “At this point, we don’t even know how powerful the\nmastermind is. Plus, they aren’t aware of my connection with Garson Corporation. What if it’s exposed?\nThey’ll be able to deal with Garson Corporation. In case you don’t know, Hill Corporation and Garson\nCorporation are the top companies in the world. Since the other party can deal with Hill Corporation, it\nis only a matter of time before they do the same to Garson.”"
      },
      {
        "paragraph": "Brennan nodded. “This is also why I haven’t acted against them yet. Essentially, I haven’t gotten a\ngrasp of the other party’s background. If we still fail to overcome them after banding together, Garson\ncan be Shaun’s way out in the future.”"
      },
      {
        "paragraph": "Catherine’s head slightly hurt."
      },
      {
        "paragraph": "At last, Old Master Hill looked at Brennan helplessly and imploringly. “Your decision is right. If Hill\nCorporation turns out to be dead in the water, please… take Shaun’s kids back to Country Y. Brennan.\nWe’ve owed you too much. Garson Corporation shouldn’t be dragged into this mess.”"
      },
      {
        "paragraph": "Brennan did not say a word, signifying his acknowledgment of Old Master Hill’s words."
      }
    ]
  },
  {
    "title": "Chapter 1520 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "As Suzie and Lucas were his grandchildren, Brennan deemed it necessary to look after them.\nHowever, he was not obliged to do the same for the other members of the Hills. He came here today\nfor the sake of his son."
      },
      {
        "paragraph": "“Dad…” Valerie leaped to her feet with a hint of dissatisfaction"
      },
      {
        "paragraph": "“Enough. You guys have enjoyed more than half of your lives. Money lost can still be earned again."
      },
      {
        "paragraph": "What matters is that you’re still alive, ” Old Master Hill responded with a deep sigh."
      },
      {
        "paragraph": "After some time, Valerie, who was in the main hall, muttered, “I wonder who the powerful enemy that\nthe Hill family has offended is.”"
      },
      {
        "paragraph": "Catherine’s eyes narrowed. She could not help but tighten his grip on Shaun’s hands."
      },
      {
        "paragraph": "Catherine remained silent throughout her journey back to the villa with Shaun at night."
      },
      {
        "paragraph": "“Cathy, don’t take my aunty’s words to heart.”"
      },
      {
        "paragraph": "Shaun suddenly stopped and caressed her tender, smooth face."
      },
      {
        "paragraph": "Overwhelmed with guilt, Catherine said, “How can I not take her words to heart? If I hadn’t looked for\nyou in Melbourne and married you back then, things would’ve been fine, and you wouldn’t have\noffended Rebecca.”"
      },
      {
        "paragraph": "“In that case, I’m at fault too. When I caught her previously, I should’ve killed her straight away and not\nlet her escape.” Shaun let out a sigh. “I was also taken advantage of by Mason.”"
      },
      {
        "paragraph": "“Anyway, if you hadn’t met me, you and Rebecca wouldn’t have been hostile toward each other, ”\nCatherine argued."
      },
      {
        "paragraph": "“No. If I were given a second chance, I’d still choose to meet you again.” Shaun lowered his head and\nfixed his eyes on her elegant, pretty face. “As I said, money lost can still be earned again. Cathy, those\ndays of being taunted and looked down on were nothing to me. I don’t mind the highs or lows of my life\nas long as I’m with you. Rebecca can target Hill Corporation, but I’ll never let her kill me. If worse\ncomes to worst, I’ll send you and the kids away from Australia. But in that case, you might need to give\nup on Hudson.”"
      },
      {
        "paragraph": "“Do I look like the kind who’s concerned about wealth?” After listening to him, Catherine wrapped her\nhands around his waist with a smile. “I have brains. If we lose the money, we can still earn it back since\nwe’re still young. But I’m… afraid that Rebecca will do something to other members of the Hills.”"
      },
      {
        "paragraph": "“Don’t worry. I’ve discussed this matter with Uncle Nathan. He said once he becomes the prime\nminister, he’ll guarantee the Hill family’s safety. If that’s not possible, we’ll bring the rest over after we’ve\nsettled down there. ” Shaun tilted his head down and kissed her lips. “Trust me.”"
      },
      {
        "paragraph": "“Mm. ” Catherine lifted her head, her lips shining alluringly under the moonlight."
      },
      {
        "paragraph": "It occurred to Shaun that it had been a while since he had kissed her passionately. At this moment, his\neyes darkened, and he lowered his head to plant a kiss on her."
      },
      {
        "paragraph": "Only after she began to lose her breath did he let her go. Suddenly, they heard Suzie tease."
      },
      {
        "paragraph": "“Not only are you guys home so late, but you’re now making out outside. Both of you are shameless.”"
      },
      {
        "paragraph": "Catherine was so shocked that her heart almost leaped out of her chest. When she turned around and\ncaught sight of the two kids’ disdainful gazes, her face burned. She had no idea how long they had\nbeen staring at her and Shaun."
      },
      {
        "paragraph": "“When did you guys… come over?” Deeply embarrassed, Catherine wished she could dig a hole and\nbury herself in it."
      },
      {
        "paragraph": "“Too long ago. I don’t remember, ” Lucas answered her question impassively."
      },
      {
        "paragraph": "Catherine was speechless."
      },
      {
        "paragraph": "It was just a kiss. How long could it have been? These two kids really drove her mad."
      }
    ]
  },
  {
    "title": "Chapter 1521 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun was so shameless that he even put his hand across Catherine’s shoulder. “There’s nothing\nwrong with it. They’ll do the same when they grow up anyway.”"
      },
      {
        "paragraph": "“Who would want to behave like you, pervert?” Suzie scoffed."
      },
      {
        "paragraph": "Lucas then mocked, “Grandma said the Hill family is going to collapse soon, yet you guys are in the\nmood to make out?”"
      },
      {
        "paragraph": "Shaun replied indifferently, “But you guys are in the mood to watch us?”"
      },
      {
        "paragraph": "Suzie asked weakly, “I just want to know if I’ll still get to eat sweets after the Hill family collapses.”"
      },
      {
        "paragraph": "Everyone was at a loss for words. What a foodie she was."
      },
      {
        "paragraph": "Lucas rolled his eyes at her. “Don’t worry. Even if the Hill family collapses, I’ ll start a business and\nmake a lot of money for you so that you won’t have to think about anything else other than spending\nmoney.”"
      },
      {
        "paragraph": "“That’s great, ” Suzie said as she lifted her chubby and cute face."
      },
      {
        "paragraph": "At the sight of the scene, Catherine and Shaun could not help but burst into laughter even though they\nwere slightly stressed just now."
      },
      {
        "paragraph": "How nice it was to be a kid. Life was so carefree."
      },
      {
        "paragraph": "In fact, everyone was born as a kid. The responsibilities just became more and more after that…"
      },
      {
        "paragraph": "All of a sudden, Catherine and Shaun became much more optimistic."
      },
      {
        "paragraph": "“Come on. Let’s get in and sleep.” Shaun directly put Suzie on his shoulder. Suzie moved her fists\naround forcefully."
      },
      {
        "paragraph": "Nevertheless, Shaun did not get mad. On the contrary, he was quite pleased."
      },
      {
        "paragraph": "Catherine looked at them with gentle eyes."
      },
      {
        "paragraph": "Previously, she felt as though a boulder was sitting on her chest. However, she felt much better now."
      },
      {
        "paragraph": "Although she would be meeting Matthew’s father tomorrow, she was now a lot more relaxed."
      },
      {
        "paragraph": "Anyhow, she had tried her best. If she failed, she would just resign herself to it."
      },
      {
        "paragraph": "She did not tell Shaun about this matter as she was afraid that he would be jealous. Another reason\nwas that Shaun’s enormous ego would definitely stop her from begging someone else."
      },
      {
        "paragraph": "The next day at noon, Catherine drove to the foreign bank that Matthew told her."
      },
      {
        "paragraph": "After taking a number, she waited at the hall for a long time before she caught sight of a group of\nleaders surrounding a tall, sturdy man as they walked out. The man was dressed in a black suit, and he\nlooked like the mature version of Matthew. With a pair of blue eyes and prominent mixed-race features,\nhe looked extremely grim. She could tell that he was undoubtedly a handsome man whom many young\nwomen were obsessed with when he was younger."
      },
      {
        "paragraph": "Nevertheless, he had a powerful presence. Catherine had seen many influential figures, but no one\nhad made her feel so intimidated like Matthew’s father."
      },
      {
        "paragraph": "Of course, such a person was very alert. Hence, it was certainly not easy to approach him."
      },
      {
        "paragraph": "Having said that, she had to give it a try."
      },
      {
        "paragraph": "She watched those executives escort Matthew’s father out of the bank, where a Bentley drove to the\nentrance. Even its windows were made of bulletproof glass."
      },
      {
        "paragraph": "Catherine gnashed her teeth, mustered her courage, and walked up to him. “President Costner.” Titus,\nwho was about to get into the car, suddenly heard the pleasant voice of a woman."
      }
    ]
  },
  {
    "title": "Chapter 1522 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Titus thought it was a senior manager from the bank. Hence, he turned his head around, only to find\nhimself shocked. He froze for a few seconds."
      },
      {
        "paragraph": "The woman, who was walking out of the bank, looked like she was in her twenties. She was wearing a\nbright yellow knitted top with an A-line maxi skirt. She exuded a clean, elegant aura. Her long milky-\nbrown hair was tied in a ponytail, and her figure was perfect. What was more breathtaking was her\nface."
      },
      {
        "paragraph": "Titus had seen a lot of beautiful women in his whole life. However, only one could make his heart throb,\nand it was Sheryl. Sheryl used to be pretty in a wild manner."
      },
      {
        "paragraph": "The young woman in front of him made him, in a daze, recall the old Sheryl."
      },
      {
        "paragraph": "They looked very alike. Those lips. That nose."
      },
      {
        "paragraph": "Although their eyes were not similar, the gleam in Catherine’s eyes looked exactly like Sheryl’s in the\npast."
      },
      {
        "paragraph": "He even felt as if time was distorted and that he had traveled back more than 20 years ago to meet\nSheryl."
      },
      {
        "paragraph": "When the senior managers at the side saw Titus’s expression, they thought he was mesmerized by\nCatherine’s beauty. As such, they immediately opened a path."
      },
      {
        "paragraph": "The senior managers were shocked as they sized up Catherine too. This young woman, who had\nsuddenly appeared, was too beautiful. Could this beautiful woman have some ambiguous relationship\nwith that mysterious big boss?"
      },
      {
        "paragraph": "Catherine did not notice the gazes of the senior managers. Instead, she took the opportunity and\nwalked over boldly. “Hello, President Costner. I’m Matthew’s friend. Can I have a few words with you in\nprivate?”"
      },
      {
        "paragraph": "Titus quickly came back to his senses."
      },
      {
        "paragraph": "After the reserved and wise Titus furrowed his brows, he swept a glance across the senior managers."
      },
      {
        "paragraph": "“President Costner, we’ll head up first.” Those senior managers got the message and left."
      },
      {
        "paragraph": "Titus rested one hand on the car’s door and the other hand in his pocket. His body was as fit as a\nglobal top male model. However, his azure eyes had a bottomless, dark gleam in them, and his\npresence made people feel intimidated even without him speaking."
      },
      {
        "paragraph": "Catherine did feel very nervous, so much that back started breaking out a cold sweat. “Excuse me,\nPresident Costner. It may be quite intrusive to disturb you all of a sudden, but let me introduce myself.\nI’m Catherine Jones. I’m here today on behalf of Hill Corporation…”"
      },
      {
        "paragraph": "“Catherine Jones…”"
      },
      {
        "paragraph": "A hint of astonishment flashed deep in Titus’s eyes."
      },
      {
        "paragraph": "The person in front of him was the wicked, evil woman that Rebecca spoke of; she was Sheryl’s evil\nniece."
      },
      {
        "paragraph": "No wonder… she looked so similar to Sheryl."
      },
      {
        "paragraph": "They said that nieces looked like their aunts, and Catherine did look more similar to Sheryl compared\nto Rebecca."
      },
      {
        "paragraph": "Moreover, he could see that Catherine was different from Rebecca. Her pretty face was natural. She\nwas such a young, stunning beauty. It was no surprise why his silly son would put in a few good words\nfor her some time back."
      },
      {
        "paragraph": "Matthew even brought Catherine to Titus."
      },
      {
        "paragraph": "It seemed like she did not only have the looks, but she was manipulative as well."
      },
      {
        "paragraph": "“What’s your relationship with Matthew?” Titus cut her off coldly right away."
      },
      {
        "paragraph": "Catherine explained, “We’re friends.”"
      },
      {
        "paragraph": "“Friends?” Titus sneered. “Sorry to be frank, but I don’t believe you would treat him just as a friend. If\nnot, why would you appear before me?”"
      },
      {
        "paragraph": "Catherine was taken aback. That was when she knew that he had misunderstood. She felt slightly\nawkward, but she still said it anyway. “I didn’t know his identity when I got to know him. I just treat him\nas a brother. I’m already married, and I have children.”"
      },
      {
        "paragraph": "In fact, Titus already had those things investigated early on. However, he did not expect she would be\nso truthful, so he was stunned for a few seconds. “"
      },
      {
        "paragraph": "Miss Jones, I heard that in Australia, there’s no pure friendship between men and women, not to\nmention such a childish, poor lie like treating someone as a brother. Frankly speaking, frequent\ninteraction between brothers or sisters without blood ties is the start of an ambiguous relationship.”"
      },
      {
        "paragraph": "Catherine was shocked. They were not at the main topic yet, and Titus had already made it look like\nshe was scheming to approach his son for money."
      },
      {
        "paragraph": "Did all wealthy people have the common illness of nitpicking?"
      },
      {
        "paragraph": "“It differs according to the person. Indeed, many people are like that. However, I can’t possibly have no\nmales friends because I’m a woman, right? Does President Costner have no female friends at all?”\nCatherine could not help but retort."
      }
    ]
  },
  {
    "title": "Chapter 1523 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "It felt like the conversation could not go on."
      },
      {
        "paragraph": "However, Catherine had some admiration for that kind of man."
      },
      {
        "paragraph": "“President Costner, if you insist on thinking that I have an ambiguous relationship with Matthew, I think\nI’m not the only one whom you’re humiliating. You’re humiliating your son and looking down on your\nson too.”"
      },
      {
        "paragraph": "Catherine reacted quickly and retorted, “Although this is my first time meeting you, President Costner, I\ncan see that you’re a very wise and calm person. A son who was brought up by a successful person\nlike you must be very clever and restrained. He shouldn’t be someone who’s easily seduced by beauty\nor be in an ambiguous situation with someone whom he knows is married and with children.”"
      },
      {
        "paragraph": "A hint of amusement flashed across Titus’ deep- set, handsome face."
      },
      {
        "paragraph": "This woman made him think of the old Sheryl again. She was eloquent and just as sharp."
      },
      {
        "paragraph": "If he insisted that Catherine had seduced Matthew, he would be indirectly admitting Matthew’s\nintelligence and character."
      },
      {
        "paragraph": "“You have a sharp mouth, but… I’ve seen a lot of women like you.” Titus was not surprised."
      },
      {
        "paragraph": "“That’s for sure. If you were only in your twenties, you might think I’m slightly special because I dared to\nset a trap in front of you. However, at your mature age, I guess the number of women who have used\nthis method to approach you isn’t on the lesser side.”"
      },
      {
        "paragraph": "Catherine smiled respectfully and said, “But I don’t care. I didn’t come here to make you remember me.\nI just think maybe there’ll be benefits to reap if we talk for a while.”"
      },
      {
        "paragraph": "“You’re talking about Hill Corporation?” Titus sneered sarcastically. “I don’t know what Matthew told\nyou, but I don’t care about Hill Corporation at all, and I have no intentions of collaborating with Hill\nCorporation. Moreover, everyone knows that Hill Corporation won’t be able to hold on for long.”"
      },
      {
        "paragraph": "“People have been saying Hill Corporation can’t hold on for long since the first half of the year."
      },
      {
        "paragraph": "However, within a few months, Hill Corporation turned the situation around.”"
      },
      {
        "paragraph": "Catherine paused before she continued saying, “ You’re a foreign bank. But according to my\ninvestigations, the current development of your bank in Australia isn’t very good. I’ve heard Matthew’s\ntone, and it seems like he’s planning to achieve some results in Australia. But frankly speaking, he’s\nstill not accustomed to Australia’s market. Hill Corporation is a 1oo-year mega- corporation, and Shaun\nis decisive and far-sighted. I f Hill Corporation collaborates with the Costner family, the resources that\nShaun has now will enable your Australian banks to have a 2o percent increase in annual income\nevery year. That won’t be a problem.”"
      },
      {
        "paragraph": "Titus let out an unconvinced snort upon hearing that. “Enough. If you have sufficient connections and\nresources, why would you be oppressed by someone else and fail to turn the situation over? I may as\nwell tell you that I indeed can help Shaun. However, since I have such notable connections in Australia\nthat can help him, why should I collaborate with him?”"
      },
      {
        "paragraph": "“President Costner, since you said you can help him, your connections are definitely notable."
      },
      {
        "paragraph": "However, if you’re so capable, I’m curious why the annual income of this foreign bank of yours didn’t\nincrease after its five years of establishment in Australia? Instead, it’s slowly declining.” Catherine\nlooked at him without avoiding his gaze."
      },
      {
        "paragraph": "She was a woman, but she was fearless. Her eyes were like knives, as if she could slash everything\nopen."
      },
      {
        "paragraph": "At that moment, Titus started reviewing that woman in a serious light. “It looks like you’ve done your\nhomework. Did Matthew tell you all these things?”"
      },
      {
        "paragraph": "“He wouldn’t possibly tell me. I came to the bank this morning, saying that I want to take out a huge\nloan. I chatted with the bank manager, and I managed to obtain some useful information.”"
      },
      {
        "paragraph": "Catherine admitted it openly. “After all, we can only advance by knowing the other party well. If I came\nto negotiate with you without knowing a thing, you wouldn’t treat me as a madman, but you’d look down\non me. Perhaps you’d even take me as a shameless woman, thinking that maybe I wasn’t awake and\nthat I simply came to negotiate based on my looks and the slight connection I had with your son.”"
      },
      {
        "paragraph": "Titus’s good-looking brows raised slightly. “This is interesting.”"
      },
      {
        "paragraph": "“ I don’ t need your interest. I just want to let you see the benefits of this.” Catherine said, “I reckon your\nbusiness must be huge overseas, but it’s not adapted to Australia’s market. However, Australia is a\nhuge slice of cake. Don’t you think it’s a shame to leave this place empty?”"
      },
      {
        "paragraph": "“It seems like you’re really going all out, Miss Jones.” Titus grinned. “But as you said, my business is\nhuge overseas, so I don’t really care about this place. To be honest, if this weren’t the homeland of\nMatthew’s mother, I wouldn’t even have allowed him to come here for development.”"
      }
    ]
  },
  {
    "title": "Chapter 1524 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Do you not care, or… are you afraid of failure?”"
      },
      {
        "paragraph": "Catherine spoke boldly. Just as she finished speaking, she felt Titus’s bone-chilling gaze on her."
      },
      {
        "paragraph": "She really felt a sense of danger and intimidation that she had never felt before."
      },
      {
        "paragraph": "“You’re trying to provoke me.” Titus smiled coldly. Suddenly, he bent down, and his tone was harsh. “To\nbe honest, if you let my son sleep with you for a night, maybe I’ll consider your request.”"
      },
      {
        "paragraph": "Catherine frowned. “I’m sorry, but I’m here to negotiate with you and not to talk about s*x. I think you’re\nmistaken.”"
      },
      {
        "paragraph": "“The mistaken one is you. You’re the one begging me now.” Titus was expressionless."
      },
      {
        "paragraph": "“Yes, I’m begging, but I have my principles. Money can be earned again if it’s lost, but if all principles\nare gone, that’s beyond saving.”"
      },
      {
        "paragraph": "Although Catherine regretted coming, she had tried her best, and she accepted the reality of things. “\nSince you’re not willing, forget it. However, I hope you can consider it properly. After all, no king in\nhistory hated having more territory.”"
      },
      {
        "paragraph": "She took two steps back after she spoke. “Sorry for disturbing you, President Costner.”"
      },
      {
        "paragraph": "After she finished speaking, she turned around and left."
      },
      {
        "paragraph": "Titus stared at her silhouette for some time. Then, he got in the backseat, deep in thought."
      },
      {
        "paragraph": "He had to admit that Catherine was quite unique."
      },
      {
        "paragraph": "Hill Corporation was almost driven into a corner, yet she still kept that poor pride of hers when\nnegotiating with him."
      },
      {
        "paragraph": "Perhaps she was playing hard to get, or since Hill Corporation was not hers, she could only do so\nmuch."
      },
      {
        "paragraph": "On the road, Titus gave Matthew a call. “Get over here.”"
      },
      {
        "paragraph": "Matthew quickly returned to the villa."
      },
      {
        "paragraph": "That day, Sheryl had brought Rebecca shopping. Titus wanted to go to the bank for an inspection, so\nhe did not follow. However, he did not expect he would meet Catherine because of that."
      },
      {
        "paragraph": "“Dad…” Seeing his father’s expression, Matthew"
      },
      {
        "paragraph": "knew that Catherine had gone to look for his father."
      },
      {
        "paragraph": "Before Matthew could finish his sentence, Titus grabbed an apple from the table and threw it at him.\n“How dare you leak my whereabouts to your mother’s enemy? You’re quite amazing, huh?”"
      },
      {
        "paragraph": "Matthew was so startled that he jumped aside to avoid it. “Dad, I didn’t mean anything by that. I just\nwanted for you to meet Catherine.”"
      },
      {
        "paragraph": "Titus snorted. “You want me to save her, right? Matthew, don’t forget how much your mom hates her.\nShe caused your grandmother’s death.”"
      },
      {
        "paragraph": "“Did my grandmother really die because of Catherine? I don’t think she’s that kind of person.” Matthew\nmustered his courage and muttered, “ Didn’t you meet her today too?”"
      }
    ]
  },
  {
    "title": "Chapter 1525 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Matthew, are you suspecting your sister’s words for the sake of an outsider?”"
      },
      {
        "paragraph": "Titus gazed at Matthew deeply. “If your mom finds out…”"
      },
      {
        "paragraph": "“ I’m not suspecting Rebecca. I just think… maybe there’s a misunderstanding.” Matthew said in a low\nvoice, “Yesterday, Catherine came to look for me to see if I could help. I rejected her at first, but I tested\nher by saying I could send her overseas. However, she rejected it. I can tell that she really loves\nShaun. From a bystander’s point of view, she’s quite kind and loyal. Would such a person harm her\nbiological grandmother and parents?”"
      },
      {
        "paragraph": "“Matthew, she was abducted for more than ten years and was just found not long ago. It’s not\nimpossible to do that sort of thing if she doesn’t have a lot of feelings for the Jones family’s members.\nShe might be deceiving you. That woman is very cunning.”"
      },
      {
        "paragraph": "Titus’s gaze was indifferent. “To be honest, I’m not interested in the matters of the Jones family. It’s only\nbecause the Jones family used to be your mom’s family. All I want is to solve this as soon as possible\nand take your mom back to Neah Bay. I don’t want to create extra issues.”"
      },
      {
        "paragraph": "Matthew was taken aback. However, he was not a fool. His dad saying “she might be deceiving you”\nand the two words “might be” carried a lot of information."
      },
      {
        "paragraph": "“Dad, I admit she definitely is cunning. If she’s not, she won’t be the director of a listed company."
      },
      {
        "paragraph": "However, you’ve seen a lot of scheming people before. After talking to her for a while, what kind of\nperson do you think she is?” Matthew suddenly returned a question."
      },
      {
        "paragraph": "Titus’s deep, cold eyes glanced at him indifferently."
      },
      {
        "paragraph": "Matthew shrugged and smiled. “From the perspective of a man, she’s an interesting person. I guess\neven if she’s begging someone, she won’t put herself down in front of you. I think she’s a prideful\nperson. Moreover, she looks quite like Mom when she was young, right?”"
      },
      {
        "paragraph": "“Shut up. ” Titus’s gaze darkened. “Your mom is one of a kind.”"
      },
      {
        "paragraph": "“Okay, okay. Maybe it’s because she looks a little similar to Mom, but when I saw her, I felt a sense of\nfamiliarity to her.” Matthew thought for a while before saying seriously, “I didn’t say I would help her. I\njust wanted to give her a chance to get to know you. There is nothing I can do if she can’t grab it. I did\nmy best anyway.”"
      },
      {
        "paragraph": "“You didn’t tell her my identity, right?” Titus warned."
      },
      {
        "paragraph": "“Of course not. I’m not a fool.” Matthew pouted. “I can’t talk to you anymore. I have to go to the\nconstruction site and have a look.”"
      },
      {
        "paragraph": "“You really plan to open a bank in Australia?” Titus frowned and recalled Catherine’s words. “Your uncle\nhad come here to try it out once too."
      },
      {
        "paragraph": "However, it’s indeed tough for a foreign bank to open its markets here.”"
      },
      {
        "paragraph": "“It’s mainly because we don’t have enough connections with the people in the business world here. I’ll\ndo my best. Australia is advancing rapidly, so the market is huge. It’s a shame to leave such a big\ncake.”"
      },
      {
        "paragraph": "After Matthew spoke, Titus went silent. He remembered what Catherine had said. That little brat…"
      },
      {
        "paragraph": "She was not simple indeed."
      },
      {
        "paragraph": "If he knew nothing about the rotten matters of the Jones family, he would admire Catherine quite a lot.\nShaun had charisma too. With such a wife aiding him, Hill Corporation would only advance further."
      },
      {
        "paragraph": "Too bad…"
      },
      {
        "paragraph": "If only she were Sherry’s daughter."
      },
      {
        "paragraph": "When that thought flashed across his mind, Titus felt astonished."
      },
      {
        "paragraph": "“Dad, what are you thinking?”"
      },
      {
        "paragraph": "“Nothing. Go on with your work.” Titus was so close to telling him to get lost."
      },
      {
        "paragraph": "“Oh.” Matthew left feeling depressed."
      },
      {
        "paragraph": "An assistant walked up to Titus. “Should we get someone to keep an eye on Young Master in case\nCatherine keeps pestering him?”"
      },
      {
        "paragraph": "After a moment of silence, Titus suddenly sneered. “ Keep an eye on him then. I want to see whether\nCatherine is really that slick. If she looks for Matthew again, I’ll use a quicker method to deal with her.”"
      }
    ]
  },
  {
    "title": "Chapter 1526 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Of course, if Catherine did not look for Matthew, Titus would have to view her in a different light."
      },
      {
        "paragraph": "After giving out his orders, Titus gave Sheryl a call. His tone was gentle. “Wifey, when are you coming\nback?”"
      },
      {
        "paragraph": "“I’m still shopping.” Sheryl was the same as most women when she was shopping. “Aren’t we staying in\nCanberra for some time? I plan to buy more clothes and skincare products with Rebecca.”"
      },
      {
        "paragraph": "“Buy some clothes for me too. ” Titus immediately said in a cutesy manner, “Come back faster. I’ll wait\nfor you to have dinner.”"
      },
      {
        "paragraph": "Sheryl was quite speechless at that 4o—year —old man for still acting cutesy."
      },
      {
        "paragraph": "“Mom, I think this dress suits you a lot, ” Rebecca said with a smile as she brought a blue embroidered\ndress over."
      },
      {
        "paragraph": "Sheryl took a glance at the dress and thought the style was ordinary. However, seeing that Rebecca\nrecommended it with such enthusiasm, she said, “"
      },
      {
        "paragraph": "Let’s buy it then.”"
      },
      {
        "paragraph": "“Aren’t you going to try it on?” Rebecca asked. “No need.”"
      },
      {
        "paragraph": "Sheryl handed her card over."
      },
      {
        "paragraph": "Rebecca was delighted as she thought Sheryl liked it a lot. She knew that she had a good eye. After\nthat, she kept giving Sheryl recommendations when, in fact, her taste was different from Sheryl’s."
      },
      {
        "paragraph": "Sheryl had a headache. Her daughter’s taste was actually a little tacky, but she could not bear to hurt\nher. After shopping for a while, her enthusiasm dulled. Hence, she suggested going back."
      },
      {
        "paragraph": "“Mom, why don’t we go back after a meal?” Rebecca suggested. Actually, she still had a lot of things\nshe had not bought. Since she had Sheryl, who was a walking ATM, shopping with her, she wanted to\nlook around more."
      },
      {
        "paragraph": "“Forget it. Your uncle doesn’t like eating outside.” Sheryl rejected her."
      },
      {
        "paragraph": "After exiting the mall, they stood at the entrance, waiting for the driver to come over."
      },
      {
        "paragraph": "As it was 5:00 p.m., the number of cars on the street gradually increased."
      },
      {
        "paragraph": "Joel was sitting in the car, reading documents until he felt tired. After massaging the middle of his\nbrows, he opened the window. The car happened to be outside one of the most bustling malls in\nCanberra."
      },
      {
        "paragraph": "However, when he saw a silhouette by the roadside, Joel’s body froze. He suddenly shouted, “ Stop the\ncar.”"
      },
      {
        "paragraph": "The driver was startled. “But we can’t stop the car here for too long.”"
      },
      {
        "paragraph": "“I told you to stop. Hurry up.” Joel opened the door of the car straight away."
      },
      {
        "paragraph": "The driver had never seen him like that before, so the former immediately stepped on the brake."
      },
      {
        "paragraph": "Joel could not bother about the cars on the road as he quickly walked toward that silhouette. Only\nwhen he got nearer could he get a good look at the face. The woman in front of him looked a lot like the\nwoman he had yearned for, day and night, more than 2o years ago. Her eyes were still those pretty"
      },
      {
        "paragraph": "eyes, her nose was still so dainty, and her lips were still so seductive and stunning. However, she did\nnot have the youthfulness she used to have. In fact, she was more elegant, charming, and demure."
      },
      {
        "paragraph": "Joel felt as if he was dreaming. He even became weak-kneed."
      },
      {
        "paragraph": "“Sherry, is that you?”"
      },
      {
        "paragraph": "He stared at her in disbelief."
      },
      {
        "paragraph": "Sheryl did not notice Joel at all until he walked up to her. She raised her gaze and was stunned."
      },
      {
        "paragraph": "The man in front of her looked over 5o years old, and there were some traces of age on his face.\nNevertheless, she could tell that he was a handsome, sophisticated man when he was young."
      }
    ]
  },
  {
    "title": "Chapter 1527 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "‘Joel Yule…’"
      },
      {
        "paragraph": "Those were the two words that instantly appeared in Sheryl’s mind."
      },
      {
        "paragraph": "When she found out that she had a past with Joel, she searched for Joel’s information on the internet\nbehind Titus’ back. The pictures on the internet were very similar to the person in front of her."
      },
      {
        "paragraph": "He just looked younger in the pictures."
      },
      {
        "paragraph": "“Excuse me. I don’t know you. You’ve got the wrong person.” Sheryl’s expression was cold. Having\nheard of the man before, she did not have a good impression of him nor want to have any interactions\nwith him."
      },
      {
        "paragraph": "Joel was taken aback. Then, he shook his head. “It’s impossible. I remember how you look. Sherry, I\nthought you were dead…”"
      },
      {
        "paragraph": "He even lost control and grabbed Sheryl’s arm agitatedly."
      },
      {
        "paragraph": "However, just as he touched her, a man, probably a bodyguard, stepped forward and shoved Joel’s\nhand away. After that, the bodyguard used his arm to shield Sheryl quickly. “Madam, please get in the\ncar.”"
      },
      {
        "paragraph": "Sheryl walked toward the car right away. Rebecca, who was at the side, immediately got in the car\nnervously too. She did not expect they would bump into Joel so quickly. Luckily, Joel had never seen\nher before."
      },
      {
        "paragraph": "“ Sheryl, I’m mistaken. You’re Sheryl Jones. ” Joel went after her agitatedly, but he was shoved away\nby the bodyguard again. Discontented, he said with bloodshot eyes, “ Sherry, I know you hate me, and"
      },
      {
        "paragraph": "you don’t want to acknowledge me. But don’t you remember Cathy? She’s your daughter.”"
      },
      {
        "paragraph": "Sheryl ignored him and got in the car straight away."
      },
      {
        "paragraph": "It was impossible to see what was going on in the car once the car door closed."
      },
      {
        "paragraph": "After the bodyguard got in the car, the car soon left."
      },
      {
        "paragraph": "Joel wanted to go after it, but the traffic police ran over and stopped him. “Sir, please be careful of the\ncars. What you’re doing is dangerous.”"
      },
      {
        "paragraph": "Joel was in a daze. At that instant, it was as if his soul was sucked clean."
      },
      {
        "paragraph": "Was he mistaken? However, that person did look a lot like Sheryl. Although more than 2o years had\npassed, she looked like she was in her thirties."
      },
      {
        "paragraph": "Besides, people could look similar, but similarities in demeanor could not possibly be fake, right?"
      },
      {
        "paragraph": "He felt as if he was in a dream and not yet awake."
      },
      {
        "paragraph": "In the sedan, Rebecca felt so nervous that her heart was all over the place."
      },
      {
        "paragraph": "Just now, Joel shouted saying, “Don’t you remember Catherine? She’s your daughter.”"
      },
      {
        "paragraph": "At that moment, Rebecca almost suffocated. Luckily, she had told a lie and said that Catherine\npretended to be Sheryl and Joel’s daughter. If not, things would get troublesome. It was fortunate that\nSheryl did not acknowledge Joel or argued about their daughter as well."
      },
      {
        "paragraph": "She calmed down and clenched her fists."
      },
      {
        "paragraph": "No, she could not let Sheryl have a chance to suspect her."
      },
      {
        "paragraph": "“Mom, just now… that was… my dad,” Rebecca said while pretending to sound bitter."
      },
      {
        "paragraph": "“I know.” Sheryl was still stunned too, but she quickly came back to her senses. Contempt was written\nacross her face. “He’s an idiot who can even mistake his biological daughter.”"
      },
      {
        "paragraph": "After she spoke, she patted the back of Rebecca’s hand. “Never mind him. He doesn’t deserve to be\nyour dad.”"
      }
    ]
  },
  {
    "title": "Chapter 1528 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rebecca nodded her head. She pretended to be open-minded and said, “I used to be quite upset over\nit, but I’ve thought it through. I’m fine as long as you’re here, Mom. Besides, I don’t think Uncle Titus\nwants you to get in touch with Joel anymore. Uncle Titus treats you well, and he accepts me too. I don’t\nwish for you two to fight over it. Even if Joel mistakes Catherine as his daughter, it’s okay. I’ll get\nrevenge on Catherine anyway. I don’t need his repentance and apology either. He’ll only pester us\nmore.”"
      },
      {
        "paragraph": "Sheryl nodded, reassured. At the same time, Rebecca’s words reminded her that she should stay away\nfrom Joel if she saw him next time. She did not want to have conflicts occurring between her and Titus\ntoo."
      },
      {
        "paragraph": "After some thought, she said to the bodyguard at the passenger seat, “Don’t tell Titus about today’s\nincident.”"
      },
      {
        "paragraph": "“Okay.” The bodyguard nodded respectfully. However, Rebecca said, “Mom, you don’t wish to\nacknowledge Joel, but will he investigate you? I think he still has feelings for you. Moreover, he has\nsome influence in Canberra. If he finds out… It’ll be quite troublesome. Perhaps he’ll even show up in\nfront of Uncle Titus. Why don’t we have someone delete the security footage by the roadside and the\nmall?”"
      },
      {
        "paragraph": "Remembering that Titus was a jealous person, Sheryl agreed with Rebecca. Therefore, she\nimmediately had the bodyguard delete all footage of her at the mall that day."
      },
      {
        "paragraph": "On the other hand, after Joel got in the car groggily, the driver cast him a nervous glance. “Are we still\ngoing to the new warehouse for inspection?”"
      },
      {
        "paragraph": "“No.”"
      },
      {
        "paragraph": "Joel came back to his senses and immediately called Catherine. “Where are you?”"
      },
      {
        "paragraph": "“Dad, I’m at Hudson Corporation.”"
      },
      {
        "paragraph": "“Come back to the Yule family’s residence today. I have something to tell you.” Joel hung up after he\nspoke."
      },
      {
        "paragraph": "Catherine had not heard such a serious tone in a long time. As such, she did not dare to delay and\nwent back to the Yule family’s residence after finishing up her work."
      },
      {
        "paragraph": "In the spacious living room, Joel sat on the sofa. He had a photo in his hand. He was so immersed in\nthe photo that he did not even notice that Catherine had come back."
      },
      {
        "paragraph": "Catherine walked over. She noticed it was a photo that Joel had taken with Sherry when he was young.\nIt was a sweet photo of both of them hugging each other at the meadow."
      },
      {
        "paragraph": "“Dad, you actually have a photo with my mom.” Catherine smiled and teased him. “I’ve never seen you\ntaking it out before.”"
      },
      {
        "paragraph": "“I’ve always put it in the safe. This is a picture of your mom and me on a trip to the meadow when she\nwas 20 years old.” Joel touched Catherine’s face bitterly. “It’s similar. It’s really similar.”"
      },
      {
        "paragraph": "“Dad, what is similar? I can’t understand you.” Catherine sat down beside him. Only then did she notice\nthat Joel’s eyes were red. She was stunned."
      },
      {
        "paragraph": "“Cathy, I think I saw your mom today, but she didn’t admit it. ” Joel suddenly dropped a shocking truth."
      },
      {
        "paragraph": "Catherine was shocked. “Wasn’t my mom… dead a long time ago?”"
      },
      {
        "paragraph": "“Yes, I thought she was dead all along too.” Joel said emotionally, “But that person really looked very\nsimilar to your mom. Her eyes, nose, and lips. I wouldn’t have been mistaken. Moreover, thinking about\nit carefully, your mom encountered a typhoon that year, but the Jones family never found her body.”"
      },
      {
        "paragraph": "Catherine’s heart trembled upon hearing his words."
      },
      {
        "paragraph": "Indeed, they did not find Sheryl’s body that year. Without a corpse, it could not be 1oo percent sure that\nthe person was dead."
      },
      {
        "paragraph": "Catherine asked hastily, “Dad, did you talk to her?”"
      },
      {
        "paragraph": "“I was very agitated at that time and asked if she was Sherry. However, she looked as if she didn’t\nknow me and said I confused her with someone else. After that, a bodyguard came forward and\npushed me away. ” Joel said bitterly, “After all, it had been more than 20 years. I was afraid I was\nmuddled, so I found your mom’s photo. The more I look at it, the alike I think they are. The only\ndifference is that she looks older and more mature.”"
      },
      {
        "paragraph": "Catherine could not control herself from feeling emotional too. Although she had never met Sheryl\nbefore, Sheryl was the one who founded Hudson Corporation."
      },
      {
        "paragraph": "Her mother was the woman she admired the most."
      }
    ]
  },

  {
    "title": "Chapter 1529 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "However, Catherine was calmer compared to Joel. “ Dad, since you think she looks similar, let’s\ninvestigate it. Maybe it’s like those scenes on the television where my mom might’ve lost her memories.\nAfter all, if she was still alive, how could she have abandoned my grandparents and her company?”"
      },
      {
        "paragraph": "Joel was stunned. “You’re right. Sherry was such a filial person. If she was alive but didn’t come back,\nthere must be some reason for it.”"
      },
      {
        "paragraph": "“The most urgent matter now is to find that woman. ” Catherine asked, “Where did you see her? Check\nthe security footage. What car did she get into when she left? Where did she go?”"
      },
      {
        "paragraph": "She believed that with Joel’s capabilities, investigating those things would be quite easy."
      },
      {
        "paragraph": "Joel nodded. He stood up immediately. “I met her at the mall. She must’ve been shopping. I’ll go to the\nmall myself now.”"
      },
      {
        "paragraph": "“I’ll go with you.”"
      },
      {
        "paragraph": "Catherine went with him."
      },
      {
        "paragraph": "Joel contacted the mall’s general manager and asked him to check that evening’s security footage."
      },
      {
        "paragraph": "However, when they were at the security room, the employee said, “This evening’s security footage has\nbeen deleted.”"
      },
      {
        "paragraph": "Joel and Catherine were stunned. Joel asked in a hurry, “What about the footage of the mall’s\nentrance?”"
      },
      {
        "paragraph": "“ It’s all gone.” The employee shook his head. “I don’t know what happened, but the security footage\nfrom 3:00 p.m. to 5:00 p.m. are all gone.”"
      },
      {
        "paragraph": "The general manager glared at him fiercely. “You work here, and yet you don’t know the footage has\nbeen deleted?”"
      },
      {
        "paragraph": "The employee was embarrassed by being scolded. “I really don’t know. I went to the bathroom in the\nmiddle, and it was gone when I came back.”"
      },
      {
        "paragraph": "“Can I have a look at your computer? ” Catherine asked politely."
      },
      {
        "paragraph": "“Of course.” The employee immediately gave way to Catherine."
      },
      {
        "paragraph": "After Catherine sat down, she checked the system’s information and said, “General Manager, don’t\nblame him. It should’ve been a hacker’s doing. The hackers planted a virus through the mall’s public\nnetwork, hacked into the security room’s computer, and deleted the footage.”"
      },
      {
        "paragraph": "The general manager was shocked. “That hacker couldn’t possibly have hacked into the company’s\naccount, right?”"
      },
      {
        "paragraph": "“Don’t worry. This hacker just wanted to delete the security footage. Moreover, a hacker like this should\nbe one of the top internationally. Your mall’s competitor still doesn’t have the capability of hiring such a\nperson.”"
      },
      {
        "paragraph": "Catherine left the mall after thanking the general manager."
      },
      {
        "paragraph": "Joel’s expression was solemn. “Cathy, how can it be a coincidence? To think that the security footage\nwas deleted at such a timing.”"
      },
      {
        "paragraph": "Catherine did not say anything. She had a lot on her mind."
      },
      {
        "paragraph": "However, Joel was not willing to give up. He said, “ There must be security cameras by the roadside."
      },
      {
        "paragraph": "Let’s go to the traffic police department.”"
      },
      {
        "paragraph": "“Dad, don’t you think the other party has thought o f that as well? I reckon even if you go, it might’ve\nbeen deleted too.” Catherine looked toward her father with helplessness and disappointment. “ What\nyou said just now was right. It’s too much of a coincidence.”"
      },
      {
        "paragraph": "Although Joel was desperate, it did not mean he was a fool. His elegant face was filled with confusion\nand disappointment."
      },
      {
        "paragraph": "Catherine was disappointed too. Nevertheless, she said, “In fact, if we came to investigate and the\nsecurity footage was still there, that meant that person might not be my mom. However, since the\nsecurity footage is gone, it means that they don’t want you to continue investigating them. Why is that?\nIt’s most probably because… your guess is right. That woman is really my mom. She recognized you\nthis evening but didn’t want to have anything to do with you or let you investigate this matter.” Joel\nlooked defeated. He was very lonely and in agony. “You’re right. What I did back then was inhumane.\nThe fact that Nicola was cheating on me even became public knowledge. Everyone is mocking me and\nscolding me as an idiot. Your mom is such a prideful person, so she must despise and hate me. It’s fine\nif she doesn’t acknowledge me, but you’re her biological daughter. Doesn’t she want to acknowledge\nyou?”"
      }
    ]
  },
  {
    "title": "Chapter 1530 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "His words pricked Catherine’s heart."
      },
      {
        "paragraph": "She used to think Jeffery and Sally were her parents, but it turned out they were not."
      },
      {
        "paragraph": "Catherine consoled herself that her mother did not abandon her on purpose. Her mother was gone\nbecause of an accident."
      },
      {
        "paragraph": "However, did she not yearn for motherly love too? She did."
      },
      {
        "paragraph": "Nevertheless, after tens of years of going without motherly love, she could not force it if the other\nperson was unwilling."
      },
      {
        "paragraph": "After all, Catherine had gotten through more than 20 years without one, and she was more resilient\nthan average girls her age."
      },
      {
        "paragraph": "“Dad, she has been missing for more than 2o years, not five or six years, or one or two years. A lot of\nthings can happen in 2o years, like building a family and a career and giving birth to a child. You said it\nyourself that she had a bodyguard with her, so she must have an unusual identity. Moreover,"
      },
      {
        "paragraph": "you’ve never met her before despite having lived in Canberra for so long. This means that she has only\ncome to Canberra recently. Maybe she had been living overseas all along.” Catherine mercilessly\nexposed some facts."
      },
      {
        "paragraph": "Joel laughed bitterly. “You’re right. I even got married and divorced too. If your mom is still alive, how\ncould she still be unwed? I remember when I met her in the evening, there was a girl by her side. I\ndidn’t look carefully, but the girl did look somewhat similar to her. Maybe that was her daughter.”"
      },
      {
        "paragraph": "“Is it? Then it’s definitely her daughter.” Catherine smiled calmly."
      },
      {
        "paragraph": "However, in actuality, she felt very uncomfortable. She had a mother too, but her mother had another\nfamily and child."
      },
      {
        "paragraph": "How could she put it into words? If she suddenly showed up and called her mom ‘Mom’, she might be\nthe ‘extra baggage’ that people meant, right?"
      },
      {
        "paragraph": "“Dad, forget it. Maybe she doesn’t want to have any more ties with her past. What if we insist on\ninvestigating and end up meeting her husband?"
      },
      {
        "paragraph": "He’d surely be bothered with the fact that she had a child before. Perhaps that’d even affect her current"
      },
      {
        "paragraph": "marriage. Let’s just take it as if my mom died more than 20 years ago.”"
      },
      {
        "paragraph": "Only by thinking that way could Catherine overcome it."
      },
      {
        "paragraph": "Joel’s heart ached, and he felt guilty. His daughter was too sensible. She would never trouble her\nparents, and she did not ask for anything from her parents either. However, that made him feel like he\nowed her more. “Cathy, your mom isn’t that kind of person. She definitely loves you. Maybe it’s just as\nwhat you said. She doesn’t remember.”"
      },
      {
        "paragraph": "“If she doesn’t remember, why would she come back and delete the security footage?” Catherine’s lips\ncurved. “Dad, people will change.”"
      },
      {
        "paragraph": "Suddenly, Joel did not know what to say. He was just lost."
      },
      {
        "paragraph": "Was Sheryl really married?"
      },
      {
        "paragraph": "In order to hide her past for the sake of her other family, she would much rather not acknowledge her\nchild and the Jones family?"
      },
      {
        "paragraph": "Looking at her father’s absent-minded look, Catherine said, “Actually, there’s still a way to confirm\nwhether she’s my mom or not. It’s very simple. Since she’s back, maybe she’ll go to Melbourne to visit\nand clean the grave of my grandparents if she still has some conscience. We’ll know if there are signs\nthat the grave has been cleaned.”"
      },
      {
        "paragraph": "Joel’s eyes lit up, and he remained silent. Catherine did not talk either."
      },
      {
        "paragraph": "In fact, she did not want to find out. If she knew more, she would feel that her mother had abandoned\nher."
      },
      {
        "paragraph": "However, Catherine did not blame her either. As a mother, Sheryl had already left Hudson Corporation\nto Catherine and fulfilled her obligations. Catherine could not request too much of her."
      },
      {
        "paragraph": "“Dad, I’m going back to the Hill family’s manor. ” Catherine said, “Hill Corporation’s situation hasn’t\nbeen good these days.”"
      }
    ]
  },
  {
    "title": "Chapter 1531 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“ I’ve heard of it too.” Joel sighed. “ If you ask me, you shouldn’t have made up with Shaun in the first\nplace. You wouldn’t be facing such immense pressure now. Cathy, your life is tough.”"
      },
      {
        "paragraph": "“Dad, Hill Corporation is actually being targeted because of me. It’s an enemy that I’ve offended. ”\nCatherine explained bitterly, “Hill Corporation is involved in this because of me.”"
      },
      {
        "paragraph": "Joel was astonished. “How did you offend people with such complex backgrounds?”"
      },
      {
        "paragraph": "“It’s my cousin, Rebecca. She escaped overseas previously and somehow got acquainted with some\npeople. ” Catherine reminded Joel, “ I suspect after Hill Corporation meets its downfall, the next will be\nme. Dad, you must… be careful lately.”"
      },
      {
        "paragraph": "“Cathy, I’ll think of a way to help you.” Joel became anxious."
      },
      {
        "paragraph": "“You can’t help me. She has the executive council backing her.” Catherine shook her head. “Don’t\nmake a move either. Don’t be involved in this because of me. The most important thing is to keep your\npower. Shaun has said that if he can’t hold out anymore, he’ll choose to leave Australia with me and\nlive in Country Y.”"
      },
      {
        "paragraph": "Joel nodded. “Shaun’s idea is correct. Staying alive is more important than anything. If you want to start\na business again there, I can sell some of my shares for your startup capital. With both your\ncapabilities, you should be able to start over again no matter where you go.”"
      },
      {
        "paragraph": "“Thank you, Dad. You don’t have to worry about us. If you really don’t want me to worry, then just stay\nout of this.”"
      },
      {
        "paragraph": "After Catherine consoled Joel, she drove her car out and left."
      },
      {
        "paragraph": "Catherine was not in a heavy mood when she returned home. However, she did not mention the matter\nregarding Sheryl to Shaun, mainly because Shaun was very busy recently and facing a great deal of\nstress. She did not want him to worry about her."
      },
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "Catherine called Freya to Hudson Corporation. “What happened? Why did you call me here all of a\nsudden?” Freya dragged a chair over and sat opposite Catherine. She bit her lips. “ Is it because of Hill\nCorporation? I’ve been going to Hill Corporation every day recently. My godfather said “It’s alright. I\nknow you and Rodney have done your best. ” Catherine interrupted her. Then, she"
      },
      {
        "paragraph": "took out a document from the drawer and passed it to Freya."
      },
      {
        "paragraph": "Freya opened it and had a look. It was a contract for Hudson Corporation’s transfer of ownership. “\nYou’re…”"
      },
      {
        "paragraph": "“ I’m handing over Hudson Corporation to you,” Catherine said openly."
      },
      {
        "paragraph": "Freya was dumbfounded. “What… do you mean?”"
      },
      {
        "paragraph": "“As soon as Hill Corporation falls, Rebecca will target Hudson Corporation. That is why I must sell\nHudson Corporation before that. If I sell it publicly, Rebecca will surely suppress the price or plan a\nhostile takeover. It’ll be impossible to sell it at a good price, so I’m giving it to you.”"
      },
      {
        "paragraph": "Catherine explained patiently, “You’re the only friend by my side whom I can trust. It’s also because\nyou’re Nathan’s goddaughter. If the people behind Rebecca still dare to make a move after I gave\nHudson Corporation to you, it’d be equivalent to slapping Nathan’s face in public. They won’t dare.”"
      },
      {
        "paragraph": "Freya understood it in a daze. However, she still found it shocking. “Sister, do you know Hudson\nCorporation’s current market value? It’s hundreds of billions of dollars, yet you’re just giving it to me.\nAren’t you afraid I’ll seize your company and not give it back to you?”"
      },
      {
        "paragraph": "“ If the company would fall into Rebecca’s hands, I’d rather give it to you.” Catherine was pretty open-\nminded. “Moreover, I guess Shaun and I will take the children and leave Australia after some time. I’m\nreally unsure as to when I’ll be back. It’ll have to wait until we’re at least strong enough to go against\nthe top forces in Australia. But who knows how long that’ll take? If I can’t come back, just take it as a\ngift from me.”"
      }
    ]
  },
  {
    "title": "Chapter 1532 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Enough, stop saying those things. Worse comes to worst, I’ll buy your…”"
      },
      {
        "paragraph": "“Eldest Young Lady Lynch, do you have enough money in your pocket to buy such a huge Hudson\nCorporation?” Catherine found it hilarious. “Let’s just go with the flow. Moreover, if I don’t give it to you\ntoday, perhaps the last bit of effort that my mom has left to me will be destroyed. At least if it’s in n your\nhands, you’ll take care of it properly, right?”"
      },
      {
        "paragraph": "Freya was filled with distress. “But I don’t know how to manage it.”"
      },
      {
        "paragraph": "“Don’t worry. I’ve informed General Manager Wolfe beforehand. If there’s anything you don’t know, you\ncan contact me anytime. Although I’ve withdrawn in name, I’ll still guide you from behind.”"
      },
      {
        "paragraph": "After that, Catherine paused for a moment. An apologetic look flashed in her eyes. “But… Do you want\nto discuss this with Nathan?”"
      },
      {
        "paragraph": "Freya gave it some thought and waved her hand. “ Forget it. My godfather… He’s too careful when he\ndoes things. If I discuss this with him, he might not agree. You’re my friend, so I must help you with this.\nYou can put the company under my name, but I won’t take your annual dividend. After a few years,\nwhen this problem ends, I’ll return the company to you.”"
      },
      {
        "paragraph": "“Freya, thank you.” Catherine was genuinely grateful. “But I can’t just let you shoulder this responsibility\nfor me for nothing. Let’s divide the dividend between us equally. If not, I’ll feel bad. ”"
      },
      {
        "paragraph": "“Do you think I’m short of that little amount of money?” Freya pouted. “How can you and Shaun both\nstart over if you don’t have a source of funds? Stop talking nonsense. If you keep nagging, I won’t\nagree to help you.”"
      },
      {
        "paragraph": "Catherine smiled. Having a friend like this for her whole life was enough. “Okay, then. Put down your\nsignature. However, it’ll be announced to the public that you purchased my company.”"
      },
      {
        "paragraph": "“I know.” Freya nodded. She took the pen and put down her signature."
      },
      {
        "paragraph": "That evening, Freya and Catherine did all the necessary procedures. The next day, Catherine and\nHudson Corporation’s official Facebook account posted a statement. [The company’s shareholder, Miss\nCatherine Jones, has signed a share transfer"
      },
      {
        "paragraph": "agreement with a third party and handed in a shareholder change application. From the next day\nonward, Catherine Jones will officially step down from the position of Hudson Corporation’s director,\nand she will be relieved of all her duties. Currently, the sole shareholder of Hudson Corporation is Miss\nFreya Lynch.]"
      },
      {
        "paragraph": "When that news got out, it shocked the netizens."
      },
      {
        "paragraph": "[F*ck, what on earth happened? Shaun just got investigated, and Catherine sold Hudson Corporation?]"
      },
      {
        "paragraph": "[Could it be that Hill Corporation is facing a cash flow crisis, so Catherine has sold her company to\nsave Shaun? She must’ve lost her mind because of love.]"
      },
      {
        "paragraph": "[I think Australia’s business world is silently having a major clean-up.]"
      },
      {
        "paragraph": "[Totally. Hill Corporation is going down, and Hudson Corporation has been sold. Coincidentally, in t\nseems like Wesley’s Golden Corporation has signed a huge international order recently, and its share\nprices are skyrocketing. Is the scene about to change?]"
      },
      {
        "paragraph": "[Did everyone notice this? The new shareholder, Freya Lynch, is Nathan’s goddaughter. Freya’s"
      },
      {
        "paragraph": "identity is not a simple one. Hudson Corporation will develop better under her leadership, right?]"
      },
      {
        "paragraph": "[Why don’t we buy some of Hudson Corporation’s shares? I think it’ll go up drastically.]"
      },
      {
        "paragraph": "While the netizens were engaged in a heated discussion, some reporters rushed to Hudson\nCorporation’s building. They happened to see Catherine packing her stuff and leaving, looking forlorn."
      },
      {
        "paragraph": "After the reporters took some pictures, they rushed forward to interview her. “Miss Jones, why did you\nsuddenly sell Hudson Corporation? Is it because there’s a problem with Shaun’s cash flow?”"
      },
      {
        "paragraph": "“Yes, that’s right. I plan to overcome this crisis with him,” Catherine said with an affectionate expression\non her face."
      }
    ]
  },
  {
    "title": "Chapter 1533 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“But is it worth it to give up a career you’ve painstakingly built for a man?” Even the reporter felt like\nslapping Catherine awake and stopping her from losing her mind because of love."
      },
      {
        "paragraph": "Catherine made a righteous expression. “It’s indeed not worth it to me. But to Australia, I think it’s worth\nit. Hudson Corporation is nothing more than a real estate company. However, Hill Corporation is\ndifferent. Since a few years back, Shaun has invested tens of billions of dollars to develop a microchip\nthat belongs to Australia."
      },
      {
        "paragraph": "“And now, Shaun has imported advanced electrical appliances from overseas. Some time back, Hill\nCorporation even acquired Campos Corporation with the intention to develop more advanced products.\nThis is a good thing that can facilitate the speedy advancement of cutting-edge technology and enable\nAustralia’s technology to have a global ranking. I hope I can help Shaun to overcome this crisis. I do\nnot wish for such a good corporation to fall.”"
      },
      {
        "paragraph": "The reporter’s blood was boiling with passion from hearing Catherine’s words. “But as far as I know, the\ninvestigation of the related departments said Hill Corporation’s products are substandard…”"
      },
      {
        "paragraph": "“I don’t understand why it turned out like that too. We tested the product before during the press\nconference, and everything was quite good.”"
      },
      {
        "paragraph": "Catherine said with a helpless expression, “Of course, if there’s really a problem somewhere, Hill\nCorporation will fully cooperate with the investigation and rectify the problem to improve Hill\nCorporation. I hope everyone can give Hill Corporation a chance instead of tarring it with the same\nbrush. That will make companies specializing in research and development disappointed.”"
      },
      {
        "paragraph": "“You’re right. I hope Hill Corporation can overcome this hardship.”"
      },
      {
        "paragraph": "After the video of Catherine’s interview was uploaded to the internet, it garnered the heated discussion\nof the whole of Australia again. Most of the netizens who suspected Hill Corporation at first even began\nto side with Hill Corporation."
      },
      {
        "paragraph": "[I believe what Catherine said. She’s a tough and rational woman. She would never sell off her\ncompany just for the sake of a man. She’s not that silly.]"
      },
      {
        "paragraph": "[Actually, what Catherine said is right. Hill Corporation has invested a lot of money to develop products\nwith advanced technology these years. It’s evident that Shaun wants Australia to have our own cutting-\nedge technology.]"
      },
      {
        "paragraph": "[I don’t understand why there’s a need to investigate Hill Corporation all of a sudden. Campos\nCorporation wasn’t investigated previously. Did Shaun offend somebody?]"
      },
      {
        "paragraph": "[Hill Corporation was investigated just after they launched their new products. It’s evident that some\npeople don’t want Hill Corporation to rise.]"
      },
      {
        "paragraph": "[But with Shaun’s status, no one should be able to oppress them openly. Unless it’s the people on the\nvery top…]"
      },
      {
        "paragraph": "[I heard the Hill family and the Snow family’s relationship is quite good…]"
      },
      {
        "paragraph": "Hill Corporation."
      },
      {
        "paragraph": "Shaun was in a meeting."
      },
      {
        "paragraph": "A few shareholders in the meeting room were fighting endlessly regarding Hill Corporation’s future."
      },
      {
        "paragraph": "“It can only drop for one more week at most. The company is about to apply to be delisted. If you ask\nme, it’s better to sell it off early.”"
      },
      {
        "paragraph": "“The problem isn’t about selling it off. If we don’t pay the huge amount of compensation for the breach\nof contract, we’ll be taken into custody.”"
      },
      {
        "paragraph": "“President Hill.” The meeting room’s door rapped, and Hadley entered in a hurry. “The share prices\nhave rebounded.”"
      },
      {
        "paragraph": "Upon hearing that, all the shareholders took out their phones and were very surprised. Hill\nCorporation’s shares had already reached the limit down when the share market opened today. Hence,\nthey did not expect the share prices to rebound and increase."
      },
      {
        "paragraph": "“What… What’s happening?” A shareholder was so emotional that he almost cried."
      },
      {
        "paragraph": "“I think it’s related to Miss Jones.” Hadley said with a smile, “Everyone, please take a look at the\nheadlines of today’s news.”"
      },
      {
        "paragraph": "Not only the shareholders, but even Shaun took out his phone too. When he saw Catherine’s interview,\na sense of pride welled in his heart."
      },
      {
        "paragraph": "Catherine did not tell him about this beforehand, so he had no clue at all."
      },
      {
        "paragraph": "However, no one understood Catherine’s thoughts better than Shaun."
      }
    ]
  },
  {
    "title": "Chapter 1534 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "His woman… was too clever."
      },
      {
        "paragraph": "“President Hill, did Miss Jones really sell Hudson Corporation to support Hill Corporation?” Director\nOwens, who was the most experienced shareholder, asked emotionally."
      },
      {
        "paragraph": "Shaun looked toward him. A low chuckle rang from his throat. “Director Owens, will you let your wife\nsell off her company to support Hill Corporation in overcoming this crisis?”"
      },
      {
        "paragraph": "Director Owens was stunned."
      },
      {
        "paragraph": "“You won’t. None of us would. ” Shaun stood up. “ We’re all selfish because we still have children, and\nwe can’t possibly bet everything on Hill Corporation. Hence, don’t expect Catherine to give the money\nshe has earned from selling her company as funds for Hill Corporation. Even if she agrees, I won’t.\nAfter all, the company isn’t mine alone.”"
      },
      {
        "paragraph": "The directors exchanged glances. No one said a word. After all, Shaun had a point there."
      },
      {
        "paragraph": "Shaun glanced at everyone and skillfully changed the subject. “But the public thinks that Catherine is\nreally giving the money to Hill Corporation, so they’re having more confidence in Hill Corporation. This\nis the reason the share prices rebounded. It’ll allow us to have a moment of recovery too.”"
      },
      {
        "paragraph": "“Miss Jones is really smart.” Director Owens praised, “Young Master Hill, you have a good eye.”"
      },
      {
        "paragraph": "That flattery improved Shaun’s mood. He was not even that happy when other people complimented\nhim. “Have everyone seen the comments on the internet? Catherine’s interview made the common\naudience reverse their opinions of Hill Corporation. There are even lesser mentions that our company’s\nproducts are problematic. Most of it is conspiracy theories that we’re being oppressed.”"
      },
      {
        "paragraph": "“You’re right, President Hill.” The directors nodded. They were a little enraged too. “However, our\nproducts didn’t have a problem from the start. It’s the higher-ups who are nitpicking at us.”"
      },
      {
        "paragraph": "“Since the public is on our side, let’s use this as a breakthrough and pressure the higher-ups. If it’s\nnecessary, we can put Nathan in power earlier.”"
      },
      {
        "paragraph": "Shaun dropped a bomb. Everyone was shocked."
      },
      {
        "paragraph": "Shaun sneered. “At this point, there’s no going back for Hill Corporation.”"
      },
      {
        "paragraph": "Afterward, Shaun contacted Chester, and they mobilized all the internet ghostwriters."
      },
      {
        "paragraph": "At night."
      },
      {
        "paragraph": "Rebecca was having dinner with the Costner family when suddenly, Titus’s phone rang."
      },
      {
        "paragraph": "After answering the call, his handsome face turned cold for a while. Then, an amused grin flashed\nacross his face."
      },
      {
        "paragraph": "That grin made Sheryl glance at him twice. “What happened?”"
      },
      {
        "paragraph": "Titus patted her soft hair. Before he could say something, the butler suddenly said that Bryce had\ncome."
      },
      {
        "paragraph": "“Let him in,” Titus said indifferently. “Why is he here?” Rebecca muttered."
      },
      {
        "paragraph": "Titus swept a glance at Rebecca until Bryce came in."
      },
      {
        "paragraph": "“Uncle Titus, Aunty Sheryl, I’m sorry to disturb your meal. ” Bryce tried to curry favor with them. After\nall, the identities of those two people were too"
      },
      {
        "paragraph": "special."
      },
      {
        "paragraph": "“What business do you have?” Sheryl thought he had come over to woo Rebecca."
      },
      {
        "paragraph": "Bryce’s expression stiffened. After a while, he said in a low voice, “My grandfather asked me to come\nover to say that we’ve put too much pressure on Hill Corporation during this period. We have to let go a\nlittle.”"
      },
      {
        "paragraph": "“What do you mean?” Rebecca could not stop herself from speaking with dissatisfaction. “Didn’t your\ngrandfather say we’d bring down Hill Corporation in the shortest amount of time?”"
      }
    ]
  },
  {
    "title": "Chapter 1535 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Bryce smiled bitterly. “Haven’t you all seen the trending search on the internet? Now everyone in\nAustralia is leaning toward Hill Corporation’s side. Everyone is saying that we, the Zeller family, are\ntargeting Hill Corporation and that we obstructed the development of Australia’s cutting-edge\ntechnology. If this goes on, the reputation that my grandfather has built over all these years will be\ncompletely destroyed.”"
      },
      {
        "paragraph": "“Enough, I got it. You can go back. Your grandfather can’t be blamed for this matter. We’re the ones\nwho underestimated them. ” Titus waved his hand lazily."
      },
      {
        "paragraph": "“Uncle Titus…” Rebecca started becoming anxious."
      },
      {
        "paragraph": "“Hubby, what’s going on?” The expression on Sheryl’s pretty face was not that pleasant either. She\ninitially thought teaching Shaun a lesson should be a very easy matter."
      },
      {
        "paragraph": "Titus did not say anything. Only after Bryce had left did he hold his wife’s hand and said, “ I only got to\nknow about this just now too. You’ve all underestimated Shaun too much. Or rather, underestimated\nCatherine.”"
      },
      {
        "paragraph": "Matthew had already taken a quick look through Australia’s news. As such, he understood everything."
      },
      {
        "paragraph": "“Mom, Dad’s right. If this goes on, Australia is going to change inside out.” Matthew said, “You’ll\nunderstand once you watch this video.”"
      },
      {
        "paragraph": "Sheryl played the video, where a pretty, young woman that made people’s eyes lit up appeared."
      },
      {
        "paragraph": "She was stunned. She kept looking at that face, and an indescribable feeling welled up in her heart."
      },
      {
        "paragraph": "That was Catherine? Jeffery’s daughter."
      },
      {
        "paragraph": "There was a saying that nieces looked like their aunts, but Catherine looked too much like Sheryl."
      },
      {
        "paragraph": "“Mom, she’s too cunning.” Rebecca’s furious voice pulled Sheryl back to her senses. “Catherine is\nalways like that. Her habit is to use the media’s words to mislead people. Freya is her best friend. They\nboth must’ve agreed on this beforehand. The shareholder might’ve been changed to Freya, but the\nmanipulator behind the scenes is definitely still Catherine. She must’ve expected that we won’t dare"
      },
      {
        "paragraph": "to lay a hand on the Snow family.” Sheryl came back to her senses. That was when she remembered\nwhat Catherine said to the reporter in the interview."
      },
      {
        "paragraph": "“Mom, we don’t have to have Hudson Corporation. I can overlook all the years I’ve been driven into a\ncorner because of Catherine too. However, Granny cannot be left unavenged,” Rebecca said\ndiscontentedly."
      },
      {
        "paragraph": "A coldness appeared in Sheryl’s eyes. “Don’t worry. I won’t spare that person.”"
      },
      {
        "paragraph": "Rebecca felt slightly more comfortable hearing that."
      },
      {
        "paragraph": "However, when she thought about Catherine and Shaun still being able to counterattack in that\nsituation, she had the urge to smash everything around her. Nevertheless, she had to stay calm in front\nof the Costner family. If not, all her efforts would have been for naught."
      },
      {
        "paragraph": "“But the Zeller family has said that they want to hold back for now.” Rebecca said aggrievedly, “do we\nreally have no choice?”"
      },
      {
        "paragraph": "Sheryl felt a little bit ashamed. After all, she was a figure who was feared by everyone internationally.\nShe did not expect that after coming to Australia, she could not even handle Shaun. It was too\nembarrassing."
      },
      {
        "paragraph": "“Of course we have a way. I’ll give Manager Scott a call…”"
      },
      {
        "paragraph": "“Sherry… ” Titus cut her off abruptly. His tone was serious. “You can’t. If you cut off the petroleum\nsupply to Australia, it’ll cause major instability on a global level.”"
      },
      {
        "paragraph": "Sheryl felt embarrassed. She did not expect her husband to expose her thoughts."
      },
      {
        "paragraph": "Seeing that Titus’s expression was not right, Rebecca said in a hurry, “Mom, Uncle Titus is right.\nThere’s no need to do that just because of my personal grudges. I’ll think of a way myself.”"
      },
      {
        "paragraph": "Sheryl felt upset hearing that. As a mother, she felt useless. She could only turn her head toward Titus.\n“ Since you oppose my idea, then we’ll use your idea. No matter what, I have to exact revenge for the\nJones family. I don’t want to delay this for too long either. Shaun will only grow more quickly if you give\nhim more time.”"
      },
      {
        "paragraph": "After she spoke, she brought Rebecca upstairs. She had lost the appetite to eat."
      },
      {
        "paragraph": "Downstairs, Titus looked at the table of food. His feelings were complicated."
      },
      {
        "paragraph": "“Dad, I think Catherine transferred the company to Freya because she’s thinking of leaving Australia.”"
      },
      {
        "paragraph": "Matthew lowered his voice and said to his father, “ She probably knows that after Hill Corporation goes\ndown, we’ll be targeting Hudson Corporation. That was why she gave the company to Freya. If we still\nchoose to go against Hudson Corporation, it’ll be equivalent to going against Nathan.”"
      }
    ]
  },
  {
    "title": "Chapter 1536 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“You’re right.” Titus folded his arms across his chest. There was no anger in his eyes. Instead, there\nwas a gleam of approval and pity."
      },
      {
        "paragraph": "He thought Catherine would be thick-skinned and continue to look for him. Yet, he did not expect she\nwould give up and even give Hudson Corporation away."
      },
      {
        "paragraph": "That woman was indeed firm."
      },
      {
        "paragraph": "Besides being resolute, what was rare was that she did not forget to utilize the fact that she sold\nHudson Corporation to help Hill Corporation. At the same time, she even improved the image of Hill\nCorporation."
      },
      {
        "paragraph": "Shaun grabbed that opportunity by joining the connections he had and counterattacked with all his\nmight."
      },
      {
        "paragraph": "That was why the Zeller family was intimidated."
      },
      {
        "paragraph": "It seemed to dawn on Titus as to why his son would choose to help Catherine."
      },
      {
        "paragraph": "Actually, capable men admired smart and pretty women a lot. Catherine was one of them."
      },
      {
        "paragraph": "To be honest, Titus could not bear to continue too."
      },
      {
        "paragraph": "“Dad, do we really still have to go against Catherine and Shaun?” Matthew was feeling more reluctant\nto, especially after seeing Catherine’s cleverness. He could not stop himself from liking that woman\nmore."
      },
      {
        "paragraph": "“Didn’t you hear your mom’s tone?” Titus glanced a t Matthew calmly. “However, I’m worried that even if\nthe Zeller family loosened up on the Hill family, Shaun might not let the Zeller family off the hook. ”"
      },
      {
        "paragraph": "Startled, Matthew gasped. “That can’t be.” “We’ll see tomorrow.”"
      },
      {
        "paragraph": "Titus looked outside of the window."
      },
      {
        "paragraph": "Matthew was a little lost."
      },
      {
        "paragraph": "The next day, the news on the internet was no longer about the Hill family. Instead, a lot of the Zeller\nfamily’s scandals were exposed."
      },
      {
        "paragraph": "For example, the children of the Zeller family committed tax evasion and tax fraud."
      },
      {
        "paragraph": "Another example was the Zeller family members were corrupt and accepted bribery."
      },
      {
        "paragraph": "The whole of Australia was shocked. There were even people calling for Prime Minister Zeller to be\ninvestigated."
      },
      {
        "paragraph": "As such, Nathan quickly formed a committee to investigate Prime Minister Zeller. Then, he joined the\nexecutive council earlier than expected."
      },
      {
        "paragraph": "All of those things took everyone by surprise."
      },
      {
        "paragraph": "When they came back to their senses, the last name of Australia’s prime minister was Snow."
      },
      {
        "paragraph": "Matthew was utterly dumbfounded until Bryce came to their house to seek help."
      },
      {
        "paragraph": "“Uncle Titus, you must save my grandfather. Please save the Zeller family. ” Bryce was freaking out. He\nthought the appearance of the Costner family could change his fate. However, he did not expect it\nwould push the Zeller family into the abyss instead. Upon recalling that he got into a fight with Rodney\nsome time back, he was even more cautious when he left his home."
      },
      {
        "paragraph": "“ I’ll save the Zeller family.” Titus sat on the chair indifferently. “But in the end, it’s still the Zeller family\nwho’s useless. Shaun was already oppressed, yet he and the Snow family could still have their way.”"
      },
      {
        "paragraph": "Bryce’s face flushed red. “We really didn’t expect that Shaun would be so bold. I don’t even know how\nhe managed to persuade the Snow family.”"
      },
      {
        "paragraph": "“I’ll have somebody negotiate with the Snow family tomorrow. You can leave. I’ll only save the Zeller\nfamily members at most. As for the influence of the Zeller family, I won’t help all of you to get it back.”\nTitus then asked the guest to leave coldly."
      }
    ]
  },
  {
    "title": "Chapter 1537 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“But we did it for your Costner family…”"
      },
      {
        "paragraph": "Before Bryce had the chance to finish, Titus’s cold gaze swept over him with the aura of a king who\nstood high above him."
      },
      {
        "paragraph": "He shuddered and could only turn to Rebecca, who seemed at a loss. “Rebecca, help me say\nsomething. Why don’t… you send someone to protect me on the way back? I’m afraid that Shaun will\ncatch me and cause trouble for me. You know very well that I humiliated Catherine last time because of\nyou.”"
      },
      {
        "paragraph": "Disbelief was still written all over Rebecca’s face."
      },
      {
        "paragraph": "She could not understand. When they met at the clubhouse a few days ago, she held her head high\nand told Catherine she would pay. As such, Bryce acted extremely haughtily in front of Catherine and\nRodney too."
      },
      {
        "paragraph": "It was just a few days ago, but now, Bryce was so humbled that he did not even dare to go out alone."
      },
      {
        "paragraph": "Were Shaun and Catherine that strong?"
      },
      {
        "paragraph": "“Matthew, get someone to escort him back, ” Sheryl said with a complicated frown."
      },
      {
        "paragraph": "Matthew nodded and told someone to send Bryce away while keeping a low profile."
      },
      {
        "paragraph": "Titus touched Sheryl’s hair. “ I’ll go out for a while. Stop thinking and go to bed early.”"
      },
      {
        "paragraph": "Sheryl nodded. She knew that he was probably going to help solve the Zeller family’s problem."
      },
      {
        "paragraph": "After Titus left, Rebecca grabbed Sheryl’s hand with red eyes. “Mom, I think I shouldn’t go out\ntomorrow. Catherine must have sent people everywhere to look for me.”"
      },
      {
        "paragraph": "Sheryl looked at her frightened appearance and frowned slightly. “Rebecca, you’re my daughter. Why\nare you so timid?”"
      },
      {
        "paragraph": "Rebecca froze and muttered, “Mom, I… I’m scared. These years, I’ve always been hiding. I even had\nto undergo cosmetic surgery.”"
      },
      {
        "paragraph": "Sheryl’s heart ached. After all, it was because she did not fulfill her duty as a mother. Even as she was\ntrying to get revenge now, she encountered all sorts of bumps in the road."
      },
      {
        "paragraph": "“Mom, can you really avenge me?” Rebecca looked dazed."
      },
      {
        "paragraph": "“Are you doubting me?” Sheryl was a little annoyed."
      },
      {
        "paragraph": "“No, I… I don’t know how to say this.” Rebecca lowered her head. “Are you going to put pressure on\nthe Snow family again? The Snow family and the Hill family have a good relationship, so they might not\nlisten to us. But Uncle Titus doesn’t want you to use force either.”"
      },
      {
        "paragraph": "Sheryl’s head began to ache. That was indeed troublesome."
      },
      {
        "paragraph": "“Mom, how about… we don’t do it ourselves? We can borrow a hand from someone else. Catherine\nstill hasn’t divorced Wesley, and Wesley is a narrow-minded person. He wants nothing more than to get\nrid of those two people after he was cuckolded.” Rebecca suddenly smiled and clapped her hands\ntogether. “As long as we help Wesley a little, we don’t need to take action. He’ll naturally deal with\nCatherine.”"
      },
      {
        "paragraph": "Sheryl was slightly moved. “That’s one idea. I’ll leave this matter to you. If you need help, just tell Titus\nor Matthew.”"
      },
      {
        "paragraph": "“Thank you, Mom.” Rebecca nodded happily. When she turned around, her eyes had turned sinister."
      },
      {
        "paragraph": "In the Hill family’s manor."
      },
      {
        "paragraph": "At the long dining table, Catherine ate for a long time before noticing that no one had moved."
      },
      {
        "paragraph": "Everyone was looking at her."
      },
      {
        "paragraph": "The scene was a little awkward."
      },
      {
        "paragraph": "“Why are you all looking at me? Eat.” She placed a slice of bacon on Suzie’s plate."
      },
      {
        "paragraph": "Old Master Hill said gratefully, “Cathy, you’re the Hill family’s benefactor. It’s thanks to you that Hill\nCorporation has managed to overcome this crisis.” Old Madam Hill glared at the old man. “ If you ask\nme, you should be apologizing to her instead. In the past, we even thought she wasn’t worthy of\nShaun. We were too short-sighted.”"
      }
    ]
  },
  {
    "title": "Chapter 1538 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Yes, yes, yes, I was too short—sighted.” The arrogant Old Master Hill apologized incessantly."
      },
      {
        "paragraph": "Spencer also raised his glass. “Thank you, Catherine.”"
      },
      {
        "paragraph": "Lea smiled and said, “Meeting you is Shaun’s fortune.”"
      },
      {
        "paragraph": "Even Valerie put on a brave face and took the initiative to say, “ I… offended you a lot in the past. I’m\nsorry.”"
      },
      {
        "paragraph": "Catherine was greatly surprised. Valerie and she had always been at odds, so she did not expect\nValerie to take the initiative to apologize to her."
      },
      {
        "paragraph": "However, since Valerie expressed her goodwill, there was no need to hold onto past grudges anymore."
      },
      {
        "paragraph": "Catherine raised her glass. “What’s past is past.”"
      },
      {
        "paragraph": "“Yes, we’re a family from now on.” Shaun grinned and wrapped his arm around her waist."
      },
      {
        "paragraph": "Catherine’s face burned, and she could not help but"
      },
      {
        "paragraph": "elbow his chest. What family? She was not divorced yet."
      },
      {
        "paragraph": "As if aware of her concerns, Old Master Hill said solemnly, “Shaun, you have to find a way to let her\ndivorce Wesley as soon as possible. You can’t continue dragging it on like this.”"
      },
      {
        "paragraph": "“I wanted to do something about it a while ago, but it was delayed because of Hill Corporation’s\ntroubles,” Shaun explained."
      },
      {
        "paragraph": "“Do it as soon as possible.” Spencer suddenly said,“ Golden Corporation seems to have signed a big\ndeal from abroad. Their stock price has soared, and their market value has almost exceeded a hundred\nbillion. If the Jewell family hadn’t been suppressing them, they would have become the largest\npharmaceutical group in the country.”"
      },
      {
        "paragraph": "“Are you serious?” Valerie was shocked. “Wasn’t he suppressed by Hill Corporation all along? How did\nhe make a comeback?”"
      },
      {
        "paragraph": "“Wesley isn’t a simple man.” Spencer frowned. “He still has some tricks up his sleeve.”"
      },
      {
        "paragraph": "“Thank you for the reminder, Uncle Spencer.” Shaun nodded. He was originally in a good mood, but the\nconversation had made him feel a little heavy."
      },
      {
        "paragraph": "After dinner, the two children were handed over to Lea, and Shaun held Catherine’s hand to the car."
      },
      {
        "paragraph": "“Where are we going? I still have to tell stories to the children. ” Catherine sat in the passenger seat\nand muttered."
      },
      {
        "paragraph": "“We’re going to watch a movie. We’ve been so busy lately that we’ve barely had time for ourselves.”\nShaun helped her fasten her seatbelt."
      },
      {
        "paragraph": "Catherine fell silent."
      },
      {
        "paragraph": "Indeed, both of them have been too tense lately. Now that the investigation on Hill Corporation had\nstopped, they could finally breathe a sigh of relief."
      },
      {
        "paragraph": "Of course, she did not expect Shaun’s method to be so tough that he even overthrew the Zeller family."
      },
      {
        "paragraph": "She could not help but look at the man driving beside her, feeling as if she had not known him well\nenough."
      },
      {
        "paragraph": "“I know I’m very handsome, but you don’t have to keep staring at me like that. ” Shaun squeezed her\npalm."
      },
      {
        "paragraph": "“I’m looking at how amazing you are. How did you get so much dirt on the Zeller?” She could not help\nbut ask."
      },
      {
        "paragraph": "“Do you think the Hill family spent so many years creating Liona for them to freeload?” Shaun smirked.\n“ I didn’t want to expose those matters at first. After all, I’m a businessman. It’s enough if I do my part.\nThe Zeller family and I have nothing to do with each other either, but they’ve crossed the line this time.”"
      },
      {
        "paragraph": "“Then why didn’t you expose them earlier?” Catherine pouted. “You made me worried for so long.”"
      },
      {
        "paragraph": "“It’s because Hill Corporation was plagued by negative news. It was your words that reversed the\npublic’s view of Hill Corporation. At the same time, it made the people on the Internet suspect that Hill\nCorporation was deliberately suppressed and caused dissatisfaction toward the Zeller family. Only\nwhen I join forces with the Snow family to reveal all the dirt on the Zeller family will it be possible to\nsuppress the Zeller family once and for all.”"
      },
      {
        "paragraph": "Shaun held Catherine’s hand tightly. “At the end of the day, it was you who saved Hill Corporation, and\nit was you who saved me. Cathy, you’ve saved me time and time again. This time, the only thing I can\ndo is devote my life to you.”"
      },
      {
        "paragraph": "No, no, no. If they were not married, what if she got tired of him one day? It would be easy for her to\nkick him away."
      },
      {
        "paragraph": "After all, Eldest Young Master Hill was not very confident of himself because of a certain problem."
      },
      {
        "paragraph": "“Cathy, I…”"
      },
      {
        "paragraph": "“It’s not often we go out to watch a movie, so can we not discuss this? Let’s talk about something\nhappy instead.” Catherine interrupted him and changed the subject. She took out her phone. “ Which\ncinema are we going to?”"
      },
      {
        "paragraph": "“Your choice.”"
      },
      {
        "paragraph": "Catherine finally chose a cinema closer to the manor. The movie screening was at 7-3o p.m. However,\nwhen they went in, there were barely any people inside. The plot was quite melodramatic and poor too."
      },
      {
        "paragraph": "“Why did you pick this movie? No one is watching it.” Shaun had never watched such a bad movie. “\nThe Hollywood movie at 8 p.m. must be much better.”"
      },
      {
        "paragraph": "“Watching a movie at 8 p.m. is too late. After two hours, it’ll be almost 11 p.m. by the time we get home,\nand Suzie and Lucas will definitely be asleep."
      }
    ]
  },
  {
    "title": "Chapter 1539 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine raised her brows and smiled without a word."
      },
      {
        "paragraph": "Shaun looked at her deep in the eyes and said suggestively, “Cathy, when are you going to let me\ndevote myself to you?”"
      },
      {
        "paragraph": "“Can you focus on driving?” Catherine did not answer his question."
      },
      {
        "paragraph": "“Do you really want to live like this with me forever, without remarrying?” Shaun’s tone sounded a little\npitiful."
      },
      {
        "paragraph": "The more she shone, the more she was praised. Although he was proud, he still felt a little uneasy."
      },
      {
        "paragraph": "After all, if they were not married, they would never be legally recognized as husband and wife."
      },
      {
        "paragraph": "“I’m not even divorced yet. How can I remarry you?” Catherine glanced at him. “Besides, why should\nwe remarry? I think that what we have now is quite nice.”"
      },
      {
        "paragraph": "Shaun was speechless."
      },
      {
        "paragraph": "That’s not good. ” Catherine shook her head while eating her Haagen-Dazs ice cream."
      },
      {
        "paragraph": "Shaun’s handsome face darkened. “Then let them sleep. It’s just for one night. Aunty Yasmine will take\ncare of them. Our alone time only happens once a month.”"
      },
      {
        "paragraph": "“No, you always pester me after the children are asleep. ” Catherine blushed and rolled her eyes at\nhim. He kept saying he could not do it, but he still liked to do naughty things, and he always made her\nfeel antsy."
      },
      {
        "paragraph": "“That’s different. Those are all sneaky touches. ” Shaun was very sad. “Besides, it’s just kissing and\ntouching. We don’t do anything else.”"
      },
      {
        "paragraph": "The topic brought up his pain again."
      },
      {
        "paragraph": "Catherine was most afraid of him talking about this matter, so she hurriedly said, “Alright. Of course, it’ll\nbe different after having children. You can’t always think about having alone time with me. The children\nhave to go to preschool during the day, but they wish we could accompany them too. Children are only\nclingy at this age.”"
      },
      {
        "paragraph": "Shaun said helplessly, “When I didn’t have children with you before, I wanted children a lot, but now\nthat I have children, I feel like they’re the third wheel…”"
      },
      {
        "paragraph": "“Shaun Hill, if you say one more word, I’m ignoring you.” Catherine feigned anger and glared at him."
      },
      {
        "paragraph": "This man really was… Children were so cute, yet he called them a third wheel."
      },
      {
        "paragraph": "“Babe, I was wrong.” Shaun hurriedly leaned over and kissed her mouth. “Babe, your mouth is so\nsweet.”"
      },
      {
        "paragraph": "“Duh. I’m eating ice cream.” Catherine pushed him away with a burning face. “Don’t bother me when\nI’m eating.”"
      },
      {
        "paragraph": "Then, she shoved the spoon in her mouth."
      },
      {
        "paragraph": "A teasing glint flashed in Shaun’s eyes. “I want to eat too.”"
      }
    ]
  },
  {
    "title": "Chapter 1540 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "After that, Shaun sealed her lips with his."
      },
      {
        "paragraph": "When Catherine realized how he wanted to ‘eat’ the ice cream, her toes curled in embarrassment."
      },
      {
        "paragraph": "They had agreed to watch a movie together, but they could not remember anything about it. The two of\nthem leaned against each other and ate ice cream secretly. Fortunately, there were only six other\npeople scattered in the cinema hall, two of"
      },
      {
        "paragraph": "which were a couple as well, far away from them."
      },
      {
        "paragraph": "When they came out, Shaun reminisced. “That was the most delicious ice cream I had in my life.”"
      },
      {
        "paragraph": "Catherine pretended not to understand him. The more she communicated with him, the more\nembarrassing things he would say."
      },
      {
        "paragraph": "However, Shaun refused to let it drop. He said with a grin, “I get it now. It wasn’t the ice cream that was\nsweet. It was you.”"
      },
      {
        "paragraph": "“Come here, babe. Let me taste it again.” Shaun leaned over cheekily."
      },
      {
        "paragraph": "Suddenly, a sneer sounded from the side. “Public morals are degenerating with each passing day."
      },
      {
        "paragraph": "Kissing another man before getting divorced? It really is true that a shameless person isn’t afraid of\nanything.”"
      },
      {
        "paragraph": "Catherine turned around to see two women in their twenties looking at her with disdain. The woman\nwho spoke was wearing a floral print dress. She was Hannah Mead, the person who had once pursued\nShaun, as well as Senator Mead’s daughter."
      },
      {
        "paragraph": "“Hannah, who is she?” The friend beside Hannah pretended to be ignorant."
      },
      {
        "paragraph": "“She’s Wesley’s wife.” Hannah deliberately glanced at Shaun."
      },
      {
        "paragraph": "These days, she had seen the news outlets online talking about Shaun, whom she had never expected\nto be strong enough to bring down the Campos family. After the fall of Campos Corporation, Hill\nCorporation was investigated, and she thought that Shaun would meet his end this time. However,\nunexpectedly, his manipulation even changed the person in charge of Australia."
      },
      {
        "paragraph": "This man was scary and resourceful. Of course, that only made the man more attractive to her."
      },
      {
        "paragraph": "Senator Mead had been nagging in her ear recently that if she had managed to snag Shaun, maybe\nher father would have been qualified to be the prime minister."
      },
      {
        "paragraph": "The more she thought about it, the more she wanted Shaun for herself."
      },
      {
        "paragraph": "Her friend covered her mouth in shock. “She’s so bold even when she’s having an affair.”"
      },
      {
        "paragraph": "“Exactly. She doesn’t care at all. Even though she clearly has a husband, she lives openly in another\nman’s house and kisses him in public. How utterly shameless. She’s a disgrace to women,” Hanna said\nrudely."
      },
      {
        "paragraph": "Catherine was unaffected as she had seen all sorts of gossip on the Internet."
      },
      {
        "paragraph": "However, Shaun’s expression darkened. “It’s none of your goddamn business if we kiss. It’s better than\nyou, a lady from an influential family shameless enough to drug a man. How hungry were you?"
      },
      {
        "paragraph": "Unfortunately, even if you stripped naked and stood in front of me, I’d still be uninterested in you.”"
      },
      {
        "paragraph": "Hannah immediately lost her temper. “Shaun Hill, don’t slander me. I’m telling you, my dad has been\npromoted, and he’s now standing on top of the pyramid. You’d better be more polite to me, or I’d make\nsure you die without even knowing how.”"
      },
      {
        "paragraph": "“With such a stupid daughter like you, I think what your dad really needs to worry about is his career.”"
      },
      {
        "paragraph": "Shaun held Catherine and left. “Let’s go. Ignore them.”"
      },
      {
        "paragraph": "“You’re afraid, aren’t you?” Hannah said furiously, “I’m telling you, Wesley will never let you two off.”"
      },
      {
        "paragraph": "At the mention of Wesley’s name, Shaun and Catherine stopped at the same time and turned back to\nlook at Hannah."
      },
      {
        "paragraph": "Hannah sneered proudly to see them stop. “I won’t tell you, but you’ll find out for yourselves soon."
      },
      {
        "paragraph": "Before that, I’ll tell you this, Shaun. If you have nowhere left to go in the future, you can come and beg\nme. Perhaps I’ll give you a chance.”"
      },
      {
        "paragraph": "Then, she held her friend’s hand and left."
      }
    ]
  },
  {
    "title": "Chapter 1541 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine’s eyebrows furrowed deeply."
      },
      {
        "paragraph": "Shaun pulled her hand. “Ignore her. Her dad is a nobody.”"
      },
      {
        "paragraph": "“But she’s not wrong. Her father’s status is very different now.” Catherine remembered that the Mead\nand Snow families worked closely together. Now that Nathan was on top, Senator Mead would\nnaturally move up the ladder too. He might really be standing at the top of the pyramid."
      },
      {
        "paragraph": "“So what?” Shaun said dismissively, “ I don’t care about that. But judging by Hannah’s tone, do you\nthink Wesley has played up to the Mead family? ”"
      },
      {
        "paragraph": "Catherine also found it very strange. Wesley had spent a lot of effort to curry favor with Senator Mead\npreviously. However, after the accident during the birthday party Senator Mead hosted, he\nembarrassed Senator Mead, who ended up hating Wesley. Logically speaking, their paths should not\nintersect."
      },
      {
        "paragraph": "“It seems like Wesley really has some tactics.” Shaun frowned deeply. “I didn’t pay much attention to\nhim because of Hill Corporation’s affairs. Yet now, not only has he signed a big contract with a foreign\ncompany, but he has even built a relationship with Senator Mead. I just don’t understand. Wesley’s\nreputation is notorious. Why does Senator Mead need him?”"
      },
      {
        "paragraph": "Catherine also did not understand it, and she felt uncomfortable. “My biggest regret in my life was\nmarrying Wesley. It’s harder to divorce him than it was to divorce you.”"
      },
      {
        "paragraph": "“I wonder who it was back then who told me that he was a good man and that she wanted to live with\nhim?” Shaun spat sourly."
      },
      {
        "paragraph": "Catherine was so upset that she did not want to say anything."
      },
      {
        "paragraph": "He knew that she was upset about this, yet he still provoked her at a time like this."
      },
      {
        "paragraph": "“Well, don’t worry. I’ll call Chester and ask him about the current situation at Golden Corporation.”"
      },
      {
        "paragraph": "After Shaun brought her to the car, he immediately called Chester. “Where are you?”"
      },
      {
        "paragraph": "“Hospital.”"
      },
      {
        "paragraph": "Shaun looked at the time and was surprised. “It’s so late, and you’re still in the hospital? Was there a\nsurgery?”"
      },
      {
        "paragraph": "“Do you need something?” Chester was clearly unwilling to answer the question."
      },
      {
        "paragraph": "“I want to ask about Golden Corporation’s situation,” Shaun said. “Golden Corporation’s stock prices\nhave been skyrocketing recently.”"
      },
      {
        "paragraph": "“Yeah. Wesley has signed a partnership with Country T. Country T is not as advanced as Australia, and\nthere’s insufficient supply and demand in their pharmaceutical market. Wesley opened up the market\nthere and signed a ten-year partnership plan. The outside world is very optimistic about it, so Golden\nCorporation’s stock prices soared.” Chester added, “I didn’t tell you because you were busy. I was\nafraid that you’d feel pressured.”"
      },
      {
        "paragraph": "Shaun frowned. “Wesley was almost at the end of his rope. How did he open the market at Country T“ I\nguess it had something to do with the Zeller family, ” Chester said. “Someone from the Zeller family has\nonce served as a diplomat in Country T for ten years and is very familiar with the local politicians.”"
      },
      {
        "paragraph": "Shaun immediately came to and became ashen from anger."
      },
      {
        "paragraph": "Rebecca must have taken advantage of hooking up with Bryce to help Wesley out."
      },
      {
        "paragraph": "Then again, Rebecca and Wesley had already been working together as early as four years ago."
      },
      {
        "paragraph": "He really wanted nothing more than to stomp the Zeller family to death. In order to please Rebecca,\nthat fool, Bryce helped Wesley to rise up again."
      },
      {
        "paragraph": "“There’s one more thing.” Chester added, “Wesley seems to have built a relationship with Senator\nMead. I have previously told major hospitals not to use Golden Corporation’s drugs, but Senator Mead\nhas secretly gone about saying otherwise. Now, major hospitals have started using the drugs\nmanufactured by Golden Corporation. In other words, Wesley has not only opened up foreign\nchannels, but he also has access to domestic channels.”"
      },
      {
        "paragraph": "Shaun was very unhappy. Although he realized something after hearing what Hannah said, it was\nanother matter to hear it from Chester. “Senator Mead dares to go against you?”"
      },
      {
        "paragraph": "Chester sighed. “Nathan has been cooperating with Senator Mead for more than ten years. So after\nNathan took office, he put Senator Mead in an important position. Senator Mead is now in the limelight\nand is different from before. Don’t bother talking to Nathan about it. It’s useless. He has a close\nrelationship with the Mead family, so even if he wants to kick away the Mead family, it’ll only happen six\nor seven years later.”"
      },
      {
        "paragraph": "“I know. I’m not that stupid.”"
      }
    ]
  },
  {
    "title": "Chapter 1542 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun hung up the phone with a very unpleasant expression."
      },
      {
        "paragraph": "He had never thought that after bringing down the Zeller family, and after the Snow family came to\npower, the Mead family would also follow suit and rise up."
      },
      {
        "paragraph": "The Snow and Mead families had a good relationship. He knew about it when he attended Hannah’s\nbirthday party."
      },
      {
        "paragraph": "If Wesley had really climbed up a big tree like the Mead family, who knew how far he would go?"
      },
      {
        "paragraph": "Furthermore, the force behind Rebecca would likely do something with the Snow family too. He did not\nknow if Nathan could hold back the force behind Rebecca."
      },
      {
        "paragraph": "“Say, did Wesley use the power behind Rebecca to claim connections with the Mead family?”"
      },
      {
        "paragraph": "Catherine frowned as she analyzed. “Senator Mead had never really wanted to associate with him. To\nbe honest, Wesley was basically kissing Senator Mead’s *ss back then, and Senator Mead wouldn’t be\nfond of people like Wesley at all.”"
      },
      {
        "paragraph": "“Your guess might be right.” Shaun nodded in agreement. “Cathy, we’re stuck between a rock and a\nhard place.”"
      },
      {
        "paragraph": "Catherine sighed. “We still haven’t figured out who the person behind Rebecca is.”"
      },
      {
        "paragraph": "“Maybe… we’ll find out tomorrow.” Shaun frowned. “After the Zeller family falls, that person will\ndefinitely go to the Snow family.”"
      },
      {
        "paragraph": "Catherine was stunned."
      },
      {
        "paragraph": "When they reached the manor, Catherine’s phone rang."
      },
      {
        "paragraph": "It was from Joel."
      },
      {
        "paragraph": "She spaced out for a moment before answering the call. “Dad…”"
      },
      {
        "paragraph": "“Cathy, I sent someone to Melbourne to check. ” Joel said in an astringent tone, “The grave keeper said\nthat some time ago, a middle -aged man and woman, along with a young man and woman went to pay\nrespects to your grandparents. The two younger ones should be their children.”"
      },
      {
        "paragraph": "Catherine suddenly did not know what to say."
      },
      {
        "paragraph": "She could understand Joel’s feelings, and she also felt uncomfortable after hearing him."
      },
      {
        "paragraph": "In other words, her mother was still alive. She even got married and gave birth to a boy and a girl. What\na great and happy family."
      },
      {
        "paragraph": "She wondered if her mother remembered that she had a daughter named Catherine."
      },
      {
        "paragraph": "“I got it, Dad.” She took a deep breath and pretended to be strong."
      },
      {
        "paragraph": "“Cathy, I won’t continue investigating this. ” Joel did not feel sorry for himself as it served him right that\nSheryl got married. However, his heart ached for his daughter. “Just as what you said before… She\ndied more than twenty years ago. Now that she’s happily married, she probably doesn’t want to be\ninvolved with us.”"
      },
      {
        "paragraph": "“Yeah.”"
      },
      {
        "paragraph": "After putting down the phone, Catherine winded down the window and let the wind blow into her eyes,\nfor fear that her eyes would turn red."
      },
      {
        "paragraph": "“What’s wrong? What did Joel say to you?” Shaun sensed that her mood was strange."
      },
      {
        "paragraph": "“It’s a secret between my dad and me. I’m not telling you.” Catherine brushed him off and lowered her\nhead to play with her phone."
      },
      {
        "paragraph": "If there was still a possibility for her to acknowledge her mother, she would be willing to tell Shaun."
      },
      {
        "paragraph": "However, there was no need to tell him what was impossible."
      },
      {
        "paragraph": "Shaun was already under a lot of pressure. She did not want him to worry about her."
      }
    ]
  },
  {
    "title": "Chapter 1543 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "In the Jewell family’s hospital."
      },
      {
        "paragraph": "After Chester hung up the phone, a delivery boy delivered porridge to his office."
      },
      {
        "paragraph": "He then carried the porridge to Eliza’s ward."
      },
      {
        "paragraph": "It was already past g p.m., so the hospital was very quiet. Only Eliza’s private ward was a little noisy."
      },
      {
        "paragraph": "A man and a woman cried at the entrance of Eliza’s ward, causing many people to stop and watch."
      },
      {
        "paragraph": "“Eliza, I’ll kneel to you. Please let your father go. He’s your biological father. If not for his illness and\nhow poor our family is, he wouldn’t ask you for this money.”"
      },
      {
        "paragraph": "An obese middle-aged woman knelt at the door, as if scared that the person in the ward could not see\nher."
      },
      {
        "paragraph": "A young man next to him desperately pulled the middle-aged woman up. “Mom, get up. Don’t kneel to\nher.”"
      },
      {
        "paragraph": "“ I have to. If I don’t, your father will go to jail. Her status is different now. There are people causing\ntrouble at your company and at our doorstep every day. We can’t even go home.”"
      },
      {
        "paragraph": "The middle-aged woman wiped her tears as she said."
      },
      {
        "paragraph": "The woman was the wife Jacob Robbins married afterward, Julie Dunn, and the man was their son,\nBrandon Robbins."
      },
      {
        "paragraph": "As the two of them echoed one another, the people around them pointed at them and gossip."
      },
      {
        "paragraph": "Chester frowned. Felix Media had kept the information that Eliza was staying on this floor a secret.\nHow did this mother and child get the news?"
      },
      {
        "paragraph": "He strode over."
      },
      {
        "paragraph": "Suddenly, Eliza’s assistant, Leanne, carried a bucket of water and poured it on the two people."
      },
      {
        "paragraph": "Although the weather was not very chilly, Julie and Brandon shuddered after being drenched in cold\nwater. It was fine if it was just tap water, but there was a strange ammonic smell in it."
      },
      {
        "paragraph": "Julie could still endure it. However, Brandon had never suffered like this before, and he instantly\nexploded. “What did you pour on us?”"
      },
      {
        "paragraph": "Wearing a hospital gown, Eliza lazily leaned against the wall. Her snow-white and clear little face still\nlooked ill and tired, but it did not affect her beauty. She was exquisitely beautiful, but the words that\ncame out of her mouth were poisonous enough to kill."
      },
      {
        "paragraph": "“My urine.” Her clear voice made Chester’s handsome face twitch."
      },
      {
        "paragraph": "Julie immediately bent over and threw up on the spot."
      },
      {
        "paragraph": "She could not understand it. Eliza was a celebrity after all. How could she do such a shameless thing?"
      },
      {
        "paragraph": "Brandon was furious. “Eliza Robbins, do you have a death wish?”"
      },
      {
        "paragraph": "He lost control, charged, and was about to hit Eliza. However, before he could get close to her, he was\nkicked to the ground by Chester’s long legs."
      },
      {
        "paragraph": "“How unlucky.” Chester tapped his shoe on the ground after kicking Brandon to rub off the water on\nBrandon’s body."
      },
      {
        "paragraph": "Brandon fell flat on his face, and his body hurt all over. He was just about to get up in anger and fight\nback when he saw Chester’s tall figure and trembled."
      },
      {
        "paragraph": "Julie immediately yelled, “You’re a doctor. How could you hit people? A doctor in this hospital wants to\nkill us.”"
      },
      {
        "paragraph": "“Mom, that wretched woman must have seduced the men in the hospital. She’s just as unruly as her\nmother. She can’t even watch herself in the hospital, ” Brandon shouted loudly. He was sure that with\nhow Chester was putting up airs, he must be having an affair with Eliza."
      },
      {
        "paragraph": "“You… You two are despicable. My dad stabbed me and put me in the hospital. I just want to get justice\nfor myself. I’m done being your ATM. Even if you stay here and make a ruckus all night, I won’t\nwithdraw the lawsuit.”"
      },
      {
        "paragraph": "Eliza looked furious as she held onto her wound. Then, her eyes fluttered closed, and she fainted\ndirectly on Leanne."
      },
      {
        "paragraph": "It looked like she had fainted from anger."
      },
      {
        "paragraph": "Leanne panicked. “Doctor Jewell, what should we do? Eliza fainted.”"
      }
    ]
  },
  {
    "title": "Chapter 1544 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“I’ll take her to the ER.”"
      },
      {
        "paragraph": "Then, Chester picked Eliza up. Before he left, he glared at Julie and Brandon. “Call security, and tell\nthem to kick the troublemakers out.”"
      },
      {
        "paragraph": "Julie and Brandon were instantly stunned."
      },
      {
        "paragraph": "They did not believe that Eliza had really fainted. It was definitely on purpose."
      },
      {
        "paragraph": "However, Chester did not even give them a chance, and the onlookers were looking and pointing at\nthem in disgust."
      },
      {
        "paragraph": "“They caused someone to faint from anger.”"
      },
      {
        "paragraph": "“I heard the lady say that her wound was caused by her father. It’s a crime to stab someone. What she\ndid was normal.”"
      },
      {
        "paragraph": "“They don’t want to go to jail, so they come to the hospital to make a fuss, huh?”"
      },
      {
        "paragraph": "Julie and Brandon tucked their tails between their legs at the accusations. Just then, the hospital"
      },
      {
        "paragraph": "security came over and dragged them away from the scene. However, instead of throwing them out,\nthey were brought to a utility room."
      },
      {
        "paragraph": "Chester hurried on the elevator with Eliza in his arms, but he did not go to the emergency room.\nInstead, he brought her to his private lounge."
      },
      {
        "paragraph": "After entering, he put the ‘unconscious’ Eliza on the bed. “Alright, stop pretending. It’s only the two of\nus here.”"
      },
      {
        "paragraph": "Eliza opened her eyes. She originally wanted Leanne to cooperate with her, but unexpectedly, Chester\nstole the show instead."
      },
      {
        "paragraph": "“Your acting skills are pretty good.” Chester looked at her with a vague smile."
      },
      {
        "paragraph": "If it were Cindy using this trick, he would be absolutely revolted. Yet when it was Eliza, he found it\ninteresting."
      },
      {
        "paragraph": "“ It’s fine. ” Eliza sat up unhurriedly. However, the injury on her back stretched when she got up, so she\nfurrowed her brows in pain."
      },
      {
        "paragraph": "“Enough. Lie down and don’t move.” Upon seeing it, Chester warned in a low voice, “Just stay here\ntonight. Since your ward location has been exposed,"
      },
      {
        "paragraph": "reporters will definitely be sneaking in.”"
      },
      {
        "paragraph": "“I’ll be discharged tomorrow anyway. Just discharge me early tonight. ” Eliza did not want to stay in his\nlounge."
      },
      {
        "paragraph": "“No.” Chester rejected it. “You have to do a check—up tomorrow.”"
      },
      {
        "paragraph": "“My body is recovering fine. I can do the check-up the day after tomorrow.”"
      },
      {
        "paragraph": "“No.” Chester forcefully rejected it again. “I’m your attending doctor. What if anything happens to you\nafter you’ve been discharged early, and you turn around to cause trouble for me? I’ll have to bear the\nmedical liability in court.”"
      },
      {
        "paragraph": "Eliza was speechless. “Do I look senseless enough to cause trouble for you? Nothing will happen to\nme anyway.”"
      },
      {
        "paragraph": "“Who knows? One may know a person for a long time without understanding his true nature.” Chester\nraised his brows and chuckled."
      },
      {
        "paragraph": "Eliza snorted. “Then I’ll sign a guarantee. If anything happens after I’ve been discharged from the\nhospital, I’ll be wholly responsible.” “No.” Chester looked at her with ambiguous eyes. “ I’ll be more\nassured if you stay in the hospital"
      },
      {
        "paragraph": "tonight. Be a good girl. It’s only one night. Don’t treat your body carelessly. There are times when a\nwoman should act delicately.”"
      },
      {
        "paragraph": "“I’ll naturally act delicately in front of the person I love, but I won’t in front of you.” Stubbornness was\nwritten all over Eliza’s face. “Please, you’re getting married, so stop flirting with me. I’ve already told\nyou that I’m disgusted by it.”"
      },
      {
        "paragraph": "“If you’re that disgusted, try throwing up.” Chester found that he was better at controlling his temper."
      },
      {
        "paragraph": "If it were in the past, he would pull a long face and leave."
      },
      {
        "paragraph": "Eliza was speechless."
      },
      {
        "paragraph": "Seeing her motionless, Chester smiled. “See? You’re not that disgusted. Besides, I just helped you. If I\nhadn’t carried you away, your assistant wouldn’t have been able to pick you up either. That stepmother\nof yours would have cried there for a while and maybe even yanked your body violently. ”"
      }
    ]
  },
  {
    "title": "Chapter 1545 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Eliza tried to imagine that scenario."
      },
      {
        "paragraph": "Then, her body shuddered. Julie and Brandon really would do something like that."
      },
      {
        "paragraph": "Forget it. She knew she could not change Chester’s mind about tonight. Furthermore, she was injured\nand could not be bothered to bicker with him."
      },
      {
        "paragraph": "“Fine. Since you’ve helped me just now and I owe you a favor, I’ll force myself to stay here tonight.” A\nreluctant look flashed across Eliza’s cold face."
      },
      {
        "paragraph": "However, her meaning was clear from her words. ‘I don’t want to stay here. I’m only staying here\nbecause I owe you a favor. Now that I’ve decided to stay, I no longer owe you anything.’"
      },
      {
        "paragraph": "Chester was both angry and happy."
      },
      {
        "paragraph": "This woman really… made him gnash his teeth."
      },
      {
        "paragraph": "“Eliza, do you know what your behavior is called? Shameless.” He could not help but scold her."
      },
      {
        "paragraph": "“Did I say something wrong? Or do you not want me to stay?” Eliza raised her brows. “If you think I’m\nshameless, then I’ll just leave.”"
      },
      {
        "paragraph": "“Enough. Lie down. You’re lucky that trick works on me.”"
      },
      {
        "paragraph": "Chester let out a low chuckle. He liked this side of Eliza. If she were the same as those women outside,\nit would be boring."
      },
      {
        "paragraph": "Eliza’s lips twitched with indifference."
      },
      {
        "paragraph": "She knew what Chester was thinking. To Chester, she was just a rare plaything. He would stop liking\nher the moment he obtained her or if she fell in love with him."
      },
      {
        "paragraph": "If Chester were an ancient monarch, he was definitely the type to have a harem of three thousand\nbeauties, each of them with their own distinct characteristics."
      },
      {
        "paragraph": "“Young Master Jewell…”"
      },
      {
        "paragraph": "At that moment, someone knocked on the door."
      },
      {
        "paragraph": "“Come in. ” After Chester spoke, a security guard came in. “I’ve interrogated those two people earlier.\nThey said they found out about Ms. Robbins’s ward number because someone called and told them in\nsecret.”"
      },
      {
        "paragraph": "“Do you know who it is?” Chester frowned."
      },
      {
        "paragraph": "“It came from a public phone.” The security guard muttered, “It’s most likely Ms. Robbins’s enemy or\nthe like.”"
      },
      {
        "paragraph": "“Okay, you can leave. Send those two to the police station, and tell the officers that they were causing\ntrouble in the hospital.” Chester made some simple arrangements before the ward was silent again."
      },
      {
        "paragraph": "He looked at the woman quietly lying on the pillow. She lowered her eyes. After a moment, she raised\nher head and said, “Very few people know my ward number. Apart from the hospital’s internal staff,\nonly a few people from the company know.”"
      },
      {
        "paragraph": "“What are you trying to say?” Chester found a sofa and sat down."
      },
      {
        "paragraph": "“It’s probably Cindy.” Eliza voiced her guess boldly. “She absolutely abhors me.”"
      },
      {
        "paragraph": "Chester looked at her deeply in the eyes and chuckled. “That’s just your guess. I wonder if you’re\nprovoking my relationship with Cindy.”"
      },
      {
        "paragraph": "“Is there a need to? I don’t like you.” Eliza said firmly, “She probably feels that I’m a stumbling block for\nher, whether in her relationship or her career."
      },
      {
        "paragraph": "The way she said ‘I don’t like you’ was crisp and blunt."
      },
      {
        "paragraph": "Chester’s handsome face stiffened for a moment, and then he said, “I wouldn’t mind if you wanted to\nprovoke my relationship with her.”"
      },
      {
        "paragraph": "“Forget it. You’re a skeptical person. If I really wanted to rise in power and provoke your relationship\nwith Cindy, you’d definitely warn me. Even worse, you might tell the company to beat me a little.”"
      },
      {
        "paragraph": "Eliza said in a casual tone, “Young Master Jewell, you want to control everything in your hands, and it’s\nthe same thing when you want a woman. You want her to listen to you obediently without resisting. If\nyou want her to rise in power, she’ll rise in power. If you want her to be a lover, then she has to be your\nlover obediently. I hate that part of you the most. You act as if all women just want to cling to you.”"
      },
      {
        "paragraph": "“Go on.” Chester lit a cigarette, the smile on his lips deepening."
      }
    ]
  },
  {
    "title": "Chapter 1546 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "No woman had really and ever understood him so well before."
      },
      {
        "paragraph": "She knew every bloody thing about him. How long had he known Eliza?"
      },
      {
        "paragraph": "It was too rare."
      },
      {
        "paragraph": "Eliza said bluntly, “To be honest, your only good points are that you have good looks, a good family,\nand good medical skills. However, other people can have those advantages too. What’s the point of a\nwoman looking for such an attractive man? It’s not like he’ll earn money with those looks. As for having\na good family, there are plenty of people who have that. Of course, most people can’t compare with\nyou, but they eat and drink the same things as you. There are also many people who are good in the\nmedical field. Chester Jewell, you aren’t that exceptional, nor do you have the qualification to make me\nprovoke your relationship with Cindy."
      },
      {
        "paragraph": "“Honestly, what’s up with you two? Who do you think you are? One is obsessed with me and wants to\nsleep with me, and the other is so jealous of me that she’s about to turn green. All of you just think of\nme like an ant that you can play with or crush if you want to.”"
      },
      {
        "paragraph": "In a split second, the air in the ward seemed to have dropped to freezing point."
      },
      {
        "paragraph": "With a grim expression, Chester snapped the cigarette in his hands."
      },
      {
        "paragraph": "He stood up and walked to the bed, his eyes cold as ice. “Eliza, are you pushing your luck because I’ve\nbeen too good to you recently?”"
      },
      {
        "paragraph": "“Hah, do I have to be grateful and respectful to you just because you showed up before me? You know\nthat my words are unpleasant to the ears, yet you still continue running to me. Aren’t you just asking for\nit?”"
      },
      {
        "paragraph": "Eliza said coldly, “ It’s your business if you want to harass me, and it’s my business if I refuse you. As\nfor your woman, look after her properly. That’s your business.”"
      },
      {
        "paragraph": "“Eliza, you’re so sure that it was Cindy. Do you have any evidence?” Chester’s expression was\nextremely unpleasant. He was not trying to protect Cindy. In fact, it was because he felt humiliated as a\nman."
      },
      {
        "paragraph": "“Sorry, but before I messed with you, no one in the company found me objectionable either, ” Eliza said\nrighteously without even blinking."
      },
      {
        "paragraph": "She had no evidence, but she was sure that it was Cindy."
      },
      {
        "paragraph": "Chester was so angry that his chest hurt."
      },
      {
        "paragraph": "This was the first time he was so angry with her."
      },
      {
        "paragraph": "“Eliza, you’re really asking for it. Who do I think I a m? Since you’ve asked, I’ll show you who I am.”"
      },
      {
        "paragraph": "Chester was completely enraged."
      },
      {
        "paragraph": "These days, he ignored his indifference to Cindy and stood with Eliza."
      },
      {
        "paragraph": "However, what he got in exchange was even more humiliation."
      },
      {
        "paragraph": "Not even his father would dare to scold him so explicitly or implicitly, much less Eliza."
      },
      {
        "paragraph": "He pushed her down on the bed and covered her with his big body."
      },
      {
        "paragraph": "Eliza’s wound hurt as soon as she resisted."
      },
      {
        "paragraph": "“Eliza, I admit that you know me very well, but don’t you look down on me. I don’t like to force women.\nIf you don’t want to be with me, you can act like you’re mute instead of pretending to be a chaste widow\nand scolding me.”"
      },
      {
        "paragraph": "Chester tore open her gown, and several buttons popped out instantly."
      },
      {
        "paragraph": "A large part of her skin was exposed. Faced with Eliza’s furious eyes, Chester lowered his head and\nsealed her lips with his."
      },
      {
        "paragraph": "She had been taking medicine and injections every day, so her lips tasted like medicine. However, after\ngetting a good taste of her, he found that she was infuriatingly sweet."
      },
      {
        "paragraph": "Those sweet lips were the ones that always spoke words that p*ssed him off."
      },
      {
        "paragraph": "Chester bit her fiercely as if it was punishment."
      }
    ]
  },
  {
    "title": "Chapter 1547 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Blood spilled from Eliza’s clean lips after being bitten. Her wound hurt deeply, and her brain went dizzy\nfrom the pain."
      },
      {
        "paragraph": "The taste of copper welled up between their lips, making her stomach flip in nausea."
      },
      {
        "paragraph": "She felt truly disgusted."
      },
      {
        "paragraph": "How many women had Chester’s lips kissed?"
      },
      {
        "paragraph": "Also, she had not forgotten how cruel and mean his words were when he sent her to prison."
      },
      {
        "paragraph": "For a moment, all her old and new grudges surfaced."
      },
      {
        "paragraph": "She did not know where she got the strength from, but she clamped her teeth down on Chester’s lips."
      },
      {
        "paragraph": "Unlike Chester, she bit him like a wolf tearing its prey."
      },
      {
        "paragraph": "Even a man like Chester, who was not afraid of pain, felt like he was just bitten by a wolf. For a"
      },
      {
        "paragraph": "moment, he even wondered if this woman would tear a chunk of his lips off."
      },
      {
        "paragraph": "There was a lingering feeling before and he wanted to taste it a little longer, but now, he was really\ndismayed."
      },
      {
        "paragraph": "It was like the first time he saw her. Her eyes were so cold and hateful, as if… It was the same as the\nlast time he saw Charity in the courtroom back then."
      },
      {
        "paragraph": "At that time, when she was taken away by the police, she looked at him the exact same way."
      },
      {
        "paragraph": "His brief moment of disorientation caused his neck to be grabbed and littered with scratches."
      },
      {
        "paragraph": "He snapped back to his senses and realized that Eliza’s actions were as if she was really trying to\ndevour him."
      },
      {
        "paragraph": "He pushed her away forcefully, but Eliza held onto his neck like a madwoman. She even lunged at him\nand bit down his lips."
      },
      {
        "paragraph": "“Eliza… Do you… want to die?” Chester pushed Eliza away furiously. Her body hit the bedside table,\nright where her wound was, and a violent pain stabbed her yet again."
      },
      {
        "paragraph": "She could no longer endure it and passed out directly."
      },
      {
        "paragraph": "When Chester came to his senses and looked at the unconscious woman and the bloodstains on the"
      },
      {
        "paragraph": "bed, his brain just felt absurd at the whole situation."
      },
      {
        "paragraph": "He was born favored by God and stood high above others."
      },
      {
        "paragraph": "He never thought a woman would resist him this much."
      },
      {
        "paragraph": "Not only did she resist him, but also treated him like a beast."
      },
      {
        "paragraph": "He could not forget that hatred in Eliza’s eyes. Why did she hate him so much?"
      },
      {
        "paragraph": "Because he forcefully kissed her? But she was the one who provoked him. Since she dared to do it,\nshe had to bear the consequences."
      },
      {
        "paragraph": "Now, she was out cold."
      },
      {
        "paragraph": "It did not seem like she was pretending like before. There was even blood seeping out of her back."
      },
      {
        "paragraph": "Originally, her wound was much better and she could be discharged from the hospital tomorrow, but\nbecause of this ordeal, her wound opened up again."
      },
      {
        "paragraph": "“Someone…” Chester picked up the woman on the bed and rushed to the emergency room."
      },
      {
        "paragraph": "A little nurse on duty at the door saw Chester whose mouth was smeared with blood, and was\nfrightened by it. In the impression of everyone in the hospital,"
      },
      {
        "paragraph": "Chester was always in a white coat, elegant, and incomparably beautiful. He was the Young Master of\nthe Jewell family and had an extraordinary status, but he never put on airs with the nurses."
      },
      {
        "paragraph": "However, that night, that person rushed into the emergency room in a flurry, holding a woman in his\narms."
      },
      {
        "paragraph": "When Eliza was put in the operating room, Chester cut her clothes with a pair of scissors."
      },
      {
        "paragraph": "The doctor on duty came over and said, “Doctor Jewell, you’re injured too. Go get yourself treated. I’ll\nhandle this.”"
      },
      {
        "paragraph": "Recently, everyone in the hospital vaguely heard some news. Chester took extra care of the VIP, the\nfamous celebrity Eliza Robbins. He even went out of his way to lower his status to be her attending\ndoctor."
      },
      {
        "paragraph": "Although Chester was getting married, young men from rich families all had that kind of hobby, so\neveryone had a tacit understanding."
      },
      {
        "paragraph": "However, they did not think that he would cause a patient to faint."
      }
    ]
  },
  {
    "title": "Chapter 1548 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Looking at the wound on Chester’s lips and then at the wound and blood on Eliza’s mouth, everyone\nwith a sharp eye could tell what happened."
      },
      {
        "paragraph": "“No need, you can leave.” Chester saw Eliza’s snow"
      },
      {
        "paragraph": "-white body and blocked it with his own body. He did not want other men to see her like this."
      },
      {
        "paragraph": "Even if he knew that the other person was a doctor, he was subconsciously reluctant."
      },
      {
        "paragraph": "The doctor on duty paused and pulled his lips a little exasperatedly, and went out tactfully."
      },
      {
        "paragraph": "After Chester sewed Eliza’s wound, Eliza was still unconscious. However, he could see that she was\nvery uncomfortable. Her brows were wrinkled tightly."
      },
      {
        "paragraph": "Her facial features were actually very delicate and clean, but it was the hatred in her face that caught\nChester by surprise."
      },
      {
        "paragraph": "After he asked the nurse to send her back to her ward, he returned to his office."
      },
      {
        "paragraph": "He sat in his chair and lit a cigarette. The cigarette was stained with the blood on his lips, either his\nblood or Eliza’s."
      },
      {
        "paragraph": "After sitting for an unknown amount of time, Doctor Kendall, who had a good relationship with Chester,\ncame in with some ointment. “Wow, I’m speechless. You’re this hurt but you’re still smoking.”"
      },
      {
        "paragraph": "Chester kept his expression flat and himself mum."
      },
      {
        "paragraph": "Doctor Kendall said, “ I heard from the doctor on duty that the injury on your mouth is pretty bad. It’ll\nreally fester if you don’t treat it.”"
      },
      {
        "paragraph": "Chester touched his mouth with his hand and hissed in a cold breath. The wound was indeed quite\ndeep."
      },
      {
        "paragraph": "“Alright, ” he leaned against the leather seat."
      },
      {
        "paragraph": "Doctor Kendall spent five to six minutes helping him with the ointment and said, “This time, you’re not\nlooking for a woman but for a wild dog instead, right? I advise you to forget about it. Don’t put your life\non the line.”"
      },
      {
        "paragraph": "“Do I look like a person who’s easily schemed against by a woman?” Chester sneered."
      },
      {
        "paragraph": "“Your injury isn’t the type of normal bite between a man and woman having a quarrel. Maybe you can\nhave her for the time being, but will you be at ease keeping her by your side? Who knows if she’ll\npoison your water one day? Don’t put your life on the line just for two mounds of flesh.” Doctor Kendall\nreminded kindly."
      },
      {
        "paragraph": "Chester immediately fell silent."
      },
      {
        "paragraph": "“I’m leaving. Tell me when she wakes up.” Chester got up and left, dragging his white coat."
      },
      {
        "paragraph": "When he left the hospital, he felt a little discouraged. He had to admit that what Doctor Kendall said\nwas right."
      },
      {
        "paragraph": "He just did not understand why Eliza and him were like enemies."
      },
      {
        "paragraph": "At the end of the day, it was because of Cindy."
      },
      {
        "paragraph": "Cindy…"
      },
      {
        "paragraph": "Chester let out a sinister chuckle. He started the car and went to the villa where Cindy lived."
      },
      {
        "paragraph": "He gave her this place, but it was the first time he came here."
      },
      {
        "paragraph": "At the entrance of the villa, the guard saw him and immediately opened the electric gate."
      },
      {
        "paragraph": "Chester got out of the car and went straight in. Cindy was not yet asleep. When she heard that he was\ncoming, she immediately changed into a sexy nightgown and came down from upstairs. “Chester, why\nare you… Oh, what happened to your mouth?”"
      },
      {
        "paragraph": "When Cindy saw his lips, she immediately thought that he was bitten."
      },
      {
        "paragraph": "However, who bit him? Could it be…"
      },
      {
        "paragraph": "A name appeared in her heart, but she did not dare to say it out loud. She could only grit her teeth in\nanger."
      },
      {
        "paragraph": "“Let me ask you. Did you call Julie Dunn and Brandon Robbins and inform them of Eliza’s ward in the\nhospital?” Chester cut to the chase and asked coldly."
      },
      {
        "paragraph": "“Julie Dunn and Brandon Robbins? Who are they?” Cindy’s heart skipped a beat, but she pretended to\nbe confused."
      },
      {
        "paragraph": "However, as soon as she spoke, her neck was grabbed by Chester."
      },
      {
        "paragraph": "She felt like she was suffocating. “Y…Young…”"
      }
    ]
  },
  {
    "title": "Chapter 1549 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Chester had suppressed a lot of anger tonight."
      },
      {
        "paragraph": "That moment, he seemed to have finally found an outlet to vent."
      },
      {
        "paragraph": "He had always been a man who hid his emotions, but at that moment, his deep eyes were filled with a\ncold and violent light."
      },
      {
        "paragraph": "In the past, when he saw women scheming, he only watched and did not bother to expose them. It was\nfine as long as it was harmless. However, even though he warned her multiple times, Cindy relied on\nthe fact that they were about to get married to"
      },
      {
        "paragraph": "test his limits time and time again."
      },
      {
        "paragraph": "Eliza did not have proof, but he was not a fool."
      },
      {
        "paragraph": "Cindy’s pretty face turned red and purple as she struggled desperately. Just as she was about to\nchoke, Chester flung her away violently."
      },
      {
        "paragraph": "She was gasping heavily for air, seeming to walk on the edge of life and death."
      },
      {
        "paragraph": "She looked up at the expressionless man in front of her and suddenly felt a sudden panic in her heart."
      },
      {
        "paragraph": "“ I… I didn’t do it. ” Cindy’s tears streamed down. With her shocked and frightened face, she looked\nincredibly pitiful. “I didn’t harm Eliza.”"
      },
      {
        "paragraph": "“Cindy, you’re so f*cking hypocritical.” Chester hated her the more he looked at her. “Do you know what\nI hate most about you? You don’t dare to admit what you did, and you even act as if you’re being\nwrongly accused.”"
      },
      {
        "paragraph": "She was completely different from Eliza in that sense."
      },
      {
        "paragraph": "Eliza was bad, vicious, and cunning, but she did it all openly. She did not hide herself."
      },
      {
        "paragraph": "Although it made him grit his teeth in anger sometimes, it did not disgust him."
      },
      {
        "paragraph": "“ I didn’t. If I did it, I’d admit it,” Cindy answered loudly, as if she was sure herself that she didn’t do it.\nFurthermore, it was a public phone and disposable phonecard, so it was impossible to trace."
      },
      {
        "paragraph": "“Do you think that I can’t do anything to you if you don’t admit it?” Chester’s sharp tone mercilessly\npierced her mind."
      },
      {
        "paragraph": "“Chester, you can’t do this to me, ” Cindy choked on a sob. “I don’t have a problem if you want to be\nwith Eliza. I already decided to turn a blind eye to it."
      },
      {
        "paragraph": "I also understand that it’s my fortune to be able to marry you. I never dared to want to control you, but\nyou can’t slander me like this.”"
      },
      {
        "paragraph": "“It’s a shame you don’t realize it’s a blessing.”"
      },
      {
        "paragraph": "Chester sneered. “These years, I’ve encouraged your ambitions. I recently heard that your best friend\nfrom Melbourne has returned. You’re quite close to her and even went to Bryce Zeller’s clubhouse.”"
      },
      {
        "paragraph": "Cindy gritted her teeth. “Catherine told you about that, didn’t she? That night, Young Master Snow,\nFreya, and Catherine were all there. I didn’t say or do anything to them.”"
      },
      {
        "paragraph": "Chester’s thin lips smiled in contempt. “Should I applaud you and say that you did a good job?”"
      },
      {
        "paragraph": "Cindy went pale. “Chester, I had no choice. I know that Catherine is Shaun’s girlfriend, and Shaun is\nyour brother. No matter what, I shouldn’t get too involved with Rebecca. But you don’t know Rebecca’s\ncurrent background at all. Even the prime minister wants to curry favor with her. I want to build some\nconnections for the Jewell family so you can go even higher in the future. You won’t have to work so\nhard then.”"
      },
      {
        "paragraph": "“Then… Do you know who’s behind Rebecca?” The anger on Chester’s handsome face slowly\ndissipated. It looked like he was moved by Cindy’s words."
      },
      {
        "paragraph": "“I don’t know.” Cindy was a little distressed. “ Rebecca never introduced me before, but Bryce was very\ncareful around her. It seems like he wants to pursue her. Right, Rebecca also introduced me to a big\nHollywood director from the States.”"
      },
      {
        "paragraph": "Chester turned around and walked to the floor-to- ceiling window to ponder."
      }
    ]
  }
]