[

  {
    "title": "Chapter 1900 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Why did Rodney lie?"
      },
      {
        "paragraph": "Was it to do something behind her back, or… did he want to surprise her?"
      },
      {
        "paragraph": "Freya would rather believe it was the latter."
      },
      {
        "paragraph": "For the entire morning in the laboratory, Freya found no progress in the research of this product at all.\nShe even made several mistakes as she was absent-minded."
      },
      {
        "paragraph": "The assistant next to her said, “President Lynch, why don’t you go back and rest for a while if you’re\nnot feeling well?”"
      },
      {
        "paragraph": "“…Okay.”"
      },
      {
        "paragraph": "Freya also realized that she was distracted and in a bad state."
      },
      {
        "paragraph": "After changing her clothes and going downstairs, she sat in the car and was quiet for a long time before\ndriving to Snow Corporation’s subsidiary."
      },
      {
        "paragraph": "This was the new place Rodney worked at. She rarely came here, but the receptionist was a quick-\nwitted person. Perhaps she had seen Freya’s picture online before, so she immediately welcomed\nFreya in."
      },
      {
        "paragraph": "“Are you here for President Snow? He hasn’t returned from his business trip,” the receptionist said\ngently."
      },
      {
        "paragraph": "Freya smiled. “ I know. I just happened to pass by and thought of seeing Second Young Master Snow. ”"
      },
      {
        "paragraph": "“Second Young Master Snow just left half an hour ago. It seems like there’s a dinner gathering tonight.”\nThe receptionist looked apologetic. “He might not come in again today.”"
      },
      {
        "paragraph": "“Well, I should’ve called him before I came. It’s fine.”"
      },
      {
        "paragraph": "Freya smiled and waved her hand. However, when she turned around to leave the office, her\nexpression sank."
      },
      {
        "paragraph": "It seemed like Rodney came back earlier but not to go back to the company."
      },
      {
        "paragraph": "Of course, he might have gone to Osher Corporation, but she did not want to go there."
      },
      {
        "paragraph": "It was senseless to investigate so carefully."
      },
      {
        "paragraph": "Maybe she’ll find out the truth at night."
      },
      {
        "paragraph": "After returning to the villa, she finished dinner and gave Dani a bath along with the nanny. Only then did\nshe finally hear the sound of a car from outside."
      },
      {
        "paragraph": "Soon, Rodney came in dragging a suitcase."
      },
      {
        "paragraph": "With his white trench coat and slender legs, he looked as he had just walked out of the cover of a\nmagazine."
      },
      {
        "paragraph": "Freya had seen many male celebrities wear white before, but no one had such a noble temperament\nlike he did."
      },
      {
        "paragraph": "Some people were just born with it."
      },
      {
        "paragraph": "Nevertheless, Freya was not in the mood to appreciate what he was wearing today. That was because\nshe noticed he was wearing a beige jacket in the photos that the lady sent her."
      },
      {
        "paragraph": "Why did he change his clothes?"
      },
      {
        "paragraph": "Freya really did not want to speculate maliciously."
      },
      {
        "paragraph": "To her, Rodney only made a stupid mistake about Sarah, and they quarreled and bickered in ordinary\ntimes. However, he had no bad habits."
      },
      {
        "paragraph": "“Honey, Dani, I’m back. I brought you presents. ” Rodney came over and hugged Freya and their\ndaughter. “But I didn’t have time to go shopping by"
      },
      {
        "paragraph": "myself. I heard Hans say that the pearl necklace there was very good, so I bought you one. As for\nDani, I bought her a doll I saw at the airport.”"
      },
      {
        "paragraph": "He took out the gift. The pearl necklace was very beautiful, and the doll could sing."
      },
      {
        "paragraph": "When Dani heard the voice, she was so happy that she flailed in laughter."
      },
      {
        "paragraph": "“Look, Dani likes it.” Rodney hugged his daughter and used the doll to play with her. “Did you miss me,\nbaby? Daddy missed you so much.”"
      },
      {
        "paragraph": "He kissed her little face. He really did miss her."
      },
      {
        "paragraph": "This was the first time he left her for several days ever since she was born, so he was not used to it."
      },
      {
        "paragraph": "Freya stared at him and could not describe what she was feeling. At first, she thought that when she\nreturned in the afternoon, Rodney would suddenly appear and say he came back early to give her a\nsurprise."
      }
    ]
  },
  {
    "title": "Chapter 1901 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "However, Freya had spent the whole afternoon waiting for Rodney. The longer she waited, the more\ndisappointed she grew."
      },
      {
        "paragraph": "“What time was your flight?” she asked casually."
      },
      {
        "paragraph": "“About.”"
      },
      {
        "paragraph": "Rodney lowered his head and looked at his daughter, feeling slightly guilty."
      },
      {
        "paragraph": "In fact, he had returned in the afternoon, but he went to investigate the matter regarding the hotel. He\nfound out that Sarah and President Yard did indeed sleep separately that night."
      },
      {
        "paragraph": "It turned out that Rodney had misunderstood Sarah."
      },
      {
        "paragraph": "This meant Sarah did not betray him when they were in a relationship."
      },
      {
        "paragraph": "She made those provocative remarks to make him leave of his own accord."
      },
      {
        "paragraph": "Later, when he went to visit her, he did not feel good seeing her hiding in her small apartment\nreluctantly."
      },
      {
        "paragraph": "Hence, he accompanied her for a meal before returning home."
      },
      {
        "paragraph": "He would not be who he was today if Sarah had not left him early on."
      },
      {
        "paragraph": "However, behind his blissful life was the sacrifice of another woman."
      },
      {
        "paragraph": "At the thought of the moment when he proposed to Sarah, he felt that he had wronged her."
      },
      {
        "paragraph": "What he could do right now was try to compensate her in other aspects."
      },
      {
        "paragraph": "“Have you had dinner?”"
      },
      {
        "paragraph": "“I’ve had it on the plane,” Rodney replied as he tickled Dani’s chin."
      },
      {
        "paragraph": "“I see…” Freya smiled and went upstairs for a shower."
      },
      {
        "paragraph": "After Dani fell asleep at night, Rodney lay beside Freya. At first, he was so guilty toward Sarah that he\nwas not in the mood to do it with Freya. However, he got a scent of the fragrance on her body, and it\nhad been a few days since they did it."
      },
      {
        "paragraph": "With that, he could not help but kiss her. “Freya, did you miss me? I missed you very much…”"
      },
      {
        "paragraph": "Freya was quite resistant to his kiss."
      },
      {
        "paragraph": "Since Patrick had betrayed her previously, she tended to overthink things and wondered why Rodney\nlied to her."
      },
      {
        "paragraph": "“Really? Is it your body or your heart that missed me?” Freya looked away to dodge his kiss."
      },
      {
        "paragraph": "“Both.” Rodney planted a kiss on her cheek. Her skin was great, and she smelled great."
      },
      {
        "paragraph": "“You said you missed me, but why didn’t you pick up my call in Cairns?” Freya stared deep into his\neyes. “ It was fine if it was during the day. After all, you might have had something to deal with. But\nwere you also busy when you were alone in the hotel at night?”"
      },
      {
        "paragraph": "Rodney froze and said promptly, “I didn’t pick it up that night only. I was drunk, so I slept immediately\nafter I returned to the hotel.”"
      },
      {
        "paragraph": "“Oh. What a wonderful life you had out there. I wonder if you randomly got a woman and slept with her\nwhen you were drunk,” Freya teased."
      },
      {
        "paragraph": "“Who could I have gotten?” Rodney looked aggrieved."
      },
      {
        "paragraph": "“Who knows? I guess quite a few bosses would send women over to please you. After all, you’re\nYoung Master Snow,” Freya mocked."
      },
      {
        "paragraph": "“The women in the party did wink at me, but I ignored them. Freya, don’t take me as a casual person.\nAs I said, if I were, I wouldn’t have lost my virginity to you. I’ve never done it with any other woman\nexcept for you.”"
      },
      {
        "paragraph": "Rodney felt deeply wronged."
      },
      {
        "paragraph": "No matter how guilty he felt toward Sarah, he had never thought of betraying Freya."
      },
      {
        "paragraph": "He was quite particular when it came to this kind of matter. He was not a casual person."
      },
      {
        "paragraph": "“Don’t always bring up this point. That was my first time as well. ” Freya said in distress, “What’s more,\nyou’ve been acting like a wild animal since you did it with me. Who knows if you would have the\nintention of doing it out there after your first experience?”"
      },
      {
        "paragraph": "“Please, it’s because of you that I act like a wild animal. I don’t act like that out there.”"
      }
    ]
  },
  {
    "title": "Chapter 1902 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rodney did not know what to say, but he was a little pleased. “Wifey, are you jealous?”"
      },
      {
        "paragraph": "“Go away. Who’s jealous now?” Deep down, Freya was very glum."
      },
      {
        "paragraph": "What gave him the right gloat when she was upset and overthinking things?"
      },
      {
        "paragraph": "Rodney smirked. “Wifey, you don’t have to be jealous. You can try and see if I’ve done it with other\nwomen.”"
      },
      {
        "paragraph": "“Don’t touch me.”"
      },
      {
        "paragraph": "“No way. I have to prove my innocence.”"
      },
      {
        "paragraph": "Rodney was persistent. In the end, Freya failed to push him away, so he managed to have his own\nway."
      },
      {
        "paragraph": "With his condition, she was sure that he did not touch any other woman. However, at the thought of\nthat issue, she could not immerse herself in the act as much as she used to."
      },
      {
        "paragraph": "Deep down, she was rather uncomfortable."
      },
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "During breakfast, Freya suddenly put down her spoon and said, “Cathy told me that Sarah has\nprobably returned to Canberra.”"
      },
      {
        "paragraph": "Rodney was so shocked that his heart skipped a beat. However, he asked while feigning calmness, “\nProbably?”"
      },
      {
        "paragraph": "“She has most likely returned to Canberra.” Freya observed him. “Shaun and Catherine have been\nlooking for her everywhere. If they can’t find her, I might need to ask Godfather to have his people\nsearch for her in the community.”"
      },
      {
        "paragraph": "“Well… It’s better not to disturb my uncle regarding this matter.” Rodney muttered, “After all… there’s\nno incriminating evidence proving Sarah’s crimes. Wesley hasn’t admitted it,  has he?”"
      },
      {
        "paragraph": "Freya glowered at him all of a sudden. “Indeed, Wesley hasn’t admitted it,  but we all know she did it.\nCould it be that you’re… still sympathizing with Sarah?”"
      },
      {
        "paragraph": "“Why would I?”"
      },
      {
        "paragraph": "Those words escaped Rodney’s mouth. At first, he wanted to say that Sarah might not be that evil."
      },
      {
        "paragraph": "Nevertheless, he reckoned that Freya would be infuriated if he said that."
      },
      {
        "paragraph": "After some thought, he planned to tell her that after Shaun’s memory had been restored."
      },
      {
        "paragraph": "“I’m mainly afraid that the public will hazard a guess and panic if my uncle alarms them because of\nsuch a trifle matter.” Rodney explained reluctantly, “Shaun can look for me if he needs. We also have\nSnowden, and all the members are great at hunting people down.”"
      },
      {
        "paragraph": "“Alright. I’ll let Cathy know about that.”"
      },
      {
        "paragraph": "Freya said coldly, “Once Sarah has been found, I must skin her alive and make her suffer a living hell.”"
      },
      {
        "paragraph": "Rodney was speechless."
      },
      {
        "paragraph": "He looked down and finished his breakfast swiftly."
      },
      {
        "paragraph": "The sudden discussion regarding Sarah left his mind in a mess."
      },
      {
        "paragraph": "Little did he know that Freya stole a glance at him and felt a little disappointed."
      },
      {
        "paragraph": "Whenever they mentioned Sarah in the past, his face would fill with disgust. He even found it annoying\nas if Sarah had heaped humiliation on him."
      },
      {
        "paragraph": "Yet, at this point, Freya could sense that he was seemingly avoiding the topic."
      },
      {
        "paragraph": "Catherine only wanted her to keep an eye on Rodney because the two of them still trusted Rodney."
      },
      {
        "paragraph": "However, Freya was unsure of him now. “Rodney, have you not gotten over Sarah?” Freya suddenly\nsaid,  “Don’t  forget how she took advantage of you in the past."
      }
    ]
  },
  {
    "title": "Chapter 1903 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“No.”"
      },
      {
        "paragraph": "Rodney was calm. In fact, Sarah did not take advantage of him at all."
      },
      {
        "paragraph": "She was nice to him."
      },
      {
        "paragraph": "Even so, he could not say that now."
      },
      {
        "paragraph": "“Don’t worry. My relationship with her is over. Now, all I want is to live a happy life with you and Dani.” A\nserious expression washed over Rodney’s face."
      },
      {
        "paragraph": "Freya fell silent."
      },
      {
        "paragraph": "She just hoped that he would not let her down."
      },
      {
        "paragraph": "After breakfast, Rodney drove her to the office. Only after she went upstairs did he call Shaun. “I heard\nyou’re looking for Sarah.”"
      },
      {
        "paragraph": "“Mm.” Shaun replied in a low voice, “How dare that woman trick me? I must torture her little by little. ”"
      },
      {
        "paragraph": "Rodney felt bad. “Are you sure she’s back? How did you know?”"
      },
      {
        "paragraph": "“I have my own means. Why are you asking this?” Shaun raised his brows."
      },
      {
        "paragraph": "“ I heard it from Freya. Since you want to look for Sarah, I can get some Snowden members to help\nyou out. But there’s no need to ask my uncle for help. I’m worried that this issue will cause the public to\nhazard guesses and panic.”"
      },
      {
        "paragraph": "Shaun hesitated for a moment before he responded, “Alright. Thanks, then.”"
      },
      {
        "paragraph": "“Not at all. We’re buddies.” Rodney touched his nose awkwardly. “By the way, how have you been\nlately? You still can’t recall your past?”"
      },
      {
        "paragraph": "“…Not really.” Shaun was quiet for a moment before he continued, “At times when I’m asleep, I will\ndream about some scenes. At first, I thought those were just dreams, but they felt familiar. It feels as if\nI’ve experienced them.”"
      },
      {
        "paragraph": "“What kind of dream?” Rodney asked hurriedly."
      },
      {
        "paragraph": "“It seems related to Cathy and me. After I get up, the memory becomes a little hazy, but I’ve been\ndreaming about it often lately, ” Shaun said."
      },
      {
        "paragraph": "“That’s pretty good. Perhaps your memories will recover real soon.” Rodney was now convinced by\nShaun’s words."
      },
      {
        "paragraph": "“I have no idea. Don’t tell your wife yet, lest she tells Cathy about it. I hope to give Cathy a surprise\nwhen I’ve recovered all my memories. But… it might be quite tough.” Shaun felt powerless."
      },
      {
        "paragraph": "“It won’t be tough. Be confident.” Rodney encouraged him."
      },
      {
        "paragraph": "After he hung up, he quickly gave Sarah a call and told her about Shaun’s condition."
      },
      {
        "paragraph": "Sarah said softly, “That’s a sign of recovery. If he can recall his dreams when he’s awake, it means that\nhis memory is gradually being restored.”"
      },
      {
        "paragraph": "Rodney was overjoyed. “How long will it take?”"
      },
      {
        "paragraph": "“As I said, it’ll take around one month. But if he dreams frequently, he’ll be able to get an impression of\nthose scenes. That way, his memory will be restored even sooner.”"
      },
      {
        "paragraph": "“Will he also recover memories of him meeting Catherine in Melbourne?”"
      },
      {
        "paragraph": "Sarah answered, “Mm. I was too careless back then. In fact, once a man changes his mind, there’s no\npoint forcing him since he doesn’t like me"
      },
      {
        "paragraph": "anymore. I think it was really my mistake. I should’ve helped people with my knowledge in psychology\nrather than hurt them.”"
      },
      {
        "paragraph": "“Don’t say that… Everyone makes mistakes.” Rodney took pity on her. “What matters is that you learn\nfrom your mistakes. Shaun knows that you’re back, and he has been looking for you. You’d better hide,\nand don’t ever step out of the house.”"
      },
      {
        "paragraph": "“ I will. I’m just… quite worried about you.” Sarah was worried. “If they find out that you’re hiding me,\nyou guys will have a blazing row. I’m afraid Freya will be furious too. Given that she has always hated\nme, she might divorce you.”"
      },
      {
        "paragraph": "“But… I can’t let something happen to you. You should just stay there for now. When Shaun has\nrecovered a month later, I’ll take you out to explain to them and beg for mercy.” Rodney comforted her."
      },
      {
        "paragraph": "“What if… they don’t forgive me?” Sarah asked."
      },
      {
        "paragraph": "Rodney was distressed. “Don’t worry. I’ll protect you anyhow.”"
      }
    ]
  },
  {
    "title": "Chapter 1904 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "In the main office building."
      },
      {
        "paragraph": "Freya stood in front of the floor-to-ceiling window, gazing at the cars below her feet."
      },
      {
        "paragraph": "Her eyes flashed with a hint of unspeakable confusion."
      },
      {
        "paragraph": "Her mind was in a mess. She probably started feeling this way after learning that Rodney lied to her\nyesterday morning."
      },
      {
        "paragraph": "As such, she could not help but call Catherine. “ When I had breakfast with Rodney this morning, we\ntalked about Sarah, and I felt that his attitude was strange.”"
      },
      {
        "paragraph": "“What was strange about him? ” Her words made Catherine uneasy."
      },
      {
        "paragraph": "“He wasn’t as… disgusted as he used to be. It felt like he was trying to avoid the topic. But I can’t put\nmy finger on what it is.” Freya slid her finger over the window, not knowing why she did so, just like her\nmood at that moment."
      },
      {
        "paragraph": "“Could it be that you’re overthinking it?” Catherine fell silent for a moment before she comforted Freya,\n“Sarah has done a lot of evil deeds in the past. She even cuckolded Rodney and humiliated him. No\nman can forgive her.”"
      },
      {
        "paragraph": "A thought struck Freya’s mind. “Yeah. Whenever we used to mention this woman, he would make no\npretense of resenting her. But today… I didn’t see it on him. He kept lowering his head.”"
      },
      {
        "paragraph": "Catherine could not deny Freya’s thoughts. As women, they had very keen senses when they were\nwith their partners."
      },
      {
        "paragraph": "“One more thing…” Freya continued uncomfortably, “As you know, he was on a business trip earlier.\nYesterday, a friend of mine spotted him in Canberra in the morning, but he lied that his flight was\naround five or six in the evening. He only returned home at night and had even changed his clothes. I\nwent to his office yesterday, but he wasn’t there or at Osher Corporation. I don’t know why he lied to\nme…”"
      },
      {
        "paragraph": "“I suspect… he’s hiding Sarah, ” Catherine voiced out the thought that she did not wish to be true."
      },
      {
        "paragraph": "Freya instantly felt as if she was plunged into a"
      },
      {
        "paragraph": "deep abyss. She kept falling but could not reach the end. The feeling of being lost was miserable."
      },
      {
        "paragraph": "After a while, she muttered, “Maybe I am overthinking things. He might have something else to deal\nwith.”"
      },
      {
        "paragraph": "She did not believe that she was so unlucky."
      },
      {
        "paragraph": "In her first relationship, she was betrayed. Just as she planned on getting married in her second\nrelationship, it turned out to be a mess."
      },
      {
        "paragraph": "Rodney claimed that he loved her."
      },
      {
        "paragraph": "In fact, she had only agreed to marry him because she found it blissful to be loved by him."
      },
      {
        "paragraph": "“Yeah, that’s possible.” Catherine understood Freya’s feelings and consoled her, “What’s more, this one\ntime doesn’t mean anything. It could be a misunderstanding, or he did something that he doesn’t want\nyou to know. It’s impossible for all married couples to be completely honest with each other. This\nhappens to Shaun and me as well. How about you keep an eye on him and see what happens?”"
      },
      {
        "paragraph": "“By the way, he said he’ll get Snowden members to hunt Sarah down.” Freya felt better after hearing\nCatherine’s words."
      },
      {
        "paragraph": "“Let’s hope that we can find out Sarah’s whereabouts as soon as possible.” Catherine said, “ After\nchecking the footage of the surveillance camera, we can confirm that Sarah is back in Canberra. But\nshe seems to have vanished into thin air. Shaun suspects that she’s staying in an old residence that\ndoesn’t require any identity documents. He’s trying to look for her by targeting those areas.”"
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "“Don’t overthink things. We’ll handle this issue. ”"
      },
      {
        "paragraph": "As soon as Catherine hung up the call, she happened  to spot  Shaun’s car  entering  the manor."
      },
      {
        "paragraph": "He soon went upstairs and hugged her from behind. “Cathy, I just dropped Lucas and Suzie at\npreschool. Their teacher said that there’ll be some Halloween activities in a few days and asked us to\njoin.”"
      },
      {
        "paragraph": "“Their preschool really does have quite a lot of activities.” Catherine sighed."
      }
    ]
  },
  {
    "title": "Chapter 1905 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“This will enhance our relationship with the kids. There’s nothing bad about it.” Shaun kissed\nCatherine’s cheek. “What’s more, Suzie loves bragging the most. Every time we go to her preschool,\nher classmates will always say that we’re the most good-looking parents. I reckon it’s not possible to\nfind a greater match than us in Australia.”"
      },
      {
        "paragraph": "If he had said this back then, Catherine would have teased him by asking, “Are we a couple?”\nHowever, she was not in the mood today. “Who’s in charge of Snowden right now?”"
      },
      {
        "paragraph": "Shaun was momentarily stunned. “It seems like ever since Dani was born, Uncle Nathan has handed\npower over to Rodney. Why are you suddenly asking me this?”"
      },
      {
        "paragraph": "Catherine frowned."
      },
      {
        "paragraph": "During her conversation with Freya, she doubted whether Rodney was actually hiding Sarah even\nthough he claimed that he would get Snowden members to hunt her down. If he meant to hide the\ntruth, he would definitely keep it a secret from everyone, which would make finding Sarah more difficult."
      },
      {
        "paragraph": "“Nothing much. Freya said that Rodney will get Snowden members to hunt Sarah down.”"
      },
      {
        "paragraph": "“Oh. Speaking of this, Rodney called me this morning as well,” Shaun said."
      },
      {
        "paragraph": "“What did he say?”"
      },
      {
        "paragraph": "Shaun darted a strange glance at her. “As you know, I’ve planned to ask Prime Minister Snow for help\nif  I can’t find Sarah. But Rodney said he was worried that the people in Canberra would hazard\nguesses and panic and that he could get Snowden members to assist me. After some thought, what he\nsaid makes sense.”"
      },
      {
        "paragraph": "Catherine went quiet, and her brows furrowed."
      },
      {
        "paragraph": "“Darling, what’s the matter?” Shaun turned her body around. “What’s wrong?”"
      },
      {
        "paragraph": "“I’m just wondering if we can trust Rodney regarding Sarah’s matter.” Catherine suddenly said, “If he’s\nhiding Sarah, getting Snowden members to look for her might only keep her hidden.”"
      },
      {
        "paragraph": "Shaun froze. “Are you kidding me? Didn’t you tell me that Sarah hurt Rodney very badly?”"
      },
      {
        "paragraph": "“Yeah, but he loved her very badly too. Of course, I don’t wish for it to be the case. After all, Rodney is\nFreya’s husband. I just think that we should keep an eye out on him.”"
      },
      {
        "paragraph": "“Keep an eye out on him?” Shaun’s face darkened. ”Anyway, I have to hunt Sarah down. If Rodney\ndefends her, I’ll cut off my relationship with him.”"
      },
      {
        "paragraph": "“I’ll handle this issue.” Catherine sighed. “Just forget about it. After all, I could be overthinking things,\nand it’ll be unfair to Rodney.”"
      },
      {
        "paragraph": "Feeling helpless, Shaun pinched her cheeks. “Cathy, letting you handle the issue will make me seem\nuseless.”"
      },
      {
        "paragraph": "“Who said you’re useless? You’re quite good in bed.” Catherine lowered his head with delight. “I want\nmore….”"
      },
      {
        "paragraph": "“Go away. I need to go out and deal with something.”"
      },
      {
        "paragraph": "…"
      },
      {
        "paragraph": "In the next few days, Rodney went home on time."
      },
      {
        "paragraph": "At times, he even dragged Freya to accompany Dani for a walk after dinner."
      },
      {
        "paragraph": "The three of them strolled around the lake in the neighborhood. Soon, Freya’s messy thoughts were\ngone."
      },
      {
        "paragraph": "When they had dinner in the Snow family’s residence that day, Wendy was relieved to see the\nharmonious family. “When are the two of you… planning to hold a wedding?”"
      },
      {
        "paragraph": "Freya was stunned. Only then did it hit her that she and Rodney had not held a wedding despite\nalready having a child together."
      }
    ]
  },
  {
    "title": "Chapter 1906 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Any woman would long for a wedding."
      },
      {
        "paragraph": "Furthermore, when some people gossiped about Freya, she felt ashamed."
      },
      {
        "paragraph": "Freya instantly went quiet."
      },
      {
        "paragraph": "Rodney froze too. After glancing at the woman beside him, he was racked with guilt. “Yeah, we must\nhave a wedding.”"
      },
      {
        "paragraph": "“We’ll hold it before the new year then.” Old Master Snow said in a good mood, “Make it grand. You can\nbook an island in Albany.”"
      },
      {
        "paragraph": "“Yeah.” Wendy agreed joyfully. “We’ll have a helicopter to pick the bride. As for the wedding gown, we’ll\nhire the best designer to design it.”"
      },
      {
        "paragraph": "Jason also agreed. “Get the preparation started tomorrow. Let’s leave it to your mom to hire the best\nwedding team. Alright, Freya?”"
      },
      {
        "paragraph": "Upon hearing it, Freya was stunned. Only after a while did she come to her senses and answer, “Yes. I\nthink that’s a good idea.”"
      },
      {
        "paragraph": "“Good.” Old Master Snow said, “Rodney, you’d better put more effort into the wedding and be serious\nabout it. There will be a lot of wealthy and noble people attending your wedding. What’s more, it’s\nFreya and your wedding. It only happens once in a lifetime.”"
      },
      {
        "paragraph": "“Grandpa, I will.”"
      },
      {
        "paragraph": "Rodney promptly nodded in acknowledgment."
      },
      {
        "paragraph": "After dinner, Freya and Wendy sat together to look at some of their favorite wedding pictures on the\nphone."
      },
      {
        "paragraph": "Freya got excited when talking about her wedding since money was not her concern. “Mom, won’t it be\ntoo troublesome to pick me up from Melbourne to an island in Albany in a helicopter?”"
      },
      {
        "paragraph": "“What’s so troublesome about it? The flight will only take an hour plus. The whole of Melbourne will see\nyour grand wedding, and all the women in Australia will be jealous.” Wendy grinned."
      },
      {
        "paragraph": "Undeniably, women understood women’s thoughts best. “Rodney, am I right?”"
      },
      {
        "paragraph": "“Yes, yes. Whatever you say is right, Mom.” As soon as Rodney finished nodding, he could not help but\nthink that Sarah would see that too. In that case, she would be jealous."
      },
      {
        "paragraph": "He then thought of that woman. The better he treated Freya, the guiltier he felt toward Sarah."
      },
      {
        "paragraph": "Just as this woman came across his mind, he received a call from her."
      },
      {
        "paragraph": "He walked to the dining room while feigning calmness. “What’s the matter?”"
      },
      {
        "paragraph": "“Rodney, can you… come over? The electricity here went off all of a sudden, and I accidentally fell\ndown in the dark, ” Sarah said weakly."
      },
      {
        "paragraph": "“Are you alright?” Rodney was so shocked that he quickly asked in a deep voice."
      },
      {
        "paragraph": "“I think I’ve sprained my ankle.”  Sarah muttered,  “ I have no idea why the lights are off. I glanced\noutside and noticed that the elevator was a little…”"
      },
      {
        "paragraph": "“I’ll ask Hans to go over first, and I’ll come over later. Don’t move around…”"
      },
      {
        "paragraph": "“No.” Sarah said bashfully, “I was just trying to wear my pajamas when I sprained my ankle, so I’m not\ndressed appropriately. But I can’t move. Can you come over and put on a shirt for me?”"
      },
      {
        "paragraph": "Rodney took a glimpse at Freya in the living room and tightened his grip on his phone. “Alright, I’ll\ncome over right now.”"
      },
      {
        "paragraph": "After hanging up, he racked his brains to come up with an excuse. Then, he walked to Freya and said,\n“ Wifey, I’ll have the chauffeur to send you and Dani home. Mr. Micheal, whom I’ve always wanted to\nmeet previously, has suddenly returned to the country. He’s available tonight, so I need to go over to\nmeet him now.”"
      },
      {
        "paragraph": "Freya was dumbfounded while Wendy asked, “ Who’s Mr. Micheal?”"
      },
      {
        "paragraph": "“He’s an expert in lithium batteries, and I want to ask him something,” Rodney responded."
      },
      {
        "paragraph": "“Go ahead. then. I’ll have the chauffeur to send them home in a while.” Wendy waved her hand. Then,\nshe held Freya’s hand and said, “Come. Let’s continue.”"
      },
      {
        "paragraph": "Freya nodded."
      },
      {
        "paragraph": "Rodney let out a sigh of relief before he swiftly drove  to Sarah’s apartment."
      }
    ]
  },
  {
    "title": "Chapter 1907 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rodney opened the door and entered the apartment straight away. After turning on the flashlight on his\nphone, he saw Sarah in a thin laced dress lying in the living room. At one glance, he could tell that the\ndress was all she was wearing."
      },
      {
        "paragraph": "The young and vigorous Rodney, who had just done it, instantly felt blood rushing to his head."
      },
      {
        "paragraph": "He quickly looked away. Then, he took a jacket from the bedroom to cover Sarah’s body. When he\ncarried her, he realized that she was trembling all over, and she subconsciously snuggled in his arms."
      },
      {
        "paragraph": "Rodney’s body stiffened momentarily, and he promptly started a conversation. “Why are you dressed\nlike this?”"
      },
      {
        "paragraph": "“This is how I dress whenever I’m alone. There’s heating here, so I’m not afraid of the cold. But after\nthe electricity went off, the heating stopped working.” Sarah said, shivering, “I think I broke my ankle. It\nhurts when I move.”"
      },
      {
        "paragraph": "Rodney lowered his head and saw her swollen ankle."
      },
      {
        "paragraph": "He immediately called a personal doctor over."
      },
      {
        "paragraph": "Before the doctor arrived, he checked the apartment and found out that the circuit breaker was tripped."
      },
      {
        "paragraph": "“ It turns out that the circuit breaker was tripped.” Sarah was bummed out. “I was under the impression\nthat something went wrong with the circuit breaker. How silly of me.”"
      },
      {
        "paragraph": "“It’s normal for women to know nothing about things like this.” It was not a big deal to Rodney because\nFreya did not know about this as well."
      },
      {
        "paragraph": "Soon, the doctor brought a first-aid kit over. After examining Sarah, he said, “She didn’t break her\nankle. It’s just sprained. It’ll take half a month to one month for it to heal. Don’t move around during this\nperiod. It’s best that you hire someone to take care of you.”"
      },
      {
        "paragraph": "Rodney frowned as the issue was a little troublesome."
      },
      {
        "paragraph": "If he were to hire someone, that person had to be trustworthy."
      },
      {
        "paragraph": "“Hey, you’re feverish too.” The doctor suddenly reached out to feel Sarah’s forehead."
      },
      {
        "paragraph": "Sarah smiled bashfully without saying anything."
      },
      {
        "paragraph": "“Why didn’t you tell me that you’re not feeling well?” Rodney touched her forehead guiltily, only to\nrealize that she was having a high fever."
      },
      {
        "paragraph": "“I didn’t expect myself to be so weak either. I probably caught a cold when I fell down just now.” Sarah\ngave a bitter laugh. “I’ll be fine.”"
      },
      {
        "paragraph": "Upon hearing her words, Rodney felt even guiltier. He should have driven at a faster speed just now."
      },
      {
        "paragraph": "Perhaps he should assign someone to look after her every night. After all, it was worrying for a woman\nlike her to live alone."
      },
      {
        "paragraph": "Only after the doctor checked her temperature did he realize that it was 39 degrees Celsius."
      },
      {
        "paragraph": "Once Sarah took the medicine, she urged Rodney to leave as soon as possible. “Alright. Thanks for\ntonight. You should hurry up and go home.”"
      },
      {
        "paragraph": "“How can I leave with your current condition? Go to sleep. I’ll leave after you fall asleep and your fever\ngoes away.”"
      },
      {
        "paragraph": "Rodney took a chair and sat beside her."
      },
      {
        "paragraph": "Sarah threw a glance at him before falling asleep in a daze."
      },
      {
        "paragraph": "Afraid of disturbing her, Rodney set his phone on silent mode. He also sent Freya a WhatsApp\nmessage. [Sleep early. I’m not sure when I’ll finish my discussion with Mr. Micheal.]"
      },
      {
        "paragraph": "As soon as he sent the message, Sarah began to groan all of a sudden."
      },
      {
        "paragraph": "Rodney quickly changed the towel on her forehead, but Sarah suddenly gripped his hand and\nmumbled, “Rodney… Rodney… I miss you so much.”"
      },
      {
        "paragraph": "Her words made him grow upset. He became soft— hearted and weak. “Don’t worry, Sarah. I’m here…\n”"
      },
      {
        "paragraph": "As he softly coaxed Sarah, she slowly quietened but did not let go of his hand."
      }
    ]
  },
  {
    "title": "Chapter 1908 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "In the villa."
      },
      {
        "paragraph": "Looking at the phone that had been ringing for a long time, Freya slowly put it down."
      },
      {
        "paragraph": "She could hear Dani crying downstairs."
      },
      {
        "paragraph": "A moment later, she rose to her feet and headed downstairs. Then, she took Dani over from Aunty\nCally. “Let me carry her.”"
      },
      {
        "paragraph": "As soon as Freya carried her, she stopped crying. All she did was pout and snort, looking aggrieved."
      },
      {
        "paragraph": "Dani was clear about who she was closest to despite being at a young age."
      },
      {
        "paragraph": "Aunty Cally sighed helplessly. “Dani is usually quite easy to deal with. She might be feeling a little\nbloated tonight. Sometimes it’s normal for kids to experience it, but she’ll be fine once it passes."
      },
      {
        "paragraph": "Sadly, she doesn’t want me to carry her when she’s uncomfortable. How nice it would be if Young\nMaster Snow was around.”"
      },
      {
        "paragraph": "“ It’s alright, Aunty Cally. You can go to sleep. If I can’t handle it in the middle of the night, I’ll ask for\nyour help.” Freya could not bear to see Aunty Cally go through such a hard time at the age of 50."
      },
      {
        "paragraph": "“Okay. What about Young Master Snow? When will he be back?”"
      },
      {
        "paragraph": "“Not sure. He’s probably still talking business.” Freya dropped her eyes to hide her confused gaze."
      },
      {
        "paragraph": "Dani kept throwing tantrums until 2:00 a.m. or 3:00 a.m. Only then did she slowly fall asleep in Freya’s\narms. However, Freya could not let go of Dani, or she would wake up."
      },
      {
        "paragraph": "Freya had no choice but to lean on the pillow while hugging Dani with her eyes partly closed."
      },
      {
        "paragraph": "Sometimes, she glanced at her phone, but there were no notifications."
      },
      {
        "paragraph": "Rodney did not respond at all."
      },
      {
        "paragraph": "As much as she felt like losing her temper, she could not take it out on her kid. Therefore, she\nsuppressed her anger."
      },
      {
        "paragraph": "When it was around 5:00 a.m., Dani finally fell into a deep sleep."
      },
      {
        "paragraph": "Nevertheless, she could not fall asleep even though she was lying on the bed."
      },
      {
        "paragraph": "The next morning, Aunty Cally felt sympathetic"
      },
      {
        "paragraph": "toward Freya when she saw the latter. “Why don’t you sleep a little longer? It’s okay to go to work later.\nWhat matters most is your health.”"
      },
      {
        "paragraph": "“ I’ll come back and take a nap in the afternoon. I have something to deal with in the morning.” Freya\nswept a glance around the villa."
      },
      {
        "paragraph": "Aunty Cally immediately grasped the point. “Didn’t Young Master Snow… come back at all last night? I\nguess he’s busy. The Snow family has recently assigned him a large project to handle. According to\nMadam, the prime minister expects the business to occupy a leading position in the global market, so\nYoung Master Snow should be quite stressed.”"
      },
      {
        "paragraph": "“I understand.”"
      },
      {
        "paragraph": "Freya smiled as she changed the topic. “Is there breakfast?”"
      },
      {
        "paragraph": "“Yeah. Hold on, please.”"
      },
      {
        "paragraph": "After breakfast, Freya left the house  and went  to buy some breakfast before  heading  to the\nsubsidiary company that Rodney was working at."
      },
      {
        "paragraph": "By the time she arrived there, it was almost 9:00 a.m."
      },
      {
        "paragraph": "The minute the receptionist saw her, she said in surprise, “Madam, are you here to look for Second\nYoung Master or Eldest Young Master? Eldest Young Master hasn’t come to work yet.”"
      },
      {
        "paragraph": "“It’s okay. I’ll wait for him in the office. I’ve brought him breakfast, ” Freya said with a smile."
      },
      {
        "paragraph": "“How lucky of Eldest Young Master. By the way, his office is on the 19th floor.”"
      },
      {
        "paragraph": "“Thank you.”"
      },
      {
        "paragraph": "When Freya turned around and entered the elevator, she became absent-minded, and her face turned\ngrim."
      },
      {
        "paragraph": "After she arrived on the 19th floor, Hans, who was arranging some files, was shocked to see her. “\nMadam, what brings you here?”"
      },
      {
        "paragraph": "“I’ve brought breakfast for Young Master Snow.” Freya glanced around the office. “He said he talked\nbusiness with Mr. Micheal last night. I reckoned he didn’t have a good rest, so I brought him breakfast.”"
      },
      {
        "paragraph": "“Yeah. Young Master Snow drank a lot and only left at a very late hour.” Hans quickly added, “Mr.\nMicheal follows the American time zone. When it’s night here, it’s morning over there, so Young Master\nSnow had no choice but to settle for Mr. Micheal’s time.”"
      }
    ]
  },
  {
    "title": "Chapter 1909 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Chapter 1912"
      },
      {
        "paragraph": "In the villa."
      },
      {
        "paragraph": "Looking at the phone that had been ringing for a long time, Freya slowly put it down."
      },
      {
        "paragraph": "She could hear Dani crying downstairs."
      },
      {
        "paragraph": "A moment later, she rose to her feet and headed downstairs. Then, she took Dani over from Aunty\nCally. “Let me carry her.”"
      },
      {
        "paragraph": "As soon as Freya carried her, she stopped crying. All she did was pout and snort, looking aggrieved."
      },
      {
        "paragraph": "Dani was clear about who she was closest to despite being at a young age."
      },
      {
        "paragraph": "Aunty Cally sighed helplessly. “Dani is usually quite easy to deal with. She might be feeling a little\nbloated tonight. Sometimes it’s normal for kids to experience it, but she’ll be fine once it passes."
      },
      {
        "paragraph": "Sadly, she doesn’t want me to carry her when she’s uncomfortable. How nice it would be if Young\nMaster Snow was around.”"
      },
      {
        "paragraph": "“ It’s alright, Aunty Cally. You can go to sleep. If I can’t handle it in the middle of the night, I’ll ask for\nyour help.” Freya could not bear to see Aunty Cally go through such a hard time at the age of 50."
      },
      {
        "paragraph": "“Okay. What about Young Master Snow? When will he be back?”"
      },
      {
        "paragraph": "“Not sure. He’s probably still talking business.” Freya dropped her eyes to hide her confused gaze."
      },
      {
        "paragraph": "Dani kept throwing tantrums until 2:00 a.m. or 3:00 a.m. Only then did she slowly fall asleep in Freya’s\narms. However, Freya could not let go of Dani, or she would wake up."
      },
      {
        "paragraph": "Chapter 1912"
      },
      {
        "paragraph": "Freya had no choice but to lean on the pillow while hugging Dani with her eyes partly closed."
      },
      {
        "paragraph": "Sometimes, she glanced at her phone, but there were no notifications."
      },
      {
        "paragraph": "Rodney did not respond at all."
      },
      {
        "paragraph": "As much as she felt like losing her temper, she could not take it out on her kid. Therefore, she\nsuppressed her anger."
      },
      {
        "paragraph": "When it was around 5:00 a.m., Dani finally fell into a deep sleep."
      },
      {
        "paragraph": "Nevertheless, she could not fall asleep even though she was lying on the bed."
      },
      {
        "paragraph": "The next morning, Aunty Cally felt sympathetic"
      },
      {
        "paragraph": "toward Freya when she saw the latter. “Why don’t you sleep a little longer? It’s okay to go to work later.\nWhat matters most is your health.”"
      },
      {
        "paragraph": "“ I’ll come back and take a nap in the afternoon. I have something to deal with in the morning.” Freya\nswept a glance around the villa."
      },
      {
        "paragraph": "Aunty Cally immediately grasped the point. “Didn’t Young Master Snow… come back at all last night? I\nguess he’s busy. The Snow family has recently assigned him a large project to handle. According to\nMadam, the prime minister expects the business to occupy a leading position in the global market, so\nYoung Master Snow should be quite stressed.”"
      },
      {
        "paragraph": "“I understand.”"
      },
      {
        "paragraph": "Freya smiled as she changed the topic. “Is there breakfast?”"
      },
      {
        "paragraph": "“Yeah. Hold on, please.”"
      },
      {
        "paragraph": "After breakfast, Freya left the house  and went  to buy some breakfast before  heading  to the\nsubsidiary company that Rodney was working at."
      },
      {
        "paragraph": "By the time she arrived there, it was almost 9:00 a.m."
      },
      {
        "paragraph": "The minute the receptionist saw her, she said in surprise, “Madam, are you here to look for Second\nYoung Master or Eldest Young Master? Eldest Young Master hasn’t come to work yet.”"
      },
      {
        "paragraph": "“It’s okay. I’ll wait for him in the office. I’ve brought him breakfast, ” Freya said with a smile."
      },
      {
        "paragraph": "“How lucky of Eldest Young Master. By the way, his office is on the 19th floor.”"
      },
      {
        "paragraph": "“Thank you.”"
      },
      {
        "paragraph": "When Freya turned around and entered the elevator, she became absent-minded, and her face turned\ngrim."
      },
      {
        "paragraph": "After she arrived on the 19th floor, Hans, who was arranging some files, was shocked to see her. “\nMadam, what brings you here?”"
      },
      {
        "paragraph": "“I’ve brought breakfast for Young Master Snow.” Freya glanced around the office. “He said he talked\nbusiness with Mr. Micheal last night. I reckoned he didn’t have a good rest, so I brought him breakfast.”"
      },
      {
        "paragraph": "“Yeah. Young Master Snow drank a lot and only left at a very late hour.” Hans quickly added, “Mr.\nMicheal follows the American time zone. When it’s night here, it’s morning over there, so Young Master\nSnow had no choice but to settle for Mr. Micheal’s time.”"
      }
    ]
  },
  {
    "title": "Chapter 1910 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“No need. Mom has asked us to attend a mini fashion event. We’ll meet Courtney there and ask her to\ndesign our wedding outfits for us,” Freya said indifferently."
      },
      {
        "paragraph": "“Okay, okay. I promise to pick you up on time. By the way, was Dani fine last night?”"
      },
      {
        "paragraph": "“She wasn’t well, so she threw tantrums the whole night.” As soon as Freya finished speaking, she\nhung up in annoyance."
      },
      {
        "paragraph": "Rodney scratched his head in distress."
      },
      {
        "paragraph": "At night, he went to the fashion event with Freya."
      },
      {
        "paragraph": "However, Freya pulled a long face throughout the event."
      },
      {
        "paragraph": "Rodney was apologizing to her non-stop, “I’m sorry, Freya. I swear I won’t set my phone to silent mode\nanymore. I had no choice but to do that last night. Mr. Micheal knows core technologies very well, and I\nwas too engrossed in the conversation. I’ll take care of Dani tonight so you can rest early, alright? Or…\nWhen I go home tonight, I’ll kneel down until you forgive me.”"
      },
      {
        "paragraph": "“Enough.”"
      },
      {
        "paragraph": "Ruffled by his nagging, Freya halted her steps. “Do you know why I’m so mad? It’s because you didn’t\npick up my call. Last night, I didn’t stop you from leaving the house nor interrupt your work, but can you\nplease respect me? Putting myself aside, is the kid not as important as your work?”"
      },
      {
        "paragraph": "“Don’t say that. You and the kid are very important. Both of you are my top priority. ” Rodney held her\nhand. “Dani usually behaves well. I had no idea why she suddenly cried last night. If I had known it, I\nwould’ve come back straight away without caring about my work.”"
      },
      {
        "paragraph": "Freya opened her mouth and fixed her eyes on his handsome, exquisite face."
      },
      {
        "paragraph": "She used to have complete trust in him. However, ever since he lied to her about his return from\nCairns, she had not been able to tell whether he was truthful or not."
      },
      {
        "paragraph": "Nevertheless, she always thought, ‘What if it’s true? What if she misunderstood him?"
      },
      {
        "paragraph": "“Let’s meet Courtney and get her to design the most beautiful wedding dress for you.”"
      },
      {
        "paragraph": "Rodney headed toward the banquet hall with his arm around her waist."
      },
      {
        "paragraph": "Courtney Green was the leading wedding designer in Australia."
      },
      {
        "paragraph": "She treated Freya and Rodney courteously, considering their unusual status. She even showed Freya\nthe design of her wedding dress."
      },
      {
        "paragraph": "The minute Freya saw the design, she fell in love with it. “I love this design.”"
      },
      {
        "paragraph": "“You have great taste, Ms. Lynch. But because the dress features a lot of embroideries, it’ll take at least\ntwo months to create. After all, I’ll be the one embroidering the entire dress by hand.” Courtney smiled\nin a dignified manner."
      },
      {
        "paragraph": "“No problem.”"
      },
      {
        "paragraph": "After that, Freya and Courtney exchanged phone numbers and chatted a lot about fashion."
      },
      {
        "paragraph": "Rodney was a little bored listening to their conversation at the side. At this moment, the organizer of\nthe event happened to welcome him in person and took him to the guest room."
      },
      {
        "paragraph": "After chatting with Freya for almost half an hour, Courtney noticed there were some issues with the\nfashion show tonight. Hence, she went to handle it."
      },
      {
        "paragraph": "Freya sat on the couch and gazed at the scenery through the French window. She was not in a rush to\nlook for Rodney."
      },
      {
        "paragraph": "“The fashion show is about to begin. Don’t you want to watch it?”"
      },
      {
        "paragraph": "A figure walked up from behind."
      },
      {
        "paragraph": "Freya saw Ryan’s long and sturdy figure reflected on the window."
      },
      {
        "paragraph": "“What brings you here?”"
      }
    ]
  },
  {
    "title": "Chapter 1911 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya turned around, only to see Ryan dressed in a dark suit. A ray of gorgeous light shone on his\nelegant, handsome face. He might look gentle with a smile, but she knew that in reality, he was\nrestrained and stoic, just like his father, Prime Minister Snow."
      },
      {
        "paragraph": "“I received an invitation card, so here I am. ” Ryan shrugged. “Where’s Rodney? You look unhappy\nwithout his company.”"
      },
      {
        "paragraph": "“He’s over there.” Freya then went quiet for a moment. “Ryan, have you heard of Mr. Micheal?”"
      },
      {
        "paragraph": "Ryan shook his head. “What gives?”"
      },
      {
        "paragraph": "“Can you help me nose around on him?” After some thought, Freya said, “Last night, Rodney didn’t\ncome at all. He said that Mr. Micheal is an expert in lithium batteries, and I’m not quite sure about it.”"
      },
      {
        "paragraph": "“You think he’s lying to you?” Ryan frowned. “I don’t think he would.”"
      },
      {
        "paragraph": "“What do you mean?”"
      },
      {
        "paragraph": "“Based on my understanding of him, he wouldn’t sink so low as to lie to you even though he speaks\nharshly and has a low EQ.” Ryan said, “He’s a direct person, but he doesn’t really know how to hide\nthings.”"
      },
      {
        "paragraph": "Deep down, Freya chuckled. She had thought the same as well."
      },
      {
        "paragraph": "That was why she still could not stop dwelling on it ever since Rodney lied to her."
      },
      {
        "paragraph": "“Perhaps I’m overthinking  it. Please help me to find out about it.” Freya pursed her lips. “I have no idea\nwho to ask for help. Since you’re here and considered my little brother, how about you do me this"
      },
      {
        "paragraph": "favor?”"
      },
      {
        "paragraph": "“A brother who’s three months younger than you?” Ryan darted a helpless yet doting look at her. “You\nmight not feel ashamed  to call me your little brother, but I’m too shy to acknowledge it.”"
      },
      {
        "paragraph": "Freya said dispiritedly, “That’s too bad you were born three months later than me. Your parents were\nthe ones who acknowledged me as their goddaughter. ”"
      },
      {
        "paragraph": "Ryan choked before laughing out loud. “Fine. I’ll do you this favor and give you an answer tomorrow\nmorning.”"
      },
      {
        "paragraph": "“So soon?” Freya was astonished."
      },
      {
        "paragraph": "“Duh. It’s just a small matter.” Ryan  shrugged.  “ I’m currently in charge of immigration, so I can just\ncheck it using the computer.”"
      },
      {
        "paragraph": "Freya was at a loss for words."
      },
      {
        "paragraph": "It turned out that it was such an easy task for him."
      },
      {
        "paragraph": "At the sight of her dumbfounded expression, Ryan could not help but burst into laughter and touched\nher head. “Were you dwelling on this for a long time? Some things you don’t have to keep to yourself.\nYou can always ask for my help.”"
      },
      {
        "paragraph": "His words warmed Freya’s heart. Just as she was about to speak, Rodney’s fierce criticism rang out\nbeside her."
      },
      {
        "paragraph": "“Ryan, what are you doing with your hand?” Rodney strode toward Ryan and slapped the latter’s hand\noff. With a cold tone, he said, “She’s your sister-in-law. Don’t touch her however you like.”"
      },
      {
        "paragraph": "Ryan raised his brows, but those words made Freya uncomfortable. “What are you doing? He’s your\ncousin.”"
      },
      {
        "paragraph": "“Even so, he shouldn’t put his hand on your head. ” Rodney snorted. He was clear about Ryan’s\nmotive. “We have to keep boundaries with the opposite S*x.”"
      },
      {
        "paragraph": "“Alright. I’ll be careful next time. ” Ryan dropped his gaze, which hid the annoyance in his eyes."
      },
      {
        "paragraph": "Then, he waved his hand and took his leave first."
      },
      {
        "paragraph": "As Freya watched Ryan leave, she felt that Rodney was too petty. “You’re right in saying that we have\nto keep boundaries with the opposite sex. But when I’m with my biological brother or Ryan, my non-\nbiological little brother, we’re as clean as a whistle. Can you not make a big deal out of it? I don’t know \na lot of people in Canberra, but because of your behavior, Ryan and I will feel awkward when we see\neach other next time.”"
      },
      {
        "paragraph": "“I didn’t say both of you can’t greet each other. I’m fine as long as he doesn’t touch you.”"
      },
      {
        "paragraph": "Rodney’s mouth twitched. “I have no choice but to be petty because I care about you.”"
      },
      {
        "paragraph": "He almost blurted out the word ‘jealous’. What else could Freya say?"
      },
      {
        "paragraph": "After all, when men were jealous, it meant that they cared."
      }
    ]
  },
  {
    "title": "Chapter 1912 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "It was already past 10:00 p.m. when they returned from the banquet."
      },
      {
        "paragraph": "Although Freya did not have a good rest last night, she was not as tired as she had taken a nap in the\nevening."
      },
      {
        "paragraph": "On the other hand, Rodney could not fight off his sleepiness when he was putting Dani to sleep."
      },
      {
        "paragraph": "He had not rested well as he had spent the night in Sarah’s apartment last night. He was exhausted."
      },
      {
        "paragraph": "When Freya turned around, Rodney had already fallen asleep on his side. One of his hands was\nresting on Dani, which was the same position when he was putting her to sleep."
      },
      {
        "paragraph": "Dani had not fallen asleep at all. She was still squirming on the bed."
      },
      {
        "paragraph": "Freya could confirm that Rodney had not rested well last night."
      },
      {
        "paragraph": "She recalled him saying that he was working."
      },
      {
        "paragraph": "Freya carried Dani out to not disturb Rodney’s sleep."
      },
      {
        "paragraph": "When Rodney woke up the next day, he saw that Freya was still sleeping. He suddenly remembered\nthat he had fallen asleep first. He was embarrassed."
      },
      {
        "paragraph": "He quickly crept downstairs and saw Aunty Cally making breakfast. He went over. “Let me do it.”"
      },
      {
        "paragraph": "“Okay. Madam Snow likes the breakfast that you make more, ” Aunty Cally said, “Moreover, Madam\nSnow most probably only went to sleep when it was almost morning.”"
      },
      {
        "paragraph": "“Aunty Cally, didn’t you help her out?” Rodney could not help but ask."
      },
      {
        "paragraph": "“I wanted to, but Dani only wanted Madam Snow to carry her.” Aunty Cally sighed. “Madam Snow is\nvery kind too. She was afraid that my body couldn’t take it as I’m old. I told her that she could take care\nof Dani for the first half of the night and I would take over afterward. When I woke up to look for her in\nthe middle of the night, she told me to go to sleep again. At that time, Dani was lying in her arms and\nshe would cry if there was even a slight movement. When I woke up in the morning, it seemed that\nMadam Snow’s arms were very sore.”"
      },
      {
        "paragraph": "“In the future… I won’t spend the night outside except during business trips.” Rodney’s brows knitted in\na tight frown upon hearing Aunty Cally’s words."
      },
      {
        "paragraph": "Aunty Cally nodded. There were some things that she could not point out directly."
      },
      {
        "paragraph": "After saying so much, it was good that Young Master Snow could understand."
      },
      {
        "paragraph": "Moreover, Aunty Cally really  thought  that Freya was very nice. She was not haughty, and she did not\ntreat her as a maid."
      },
      {
        "paragraph": "No wonder everyone in the Snow family liked her."
      },
      {
        "paragraph": "Upstairs."
      },
      {
        "paragraph": "Freya was disturbed from her sleep by her phone’s ringtone."
      },
      {
        "paragraph": "When the phone rang, she was instinctively worried about waking Dani. She quickly took her phone\nand went to the balcony. She only knew that it was Ryan who was calling after the call was connected."
      },
      {
        "paragraph": "“Were you still sleeping? I didn’t wake you, right?”"
      },
      {
        "paragraph": "Ryan’s pleasant voice came through the phone. Freya yawned. “My sleep has already been interrupted\nbecause of you. What business do you have?”"
      },
      {
        "paragraph": "“Did you forget what you asked me to do last night?” After Ryan spoke, Freya became wide awake.\nShe remembered."
      },
      {
        "paragraph": "However, Ryan went silent."
      },
      {
        "paragraph": "Freya’s heart tightened. “How did the investigation go?”"
      },
      {
        "paragraph": "“I’m sorry.” Ryan sighed. “I have to tell you the truth. The immigration department did record a Mr.\nMicheal entering Australia, but he came half a month ago and has already left the country around ten\ndays ago. I was afraid that I was mistaken, so I even had someone investigate whether Mr. Micheal\nmatched the person you mentioned. He’s indeed an expert in lithium batteries and has collaborations\nwith Snow Corporation’s subsidiary company."
      },
      {
        "paragraph": "However, there’s no way he would’ve appeared in Australia in the past few days.”"
      },
      {
        "paragraph": "Freya did not say a word. She simply gazed at the garden downstairs."
      },
      {
        "paragraph": "Her head was filled with the words Rodney had said yesterday."
      },
      {
        "paragraph": "“Freya, I’m sorry. I switched my phone to silent mode when I was talking to Mr. Micheal last night. I\nforgot about the time when we were talking. When I remembered, it was already dawn. I was scared\nthat"
      },
      {
        "paragraph": "I would disturb your sleep."
      },
      {
        "paragraph": "“Freya, I’m sorry. I swear that I’ll never switch my phone to silent mode again. I had no choice. Mr.\nMicheal knows a lot about technology. I was too engrossed in our conversation."
      },
      {
        "paragraph": "“ I didn’t know that Dani would cry all of a sudden last night. If I had known, I would’ve ditched my work\nand come back immediately.”"
      }
    ]
  },
  {
    "title": "Chapter 1913 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "The words Rodney said were so sincere. She really believed them."
      },
      {
        "paragraph": "However, all of them were lies. They were all meant to deceive her."
      },
      {
        "paragraph": "Had telling lies become a habit to him that even he believed in them himself?"
      },
      {
        "paragraph": "Freya’s chest felt suffocated."
      },
      {
        "paragraph": "She was depressed, ridiculous, angry, and sad. She felt like a total joke."
      },
      {
        "paragraph": "She still could not understand why Rodney was lying to her."
      },
      {
        "paragraph": "“Freya… ” Ryan called out to Freya worriedly as she was silent. “Don’t worry. I’ll investigate this matter\nthoroughly for you—”"
      },
      {
        "paragraph": "“No need. I might’ve guessed something, ” Freya interrupted him with a hoarse voice. “I’m fine on my\nown.”"
      },
      {
        "paragraph": "“Okay. ” Ryan could hear from her voice that she was holding back her tears. He was unhappy. “No\nmatter what you decide, I’ll always support you.”"
      },
      {
        "paragraph": "“Really?” Freya lifted her lips in a self-deprecating smile. “How will you support me? Ultimately, I’m still\nan outsider in the Snow family. I may be your dad’s goddaughter, but everyone knows the true reason\nbehind him taking me in as his goddaughter.”"
      },
      {
        "paragraph": "“But I’m always on your side,” Ryan said gently, “ Otherwise, I wouldn’t have told you the truth today. If I\nwere on Rodney’s side, I would’ve personally found him to teach him a lesson and tell him not to lie to"
      },
      {
        "paragraph": "you in the future. However, I think you have the right to know the truth. You can seek out the truth. If he\nhas really disappointed you, I’ll help you.”"
      },
      {
        "paragraph": "“How will you help me?” Freya could not help but ask in confusion."
      },
      {
        "paragraph": "“I’ll help you to fight for Dani’s custody, ” Ryan said in a low voice."
      },
      {
        "paragraph": "Freya’s eyes were almost wet with tears."
      },
      {
        "paragraph": "Why did she promise to get along with Rodney before? Actually, was it not all for Dani’s sake?"
      },
      {
        "paragraph": "She knew that she could not win against Rodney or the Snow family."
      },
      {
        "paragraph": "In addition, Rodney said he liked her and had started to treat her well. Her heart wavered, and she\nbegan to have some thoughts."
      },
      {
        "paragraph": "Freya thought that Rodney would give her the same good treatment he had given Sarah."
      },
      {
        "paragraph": "She thought that the woman who was loved by Rodney would be very happy."
      },
      {
        "paragraph": "Maybe she had overthought."
      },
      {
        "paragraph": "The woman who was loved by Rodney was Sarah, while she was just Freya."
      },
      {
        "paragraph": "“Thank you.” Freya ended the call. She turned around and went back into the room. Looking at Dani’s\nsweet, happy smile, her heart was filled with confusion."
      },
      {
        "paragraph": "If it was possible, she really hoped that things could continue as they were forever."
      },
      {
        "paragraph": "That way, her child would be able to grow up in a happy family."
      },
      {
        "paragraph": "Too bad… there were no ifs."
      },
      {
        "paragraph": "“Wifey, you’re awake. Come and have some breakfast. ” Rodney suddenly opened the door and\nentered. He saw Freya sitting at the side of the bed with her long hair down. Her side profile was\nexquisite."
      },
      {
        "paragraph": "He could not resist going over to hug her. He lowered his head to kiss her."
      },
      {
        "paragraph": "“I haven’t brushed my teeth.”"
      },
      {
        "paragraph": "Freya avoided Rodney. She went into the bathroom and closed the door."
      },
      {
        "paragraph": "She leaned against the door. After a moment of silence, she went in front of the mirror and flashed a\nsmile that was even uglier than a crying face."
      },
      {
        "paragraph": "She went back out after washing her face. She had regained her calmness."
      },
      {
        "paragraph": "While having breakfast, Rodney said,  “Let’s arrange a time to have our wedding photos taken. I’ll ask\nthe staff of the wedding photography studio to look for you in the evening. You can communicate with\nthem regarding the style of photos that you like.”"
      }
    ]
  },
  {
    "title": "Chapter 1914 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya’s hand that was holding a spoon paused. She raised her head and asked, “You’re not joining?”"
      },
      {
        "paragraph": "“I’m okay with anything.” Rodney shrugged nonchalantly. “As long as you like it.”"
      },
      {
        "paragraph": "“Then… Is it okay if I want to go to the Maldives for our wedding photoshoot?” Freya raised her\neyebrows."
      },
      {
        "paragraph": "Rodney was stunned. “It’ll take about a week if we go to the Maldives, right? Dani’s still too young… ”"
      },
      {
        "paragraph": "“We can go there on a private airplane. We can bring two more nannies along too.”"
      },
      {
        "paragraph": "“I’m quite busy with work,” Rodney said vaguely,  “ I can’t hand over everything to Carson. We can just\ntake the photos at a beach nearby. I can accompany you to the Maldives in the future if you want to go\nthere.”"
      },
      {
        "paragraph": "He could not leave Australia this month. He would be in trouble if something happened on Sarah’s side."
      },
      {
        "paragraph": "“… Okay.”"
      },
      {
        "paragraph": "Freya gazed at Rodney for a while in silence. Then, she smiled."
      },
      {
        "paragraph": "After breakfast, she went upstairs to change her clothes and then came back down with her handbag."
      },
      {
        "paragraph": "“Wait, I’ll give you a ride…” Rodney had not changed his clothes yet."
      },
      {
        "paragraph": "“No need. It’s more convenient for me to drive myself.”"
      },
      {
        "paragraph": "Freya smiled faintly. She took the car keys and quickly went out."
      },
      {
        "paragraph": "Rodney stood there for some time. He turned around and called Hans. “How’s Sarah doing? Has she\ngotten better?”"
      },
      {
        "paragraph": "“She’s still having a fever. I’ve called the doctor over to put her on an IV…” Hans stammered."
      },
      {
        "paragraph": "“Why didn’t you tell me last night?” Rodney was furious."
      },
      {
        "paragraph": "Freya did not go to the company. She gave Catherine a call. “Let’s go for a drive. I’m in a bad mood.\nDon’t tell me that you have to be with your man. If not, our friendship is over.”"
      },
      {
        "paragraph": "“Ah, your words are making me sad. What good is there in accompanying men? Sisters are definitely\nmore important.”"
      },
      {
        "paragraph": "When Catherine said those words, Shaun was by her side."
      },
      {
        "paragraph": "He widened his eyes in disbelief. “Cathy, your words are too much.”"
      },
      {
        "paragraph": "“Shaunny, I really think you’ve stayed in the house long enough. You should go to work now. You look\nthe most handsome when you’re working.” Catherine cupped his handsome face. After giving him a\npeck, she headed out."
      },
      {
        "paragraph": "Shaun stood at the door, gazing at the back of her car that was departing."
      },
      {
        "paragraph": "He deeply felt the extent of a woman’s heartlessness."
      },
      {
        "paragraph": "Catherine did not say that when they were in bed last night. She even said he was very, very\nhandsome… Tsk."
      },
      {
        "paragraph": "When Catherine arrived at the lakeside, Freya had already been sitting there for some time."
      },
      {
        "paragraph": "The weather was cold. Not many people would go to the lakeside early in the morning. Freya’s face\nwas pale from being blown by the wind."
      },
      {
        "paragraph": "“You’ve chosen such a good spot to relax.”"
      },
      {
        "paragraph": "Catherine instinctively wrapped her coat tighter around herself. “This place is too cold.”"
      },
      {
        "paragraph": "“I suspect that… Rodney is hiding Sarah, ” Freya said all of a sudden as she gazed at the surface of\nthe lake. Catherine stiffened. Her pretty little face had a complicated expression on it. “Do you have\nevidence?”"
      }
    ]
  },
  {
    "title": "Chapter 1915 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“No.” Freya shook her head. “But Rodney didn’t come back the whole night the day before yesterday.\nHe lied to me, saying that he had a business engagement with Mr. Micheal. I asked someone to\ninvestigate it. Mr. Micheal already left Australia long ago. He’s not in Canberra at all. Oh, but Rodney\nlied as though he himself believed it was the truth. The fact that he went to Cairns for a business trip\npreviously was a lie too.”"
      },
      {
        "paragraph": "Catherine went silent."
      },
      {
        "paragraph": "She gazed at Freya’s pale face. She suddenly felt regretful. Why had she advised Freya to try to get\nalong with Rodney back then?"
      },
      {
        "paragraph": "However, Catherine never thought that Rodney would be like this either."
      },
      {
        "paragraph": "Not much time had passed yet Rodney was already telling lies."
      },
      {
        "paragraph": "Freya continued saying, “ I gave it some thought. With Rodney’s character, it’s unlikely that he has\nanother woman outside, so it has to be Sarah. You also said that Sarah has returned, but she can’t be\nfound. Sarah might’ve hurt Rodney before, but you said yourself that she’s a person who has once\ncompletely deceived Rodney, Chester, and Shaun before. Rodney is so stupid. Maybe he’s getting\ndeceived by Sarah again. It’s not impossible.”"
      },
      {
        "paragraph": "“Don’t be so certain about it.” Catherine sat by Freya’s side. She took something out of her pocket and\nhanded it to Freya."
      },
      {
        "paragraph": "“What is this?” Freya received it. She realized that the item was as tiny as an ant."
      },
      {
        "paragraph": "“A tracker.”"
      },
      {
        "paragraph": "Catherine cleared her throat. “I wanted to use it on Shaun, but I think you need it more than me.”"
      },
      {
        "paragraph": "“Just be frank. I may be silly, but I’m not an idiot, ” Freya said coldly."
      },
      {
        "paragraph": "“Okay.” Catherine touched her forehead. “Actually, when you told me the previous time that Rodney’s\nattitude toward Sarah is a little weird and he lied to you about going to Cairns, I had someone make\nthis thing.”"
      },
      {
        "paragraph": "“So you had your suspicions from the start?” Freya stared at Catherine."
      },
      {
        "paragraph": "Catherine was embarrassed. “You were the one who suspected him first. Actually, I have a question\nbecause I can’t seem to understand. Why did Sarah want to come back? If she escaped overseas,\nchanged her identity, and continued with her life, we might not even be able to find her. However, she\nstill took the risk and came back.”"
      },
      {
        "paragraph": "“Changing to another identity means starting over again. Her days will definitely not be as comfortable\nas before, ” Freya could not help but mutter."
      },
      {
        "paragraph": "“That’s right. Sarah has returned, but why does she think that she won’t get caught by us even if she\ncomes back?” Catherine said, “Wesley adamantly refused to testify against Sarah after he was caught.\nHe knows that we hate Sarah, and he hates us a lot. Do you think he’s letting Sarah be on the loose on\npurpose? Maybe they have some plans that we don’t know about. By keeping Sarah, does Wesley\nthink that she still has the ability to go against us?”"
      },
      {
        "paragraph": "“Who knows?”  Freya’s body felt cold upon listening to Catherine. “Your words made me have\ngoosebumps.”"
      },
      {
        "paragraph": "“Let’s test Rodney.”"
      },
      {
        "paragraph": "Catherine said, “You’re with him every day. Insert this inside his phone while he’s bathing and you can\nfind out where he goes every day. We can confirm it very soon if he’s hiding Sarah.”"
      },
      {
        "paragraph": "Freya stared at that tiny thing. She seemed to feel a heavy weight pressing onto her. “If he’s really\nhiding Sarah, I’ll never forgive him for my whole life. I’ll divorce him.”"
      },
      {
        "paragraph": "Catherine patted her shoulders to console her."
      },
      {
        "paragraph": "Freya was upset. “I don’t believe that I’ll lose to Sarah again. What’s so good about that woman? How\nam I not good enough compared to her? If I get a divorce, I’ll never marry again in this lifetime. I’ll never\ntrust men again.”"
      },
      {
        "paragraph": "“Don’t be so sure yet. Maybe Rodney has other reasons. ” Catherine tried to console Freya. “If he’s\nreally hiding Sarah, not only will I support you in divorcing him but I won’t even let Shaun contact him.”"
      },
      {
        "paragraph": "“Mm, don’t interact with Rodney. Just let him stay by that b*tch Sarah’s side his whole life. No, we won’t\neven let Sarah stay alive. We still have to avenge Charity and Aunty Jennifer.”"
      },
      {
        "paragraph": "In the past, Freya could forgive Rodney no matter how much they fought. That was because Rodney\nhad not touched her limit."
      },
      {
        "paragraph": "Her limit was Sarah."
      },
      {
        "paragraph": "No one could ever violate that."
      },
      {
        "paragraph": "Freya unconsciously tightened her grip on the tracker in her hand."
      }
    ]
  },
  {
    "title": "Chapter 1916 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "9:00 p.m."
      },
      {
        "paragraph": "Freya heard the sound of a car returning from outside after she took a bath."
      },
      {
        "paragraph": "When she walked out in her pajamas, Rodney had just come in from outside. He was carrying Dani\nand kissing her."
      },
      {
        "paragraph": "“Madam Snow…” Aunty Cally greeted her."
      },
      {
        "paragraph": "When Rodney saw her, his eyes brightened. He immediately went over to Freya, wanting to hug her."
      },
      {
        "paragraph": "“Why are you back so late? What were you busy with?” Freya instinctively felt repulsed. She put her\nhands against his chest and deliberately said, “ I can smell women’s perfume on you.”"
      },
      {
        "paragraph": "Rodney became flustered at that moment. It was impossible. He had only carried Sarah to the dining\ntable during dinner that night. Did the smell get on him because of that? However, the scent could not\npossibly be that strong with just a touch. Did Freya have a dog’s nose?"
      },
      {
        "paragraph": "“That’s impossible.”"
      },
      {
        "paragraph": "Rodney widened his eyes and showed a wronged expression. “I didn’t even touch a woman’s hand\ntoday.”"
      },
      {
        "paragraph": "“Really? But there’s indeed the smell of women’s perfume.” Freya looked at Rodney with a cold\nexpression."
      },
      {
        "paragraph": "Actually, she did not smell anything. She just said that on purpose."
      },
      {
        "paragraph": "Although it was just an instant, she could sense that Rodney’s body had stiffened for a moment when\nher hand was resting on his chest and she was interrogating him."
      },
      {
        "paragraph": "“Maybe it’s because the female secretaries kept coming into my office, so their smell stuck on me.”\nRodney showed a wronged expression. “Freya, don’t you know how pure of a man I am?”"
      },
      {
        "paragraph": "“Go and take a bath.” Freya barely managed to squeeze a smile out on her face."
      },
      {
        "paragraph": "She did not want to face him anymore."
      },
      {
        "paragraph": "It was true that he had kept himself pure, but who did he do that for in the past?"
      },
      {
        "paragraph": "She had really thought of Rodney as a careful man who would not fool around in relationships because\nhe still kept his virginity despite being over 30 years old."
      },
      {
        "paragraph": "Ha."
      },
      {
        "paragraph": "Freya used to think that Chester was a sc*mbag."
      },
      {
        "paragraph": "However, she felt that although a man like Chester was sc*mmy, at least he was open about it—unlike\na particular man who desired another woman when he already had a wife."
      },
      {
        "paragraph": "He even acted out the role of a good husband and a good father."
      },
      {
        "paragraph": "He was too pretentious."
      },
      {
        "paragraph": "Why did Rodney become like this?"
      },
      {
        "paragraph": "Freya would rather Rodney be straightforward with his words as he was in the past, even though his\nwords might be harsh."
      },
      {
        "paragraph": "“Oh, okay. I’ll go take my bath, then.” Rodney nodded. “But, wifey, I really didn’t do you any wrong. I’ve\nnever wanted another woman ever since the day I confessed to you.”"
      },
      {
        "paragraph": "Freya nodded."
      },
      {
        "paragraph": "Rodney might not have thought of it before."
      },
      {
        "paragraph": "However, who knew what would happen in the future?"
      },
      {
        "paragraph": "While Rodney was bathing, Freya quickly took the tracker out of her bag and inserted it into the SIM\ncard slot of his phone."
      },
      {
        "paragraph": "Luckily, the tracker was tiny. It most probably would not be noticed for the time being."
      },
      {
        "paragraph": "At night, Rodney went near Freya and started touching her after Dani fell asleep."
      },
      {
        "paragraph": "When Freya recalled that he did not come back home the whole night before this, she instinctively felt\ndefensive and repulsed."
      },
      {
        "paragraph": "If Rodney was hiding Sarah, he might have hugged her before."
      },
      {
        "paragraph": "Although Freya was not a clean freak, she still felt disgusted."
      },
      {
        "paragraph": "“I’m tired. I don’t want to… ” Freya pushed Rodney away."
      },
      {
        "paragraph": "“Wifey, we haven’t done it in two days…” Rodney hesitated for a moment. “I’m suffering.”"
      },
      {
        "paragraph": "“Settle it yourself. Didn’t you live like that for more than 3o years before getting together with me?”\nFreya turned around so that her back was facing Rodney."
      }
    ]
  },
  {
    "title": "Chapter 1917 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rodney’s expression was filled with frustration. How could the past compare to the present?"
      },
      {
        "paragraph": "It was different for men once they had s*x. The sensation of it was unforgettable."
      },
      {
        "paragraph": "However, Rodney could see that Freya really did not want to do it. Maybe it was because he had been\nreturning home too late in the past few nights."
      },
      {
        "paragraph": "He did not want to do that either, but Sarah was down with a cold and her leg was injured. He was\nworried, so he would go to visit her after he got off work."
      },
      {
        "paragraph": "After that, when he saw Sarah having her meal all alone, Rodney would think she was pitiful."
      },
      {
        "paragraph": "Therefore, he would have his meal there before he returned home."
      },
      {
        "paragraph": "Forget it. He would not go over for the time being. He would accompany Freya more."
      },
      {
        "paragraph": "Since then, Rodney returned home to be with Freya and their child every day after he got off work to\nmake Freya happy."
      },
      {
        "paragraph": "Sometimes when Freya monitored his whereabouts, she would suspect whether she had been\noverthinking it."
      },
      {
        "paragraph": "After all, Rodney would either be at home or the company. Sometimes, he would have a meal with his\nbusiness partners. His schedule was very organized."
      },
      {
        "paragraph": "On Sunday, the wedding planner came over to consult Freya and Rodney regarding the plans for the\nwedding venue."
      },
      {
        "paragraph": "The next day, the news that they were about to hold a wedding was trending and went viral."
      },
      {
        "paragraph": "[They’re finally having a wedding. Congratulations.]"
      },
      {
        "paragraph": "[It seems that the Snow family is going to rent a private island to hold the wedding. That’s so enviable.]"
      },
      {
        "paragraph": "[Right? I heard that Courtney Green designed the wedding dress. She’s an internationally renowned\nwedding dress designer. Her designs are worth tens of millions of dollars each.]"
      },
      {
        "paragraph": "[Tens of millions is nothing. I heard that Young Master Snow even won a bid for a pink diamond worth\n300 million dollars. He plans to put it on the bride’s finger on the day of the wedding.]"
      },
      {
        "paragraph": "[Young Master Snow is such a good man. He’s handsome and rich. That Sarah didn’t treasure him in\nthe past.]"
      },
      {
        "paragraph": "[That’s right. Freya is so fortunate. Maybe she has a high EQ. She managed to turn a bad situation\naround into a good one.]"
      },
      {
        "paragraph": "The netizens were all discussing that matter. The spotlight was on Freya, and everyone in the country\nwas envious of her."
      },
      {
        "paragraph": "Freya, the person in the spotlight, was sitting in a cinema and having a date with Rodney."
      },
      {
        "paragraph": "She only knew that she was trending after glancing at her phone."
      },
      {
        "paragraph": "She saw that everyone was envious of her. Actually, she felt pretty nervous."
      },
      {
        "paragraph": "The fact that she and Rodney were having a wedding could not be hidden. However, she did not think it\nwould spread that wide. If the wedding ended up getting canceled, it would be utterly embarrassing."
      },
      {
        "paragraph": "“Wifey, do you still want some popcorn? I’m about to finish it if you don’t take any.” Rodney handed the\nbucket of popcorn to Freya."
      },
      {
        "paragraph": "Freya glanced at the bucket. Rodney had almost finished up the popcorn."
      },
      {
        "paragraph": "She was speechless. This man liked to eat sweet stuff too much."
      },
      {
        "paragraph": "“I’m not eating. You can have it. I’m on a diet.” Freya waved her hand. Although she wanted to eat the\npopcorn, she still wished to lose ten more pounds."
      },
      {
        "paragraph": "“You don’t have to lose weight. You’re already beautiful.” Rodney quickly flattered her."
      },
      {
        "paragraph": "“No, I’m not as pretty as you, ” Freya said coldly."
      },
      {
        "paragraph": "Rodney was rendered speechless."
      },
      {
        "paragraph": "Just as he was about to speak, his phone rang. It was the housekeeper he had hired for Sarah."
      },
      {
        "paragraph": "A gleam flashed across his eyes. “This place is too noisy. I’ll go out to pick up the call.”"
      },
      {
        "paragraph": "Rodney hurriedly walked out. After the call was connected, the nanny’s lowered voice could be heard.\n“Young Master Snow, do you want to… come over tonight? Miss Neeson drank a lot of wine."
      },
      {
        "paragraph": "She’s drunk.”"
      },
      {
        "paragraph": "Rodney’s expression darkened. “Sarah’s leg injury hasn’t recovered yet. How could she have wine?"
      },
      {
        "paragraph": "Where did the wine come from? Why didn’t you stop her?”"
      },
      {
        "paragraph": "“The wine was delivered to the doorstep. I wanted to stop her, but I saw that she was in a bad mood. I\nthink she even cried in her room this evening. She didn’t have much food during dinner either. She told\nme not to tell you, but I think she’s quite drunk right now…”"
      }
    ]
  },
  {
    "title": "Chapter 1918 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Try to persuade her. I’ll come over later…”"
      },
      {
        "paragraph": "Just as he finished speaking, he heard the housekeeper’s voice. “Miss Neeson, don’t move… Ah, let’s\nget up… Young Master Snow, I can’t talk to you right now. She’s drunk and she fell.”"
      },
      {
        "paragraph": "The call ended with a beep. Rodney became anxious."
      },
      {
        "paragraph": "However, the movie still had an hour remaining."
      },
      {
        "paragraph": "He looked at the time and went downstairs immediately."
      },
      {
        "paragraph": "In the cinema, a phone buzzed with a notification."
      },
      {
        "paragraph": "Freya lowered her head and took a look. Rodney had sent her a Whatsapp message. [Freya,\nsomething happened in a company that’s under my name. I’m going over first, so I won’t be watching\nthe movie with you. I’ve already informed the driver to pick you up. You can contact the driver after\nyou’re done watching the movie.]"
      },
      {
        "paragraph": "After remaining silent for a long time, Freya could only process the information after gazing at the\nmessage again."
      },
      {
        "paragraph": "She had been abandoned halfway through the movie."
      },
      {
        "paragraph": "What urgent company matters had occurred that made him be in such a hurry?"
      },
      {
        "paragraph": "Freya turned on the tracking device on her phone. She saw that Rodney’s location was moving quickly.\nIt seemed that he was really in a rush."
      },
      {
        "paragraph": "Half an hour later, Freya confirmed that Rodney was not going to the company. Instead, he was\nheading to an unfamiliar place. It was a property that was developed a few years ago."
      },
      {
        "paragraph": "After the movie ended, she got in the driver’s car. She saw that Rodney’s location was stationary at that\nplace."
      },
      {
        "paragraph": "Upon checking it on her phone, that place seemed to be a high-class condominium."
      },
      {
        "paragraph": "Technology had become so advanced that she could simply search it up on her phone without going to\nthe exact location."
      },
      {
        "paragraph": "”When Rodney got to the condominium, Sarah was already lying on the bed. Her face was flushed red\nfrom being drunk. The housekeeper was afraid that he would blame her, so she quickly explained, “I\njust managed to help her onto the bed. She kept saying that she still wants to drink.”"
      },
      {
        "paragraph": "“Why did she suddenly want to drink wine?” Rodney asked puzzledly."
      },
      {
        "paragraph": "The housekeeper thought about it for a moment. “ She was already quite unhappy as she was staying\nhome every day. She was playing on her phone this evening. Then, she went back to her room. After\nthat, I accidentally saw her crying…”"
      },
      {
        "paragraph": "Phone?"
      },
      {
        "paragraph": "Rodney frowned. Could Sarah have seen the trending news that he and Freya were about to get\nmarried?"
      },
      {
        "paragraph": "He had a feeling of helplessness in his heart. He rubbed his brows and said, “You can go out first. ”"
      },
      {
        "paragraph": "After the housekeeper left, Rodney walked to the bedside."
      },
      {
        "paragraph": "Sarah looked at him with reddened eyes. Her gaze seemed unfocused. “Give me some wine. Let me\nbe drunk. Living is just too tiring.”"
      },
      {
        "paragraph": "“ Sarah, don’ t be like this.” Rodney did not know how to console her."
      },
      {
        "paragraph": "“Rodney, is that you?” Sarah cocked her head to the side. “Am I dreaming? Haha. How can you\npossibly be here? You should be accompanying your wife and child.”"
      },
      {
        "paragraph": "Tears flowed as she spoke, “Actually, I’m really envious. I’m jealous of Freya and Catherine. Which part\nof me isn’t good enough compared to them? I just want to have simple happiness too. When I was\nyoung, my mom passed away. My dad married my stepmother soon after that. I know that she liked\nCharity more, so… I tried hard to be obedient and lived cautiously. I clearly knew that my brother wasn’t\nreliable. I clearly understood that… He did many unforgivable things. But I had no choice. I only have\nmy brother. I don’t have anybody else…"
      },
      {
        "paragraph": "“Uhhh… I just want a man who loves me. I want a family. Why is it so hard…"
      },
      {
        "paragraph": "“I’m like a mouse that can only hide in the corner forever. I feel disgusted with myself.”"
      },
      {
        "paragraph": "Sarah slapped herself hard. Rodney’s throat felt bitter."
      },
      {
        "paragraph": "“Sarah, don’t be like this. ” He quickly pulled her hand. “Listen to me. I’ll protect you.”"
      },
      {
        "paragraph": "“ I’m so, so tired. Sometimes,  I feel like it’s better to die rather than continue living.” Sarah flung herself\ninto Rodney’s embrace and started wailing."
      },
      {
        "paragraph": "Facing Sarah, who was crying, Rodney could not push her away at all."
      }
    ]
  },
  {
    "title": "Chapter 1919 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "That was Rodney’s first time seeing Sarah this way. Maybe this was Sarah’s true self."
      },
      {
        "paragraph": "Late into the night."
      },
      {
        "paragraph": "When Freya heard the sound of the door opening downstairs, she glanced  at her phone.  It was\nalready 2:00 a.m."
      },
      {
        "paragraph": "Rodney had stayed in that condominium until 2:00 a.m."
      },
      {
        "paragraph": "Ha."
      },
      {
        "paragraph": "Freya closed her eyes and pretended to be asleep."
      },
      {
        "paragraph": "20 minutes later, Rodney lay down beside her lightly."
      },
      {
        "paragraph": "Freya noticed that Rodney was having trouble falling asleep. He kept tossing and turning."
      },
      {
        "paragraph": "Although he did it lightly, she still noticed it because she could not sleep too."
      },
      {
        "paragraph": "She thought about many things in her head."
      },
      {
        "paragraph": "The night had never felt so long before."
      },
      {
        "paragraph": "In the morning, she acted as if she was waking up from her sleep."
      },
      {
        "paragraph": "Rodney got up too. His eyes were red. “Wifey, I’m sorry. I had some urgent matters yesterday. Was the\nmovie… nice?”"
      },
      {
        "paragraph": "“Have you taken care of the problem?” Freya asked calmly, “What happened to the company?”"
      },
      {
        "paragraph": "“Oh, a fire broke out at a small company that I invested in previously.” Rodney had already thought of\nan excuse."
      },
      {
        "paragraph": "“Really? Where is it?”"
      },
      {
        "paragraph": "“ In the north of the city.” Rodney was afraid that she would keep asking. He quickly yawned. “I’m going\nto sleep a little more.”"
      },
      {
        "paragraph": "He did not know how complicated and full of disappointment Freya’s gaze was when he turned to his\nside."
      },
      {
        "paragraph": "She thought she was already numb. However, she still found it ridiculous every time Rodney lied."
      },
      {
        "paragraph": "He could even lie about fires now?"
      },
      {
        "paragraph": "Freya had the urge to drag him off the bed and expose his lies to make him feel humiliated and\nembarrassed. Then, she would shed all pretenses and divorce him."
      },
      {
        "paragraph": "However, she could not do that. They still had a child together."
      },
      {
        "paragraph": "Freya could not alarm him. What if he let Sarah escape beforehand?"
      },
      {
        "paragraph": "As Freya changed her clothes, she looked at herself in the mirror. She recalled how reckless she used\nto be in the past. She did everything solely based on her passion."
      },
      {
        "paragraph": "That was because her parents and her brother had pampered her ever since she was young."
      },
      {
        "paragraph": "After leaving her family and entering society, she had experienced harsh lessons one after another."
      },
      {
        "paragraph": "She did not understand what she was lacking."
      },
      {
        "paragraph": "Maybe someone like her should not have put too much importance on relationships."
      },
      {
        "paragraph": "While Rodney was still sleeping at home, Freya drove the car and went out."
      },
      {
        "paragraph": "On the way, she gave Catherine a call. “Go to a place with me. I’ll pick you up in half an hour.”"
      },
      {
        "paragraph": "When the car arrived at the Hill family’s manor, Catherine quickly got in. She was stunned when she\nsaw Freya’s bloodshot eyes. “Did you not get any sleep last night? You want me to go somewhere with\nyou. Could it be Rodney— ”"
      },
      {
        "paragraph": "“He stayed at  this location until 2:00 a.m. last night. I’ve already searched it up. It’s a condominium.”\nFreya tossed her phone to Catherine. “He told me that a fire occurred at one of the companies he\ninvested in. He immediately left me alone in the cinema and went over. I’m not too sure whether Sarah\nis hiding there or not, but we can go over to have a look.”"
      },
      {
        "paragraph": "“Okay. Let’s go and have a look. If it’s not Sarah, at least we wouldn’t have caused unnecessary\nalarm.” Catherine glanced at Freya worriedly as she spoke, “ Look at the state you’re in. Let me drive. \nYou can take a rest.”"
      },
      {
        "paragraph": "“I won’t be able to fall asleep even if I rest. I’ll think about nonsensical things instead.” Freya started the\ncar."
      },
      {
        "paragraph": "Upon hearing that, Catherine could not say anything else. It required about an hour to get to that place."
      }
    ]
  },
  {
    "title": "Chapter 1920 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Within that hour, Catherine had already contacted Elle of Liona. Elle investigated the matter quickly.“\nThe condominium was built by Glory Properties three years ago. There are three shareholders in Glory\nProperties, Frankie Hayes, Zac Lawrence, and Rory Wooten.”"
      },
      {
        "paragraph": "“Rory Wooten?” Freya frowned. “I think I’ve heard of that name before. Oh, some time back… Rodney\nsaid he was going to a meal to celebrate his friend’s birthday. That friend’s name is Rory Wooten.”"
      },
      {
        "paragraph": "After she spoke, her heart felt even colder. “Could Rodney be using his friend’s house as a cover to\nhide a woman?”"
      },
      {
        "paragraph": "Catherine did not reply to Freya. She asked Elle, “"
      },
      {
        "paragraph": "When you were searching for Sarah before, have you checked this area?”"
      },
      {
        "paragraph": "Elle hesitated for a moment and said, “That’s an expensive neighborhood. Many of the owners are\nCanberra’s noblemen who are using the houses as a n investment. When we were conducting our\ninvestigation, the management of the neighborhood said the residents were complaining. Afterward,\nSnowden’s members came and said they were familiar with that area. Therefore, we handed that area\nto Snowden’s men. They said there were no signs of Sarah there.”"
      },
      {
        "paragraph": "She added after pausing for a moment, “Moreover, we didn’t think Sarah would be staying there back\nthen. After all, a social security card is required for registration. Therefore, we prioritized older houses\nmore.”"
      },
      {
        "paragraph": "Catherine understood."
      },
      {
        "paragraph": "She had asked Shaun about it before. She had her suspicions when she heard that Rodney had\nbecome the person in charge of Snowden."
      },
      {
        "paragraph": "She did not expect that her suspicions were about to become real."
      },
      {
        "paragraph": "“Elle, bring some people over and wait secretly near the condominium. Don’t tell Shaun about this for\nnow, and don’t let Snowden’s people find out too. Also, investigate which units belong to Rory Wooten.”"
      },
      {
        "paragraph": "After Catherine hung up the call, Freya’s face had gotten paler. “Is Sarah really inside?”"
      },
      {
        "paragraph": "“There’s a 5o percent chance.” Catherine nodded. “ Your tracker only detected that Rodney was in this\ncondominium last night. It couldn’t detect the exact unit number. We’ll have to investigate it.”"
      },
      {
        "paragraph": "Freya nodded. She was still confused and at a loss."
      },
      {
        "paragraph": "She could not understand why Rodney was hiding Sarah. Did he love her that much?"
      },
      {
        "paragraph": "When Catherine and Freya arrived below the condominium, Elle had found out the units under Rory’s\nname. However, the entire l9th and 20th floors were his."
      },
      {
        "paragraph": "Luckily, Liona had hackers. They quickly hacked into the management’s system and checked the\ninformation of the residents who lived on those two floors."
      },
      {
        "paragraph": "“Miss Jones, the hackers have found out Rory’s utility bills and rental information. After filtering, the\nearliest time when some units were rented out was three years ago, while the latest was two months\nago. Only three units under his name are empty. However, there’s a unit numbered 1go8 that isn’t\nrented out, yet water and electricity are being used every day.”"
      },
      {
        "paragraph": "“When did that situation start?” “Half a month ago.”"
      },
      {
        "paragraph": "“Okay. I got it.”"
      },
      {
        "paragraph": "Catherine nodded."
      },
      {
        "paragraph": "The call was on speakerphone, and Freya was already deep in thought."
      },
      {
        "paragraph": "After a moment, she took out her phone and checked something. “It was two days before Rodney went\non a business trip to Cairns. He even lied to me when he came back from Cairns. I didn’t know where\nhe went for that whole evening and night. His clothes were different when he returned too.”"
      },
      {
        "paragraph": "Freya could more or less guess it. It turned out that Rodney was at this place."
      },
      {
        "paragraph": "Anger flashed across Catherine’s eyes too. What did Rodney take Freya for?"
      },
      {
        "paragraph": "“Do we go up like this?”"
      },
      {
        "paragraph": "Freya had come around and calmed down. “ Rodney’s men may be hiding near the condominium. If we\nalarm them, will he arrange for Sarah to leave?”"
      }
    ]
  },
  {
    "title": "Chapter 1921 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“I’ll have Elle block all exits from the condominium. We’ll sneak in.”"
      },
      {
        "paragraph": "Catherine thought of an idea. “Let’s find a place to change our clothes.”"
      },
      {
        "paragraph": "Half an hour later, Freya and Catherine had changed into a set of black sportswear and sports shoes.\nThey even wore baseball caps with wigs underneath them. They looked like two 18 -year- old students.\nHowever, they were not girls but two handsome boys."
      },
      {
        "paragraph": "They followed a husband and wife who were staying in the condominium and went inside."
      },
      {
        "paragraph": "After going in, Catherine immediately shoved a stack of cash into the woman’s hands. “Aunty, thank\nyou so much. This is a small token of appreciation.”"
      },
      {
        "paragraph": "“No need to thank me. I despise sc*mmy men who keep mistresses behind their wives’ back the most,\n” the middle-aged woman said angrily, “You guys must catch that homewrecker. I’m not taking the\nmoney.”"
      },
      {
        "paragraph": "“Mm, I’ll divorce that man after I catch that mistress. I don’t want to put up with this anymore, ” Freya\nsaid as her eyes reddened."
      },
      {
        "paragraph": "Those words were her true feelings. The middle- aged woman sympathized with her a lot. “Ah, that\nman is having an affair despite having such a beautiful wife. Is he blind?”"
      },
      {
        "paragraph": "The middle-aged man said, “You really don’t have to give us money. If it were before, it would’ve been\nquite easy for you guys to enter. I don’t really know what’s been going on recently. The management\nsaid there was a case of burglary in the condominium, so they became particularly strict on checking\noutsiders.”"
      },
      {
        "paragraph": "“Recently?” Catherine was stunned. “About half a month ago.”"
      },
      {
        "paragraph": "After bidding goodbye to the middle-aged couple,"
      },
      {
        "paragraph": "Freya gritted her teeth and said, “Rodney really went to such great lengths just to protect Sarah.\nLuckily, we disguised ourselves before coming in. If not, there really might be Rodney’s people on\nwatch nearby.”"
      },
      {
        "paragraph": "“No matter whether Rodney has people watching or not, Sarah shouldn’t even think about escaping\ntonight.”"
      },
      {
        "paragraph": "Catherine was careful. She and Freya did not take the elevator straight to the l9th floor. Instead, they\ngot off the 15th floor and crept up by foot."
      },
      {
        "paragraph": "In a condominium with more than 30 floors, the higher the floor, the fewer the people there would be in\nthe fire escape stairway."
      },
      {
        "paragraph": "However, when Catherine and Freya reached the 18th floor, they heard the sounds of a phone coming\nfrom the floor above. It seemed that someone was playing games."
      },
      {
        "paragraph": "Then, there were voices of people talking."
      },
      {
        "paragraph": "“Ah, how long more do you think we have to stay in this sh*tty place? We have to be on shifts to guard\nthis place every day. I’m so annoyed.”"
      },
      {
        "paragraph": "“There’s no helping it. It was arranged by the higher-ups.”"
      },
      {
        "paragraph": "“But I saw Young Master Snow coming here last night. He only left after midnight. Who’s the woman\nhe’s hiding inside?”"
      },
      {
        "paragraph": "“Do you have a death wish? Keep your voice down. This isn’t a matter that you can simply talk about.\nSomeone might hear you.”"
      },
      {
        "paragraph": "The people on the floor above lowered their voices even more, but Catherine and Freya could still hear\nparts of the conversation."
      },
      {
        "paragraph": "“No, I’m just curious. I heard that Young Master Snow and Young Madam Snow are preparing to hold a\nwedding. I saw it on the trending searches yesterday. What Young Master Snow is doing now isn’t very\nappropriate.”"
      },
      {
        "paragraph": "“Please, just shut your mouth. This is the rich people’s world. How many men will be content with just\nmarrying one wife? It’s just that some  people are good at hiding it and don’t  get exposed. You have to\nunderstand that with the Snow family’s strong background, it’s our honor  to be able  to work for them.”"
      },
      {
        "paragraph": "“But Young Madam Snow is the prime minister’s goddaughter, after all.” “Is a goddaughter a biological\ndaughter? Besides, everyone knows the true reason why Young Madam Snow was taken in as a\ngoddaughter. When Young Master Snow was chased out of the Snow family, the Snow family seemed\nindifferent, but in the end, they just wanted to teach him a lesson. Wasn’t the big project on alternative\nenergy handed to Young Master Snow and Second Young Master Snow as soon as he apologized and\nreturned?”"
      }
    ]
  },
  {
    "title": "Chapter 1922 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Who doesn’t know that industry is a crucial part of Australia’s future development? Although it was\nsaid that Eldest Young Lady Snow was busy and didn’t have time to manage it, in the end, it’s still\nbecause Eldest Young Lady Snow is a woman and not a son.”"
      },
      {
        "paragraph": "“You’re right. Young Master Snow used to be in charge of Snowden. After he was chased out, Second\nYoung Master Snow took charge of Snowden. Ever since Young Master Snow  admitted  his mistakes\nand returned, half of Snowden was handed to him while the other half remained with Second Young\nMaster Snow. Frankly speaking, Eldest Young Lady Snow was never the future of Snow Corporation."
      },
      {
        "paragraph": "But actually, Eldest Young Lady Snow is the person who contributed the most to the  family.  If  it\nweren’t for her…”"
      },
      {
        "paragraph": "“I guess having Eldest Young Lady Snow be the president was to acknowledge her contributions to the\nSnow family. However, it’ll be hard if she wants to take another step forward. In the future, she can only\njoin the board of directors while those profitable projects will probably fall into the hands of Young\nMaster Snow and Second Young Master Snow. We should just do our job properly under Young Master\nSnow and turn a blind eye to some things.”"
      },
      {
        "paragraph": "Freya’s head was about to explode."
      },
      {
        "paragraph": "She only intended to listen for a bit, but she did not expect that she would be able to hear so much\ninside information about the Snow family."
      },
      {
        "paragraph": "It looked like she had no status at all among the subordinates of the Snow family. The fact that she\nbecame the prime minister’s goddaughter was all thanks to Rodney."
      },
      {
        "paragraph": "It turned out  that although  the Snow family had said that they were ashamed of Rodney, they were still\ntrying hard to nurture that son of  theirs through their actions."
      },
      {
        "paragraph": "Jessica was not even involved in Snowden despite contributing so much to the Snow family."
      },
      {
        "paragraph": "Snowden was one of the Snow family’s real, strong forces."
      },
      {
        "paragraph": "It was just like how important Liona was to Shaun."
      },
      {
        "paragraph": "In the past, Freya hated Jessica quite a lot. However, ever since hearing Jessica’s story from Ryan,\nshe felt that Jessica had sacrificed a lot for the Snow family."
      },
      {
        "paragraph": "Even Prime Minister Snow was able to assume the position smoothly because Jessica had been\nremoving all obstacles at the frontlines."
      },
      {
        "paragraph": "Freya used to think that the Snow family was wonderful and everyone treated her well."
      },
      {
        "paragraph": "However, she strangely felt chills all over at that moment."
      },
      {
        "paragraph": "As a family that was at the top of Australia, no one in that family could be pure and gentle, right?"
      },
      {
        "paragraph": "“Above.”"
      },
      {
        "paragraph": "Catherine pointed upward and gestured with her hands. She mouthed with her lips, “Can we take those\ntwo people out?”"
      },
      {
        "paragraph": "Freya gazed at Catherine cluelessly."
      },
      {
        "paragraph": "“We can now confirm that Sarah is definitely upstairs. Even if we bring people up with us, it’ll surely\nalarm Rodney. Why don’t we just take them out right now? Later, Elle’s people will barge in."
      },
      {
        "paragraph": "We’ll force the door open together and seize Sarah immediately, ” Catherine said to Freya in a low\nvoice."
      },
      {
        "paragraph": "Freya had lost her focus in confusion. After a moment, she nodded."
      },
      {
        "paragraph": "“Let’s head down a few floors first. We can’t let them know that we’ve been eavesdropping. We’ll come\nup again later, take them by surprise, and knock them out.”"
      },
      {
        "paragraph": "Catherine threw a bottle of pepper spray to Freya after she finished speaking."
      },
      {
        "paragraph": "Why did Catherine bring so many random things with her?"
      },
      {
        "paragraph": "Both of them went a few floors down, then walked up again with their hands on each other’s shoulders."
      },
      {
        "paragraph": "The two men on the l9th floor looked down when they heard the sound of footsteps coming from below.\nIt turned out to be two young boys."
      },
      {
        "paragraph": "“Ah, it’s so tiring. Why don’t we take the elevator?”"
      },
      {
        "paragraph": "“No way. Don’t you want to strengthen your stamina? Let’s just walk. We’ll succeed as long as we\npersevere.”"
      },
      {
        "paragraph": "Catherine and Freya acted until they reached the l9th floor."
      },
      {
        "paragraph": "Both of them had makeup on. Even so, when the men glanced at them, they thought that they looked\nfamiliar."
      },
      {
        "paragraph": "However, before the men could react, their eyes were attacked with pepper spray. The stinging was so\nbad that they could not open their eyes. It just so happened that they were standing on the stairs as\nwell"
      }
    ]
  },
  {
    "title": "Chapter 1923 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine kicked the two men, and they rolled down the stairs."
      },
      {
        "paragraph": "Sure enough, the two men were members of Snowden. They swiftly regained their strength even\nthough their eyes hurt so much that they could hardly open."
      },
      {
        "paragraph": "Nevertheless, Catherine and Freya were no ordinary women. Recently, Catherine had been practicing\nquite a lot with Shaun. Shortly after, she knocked the two men conscious."
      },
      {
        "paragraph": "Catherine and Freya headed to Unit 1go8 under nobody’s watchful eye."
      },
      {
        "paragraph": "They knocked on the door for a while before a lady’s voice sounded from inside. “Who are you?”"
      },
      {
        "paragraph": "“Madam, we’re here to provide kitchen hood cleaning services.” Catherine deliberately raised the bottle\nin front of her."
      },
      {
        "paragraph": "“I don’t need your services. Please leave.”"
      },
      {
        "paragraph": "“Madam, our services are free of charge. Let us clean for you.”"
      },
      {
        "paragraph": "After that, a hush descended over the apartment. Freya said, “She’s quite cautious.”"
      },
      {
        "paragraph": "Catherine sighed. Since she could not enter the apartment, she had no choice but to ask Elle to bring\nsome people in."
      },
      {
        "paragraph": "Ten minutes later, Elle gave her a call instead of coming over. “Miss Jones, some Liona members are\nblocking us. They’ve probably informed Rodney about it. I’ve just contacted Young Master Hill and he’s\non his way here.”"
      },
      {
        "paragraph": "Catherine flew into a fury. She did not expect Rodney to be so protective of Sarah and even band\ntogether with Liona members."
      },
      {
        "paragraph": "Freya stood in the corridor, feeling like an idiot."
      },
      {
        "paragraph": "All of a sudden, she dashed to the door and knocked violently on it. “ Sarah Neeson, come out! I know\nyou’re hiding inside. Even if you can fly, don’t expect Rodney to save you.”"
      },
      {
        "paragraph": "No matter how she kept knocking on the door, the door remained closed."
      },
      {
        "paragraph": "Freya’s phone rang, and it was a call from Rodney."
      },
      {
        "paragraph": "Upon answering the call, she snorted. “What’s the matter? Are you worried that something will happen\nto that hypocrite?”"
      },
      {
        "paragraph": "Rodney was indeed really worried. When he was sleeping at home earlier, a Liona member phoned\nhim, saying that Elle had brought some people to the apartment. Sarah also called to tell him that Freya\nwas scolding her at the door."
      },
      {
        "paragraph": "He could not figure out why Freya would  go there."
      },
      {
        "paragraph": "He was so worried about Sarah that he could not even be bothered  to explain  the situation  to Freya."
      },
      {
        "paragraph": "“Freya, there’s nothing going on between Sarah and me.”"
      },
      {
        "paragraph": "“Nothing? Do you take me for a retard?” Freya wished she could chop that b*stard with a knife. “ You\nalways accompany her until late at night. You lied to me a few times to have dinner with her. You even\nleft me alone in the cinema to look for her yesterday. Rodney, do you think I’m an idiot? It’s fun\ndeceiving me, huh?"
      },
      {
        "paragraph": "“Let me tell you that I’m not an idiot. You’re an idiot. She cuckolded you and treated you as backup, yet\nyou continue to cling to her so obediently. Have you no shame? Is there no other woman in this world?\nWhy are you so despicable? You might as well be a dog. It’s humiliating for Dani to have you as her\ndad. It’s also humiliating for me to have slept with you. I wish I could sanitize my entire body. I’m afraid\nI’ll get infected.”"
      },
      {
        "paragraph": "She was panting right after bombarding him with criticisms."
      },
      {
        "paragraph": "Rodney was stunned."
      },
      {
        "paragraph": "This woman’s words were so rude and vicious."
      },
      {
        "paragraph": "It finally dawned on him that her criticisms back then were considered."
      },
      {
        "paragraph": "This was brutal."
      },
      {
        "paragraph": "Every word pierced his heart."
      },
      {
        "paragraph": "“Freya, don’t get me wrong. There’s a reason why I’m hiding Sarah, ” Rodney said earnestly, “ She’s\nnot as evil as you made her out to be. She had her reasons for doing all those things back then.”"
      }
    ]
  },
  {
    "title": "Chapter 1924 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Reasons?”"
      },
      {
        "paragraph": "Freya was so exasperated that tears began to build up in the corners of her eyes."
      },
      {
        "paragraph": "Oh, God. Why on earth was she touched by his behavior back then?"
      },
      {
        "paragraph": "“Are you f*cking out of your mind? You just believe in everything Sarah says?”"
      },
      {
        "paragraph": "Being criticized over and over again, Rodney was offended. “In your eyes, am I always so silly? Do you\nthink I can’t tell right from wrong? Just wait there. Don’t hurt her. I’ll come right away.”"
      },
      {
        "paragraph": "“Hah. Come as fast as possible because not only will  I hurt her but I’ll also kill her.”"
      },
      {
        "paragraph": "Freya lost her temper and nearly flung her phone."
      },
      {
        "paragraph": "Catherine did not hear what Rodney said. However, from Freya’s expression, she could guess what\nnasty remarks he had made to provoke Freya."
      },
      {
        "paragraph": "When Rodney and Freya previously argued because of Sarah, it was not a big deal since they had no\nfeelings for each other."
      },
      {
        "paragraph": "Nevertheless, things were different now. They had slept together, and moreover, Rodney had been\ntreating Freya very well."
      },
      {
        "paragraph": "No one would be able to accept such a huge difference in treatment."
      },
      {
        "paragraph": "What was worse, that woman was Sarah."
      },
      {
        "paragraph": "Freya was almost out of her senses. She found a fire extinguisher and wanted to slam it aggressively\non the door."
      },
      {
        "paragraph": "Catherine immediately stopped her. “Don’t act impulsively. That’s an extinguisher. If you destroy it, it\nmight explode. It’s not worth doing this because of Rodney.”"
      },
      {
        "paragraph": "“Will it explode?” Freya asked tearfully."
      },
      {
        "paragraph": "“I’m not sure.” Catherine was speechless. “Just hold on. Shaun is on his way here.”"
      },
      {
        "paragraph": "Upon being persuaded by Catherine, Freya abandoned the idea and leaned against the wall."
      },
      {
        "paragraph": "At this point, she was imagining how to kill Sarah, that b*tch, and put Rodney through a living hell."
      },
      {
        "paragraph": "After struggling for over ten minutes, she slowly regained her composure."
      },
      {
        "paragraph": "It was not worth getting into deep waters because of the two b*stards."
      },
      {
        "paragraph": "At this moment, the door suddenly opened."
      },
      {
        "paragraph": "Sarah appeared with crutches after not seeing Catherine and Freya for a long time. She was dressed\nin a costly silk pajama shirt. On this cold day, cozy heat could be felt from inside."
      },
      {
        "paragraph": "A middle-aged woman was cautiously holding Sarah beside her."
      },
      {
        "paragraph": "Sarah exuded the aura of a rich young lady."
      },
      {
        "paragraph": "The minute she caught sight of Freya, she said miserably, “ I didn’t expect you guys to come here\nlooking for me. I’m left with nothing now. Why can’t you guys let me go?”"
      },
      {
        "paragraph": "Catherine frowned grimly."
      },
      {
        "paragraph": "At the sight of Sarah’s annoying hypocritical look, Freya could not help but instantly slap her."
      },
      {
        "paragraph": "Sarah fell to the floor. Her face immediately swelled up, and her mouth started bleeding. She gnashed\nher teeth and covered her legs. It seemed that she was in excruciating pain."
      }
    ]
  },
  {
    "title": "Chapter 1925 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "The caretaker beside Sarah was shell—shocked. She quickly extended her hands to hold Sarah. “Oh\nno! Miss Neeson, are you alright?”"
      },
      {
        "paragraph": "“It hurts so much.” Sarah’s face contorted."
      },
      {
        "paragraph": "Thinking that Sarah was putting on an act, Freya pointed at her and criticized, “Go on acting. You’ve\nalways enjoyed acting, right? How shameless of you to ask me why I’m not letting you go when you’ve\ndone so many crazy things. Although Wesley didn’t expose you, don’t treat us as fools.”"
      },
      {
        "paragraph": "“Sarah, it’s high time we settled our scores, ” Catherine said impassively, “Do you want to leave with us\nor wait for others to drag you away later?”"
      },
      {
        "paragraph": "Sarah clenched her teeth, her tears streaming down pitifully. She roared with a hoarse voice, “I wasn’t\ninvolved with Wesley’s affairs. I’m not even close to him. Please let me go. I guarantee that I won’t"
      },
      {
        "paragraph": "make a move against you two. Freya, I promise that I’ll stay away from Rodney. I won’t snatch him from\nyou. Please.”"
      },
      {
        "paragraph": "She got up arduously before falling to her knees.“"
      },
      {
        "paragraph": "I’ve lost everything. All I want to do is live the rest of my life.”"
      },
      {
        "paragraph": "Freya smirked. “Stop pretending— ”"
      },
      {
        "paragraph": "“Sarah, what are you doing? Quickly get up.” Rodney’s tense voice sounded from behind."
      },
      {
        "paragraph": "Sarah’s face stiffened. Before she was brought to her senses, Rodney promptly lifted her from the floor."
      },
      {
        "paragraph": "Sarah instantly leaned on his chest with a helpless expression. “Rodney, let go of me.”"
      },
      {
        "paragraph": "Rodney lowered his head, only to see her teary and swollen face. His eyes flashed with rage. “Your\nface_”"
      },
      {
        "paragraph": "“I was the one who slapped her,” Freya said loudly. Her eyes were fixed on her husband, who was\nholding the woman she hated the most."
      },
      {
        "paragraph": "She had an overwhelming urge to kill this shameless pair."
      },
      {
        "paragraph": "Rodney looked at Freya with annoyance. “Why do you have such a fiery temper? As I said, she had\nher reasons. Some things aren’t as simple as you think. She’s also a victim in the incident related to\nWesley.”"
      },
      {
        "paragraph": "“Victim?” Freya’s eyes were full of sarcasm. “ Rodney, I’ll cut to the chase. Are you insistent on\nprotecting her?”"
      },
      {
        "paragraph": "“Freya, I can’t let you hurt her, ” Rodney said without hesitation, “I owe her a lot. As for you, you’re\nalready the prime minister’s goddaughter. Moreover, my family is very fond of you. You can get\nwhatever you want. The position of Young Madam Snow belongs to you too. Do you know how many\npeople out there admire you? Whereas for Sarah, she has nothing. Don’t assume that there’s\nsomething between us just because I’m saying these things. Both of us are innocent.”"
      },
      {
        "paragraph": "He believed that he had done a good job at conveying his message."
      },
      {
        "paragraph": "Nevertheless, Catherine anxiously grabbed Freya’s shoulder upon hearing it."
      },
      {
        "paragraph": "Apparently, his words almost made Freya go insane."
      },
      {
        "paragraph": "“It turns out that you think I already have so much.” Freya burst into laughter with tears rolling down her\nface. “Do you think I long to be Young Madam Snow? What a lame position. If I hadn’t gotten pregnant\nby accident and your sister hadn’t begged me to marry you, I wouldn’t have married you. You’re\nextremely disgusting, you know that?"
      },
      {
        "paragraph": "I’ve never seen such a disgusting man like you. You don’t deserve my love. What on earth makes you\ndeserve to be loved? You’re just trash.”"
      },
      {
        "paragraph": "She began to insult him senselessly."
      },
      {
        "paragraph": "She could finally understand why many couples had a falling out and ended up as enemies when they\ndivorced."
      },
      {
        "paragraph": "They had done the most intimate thing in bed, yet they began to attack each other with the cruelest\nremarks."
      },
      {
        "paragraph": "Rodney’s expression changed drastically. His eyes were filled with shame and indignation."
      },
      {
        "paragraph": "As much as Sarah wanted  to laugh,  she quickly stood up for Rodney and said, “Freya, you’re going\ntoo far. Rodney is just concerned about you. Why do you have to hurt him by saying such nasty words?\nHe’s your husband, after all.”"
      },
      {
        "paragraph": "“Please. He’s not my husband. I’m going to divorce him. I don’t want to stay with him any longer. ” Of\ncourse, Freya was aware that Sarah was trying to tear her and Rodney apart."
      }
    ]
  },
  {
    "title": "Chapter 1926 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya did that because she could no longer put up with Sarah. She did not feel like playing along with\nher."
      },
      {
        "paragraph": "Another reason was simply that she did not want to be with Rodney anymore."
      },
      {
        "paragraph": "From the moment Rodney stood here and started criticizing her, she had completely given up on him."
      },
      {
        "paragraph": "“ I’ve told you everything. Why don’t you believe that there’s nothing going on between us?” Rodney\nthundered in fury. “I’m hiding her here not without reason.”"
      },
      {
        "paragraph": "“So can you tell us what the reason is?”"
      },
      {
        "paragraph": "In the corridor, Shaun and Chester, who were dressed in black suits, walked up to Rodney with grim\nexpressions on their handsome faces."
      },
      {
        "paragraph": "No one would expect these three good buddies to end up in a war of words."
      },
      {
        "paragraph": "Shaun said icily,  “Can you tell me why you’re hiding this matter from us and even your wife? You know\nthat we’ve been looking for her everywhere."
      },
      {
        "paragraph": "You told us that you’re willing to get Snowden members to assist me, yet you’re protecting her behind\nour backs. You’re playing hide and seek with us, huh?”"
      },
      {
        "paragraph": "He stretched out the last word to express his exasperation."
      },
      {
        "paragraph": "Chester’s dark eyes contained a hint of disbelief and disappointment. Clearly, he could not figure out\nwhy Rodney was so muddle-headed."
      },
      {
        "paragraph": "In the face of everyone’s doubt, Rodney frowned and gritted his teeth. “There’s no point in explaining to\nyou guys right now. Shaun, give me half a month and you’ll know the answer.”"
      },
      {
        "paragraph": "Sarah said with a low voice, “I’m willing to stay here throughout this period without stepping out. If you\ndon’ t believe me, you can send someone to guard the door.”"
      },
      {
        "paragraph": "After raising his eyebrows, Chester lit a cigarette. “ What’s your plan?”"
      },
      {
        "paragraph": "Rodney said, “Shaun will recover his memory in half a month. Actually, Sarah did all those things in an\nattempt to cure his illness, including when he fell down the stairs before.”"
      },
      {
        "paragraph": "“Hah.” Freya was the first person to let out a laugh. She stared fixedly at Rodney as though he was an\nincurable fool. “Do you really trust her?”"
      },
      {
        "paragraph": "“I do.” Rodney nodded without the slightest hesitation. “ If she were lying, she wouldn’t have allowed us\nto keep watch of her here. Also, if she’s really lying to me, I would be the first person who wouldn’t let\nher off the hook. Anyway, what she said is true. She’s not lying.”"
      },
      {
        "paragraph": "“Rodney, thank you for believing in me,” Sarah said emotionally."
      },
      {
        "paragraph": "Rodney patted her on the shoulder with gentle eyes. The scene made Freya lower her gaze."
      },
      {
        "paragraph": "Shaun, Chester, and Catherine furrowed their brows."
      },
      {
        "paragraph": "“In fact, just half a month is enough time, ” Rodney said, “It’s not a long period.”"
      },
      {
        "paragraph": "“What if I reject?” Shaun asked with a discreet smile."
      },
      {
        "paragraph": "Rodney felt powerless. “Shaun, let me remind you that Wesley never mentioned that Sarah was guilty.\nYou guys just presumed that she was involved in the matter. Even if you want to capture her without"
      },
      {
        "paragraph": "any proof, the police won’t file a case. Although my uncle is fond of you, that doesn’t mean you can\ncapture her unscrupulously.”"
      },
      {
        "paragraph": "“I got it.”"
      },
      {
        "paragraph": "Shaun broke into a smile, yet his eyes were not beaming at all."
      },
      {
        "paragraph": "He put his hand around Catherine’s shoulders. “ Let’s go. With Snowden members here, Sarah won’t\nbe able to escape.”"
      },
      {
        "paragraph": "Catherine was seething with rage. “But…”"
      },
      {
        "paragraph": "Shaun glanced at Freya. “I think Miss Lynch knows what’s going on. At least, the two of you didn’t\ncome for nothing today.”"
      },
      {
        "paragraph": "“Young Master Hill is right.” After letting out a snort, Freya turned around and left without bothering to\nlook at Rodney."
      },
      {
        "paragraph": "Catherine immediately went after her. Shaun then followed suit."
      },
      {
        "paragraph": "Chester blew some smoke out and shot a pensive look at Sarah. “Sarah, I didn’t know you were so\nbrilliant.”"
      },
      {
        "paragraph": "He sneered before striding away."
      },
      {
        "paragraph": "When he turned around, he noticed that Rodney was hugging Sarah."
      }
    ]
  },
  {
    "title": "Chapter 1927 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rodney was hugging another woman in front of his wife."
      },
      {
        "paragraph": "Hah. Chester knew that Rodney had a low EQ but he did not expect him to be so foolish."
      },
      {
        "paragraph": "Unfortunately, Rodney might still be unaware of what he had lost at this point."
      },
      {
        "paragraph": "Catherine held onto Freya until they walked out of the elevator."
      },
      {
        "paragraph": "It took merely a minute to go down."
      },
      {
        "paragraph": "However, Rodney was so stunned that he did not go after Freya."
      },
      {
        "paragraph": "Freya had no idea what she was even hoping for. Perhaps she was hoping that Rodney’s stupidity was\nnot incurable."
      },
      {
        "paragraph": "She was hoping that Rodney was truthful at least when he told her that he loved her."
      },
      {
        "paragraph": "When she reached the lobby, a chilly wind blew past her. After a shudder, she became fully awake."
      },
      {
        "paragraph": "What on earth made her fall for Rodney back then? Did she fall for him because he treated Sarah well\nor because the woman he loved was blessed?"
      },
      {
        "paragraph": "Hah. Nevertheless, she had forgotten that she was not Sarah."
      },
      {
        "paragraph": "Rodney could protect, tolerate, obey, and pamper the woman unconditionally only because she was\nSarah."
      },
      {
        "paragraph": "No matter how evil and wicked she was, she would always be his sweetheart in the depths of his heart"
      },
      {
        "paragraph": "What made Freya think that Rodney would treat her in the same way he treated Sarah once he fell for\nher?"
      },
      {
        "paragraph": "She lost. Funnily enough, she lost to Sarah."
      },
      {
        "paragraph": "Catherine lost to Sarah, so did Charity. The same happened to Freya as well."
      },
      {
        "paragraph": "Why did the three of them lose to the same woman?"
      },
      {
        "paragraph": "“Freya…” Catherine held her with unease. “It doesn’t matter. He’s just trash. Look at yourself. Given\nthat you’re rich and beautiful, you can easily find a man in the future. In fact, I think you can try being\nwith a handsome young man. A few days ago, I stumbled upon a piece of news about a pretty\npresident having constantly changing out boyfriends and they’re all handsome young men. She does\nwhatever she wants in life, which makes people admire her.”"
      },
      {
        "paragraph": "At this point, Catherine did not bother saying that Rodney was just temporarily muddle -headed and\nwould learn from his mistakes."
      },
      {
        "paragraph": "She found it inappropriate to offer her friend this sort of consolation."
      },
      {
        "paragraph": "There was no need to do so. If she were in Freya’s shoes, she might have killed Rodney straight away."
      },
      {
        "paragraph": "He did not learn from his mistakes despite having been terribly deceived by Sarah in the past."
      },
      {
        "paragraph": "Indeed, he was incurable."
      },
      {
        "paragraph": "Upon hearing Catherine’s words, Shaun twitched his mouth. “Cathy, do you admire the rich lady who\nkeeps getting different boyfriends?”"
      },
      {
        "paragraph": "“Ahem.” Catherine rolled her eyes at him. Obviously, she was trying to comfort Freya, so he should\nknow how to shut up. “Well, all women do. ”"
      },
      {
        "paragraph": "Shaun sensed her threatening gaze and shut his mouth glumly."
      },
      {
        "paragraph": "“Young Master Hill, Young Master Jewell, do you think what Rodney just said is true?” Freya suddenly\nasked."
      },
      {
        "paragraph": "Chester’s eyebrows twitched. After staying quiet for a moment, Shaun said, “I suppose so. Recently,\nI’ve always been dreaming about my past. I feel that I’ll recover my memory soon.”"
      },
      {
        "paragraph": "The rest went silent. In fact, they believed in Sarah’s words too."
      },
      {
        "paragraph": "Since Sarah had the audacity to suggest having Shaun’s people keep an eye on her, it clearly meant\nthat she did not plan on escaping. She was fully prepared."
      },
      {
        "paragraph": "“What a scheming woman. ” Catherine frowned. “ She must’ve done something to Shaun’s brain\nearlier. I’m sure she was around when he fell down the stairs. I’m also very certain that she had an\naffair with Wesley.”"
      }
    ]
  },
  {
    "title": "Chapter 1928 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Sarah… has come prepared, ” Chester  said glumly, “ She probably conspired with Wesley back then,\nbut she also made a backup plan for herself in case he failed. Now that Wesley has failed, Nathan, the\nprime minister, has the upper hand in everything. The Snow family has become the most influential\nfamily in Australia, and one of the members is the heir. The fact that Rodney is her ex-boyfriend is the\nprimary reason why Sarah came back.”"
      },
      {
        "paragraph": "Catherine and Freya were both astounded at the same time. Freya stammered, “Do you mean that she\nplotted this long ago just in case Wesley failed.”"
      },
      {
        "paragraph": "“If Wesley had succeeded, the first thing he would’ve done is get rid of Shaun and Catherine. When\nShaun fell down the stairs, he was like a fool, so Wesley did not doubt him. If Shaun had passed away,\nnothing would trouble Sarah anymore. She could depend on Wesley and act unscrupulously in\nAustralia.”"
      },
      {
        "paragraph": "Chester said indifferently, “But Wesley failed and Shaun is still alive. Hence, she came back to prove\nherself innocent of the crime in front of Rodney. She’ll claim that she was accused or that it was Wesley\nwho forced her.”"
      },
      {
        "paragraph": "At first, Catherine and Freya were confused about it. Upon hearing Chester’s analysis though, the two\nof them grasped the point."
      },
      {
        "paragraph": "Sure enough, only the most manipulative person could see through Sarah’s mind."
      },
      {
        "paragraph": "It was no wonder that Rodney would defend Sarah."
      },
      {
        "paragraph": "“But… it’s a fact that Sarah cuckolded Rodney. Didn’t you also catch sight of Sarah being intimate with\nanother man in front of Rodney? ” Catherine asked Chester curiously, “As a man, would you forgive her"
      },
      {
        "paragraph": "just like that?”"
      },
      {
        "paragraph": "Chester smiled sarcastically. “If Sarah has made preparations in regards to Shaun’s illness, why\ncouldn’t she do the same with her break up with Rodney? At that time, Rodney had left the Snow\nfamily. Indeed, he was worthless to her, so she wanted to get rid of him."
      },
      {
        "paragraph": "“But now that Nathan has become the president as well as the most important figure in Australia,\nRodney’s status is elevated after returning to the Snow family. What’s more, the Snow family kicked\nRodney out of the house previously not because they planned to give up on him. Rather, they just\nwanted to teach him a lesson.”"
      },
      {
        "paragraph": "Shaun nodded and opened his mouth slowly. “ Similar to my analysis back then, Sarah could always go\nback to Rodney if Wesley failed. That was why she did something that would make Rodney forgive her.\nFor example… She could say she did not leave Rodney back then because she wanted to."
      },
      {
        "paragraph": "Instead, her intention was for Rodney to go back to the Snow family."
      },
      {
        "paragraph": "“She hoped for him to live better and soar higher. She didn’t want to be his stumbling block. She did\neverything for his own good without meaning to hurt him.”"
      },
      {
        "paragraph": "“Right. This is the most probable reason.”"
      },
      {
        "paragraph": "Chester agreed. “If I’m not mistaken, when I saw Sarah and President Yard behaving intimately\npreviously, it was probably just an act. She got President Yard to put on an act with her at the last\nminute. When Rodney heard Sarah’s explanation, he would definitely doubt her and probe into the\nmatter."
      },
      {
        "paragraph": "“After discovering that Sarah and President Yard might be innocent, Rodney probably felt that he owes\nSarah because he thinks that Sarah has sacrificed a lot for him. As such, he’s very guilty toward her.”"
      },
      {
        "paragraph": "Freya was dumbfounded."
      },
      {
        "paragraph": "She had to admit that Shaun and Chester were Rodney’s best buddies as they knew his character so\nwell."
      },
      {
        "paragraph": "Of course, Sarah understood Rodney very well too. Otherwise, her plan would not have worked out."
      },
      {
        "paragraph": "A moment later, she muttered, “Sarah might’ve planned this plot very well, but it still goes to show that\nRodney has feelings for her. He still can’t get over his sweetheart.” Chester stayed quiet."
      }
    ]
  },
  {
    "title": "Chapter 1929 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "In fact, Chester could have begged for mercy and spoken up for Rodney. However, considering that\nRodney was protective of Sarah, it was not easy to deal with the issue. Dealing with it would make\nFreya suffer too."
      },
      {
        "paragraph": "He was not bothered to beg for mercy on behalf of Rodney."
      },
      {
        "paragraph": "Even Chester, who was cold and distant, felt that Rodney was ignorant of the truth."
      },
      {
        "paragraph": "Shaun had nothing much to say either."
      },
      {
        "paragraph": "Given that Shaun had lost his memory, he was not very close to Rodney. Now that Rodney was\ncovering up for Sarah and opposing him, Shaun did"
      },
      {
        "paragraph": "not even feel like being friends with him anymore."
      },
      {
        "paragraph": "Catherine asked with discontent, “So are we going to wait for half a month without doing anything? Is\nthere a way to expose Sarah’s true colors?”"
      },
      {
        "paragraph": "“How should we do it?” Chester asked, “Should we look for President Yard who put on an act with her\nbefore this? I’m guessing he doesn’t know Sarah’s"
      },
      {
        "paragraph": "intentions either. He went along probably because he assumed that Sarah wanted to fulfill Rodney’s\nwishes.”"
      },
      {
        "paragraph": "Shaun scoffed. “This matter sounds simple, but you all know full well that Sarah has done many evil\ndeeds. Rodney is still hopeful about her, which is why he chose to believe in her. Deep down, he\ncontinues to hope that the girl he has had a crush on for over ten years is kind. He believes that she\nwas forced to do those bad deeds before this.”"
      },
      {
        "paragraph": "Catherine went quiet."
      },
      {
        "paragraph": "Although the comments might hurt Freya’s self- esteem, they could be the truth."
      },
      {
        "paragraph": "It was fine if other people did not believe that Sarah did those things, but Rodney did."
      },
      {
        "paragraph": "That was why he had been defending her."
      },
      {
        "paragraph": "Freya let out a sardonic laugh. “You’re right, Young Master Hill. Rodney isn’t clear about the situation.\nIn fact, he doesn’t want  to get it clear. No matter how protective he is of Sarah, I won’t let her off.”"
      },
      {
        "paragraph": "“Right. Sarah is too evil, ” Catherine said, “ Shaun, she deserves to die more than a hundred deaths for\nwhat she has done to us in the past. She secretly took away Aunty Jennifer’s ashes and threw them\nelsewhere. She was also the one who incited"
      },
      {
        "paragraph": "Thomas to infuriate Uncle Boris, and she ruined the entire Neeson family. I definitely won’t allow her to\nget away just like that.”"
      },
      {
        "paragraph": "At the mention of the Neeson family’s matter, Chester blinked his eyes, which flashed with a hint of\ngrimness."
      },
      {
        "paragraph": "Shaun wrapped his arm around Catherine’s shoulder. “I’ll discuss this with Uncle Nathan and contact\nUncle Titus as well. Bear in mind that if it weren’t for the drug Sarah provided, your mom wouldn’t have\nfallen sick. Rodney has been feeling guilty about it. We can all pressure him by then. ”"
      },
      {
        "paragraph": "After pausing for a moment, Shaun said coldly, “By the way, I promised Rodney that I’d wait for half a\nmonth, but I didn’t tell him that death awaits Sarah even if I recover half a month later.”"
      },
      {
        "paragraph": "After that, Catherine asked the two men to leave first."
      },
      {
        "paragraph": "She stayed there to keep Freya company. “Do you want me to have a drink with you?”"
      },
      {
        "paragraph": "“The bars aren’t open in the daytime.” Freya wanted to find a place to get a drink too. When she\nthought about Dani, she had no choice but to tell herself that escaping reality by drinking would not\nhelp. ”Cathy, I want to consult a lawyer about divorce-related matters. I also want to fight for Dani’s\ncustody. ”"
      }
    ]
  },
  {
    "title": "Chapter 1930 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“I know an excellent divorce lawyer. I’ll come along with you.”"
      },
      {
        "paragraph": "“No need. Just let me know the lawyer’s contact details. I want to have some quiet time alone on my\nway there.”"
      },
      {
        "paragraph": "After Freya finished speaking, she saw Catherine’s anxious gaze fixed on her. Then, she forced a\nsmile. “Don’t worry. I’ve gone through all kinds of situations over the past few years—from being\nphysically abused by Patrick to being insulted by Thomas and even having no choice but to leave\nAustralia. But after I returned, I became the prime minister’s goddaughter. When Senator Mead\nprepared to rebel, I was kept under surveillance every day and had to be cautious. I almost thought I\nwas going to die, but I survived those days. I’m no longer the same as how I was back in Melbourne.\nWhat’s more, I can’t give up, or what’s going to happen to Dani?”"
      },
      {
        "paragraph": "She gnashed her teeth and said with a hoarse voice, “If Rodney plans on marrying Sarah in the future,\nI’m sure Sarah won’t treat Dani well. I need to take Dani away.”"
      },
      {
        "paragraph": "“Freya, we’ll help you.” Catherine was saddened by Freya’s words. “ If things really get that bad, I’ll ask\nmy mom for help. As much as I don’t want to acknowledge her, I can ask her to get Uncle Titus’ help.”"
      },
      {
        "paragraph": "“Thanks, Cathy.”"
      },
      {
        "paragraph": "Somehow, Freya felt more at ease with Catherine’s presence."
      },
      {
        "paragraph": "At the very least, she was not lonely in Canberra. She drove around the city."
      },
      {
        "paragraph": "Her phone rang many times."
      },
      {
        "paragraph": "Those calls were from Rodney, but she did not pick them up."
      },
      {
        "paragraph": "At the sight of his number, Freya was too weak to answer it."
      },
      {
        "paragraph": "It felt as though her head was going to explode. She was desperate for a way to vent her feelings."
      },
      {
        "paragraph": "She parked her car at the roadside."
      },
      {
        "paragraph": "She walked into the convenience store to buy a packet of cigarettes."
      },
      {
        "paragraph": "She had never smoked, but she felt like trying it now."
      },
      {
        "paragraph": "When she lit a cigarette and took a drag of it, she coughed until tears came out of her eyes."
      },
      {
        "paragraph": "It was terrible."
      },
      {
        "paragraph": "Just now, she told Catherine that she had survived all those experiences. However, she did not add\nthat those experiences had been miserable for her."
      },
      {
        "paragraph": "As the eldest young lady of the Lynch family, why was she living this kind of life?"
      },
      {
        "paragraph": "In the past, she just wished to live an ordinary life with a good-looking, capable man who loved her."
      },
      {
        "paragraph": "It did not matter if he was not rich."
      },
      {
        "paragraph": "All she wanted was a happy family just like what her parents gave her, but why was this so difficult?"
      },
      {
        "paragraph": "“Freya, are you crazy? Why are you smoking alone here?”"
      },
      {
        "paragraph": "A man came from behind. He grabbed the cigarette from her hand and tossed it on the ground. Then,\nhe stepped on it to put it out."
      },
      {
        "paragraph": "Freya remained still."
      },
      {
        "paragraph": "Feeling helpless, Ryan pulled her up. He froze the moment he saw the tears on her face."
      },
      {
        "paragraph": "He was passing by this area to deal with something. He happened to feel thirsty, so he came to the\nconvenience store to buy some water. He spotted her squatting at the roadside, but he did not expect\nthat…"
      },
      {
        "paragraph": "“What’s wrong with you? ” As he held her up, he recalled the matter that she asked him to investigate\nearlier. “Is it because Rodney bullied you?”"
      },
      {
        "paragraph": "“Leave me alone. I want to have some quiet time.” Freya did not move nor look at him."
      },
      {
        "paragraph": "She really did not want to see anyone from the Snow family."
      },
      {
        "paragraph": "Ryan pursed his sharp, thin lips."
      }
    ]
  },
  {
    "title": "Chapter 1931 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "As far as Ryan knew, Freya had always been an optimistic, bubbly woman. Every time she smiled, her\neyes would glow."
      },
      {
        "paragraph": "He had always liked the glow in her eyes."
      },
      {
        "paragraph": "However, the glow in her eyes had vanished now. He was exasperated too, not at her but Rodney."
      },
      {
        "paragraph": "“Let’s go. I’m going to take you to meet him. I’ll stand up for you.” Ryan clutched her hand."
      },
      {
        "paragraph": "“Let go of me.”"
      },
      {
        "paragraph": "After struggling for a long time, she still failed to break free from his grip. She flew into a rage and\nbegan to roar with tears, “I’m asking you to let go o f me. Can’t you hear me? What’s the point of taking\nme to meet him? You’re also a part of the Snow family. On the surface, you might seem like you’re\nhelping me, but in fact, you’re defending him."
      },
      {
        "paragraph": "Otherwise, why did you guys switch my contraceptive pills to force me to get pregnant and marry him?\nRodney is awful, but why must I save him by sacrificing my happiness? You guys don’t even know that\nI’ve never had the intention of being the daughter of the prime minister.”"
      },
      {
        "paragraph": "Ryan stopped moving with his deep gaze fixed on her."
      },
      {
        "paragraph": "All of a sudden, Freya seemed to have exploded as her tears started rolling down her face\nuncontrollably. “It might sound great to be the prime minister’s goddaughter, but everyone knows why\nthe Snow family acknowledged me as their goddaughter. It’s only because Rodney didn’t want to marry\nme and you guys took pity on me. Deep down, who doesn’t look down on me?"
      },
      {
        "paragraph": "“I’d rather give up everything, including my status as the prime minister’s goddaughter. I just want to be\nan ordinary person. I’m really fed up with Rodney, that dumb*ss."
      },
      {
        "paragraph": "“How I wish he could die.” Her eyes revealed hatred."
      },
      {
        "paragraph": "Ryan’s Adam’s apple bobbed. He did not utter a word."
      },
      {
        "paragraph": "He let her cry her heart out before wrapping her tightly into his arms."
      },
      {
        "paragraph": "He patted her head softly."
      },
      {
        "paragraph": "“Alright. I understand everything. If you want to cry, just cry out loud. If you don’t want to be with\nRodney, just divorce him.”"
      },
      {
        "paragraph": "“Divorce?” Freya had the urge to weep even more bitterly. “Will the Snows easily approve of me\ndivorcing him? Even if I can get a divorce, will you guys allow Dani to stay with me? I just want her. I\ndon’t mind losing my status as the prime minister’s goddaughter or anything else. All I want to do is\nleave quietly.”"
      },
      {
        "paragraph": "“Alright. I’ll help you,” Ryan said."
      },
      {
        "paragraph": "Freya’s breathing hitched. She even stopped crying for a moment. “I don’t buy that. You must be lying\nto me.”"
      },
      {
        "paragraph": "“Why would I lie to you? You’re the prime minister’s goddaughter. Of course, you have the right to\ndivorce your husband, ” Ryan answered with a deep voice."
      },
      {
        "paragraph": "At this moment, Freya pushed Ryan away at once. She stared at Ryan’s elegant, handsome face in\nbewilderment. “What kind of goddaughter am I? Everyone looks down on me. Plus, your parents dislike"
      },
      {
        "paragraph": "me. The Snow family acknowledged me as their goddaughter all because of Rodney…”"
      },
      {
        "paragraph": "“Since when do my parents dislike you? They often say that it’s rare to find women like you. They say\nthat Rodney is blessed to be able to marry you. My parents are regretful that they didn’t give birth to a\ndaughter back then.” Ryan took a tissue and gently wiped the tears off her face."
      },
      {
        "paragraph": "Upon hearing his words, Freya nearly forgot to react. “You’re lying.”"
      },
      {
        "paragraph": "“ I’m not. Perhaps you think that you became my parents’ goddaughter all because of Rodney. They\ndon’t know you well enough, so they seldom visit the prime minister’s office.” Ryan’s gaze was\nindulgent. “Now, can you tell me what on earth happened? I remember telling you that you can always\nlook for me in Canberra. I’ll help you with anything.”"
      },
      {
        "paragraph": "“But you’re Rodney’s— ”"
      },
      {
        "paragraph": "“Technically, you’re my godsister,” Rodney teased. “I’m not your biological sister.” Freya’s mouth\ntwitched."
      },
      {
        "paragraph": "Ryan’s eyes lingered on her curled lips for a while. “ Rodney and I aren’t biological brothers either.\nAlso, do I look like the sort who can’t differentiate right from wrong?”"
      },
      {
        "paragraph": "Freya instantly went silent. She was not very clear about Ryan’s character. She had always perceived\nthe Snows as people of great depth, especially Nathan’s family. As the prime minister’s son, how could\nhe possibly be simple?"
      }
    ]
  },
  {
    "title": "Chapter 1932 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“However, you’re right. The Snows surely won’t want you to divorce Rodney. Moreover, news about\nyour wedding has circulated. If you decide to get a divorce all of a sudden, the Snows will feel"
      },
      {
        "paragraph": "ashamed. Having said that, you can discuss the matter with me first. Once you’re definite about the\ndivorce, I’ll persuade my parents and grandfather, ” Ryan said patiently."
      },
      {
        "paragraph": "Freya fixed her confused gaze at the man, who was a few months younger than her."
      },
      {
        "paragraph": "He looked young, elegant, and handsome. Dressed in a black jacket, he behaved humbly and kept a\nlow profile."
      },
      {
        "paragraph": "Sure enough, he was a leader in an organization. The calm aura that he exuded was rather convincing."
      },
      {
        "paragraph": "Of course, she could not deny that it could be due to his good looks."
      },
      {
        "paragraph": "She had always admired people with good looks. Otherwise, she would not have fallen for Patrick\nduring her university days. She would not have"
      },
      {
        "paragraph": "been easily moved by Rodney’s words later on either."
      },
      {
        "paragraph": "“Earlier, I asked you to investigate whether Rodney was talking business. Only today did I find out that\nhe was with Sarah that night. He’s secretly hiding her. He always visits her, and he even stayed at her\nplace until late at night yesterday.”"
      },
      {
        "paragraph": "She explained in misery."
      },
      {
        "paragraph": "As a woman, telling someone else that her husband was cheating on her with his first love was indeed\nembarrassing."
      },
      {
        "paragraph": "Ryan was stunned. “Are you sure?”"
      },
      {
        "paragraph": "“ I just came from Sarah’s place. Rodney was afraid that I would hurt his darling, so he hurriedly got\nsome people to protect her. ” Freya snorted. “When I left, he was hugging Sarah tightly.”"
      },
      {
        "paragraph": "“My cousin is really incurable.”"
      },
      {
        "paragraph": "Ryan’s usually gentle eyes were filled with disappointment and fury. Before this, Ryan used his identity\nas Rodney’s love rival to provoke him for Dani’s sake."
      },
      {
        "paragraph": "If he had known that this would happen, he would have gotten Rodney and Freya to divorce."
      },
      {
        "paragraph": "Furthermore, Rodney and Ryan’s parents were both loving couples. No one in the Snow family ever\nhad a kept man or woman. However, Rodney was already having an affair with Sarah when he had just\ngotten married and his child was still young."
      },
      {
        "paragraph": "He had the audacity to approach Sarah despite her character."
      },
      {
        "paragraph": "“If  that’s the case, I see why you want to divorce him. Regardless of whether he’ll learn from his\nmistakes, he shouldn’t trap you in this marriage and keep you waiting.”"
      },
      {
        "paragraph": "Ryan said indifferently, “Also, you’ re always the one who reminds him to mend his ways. Legally\nspeaking, both of you are a couple but aren’t related by blood.”"
      },
      {
        "paragraph": "His tone was cold."
      },
      {
        "paragraph": "After listening to him, she somehow felt her eyes burning."
      },
      {
        "paragraph": "She did not believe in Ryan previously, but she did now."
      },
      {
        "paragraph": "She believed that he was taking her side."
      },
      {
        "paragraph": "With a lump in her throat, Freya said, “Thank you, Ryan. Actually, I don’t need your support. It’s good\nenough that you can understand my situation.”"
      },
      {
        "paragraph": "Ryan sighed softly. “I don’t understand. It’s difficult for you to get a divorce. If my uncle finds out that\nRodney is with Sarah, he’ll probably stop you from divorcing Rodney. He might think that you and your\nchild can make Rodney change his ways. Having said that, I don’t agree that you two should continue\nto be involved with each other because it’ll only hurt you and your child.”"
      },
      {
        "paragraph": "“ I expected this.” Freya forced a smile. Although the Snows always criticized Rodney, they still loved\nhim."
      },
      {
        "paragraph": "Ryan paused for a moment before adding, “What’s more, it’s unlikely that they’ll kick Rodney out in a fit\nof anger as they did previously.”"
      },
      {
        "paragraph": "Freya was a little confused."
      }
    ]
  },
  {
    "title": "Chapter 1933 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Ryan reached out to Freya’s hair and caressed it. It was quite an intimate act."
      },
      {
        "paragraph": "Freya could not help but  recall Rodney’s warning.  At the thought of it now, she found it ridiculous."
      },
      {
        "paragraph": "Since Rodney could spend the entire night with Sarah, why could she not let her so-called brother,\nRyan, caress her hair?"
      },
      {
        "paragraph": "In the past, she never realized Rodney’s double standards and selfishness."
      },
      {
        "paragraph": "“It’s because Rodney is handling the Snow family’s core business, ” Ryan said with a grim expression."
      },
      {
        "paragraph": "Freya got the message. “Are you referring to the alternative energy project?”"
      },
      {
        "paragraph": "“Mm.” Ryan nodded. “With the fast-growing technologies over the past few years, there’s fierce\ncompetition among the businesses in the world."
      },
      {
        "paragraph": "This project is the most crucial core business in Australia over the decade. Since the project started,\nmy dad and uncle have been strongly supporting it. Although Rodney made a mistake in the issue with\nSarah last time, he’s a business prodigy. With Rodney and Carson’s cooperation, this project is\nofficially on track. Rodney is capable of handling this project, and no one can replace him."
      },
      {
        "paragraph": "Considering that Carson is young, he’s not as experienced as Rodney. Furthermore, my grandpa has\npraised Rodney in front of us many times.”"
      },
      {
        "paragraph": "Freya was stunned. She rarely asked Rodney about work, and he would not talk much about it to her\neither."
      },
      {
        "paragraph": "Due to his affair with Sarah, Freya always saw him as a silly, incapable, wealthy man who only\nmanaged to set up a few companies because of his background. It turned out that she had\nmisunderstood him."
      },
      {
        "paragraph": "On second thought,  she was indeed wrong. If he were so useless, how could he be good friends with\nShaun and Chester?"
      },
      {
        "paragraph": "“What’s more…”"
      },
      {
        "paragraph": "Ryan said with mixed feelings, “Rodney has been kicked out of the Snow family once, so he can\nunderstand how it feels to be helpless and left with nothing. Do you think he’ll be unprepared like last\ntime?”"
      },
      {
        "paragraph": "After a long time, Freya said with relief, “I don’t care whether the Snow family will teach him a lesson or\npunish him. I’m set on divorcing him. He might marry Sarah in the future and even become the most\nbrilliant and richest man in the world. But I don’t care, nor will I regret or admire him.”"
      },
      {
        "paragraph": "Ryan gave a vague smile."
      },
      {
        "paragraph": "His eyes flashed with gentleness."
      },
      {
        "paragraph": "For many other women, they might disagree with her words just now."
      },
      {
        "paragraph": "After all, Rodney was indeed a promising man. Some women would choose to turn a blind eye to their\nhusbands’ affairs as long as their position as wives was secured."
      },
      {
        "paragraph": "However, Freya was never bothered about power and money."
      },
      {
        "paragraph": "“I’ll help you with this matter. You can’t stay with Dani alone outside because Rodney can simply enter\nyour house without your permission. You can move to the official residence  first, and I’ll persuade my\nparents, ” Ryan said firmly."
      },
      {
        "paragraph": "Freya’s lips parted. She subconsciously wanted to reject his offer."
      },
      {
        "paragraph": "Nevertheless, she remembered that Rodney had gone to stay in Brighton Gardens soon after she\nmoved there."
      },
      {
        "paragraph": "If he wanted to pester her, it would be best for her to stay in the official residence."
      },
      {
        "paragraph": "“Well… let’s see, ” Freya said in hesitation, “Now that he’s with Sarah, I’m sure he’ll be ready to divorce\nme if I initiate it. The only problem is Dani Ryan stared at her helplessly  and sighed deep down."
      }
    ]
  },
  {
    "title": "Chapter 1934 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "After all, no matter if it was Sarah’s identity or status, it was all inferior to her."
      },
      {
        "paragraph": "However, Ryan did not point out the truth. Freya would naturally come to understand it when she\ninteracted with Rodney."
      },
      {
        "paragraph": "After that, Freya went to the solicitors’ office before going back to the villa."
      },
      {
        "paragraph": "The moment she arrived, she saw Rodney’s car parked in the courtyard."
      },
      {
        "paragraph": "As she got down the car, Rodney was already hurriedly walking out of the house. His pretty face looked\nanxious. “Where did you go? I’ve been calling you for the entire evening, but you didn’t pick up.”"
      },
      {
        "paragraph": "Freya did not say anything. She was afraid that her blood would boil once she talked to him and that\nshe would chop him up with a knife."
      },
      {
        "paragraph": "She was never that easily angered back then with Patrick."
      },
      {
        "paragraph": "Perhaps it was because she and Patrick were not married nor had a child together. Most importantly,\nthat woman was not Sarah."
      },
      {
        "paragraph": "In Freya’s entire life, she despised the siblings, Sarah and Thomas, the most. With Rebecca, she was\nonly disgusted."
      },
      {
        "paragraph": "That was because she did not have any deep grudges with Rebecca."
      },
      {
        "paragraph": "“Say something.”"
      },
      {
        "paragraph": "Rodney pulled Freya’s arm. Looking at her cold expression, Rodney wetted his lips unnaturally. “I didn’t\nlie to you on purpose. I just wanted to wait half a month to verify the validity of Sarah’s words. After"
      },
      {
        "paragraph": "that, I’ll send her overseas. I stopped liking her a long time ago. I kept it a secret from you because I\nwas afraid you would overthink and misunderstand me, just like this current predicament. I can’t explain\neverything clearly to you, but… You’re a little too much as well. To think you inserted a tracker in my\nphone. Forget it. I don’t want to fuss over this anymore. Let’s just call it even and continue living our\ndays peacefully,"
      },
      {
        "paragraph": "okay? Sarah won’t be in Canberra after half a month anyway.”"
      },
      {
        "paragraph": "Freya sneered."
      },
      {
        "paragraph": "Since Sarah had the guts to come back, would she be willing to be sent overseas?"
      },
      {
        "paragraph": "She most probably still had some tricks up her sleeves."
      },
      {
        "paragraph": "Moreover, what did Rodney mean by not wanting to fuss over that matter anymore?"
      },
      {
        "paragraph": "Maybe, this was just an insignificant matter to him."
      },
      {
        "paragraph": "If Freya made a fuss, Rodney might even think that she was narrow-minded."
      },
      {
        "paragraph": "However, Freya did not fight. She simply asked, “Do you really believe in what Sarah said?”"
      },
      {
        "paragraph": "Rodney pouted. “I didn’t intend to believe her at first, but I’ve asked Shaun before. Shaun said he did\nfeel like his memories were about to recover. Didn’t you see it for yourself? He even left this morning.\nThat means that he believes it too.”"
      },
      {
        "paragraph": "Freya felt incredibly helpless. “Does that mean you don’t care that  she used to treat  you as a backup\nand cheated on you? She’s just dirty  goods  that have been used by countless men.”"
      },
      {
        "paragraph": "“Freya, shut up.” Rodney found her words too jarring, so he instinctively stopped her angrily, his face\ncold."
      },
      {
        "paragraph": "Freya really did shut up."
      },
      {
        "paragraph": "She realized that she could not criticize Sarah in front of Rodney, or he would get angry at her."
      },
      {
        "paragraph": "Things were not like that in the past. Rodney used to cherish Freya truly."
      },
      {
        "paragraph": "The difference was so drastic that Freya could not recover from it."
      },
      {
        "paragraph": "However, Rodney did not notice anything amiss. He said, “Freya, you can say that about other people\nbut not about Sarah. It’s unfair to her. Back then, I was the one who willingly became a backup, and\nshe didn’t cheat on me either. It was just an act between her and President Yard."
      },
      {
        "paragraph": "“Her goal was to make me leave her voluntarily and return to the Snow family. At that time, my career\nwasn’t going well, and my friends were leaving me one after another. She only did that because she\nsaw that I was depressed."
      },
      {
        "paragraph": "“She wanted me to have a better life and didn’t want to drag me down. She didn’t collude with Wesley\nas well. In fact, she was caught and threatened by Wesley.”"
      }
    ]
  },
  {
    "title": "Chapter 1935 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“I owe Sarah the most in my entire life."
      },
      {
        "paragraph": "“But don’t worry. I know you’re my wife and that you’re married to me. I have never thought of doing\nanything that’ll betray you."
      },
      {
        "paragraph": "“Therefore, I’ve decided to send Sarah overseas after half a month. However, you can’t slander her\nanymore. She has sacrificed too much for me.”"
      },
      {
        "paragraph": "After Rodney spoke, Freya thought, ‘F*ck. Chester did guess everything correctly.’"
      },
      {
        "paragraph": "Sarah was the b*tch of all b*tches. How could Freya fight her?"
      },
      {
        "paragraph": "It was equivalent to attempting something impossible."
      },
      {
        "paragraph": "Look how Rodney was defending Sarah, sympathizing with her, and feeling so guilty toward her now."
      },
      {
        "paragraph": "As soon as men felt guilty toward a woman, it was inevitable that something would happen."
      },
      {
        "paragraph": "“You believe in everything she says?” Freya asked softly."
      },
      {
        "paragraph": "“I didn’t believe her at first, but I did an investigation afterward and met President Yard as well.\nPresident Yard said that Sarah looked for him to act out a scene with her back then.”"
      },
      {
        "paragraph": "Rodney pressed his lips together. “Besides, I’ve thought it through. I’ve known her for more than ten\nyears and have treated her well all along. There was no reason for her to scold me so harshly back\nthen. To put it plainly, she just wanted to provoke me to hate her and feel disgusted toward her. She\nhad good intentions.”"
      },
      {
        "paragraph": "Freya replied, “Oh, that’s quite thoughtful of her. I’m so touched. Why don’t… I withdraw and let you\nguys be together. After giving it some thought, I do think Sarah has sacrificed so much for you. If I insist\non keeping this position, that’ll make me inhumane. I’ll be tortured by guilt and shame.”"
      },
      {
        "paragraph": "Rodney was taken aback. He looked at Freya intently."
      },
      {
        "paragraph": "He suspected that she was being sarcastic, but her expression looked very sincere."
      },
      {
        "paragraph": "After a moment of silence, he asked hesitantly,  “ Are you being sincere or sarcastic?”"
      },
      {
        "paragraph": "“I’m being sincere. ” Freya almost laughed out of anger. “You and Sarah have the most touching love in\nthe world. It can even move the heavens and"
      },
      {
        "paragraph": "earth. Why was I so f*cking blind to have come between you guys? I should leave quickly. Staying\nanother moment will only make me feel bad. I hope you and Sarah will live a long and happy life\ntogether and have a child as soon as possible.”"
      },
      {
        "paragraph": "At that moment, Rodney could sense Freya’s sarcasm no matter how dense he was."
      },
      {
        "paragraph": "His face flushed red from anger. “Why are you mocking me? Everything I said is true. I’ll send Sarah\naway.”"
      },
      {
        "paragraph": "Freya scolded him, “Are you a human? Sarah has sacrificed and contributed so much for you, yet you\nwant to chase her away. At a time like this, you should make her stay, care for her, and give her a car\nand a house. You have to tell her, ‘Sarah, thank you. If it weren’t for you, I wouldn’t have been able to\nreturn to the Snow family. I wouldn’t have  had the chance to get the Snow family’s megaproject. I owe\nyou so much that I can only repay you by giving myself to you.”’"
      },
      {
        "paragraph": "Rodney was exasperated. “You’re being unreasonable.”"
      },
      {
        "paragraph": "Freya laughed. “Aren’t those your thoughts?”"
      },
      {
        "paragraph": "“I’ve never…”"
      },
      {
        "paragraph": "“Okay, then. Let me ask you this. You said you’d send her away, but you can’t possibly leave her with\nnothing, right? You’ll give her a large sum of money, as well as arrange a luxurious house and a job for\nher overseas, right?”"
      },
      {
        "paragraph": "Freya stared at Rodney, who stammered, “She’s really pitiful. She doesn’t have anything. I can only\naccompany you and the child properly after arranging everything for her.”"
      },
      {
        "paragraph": "The mockery in Freya’s eyes grew intense. “As far as I know, we’re husband and wife. Your money is\nconsidered joint property. Buying a house for Sarah and giving her money will also be a joint property\nbetween us, right?”"
      },
      {
        "paragraph": "Rodney felt annoyed by her question. “Don’t worry. I’ll give her my pre-marital property. That should be\nfine, right?”"
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "Freya nodded."
      }
    ]
  },
  {
    "title": "Chapter 1936 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya was thankful that she had completely given up on Rodney."
      },
      {
        "paragraph": "If not, she would die of a heart attack on the spot due to anger."
      },
      {
        "paragraph": "Rodney thought Freya had figured things out since she suddenly fell silent."
      },
      {
        "paragraph": "His expression softened. He held Freya’s hand lightly and coaxed her. “Wifey, after I send Sarah away,\nlet’s live together happily.”"
      },
      {
        "paragraph": "Freya looked at Rodney’s hand."
      },
      {
        "paragraph": "It would be outlandish for her to feel touched. In fact, she felt disgusted."
      },
      {
        "paragraph": "It was because that hand of his had just hugged Sarah right in front of her that morning."
      },
      {
        "paragraph": "That was the final chance between Rodney and her."
      },
      {
        "paragraph": "However, Rodney was not concerned about it at all when he was with Sarah. In other words, he did not\ncare about Freya’s feelings at that time."
      },
      {
        "paragraph": "Freya withdrew her hand without a word and walked toward the villa."
      },
      {
        "paragraph": "Dani was lying in the baby cot in the living room, smiling sweetly."
      },
      {
        "paragraph": "Freya watched her in silence for some time. Her tears almost fell."
      },
      {
        "paragraph": "Rodney walked up behind her and said, “Look at how carefree Dani is every day. Don’t be mad. Just do\nit for the child’s sake. Don’t you want  her to have a happy family?”"
      },
      {
        "paragraph": "“So… The main reason you got together with me was for the child, right?” Freya said coldly."
      },
      {
        "paragraph": "Rodney’s handsome face went blank. “Of course not. Haven’t I answered this question before?”"
      },
      {
        "paragraph": "“Yes, you did, ” Freya muttered. “I believed you then.”"
      },
      {
        "paragraph": "“What do you mean by that? You don’t believe me now?” Rodney was frustrated. “I explained so much\nto you just now. Why didn’t you listen to any of it?”"
      },
      {
        "paragraph": "Freya did not say a word. She simply went to the bathroom and washed her hands with soap."
      },
      {
        "paragraph": "She felt dirty, very dirty."
      },
      {
        "paragraph": "After washing her hands, she went out and immediately opened her document folder. She threw the\ndivorce papers in front of Rodney. “I heard everything you said just now, and it only made me more\ndetermined. We should separate peacefully. Sign this. The child’s custody rights are mine, but you\nhave the right to visit her as her father. Your parents can take her to the Snow family’s manor if they\nmiss her. However, if you and Sarah get married in the future, I’ll never approve of my daughter\nacknowledging Sarah as her stepmother.”"
      },
      {
        "paragraph": "Rodney looked at the divorce papers on the table in a daze."
      },
      {
        "paragraph": "He had fought with Freya and talked about divorce many times, but today was the first time the divorce\npapers were printed out."
      },
      {
        "paragraph": "His head was buzzing, and he tore the divorce papers straight away."
      },
      {
        "paragraph": "“You can tear them. I’ll print out a few more sets tomorrow,” Freya said calmly. “Are you crazy?”\nRodney  shouted,  “How many times do you want me to explain myself? Will you only be satisfied if I\nchase Sarah out right now?”"
      }
    ]
  },
  {
    "title": "Chapter 1937 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Can you do that?” Freya suddenly asked out of curiosity."
      },
      {
        "paragraph": "She should not have probed Rodney again. However, she was just curious as to how important she\nwas in his heart."
      },
      {
        "paragraph": "“No.” Rodney refused without a moment of hesitation. “Sarah’s leg is injured.  Shaun has backed out,\nbut who knows what he’ll do to her if I don’t protect her? I owe her this, Freya. You can’t be so selfish.\nTake a look at your identity now and then at your bags, rings, and earrings. Any one of them is worth a\nfew hundred thousand dollars. But what about Sarah? She’s living in a small house with only an area of\ntens of square meters. All of this here was paid for by her sacrifice.”"
      },
      {
        "paragraph": "Freya found it ridiculous. She removed her watch, earrings, and diamond ring. She even poured out\neverything in her bag. The things inside were hers, but the bag was a gift from Rodney."
      },
      {
        "paragraph": "She used to feel so happy and loved when he gave her a present each day."
      },
      {
        "paragraph": "“Rodney, I’m giving all of these back to you.”"
      },
      {
        "paragraph": "Freya threw everything  that he had gifted her to him. “You can give these to Sarah. That way, she\nwon’t be so miserable anymore. Also,  let  me  tell you this. My current life isn’t  a result  of her\nsacrifice. Indeed, the Lynch family can’t compare to"
      },
      {
        "paragraph": "the Snow family, but my parents can afford to buy me bags, rings, and earrings that are a few hundred\nthousand dollars. I can even afford them myself without needing my parents to pay."
      },
      {
        "paragraph": "“I, Freya, am not lacking in any way. I’ m not the Snow family’s and your parasite either.”"
      },
      {
        "paragraph": "Freya stood up. Her body was trembling with anger. “Do you think that it’s my honor and the Lynch\nfamily’s honor to be able to marry you? Why don’t you ask yourself? When has the Lynch family relied\non the Snow family after we got involved? Do you think I wanted to get involved with you? If it"
      },
      {
        "paragraph": "weren’ t for me being pregnant back then  and for the sake of the Snow family’s reputation, I wouldn’t\nhave gotten married to you at all.”"
      },
      {
        "paragraph": "Freya’s gaze toward Rodney was filled with disdain."
      },
      {
        "paragraph": "Upon recalling the words that Freya scolded him through the phone, Rodney’s handsome face looked\nextremely awful. “What do you mean by"
      },
      {
        "paragraph": "that? Freya, are you looking down on me? Or do you regret getting married to me all this while?”"
      },
      {
        "paragraph": "“I had no regrets during the recent period when we were in love. But today, I regret it a lot.”"
      },
      {
        "paragraph": "Freya took a deep breath. “When you went to Cairns for a business trip, you told me that  you were\ncoming back on an evening flight. To be honest, I knew from the start that you had already returned in\nthe morning. These days, I’ve had countless thoughts. I thought maybe you got bored of me because \nyou had me and that you might have another woman outside.”"
      },
      {
        "paragraph": "“That time… I didn’t lie to you on purpose. I…” Rodney’s brows twitched, and he was ashamed to\nexplain."
      },
      {
        "paragraph": "Freya interrupted him. “I know you might not have had sex with Sarah yet, but please put yourself in my\nshoes and think about it. That day, all Ryan did was touch my head, yet you stopped him sternly. Then\nwhat about you? You’ve spent many nights with Sarah. Was there no physical contact between the two\nof you at all?”"
      },
      {
        "paragraph": "“Her leg was injured. I just carried her for a while, ” Rodney said in annoyance."
      },
      {
        "paragraph": "“If you think that’s nothing, then I have nothing to say.” Freya shrugged her shoulders. “Frankly\nspeaking, our thoughts and perspectives are different. You think you’re innocent, but I think you’ve\ncrossed my limits. The people I hate most in my life are Sarah and Thomas. I will never forget how\nbadly Thomas beat me and how hopeless I felt that night."
      },
      {
        "paragraph": "“Oh, after that, I couldn’t even seek justice. All of you were helping Thomas because of Sarah. In the\nend, Thomas stepped up and said to the reporters that I was the one who seduced him. Ha! Those\ndays, I was living my life like a rat.”"
      },
      {
        "paragraph": "Rodney would never understand the thousands of extremely harsh comments scolding Freya on\nFacebook every day."
      },
      {
        "paragraph": "She could never forget someone calling her and scolding her a b*tch, that she was a disgrace to all\nwomen."
      },
      {
        "paragraph": "She could never forget that  she was thrown bad eggs at, surrounded by people saying that she\nseduced others, and splashed with dirty water when she was walking on the streets."
      },
      {
        "paragraph": "Freya had the urge to end her life back then. However, she held in her anger."
      },
      {
        "paragraph": "She was unsatisfied and frustrated that she could not seek justice for herself. She did not want to let\nthose people who had hurt her go unpunished."
      },
      {
        "paragraph": "Freya wanted to tell everybody that she could not be bothered to seduce that sc*mbag, Thomas."
      }
    ]
  },
  {
    "title": "Chapter 1938 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Ultimately, she did manage to do that. However, no one knew the hardships she went through behind\nthe scenes."
      },
      {
        "paragraph": "Was it easy to achieve the status of the world’s youngest chemist? Absolutely not."
      },
      {
        "paragraph": "Rodney would never be able to understand what she went through."
      },
      {
        "paragraph": "That was because he would only deny it nonchalantly, as he did now. “Thomas was the one who did\nthat. It had nothing to do with Sarah."
      },
      {
        "paragraph": "Besides, Thomas has already gotten his punishment. He has been castrated, and he has gone\nmissing.”"
      },
      {
        "paragraph": "“I believe it had something to do with Sarah,” Freya said coldly."
      },
      {
        "paragraph": "Rodney frowned. He thought she was being unreasonable. “Freya, you’re biased against Sarah. She’s\nactually a very pitiful woman.”"
      },
      {
        "paragraph": "Freya thought to herself, ‘Rodney’s words really are challenging my limits over and over again.’"
      },
      {
        "paragraph": "She used to be the closest person to him."
      },
      {
        "paragraph": "However, Rodney did not feel any pity for what she had gone through. Instead,  he considered Sarah to\nbe pitiful."
      },
      {
        "paragraph": "Fine, then. Her life was such a failure."
      },
      {
        "paragraph": "“ I don’t want to discuss Sarah with you anymore. I’m sick of talking about that woman. Anyway, I’m\ndefinitely getting a divorce, ” Freya said indifferently. “If you’re unwilling, I’ll discuss it with your parents"
      },
      {
        "paragraph": "and grandfather tomorrow.”"
      },
      {
        "paragraph": "“You’re crazy.”"
      },
      {
        "paragraph": "Rodney stood up furiously. “You can’t go to them. ”"
      },
      {
        "paragraph": "“Why not?” Freya stared at him. She mocked, “Are you afraid they’ll find out that Sarah has returned\nand that you’re keeping her? Are you scared that they’ll hurt Sarah?”"
      },
      {
        "paragraph": "Rodney did not deny it. He merely said pleadingly, “ Freya, just wait for half a month. Let’s talk about\nthis again after I send her away in half a month, okay?”"
      },
      {
        "paragraph": "“I don’t want to, and I’m not willing to.”"
      },
      {
        "paragraph": "After Freya rejected Rodney with a cold expression, she could clearly see a dark gleam flashing across\nRodney’s eyes."
      },
      {
        "paragraph": "Her heart skipped a beat. She blurted, “You’re not thinking of confining me, are you?”"
      },
      {
        "paragraph": "Rodney’s thin lips twitched, but he did not deny it. He did think of that just now. However, at the thought\nthat Shaun would most probably look for his uncle, he dismissed that idea."
      },
      {
        "paragraph": "Feeling a surge of anger rushing up to her that she could not control, she picked up the glass of water\non the table and splashed it on Rodney’s face. “Why don’t you just kill me? But killing me alone isn’t\nenough, right? You’ll still have to kill Shaun, Catherine, and Chester.”"
      },
      {
        "paragraph": "“What nonsense are you talking about? I have never thought of hurting you. ” Rodney wiped the water\noff his face, upset."
      },
      {
        "paragraph": "Freya wanted to laugh. He was always hurting her. Always."
      },
      {
        "paragraph": "Too bad he could not notice it because he only cared about Sarah."
      },
      {
        "paragraph": "“Rodney, there’s no use in confining me because your mother will come over every day to visit Dani.”\nFreya took a deep breath. She said icily, “However, if you sign the divorce papers and we go through\nthe procedures, I’m willing to keep this from your parents for half a month.”"
      },
      {
        "paragraph": "“No.” Rodney rejected instinctively. “I’m never getting a divorce.”"
      },
      {
        "paragraph": "Freya was infuriated. “Don’t you feel guilty toward Sarah? Don’t you think that she sacrificed a lot for\nyou? In that case, you should marry her and give her happiness. Why are you still clinging on to me?”"
      },
      {
        "paragraph": "“Freya, I do like you. Moreover, I can’t allow Dani to live in an incomplete family, so I can only feel sorry\nfor Sarah. Besides, Sarah doesn’t want to come  in between  our marriage.  She’ll  feel  guilty. ”"
      },
      {
        "paragraph": "Freya almost cursed."
      },
      {
        "paragraph": "Would Sarah feel guilty? To hell with feeling guilty. Rodney was such an idiot."
      }
    ]
  },
  {
    "title": "Chapter 1939 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Chapter 1943"
      },
      {
        "paragraph": "“If you don’t want to get a divorce, then we have no choice but to go through the legal procedures,”\nFreya said coldly. “By then, don’t blame me for sullying your reputation. After all, let’s see who would be\ndisgraced if word got out that someone was sneaking around with his first love when he’s already\nmarried.”"
      },
      {
        "paragraph": "After that, Freya picked Dani up and went upstairs. She did not even want to have dinner, lest she lose\nher appetite just by looking at Rodney."
      },
      {
        "paragraph": "When she got upstairs, she threw all of Rodney’s clothes and daily necessities out."
      },
      {
        "paragraph": "Looking at his stuff lying in a mess on the corridor, Rodney was so furious that his head hurt."
      },
      {
        "paragraph": "However, before he could pack up the mess, he received a call from the Snow family’s manor."
      },
      {
        "paragraph": "“Get back here,” Old Master Snow said coldly."
      },
      {
        "paragraph": "Rodney’s heart skipped a beat. From Freya’s tone just now, he could tell that she had not informed the\npeople at the manor yet. This meant that Shaun"
      },
      {
        "paragraph": "had told them."
      },
      {
        "paragraph": "On the way to the manor, he called Shaun, feeling upset. “Shaun, why can’t you wait for half a month?\nMust you be so hasty in telling my family about this matter?”"
      },
      {
        "paragraph": "Shaun said icily, “Are we close?”"
      },
      {
        "paragraph": "Rodney choked. “ Do you have to go this far? I’ve already told you that your memories will recover in\njust half a month.”"
      },
      {
        "paragraph": "Chapter 1943"
      },
      {
        "paragraph": "Shaun chuckled. “Rodney, you can say that so easily because it didn’t happen to you. Have you tried to\nunderstand the pain of losing my memories again and again? Have you tried understanding my\nfeelings of having the person I love wiped out from my mind and strangely substituted with another\nperson? Do you know how hopeless I felt that I wanted to kill myself when I realized the countless\nthings I’ve done that hurt Cathy? You don’t know anything.”"
      },
      {
        "paragraph": "Rodney was embarrassed about being accused. However, he could not help but retort, “You were the\none who failed Sarah first. Your relationship with Sarah used to be so good. You were her everything.\nYet, you fell in love with another woman during the years she went missing. No woman would not be\nalright with that.”"
      },
      {
        "paragraph": "“Aren’t you aware that she approached me with ulterior motives?” Shaun asked in disbelief."
      },
      {
        "paragraph": "“ I don’t think so. Sarah was so young at that time. How would she be so scheming? You lost your\nmemories, so you got to know many things from Catherine. Catherine hates Sarah. What she told you\nmight not be true.”"
      },
      {
        "paragraph": "Rodney said, “Sarah was wrong in the sense that she shouldn’t have hypnotized you to forget about\nCatherine. However, you have to understand that a woman will bear hatred out of love. But in the end,\nshe still wants to help you with recovery.”"
      },
      {
        "paragraph": "Shaun almost went insane with anger. “Enough. I don’t want to listen to your voice anymore. Rodney,\nfrom today onward, our friendship is over. I no longer have you as a friend.”"
      },
      {
        "paragraph": "After he spoke, he hung up furiously."
      },
      {
        "paragraph": "Rodney was infuriated as well, and he punched the steering wheel out of exasperation."
      },
      {
        "paragraph": "All he wanted was to compensate Sarah. Why did nobody understand him?"
      },
      {
        "paragraph": "No matter if it was his wife or his best friend, every one of them was breaking up with him. Could they\ngive it a rest?"
      },
      {
        "paragraph": "In the Hill family’s manor."
      },
      {
        "paragraph": "After Shaun hung up the call, Catherine saw him taking his suit off and throwing it on the bed hard. His\nhandsome face was filled with anger."
      },
      {
        "paragraph": "She had never seen him being so angry before. “Are you… really ending things with Rodney?”"
      },
      {
        "paragraph": "“Mm.”"
      },
      {
        "paragraph": "Shaun rubbed his temples with a cold expression."
      },
      {
        "paragraph": "Catherine pouted. “You’ve fought with Rodney for Sarah’s sake in the past too. Both of you didn’t\ncommunicate for a while, but you guys made up afterward.”"
      },
      {
        "paragraph": "“Really?” Shaun said indifferently. Since Catherine mentioned it, that memory did seem quite familiar.\nAll of a sudden, he held his head with his hands."
      },
      {
        "paragraph": "Catherine looked at him worriedly. “What’s wrong?”"
      }
    ]
  },
  {
    "title": "Chapter 1940 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“ Something flashed through my mind just now, ” Shaun said in a low voice. “I think I’m really about to\nrecover my memories.”"
      },
      {
        "paragraph": "Catherine got nervous when she heard it. She had almost given up on Shaun recovering his memories.\nShe did not even know how he would be after he regained his memories. “Even if you recover your\nmemories, you can’ t let Sarah off the hook. More importantly, you can’t go soft-hearted on her.”"
      },
      {
        "paragraph": "“Don’t worry. I won’t repeat the same mistake. ” Shaun’s gaze was icy. “No matter what, my relationship\nwith Rodney can never go back to what it used to be after this time. He’s not a despicable, two-faced\nperson, and he’s not evil either. But when he gets hot-headed to defend Sarah, he will never think\nabout the hurt other people have gone through before, and that’s disappointing.”"
      },
      {
        "paragraph": "Catherine was taken aback. After a long time, she said, “Maybe your thoughts are the same as Freya’s\nnow. However, Freya is more pitiful. She’s Rodney’s wife, and she has given birth to his child, but she’s\nnot even as important as Sarah.”"
      },
      {
        "paragraph": "“Rodney is hopeless.”"
      },
      {
        "paragraph": "Shaun said indifferently, “Although they say that marriage should be the last thing to break, I am fully\nsupportive if Freya wants to divorce Rodney. There’s no need to stay with a person like him and waste\nher youth away.”"
      },
      {
        "paragraph": "Catherine nodded. She was furious too."
      },
      {
        "paragraph": "Freya was her best friend. Indeed, she may be silly sometimes, but she was younger, prettier, and\nkinder than Sarah."
      },
      {
        "paragraph": "She was so much better than Sarah."
      },
      {
        "paragraph": "Rodney must have a loose screw in his head. “If you reveal this matter to Old Master Snow, will he\nchase Rodney out of the family again out of anger like the last time? It’ll be great if he does so.”"
      },
      {
        "paragraph": "Shaun glanced at Catherine with mixed feelings. “ That’s impossible. Back then, Rodney was a person\nwith no abilities in the Snow family members’ eyes. But things are different now. They’ve given him the\nchance to spread his wings. If… the Snow family can’t stop him, there is nothing we can do.”"
      },
      {
        "paragraph": "Catherine was speechless. She got even more infuriated."
      },
      {
        "paragraph": "She admitted that she had her selfish reasons. She just wanted to see Rodney lose everything for\nSarah’s sake again. By then, he would be wagging his tail pitifully and apologizing to Freya."
      },
      {
        "paragraph": "Fine. That was reality, after all."
      },
      {
        "paragraph": "At the Snow family’s manor."
      },
      {
        "paragraph": "As soon as Rodney walked in, he saw that everyone in the main family had already arrived."
      },
      {
        "paragraph": "Old Master Snow was sitting at the head seat. On his left and right were Prime Minister Snow and his\nwife, as well as Jason and his wife. In the following seats were Ryan, Jessica, and Carson."
      },
      {
        "paragraph": "Rodney’s heart sank. This scene made him recall the time they chased him out of the Snow family."
      },
      {
        "paragraph": "Bang."
      },
      {
        "paragraph": "Old Master Snow smashed a fine teacup on the ground. The glass shards flew across the bottom of\nRodney’s pants."
      },
      {
        "paragraph": "“Kneel.” Old Master Snow was enraged."
      },
      {
        "paragraph": "Rodney could only bite the bullet and kneel on the floor while avoiding the glass."
      },
      {
        "paragraph": "Upon seeing that, Old Master Snow flew into a fury. He stepped forward and kicked Rodney in the\nchest. “You’re like a leopard that never changes its spots.  I thought that you’ve really changed for\ngood, so I gave you chances and supported you. How dare you keep Sarah behind my back? Do you\nthink you’re being fair to your wife and your child? Why does the Snow family have someone like you?”"
      },
      {
        "paragraph": "Jason said disappointedly, “No one in the Snow family has kept a mistress before. Look at you. Your\nchild hasn’t even been born for 1oo days, and you’re already keeping Sarah out there. Have you ever\nthought of your wife’s feelings?” “Grandpa, Dad, nothing is going on between Sarah and me. I just think\nshe’s pitiful since she has no one to rely on. But I’m thinking of sending her overseas after half a\nmonth.” Rodney clutched his chest that was in pain and said, “I remember everything that you have\ntaught me. I will never do anything that’ll betray Freya.”"
      }
    ]
  },
  {
    "title": "Chapter 1941 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Pitiful?” Prime Minister Snow smiled coldly. “ Sarah endangered Titus’s wife and harmed your best\nfriend, yet you still think she’s pitiful?”"
      },
      {
        "paragraph": "“Uncle Nathan, you don’t have evidence on that. Besides, Sarah told me that Wesley coerced her into\ndoing those things. Her whole body is covered in wounds from Wesley’s whipping. She’s very pitiful.”"
      },
      {
        "paragraph": "Rodney raised his head and retorted, “Even if you’re the prime minister, you don’t have the right to\narrest people when you don’t have evidence.”"
      },
      {
        "paragraph": "“You…” Prime Minister Snow pointed his finger at Rodney. Deep fury welled up in his eyes. “You’re\nutterly hopeless.”"
      },
      {
        "paragraph": "“So… You’re still not willing to hand over Sarah, right?” Old Master Snow looked at Rodney, his gaze\nintimidating."
      },
      {
        "paragraph": "“I said I would send her overseas half a month later.”"
      },
      {
        "paragraph": "Rodney insisted till the end."
      },
      {
        "paragraph": "“Are you trying to go against the family for that woman again, like the last time?” Jason was unhappy.\n“Rodney, you should know that we have high hopes for you. Is it worth doing this just for a woman?”"
      },
      {
        "paragraph": "“Dad, this isn’t about whether it’s worth it or not. I’ve never done anything that betrayed all of you and\nmy wife. I’m certain of that. As my family, why can’t you understand me?”"
      },
      {
        "paragraph": "Rodney was disappointed too. “It would be one thing if it were other people, but another since you are\nmy family. Besides, if it weren’t for Sarah’s sacrifice, I would never have been able to return to the\nSnow family. She was the one who reunited us. She didn’t want you to lose me, your son.”"
      },
      {
        "paragraph": "Wendy laughed in exasperation. “Do I have to thank her for this?”"
      },
      {
        "paragraph": "Rodney pressed his lips together. “There’s no need for that. I’ll give her some money. I can only do this\nmuch for her.”"
      },
      {
        "paragraph": "“You’re beyond saving.” Old Master Snow rapped the floor furiously with his walking stick."
      },
      {
        "paragraph": "“Grandpa, don’t worry. I’ll take care of my personal matters. I’ll do well in my job too.” Rodney raised his\nhead and said, “The project that you’ve handed over to me already has great progress. I’m assuming\nCarson must’ve told you that Country Y is intending to collaborate with us in a 300-billion- dollar\nmegaproject.”"
      },
      {
        "paragraph": "Old Master Snow was speechless as he glared at Rodney with mixed feelings."
      },
      {
        "paragraph": "He disliked his grandson’s personal life, but Rodney was pretty capable in the business world."
      },
      {
        "paragraph": "After a long time, Old Master Snow said tiredly, “ I hope you’ll keep your word. I’ll give you half a month\nto send Sarah away. Don’t make Freya sad.”"
      },
      {
        "paragraph": "“Thank you, Grandpa.” Rodney was about to get up in delight."
      },
      {
        "paragraph": "“ Stay down, ” Old Master Snow scolded. Then, he walked away with the support of his walking stick."
      },
      {
        "paragraph": "The Snow family members left one after another with grim expressions. Ryan was the only one who\nwas slow to leave, and he stopped in front of Rodney. “Do you really think that you’re not in the wrong\nat all? Can you live up to your conscience? Can you live up to your wife and daughter?”"
      },
      {
        "paragraph": "“Of course, ” Rodney replied without hesitation. “ Ryan, I know you have feelings for my wife. But you\nshould just give up. She’ll never be together with you.”"
      },
      {
        "paragraph": "“I really feel sorry for Freya.”"
      },
      {
        "paragraph": "Ryan shook his head lightly. He could not help an unrepentant person. With that, he left in long strides."
      },
      {
        "paragraph": "At night, Ryan, Prime Minister Snow, and his wife were heading back to the official residence in a\nbulletproof car."
      },
      {
        "paragraph": "The prime minister’s wife, Heidi, rubbed her temples. “Why can’t Rodney see through it all? Sarah isn’t\na simple woman. Will she leave so easily? Why did she come back all of a sudden? If it isn’t because\nshe has her eyes on Rodney’s current identity. You guys must keep an eye on Rodney for the next half\na month. They’re a man and a woman. Sarah can never get pregnant with his child.”"
      },
      {
        "paragraph": "Ryan’s eyes were filled with mockery. “Rodney’s feelings are already biased toward Sarah. As long as\nSarah is feeling uncomfortable, he’ll rush over immediately. Who can control him? His legs are his\nown.”"
      }
    ]
  },
  {
    "title": "Chapter 1942 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“No matter what, Sarah cannot enter the Snow family,” Nathan said in a stern voice."
      },
      {
        "paragraph": "Heidi nodded in agreement. “That kind of person will ruin the Snow family’s reputation. She might even\nbury a bomb for the Snow family.”"
      },
      {
        "paragraph": "“So… You’re saying that we don’t have to care about Rodney and have Freya continue to be the young\nmadam? If Sarah happens to get pregnant,"
      },
      {
        "paragraph": "Rodney can keep her outside as his mistress?” Ryan suddenly asked sternly."
      },
      {
        "paragraph": "Nathan and his wife fell silent."
      },
      {
        "paragraph": "That scene made Ryan shudder inexplicably. “ Haven’t you both thought about Freya at all?”"
      },
      {
        "paragraph": "After a long moment of silence, Nathan sighed and said, “Sometimes, we’ll gain some things and lose\nsome things as well.”"
      },
      {
        "paragraph": "“What did Freya gain?”"
      },
      {
        "paragraph": "Ryan turned to look at his father. “Getting an identity as your goddaughter? But you’re the prime\nminister. You should know that many people are clear as to why you took her in as your goddaughter.\nMom, you must’ve heard a lot of rumors when you attend those banquets too. Canberra is  huge,  but\nnot many respect her."
      },
      {
        "paragraph": "“Moreover, when Senator Mead was rebelling, most of us knew the truth. But we never told Freya\nbecause we wanted to make her bait to deceive Senator Mead. We allowed Senator Mead’s men to\nmonitor her every moment, which made her frightened and worried during her pregnancy.”"
      },
      {
        "paragraph": "Nathan was rendered speechless, and Heidi sighed. “She really has gone through a lot for that.”"
      },
      {
        "paragraph": "“That’s not the only incident. ” A hint of sarcasm flashed across Ryan’s expression. “Back then, when\nyou guys wanted to separate Sarah and Rodney, all of you thought Freya was nice, so you made her\npregnant. After she was pregnant, you acknowledged her as your goddaughter to make her stay\nwillingly. Then, she chose to get married to Rodney for the sake of the Snow family’s reputation. Now,\nyou guys want her to sacrifice again because you’re afraid of Sarah marrying into the Snow family.”"
      },
      {
        "paragraph": "Ryan’s words did make Nathan quite ashamed. “ Ryan, this isn’t my intent alone. It’s the Snow family’s\nintent. Do you understand?”"
      },
      {
        "paragraph": "“I do. That’s why I’m telling you guys about this in private, ” Ryan said."
      },
      {
        "paragraph": "Heidi was puzzled. “Why are you speaking for Freya today? Did she… say anything to you?”"
      },
      {
        "paragraph": "“Mom, if you were Freya, would you stay with Rodney?” Ryan asked all of a sudden."
      },
      {
        "paragraph": "Heidi was silent. Of course, she would not."
      },
      {
        "paragraph": "She would even slowly torture Rodney and Sarah."
      },
      {
        "paragraph": "Ryan said sympathetically, “Freya isn’t Sarah’s opponent at all, and I reckon Sarah has no intentions of\nleaving Australia too. Once she gets pregnant, she’ll have many ways to keep Rodney by her side. You\ncan see it for yourselves now, much less the future. During the questioning just now, Rodney had no\nconsideration for Freya at all. As time passes, Freya will be left to take care of the"
      },
      {
        "paragraph": "child in the villa alone. Then, her wonderful youth as a woman will be ruined."
      },
      {
        "paragraph": "“The worst is that Freya will be forced into a dead end. She hates Sarah. No one hates Sarah more\nthan she does, and she’ll despise Rodney. If that goes on, she’ll fall into depression. What about\nRodney?"
      },
      {
        "paragraph": "Since he has a nice woman out there, it’ll be even less likely for him to go home to a woman who hates\nhim.”"
      },
      {
        "paragraph": "“What you said… is quite possible.” Heidi nodded. Sometimes, women knew each other better. “ Did\nFreya look for you to tell you that she wants to divorce Rodney?”"
      },
      {
        "paragraph": "Ryan nodded. “I’ve asked her that. She’s very determined, and… very disappointed. She cried a lot in\nthe evening too. But at that time, Rodney had no time to care about her at all. All he cared about was\naccompanying Sarah.”"
      },
      {
        "paragraph": "“Oh, Rodney…” Heidi shook her head in disappointment."
      }
    ]
  },
  {
    "title": "Chapter 1943 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Ryan made use of the opportunity immediately. “ Dad, Mom, Freya is your goddaughter after all."
      },
      {
        "paragraph": "Won’t it be embarrassing for you guys if she ends up in a bad situation?”"
      },
      {
        "paragraph": "Nathan’s brows were knit in a tight frown. He was seemingly wavering."
      },
      {
        "paragraph": "When Ryan saw that, he added, “Dad, you’re the person I admire the most in my life, and you’ve\nachieved the position that you wanted. But how many people have you and Grandpa plotted against all\nthese years? Can’t we be kinder sometimes?"
      },
      {
        "paragraph": "After all, you once said you took up this position because you wanted to make the lives of Australia’s\ncitizens better. Isn’t Freya your citizen as well?"
      },
      {
        "paragraph": "Please don’t let authority blind you.”"
      },
      {
        "paragraph": "Nathan’s heart thumped. He looked toward his son, who was at his side. “I didn’t do that just for myself.\nI’m paving a path for you too.”"
      },
      {
        "paragraph": "Ryan shook his head indifferently. “You and Grandpa have set your thoughts too far. The position of\nprime minister isn’t hereditary. It doesn’t mean that your son will take the position after you. If you have\nsuch thoughts, I’ll think that you’ve changed. You’ve become like the kings of the past, greedy and\nselfish.”"
      },
      {
        "paragraph": "“Ryan… How can you say that about your father?” Heidi saw Nathan’s dark expression and told Ryan\n“Dad, what I said is the truth. Such are humans. When we’re at the bottom of the mountain, we think\nthat the view at the top is better. But after we climb up with all our might, we think that the view on\nanother taller mountain is better. Ambitions are like a bottomless pit.”"
      },
      {
        "paragraph": "Ryan’s clear eyes gazed at his father. “Are you starting to feel unsatisfied again now that you’re in the\nposition of prime minister?”"
      },
      {
        "paragraph": "Nathan was shocked."
      },
      {
        "paragraph": "It seemed like his son had pointed out something that he did not realize himself."
      },
      {
        "paragraph": "“Dad, no family will last at the top forever. If I can’t assume the position of prime minister in the  future,\nthat only means that I’m incapable. There are other people who’re better than me, and I’ll accept it\nwholeheartedly. I believe that that person will do better than me too.”"
      },
      {
        "paragraph": "Ryan smiled. He was calm and direct. “I’ll do my best, but it’s okay even if I fail. There are benefits to\nbeing in a high and low position. Why do we have to be so fixated on it?”"
      },
      {
        "paragraph": "Nathan looked at his son. The calmness in Ryan’s eyes made him feel at ease all of a sudden."
      },
      {
        "paragraph": "He became relaxed as well."
      },
      {
        "paragraph": "“Maybe you’re right.” Nathan sighed and smiled. “ I’m already in my forties. I should be content with\ngoverning the country properly and accompany your mom and my family more.”"
      },
      {
        "paragraph": "“Yes. You’ll surely be remembered in history, ” Ryan said as he smiled sincerely."
      },
      {
        "paragraph": "“Look at you.” Nathan shook his head helplessly. “ Since Freya wants to get a divorce, I’ll do my best to\npersuade your grandpa.”"
      },
      {
        "paragraph": "Heidi nodded. “There’s indeed no need to ruin her life. But what’s troublesome is her daughter…”"
      },
      {
        "paragraph": "“Mom, the child can’t be left with Rodney. With Sarah’s evil personality, won’t she abuse the child if she\nand Rodney get married in the future?” Ryan said hastily."
      },
      {
        "paragraph": "“You have a point there. ” Heidi looked at her son and smiled. “What do you think we should do?”"
      },
      {
        "paragraph": "“It’s simple. Freya can stay in The Lodge. The child will follow and be under our watch. Then, everyone\ncan rest assured. If Uncle Jason and his wife miss their granddaughter, they can bring Dani over to live\nwith them when she’s a little older. But she can never have any contact with Sarah.”"
      },
      {
        "paragraph": "Ryan expressed his idea, which Heidi and Nathan agreed to."
      }
    ]
  },
  {
    "title": "Chapter 1944 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "In the villa."
      },
      {
        "paragraph": "When Freya was playing with Dani absent- mindedly, she received a Whatsapp message from Ryan.\n[I’ve persuaded my parents. Don’t worry. Just do whatever you want.]"
      },
      {
        "paragraph": "She was stunned for a few seconds."
      },
      {
        "paragraph": "It felt as if her cold heart was wrapped in a layer of warmth, and it made her eyes sting."
      },
      {
        "paragraph": "After a moment, she replied: [Thank you.]"
      },
      {
        "paragraph": "At dawn, Rodney drove back home. However, the master bedroom was locked, so he could only sleep\nin the guest bedroom."
      },
      {
        "paragraph": "When he woke up the next day, his knees were hurting."
      },
      {
        "paragraph": "Nevertheless, he still got up early in the morning to make a hearty breakfast."
      },
      {
        "paragraph": "When Freya arrived downstairs, she could smell the aroma of the breakfast laid on the table. Then, she\nglanced at Rodney, who was beside the dining table,"
      },
      {
        "paragraph": "looking like he wanted to please her. However, a hint of mockery washed over her."
      },
      {
        "paragraph": "In the past, it was these tricks of his that made her think he was a good man who was worth spending\nthe rest of her days with."
      },
      {
        "paragraph": "Thinking back, was a man who could cook a good man?"
      },
      {
        "paragraph": "Did her expectations stoop so low because of Patrick?"
      },
      {
        "paragraph": "“Wifey, it has been a night. Please don’t be mad. Look, I made your favorite pancakes and waffles…”\nRodney looked at Freya with a pitiful expression."
      },
      {
        "paragraph": "He was handsome, so when he blinked his eyes, people would usually go soft-hearted seeing it."
      },
      {
        "paragraph": "Freya sat down on the chair and ate breakfast."
      },
      {
        "paragraph": "Although she hated Rodney a lot, she could not let her stomach go hungry."
      },
      {
        "paragraph": "After all, she could only have the strength to fight after eating, right?"
      },
      {
        "paragraph": "When Rodney saw Freya eating the food he made, he was delighted. He thought she was not angry\nanymore. Therefore, he sat on the chair beside hers and said, “Wifey, my knees are hurting so badly.\nYesterday, my grandpa called me over and kicked me hard on my stomach. He made me kneel until\nmidnight before I could leave.”"
      },
      {
        "paragraph": "“Then?” Freya asked out of curiosity."
      },
      {
        "paragraph": "“I came back after that.” Rodney said jokingly,“ Freya, I really don’t know how you’re so charming. I’m\nGrandpa’s biological grandson, yet he always takes your side. You can’t imagine how angry he was.\nLuckily, I promised him that I’d definitely send Sarah away after half a month. Only then did his anger\nsubside a little, and he did not continue reprimanding me. Instead, he told me to  cherish you and live\nhappily with you.”"
      },
      {
        "paragraph": "Upon hearing Rodney’s words, Freya was so disgusted that she lost her appetite for her breakfast."
      },
      {
        "paragraph": "Her heart grew cold too."
      },
      {
        "paragraph": "Did Old Master let the matter slide by asking Rodney to kneel for a few hours even though he was\nkeeping Sarah out there?"
      },
      {
        "paragraph": "Ha! Rodney was the foolish one. However, would a person as wise as Old Master Snow think that\nSarah would be sent away willingly?"
      },
      {
        "paragraph": "Would Jason and Wendy not know as well?"
      },
      {
        "paragraph": "Or they might have accepted the fact that there was nothing they could do about it. When the time\ncame, Freya could be the legal wife while Sarah was the mistress."
      },
      {
        "paragraph": "Luckily, Ryan had analyzed the situation for Freya yesterday. Although the Snow family treated her well\nand had always taken her side when she and Rodney fought, they were all cunning people. The\nfamily’s benefit was always the top priority for them."
      },
      {
        "paragraph": "“Wifey, I know I lied to you lately. I was wrong. I guarantee that I won’t go to Sarah’s place anymore\nthese days. Let me drive you and Dani on a trip to the nearby manor for a few days, ” Rodney said with\nexcitement."
      },
      {
        "paragraph": "“I’ll pass.”"
      },
      {
        "paragraph": "Freya put down her fork. “You can go to work.”"
      },
      {
        "paragraph": "“Don’t be like that. Let’s go get some fresh air, okay?” Rodney went over to hold her hand."
      },
      {
        "paragraph": "However, Freya withdrew her hand and went upstairs with a cold expression."
      },
      {
        "paragraph": "Rodney looked at her from behind. His enthusiasm dwindled."
      },
      {
        "paragraph": "Aunty Cally consoled him. “Women will always stay angry for a few days, especially since you two had\nsuch a big fight yesterday. She needs time to cool down. ”"
      }
    ]
  },
  {
    "title": "Chapter 1945 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“I see.”"
      },
      {
        "paragraph": "Rodney’s anxiety melted away."
      },
      {
        "paragraph": "At first, he did not plan on going to work. However, Carson soon gave him a call, asking him over to\nsign a document."
      },
      {
        "paragraph": "Since he did not have much to do at home, he went over."
      },
      {
        "paragraph": "The minute he arrived in the office, he received a call from Aunty Cally. “Oh no, Young Master Snow.\nMiss Jones came over just now to help Young Madam to pack her luggage. Then, Young Madam took\nher luggage and left along with Dani. Before she left, she said she’ll never return.”"
      },
      {
        "paragraph": "Rodney stood rooted to the ground, stunned. Only after a while did he hurriedly dial Catherine’s\nnumber. It turned out that she had blocked his number, and so had Freya."
      },
      {
        "paragraph": "Indeed, he panicked, but he was not in sheer panic."
      },
      {
        "paragraph": "Every time Freya left the house after arguing with him, she would head to Brighton Gardens and stay\nthere."
      },
      {
        "paragraph": "Anyway, he knew the password of the Brighton Gardens’ gate."
      },
      {
        "paragraph": "If worse came to worst, he would move there. It did not matter where he lived as long as he had his\nwife and child with him."
      },
      {
        "paragraph": "Hence, he headed to the office to sign the document before rushing to Brighton Gardens."
      },
      {
        "paragraph": "However, he entered the apartment, only to find it empty. There was no sign of Freya."
      },
      {
        "paragraph": "Assuming that she had moved to the Hill family’s manor, Rodney swiftly drove there."
      },
      {
        "paragraph": "Nevertheless, the security guard at the gate stopped him."
      },
      {
        "paragraph": "“Don’t you know who I am? I used to come here very often. Please, open the gate. I want to see my\nwife, ” Rodney said to the guard."
      },
      {
        "paragraph": "The guard looked embarrassed. “I, of course, know who you are, Young Master Snow.  But  Young\nMaster Hill said he has… nothing to do with you anymore. He has told me not to allow you in.”"
      },
      {
        "paragraph": "Exasperated, Rodney widened his eyes. “Is Shaun out of his mind? Does he have to do this just\nbecause of the personal vendetta among those women? Please, open the gate. I’m going to talk to\nShaun about it.”"
      },
      {
        "paragraph": "“I’m sorry. Please don’t make things difficult for me.” The guard was helpless. “But honestly, Ms. Lynch\nis not here.”"
      },
      {
        "paragraph": "“That is impossible. She’s not home, and since Catherine is her best friend, where else in Canberra\ncan she be if not here?” Rodney was in total disbelief."
      },
      {
        "paragraph": "“Young Master Snow, I’m telling you the truth. If you don’t believe me, you can check it for yourself.”\nThe guard closed the window and ignored him."
      },
      {
        "paragraph": "Rodney said furiously, “Tell Shaun that he’ll never be able to step foot into the Snow family’s house if\nhe doesn’t allow me in today.”"
      },
      {
        "paragraph": "With that, he drove away in a huff."
      },
      {
        "paragraph": "If Freya was not here, then could she have gone back to Melbourne?"
      },
      {
        "paragraph": "Rodney promptly called Freya’s mother. “Mrs. Lynch, how have you been lately? Are you well? Would\nyou like to come to Canberra to spend some time with us? Freya misses you quite badly…”"
      },
      {
        "paragraph": "“Forget it. You don’t have to worry about my health. ” Mrs. Lynch said indifferently, “After all, Freya\nmight not have anything to do with you anymore.”"
      },
      {
        "paragraph": "Rodney froze. It turned out that Freya had told tales about him in front of her parents so soon."
      },
      {
        "paragraph": "“Mrs. Lynch, what are you saying? Freya and I are just having a minor conflict…”"
      },
      {
        "paragraph": "“Minor conflict?” Mrs. Lynch got infuriated. However, with her good manners, she managed to hold\nback her fury. “ So that’s a minor conflict to you, huh? I finally see why Freya is determined to divorce\nyou.”"
      },
      {
        "paragraph": "Determined? Rodney’s heart sank."
      },
      {
        "paragraph": "He was under the impression that Freya’s anger would subside after another night."
      },
      {
        "paragraph": "He was under the impression that he could coax Freya into returning home like he previously did when\nshe left the house."
      },
      {
        "paragraph": "“Mrs. Lynch, it really was a misunderstanding. I like her. As you know, there have been a few times\nwhen we wanted a divorce, but we never did.” Rodney begged Mrs. Lynch in a deep voice, “Please\nhelp me persuade her. For the sake of Dani, our relationship can’t break down.”"
      }
    ]
  },
  {
    "title": "Chapter 1946 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“You want me to persuade Freya when you’re having an affair with another woman?”"
      },
      {
        "paragraph": "Mrs. Lynch had never been so infuriated. “And that woman is none other than Sarah. You’ve humiliated\nmy daughter so much for Sarah’s sake. After you got engaged with Freya last year, you became her\nfiancé. Yet, you always spent time with Sarah, causing my daughter to become an object of ridicule.\nWhat’s worse, you’re even keeping Sarah when you’re married. Don’t tell me that you’ve never done it\nwith her. As far as I know, no married man would keep their ex who isn’t related nor romantically\ninvolved with them.”"
      },
      {
        "paragraph": "“I’m innocent.” Rodney felt aggrieved."
      },
      {
        "paragraph": "Mr. Lynch immediately snatched Mrs. Lynch’s phone away and said in a firm voice, “At this point, you\nstill don’t realize that you’ve wronged my daughter. You really are a lost cause. I’ve lost hope in a son-\nin-law like you, no matter how capable you are of making money. Honestly, I’ve never quite liked you\nfrom the beginning, so it’s good that both of you get a divorce. The Lynches will be there for Freya, and\nshe can find a better person. Please stop pestering her. ” He hung up right after he finished speaking."
      },
      {
        "paragraph": "By the time Rodney called back, his number had been blocked."
      },
      {
        "paragraph": "He was extremely glum. He was not sure if Freya had returned to Melbourne."
      },
      {
        "paragraph": "As such, he had no choice but to get the Snowden members to search for her."
      },
      {
        "paragraph": "Within less than half an hour, they brought him news that Freya had gone to The Lodge."
      },
      {
        "paragraph": "Rodney was stunned. Why was she at The Lodge?"
      },
      {
        "paragraph": "Although Freya was his uncle’s goddaughter, her relationship with his uncle might not be as close as\nwith his parents."
      },
      {
        "paragraph": "Anyhow, The Lodge was slightly safer than other places."
      },
      {
        "paragraph": "Hence, he promptly drove there."
      },
      {
        "paragraph": "The Lodge had tight security. Even so, he was allowed to enter since the security guard knew him."
      },
      {
        "paragraph": "After going past the garden, he arrived at the east courtyard, where he spotted Heidi in a formal dress.\nHowever, he did not see Freya."
      },
      {
        "paragraph": "“Aunty Heidi, where is Freya?” Rodney asked directly. “I heard she came here.”"
      },
      {
        "paragraph": "“I’ve asked the servant to help her settle down in the building at the back.” Heidi then ordered the\nservant, in a dignified manner, to prepare some coffee. Then, she pointed to the couch. “Take a seat.”"
      },
      {
        "paragraph": "Rodney had always perceived Heidi as an easy- going aunt ever since he was a child."
      },
      {
        "paragraph": "Nevertheless, he treated her with great respect. Compared to his mother, Wendy, his mood was\ndifferent when he faced an elder like Heidi."
      },
      {
        "paragraph": "Wendy, his biological mother, had pampered him since he was young. No matter how bitterly they\nrowed, they would make peace with each other the next day. However, Heidi was the prime minister’s\nwife, so Wendy’s presence could not compare to hers."
      },
      {
        "paragraph": "“Why did you put her in that building?” Rodney was upset because the building at the back was close\nto the south building, where Ryan was staying. Moreover, the two buildings shared the same garden."
      },
      {
        "paragraph": "“Why not?” Heidi laughed before she said pensively, “The environment here is much better than your\nplace.”"
      },
      {
        "paragraph": "“That’s for sure. My place can’t compare with The Lodge. Well… Aunty Heidi, why don’t you let me \nstay here as well?” Rodney said shamelessly, “It’s so spacious here. I can stay in the same building as\nFreya, and I won’t be here for long. We’ll leave once her anger subsides.”"
      },
      {
        "paragraph": "Coincidentally, the servant brought the coffee over at this moment."
      },
      {
        "paragraph": "Heidi took the cup and swirled it gently, with her eyes lowered. “Rodney, up to this point, do you really\nthink that Freya is just angry?”"
      }
    ]
  },
  {
    "title": "Chapter 1947 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“It’s normal for married couples to quarrel, ” Rodney said awkwardly. “Didn’t you and Uncle quarrel\nbefore too?”"
      },
      {
        "paragraph": "“But your uncle wasn’t involved with his ex. When I was younger, I did suspect him. However, it was all\njust hearsay.”"
      },
      {
        "paragraph": "Heidi sipped her coffee to soothe her stomach before saying in a serious tone, “Rodney, Freya is\nserious about divorcing you. She’s not kidding nor forcing you to do something. She’s determined to do\nthat because she’s frustrated.”"
      },
      {
        "paragraph": "Rodney’s heart sank, and a rush of helplessness overcame him. “Aunty Heidi, please help me to talk\nher out of it. I’ve never betrayed her. Why does she have to take it so far? Getting a divorce won’t be\ngood for our child. Can’t she think for the sake of our child?”"
      },
      {
        "paragraph": "Heidi frowned. Although this nephew of hers sounded anxious, he was also seemingly blaming Freya\nfor not being understanding."
      },
      {
        "paragraph": "Indeed, Rodney was self-willed and tended to drive himself into a blind alley. However, Heidi did not\nexpect him to be so extreme."
      },
      {
        "paragraph": "“I won’t talk her out of it.”"
      },
      {
        "paragraph": "Heidi shook her head. “In fact, I heard the conversation between you and your grandpa from the side\nyesterday. Women are different from men. Although you think that nothing happened between you and\nSarah, which means that you’ve never betrayed Freya, Freya might not think so."
      },
      {
        "paragraph": "This is the cause of your conflict with Freya. Apart from this issue, there’ll be more things to argue over\nin the future. It’s because Freya is aware of this point that she initiated the divorce."
      },
      {
        "paragraph": "“Since you guys aren’t meant to be together, there’s no point staying together reluctantly. The silent\ntreatment and quarrels in the future will make the child suffer. You guys might as well sit down and talk\nit out to ensure a better future for the child.”"
      },
      {
        "paragraph": "“To ensure a better future for the child, we can’ t get a divorce.”"
      },
      {
        "paragraph": "Rodney raised his voice and became agitated. “ Aunty Heidi, you’re my aunt. Why are you persuading\nme on her behalf at a time like this?”"
      },
      {
        "paragraph": "“Look. No matter how much I’ve explained to you, you don’t  seem to see eye to eye with me. I’m \ntalking sense to you, yet you think you’re right. Do you act the same when you communicate with\nFreya?”"
      },
      {
        "paragraph": "Heidi put down the cup and said solemnly, “Do you know what an ex means? An ex is someone you\ncan never contact after you get married. If you see her on the street, you must walk away as far as you\ncan. What’s more, this ex of yours has embarrassed Freya many times.”"
      },
      {
        "paragraph": "“I said I’ll send her away. ” Rodney was annoyed at why nobody could understand him."
      },
      {
        "paragraph": "Heidi said impatiently, “Whatever. No matter whether you send her away or not, Freya is determined to\ndivorce you.”"
      },
      {
        "paragraph": "“Aunty Heidi, does that mean you’re taking her side?” Rodney asked in disbelief."
      },
      {
        "paragraph": "“ She’s my goddaughter , so why can’t I side with her?” Heidi said, “Honestly, I think Freya and I have\nan affinity.”"
      },
      {
        "paragraph": "“But it was because of me that you had no choice but to acknowledge her as your goddaughter. You\neven disagreed—”"
      },
      {
        "paragraph": "“I disagreed only because I didn’t know her well.” Heidi interrupted him. “After getting along with her, I\ncan tell that she’s an honest and dutiful woman. Given that I’m the prime minister’s wife, a lot of people\nhave been wanting to butter me up, but she has never done this. She has never done anything out\nthere using my name either.”"
      },
      {
        "paragraph": "Heidi rose to her feet. “Her parents raised her very well and provided her with a blissful family. She’s\nnot greedy. She’s self-motivated and has her own boundaries. Hence, your uncle and I have decided to\nrespect her instead of forcing her.”"
      },
      {
        "paragraph": "Rodney panicked at the sight of Heidi’s resoluteness."
      },
      {
        "paragraph": "“Even if you and Uncle agree on our divorce, it’s no use. Freya won’t be able to do anything if I\ndisagree. My parents and grandpa won’t agree as well.”"
      },
      {
        "paragraph": "Rodney was not in the mood to carry on with the conversation. “ I’m going to discuss it with Freya.”"
      },
      {
        "paragraph": "However, the two bodyguards in front stopped him."
      }
    ]
  },
  {
    "title": "Chapter 1948 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Go back and calm yourself down. The Lodge isn’t a place for you to kick up a fuss.” Although Heidi’s\ntone was gentle, her eyes were fierce."
      },
      {
        "paragraph": "After glancing around for a moment, he turned around and left in a huff."
      },
      {
        "paragraph": "Ryan walked down the stairs from the second floor with his hand on the handrail. “Mom, was what I\nsaid right? He’s hopeless.”"
      },
      {
        "paragraph": "Heidi sighed in despair. “If he weren’t your cousin, I wouldn’t have explained to him so patiently. I really\nhave no idea when he became like this."
      },
      {
        "paragraph": "Although he was naughty when he was young, he would listen to reason.”"
      },
      {
        "paragraph": "“He has been behaving like this ever since he fell for Sarah. ” Ryan let out a sigh. “ I’m going to the\nback to see if Freya needs anything.”"
      },
      {
        "paragraph": "“Mm.” Heidi nodded before she said pathetically, “ She’s quite pitiful. You should give her some advice.”"
      },
      {
        "paragraph": "After nodding, Ryan headed to the courtyard behind."
      },
      {
        "paragraph": "There were over ten buildings in the prime minister’s residence."
      },
      {
        "paragraph": "The front courtyard was Nathan’s workplace, whereas the back courtyard was for his family to reside."
      },
      {
        "paragraph": "The residence was spacious, with three gardens and two lakes. Freya’s building happened to be close\nto the lake."
      },
      {
        "paragraph": "The moment Ryan arrived at the door, he heard Dani crying."
      },
      {
        "paragraph": "Freya soothed the child while carrying her in her arms. Beside her was Aunty Loretta, a sitter who was\nnewly hired by The Lodge."
      },
      {
        "paragraph": "“Now that we’ve moved to a new place, Dani might not be used to waking up here, ” Freya said\nhelplessly. “What’s more, she just met Aunty Loretta today. But she’ll be fine in a few days.”"
      },
      {
        "paragraph": "Ryan looked at the child, whom he had seen twice in the Snow family’s residence, and noticed a huge\nchange in her. She was now like a doughnut, extremely adorable."
      },
      {
        "paragraph": "However, at the thought that her parents were getting a divorce, he felt for her."
      },
      {
        "paragraph": "In truth, the child would be the one suffering."
      },
      {
        "paragraph": "As her father, Rodney’s behavior was too immature."
      },
      {
        "paragraph": "Back when Freya was pregnant, he wanted her to abort the child for the sake of Sarah. Now that the\nchild was born, he was still thinking about Sarah."
      },
      {
        "paragraph": "Amid his thoughts, Ryan stretched out his hands. “ Come, let me hold her.”"
      },
      {
        "paragraph": "“Do you know how to hold her?” Freya looked doubtful. Her dark eyes were filled with distrust."
      },
      {
        "paragraph": "Ryan found it funny. “What do you mean? I have a nephew who was very fond of me when he was\nyounger. I always held him.”"
      },
      {
        "paragraph": "Initially, Freya did not want to pass the bawling Dani to Ryan, but who knew Dani would take the\ninitiative to approach him after he reached out to her."
      },
      {
        "paragraph": "Freya was speechless."
      },
      {
        "paragraph": "“Look. Even Dani wants me to hold her. Your daughter might be young, but she has good taste. She\nknows I’m handsome.”"
      },
      {
        "paragraph": "Ryan smiled smugly and held Dani in his arms. After sitting down, he took out a yo-yo from his\ntrousers’ pocket and played with it in front of Dani."
      },
      {
        "paragraph": "“Look, Dani. Do you like it?”"
      },
      {
        "paragraph": "Dani widened her eyes and stopped crying after a while. She even started laughing."
      },
      {
        "paragraph": "Freya was dumbfounded."
      },
      {
        "paragraph": "Dani stopped crying, just like that?"
      },
      {
        "paragraph": "It usually took a long time to soothe this little princess at home."
      }
    ]
  },
  {
    "title": "Chapter 1949 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Aunty Loretta said with a grin, “Young Master is the best, to have had the ability to attract kids since he\nwas young.”"
      },
      {
        "paragraph": "Upon noticing Freya’s confused expression, Aunty Loretta said, “Madam’s relatives always bring the\nkids over here to play, and the kids love playing with Young Master the most. Young Master is very\npatient with them. If I were to deal with those little devils, I’d feel troubled.”"
      },
      {
        "paragraph": "Freya was filled with mixed feelings as it was her first time seeing this side of Ryan."
      },
      {
        "paragraph": "“Are you very fond of kids?” She could not help but say, “ In fact, you’re not young anymore. You can\nget a girlfriend and have a child.”"
      },
      {
        "paragraph": "Ryan gave a vague smile. “Why are you behaving like my mom? I’m not even at the age where I need\nto get married.”"
      },
      {
        "paragraph": "Freya thought about it and reckoned that he was right. After all, he was a few months younger than her."
      },
      {
        "paragraph": "She was 26 this year. It was appropriate for women of this age in Canberra  to get married,  let alone\nmen. It would not be an issue for them to get married even at the age of 30."
      },
      {
        "paragraph": "“But you can get a girlfriend.” Freya said jokingly, “ That said, I’ve known you for nearly a year, but I\ndon’t see you have a girlfriend yet. Could it be that you’re gay?”"
      },
      {
        "paragraph": "Ryan’s mouth twitched. “What logic is that? I’m gay if I don’t have a girlfriend, huh? If women like you\ndon’t have a boyfriend, does it mean you’re a lesbian?”"
      },
      {
        "paragraph": "“Hehe. I’m just kidding.” Freya was somehow amused to see his speechless expression. “ I think the\nbest age is between 20 to 30 years old. This is when we have the most freedom. When it’s time to get"
      },
      {
        "paragraph": "into a relationship, just do it. Don’t miss out on your best years! ”"
      },
      {
        "paragraph": "After that, she sighed. “On the other hand, I’ve wasted mine.”"
      },
      {
        "paragraph": "“20 to 30 years old… You still have a few more years to go.” A discreet smile spread across Ryan’s\nface. “ Quickly get a divorce and start a new relationship. Make use of your youth before it’s gone.”"
      },
      {
        "paragraph": "“Women aren’t the same as men.” Freya shook her head and said rather pessimistically, “My love life\nhas been difficult. Since I always meet scummy men, I don’t believe in love anymore.”"
      },
      {
        "paragraph": "“You don’t have to be so pessimistic. Maybe the best is yet to come,” Ryan said thoughtfully."
      },
      {
        "paragraph": "“I don’t believe it.” Freya looked dejected. “All I want to do from now on is raise Dani. I don’t dare to get\nmarried again.”"
      },
      {
        "paragraph": "“Don’t be like this. When it’s time to get married, just do it.”"
      },
      {
        "paragraph": "Ryan hinted at her. “Think about it. Your first relationship failed because you were too young and\nignorant of the harsh reality. Not many relationships that started at college would last."
      },
      {
        "paragraph": "Then, you ended up marrying Rodney only by force. After giving birth to Dani, you continued with the\nmarriage for her sake. I believe that with my observation and your careful consideration, your next\nrelationship will be alright.”"
      },
      {
        "paragraph": "Freya was dumbfounded by his words. “You’re persuading me to get into another relationship when I\nhaven’t even gotten a divorce?”"
      },
      {
        "paragraph": "A gentle smile flitted across Ryan’s face. “A new relationship will help you get over your trauma. ”"
      },
      {
        "paragraph": "Freya blinked. No matter how well he said it, she was still afraid of men."
      },
      {
        "paragraph": "Hence, she changed the topic. “I’m going to the Snow family’s tomorrow to discuss my divorce.”"
      },
      {
        "paragraph": "“My mom and I will accompany you there.” Before she could speak further, Ryan interrupted her, “My\nmom has to be there, or it’ll be difficult to solve the issue.”"
      },
      {
        "paragraph": "Freya was stunned. “Why is she treating me so well? I…”"
      },
      {
        "paragraph": "“After having me, my mom accidentally got pregnant again. According to the ultrasound report, it was a\ngirl, but she had a miscarriage shortly after. The doctor then said that it’s hard for her to get pregnant\nagain, ” Ryan said helplessly. “After acknowledging you as her goddaughter , she feels like she has an\naffinity with you.”"
      },
      {
        "paragraph": "“I see.”"
      },
      {
        "paragraph": "Freya got the picture."
      },
      {
        "paragraph": "That night, she finally had a good sleep at The Lodge."
      },
      {
        "paragraph": "After leaving the villa, she felt as though she and Rodney were miles apart."
      },
      {
        "paragraph": "The next day, she went to the Snow family’s old residence with Heidi and Ryan by car."
      }
    ]
  }
]