[

  {
    "title": "Chapter 1400 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "One of the shop owners said to her, “Why don’t you look in the alley? There are a few shops there."
      },
      {
        "paragraph": "Maybe that person hasn’t gone there yet.”"
      },
      {
        "paragraph": "Catherine nodded. She was still familiar with Melbourne."
      },
      {
        "paragraph": "People rarely went into that alley. There were just a few elderly there maintaining their businesses in\ndilapidated stores."
      },
      {
        "paragraph": "She had not gone far inside when she saw a man in a black T-shirt surrounded by several hooligans."
      },
      {
        "paragraph": "“Hey, kid. You’re pretty rich. I saw that you bought all the wreaths in this area. You must have a lot of\nmoney, eh?” The leader grinned and swung the bat in his hands. “Leave the watch and your wallet\nbehind and we’ll let you go.”"
      },
      {
        "paragraph": "“This watch was given to me by my dad. It’s expensive. I can’t give it to you.” The man refused. He had\nan accent, and his pronunciation was not accurate."
      },
      {
        "paragraph": "Catherine raised her brows. She could immediately tell by the man’s voice that he was very young.\nMaybe he had just finished college. He must have grown up abroad, so he was not very familiar with\nEnglish."
      },
      {
        "paragraph": "Maybe his parents were from Melbourne and had not come back for a long time, so he wanted to visit\ntheir ancestors’ graves and pay respects."
      },
      {
        "paragraph": "He was so young, but he bought all the wreaths available for his deceased elders. He must be hoping\nthat they would live well in the afterlife."
      },
      {
        "paragraph": "Catherine had a good impression of the young man. “Haha, do you think you have a choice?” The\nruffian snorted. “You stinky brat, hurry up and"
      },
      {
        "paragraph": "hand the stuff over. Otherwise, you’ll have to crawl to leave.”"
      },
      {
        "paragraph": "“Mugging someone in broad daylight. I think you guys must be crazy. ” Catherine went over with a faint\nsmile."
      },
      {
        "paragraph": "Today, she wore a pair of ripped jeans, a white T- shirt, and a faded denim jacket. A pair of sunglasses\nhung from the bridge of her nose, making her look like she was in her early 2os at first glance."
      },
      {
        "paragraph": "Although her features were hidden by the glasses, it was clear that her face was beautiful with her\ndefined nose bridge and moderately thick lips. Even"
      },
      {
        "paragraph": "with the maple shade lipstick, she looked so bright and stunning that everyone was shocked."
      },
      {
        "paragraph": "Matthew Costner looked at her with a thumping heart."
      },
      {
        "paragraph": "For some reason, he felt that this woman gave him a familiar feeling. He had seen photos of Sheryl\nJones when she was young and thought that his mother was the most beautiful woman, but when he\nsaw this young woman in front of him, he suddenly found that her looks were not inferior to his\nmother’s."
      },
      {
        "paragraph": "Although he could not see her eyes, he felt that her eyes must be very beautiful too."
      },
      {
        "paragraph": "Rebecca was also a beauty. However, compared to the woman in front of him, Rebecca’s facial\nfeatures were completely overshadowed."
      },
      {
        "paragraph": "Catherine also looked at the young man in front of her."
      },
      {
        "paragraph": "She froze."
      },
      {
        "paragraph": "The young man was 6’2. His short hair made his mixed-raced facial features more defined, and he\nexuded an aura of arrogance and unruliness. His eyes were a shocking blue and looked very beautiful.\nThey were able to bewitch others."
      },
      {
        "paragraph": "With such looks, he would be the best-looking man no matter where he went."
      },
      {
        "paragraph": "It looked like he was only three or four years younger than her."
      },
      {
        "paragraph": "“Woah, where did this hot chick come from? She delivered herself right to our doorstep.” One of the\nruffian’s eyes brightened when he saw Catherine. “ Babe, why don’t you come home with me? I won’t\nrob him then.”"
      },
      {
        "paragraph": "“Beautiful damsel, hurry up and leave. I’ll stop them. ” Matthew raised his arm and shielded her behind\nhim."
      },
      {
        "paragraph": "The corners of Catherine’s mouth twitched."
      },
      {
        "paragraph": "What? Beautiful damsel? Which remote ravine did this guy crawl out from?"
      }
    ]
  },
  {
    "title": "Chapter 1401 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Enough. You’re trying to rob a foreigner in broad daylight? Don’t embarrass our people.” Catherine\npushed Matthew’s hand away and walked over slowly, snatching the wooden planks in the ruffians ‘\nhands and kicking them far away."
      },
      {
        "paragraph": "Those sharp movements made Matthew stunned."
      },
      {
        "paragraph": "She was already beautiful and tall, but when she fought, she exuded a heroic aura. Even though she\nwas fighting, the scene looked more like it was an art form to be appreciated."
      },
      {
        "paragraph": "With Matthew’s sharp eyes, it was easy for him to tell that her skills were just fancy and impractical."
      },
      {
        "paragraph": "What made him even more surprised was that this woman actually broke the arms of those ruffians.\nHer methods were clean and sharp."
      },
      {
        "paragraph": "“People like you will continue to commit robbery after you’re caught and locked up for a day. It’s better\nto just break your arms and let you recover for a few months. Let’s see how you’ll continue to rob\nothers. Scram! ”"
      },
      {
        "paragraph": "Catherine’s tone was light, but the ruffians were terrified when they looked at her beautiful face and\nimmediately got up before running away."
      },
      {
        "paragraph": "“Thank you. ” Matthew walked up to her. He had black hair, and a shrewd look flashed in his blue eyes.\n“Heroine, thank you for saving me."
      },
      {
        "paragraph": "Otherwise, I’d definitely have been robbed.” Heroine…?"
      },
      {
        "paragraph": "Catherine almost choked on her own saliva. “Kid, did you just transmigrate over?”"
      },
      {
        "paragraph": "Matthew was stunned. It was the first time someone called him that. If they were in Neah Bay, people\nwould have turned to look at Catherine in horror."
      },
      {
        "paragraph": "After all, she must be the first person to dare to call the prince of the Costner family ‘kid’."
      },
      {
        "paragraph": "“What did you call me?” he spoke a little incredulously. His accent made his voice sound even more\nmellow and charming."
      },
      {
        "paragraph": "“You look like you’re only 20.” Catherine sized him up."
      },
      {
        "paragraph": "“Yes, I’m 21 this year.” Matthew looked at her youthful face and was astonished. “You’re older than\nme?”"
      },
      {
        "paragraph": "“I’m a few years older than you, so you’re a kid to me.”"
      },
      {
        "paragraph": "Catherine glanced at the plastic bag in his hand that was carrying all the wreaths. The person who\nbought all the wreaths must be him. It was clear at a glance that the watch on his hand and the\npendant hanging from his neck were valuable, so it was no wonder that he was targeted by others. He\nlooked like a rich fool who just came back from abroad. “This is an old street where all sorts of\nhooligans hang around. You shouldn’t linger"
      },
      {
        "paragraph": "around these places while dressed like that. Hurry up and go back.” She said and left."
      },
      {
        "paragraph": "Since she could not buy wreaths, she would just offer the flowers she got."
      },
      {
        "paragraph": "“Heroine, pray tell thy name?” Matthew took large strides to catch up to her."
      },
      {
        "paragraph": "Catherine stumbled and almost fell. She was between laughter and tears. “Pray tell thy name? Are you\nliving in the Elizabethan era?”"
      },
      {
        "paragraph": "“Ahem. I like reading books written in that era. That’s how people used to talk, ” Matthew explained in\nembarrassment, “I thought… I just came to the country yesterday, so I don’t know much about the\nculture here.”"
      },
      {
        "paragraph": "“You already said that it was ancient times. This is the modern era. Just talk according to how you\nwould in your country, ” Catherine explained in amusement."
      },
      {
        "paragraph": "“Oh.” Matthew nodded. “In that case, beautiful lady, may I ask for your name?"
      }
    ]
  },
  {
    "title": "Chapter 1402 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“… My name is Hera Imm.” Catherine smiled slyly and left."
      },
      {
        "paragraph": "Matthew was stunned for a few seconds. Hera Imm."
      },
      {
        "paragraph": "Heroine?"
      },
      {
        "paragraph": "How interesting."
      },
      {
        "paragraph": "He left the place with his long legs. After getting into the car, he received a call from Sheryl. “You little\nbrat, did you secretly run off to Australia?”"
      },
      {
        "paragraph": "“Mom, I reached Melbourne last night.” Matthew chuckled. “Didn’t I mention to you that I wanted to visit\nyour hometown? When I finish making the arrangements, you and Dad can come back. I went to see\nUncle and Aunty this morning and asked"
      },
      {
        "paragraph": "about Grandpa and Grandma’s graves. I’m planning to go pay my respects later.”"
      },
      {
        "paragraph": "When Sheryl heard his words, she forgot to lecture him and only asked after a moment of silence, “Are\nyour uncle and aunt well?”"
      },
      {
        "paragraph": "“Not really. They’ve been locked up in prison for a few years and seem to have gotten older, but Uncle\ndoes have some resemblance to you.”"
      },
      {
        "paragraph": "Matthew said, “Just in case, I also asked around the old Jones family’s residence. There used to be a\nJones family there, and they had a daughter called Sheryl Jones. However, she got into an accident out\nat sea 2o years ago. Jeffery Jones also had two daughters, Catherine and Rebecca Jones. Catherine\nwas raised by them since she was a child, but Rebecca was trafficked when she was a child. They\nfound her after that.”"
      },
      {
        "paragraph": "“You suspect that what Rebecca said was false?” Sheryl frowned. “You did the paternity test. She’s\nindeed my child.”"
      },
      {
        "paragraph": "“ I know, I was just checking to be sure, ” Matthew said, “Mom, it’s no wonder such beautiful women\nlike you can be found in Melbourne. It’s been less than a day since I arrived but I already met a beauty\nwhose looks are comparable to yours when you were young. She’s the most beautiful woman I’ve seen\nbesides you. Although you’re also beautiful, you’re not young anymore—”"
      },
      {
        "paragraph": "“You little brat. How dare you say your mom isn’t young? Do you want to die?” Titus’ roar suddenly\nsounded."
      },
      {
        "paragraph": "Matthew’s hand trembled, as he did not expect his father to be listening. After all, Titus was a wife-\nprotecting maniac. “I was wrong, Dad. That woman is just a little inferior to Mom. I feel like… I’ve fallen\nin love with her at first sight.”"
      },
      {
        "paragraph": "“Pfft…” Sheryl, who was drinking water, spewed out the water in shock and coughed violently."
      },
      {
        "paragraph": "“Dear, are you alright?” Titus hurriedly patted Sheryl’s back and yelled into the phone, “Matthew\nCostner, do you want to die? You sneaked off to Australia without a word and dared to hit on a woman\nthere? Have you forgotten about your mother’s affairs?”"
      },
      {
        "paragraph": "“ I didn’t forget, Dad. I just coincidentally met that woman. She saved me too.” Matthew smiled. “I think\nthis is the once-in-a-lifetime feeling you told me you had when you first met Mom. But she’s a few years\nolder than me. You won’t mind, right?”"
      },
      {
        "paragraph": "“You rascal, if you dare to find a woman older than you, I’ll break your bones, ” Titus warned him. “ Your\nidentity isn’t ordinary, so the person you marry in the future must be an extraordinary person. There are"
      },
      {
        "paragraph": "some things you shouldn’t even think about wanting.”"
      },
      {
        "paragraph": "“Fine, I was just saying. I don’t even know her name or number.” Matthew pouted."
      },
      {
        "paragraph": "“Stop messing around. Get your aunt and uncle out much about the culture here.”"
      },
      {
        "paragraph": "“You already said that it was ancient times. This is the modern era. Just talk according to how you\nwould in your country, ” Catherine explained in amusement."
      },
      {
        "paragraph": "“Oh.” Matthew nodded. “In that case, beautiful lady, may I ask for your name?”"
      }
    ]
  },
  {
    "title": "Chapter 1403 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Mom, I’m sorry. Even after so many years, I failed to find your murderer. ” Catherine sighed and left\nafter paying her respects."
      },
      {
        "paragraph": "About half an hour after she left, Matthew arrived."
      },
      {
        "paragraph": "He saw the flowers left on the grave and froze. It was not All Soul’s Day. Why had someone visited the\ntwo elderly? Did the Jones family have other relatives?"
      },
      {
        "paragraph": "Was it Catherine Jones?"
      },
      {
        "paragraph": "However, was she not the one who killed Old Madam Jones? How dare she pay respects to the\nwoman?"
      },
      {
        "paragraph": "Sure enough, if a person was vicious enough, they would not be afraid of anything."
      },
      {
        "paragraph": "After paying his respects, he walked around and found Sheryl’s grave near the two elders. The photo\non the tombstone was one of when his mother was young."
      },
      {
        "paragraph": "It seemed like what Rebecca said was true."
      },
      {
        "paragraph": "His mother’s real name was Sheryl Jones. However, since she was not dead, there was no need for\nthe tomb to exist."
      },
      {
        "paragraph": "Matthew wondered if he should get someone to demolish Sheryl’s grave, lest it brought about bad luck."
      },
      {
        "paragraph": "At 4:00 p.m."
      },
      {
        "paragraph": "Catherine went to the Lynch residence."
      },
      {
        "paragraph": "The Lynch family crowded around Freya, but no one paid attention to Rodney."
      },
      {
        "paragraph": "“Cathy, I haven’t seen you in so long. You’ve become even more beautiful than before.” Mrs. Lynch\nheld Catherine and said, “Thank you for taking care of Freya when you were in the States. ”"
      },
      {
        "paragraph": "“Don’t say that. She also took care of me a lot.” Catherine smiled faintly."
      },
      {
        "paragraph": "“ It’s a shame. ” Mrs. Lynch suddenly laughed. “ If you weren’t with Ethan back then, I would’ve wanted\nto make you my daughter-in-law.”"
      },
      {
        "paragraph": "Rodney’s ears perked up when he heard them. Was Shaun going to have another love rival?"
      },
      {
        "paragraph": "Freya rolled her eyes. “Forget it. I seriously wonder if my brother is allergic to women.”"
      },
      {
        "paragraph": "“Don’t talk nonsense.” Mr. Lynch glared at her."
      },
      {
        "paragraph": "Mrs. Lynch sighed. “It’s not Freya’s fault for saying that. Look, I’ve arranged so many marriage"
      },
      {
        "paragraph": "partners for him but he hasn’t taken a fancy to any of them. I’m really worried that he likes men.”"
      },
      {
        "paragraph": "Catherine smiled and comforted her, “Aunty, don’t let your imagination run wild. Maybe his Mrs. Right\nhasn’t appeared yet.”"
      },
      {
        "paragraph": "“Maybe.” Mrs. Lynch had just finished nodding when the security guard at the gate ran in. “ Madam,\ntwo people from the Jackson family came and are waiting outside. They said they have to see you\ntwo.”"
      },
      {
        "paragraph": "Mrs. Lynch paused, but Freya was quick to react. “ It’s probably Patrick’s parents. They failed to find\nme in Canberra, so they’ve come to my home in Melbourne.”"
      },
      {
        "paragraph": "“Hmph, their son hurt you so badly but they still have the nerve to come here.” Mr. Lynch struck the\ntable in anger."
      },
      {
        "paragraph": "“They probably want to save Patrick.” Freya hesitated and glanced at Rodney. “I heard from Godfather\nthat Patrick will stay in prison for the rest of his life.”"
      },
      {
        "paragraph": "”For life?” Mr. and Mrs. Lynch were stunned."
      }
    ]
  },
  {
    "title": "Chapter 1404 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Although they hated Patrick, they thought that the Snow family would just ruin Jackson Corporation at\nmost. They did not expect Patrick to be locked up for life. In that case, there was no more hope left for\nPatrick. It was no wonder his parents were so anxious."
      },
      {
        "paragraph": "Rodney glanced at the crowd, hesitated for a moment, and said, “You have to understand the severity\nof Patrick’s actions this time. My uncle is only a step away from becoming prime minister, but Patrick\nprovoked my uncle recklessly. Whether or not he committed a misdemeanor or a felony, no one can\nprovoke the authority of the future prime minister. My uncle is really angry this time.”"
      },
      {
        "paragraph": "The Lynch family was shocked."
      },
      {
        "paragraph": "Nathan Snow was akin to half an emperor. How could ordinary people withstand an emperor’s wrath?"
      },
      {
        "paragraph": "“Let them come in, ” Freya said after a long time."
      },
      {
        "paragraph": "Soon, Mr. and Mrs. Jackson came in. When they saw that Freya and Rodney were present, they\nlooked as though they had seen their saviors."
      },
      {
        "paragraph": "“Freya, Young Master Snow. ” Mr. Jackson gritted his teeth. Without caring about anything else, he\nknelt in front of Freya and Rodney with a thud. “My son was foolish. I beg you two to let him go. We can\ngive all the Jackson family’s properties to the Snow family, but I only have one son. Freya, I’m begging\nyou.”"
      },
      {
        "paragraph": "“Yes, ” Mrs. Jackson also choked and said, “We really didn’t know he would do such a ridiculous thing.\nHe must have been out of his mind. Freya, in fact, Patrick has always been thinking about you— ”"
      },
      {
        "paragraph": "Rodney’s brows twisted as he subconsciously interrupted them, “ Do the people around Patrick like to\nkneel so much? Are you going to kneel until we agree? Oh, are you recording this as well? When you"
      },
      {
        "paragraph": "go out, will you tell others that the Snow family is bullying you?”"
      },
      {
        "paragraph": "“No, absolutely not.” Mr. and Mrs. Jackson’s faces went red. “We’re not Linda.”"
      },
      {
        "paragraph": "“chairman Jackson, we’re from the same generation. Get up,” Mr. Lynch hurriedly said."
      },
      {
        "paragraph": "” I… “"
      },
      {
        "paragraph": "Mrs. Jackson was tearful and did not want to get up. In the end, Mr. Jackson sighed and pulled her up.\n“"
      },
      {
        "paragraph": "Chairman Lynch, to tell you the truth, I really didn’t know about this matter. If I knew that Patrick would\ndo something like this, I would definitely have stopped him. Jackson Corporation’s development has\nbeen going well these years, so I let him go to the capital to expand, but I didn’t expect… I know that he\nmessed with the wrong people this time, and it’s definitely impossible for him to get away scot-free. I’ll\ngive away all the family assets to get him back…”"
      },
      {
        "paragraph": "“You’re not a fool, ” Mr. Lynch took a sip of tea and said in a light tone."
      },
      {
        "paragraph": "“Unfortunately, I gave birth to a foolish son. He overestimated his capabilities.”"
      },
      {
        "paragraph": "Mr. Jackson said honestly, “But I can’t do anything about it now. I only have one son. Freya, Patrick will\nnever be able to make up what he owes you, but it’s not just his fault. If we had realized that Linda liked\nhim back then, we wouldn’t have let Linda work in the company with him. Since you hate Linda, we’ll\nmake sure he never contacts her again…”"
      },
      {
        "paragraph": "“Uncle, do you really think I have a say in this matter?”"
      },
      {
        "paragraph": "Freya interrupted him, “Patrick is just an ordinary president of a company, but a person like him tried to\nmake a move against the future prime minister. If he’s not dealt with harshly, the same thing will\nhappen in the future. There are some things that the younger generation like us aren’t able to interfere\nwith.”"
      },
      {
        "paragraph": "Mr. and Mrs. Jackson froze at the same time. “What… do you mean?”"
      },
      {
        "paragraph": "“I mean that if you still want to enjoy your old age in peace, stop going around and pleading for Patrick.”"
      },
      {
        "paragraph": "Rodney spoke, “We never intended to make a big deal out of it. If you have to blame someone, blame\nyour son for indulging Linda and letting her cause a scene. She must have thought that Canberra was\nthe same as Melbourne. Just by crying and making a fuss, everyone would sympathize with her and\npity her. But the political world isn’t a place to play house. When you go in, you either win or your life\ncomes to an end. Understand?”"
      },
      {
        "paragraph": "Mr. Jackson shrunk back in pain."
      },
      {
        "paragraph": "After a few minutes of silence, he seemed to have aged several years."
      },
      {
        "paragraph": "“I understand. We’ll… leave now.” Mr. Jackson helped Mrs. Jackson up."
      },
      {
        "paragraph": "“What do you mean?” Mrs. Jackson was in tears."
      },
      {
        "paragraph": "”Save him?” Mr. Jackson smiled mournfully. ”How can we save him? Give up. If we keep pestering\nthem, we won’t even be able to live the rest of our lives in peace.”"
      }
    ]
  },
  {
    "title": "Chapter 1405 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Mrs. Jackson was pulled away by Mr. Jackson and they left the Lynch residence in a muddled state."
      },
      {
        "paragraph": "Mrs. Jackson broke down and cried. “Alas, if I had known that this would happen, I wouldn’t have\ngotten so close to the Shelby family back then. I shouldn’t have told Patrick to have Linda work in\nJackson Corporation.”"
      },
      {
        "paragraph": "“ It’s useless to say all that now. We’ve chosen our own paths. You might not know this yet, but the\nKramer family has already fallen. Minister Kramer and Nathan Snow were competitors for the election,\nbut the Kramer family collapsed just two days after the incident."
      },
      {
        "paragraph": "“I heard that several dignitaries who had previously formed alliances with the Kramer family were\narrested for some reason. Nathan has started to fight back. This time, he’s not planning to let anyone\nwho offended him off. We’re lucky that Patrick is the only one he took from our family.”"
      },
      {
        "paragraph": "Mrs. Jackson was stunned. She still could not figure out who lent Patrick the courage to go against the\nSnow family."
      },
      {
        "paragraph": "“We need to accept fate.” Mr. Jackson sighed."
      },
      {
        "paragraph": "The night was cold."
      },
      {
        "paragraph": "At 8:oo p.m. in the Lynch residence, Mr. Lynch made arrangements. “Freya, go to your room to rest if\nyou’re tired. Young Master Snow, you can sleep downstairs tonight in the first guest room on the left.”"
      },
      {
        "paragraph": "Rodney was stunned for a few seconds before brazenly clearing his throat and saying, “Dad, Freya and\nI are already husband and wife…”"
      },
      {
        "paragraph": "“Freya told us that you only got married to resolve the Snow family’s crisis. It’s not a real marriage, so\nthere’s no need for you to share a room,” Forrest interrupted him coldly. The implication was that it was\nimpossible for Rodney to take advantage of his little sister during their stay here."
      },
      {
        "paragraph": "“You can get divorced in a few years. ” Mr. Lynch nodded. “You don’t have to call me ‘Dad’ either. ”"
      },
      {
        "paragraph": "Rodney was speechless. Most parents did not want their children to get divorced after getting married."
      },
      {
        "paragraph": "“Dad, a marriage is a marriage. There are no real or fake marriages, and our marriage license is\nlegitimate. I don’t have any intentions of divorcing after marriage. As I said, I did a lot of bad things\nbefore, but I’ll give Freya and the child a complete home. It’s not good for a woman to get divorced\neither—”"
      },
      {
        "paragraph": "“What’s bad about it? The Lynch family doesn’t care about our reputation and we can afford to take\ncare of our daughter. Even if we grow old, she still has a brother to take care of her.” Mr. Lynch snorted."
      },
      {
        "paragraph": "Rodney was sullen. “But Forrest will also get married and have children in the future…”"
      },
      {
        "paragraph": "Forrest corrected him, “I don’t plan to get together with a woman who can’t accept my little sister living\nwith us.”"
      },
      {
        "paragraph": "Rodney, “…..”"
      },
      {
        "paragraph": "The Lynch family was really dedicated to protecting their daughter."
      },
      {
        "paragraph": "“Dad, Brother, I love you.” Freya was moved to"
      },
      {
        "paragraph": "tears."
      },
      {
        "paragraph": "“Good girl, go rest.” Forrest coaxed her."
      },
      {
        "paragraph": "“Cathy, let’s sleep together tonight. ” Freya pulled Catherine upstairs with her."
      },
      {
        "paragraph": "When Catherine entered the room, she saw Rodney"
      },
      {
        "paragraph": "downstairs with his head hanging low. He looked like an abandoned husky."
      },
      {
        "paragraph": "After closing the door, she said enviously, “ Since I was young, I’ve always envied your family. Your\nparents love each other, and you have an amazing, handsome elder brother who spoils you.”"
      },
      {
        "paragraph": "“You don’t have it bad now either. You have a pair o f twins and a maniac who dotes on his wife.” Freya\nlaughed. “Hey, do you want to go to that place we always used to have supper at? We haven’t been\nthere in years.”"
      },
      {
        "paragraph": "“Sure, let’s go after showering.”"
      },
      {
        "paragraph": "After they showered, it was almost nine."
      },
      {
        "paragraph": "Catherine and Freya secretly went downstairs. After unlocking the car and getting ready to leave, they\nsuddenly heard Rodney’s voice behind them."
      },
      {
        "paragraph": "“Where are you guys going in the middle of the night?”"
      },
      {
        "paragraph": "He had probably also just finished taking a shower. He wore a pair of gray cotton pants and a white T-\nshirt. His black hair was draped lazily across his forehead. His red lips and white teeth made him have\na bewitching aura."
      },
      {
        "paragraph": "“None of your business,” Freya said in an unpleasant tone. ”Go to sleep. I’m going out with Cathy.”"
      }
    ]
  },
  {
    "title": "Chapter 1406 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“ I’m not worried about you. I’m worried about the child.” Rodney snorted. “Don’t think I don’t know that\nyou two must be sneaking out for supper.”"
      },
      {
        "paragraph": "“How did you know?” Freya’s beautiful eyes widened in surprise."
      },
      {
        "paragraph": "Rodney smirked. “Shaun reminded me to keep an eye on you two at night because you’re both\ngluttons.”"
      },
      {
        "paragraph": "Catherine and Freya blushed."
      },
      {
        "paragraph": "Rodney saw their expressions and knew that he had guessed correctly. He took away the car keys in\nCatherine’s hands."
      },
      {
        "paragraph": "“I won’t object to eating supper once in a while, but I’ll have to go with you. After all, you two are\nbeautiful, so at least I’ ll be able to protect you in case something happens.”"
      },
      {
        "paragraph": "No woman would dislike being complimented on their beauty."
      },
      {
        "paragraph": "Freya glanced at him. “Then we’ll give you a chance.”"
      },
      {
        "paragraph": "Rodney drove, and they soon arrived at a street with restaurants."
      },
      {
        "paragraph": "The car stopped at the entrance of the restaurant Catherine and Freya often went to."
      },
      {
        "paragraph": "Although they had not come for several years, the owner of the restaurant could still recognize them at\na glance. “Oh, you two haven’t come here for years.”"
      },
      {
        "paragraph": "“We went abroad.” Catherine smiled. “Your business is getting better and better.”"
      },
      {
        "paragraph": "“Yes, I even rented the shop next door to expand the business.” The boss glanced at Rodney and\nteased Catherine. “Is this your boyfriend?”"
      },
      {
        "paragraph": "Then, he turned to Freya. “Why didn’t you bring your boyfriend over?”"
      },
      {
        "paragraph": "Catherine and Freya looked embarrassed at the same time. Rodney pondered over the words and\nseemed to understand something. He then deliberately pointed at Freya with a dark expression. “I’m\nher husband.”"
      },
      {
        "paragraph": "This time, the boss was the one who got embarrassed. “My bad, my bad. I forgot that it’s been several\nyears. Your husband is much more handsome than that guy.”"
      },
      {
        "paragraph": "“It’s fine.” Freya smiled."
      },
      {
        "paragraph": "“Take a seat. I’ll bring you some bacon soon.” The boss told them to sit."
      },
      {
        "paragraph": "Catherine looked around and thought that there were too many people inside, so they decided to sit a t\na table outside."
      },
      {
        "paragraph": "“You’ve been here with that trash Patrick before?” Rodney asked with a cold grunt."
      },
      {
        "paragraph": "“Yeah, it was a long time ago. I haven’t been here since we broke up a few years ago, ” Freya said."
      },
      {
        "paragraph": "Catherine added, “The food here is really good. Freya and I used to come here all the time when we\nwere in university. Sometimes, we also brought… ”"
      },
      {
        "paragraph": "“Brought who? Patrick?” Rodney saw the two women suddenly frown and stop talking, so he could not\nhelp but ask."
      },
      {
        "paragraph": "“No, you know her too. It’s Cindy, ” Freya said sullenly. “Back then, Cathy, Cindy, and I came here a lot.\nWe always ordered a few bottles of beer whenever we came.”"
      },
      {
        "paragraph": "Rodney froze."
      },
      {
        "paragraph": "He knew that Cindy used to be very close to them. In the past three years, he had always heard Cindy"
      },
      {
        "paragraph": "say that Catherine and Freya would act like big missies and look down on her, who came from an\nordinary background."
      },
      {
        "paragraph": "Of course, he knew to believe in Freya and Catherine now. He also knew that he had misunderstood\nthem a lot before."
      },
      {
        "paragraph": "“Hey, heroine, what a coincidence? I never thought we’d meet again.”"
      },
      {
        "paragraph": "Suddenly, a tall man walked up to the table. His handsome face was full of joy when he saw Catherine."
      },
      {
        "paragraph": "Catherine looked up. It was the young man she had saved this morning."
      }
    ]
  },
  {
    "title": "Chapter 1407 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "This time, Matthew was in a black short- sleeved shirt. He had thick eyelashes and azure eyes that\nwere as charming as the sea of stars. Besides, he had a sexy Adam’s apple. Although he was only 21\nyears old, he gave off an aura that made women go wild."
      },
      {
        "paragraph": "Freya gazed at him in awe."
      },
      {
        "paragraph": "She had never seen such a handsome mixed-race man."
      },
      {
        "paragraph": "He was just like a handsome prince from Greek mythology."
      },
      {
        "paragraph": "What was more, his aura was different from that of Rodney, Shaun, and Chester. Evidently, Matthew\nwas young, so he did not have an air of maturity to him. However, his brows revealed a crisp scent that\nboth a teenage guy and a man would exude, which made him a man of unique charm. He was just like\na… puppy."
      },
      {
        "paragraph": "His eyes were actually blue in color. How attractive. Rodney saw Freya gazing intently at this brat who\nhad come out of nowhere."
      },
      {
        "paragraph": "An inexplicably bitter feeling welled up in him, so he stepped on Freya’s foot out of the blue."
      },
      {
        "paragraph": "“Who stepped on my foot?” Freya instantly screamed in pain."
      },
      {
        "paragraph": "“I’m sorry. It was an accident.” Rodney apologized to her, pretending to be innocent."
      },
      {
        "paragraph": "“You…” Just as Freya was about to speak, she suddenly heard Matthew asking with a deep voice that\nresembled a cello, “Are these two your friends?”"
      },
      {
        "paragraph": "Catherine then made the introductions. “Yeah, this is my friend and…”"
      },
      {
        "paragraph": "“The other one is my best friend,” Freya promptly continued her sentence."
      },
      {
        "paragraph": "Catherine and Rodney were both speechless."
      },
      {
        "paragraph": "‘What the f*ck. Why can’t you tell Matthew that he’s your husband? Could your best friend have gotten\nyou pregnant?’"
      },
      {
        "paragraph": "“Your friends are good-looking.” Matthew grinned, and his eyes crinkled. “No wonder I’ve heard\nAustralia is full of beautiful girls. I didn’t buy that back then, but now I do.”"
      },
      {
        "paragraph": "“Why are you here?” Catherine smilingly changed the topic."
      },
      {
        "paragraph": "“I found on the internet that there’s an eatery here that serves great supper, so I came here by\nnavigation. I didn’t expect to run into you here.” Matthew asked eagerly, “Can I sit with you guys?”"
      },
      {
        "paragraph": "“Sure.” Looking at his handsome face, Catherine somehow felt a sense of familiarity. As such, she\ncould not bring herself to reject him. “Here’s the menu. Can you take spicy food?”"
      },
      {
        "paragraph": "“I can take mild spicy food, but I have no idea what’s nice here. Can you recommend some to me?”\nMatthew stared at Catherine with his azure eyes."
      },
      {
        "paragraph": "“You can try Melbourne’s crayfish and squid…”"
      },
      {
        "paragraph": "Catherine lowered her head and gave him recommendations in a serious manner."
      },
      {
        "paragraph": "At the sight of the scene, Rodney began to feel worried for Shaun as this guy had been gazing at\nCatherine uncannily."
      },
      {
        "paragraph": "Rodney secretly took out his phone. He wanted to take a photo to send to Shaun. However, Freya\npressed down his phone and glowered at him as a warning."
      },
      {
        "paragraph": "Rodney had no choice but to put his phone away silently."
      },
      {
        "paragraph": "After ordering the food, Matthew suddenly said, “By the way, I still don’t know your name, Heroine. ”"
      },
      {
        "paragraph": "Catherine opened her mouth. She wanted to tell him that she was Catherine Jones at first. However,\nafter some thought, she felt that it was a household name. She then said, “I’m Carrie Yule. What about\nyou?”"
      },
      {
        "paragraph": "Since her dad’s name was Joel Yule, there was nothing wrong in using the last name ‘Yule’."
      },
      {
        "paragraph": "Freya and Rodney simultaneously looked at Catherine strangely."
      },
      {
        "paragraph": "Matthew did not notice it as he was engrossed in Catherine’s attractive looks. Catherine was wearing\nlight makeup when he saw her during the day."
      },
      {
        "paragraph": "Whereas now, she was barefaced, but her lovely eyes, red lips, and the fair complexion on her bright\nface were still the same. She looked lovely even in a simple bun."
      },
      {
        "paragraph": "For some reason, he felt a sense of familiarity in Catherine. The longer he looked at her, the faster his\nheartbeat."
      }
    ]
  },
  {
    "title": "Chapter 1408 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "In fact, when Matthew was in Neah Bay, there used to be a lot of exotically beautiful women pursuing\nhim. Nevertheless, he was not interested in them at all."
      },
      {
        "paragraph": "“I’m Matthew Costner.”"
      },
      {
        "paragraph": "“Costner?” Catherine was surprised. “Your last name is quite rare.”"
      },
      {
        "paragraph": "“Yeah. It’s because my dad is not from Australia. ” Matthew said, “I came to Australia this time to pay\nmy respects to my grandparents on my mom’s behalf.”"
      },
      {
        "paragraph": "“ It seems like you’re going to leave Australia very soon, ” Rodney suddenly chipped in."
      },
      {
        "paragraph": "“No. I’m waiting for my mom to come. ” Matthew smiled slightly. “We’re planning to buy a house in\nAustralia. My mom has been living abroad for years, so she’s planning to return here for some time."
      },
      {
        "paragraph": "She’ll be traveling back and forth.”"
      },
      {
        "paragraph": "A sense of disgust overcame Rodney. Apparently, Shaun’s love rival was not going to leave anytime"
      },
      {
        "paragraph": "soon. D*mn it."
      },
      {
        "paragraph": "Then, the dishes were served one after another."
      },
      {
        "paragraph": "Seemingly, it was Matthew’s first time trying crayfish as he did not have the faintest idea how to eat it."
      },
      {
        "paragraph": "At the sight of his dazed look, Catherine taught him how to eat step by step. “You just need to pull the\nclaws apart before you eat the meat inside. As for its body, peel it straight from the top. It tastes really\ngood.”"
      },
      {
        "paragraph": "As she was speaking, she placed the crayfish that she had peeled onto Matthew’s plate."
      },
      {
        "paragraph": "Freya’s and Rodney’s jaws dropped at the same time."
      },
      {
        "paragraph": "“Thank you. ” Matthew began to eat the crayfish, which tasted particularly sweet."
      },
      {
        "paragraph": "After learning how to do it, he immediately peeled a crayfish for Catherine. “Look, I got it. This is for you\nsince you peeled one for me just now.”"
      },
      {
        "paragraph": "“You can have it, ” Catherine said."
      },
      {
        "paragraph": "“You dislike it, huh?” Disappointed, Matthew blinked his azure eyes, and Catherine’s heart somehow\nmelted."
      },
      {
        "paragraph": "“No. Thank you, then. ” She quickly took over the crayfish."
      },
      {
        "paragraph": "Rodney and Freya seemed like third wheels during the meal."
      },
      {
        "paragraph": "Once Matthew finished the crayfish, he went to the restroom on the second floor to wash his hands."
      },
      {
        "paragraph": "Freya was finally full of vigor. “F*ck. How did you get to know such a handsome, mixed-race man? God\nis unfair. Why are you always surrounded by attractive men? I’m really jealous.”"
      },
      {
        "paragraph": "As Freya’s husband, Rodney was so exasperated that he tightened his grip on his fork."
      },
      {
        "paragraph": "What the f*ck. Was she treating him like a dead man? Why was Freya jealous? That guy was good-\nlooking, but did that guy look better than him?"
      },
      {
        "paragraph": "“When I went to buy some stuff this morning, I saw him getting robbed by a few hooligans, so I lent him\na hand,” Catherine explained."
      },
      {
        "paragraph": "“Oh, God. You ran into a wonderful man just like that. If I had known this earlier, I would’ve\naccompanied you this morning. Although I’m pregnant, I should be able to beat up a few hooligans.” A\nmiserable look crossed Freya’s face."
      },
      {
        "paragraph": "Rodney closed his eyes and nearly broke the fork in his hand."
      },
      {
        "paragraph": "All of a sudden, Catherine glanced at Rodney sympathetically and coughed lightly. “Let’s eat.”"
      },
      {
        "paragraph": "“You’d better keep a distance from that guy. You already have Shaun.” Rodney could not help but\nremind Catherine. “ Shaun can’t afford to endure the pain of losing you again.”"
      },
      {
        "paragraph": "Catherine was momentarily stunned before she replied with a smile, “You’re overthinking it. I treat him\njust like a brother. Somehow, I feel a sense of familiarity in him.”"
      },
      {
        "paragraph": "Freya and Rodney exchanged glances, which was rare."
      },
      {
        "paragraph": "D*mn. Shaun would be in danger this time."
      },
      {
        "paragraph": "Relationships that got out of hand all began from a sense of affability and familiarity, right?"
      }
    ]
  },

  {
    "title": "Chapter 1409 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Matthew came back shortly after."
      },
      {
        "paragraph": "He talked about some interesting things that happened overseas. Despite his young age, he was very\nknowledgeable."
      },
      {
        "paragraph": "Later, he even got some dice from the owner. He simply swung a cup and performed a dice stack. He\neven managed to roll six sixes and six fives."
      },
      {
        "paragraph": "“You’re brilliant.” Catherine was extremely impressed, much less Freya."
      },
      {
        "paragraph": "“Goodness. With your skills, you’ll surely be able to rake a few hundred million dollars in Las Vegas,”\nFreya muttered."
      },
      {
        "paragraph": "“It’s just a matter of rolling the dice. What’s so great about it?” Rodney could not help but mumble."
      },
      {
        "paragraph": "“Can you roll six sixes or stack the dice with a six on top?” Freya asked."
      },
      {
        "paragraph": "Rodney was speechless."
      },
      {
        "paragraph": "Soon, Catherine’s phone rang, and it was a call from Shaun."
      },
      {
        "paragraph": "As it was too noisy here, she took her phone to the other side."
      },
      {
        "paragraph": "Matthew glanced at her silhouette. Then, Rodney asked with a grin, “Dude, do you know who’s calling\nher?”"
      },
      {
        "paragraph": "Matthew lifted his long eyelashes, his eyes flashing with a dark glint."
      },
      {
        "paragraph": "“It’s her husband and children.” As soon as Rodney finished his sentence, Freya rolled her eyes."
      },
      {
        "paragraph": "However, he did not mind and continued, “Her children are quite old now.”"
      },
      {
        "paragraph": "Matthew clenched the fork in his hand."
      },
      {
        "paragraph": "Amid his exhilaration, he suddenly felt as though a bucket of cold water was poured over him."
      },
      {
        "paragraph": "A bitter smile flashed across his face. He never thought he would fall for this woman, only to find that\nshe had a husband and children."
      },
      {
        "paragraph": "How could this be? She was still so young."
      },
      {
        "paragraph": "Matthew shifted his gaze to Catherine, not knowing what she was saying. Nevertheless, her lips curled\ninto a sweet smile, and there was a hint of flirtation on her face."
      },
      {
        "paragraph": "He lowered his eyes. Suddenly, he took a glass of beer and drank it in one gulp."
      },
      {
        "paragraph": "Rodney smirked. ‘Shaun oh Shaun, I wonder how you’re going to thank me later for helping you get rid\nof a love rival indirectly.’"
      },
      {
        "paragraph": "Well, where could Shaun find a buddy like him who valued their relationship so much?"
      },
      {
        "paragraph": "After Catherine returned, Matthew probed. “Are you married?”"
      },
      {
        "paragraph": "Catherine was stunned. At that point, she reckoned that Rodney might have told him something."
      },
      {
        "paragraph": "However, her situation was a little complicated as she had a boyfriend when she had yet to divorce\nWesley."
      },
      {
        "paragraph": "“Mm.” After a moment of thought, she nodded. “I have fraternal twins too.”"
      },
      {
        "paragraph": "Matthew felt as if a knife had pierced through his chest. “You got married at such a young age, huh?”"
      },
      {
        "paragraph": "“Not really. I’m not that young anyway,” Catherine responded."
      },
      {
        "paragraph": "Matthew downed another glass of beer gloomily. He felt like pouring his heart out to Titus, telling him\nthat he was jilted."
      },
      {
        "paragraph": "The supper lasted until 11:00 p.m., and Catherine had Rodney drop Matthew off at the hotel entrance\nbefore she waved goodbye to Matthew."
      },
      {
        "paragraph": "At the sight of the tall figure in the beautiful night, Catherine could not resist turning around to look at\nhim."
      },
      {
        "paragraph": "“What’s the matter? You can’t bear to part with him, huh? Do you regret promising to get back together\nwith Shaun so early?” Freya teased while laughing. “I feel you. What a handsome young guy he is.\nAlas, I finally understand why men enjoy being with young ladies. Women like being with younger men\ntoo.”"
      },
      {
        "paragraph": "“Freya Lynch, please be reminded that you’re married.” Rodney reminded her as he could not tolerate\nFreya’s behavior anymore."
      },
      {
        "paragraph": "“Our marriage is just for show.” Freya interrupted him. “Enough. Keep your eyes on the road when\nyou’re driving, and stop giving me that look. I was fine with it back then, but after meeting the\nhandsome young guy, I realized that you’re really old.”"
      },
      {
        "paragraph": "Rodney was at a loss for words. Did she call him old? With his smooth face, many in public thought\nthat he was only 24 or 25 years old."
      }
    ]
  },
  {
    "title": "Chapter 1410 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Was Freya blind?"
      },
      {
        "paragraph": "“Freya Lynch, why do you have to be so mean with your words?” Rodney nearly lost his temper."
      },
      {
        "paragraph": "“Uncle Rodney, you need to accept reality sometimes. That’s your age, ” Freya added grimly."
      },
      {
        "paragraph": "“Enough. Stop provoking him. We’re still in the car. I don’t want to be involved in an accident.”\nCatherine reminded Freya helplessly after casting a look at a fuming Rodney."
      },
      {
        "paragraph": "At last, Freya let out a sigh and kept quiet. That sigh made Rodney’s heart clench."
      },
      {
        "paragraph": "He was not sure whether Freya sighed because Catherine already had a boyfriend or she herself could\nnot be with a handsome young guy since she was already married."
      },
      {
        "paragraph": "Soon after arriving at the Lynch household, the two women headed upstairs to rest."
      },
      {
        "paragraph": "Rodney tossed and turned, unable to fall asleep."
      },
      {
        "paragraph": "After some time, he sat up and looked into the mirror. He first looked at his eyebrows and then his thin\nlips."
      },
      {
        "paragraph": "In the end, he could not help but send a WhatsApp message to his buddies in the group chat. [Don’ t\nyou agree that my brows are charming and my pursed lips look like a heart shape? I’m very handsome,\nright? I think the four of us are the most handsome men in Australia. We’re handsome in different\nways.]"
      },
      {
        "paragraph": "Chester: [Take some medicine if you’re sick.]"
      },
      {
        "paragraph": "Shaun: [Your brain could have become heart- shaped.]"
      },
      {
        "paragraph": "Rodney was speechless. [F*ck off. I met a mixed- race brat who has charming brows and heart-\nshaped pursed lips. He has had Freya and Catherine bewitched.]"
      },
      {
        "paragraph": "Shaun: [What? I’ll make you pay if you’re lying.] Chase: [How bratty is he? Is he a grown-up?]"
      },
      {
        "paragraph": "Rodney: [He’s a 21-year-old handsome young guy. Freya kept drooling over him just now, and\nCatherine taught him how to peel a crayfish. By the way, Catherine even peeled a crayfish for him and\nmade me send the guy home after supper.]"
      },
      {
        "paragraph": "After sending the message, he somehow felt better. Since he was in a bad mood, he wanted to drag\nShaun down as well."
      },
      {
        "paragraph": "Shaun: [Are you kidding?]"
      },
      {
        "paragraph": "Chester: [Are you trying to provoke Shaun and make him lose sleep at such a late hour?]"
      },
      {
        "paragraph": "Chase: [D*mn. Don’t tell me that I have to go to Melbourne Airport to pick Shaun up in the middle o f\nthe night.]"
      },
      {
        "paragraph": "Rodney: [Why would I be lying to you guys? But you have to thank me, Shaun. When Catherine was\naway, I told the guy that Catherine is already married and has children. The guy looked heartbroken.]"
      },
      {
        "paragraph": "Shaun: [I’m sure Cathy isn’t interested in that guy. What’s more, is there any man in Australia who’s\nmore handsome than me?]"
      },
      {
        "paragraph": "Chase: […]"
      },
      {
        "paragraph": "Chester: […]"
      },
      {
        "paragraph": "Unable to stomach Shaun’s narcissistic behavior, Rodney replied mercilessly. [To be frank, you’re quite\nhandsome. Freya said the guy looks like Legolas, while Catherine said the sight of him gave her a\nsense of familiarity and affability. By the way,"
      },
      {
        "paragraph": "after Freya met the handsome young guy, she suddenly felt I’m too old.]"
      },
      {
        "paragraph": "Chester: [Ahem. After Catherine met the handsome young guy, would she also think that Shaun is too\nold?]"
      },
      {
        "paragraph": "Chase: [Shaun, Rodney, don’t worry. We may be old, but we’re charming.]"
      },
      {
        "paragraph": "Shaun: [Buzz off. Chase, come and pick me up at Melbourne Airport three hours later.]"
      },
      {
        "paragraph": "Chase: [F*ck you, Rodney Snow. Can’t you talk about it only after you return to Canberra?]"
      },
      {
        "paragraph": "Rodney: [I suddenly feel a little better. I think I can go to bed now.]"
      },
      {
        "paragraph": "The next morning."
      },
      {
        "paragraph": "7: 00 a.m."
      },
      {
        "paragraph": "Catherine woke up. After all, it was not her room, and she had trouble sleeping on a strange bed."
      },
      {
        "paragraph": "Afraid that she would wake Freya, she stealthily put on her clothes and crept downstairs."
      },
      {
        "paragraph": "Nevertheless, she was dazed at the sight of a tall figure seated in the living room. She was under the\nimpression that she was not fully awake and her"
      },
      {
        "paragraph": "eyes were betraying her, to think that Shaun was in the Lynch household."
      }
    ]
  },
  {
    "title": "Chapter 1411 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Cathy…”"
      },
      {
        "paragraph": "Amid Catherine’s confusion, Shaun walked up to her and wrapped her around his arms. He then\nstretched out this hand to press her long, frizzy hair."
      },
      {
        "paragraph": "Only when she caught a whiff of his uniquely crisp scent did it dawn on her that Shaun had actually\ncome to Melbourne."
      },
      {
        "paragraph": "“Young Master Hill was already at the gate at 6:3o in the morning.” Mr. Lynch explained with a smile, “\nHe probably flew here overnight. He really… can’t bear to part with you even for a day.”"
      },
      {
        "paragraph": "With an elder staring her this way, Catherine blushed and promptly pushed Shaun away."
      },
      {
        "paragraph": "Shaun’s face turned cold."
      },
      {
        "paragraph": "They had just met each other, yet she could not wait to push him away. Was it because she felt that he\nwas not as good as that handsome young guy?"
      },
      {
        "paragraph": "“Why are you here all of a sudden?” Catherine raised her head. When she saw the bags under his"
      },
      {
        "paragraph": "eyes, she frowned. “Look at your dark circles. You didn’t sleep last night, huh?”"
      },
      {
        "paragraph": "Shaun’s brows sank. He did not notice the dark circles under his eyes, but her words shattered him. As\nsuch, he pulled a long face and kept quiet."
      },
      {
        "paragraph": "“You guys can have a chat. I’m going out for a jog.” With his hands behind his back, Mr. Lynch left the\nhouse to avoid being the third wheel."
      },
      {
        "paragraph": "“Miss Jones, would you like to have breakfast?” the housekeeper asked with a smile."
      },
      {
        "paragraph": "“Sure. Thank you.” Catherine nodded."
      },
      {
        "paragraph": "Soon, the housekeeper served them some breakfast, such as millet porridge, sweetcorn fritters, eggs,\ncarrots, and salad."
      },
      {
        "paragraph": "Catherine handed Shaun a fork and spoon before she said, “Freya’s parents have weak stomachs and\nhigh cholesterol, so her family usually has a bland diet. However, this is good too since it’s nutritious\nand healthy.”"
      },
      {
        "paragraph": "Shaun remained still without taking over the fork and spoon."
      },
      {
        "paragraph": "“What’s wrong?” Catherine finally realized that something was wrong with him."
      },
      {
        "paragraph": "Shaun furrowed his eyebrows deeply. “Are you looking down on me because of my old age?”"
      },
      {
        "paragraph": "A dazed look flashed across Catherine’s face."
      },
      {
        "paragraph": "Shaun’s dark gaze was filled with resentment. “As soon as you saw me, you said that I have bags\nunder my eyes. You were trying to imply that I’m not as handsome as I was before, right? Now, you\nkeep reminding me to be health-conscious. I’m indeed older than you by many years. My stomach\noften aches, and my body is weak. It’s about time to be health-conscious. After all, I’m not that young\nanymore.”"
      },
      {
        "paragraph": "At a loss for words again, Catherine gazed at his handsome face. When he made such remarks, had\nhe considered the feelings of the young people who looked older than their age?"
      },
      {
        "paragraph": "“Why are you… so bad—tempered?” she asked after some time."
      },
      {
        "paragraph": "“Now… You’re looking down on me because of my moodiness, huh?” Shaun clenched his fists."
      },
      {
        "paragraph": "Catherine took a deep breath. If she were not at the Lynch household right now, she would have taught\nhim a lesson. However, considering that it was someone else’s place, she explained calmly, “I don’t\nknow why you’re so mad. I talked about your"
      },
      {
        "paragraph": "dark circles because I took pity on you for staying up last night. I talked about being health-conscious\nbecause they don’t serve Western breakfast here. I was afraid that you wouldn’t like the food, so I\nkindly reminded you that at least the breakfast is nutritious and healthy even though it’s bland.”"
      },
      {
        "paragraph": "“That is all? ” Shaun was stunned, and his brows furrowed."
      }
    ]
  },
  {
    "title": "Chapter 1412 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Suit yourself. ” After Catherine took a mouthful of porridge, her stomach felt better. Then, she said in\nannoyance, “I don’t know what you’re so angry about. At this age, you’re supposed to be more mature.\nYou’re not old either. Don’t you realize a lot of women look back at you when I go out with you?”"
      },
      {
        "paragraph": "Shaun’s eyes lit up, and the corners of his lips curled up a little. After smiling for two seconds, he tried\nto stifle it. “But I’m not a handsome young guy anymore. I’ve lost that youthful vigor. I’m fuddy-duddy\nand boring, just like a sugar cane. The more it’s eaten, the less sweet it becomes.”"
      },
      {
        "paragraph": "Catherine rubbed her forehead, speechless. “Did Rodney, that big mouth, say something to you?”"
      },
      {
        "paragraph": "The grimness in Shaun’s eyes was apparent. “Miss Jones, did you have fun with the handsome young\nguy last night? Did you think about your beloved Mr. Hill?”"
      },
      {
        "paragraph": "Catherine nearly spat out the porridge in her mouth. She hurriedly took a few pieces of tissue and"
      },
      {
        "paragraph": "covered her porridge-stained lips. She was laughing so hard that her shoulders shook."
      },
      {
        "paragraph": "“Is it funny?” Shaun silently fixed his eyes on her. “ Have you forgotten what you said the night before?\nThat you were fed up with my face?”"
      },
      {
        "paragraph": "“Why are you so funny now?” Catherine’s belly hurt from laughing too much. After calming down, she\napproached Shaun, cupped his handsome face, and scanned it. “Wow, what a handsome face. How\ncan I possibly be fed up with it? Look at your sword- shaped brows and tall nose. Also, your thin lips… ”"
      },
      {
        "paragraph": "She purposely brushed her finger on it. “You’re really captivating when you kiss me. How would I be\ninterested in someone else? The handsome young guy is very childish compared to you. I prefer\nmature and masculine men like you. Your body shape is also my type, especially when you take off\nyour clothes. You’re not too muscular, but you look fit…”"
      },
      {
        "paragraph": "“Drop it.”"
      },
      {
        "paragraph": "Despite his shamelessness, his face and ears were flushed red from her words."
      },
      {
        "paragraph": "This woman was so good at flirting. Not only was she a smooth talker, but her touch was also very flirty."
      },
      {
        "paragraph": "“ So, are you still mad?” Catherine smiled gently."
      },
      {
        "paragraph": "“I’m not mad. I just feel insecure. When I face you, I’m no longer as confident as I used to be. But if you\ngive me a kiss right now, I might feel better.”"
      },
      {
        "paragraph": "Once Shaun finished speaking, he pulled her onto his thighs before lowering his head, about to kiss\nher."
      },
      {
        "paragraph": "“Don’t. This is the Lynch family’s house.” Catherine was shocked. “Many people live here.”"
      },
      {
        "paragraph": "“Hey, isn’t it too late to realize that many people live here?” Forrest’s voice suddenly rang from the side."
      },
      {
        "paragraph": "Embarrassed, Catherine promptly pushed Shaun away. She turned around, only to find Forrest\nstanding at the foot of the stairs. “F-Forrest, when did you come down?”"
      },
      {
        "paragraph": "“Some time ago. I’ve been here since you said, ‘ You’re really captivating when you kiss me.”’ Forrest\ncalmly took a bowl of porridge and sat down. “Am I disturbing you guys?”"
      },
      {
        "paragraph": "“…Nope.” Catherine felt so embarrassed that she wanted to die. She had never felt like this in front of\nForrest before."
      },
      {
        "paragraph": "She glowered at Shaun viciously, yet Shaun felt a lot better."
      },
      {
        "paragraph": "“I finally understand how you won over the wealthiest man in Australia back then.” Forrest let out a\ndiscreet smile. “ Sadly, Freya hasn’t learned any of your skills even though she’s your best friend. You\ncan teach her next time so that she won’t be deceived by men time and time again.”"
      },
      {
        "paragraph": "“Forrest, please stop.” Catherine used the bowl to block her face. “Shaunny, let me introduce him to\nyou. He’s Freya’s brother, Forrest Lynch.”"
      },
      {
        "paragraph": "“Hi.” Shaun nodded at Forrest. He had heard Chase mention Lynch Corporation before too. It was\ninitially just an established company in Melbourne. However, Forrest took over the company afterward\nand expanded it until it became one of the top 1oo companies in Australia."
      }
    ]
  },
  {
    "title": "Chapter 1413 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Forrest nodded gently."
      },
      {
        "paragraph": "Shaun’s eyes sized up Forrest’s face. Freya looked attractive with prominent features, so did her\nbrother. However, the biggest difference between them was that Forrest’s skin tone was tanner."
      },
      {
        "paragraph": "When Shaun thought about it, he noticed that Catherine had always been surrounded by good- looking\nmen."
      },
      {
        "paragraph": "“President Lynch, have you known Cathy for a long time?” Shaun asked."
      },
      {
        "paragraph": "“We’ve known each other for more than ten years. She and Freya are good friends, so she would come\nhere a lot and eat with us back then.” Forrest had grasped Shaun’s point in a second. “But she already\nhad a boyfriend at that time. She treats me just like a brother, and I, too, treat her like a sister.”"
      },
      {
        "paragraph": "Shaun immediately understood it as well."
      },
      {
        "paragraph": "“What’s on your mind? Catherine rolled her eyes. “ Can you not panic whenever you see a guy around\nme?”"
      },
      {
        "paragraph": "“I love you. That’s why I panic.” Shaun shrugged as a matter-of-factly."
      },
      {
        "paragraph": "“Good morning.”"
      },
      {
        "paragraph": "Suddenly, the door of the bedroom on the ground floor opened. A puffy-eyed Rodney stretched his\nbody and walked out. The moment he caught sight of Shaun in the living room, he was so shocked that\nhe flinched. “Damn, Shaun. Did you actually take an overnight flight here?”"
      },
      {
        "paragraph": "Shaun looked at him coldly, while Catherine said with a mirthless smile, “Young Master Snow, you’re\nreally good at telling on me, huh?”"
      },
      {
        "paragraph": "“When did I tell on you?” An innocent look washed over Rodney’s face. “I just told Shaun that a young\nguy had supper with us last night, that the guy is quite good-looking, and that we look older compared\nto him…”"
      },
      {
        "paragraph": "“You’re the one who’s old. Don’ t compare me to you, ” Shaun said nonchalantly."
      },
      {
        "paragraph": "“Tsk, Shaun, that’s too much. I’m your buddy.” Rodney snorted. “That pretty boy last night definitely\nliked your girlfriend. I was the one who told him that Catherine has a boyfriend and children. Only then\ndid he give up.”"
      },
      {
        "paragraph": "“Cathy, stay away from that pretty boy if you see him next time. Don’t let him approach you.” Shaun\nreminded her with a frown. “Don’t forget about what happened with Wesley.”"
      },
      {
        "paragraph": "“Oh.” Their words made Catherine feel uneasy."
      },
      {
        "paragraph": "Somehow, she felt a great sense of familiarity in Matthew. Yesterday may only be their first time seeing\neach other, but seeing him smile really gave her the urge to look after him like he was her little brother."
      },
      {
        "paragraph": "Nevertheless, she did not dare to let Shaun know about this, or he would be extremely jealous."
      },
      {
        "paragraph": "Moreover, she probably would not see Matthew anymore."
      },
      {
        "paragraph": "At 9:00 a.m., Freya came downstairs lazily. She was also taken aback the second she saw Shaun."
      },
      {
        "paragraph": "Catherine said impassively, “Your husband told Shaun that we had supper with a handsome young guy\nlast night.”"
      },
      {
        "paragraph": "Freya instantly took in the scene. Then, she glared at Rodney fiercely. “You and your big mouth. Why\nare you such a busybody? Don’t you dare think of joining us the next time we go out for supper.”"
      },
      {
        "paragraph": "“Shaun…” Rodney looked at Shaun for help."
      },
      {
        "paragraph": "Shaun could not be bothered about him at first. However, considering that Rodney reported the matter\nto him last night and even helped him get rid of his love rival, he spoke up. “Miss Lynch, Rodney is my\nbuddy. He hopes that Cathy and I have a stable relationship. He only told me to prevent any guys from\nswooping in on us. On the other hand, your behavior tells me that you’re trying to coax Cathy into\nlooking for the handsome young guy. Let me remind you that you can go ahead and look for one, but\nCathy can’t.”"
      },
      {
        "paragraph": "Rodney felt aggrieved. How ungrateful of Shaun. What did he mean by Freya could do it? In that case,\nRodney would be cuckolded."
      },
      {
        "paragraph": "“Did you see me coaxing Cathy into looking for the handsome young guy?” Freya snorted and said, “\nIt’s true that Cathy is in a relationship with you, but you can’t keep her from appreciating handsome\nyoung guys. What’s more, can’t she make friends with someone of the opposite s*x?”"
      },
      {
        "paragraph": "Shaun’s brows sank. “If those guys have an ulterior motive, I won’t be able to accept it.”"
      },
      {
        "paragraph": "“You seem to think that every man who approaches Cathy has an ulterior motive.” Freya grinned and\nraised her brows at Catherine."
      },
      {
        "paragraph": "Catherine rubbed her forehead. “Alright. Stop arguing. Shaun, I think you should trust me.”"
      },
      {
        "paragraph": "“Cathy, are you taking her side?” Shaun felt as though his heart had shattered."
      }
    ]
  },
  {
    "title": "Chapter 1414 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Is she supposed to take your side if not mine?” Freya raised her brows provocatively. “Don’t forget that\nI’ve been with her through those ups and downs in her life. I’ve never been absent.”"
      },
      {
        "paragraph": "Shaun was at a loss for words."
      },
      {
        "paragraph": "Rodney said leisurely, “Shaun, you can never convince her.”"
      },
      {
        "paragraph": "Catherine laughed secretly. As she was about to speak, her phone suddenly rang. It was an unknown\nnumber."
      },
      {
        "paragraph": "“Hi, is this Miss Jones? I’m a staff member of the cemetery. Your family’s tomb was destroyed last\nnight.”"
      },
      {
        "paragraph": "“What?” Catherine’s face turned ghastly. “Whose tomb?”"
      },
      {
        "paragraph": "“Sheryl Jones’s. ” The staff said, “When we went there this morning, the tomb had already been dug\nopen. Everything inside is missing.”"
      },
      {
        "paragraph": "“I’ll come right away.” Catherine leaped to her feet."
      },
      {
        "paragraph": "“What’s wrong?” Shaun looked at her anxiously. It had been a while since he saw her so furious."
      },
      {
        "paragraph": "“ Someone destroyed my mom’s tomb last night.” Catherine clenched her fists."
      },
      {
        "paragraph": "“Who did that? How wicked,” Freya roared indignantly."
      },
      {
        "paragraph": "“Let me accompany you there and have a look.” Shaun caressed her shoulder."
      },
      {
        "paragraph": "An hour later, Shaun drove her to the cemetery."
      },
      {
        "paragraph": "When Catherine walked up to Sheryl’s tomb, she realized that not only had her tomb destroyed, but her\ntombstone had also been ruined. Sheryl’s name had been scribbled on so badly that it could not be\nseen. Even her photo was missing."
      },
      {
        "paragraph": "That photo… was Catherine’s only keepsake of her mother."
      },
      {
        "paragraph": "Catherine was so exasperated that she curled her fingers in a fist and her eyes reddened. “Who is this\nwicked person who destroyed my mom’s tomb?”"
      },
      {
        "paragraph": "“Could it be… Wesley?” Shaun asked."
      },
      {
        "paragraph": "“I have no idea.” Catherine shook her head in bewilderment. It baffled her as to why Sheryl’s tomb was\ndestroyed. Although it was merely a cenotaph without Sheryl’s ashes, the destroyer’s act was still\nconsidered profane and disrespectful."
      },
      {
        "paragraph": "“Miss Jones, we found this note in front of your family’s tomb this morning.” The staff passed her a\nwhite note."
      },
      {
        "paragraph": "Catherine unfolded it and saw a sentence written on it. [Catherine Jones, I’m back. I’ll start settling the\nscores with you, one by one.]"
      },
      {
        "paragraph": "All of a sudden, she shuddered."
      },
      {
        "paragraph": "For some reason, she had never shuddered like this before, not even after learning of Wesley’s past."
      },
      {
        "paragraph": "In her eyes, Wesley was loathsome but not scary. It was because she had seen his true colors."
      },
      {
        "paragraph": "However, the person who wrote this note must be hiding somewhere. She had no idea when and how\nthis person would attack her."
      },
      {
        "paragraph": "“Do you know who this person is?” Shaun held her hands that had started to tremble."
      },
      {
        "paragraph": "“It’s Rebecca. It must be her.” Catherine gnashed her teeth."
      },
      {
        "paragraph": "After Shelley’s passing, Rebecca seemed to have vanished into thin air. Nevertheless, Catherine had"
      },
      {
        "paragraph": "a feeling that Rebecca would come back. Now, she was actually back."
      },
      {
        "paragraph": "With Rebecca’s viciousness, destroying one’s tomb was something she would do."
      }
    ]
  },
  {
    "title": "Chapter 1415 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun furrowed his brows."
      },
      {
        "paragraph": "He was hazy about what happened in the past, but he still remembered Rebecca."
      },
      {
        "paragraph": "Seemingly, she was a brutal woman. He was the one who sent her to the mountains, but she fled after\nthat."
      },
      {
        "paragraph": "“Cathy, don’t worry. I’m here. This time, I’ll definitely kill this woman for you, ” Shaun said firmly."
      },
      {
        "paragraph": "“You’re wrong. I have a bad feeling. Since Rebecca is bold enough to make such a provocative remark,\nit means that something unexpected might have happened to her over the years. I’m afraid it’ll be\ndifficult to deal with her now.”"
      },
      {
        "paragraph": "Catherine knitted her brows. “Yesterday, I heard that Uncle and Aunt are going to be released from\nprison. I couldn’t get my head around it previously. However, I’ve got it now. I’m afraid Rebecca might\nbe plotting something.”"
      },
      {
        "paragraph": "Shaun was startled. “Weren’t they sentenced to more than ten years?”"
      },
      {
        "paragraph": "“Yeah. They’ve killed and stolen their family’s assets, yet they’ll be released in just three years.”\nCatherine let out a bitter laugh. “Well, the current Rebecca should be no ordinary woman.”"
      },
      {
        "paragraph": "“Cathy, I’ll protect you no matter what happens.” Shaun could not help but hug her. Only at this point\ndid it dawn on him that she was shaking."
      },
      {
        "paragraph": "He was not sure whether she was shaking because of anger or for some other reason."
      },
      {
        "paragraph": "“Shaun, you won’t understand. Sometimes, I think people like Rebecca and Sarah are hard to\neliminate. I might appear to be at an advantage, but when it comes to dealing with Rebecca, I’m a real\nloser, ” Catherine said miserably."
      },
      {
        "paragraph": "Rebecca had contributed to her grandmother’s death, but the murderer was soon to be released."
      },
      {
        "paragraph": "Rebecca also contributed to Charity’s death, but Charity’s dead body was nowhere to be found, and\nRebecca was going to return."
      },
      {
        "paragraph": "“I really feel useless.”"
      },
      {
        "paragraph": "Catherine said with her eyes red, “My mom didn’t leave anything for me, but even her cenotaph has\nbeen ruined. Meanwhile, you still need to deal with Charlie, and I need to deal with Wesley. We also\ndon’t know when Sarah will attack us again, and now Rebecca is back. Will we be able to handle all of\nthem?”"
      },
      {
        "paragraph": "“Cathy, that ferocious bunch has surrounded us all these years, yet we’ve still managed to come this\nfar. Since we can’t see through their plans, they won’t be able to see through ours too.” Shaun stroked\nher hair softly. “If there comes a day where you’re exhausted, we’ll leave this place. There’s a bigger\nworld outside Australia. Anywhere is home a s long as I’m with you and the kids.”"
      },
      {
        "paragraph": "Catherine was swayed by his words. It was true,"
      },
      {
        "paragraph": "So what if she had many enemies? If she could not cope with the situation, she should not go head-to-\nhead or die with them."
      },
      {
        "paragraph": "It was because she had to protect herself for the sake of the kids."
      },
      {
        "paragraph": "“That sounds like a good idea. Having said that, those evil people are the ones who are in the wrong. I\ndon’t want to leave in a sorry state.” Catherine took a deep breath. “If Rebecca wants to come back, it’s\nnot all bad either. Coincidentally, I want to settle the old scores with her, one by one.”"
      },
      {
        "paragraph": "“Let’s settle this first,” Shaun whispered. Catherine nodded."
      },
      {
        "paragraph": "Now that Sheryl’s tomb had been destroyed, she had no choice but to get the cemetery staff to re –\ncarve a tombstone for now. She also reported the incident to the police to find out who dug the tomb\nlast night."
      },
      {
        "paragraph": "Unfortunately, this cemetery had always been desolate. The destroyer of the tomb seemed to have\ncome in from the back of the mountains, where there were no surveillance cameras around. As such,\nthe police could not trace anything."
      },
      {
        "paragraph": "A five—star hotel."
      },
      {
        "paragraph": "Matthew lazily lay on the rocking chair in front of the French window."
      },
      {
        "paragraph": "He was holding a wine glass with some maroon liquid in it. As the rocking chair swayed, the wine in his\nglass also shook."
      },
      {
        "paragraph": "“Alas.”"
      },
      {
        "paragraph": "Matthew had sighed for the nth time."
      },
      {
        "paragraph": "It was not easy for him to fall for a woman. When he finally did, he found out that the woman had a\nhusband and children before he could progress his relationship with her."
      },
      {
        "paragraph": "He was quite fond of Carrie, but he did not know where to draw the line. Considering that she already\nhad a family, he should not ruin it."
      }
    ]
  },
  {
    "title": "Chapter 1416 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Young Master Costner…”"
      },
      {
        "paragraph": "A tall and slender subordinate of his walked up to him. “I’ve completed the task that you assigned to\nme.”"
      },
      {
        "paragraph": "The subordinate handed a photo to Matthew. It was a photo of Matthew’s mother on the tombstone."
      },
      {
        "paragraph": "“Why was a cenotaph built for my mom when she is still alive? Isn’t that a curse on her?” Matthew said\ngrimly, “By the way, have you put the warning note there as per my instruction?”"
      },
      {
        "paragraph": "“Yes. The cemetery staff should’ve contacted Catherine, and she should be able to grasp the meaning\nof it when she sees it.”"
      },
      {
        "paragraph": "“Mm. She must be very anxious now, considering that she has done a lot of evil deeds. Unfortunately,\nshe has offended the Costner family, so she’s doomed to die.” Matthew took a sip of red wine as a cold\nglint flashed in his eyes. “By the way, how’s the arrangement for the release of my uncle and aunt?”"
      },
      {
        "paragraph": "“They’ll be released from prison in three days.”"
      },
      {
        "paragraph": "“Alright. I’ll personally celebrate their return, then.” Matthew waved his hand."
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "Soon after the subordinate left, Matthew’s assistant came in."
      },
      {
        "paragraph": "“Young Master, this is Catherine Jones’s information that you’ve asked me to collect.”"
      },
      {
        "paragraph": "“Give it to me.” Matthew stretched out his hand lazily."
      },
      {
        "paragraph": "The assistant passed him the file. When Matthew opened it and caught sight of the photo on the first\npage, he leaped to his feet in agitation. He accidentally hit the wine glass on the coffee table and\nspilled the wine all over the brown rug."
      },
      {
        "paragraph": "“Young Master…” The assistant was taken aback. Not knowing what to do, he gazed at Matthew’s\ngrave, handsome face, which looked shocked."
      },
      {
        "paragraph": "“How could it be her?” Matthew muttered."
      },
      {
        "paragraph": "He was absolutely certain that the woman in the photo was Carrie Yule, the woman who saved him\nyesterday."
      },
      {
        "paragraph": "It was the woman who had supper with him last night."
      },
      {
        "paragraph": "No wonder he felt that she bore a passing resemblance to his mother. No wonder he felt a sense of\nfamiliarity in her."
      },
      {
        "paragraph": "It turned out that this woman was his uncle’s daughter."
      },
      {
        "paragraph": "It also meant that she was his cousin…"
      },
      {
        "paragraph": "However, Matthew did not expect her to be Catherine Jones."
      },
      {
        "paragraph": "Based on Rebecca’s description, Catherine was a despicable, cunning, and wicked woman."
      },
      {
        "paragraph": "Nevertheless, he personally felt that Catherine was kind, considerate, gentle, and wonderful."
      },
      {
        "paragraph": "Could someone be so good at pretending?"
      },
      {
        "paragraph": "Even so, Catherine did not know him nor his identity. Meeting her yesterday was just by chance."
      },
      {
        "paragraph": "Why would she have to pretend in front of him?"
      },
      {
        "paragraph": "“Young Master, what’s wrong?” The assistant could not help but ask after noticing that Matthew looked\ncold sometimes and confused at other times."
      },
      {
        "paragraph": "“Are you sure she’s Catherine Jones?” Matthew asked."
      },
      {
        "paragraph": "“Of course. Although she’s not a celebrity, she’s well-known in Australia mainly due to her involvement\nwith the two handsome men, Wesley Lyons and Shaun Hill.”"
      },
      {
        "paragraph": "The assistant added, “Besides, this woman… I don’t know how to describe her. She doesn’t seem to\ncare about how others see her. She’s married to Wesley from Golden Corporation, yet she has gotten\nback together publicly with her ex-husband, Shaun, and i s now staying with him.”"
      },
      {
        "paragraph": "Matthew was stunned. “ Isn’t Australia a country that places heavy emphasis on good manners?”"
      }
    ]
  },
  {
    "title": "Chapter 1417 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Yeah.”"
      },
      {
        "paragraph": "The assistant nodded. “After scanning through the comments on the Internet, I noticed that a lot of\npeople actually support Catherine in getting together with Shaun. It seems that Wesley has a bad\nreputation. He likes beating women, and he even married Catherine using devious tactics. Having said\nthat, the news on the Internet can be true and false. Since we’re foreigners, we can’t tell whether it’s\ntrue.”"
      },
      {
        "paragraph": "“You’re right. In fact, there are only two possible reasons.”"
      },
      {
        "paragraph": "Matthew flipped through the file in his hand impassively. “ It could be either Wesley’s character is really\nnasty or Catherine is too cunning in that"
      },
      {
        "paragraph": "she destroyed her current husband’s reputation so as to betray him rightfully. This way, the public\nwould think that there’s nothing wrong with her cheating on him.”"
      },
      {
        "paragraph": "The assistant nodded and agreed with what Matthew had analyzed. “The second one seems"
      },
      {
        "paragraph": "more probable. After all, Miss Jones has claimed that Catherine is brutal, even to the extent of killing\nher biological grandmother and plotting against her parents.”"
      },
      {
        "paragraph": "Matthew pursed his exquisite, thin lips."
      },
      {
        "paragraph": "If he had learned this earlier, he would have believed it without a second thought."
      },
      {
        "paragraph": "However, was Catherine such an evil woman?"
      },
      {
        "paragraph": "If she was evil, why did she save him yesterday? Could someone really hide themselves so well?\nMatthew continued to flip through the document."
      },
      {
        "paragraph": "Once again, something caught him by surprise.“"
      },
      {
        "paragraph": "Catherine is the chief design officer of Hazle Group?”"
      },
      {
        "paragraph": "He had met the owner of Hazle Group, who was a talented man. The owner was also the one who\npersonally designed the most popular hotel in Neah Bay."
      },
      {
        "paragraph": "Unexpectedly…"
      },
      {
        "paragraph": "This woman had astonished him a lot."
      },
      {
        "paragraph": "“Put this on the back burner first. ” Matthew closed the file. “I’ll handle it by myself.”"
      },
      {
        "paragraph": "“Okay.” The assistant was baffled. Dealing with a woman like Catherine was just like squashing an ant.\nWhy did Matthew need to handle it by himself?"
      },
      {
        "paragraph": "The prison gate."
      },
      {
        "paragraph": "Catherine waited for about 20 minutes before the prison warden called her in."
      },
      {
        "paragraph": "Soon, she saw Sally."
      },
      {
        "paragraph": "Having not seen her for several years, Sally looked much older at this point. She used to be in good\nshape, but she currently looked close to her 70s even though she was only in her 50s. Her face was\nfilled with wrinkles. Catherine could tell that she had not been living well in prison."
      },
      {
        "paragraph": "“Aunty… ” Catherine lifted the handset and gazed through the transparent glass that separated them."
      },
      {
        "paragraph": "“Ha. You used to call me Mom, but now you’re calling me Aunty. It’s pointless raising you for more than\nten years, b*tch.” Sally looked at Catherine as if she was her enemy."
      },
      {
        "paragraph": "“ I’m calling you Aunty simply because I’m well- mannered. ” Catherine said nonchalantly, “After all, you\nkilled my biological grandmother, so you don’t deserve my respect at all.”"
      },
      {
        "paragraph": "“Why are you looking for me then?” Sally suddenly scoffed. “Is it because you’re worried about the fact\nthat we’ll be released soon? After trying so hard to send us to jail, you never thought that we’d be out in\nless than four years, huh?”"
      },
      {
        "paragraph": "Catherine knitted her brows. “It’s Rebecca’s doing, right? She’s back.”"
      },
      {
        "paragraph": "“Why? Are you scared?” Sally smiled smugly. “ Catherine Jones, karma will hit you very soon. Rebecca\nwill pay you back with interest for all you’ve done to us. Just wait.”"
      },
      {
        "paragraph": "“Sure enough…”"
      },
      {
        "paragraph": "Upon receiving the answer she wanted, Catherine bit her lip. “ Sure. She got away four years ago, but\nnow that she has returned rashly, I’ll take her down. I forgot to inform you that I once sold Rebecca to\nthe mountains after you got into jail."
      },
      {
        "paragraph": "Tsk. That was probably the highlight of her entire life.”"
      }
    ]
  },
  {
    "title": "Chapter 1418 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“What did you say?”"
      },
      {
        "paragraph": "Catherine’s provocative words made Sally fly into a rage. “B*tch, how dare you do that to Rebecca?"
      },
      {
        "paragraph": "You’ll be dead this time. She won’t let you get away, and we’re going to put you through hell.”"
      },
      {
        "paragraph": "“Just because she said so?”"
      },
      {
        "paragraph": "“You don’t even know Rebecca’s identity now. Haha. She can take you down as easily as squashing an\nant. Having Shaun to protect you won’t help."
      },
      {
        "paragraph": "Even the prime minister of Australia won’t be able to protect you,” Sally roared with clenched teeth."
      },
      {
        "paragraph": "“Really? I can’t wait.”"
      },
      {
        "paragraph": "Catherine smirked, but deep down, she was overwhelmed with frustration."
      },
      {
        "paragraph": "There must be some grounds for Sally’s remarks. She definitely knew what was going on."
      },
      {
        "paragraph": "Catherine did not call Jeffery out because he was more manipulative than Sally. Even if he knew about\nthe matter, he would be tight-lipped about it."
      },
      {
        "paragraph": "Unlike him, Sally would give it away when she was provoked."
      },
      {
        "paragraph": "“Haha. Catherine, you can continue to be smug, but it’s no use. Even God won’t be able to save you."
      },
      {
        "paragraph": "Haha.” Sally suddenly burst into laughter. “I heard you’re going back to Canberra now, right? Just wait.\nWe’ll come and look for you once we’re out.”"
      },
      {
        "paragraph": "Catherine put down the handset. Then, she turned around and left."
      },
      {
        "paragraph": "Shaun, who was outside the prison, strode toward her as soon as he saw her. He held her hands. “How\nis it?”"
      },
      {
        "paragraph": "“It does have something to do with Rebecca.” Catherine went quiet for a moment before she added, “I\nmanaged to sound Sally out. It seems that Rebecca is involved with some big gun. That big gun could\nbe equally or more powerful than the prime minister of Australia.”"
      },
      {
        "paragraph": "Shaun’s expression became somber. “Who the hell is that blind man interested in a woman like\nRebecca?”"
      },
      {
        "paragraph": "“I have no idea what’s wrong with the world.” Catherine laughed bitterly. “But just like Sarah, Rebecca\nis great at pretending. Many men fall into this kind of trap.”"
      },
      {
        "paragraph": "“It’s alright. There’s a solution to every problem.” Shaun wrapped his hand around her waist. “Let’s\nreturn to Melbourne. The new product of Hill Corporation will be launched soon.”"
      },
      {
        "paragraph": "“Mm.”"
      },
      {
        "paragraph": "Catherine nodded. However, before she left Melbourne, she called Logan and Austin over. “ Please\nkeep an eye on the prison. I have a feeling that Rebecca might show up after Jeffery and Sally are\nreleased. But don’t tail them too closely. Both of you should separate yourselves from each other when\nshadowing them. If one of you is in danger, at least the other person can save you.”"
      },
      {
        "paragraph": "“You mean…?” Logan was dumbfounded. “Be careful.” Catherine reminded them."
      },
      {
        "paragraph": "After returning to Canberra, Hill Corporation organized a press conference where Shaun personally\ngave a speech on stage."
      },
      {
        "paragraph": "In the public’s eyes, Hill Corporation had already become a shadow of its former self. Even other\ncompanies within the industry did not pay them much attention. Hence, only a handful of reporters were\npresent. There were ten or so reporters scattered around the venue."
      },
      {
        "paragraph": "“President Hill, did you suddenly venture into the electric appliances industry because the Campos\nfamily has recently invested 5oo billion dollars in electrical products? Are you planning to compete with\nthe Campos family? But I don’t think Hill Corporation can compare to the Campos family in terms of its\ncurrent net worth and rank.”"
      },
      {
        "paragraph": "“President Hill, you must be kidding. The Campos family has introduced Garson Corporation’s\ntechnology to develop their electrical products."
      },
      {
        "paragraph": "How can Hill Corporation compare to them?”"
      },
      {
        "paragraph": "Stung by the reporters’ mockery, Shaun gave a faint smile. “The Campos family is still in the middle of\ndeveloping the product. However, Hill Corporation has developed the product, and it’ll be launched\nglobally three days later. You guys can have a look a t our latest model of transformer and X-ray\ngenerator…”"
      }
    ]
  },
  {
    "title": "Chapter 1419 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "At the same time, in Campos Corporation."
      },
      {
        "paragraph": "While a group of executives was having a meeting, Mason sat on the main leather chair impassively.\nAll of a sudden, an employee from the technical department barged in. “Oh no, Chairman Campos.”"
      },
      {
        "paragraph": "“Can’t you see we’ re having a meeting? What are you fussing about?” Charlie thumped the table with\na gloomy expression."
      },
      {
        "paragraph": "“President Campos, Hill Corporation has just held a press conference…”"
      },
      {
        "paragraph": "“ I’ve heard about it. Hill Corporation is trying to compete with us by venturing into the electric\nappliances industry. They’re biting off more than they can chew.” Charlie snorted. “No matter how much\neffort they put in, the technology they adopt will never be able to surpass ours. What’s more, we’ve\nreleased the data of our latest electrical products. None of the businesses out there will want to\ncollaborate with Hill Corporation.”"
      },
      {
        "paragraph": "“No, President Campos.” The employee took out a datasheet. “This is the latest model of their"
      },
      {
        "paragraph": "transformer and X-ray generator. Based on the data, their top products are much greater than ours.”"
      },
      {
        "paragraph": "“What are you saying?” Mason sprang to his feet, and his elegant face was extremely grim. “Let me\nsee.”"
      },
      {
        "paragraph": "The employee handed him the datasheet."
      },
      {
        "paragraph": "After Mason looked at it, his face was flushed with anger."
      },
      {
        "paragraph": "”What’s the matter, Chairman Campos?”"
      },
      {
        "paragraph": "The executives of Campos Corporation began to panic. “Didn’t you say that Garson would provide us\nwith the best technology in the world? Why can’t our product data beat those of Hill Corporation?”"
      },
      {
        "paragraph": "“The worst thing now is that Campos Corporation has already invested 5oo billion dollars in the\nproducts! ”"
      },
      {
        "paragraph": "“Doesn’t it mean that our money’s all gone? Since Hill Corporation’s product data are greater and their\nproducts are cheaper than ours, who else is going to buy our products?”"
      },
      {
        "paragraph": "“On top of that, Hill Corporation will launch their products globally after three days. The soonest we can\ndevelop our products will be one month later."
      },
      {
        "paragraph": "We’ve completely lost our competitive edge.”"
      },
      {
        "paragraph": "“Who on earth suggested venturing into the electric appliances industry earlier? Who got Garson to\nwork with us? Could we have fallen into a trap?”"
      },
      {
        "paragraph": "Facing the crowd’s comments, Charlie’s face was red with anger. “Uncle, this is impossible. When\nGarson Corporation signed the contract with us, they told us that they’d provide us with top-notch\ntechnology. I’ve done some research as well. This type of technology hasn’t been adopted by any other\ncompanies in the world…”"
      },
      {
        "paragraph": "“Shut up.”"
      },
      {
        "paragraph": "Mason lifted a glass and flung it at him."
      },
      {
        "paragraph": "With a loud bang, the glass directly hit Charlie in the head. His head buzzed as blood began to trickle\ndown from the top of his head."
      },
      {
        "paragraph": "Complete silence befell the meeting room. This was everyone’s first time seeing Mason, who had\nalways been cool-headed, get so furious."
      },
      {
        "paragraph": "“Mason…” Maurice immediately drew some tissue and covered his son’s head."
      },
      {
        "paragraph": "“500 billion dollars.” Mason snickered. “We’ve invested all the profits from selling the microchips in the\nproducts.”"
      },
      {
        "paragraph": "Charlie’s lips quivered. “Oh no, Chairman Campos.” The door of the meeting room was pushed open\nonce again. It was Mason’s assistant who dashed in. “ Leslie Dam is going to build the largest\nhydroelectric power station in Australia, and they’ve already contacted Hill Corporation to work on\nbuilding it together.”"
      }
    ]
  },
  {
    "title": "Chapter 1420 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“What?” The executives were shocked. “Leslie Dam has originally planned to work on building the\nlargest hydroelectric power station with us. We’ve verbally agreed on it earlier. If we could secure this\nproject, we would be able to earn at least 400 billion dollars.”"
      },
      {
        "paragraph": "The assistant forced a smile. “Besides that, a lot of local and foreign hospitals have frantically booked\nthe X-ray generators that Hill Corporation developed because they are cheaper than ours."
      },
      {
        "paragraph": "Moreover, the cost of their products is more affordable. The product also turned out to be very effective\nafter they conducted a try-out on the spot. Hill Corporation’s shares have hit the daily limit just a\nmoment ago, and a huge amount of funds has even been invested in them. It means that the public is\nvery optimistic about their prospects.”"
      },
      {
        "paragraph": "“Copycat. They copied our product.” Charlie thumped on the table furiously. “I understand it now.\nGarson Corporation must have tricked us. I’m sure they provided Hill Corporation with better\ntechnology. I’m going to look for them.”"
      },
      {
        "paragraph": "Mason did not stop him."
      },
      {
        "paragraph": "The commotion in the meeting room lasted for a long while before he rose to his feet and said, “\nDismissed.”"
      },
      {
        "paragraph": "Once Mason returned to his office, he broke his laptop screen with a punch."
      },
      {
        "paragraph": "“Aw, what’s wrong, Hubby?” Joanne, who was dressed to the nines, was shocked at the sight of\nMason’s behavior. “Hubby, who pissed you off? Simmer down. I’ll have lunch with you, okay?”"
      },
      {
        "paragraph": "“Get lost.” Mason pushed Joanne away. Since she was wearing a pair of high heels, she fell onto the\nground and instantly wept in pain."
      },
      {
        "paragraph": "“If you want to cry, do it outside. I’m not in the mood to watch you cry,” Mason bellowed at her in\nexasperation."
      },
      {
        "paragraph": "Joanne was stunned. She had hardly seen Mason get so infuriated."
      },
      {
        "paragraph": "“You may go out first, ” Maurice said as he walked in."
      },
      {
        "paragraph": "Joanne immediately ran out."
      },
      {
        "paragraph": "For some reason, Mason felt a sense of disgust at the sight of her expression. When he was in power,"
      },
      {
        "paragraph": "he needed a gentle and understanding woman. However, such a woman was useless when a crisis\nwas almost upon him."
      },
      {
        "paragraph": "“The situation doesn’t look good.” Maurice said with a frown, “Lea and Shaun have been putting up with\neverything in silence these days. They’ve"
      },
      {
        "paragraph": "made us think that Hill Corporation has become a shadow of its former self when, in fact, they’ve been\ntight-lipped about their big plan. We’ve underestimated the two of them.”"
      },
      {
        "paragraph": "“Don’t you get it yet? It’s not just Hill Corporation but also Garson.” Mason clenched his fists. “We got\ncheated. It can’t be a coincidence. Garson provided us with top-notch electrical technology, yet Hill\nCorporation got it earlier than us. I guess Shaun has long since struck a deal with Garson.”"
      },
      {
        "paragraph": "Maurice was stunned. “We’re obviously more powerful than Hill Corporation. I don’t get how Garson will\nbenefit from working with Hill Corporation privately. By doing this, Garson will also ruin its own\nreputation. Who’s going to work with Garson from now on?”"
      },
      {
        "paragraph": "“I don’t get it either. But since Garson has done this, do you think we still get to threaten them? I\nsuppose they have fully prepared for this. Garson has set us up.” Mason became so exasperated the"
      },
      {
        "paragraph": "more he spoke that he punched the wall. “With Shaun’s ability, he can easily jump at the chance to\nmake a comeback. I’ve endured the humiliation for over ten years… D*mn it.”"
      },
      {
        "paragraph": "“Sure enough, we should’ve gotten rid of him back then.” Maurice was filled with regret."
      },
      {
        "paragraph": "“Do you think I’ve never thought of it? I’ve tried to kill Shaun a few times now, but he has managed to\nescape every time. ” Mason looked back and said to Maurice, “Let Wesley know that if our family\ncollapses, he’s going to suffer as well. The only way out now is to make Shaun disappear into thin air. ”"
      },
      {
        "paragraph": "“Brother, Wesley won’t listen to us.” Maurice bit his tongue before he continued, “When Wesley’s\ncompany was in trouble earlier, he asked us for help a few times, but we rejected him.”"
      },
      {
        "paragraph": "The Campos family could not be bothered about Wesley before this, but who knew that they would\nencounter such a crisis so suddenly?"
      },
      {
        "paragraph": "“Let’s…” Mason narrowed his eyes. “Put Lea through hell.”"
      },
      {
        "paragraph": "Maurice shuddered. “Do we need to call that bunch of people to take action?”"
      },
      {
        "paragraph": "“Mm. We’ve spent so much money. It’s time to make use of them. Get all of them to act,” Mason\nordered grimly."
      },
      {
        "paragraph": "Those people were exceptionally brutal. When all of them took action, no one would be able to cope\nwith it."
      }
    ]
  },
  {
    "title": "Chapter 1421 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Hill Corporation."
      },
      {
        "paragraph": "After completing the interview with the press, Shaun lifted his phone, which showed a message on the\nscreen."
      },
      {
        "paragraph": "As soon as he finished reading the message, he deleted it."
      },
      {
        "paragraph": "“Shaun, I just got off the phone with the president of Raffles Corporation. They’d like to buy 30,000\ntransformers and sign a five-year contract with us.” Lea came in with a gleeful look on her face."
      },
      {
        "paragraph": "Hill Corporation had been hit very badly this year mainly because of her. Hence, seeing the company\nrise from the dead made Lea more excited and pleased than anyone else."
      },
      {
        "paragraph": "“Raffles initially planned to work with Campos Corporation. But now that we’ve stolen the Campos’s\nbusiness, Mason must be holding a grudge against us, ” Shaun said indifferently as he sat down and\nleaned against the chair."
      },
      {
        "paragraph": "Lea snorted. “Campos Corporation has always been"
      },
      {
        "paragraph": "stealing other people’s works. This time, they reap what they sow. We just beat them at their own\ngame. As far as I know, Campos Corporation has invested 5oo billion dollars in the electric appliances\nindustry. Now that we’ve launched our new products first, their 500 billion dollars have basically gone\ndown the drain. Your idea is brilliant.”"
      },
      {
        "paragraph": "“ It’s not my idea. It’s Dad who came up with it, ” Shaun suddenly said."
      },
      {
        "paragraph": "Lea was stunned. All of a sudden, she was overwhelmed with a mix of emotions. “Considering that\nGarson Corporation and Campos Corporation have signed the contract earlier, will your dad… be in"
      },
      {
        "paragraph": "trouble?”"
      },
      {
        "paragraph": "“No.” Shaun shook his head. “Dad already has a surefire plan. As for you…”"
      },
      {
        "paragraph": "After a moment’s pause, his expression became grave. “I heard that Mason is going to do something to\nyou.”"
      },
      {
        "paragraph": "Lea was shocked to the core. Only after some time did she clench her fists. “What is he going to do to\nme? Kill me?”"
      },
      {
        "paragraph": "“Kidnap and torture you so that you’ll compromise and give up on the product launch. Otherwise, he’ll\ntake your life away, ” Shaun whispered."
      },
      {
        "paragraph": "“What a despicable man. ” Lea was trembling with anger. “We’re all business people. Why can’t he\nconfront me above board?”"
      },
      {
        "paragraph": "She had always known that Mason was cruel, but when she learned that he was going to kidnap her,\nshe found it hard to accept it. “Shaun, are you sure that’s true?”"
      },
      {
        "paragraph": "“Absolutely. But don’t tell anyone about it.”"
      },
      {
        "paragraph": "Shaun leaped to his feet and said, “There are two ways now. The first option is that I’ll get someone to\nprotect you all the time, but I’m not sure if this will work since Mason is getting the top killers to take\naction this time. What’s more, if the killers"
      },
      {
        "paragraph": "fail, they’ll definitely notice that their news has been exposed. As a result, they might sniff out my spy.\nAnother way is to let them kidnap you, but I’ll place a tracker on you. When Mason starts torturing you,\nwe’ll report it to the police and save you with the police’s help. We’ll then be able to get those killers\nand Mason arrested on the spot. Without Mason, Campos Corporation will fall apart.”"
      },
      {
        "paragraph": "Lea looked at her son in astonishment. She kept quiet for a long while before she spoke again, “ I’ll go\nfor the second one. It’s Mason who made the Hill family and Willie suffer. They’re also partly\nresponsible for Liam’s death. I want him to be sent to jail. I’ll end the problem I’ve caused on my own.”"
      },
      {
        "paragraph": "Shaun loosened the tie around his neck and sighed. “Mom, let me remind you something. Since Mason\nhas the intention of capturing you, he won’t care about your past relationship with him. He’ll certainly\ntake great pains to torture you, and the process can be very painful.”"
      },
      {
        "paragraph": "“Could the pain be as bad as your uncle’s suffering? Ever since Willie became a fool, he has never\nspoken to me. Could the pain be as bad as losing Liam?” Lea smiled despondently with reddened\neyes. “Even if I were to die, I deserve it. But keep in mind, you must bring Mason to justice, whether it’s\nthrough the tracker on my dead body or by other means.”"
      }
    ]
  },
  {
    "title": "Chapter 1422 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun gazed at Lea deeply for a long while. “Later, you can pretend that you’re feeling unwell and\nhead to the Jewell family’s hospital. After you get there, Chester will have someone inject a tracker into\nyour body.”"
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "After Lea went to the hospital, Shaun went to the villa Brennan lived in."
      },
      {
        "paragraph": "“Dad, did the Campos family look for you today?”"
      },
      {
        "paragraph": "“Charlie has brought his people to Country Y to look for me. However, he doesn’t know that I’ve never\nleft Canberra at all.” Brennan was holding a watering can, watering plants in the garden. “Don’t worry.\nBesides giving Garson Corporation some negative image and pressure, the Campos family can’t do\nanything to me with just a contract.”"
      },
      {
        "paragraph": "Shaun walked to Brennan’s side and suddenly said, “The Campos family has decided to kidnap Mom\nto threaten me. Mom has agreed to inject a tracker"
      },
      {
        "paragraph": "into her body, and we’ll cooperate from the inside and outside. When the time comes, we’ll capture\nMason on the spot.”"
      },
      {
        "paragraph": "Brennan’s arm stiffened. After a moment, he said, “ This is indeed the only chance to get some dirt on\nMason quickly. Based on Mason’s character, he’ll definitely take the money and leave Australia if he\ncan’t overcome this hurdle. By that time, it’ll be hard to catch him.”"
      },
      {
        "paragraph": "Shaun replied in the affirmative with his brows knitted in a tight frown."
      },
      {
        "paragraph": "“Shaun…” Brennan put down the watering can. Then, he patted Shaun’s shoulder lightly. “At the end of\nthe day, all these happened because of Lea. If she doesn’t do this, she’ll never be able to face the Hill\nfamily members in her entire life.”"
      },
      {
        "paragraph": "“ I understand, Dad. ” Shaun nodded. However, he still could not help letting out a long sigh in his\nheart."
      },
      {
        "paragraph": "That night, Shaun returned to the Hill family’s residence and took a bath. After that, he sat alone in the\nstudy instead of reading to the children, which was rare."
      },
      {
        "paragraph": "He sat there for some time before Catherine pushed the door open. The warm light fell on her hair, and\nthere was a smile on her lips. “Young Master Hill, what’s wrong? Why aren’t you going to sleep yet? Is\nit because you’re too excited about becoming the First Young Master of Australia again soon that you\ncan’t sleep?”"
      },
      {
        "paragraph": "“Where are Suzie and Lucas?” Shaun extended his hand toward her."
      },
      {
        "paragraph": "“I finally coaxed them to sleep. ” Catherine held his hand and sat on his lap. Noticing his furrowed\nbrows, she could not resist rubbing his thick eyebrows with her hand. “You have something on your\nmind. Are you unhappy?”"
      },
      {
        "paragraph": "“I’m not unhappy. I’m worried.” Shaun tapped his phone on the table. “I can’t reach my mom’s phone\nanymore, and I can’t reach her assistant either. I suspect something has already happened to her.”"
      },
      {
        "paragraph": "Catherine was shocked. She wanted to stand up immediately, but Shaun grabbed onto her waist tightly.\n“This is a plan my mom and I have discussed. It’s also the only way to catch Mason. Cathy, I really\nused to dislike this mom of mine. Ever since I was young, she has never fulfilled any of her"
      },
      {
        "paragraph": "responsibilities toward me. However, I only realize now that my mom is still my mom after all. I’m afraid\nsomething will happen to her.”"
      },
      {
        "paragraph": "“So you both…” Catherine gaped. Looking at Shaun’s state, she suddenly did not know what to say.\n“Nothing will happen. Mason must’ve kidnapped her to threaten you. If he hasn’t succeeded in\nthreatening you yet, your mom won’t be in danger.”"
      },
      {
        "paragraph": "“Cathy, you’re always so clever. ” Shaun touched her small face. “However, Mason was deceived by\nme this time. He’ll surely vent his anger on my mom. I’m afraid…”"
      },
      {
        "paragraph": "Catherine held his hand tightly. At a loss, she asked, “When do you plan to take action?”"
      }
    ]
  },
  {
    "title": "Chapter 1423 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“I have discussed it all with my mom. After she gets kidnapped, she has to think of a way to lure Mason\nout no matter what. Therefore, she has to spend at least a whole day there. ” Shaun clenched his fists.\nAfter a moment, he pushed Catherine away gently. “ I have to go out and look for my mom. The act has\nto be done properly so that Mason won’t suspect anything.”"
      },
      {
        "paragraph": "“Go,” Catherine said. “I’ll be by Suzie and Lucas’s side these few days.”"
      },
      {
        "paragraph": "“Mm. After Mason and that group of killers have been caught, Suzie and Lucas can go to preschool as\nusual. Without the Campos family as his backing, Wesley can’t cause any problems no matter how\ngreat he is.”"
      },
      {
        "paragraph": "Shaun caressed Catherine’s hair. “After Mason has been dealt with, the next one will be Wesley.”"
      },
      {
        "paragraph": "At that, Catherine let out a breath of relief."
      },
      {
        "paragraph": "If both Mason and Wesley were sent to jail, she would not be that frightened of Rebecca returning, no\nmatter how strong of a backing she had."
      },
      {
        "paragraph": "3:00 a.m."
      },
      {
        "paragraph": "Lea regained consciousness after getting splashed with a bucket of water."
      },
      {
        "paragraph": "Her eyes snapped open. The first thing she saw was a buff black man, followed by four to five\ntowering- figured foreign men sitting at the side. Some of those people were fiddling with their guns,\nwhile some were sharpening their knives."
      },
      {
        "paragraph": "Lea was not a fool. Although it was just a glance, she could tell that those people were not just ordinary\ngangsters. They had definitely taken many lives before."
      },
      {
        "paragraph": "“Who… Who are you?” Lea got nervous. She had just attended a social engagement that night and\nwas on the way back when she got kidnapped."
      },
      {
        "paragraph": "She did not know whether those people had discovered the tracker inside her body or not while she\nwas unconscious."
      },
      {
        "paragraph": "“Guess.” The black man grinned. His row of white teeth looked frightening and creepy."
      },
      {
        "paragraph": "“Bank, stop scaring her. ” A tattooed man walked over and said, “Hill Corporation is on quite a roll now.\nWe’ve been commissioned by someone…”"
      },
      {
        "paragraph": "“They must’ve paid a lot to commission you. I can offer double that amount as long as you let me go,”\nLea said frantically."
      },
      {
        "paragraph": "“Haha, your words are quite tempting. Unfortunately, our occupation has its own ethics too. If we betray\nsomeone anyhow, how will we get any business in the future?”"
      },
      {
        "paragraph": "After the tattooed guy finished laughing, he caught sight of Lea’s ashen face and said with a fake smile,\n“However, if you serve me well, maybe… I can change my mind.”"
      },
      {
        "paragraph": "“Bart, you must be crazy. She’s a 50—year—old woman. Haven’t you touched a woman before?” That\nblack man called Bank grabbed the tattooed guy’s hand and warned him."
      },
      {
        "paragraph": "“Tsk. Well, she has taken quite good care of herself, so she still has the charm. Moreover, she’s Hill\nCorporation’s eldest daughter. I heard she used to be the most beautiful woman in Canberra. I’ve never\nhad a taste of one before. Hehe. ” Bart’s laugh was especially sleazy."
      },
      {
        "paragraph": "“Enough. The employer said no.” Bank shook his head."
      },
      {
        "paragraph": "Bart snorted."
      },
      {
        "paragraph": "Lea was so nervous that her heart began to tremble. She may have already made all sorts of mental\npreparation, but if those people really did… She would be too ashamed to continue living."
      },
      {
        "paragraph": "Luckily, luckily…"
      },
      {
        "paragraph": "“Was it… the Campos family who hired you guys?” Lea suddenly said with her voice quavering, “Get\nMason here. I want to see him.”"
      },
      {
        "paragraph": "Bart glanced at her. “You don’t need to know about that.”"
      },
      {
        "paragraph": "Lea was shocked. Those words meant that Mason did not intend to show his face. If so, then what did\nshe endanger herself for? She had to lure Mason out. Bart took out a phone and snapped two pictures\nof Lea before going out."
      }
    ]
  },
  {
    "title": "Chapter 1424 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“What are you guys doing?” Lea suddenly got agitated. She started thrashing around on the floor with\nall her might."
      },
      {
        "paragraph": "“ Shut up and be quiet.” Bank kicked Lea. “We sent pictures to your son. If he still wants you alive, he\nmust do as we say. If not, we’ll kill you.”"
      },
      {
        "paragraph": "“It must be Mason. It’s him who wants to use me to threaten Shaun, right? He can dream on. All he\nknows is to use such despicable methods every single time. Hill Corporation has finally managed to\nrise again, so he can forget about using me to threaten the Hill family. Even if I die, I won’t let him have\nhis way.”"
      },
      {
        "paragraph": "After Lea finished speaking, she gritted her teeth and knocked her head on the ground hard. Soon,\nblood started to flow out from her head, and she fainted."
      },
      {
        "paragraph": "“F*ck, ” Bank swore. He immediately contacted Mason."
      },
      {
        "paragraph": "“A bunch of useless things. You can’t even keep an eye on a woman, ” Mason scolded. “How is her\ncondition right now?”"
      },
      {
        "paragraph": "“She must be treated immediately. Otherwise, she’d die, ” Bank said as he looked at the puddle of\nblood on the floor."
      },
      {
        "paragraph": "“ I’ll send a doctor over right away. ” Mason flung his phone out of anger."
      },
      {
        "paragraph": "In the meantime, Shaun received the two pictures of Lea from the kidnappers while rushing to the\npolice station."
      },
      {
        "paragraph": "Following that, his phone rang. It was obvious that the people on the other side of the phone were\nusing a voice changer."
      },
      {
        "paragraph": "“Shaun, if you don’t wish for your mom to die, give up on launching the new products. At the same\ntime, send the data of the new products over. If not, you’ll be seeing your mom’s corpse tomorrow\nmorning.”"
      },
      {
        "paragraph": "Shaun sneered. “You must be Mason’s men, right? Can’t Mason do anything else besides stealing and\nsnatching other people’s data? Campos Corporation is a top mega-corporation in Australia, yet all they\ndo is illegal stuff.”"
      },
      {
        "paragraph": "“Why do you care who I am? All you need to know is"
      },
      {
        "paragraph": "that if you don’t do as I say, you’ll have to bear the consequences.” The kidnapper laughed sleazily. “Of\ncourse, before your mom dies, I can still have fun with her. Playing Young Master Hill’s mother must be\nquite something.”"
      },
      {
        "paragraph": "“Don’t you dare.” Shaun’s gaze turned ruthless as his fist punched on the steering wheel."
      },
      {
        "paragraph": "“You can try. But if you saw it in real action, I’m afraid you won’t be able to take it. Haha.” The\nkidnapper laughed."
      },
      {
        "paragraph": "“I must give this some thought…”"
      },
      {
        "paragraph": "“You don’t have the right to think about it. ” The kidnapper cut him off abruptly. “I want to see you act\nbefore daylight comes.”"
      },
      {
        "paragraph": "Shaun said coldly, “ If I stop the launch, I’ll have to face a huge amount of compensation. Hill\nCorporation has already lost a huge sum of money before this, so there’s no way I can afford to do it"
      },
      {
        "paragraph": "again this time. I cannot agree with your"
      },
      {
        "paragraph": "conditions. If Hill Corporation’s future can be secured in exchange with my mom’s life, then I have no\nchoice but to give her up.”"
      },
      {
        "paragraph": "“ Shaun, are you abandoning your mother just for money?” The kidnapper did not believe his words at\nall."
      },
      {
        "paragraph": "“I don’t have such deep feelings for her anyway. You’ll know if you ask around. After she left my dad,\nstarted a new family, and established her career, she didn’t even care about me, her son. If it weren’t\nfor my own capabilities, I wouldn’t have"
      },
      {
        "paragraph": "had the chance to inherit Hill Corporation. You guys really used the wrong person to threaten me.”"
      },
      {
        "paragraph": "Shaun hung up after he spoke."
      },
      {
        "paragraph": "After the call ended, his eyes were bloodshot from anger."
      },
      {
        "paragraph": "“Eldest Young Master…” Hadley looked toward Shaun worriedly. “There’s news from Chance. Mason\ndidn’t go over, but it seems like he did send a doctor there…”"
      },
      {
        "paragraph": "Shaun’s body jolted."
      },
      {
        "paragraph": "Although he had installed a tracker, he did not know what was happening there at all."
      },
      {
        "paragraph": "“Now… What do we do?” Hadley asked."
      }
    ]
  },
  {
    "title": "Chapter 1425 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Wait for a little while more. Since the kidnapper has failed to persuade me, he’ll definitely find a way to\ncontact my grandpa. Capturing my mother"
      },
      {
        "paragraph": "wasn’t easy for them, so I’m sure they won’t give up on this piece of chess for now. Since Mason has\nsent a doctor over, it means he won’t let my mom die for the time being.” Shaun’s fists clenched tightly.\n“Once Mason shows up, inform the police to move immediately.”"
      },
      {
        "paragraph": "“But we don’t know when exactly Mason will show up.” Hadley looked worried."
      },
      {
        "paragraph": "3:00 a.m."
      },
      {
        "paragraph": "When the Campos’s family doctor rushed over, the floor was already stained with Lea’s blood from her\nforehead."
      },
      {
        "paragraph": "After a round of emergency rescue, the doctor had no choice but to give Mason a call. “Director\nCampos, she… hit her head really hard, and she has also lost the will to survive. If you don’t send her\nto the hospital, I have no confidence… that I can save her.”"
      },
      {
        "paragraph": "“No confidence?” The other side of the phone went silent for a while before Mason’s violent roar\nsounded. “ I’ve spent so much money to fund you, yet you can’t even f*cking save a person. What did I\nfund you for?”"
      },
      {
        "paragraph": "“The main reason is… she has lost the will to survive, ” the doctor said helplessly."
      },
      {
        "paragraph": "“Useless things.” Mason was scolding non-step on the other end. Only after a while did he suddenly\nrecall the first time he met Lea at university."
      },
      {
        "paragraph": "At that time, she was the favored girl high up in the clouds, arrogant and beautiful."
      },
      {
        "paragraph": "Mason did fall in love at first sight."
      },
      {
        "paragraph": "Initially, he wanted to wait until he married her, and even if he had sucked Hill Corporation dry, he\nwould not abandon her. He would treat her well for his whole life."
      },
      {
        "paragraph": "However, Lea betrayed him first and got together with Brennan."
      },
      {
        "paragraph": "Afterward, she even had a child with Brennan."
      },
      {
        "paragraph": "Mason could also sense that her feelings had started to change slowly after she married Brennan.\nFrom then onward, his hatred for her grew in his heart. He hated that woman."
      },
      {
        "paragraph": "Therefore, Mason kept scheming to drive a wedge between Lea and Brennan so that she would\ndivorce Brennan. Unfortunately, Lea did not sense anything at all. Although she divorced Brennan, she\ndid not care about Mason as much as before. She kept mentioning Brennan in her words, and she\nwould always mistakenly call Mason Brennan when she was dating him."
      },
      {
        "paragraph": "In the end, she had sex with Brennan again and had Liam."
      },
      {
        "paragraph": "At that time, Mason had no choice but to play along and make Lea misunderstand that Liam was his\nchild. For Liam’s sake, she married him."
      },
      {
        "paragraph": "After their marriage, they got along harmoniously. However, no one knew how much hate he hid in his\nheart."
      },
      {
        "paragraph": "Mason kept thinking Lea was dirty, and at the same time, he looked for young, pretty women outside on\npurpose."
      },
      {
        "paragraph": "When Campos Corporation was finally in power, he felt an indescribable satisfaction to be able to\ntrample Lea beneath his feet."
      },
      {
        "paragraph": "Mason thought he did not care about her anymore. Yet, when he heard that she was about to die, he\nwas suddenly stunned."
      },
      {
        "paragraph": "He hated her and wanted to torture her, but he did not want her to die."
      },
      {
        "paragraph": "He had to keep the woman alive so that she could see him standing on top of the clouds while she\ncould only grovel by his side inferiorly like an ant."
      },
      {
        "paragraph": "Mason wanted to humiliate her. He wanted to humiliate her endlessly."
      },
      {
        "paragraph": "He did not know how long he stood there before he took the car keys and went out."
      }
    ]
  },


  {
    "title": "Chapter 1426 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "When Mason arrived at the place of the kidnapping, he saw the woman lying on the wooden bed with\nher head bandaged and her hand connected to an IV drip. Her face was as white as a sheet, as if she\ncould die any moment."
      },
      {
        "paragraph": "The scene where he first met Lea flashed across his mind. That year, she wore a red dress and looked\nlike the favored child of the heavens."
      },
      {
        "paragraph": "“Lea, wake up. You can’t die.”"
      },
      {
        "paragraph": "Mason rushed to the bedside and grabbed Lea strongly, shouting, “If you die, I’ll kill Liam. Haven’t you\nbeen looking for Liam all this while? Let me tell you. Liam is in my hands. If you die, I’ll kill him\nimmediately.”"
      },
      {
        "paragraph": "“Mason… You… Lunatic.” Lea struggled to open her eyes. The word “Liam” was the only reason she\npersisted. “Why… Why are you treating him like this? He’s your… son.”"
      },
      {
        "paragraph": "“Son?” Mason laughed out loud as if he had just heard a joke “Lea, you b*tch. He’s not my son at all.\nHe’s Brennan’s and your son.”"
      },
      {
        "paragraph": "Lea’s body jolted. Then, she broke down and started hyperventilating so badly that she almost fainted\nagain."
      },
      {
        "paragraph": "“That night, you were drunk. Brennan was the one who was with you.”"
      },
      {
        "paragraph": "Mason bent over and looked at her fiercely. “Lea, do you know why I hate you so much? That was the\nlast chance I gave you, yet you were together with Brennan again. You were reluctant to marry me, so I\npretended that I slept with you. I didn’t expect"
      },
      {
        "paragraph": "you would actually get pregnant in the end. I could only grit my teeth and said that child was mine. Do\nyou know how much contempt I felt in my heart whenever I see Liam all these years? I desperately\nwanted to kill him.”"
      },
      {
        "paragraph": "“You…” Lea’s whole body trembled as she gazed at the man in front of her. His eyes were clouded, and\nthey looked very fierce."
      },
      {
        "paragraph": "She had never wished for his death as desperately as at this current moment."
      },
      {
        "paragraph": "Her whole life was ruined all because of him."
      },
      {
        "paragraph": "Lea clearly could not hold out anymore, but she did not know where she got her strength from as she\nstrangled Mason’s neck."
      },
      {
        "paragraph": "“You want to kill me?” Mason pushed her hands away while sneering. “Are you dreaming, Lea? You\nmust be well and alive for me. If you die, I’ll kill Liam and bury him with you.”"
      },
      {
        "paragraph": "He pushed her away hard after he spoke."
      },
      {
        "paragraph": "Lea sprawled on the bed. Tears fell from the corners of her bloodshot eyes."
      },
      {
        "paragraph": "She was an utter joke her whole life."
      },
      {
        "paragraph": "She had mistaken a fake hypocrite for a guilty gentleman."
      },
      {
        "paragraph": "She always treated the Campos family and Mason well because she felt like she owed him for what\nhappened with Brennan."
      },
      {
        "paragraph": "In the end, she had hurt another man badly for the sake of this sc*m."
      },
      {
        "paragraph": "Lea even mistook her child’s biological father, which caused Liam and Shaun, who were biological\nbrothers, to become enemies for tens of years."
      },
      {
        "paragraph": "She was unworthy to be a mother."
      },
      {
        "paragraph": "“Call your dad.” Mason threw a phone to her coldly. “Make him force Shaun to hand over the\ninformation of Hill Corporation’s new products and stop the product launch. If not, I’ll throw you to those\nguys and let them serve you well.”"
      },
      {
        "paragraph": "Lea gazed at him in disbelief. “Are you still human?”"
      },
      {
        "paragraph": "“You were the one who drove me to this state.”"
      },
      {
        "paragraph": "Mason grabbed her face. “Lea, I’ve held myself back for more than 20 years to come this far. In those\n20 years, I was a f*cking flatterer every day at the Hill family. When I’ve finally achieved the position I\nhave today, the Hill family has to go against me as always. Do you know? Shaun doesn’t care about\nwhether you live or die at all. He even hung up our call. Now the only people who can save you are\nLiam and yourself.” “Is Liam… really still alive?” Lea laughed hoarsely. “ Will such a heartless, cruel\nperson like you keep him alive? If he’s still alive, why would you kidnap me? Isn’t using him to threaten\nme much more effective?”"
      }
    ]
  },
  {
    "title": "Chapter 1427 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Mason was shocked. He did not expect Lea could still analyze things so calmly when she was in that\nstate."
      },
      {
        "paragraph": "Ha! As expected of the woman he used to love. Too bad…"
      },
      {
        "paragraph": "“It’s useless, Mason. I won’t call my dad. Moreover, he’s already paralyzed. What can he do to Shaun?\nShaun has been Hill Corporation’s sole decision- maker for a long time.” Lea sneered."
      },
      {
        "paragraph": "“If you won’t call him, then I’ll do it. I’ll have your father listen to how his daughter gets raped.” Mason\nhad really been driven to insanity."
      },
      {
        "paragraph": "He waved his hand at those kidnappers."
      },
      {
        "paragraph": "Bart immediately came over while rubbing his hands together. He was even a little excited. “ President\nCampos, is it really okay?”"
      },
      {
        "paragraph": "“As long as you don’t kill her.” Mason looked at the scene cruelly."
      },
      {
        "paragraph": "Lea bit her lips hard."
      },
      {
        "paragraph": "When Bart pounced on her and ripped open her clothes, a sniper gun shot through Bart’s temple from\nthe outside with a bang."
      },
      {
        "paragraph": "The house fell into chaos in an instant. A rare look of panic and shock appeared on Mason’s cold face."
      },
      {
        "paragraph": "The voice of the kidnapper, who was standing guard outside, rang. “There’s police…”"
      },
      {
        "paragraph": "Mason snapped back to his senses and quickly put on a mask before rushing over to take Lea hostage."
      },
      {
        "paragraph": "The kidnappers who were still alive covered Mason to escape from the back door. However, when they\nopened the back door, they realized that they were already surrounded by a large group of police."
      },
      {
        "paragraph": "“Don’t move. I’ll kill her if anyone moves.” Knowing that he was tricked, Mason used a knife and held it\nat Lea’s neck, trembling."
      },
      {
        "paragraph": "“Don’t mind me. Just shoot. ” Lea yelled frantically, “He’s Mason Campos of Campos Corporation.”"
      },
      {
        "paragraph": "“ Shut up. I’m not,” Mason bellowed. He could not let anyone see his true face. As long as he escaped\nand used some money, he could run away with his money overnight. As long as he had money, going\nanywhere would be the same."
      },
      {
        "paragraph": "“Mason, the sniper already saw you clearly from outside. You can’t escape.”"
      },
      {
        "paragraph": "The surrounding police suddenly opened up a path, and a buff, towering man walked over from behind.\nHe wore a pair of long white pants matched with a black shirt. He had a body like a European model’s,\nand he exuded a strong, mature aura."
      },
      {
        "paragraph": "Although that chiseled face had the signs of aging on it, his eyes were still deep-set. The only\nunfortunate thing was the deep knife scar on his face. However, it did not look fierce. Instead, it added\na hint of wildness to him."
      },
      {
        "paragraph": "Mason’s arm trembled."
      },
      {
        "paragraph": "“It’s you. You’re not dead yet…” Mason was shocked."
      },
      {
        "paragraph": "Lea looked at the man in a daze. That was Brennan?"
      },
      {
        "paragraph": "Why would he turn up here?"
      },
      {
        "paragraph": "A lump appeared in Lea’s throat. They had not met for more than 20 years."
      },
      {
        "paragraph": "Unknowingly, both of them were already in their middle ages, yet he was still so mature and handsome."
      },
      {
        "paragraph": "However, why was there a scar on his face? Why did Mason say Brennan was not dead yet?"
      },
      {
        "paragraph": "“Are you surprised? It must be difficult for you to recognize me.” Brennan looked at Mason coldly. “"
      },
      {
        "paragraph": "That year, you threatened me to leave and even sent people to kill me overseas. You drove my mother\nand me into a corner. Your subordinate even took my mother’s life. From that time onward, the reason I\nlive is to take your life.”"
      },
      {
        "paragraph": "“I don’t know what you’re talking about.”"
      },
      {
        "paragraph": "Mason denied it in a loud voice. All he knew was that he could not admit who he was in front of the\npolice. “Step aside. If not, I’ll kill her immediately.”"
      },
      {
        "paragraph": "“You don’t have to use me to threaten people. ” Lea suddenly looked toward Brennan miserably. “ I’m\nsorry. I heard from Shaun that you had a tough life throughout these tens of years. I was the one who\ndid that to you, and I caused your mom’s death too. Even if I die here today, this is what I owe you. All\nof you don’t have to care about me.”"
      },
      {
        "paragraph": "After she spoke, she closed her eyes and decisively pushed herself toward the knife in Mason’s hand."
      },
      {
        "paragraph": "Mason was so startled that pressed her neck hard in a hurry."
      },
      {
        "paragraph": "“Mason… Campos… Don’t even think about… Taking me hostage.” Lea’s face was red from being\nchoked."
      }
    ]
  },
  {
    "title": "Chapter 1428 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Brennan clenched his fists. “Mason, you can leave. ”"
      },
      {
        "paragraph": "Lea was stunned. She widened her eyes and looked toward him. “No…”"
      },
      {
        "paragraph": "“You’re Shaun’s biological mother. I can’t possibly let you die.” Brennan waved his hand. After he made\neye contact with the police, the police moved aside."
      },
      {
        "paragraph": "Just like that, Mason slowly left while holding Lea. Afterward, he got in the car with two kidnappers who\nwere still alive."
      },
      {
        "paragraph": "“President Campos, what do we do now?” The kidnapper, who was driving, shouted angrily."
      },
      {
        "paragraph": "“My money and card are at the villa. Send me back there to get them, ” Mason said through gritted\nteeth."
      },
      {
        "paragraph": "“You really love money as if it’s your life, ” Lea said sarcastically."
      },
      {
        "paragraph": "“What the f*ck do you know?” Mason slapped her across the face. “If there’s no money, I can’t go\nanywhere.”"
      },
      {
        "paragraph": "Lea almost fainted from getting hit. However, she clenched her jaw and withstood it."
      },
      {
        "paragraph": "The car sped toward Mason’s hidden villa."
      },
      {
        "paragraph": "After Mason took Lea down from the car, Chance, who was standing guard at the villa, immediately\ncame over. “Director Campos, what… what happened to you?”"
      },
      {
        "paragraph": "“Chance, I’ll give you 500 million dollars to help me escape from here.” Mason knew Chance had\nexceptional fighting skills. That was also the reason why he spent a lot of effort to headhunt him."
      },
      {
        "paragraph": "With Chance’s skills, Mason believed that escaping would be much easier as long as Chance helped."
      },
      {
        "paragraph": "Chance’s eyes trembled. “But… My wife and children are here…”"
      },
      {
        "paragraph": "“As long as you protect me while I escape, you can still come back afterward. Chance, you’re my\nsubordinate. You and I are on the same boat. If I get caught, you’ll go to jail too, ” Mason warned."
      },
      {
        "paragraph": "“…Okay.” Chance clenched his fists."
      },
      {
        "paragraph": "“Keep a close eye on her. I’m going upstairs to get some stuff.” Mason handed Lea to the kidnappers\nand quicky went upstairs."
      },
      {
        "paragraph": "“F*ck, this old thing. He’s still wary of us even when trouble is upon us.” Bank snorted."
      },
      {
        "paragraph": "“He has no choice. He must be afraid that I’ll take all the treasures he’s hiding. ” Another kidnapper\nsnickered."
      },
      {
        "paragraph": "“Brothers, what exactly happened?” Chance asked. “The police suddenly…”"
      },
      {
        "paragraph": "Before Bank finished his sentence, his chest was suddenly stabbed with a knife."
      },
      {
        "paragraph": "Another kidnapper at the side widened his eyes as he looked toward Chance. Then, he lowered his\nhead to see a knife in his chest too. He opened his mouth."
      },
      {
        "paragraph": "However, before he could say anything, Chance knocked him out."
      },
      {
        "paragraph": "“Quick… Go and catch Mason,” Lea reminded hastily."
      },
      {
        "paragraph": "“There’s no need to worry. Young Master Hill is already upstairs. Let me send you to the hospital. ”"
      },
      {
        "paragraph": "Chance carried Lea and walked out of the villa. Right at that moment, the ambulance arrived and\ntransported Lea to the hospital."
      },
      {
        "paragraph": "Upstairs."
      },
      {
        "paragraph": "Mason was frantically packing the treasures in his safe."
      },
      {
        "paragraph": "Suddenly, footsteps rang behind him."
      },
      {
        "paragraph": "“Why did you guys come up… ” Mason turned his head back. Before he could finish his sentence, he\nsaw Shaun, who had come up from behind, choking him."
      },
      {
        "paragraph": "“Help… ” Mason reacted quickly and immediately started yelling. Shaun simply watched in amusement\nas Mason shouted for help. Only when Mason’s throat was hoarse from yelling did Shaun grin\nmockingly. “Do you think your men will save you? Chance has already dealt with the people\ndownstairs.”"
      }
    ]
  },
  {
    "title": "Chapter 1429 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Mason was not stupid."
      },
      {
        "paragraph": "In an instant, he understood everything. “Chance is your man?”"
      },
      {
        "paragraph": "“You’re wrong. He has always been my man.”"
      },
      {
        "paragraph": "Shaun dragged a chair and sat down slowly. He was not in a hurry. His gaze looked as if he was\nlooking at a mouse that was struggling on its brink of death. “Back then, you used Yael to steal Hill"
      },
      {
        "paragraph": "Corporation’s microchip’s data. Yael was indeed the black sheep of Liona, and in your eyes, Chance\nwas a man who would betray everything for the sake of a woman. You thought that by recruiting Yael,\nChance, a sharp blade, would naturally fall into your hands.”"
      },
      {
        "paragraph": "Mason had hidden his character for tens of years. He was confident that everything was in his hands.\nHowever, at that moment, he felt a sense of panic that he had never felt before."
      },
      {
        "paragraph": "“Are you thinking why Chance, who cares so much about his child, would ignore his child?”"
      },
      {
        "paragraph": "Shaun raised his eyebrows. “It is because Yael has long betrayed you. A person who’s capable of\nbetrayal once can betray someone a second time. It’s all thanks to your nephew, Ivan, who has been in\nan affair with Yael for a long time now. Tsk, he can’t even spare a pregnant woman. Your nephew has\nquite extreme taste. Through Yael, I’ve now gotten my hands on a lot of the Campos family’s illegal\nsecrets.”"
      },
      {
        "paragraph": "Mason’s breath quickened. The elegant look on his face was gradually replaced with fear."
      },
      {
        "paragraph": "“It looks like you know very well how many bad things the Campos family has done.”"
      },
      {
        "paragraph": "Shaun stood up slowly with his hands in his pockets. “The Campos family and Yule Corporation started\nan investment company together. However, the Campos family had been faking the accounts behind\neveryone’s backs all along. You even joined hands with Kawada to swallow Yule Corporation through\nillegal means and manipulated Yule Corporation’s shares. Furthermore, you stole Hill Corporation’s\nmicrochip’s data and made a deal"
      },
      {
        "paragraph": "involving a huge sum of money with Landell Group in secret. Landell Group is an overseas company.\nSo what did your actions mean? As an Australian, you took a product that a local Australian company"
      },
      {
        "paragraph": "painstakingly developed and handed it to an overseas company. You have betrayed the country. I need\nnot elaborate on how severe the consequences are, right?”"
      },
      {
        "paragraph": "Mason fell back onto the ground."
      },
      {
        "paragraph": "As he raised his head and looked at Shaun, his whole body could not help but tremble."
      },
      {
        "paragraph": "After a moment, he suddenly knelt in front of Shaun with a thump. “Shaun, seeing as Uncle Mason has\nknown you for tens of years, please let me go. I’ll give you everything. Money, jewelry, even Campos\nCorporation. You can return to the position of Australia’s wealthiest man anytime.”"
      },
      {
        "paragraph": "Mason knew he would be sentenced to death for every single thing he had done."
      },
      {
        "paragraph": "“Uncle?” Shaun snorted with dark flames burning in his eyes. “You think you’re worthy of that title? Do\nyou think I don’t know that you were the one who killed Liam?”"
      },
      {
        "paragraph": "After he said that, he grabbed Mason by the collar and punched him hard. “You fcking made Yael throw\nLiam into the sea. You pretended to be Liam’s father and made me and Liam hurt each other despite\nbeing biological brothers. You forced my biological father to leave Australia and made me parentless"
      },
      {
        "paragraph": "since I was young. You even killed my grandmother. Yet, you’re asking me to spare you? It’s fcking\ngood enough that I don’t kill you with my own hands.”"
      },
      {
        "paragraph": "In a fit of fury, Shaun kicked and stepped on Mason’s body hard."
      },
      {
        "paragraph": "Mason was over 5o years old, and he usually lived a comfortable life. As such, he was not Shaun’s\nopponent at all."
      },
      {
        "paragraph": "Not long after, Mason was beaten until blood was gushing out of him. His whole face was so swollen\nthat he was unrecognizable."
      },
      {
        "paragraph": "Shaun stepped on his face. “Weren’t you very smug when you replaced Hill Corporation? How did you\nhumiliate my mom at Campos Corporation’s main entrance when she went to look for you? Yes,\nMason. Even if my mom has made a lot of mistakes, she’s still my mom. It’s not your place to humiliate\nher. Don’t you treasure the son you have with Joanne a lot? Ha, I have a hundred ways to torture him.”"
      },
      {
        "paragraph": "“Don’t…” Mason raised his head in fear. For the first time, there was a pleading gaze in his eyes. “\nShaun, I lost. I’m not your opponent, but… the child"
      },
      {
        "paragraph": ".. is innocent. I beg you… Spare him…”"
      },
      {
        "paragraph": "“Ha, spare him? Then who could spare Liam? Who could save Liam?” Shaun shouted in agony. “\nWasn’t Liam once a child too? You were the one who watched him grow up. He called you dad for tens\nof years, yet you still could bring yourself to harm him.” Mason almost stopped breathing from being\nstepped on by Shaun. He could only grab Shaun’s leg desperately. “He’s only… four years old…”"
      }
    ]
  },
  {
    "title": "Chapter 1430 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“If you want him alive, you should go to jail obediently and come clean with every crime you’ve\ncommitted. Then, I will spare your son. Do you hear me?” Shaun yanked Mason up by his scalp and\nwarned him coldly in his ear."
      },
      {
        "paragraph": "“Okay…” Mason nodded in despair."
      },
      {
        "paragraph": "“By the way, I forgot to tell you this. Didn’t your nephew, Charlie, who you have been nurturing all\nalong, go to Country Y to look for the director of Garson Corporation? I’m afraid… he’ll never come\nback,” Shaun said expressionlessly."
      },
      {
        "paragraph": "Mason widened his eyes. Charlie was the successor he had painstakingly nurtured."
      },
      {
        "paragraph": "Shaun said with a cold, indifferent tone, “Because the manipulator behind the scenes of Garson\nCorporation is my dad, Brennan, the guy whom you’ve once sent people overseas to kill over and over\nagain.”"
      },
      {
        "paragraph": "Mason’s blood-stained lips quivered. After a moment, he started laughing sarcastically."
      },
      {
        "paragraph": "It seemed like he finally knew how he got defeated."
      },
      {
        "paragraph": "It seemed like he understood how Shaun could rise so quickly."
      },
      {
        "paragraph": "He did not expect it. To think that he had finally become the wealthiest man after scheming for tens of\nyears, only to be brought down by Shaun and his father in such a short time."
      },
      {
        "paragraph": "Moreover, he was brought down into an eternal hell."
      },
      {
        "paragraph": "Shaun turned around and opened the bedroom door. At the same time, the police entered from the\noutside and apprehended Mason at last."
      },
      {
        "paragraph": "Shaun walked downstairs step by step."
      },
      {
        "paragraph": "At the courtyard, Brennan stood with his back toward Shaun and a cigarette in his hand."
      },
      {
        "paragraph": "“Dad, we’ve finally avenged Granny and Liam,” Shaun said in a low voice as he walked to Brennan’s\nside."
      },
      {
        "paragraph": "“Yes, but they’ll never come back.” Brennan took a long drag on the cigarette. Then, he raised his head\nand looked at the stars in the sky. Even a tough guy like him had tears in his eyes."
      },
      {
        "paragraph": "Shaun’s throat felt painful and bitter. He had clearly gotten his revenge, but he did not know what to\nsay."
      },
      {
        "paragraph": "“Dad, let’s go to the hospital together to have a look at Mom. It seems like her injuries are quite serious,\n” Shaun said."
      },
      {
        "paragraph": "“You can go. I don’t want to see her.” Brennan turned around and left with his hand in his pocket."
      },
      {
        "paragraph": "“Dad, you still care about Mom, right? If not, you wouldn’t have rushed to the scene with the police to\nsave her tonight. ” Shaun suddenly added, “You wouldn’t even have let Mason leave just because he\ntook her hostage.”"
      },
      {
        "paragraph": "“You’re overthinking it. That was because I knew Chance was spying on Mason…”"
      },
      {
        "paragraph": "“But Mason was escaping in a hurry, so nobody knew whether Chance would have the opportunity to\nmeet Mason or not. If Mason didn’t come here, we might not have been able to catch him smoothly.”"
      },
      {
        "paragraph": "Shaun interrupted Mason and said with mixed feelings, “ It’s been more than ten years, and you\nhaven’t remarried.”"
      },
      {
        "paragraph": "“What right does someone like me, who lives his days with hatred, have to remarry?”"
      },
      {
        "paragraph": "Brennan suddenly let out a long sigh. “Forget it. Although that marriage back then was short, it made\nme lose all thoughts about marriage. Besides,"
      },
      {
        "paragraph": "the rift between your mom and I can never be mended.”"
      },
      {
        "paragraph": "After that, he left in long strides."
      }
    ]
  },
  {
    "title": "Chapter 1431 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "6:00 a.m."
      },
      {
        "paragraph": "When Shaun arrived at the hospital, Lea had already been saved. Catherine and Valerie, who both\ncould not stand each other, did not fight for once as they sat in the ward calmly."
      },
      {
        "paragraph": "When Shaun entered, Valerie asked hastily, “Has Mason been caught?”"
      },
      {
        "paragraph": "“Yeah.”"
      },
      {
        "paragraph": "Shaun nodded. “Everything happened very quickly. Everyone in the Campos family is in the police’s\ncustody. This time, not only Mason’s kidnapping but the fact that Campos Corporation intentionally\noppressed their competitors and stole Hill Corporation’s microchip’s data would slowly be uncovered.”"
      },
      {
        "paragraph": "“That’s great.” Valerie was emotional. “Since the microchip’s data was stolen, could we get back the\nmicrochip’s ownership from Landell Group?”"
      },
      {
        "paragraph": "“It’d be difficult. Landell Group can stay out of it by saying that it was Campos Corporation that offered\nthe data to them to curry favor with them. At most, we can only make them stop the sale of the\nmicrochips. Although we can’t punish them, this will be a heavy blow to Landell Group, and their\nreputation will be destroyed globally. It’ll be hard for a company without reputation to rise again,” Shaun\nexplained."
      },
      {
        "paragraph": "Valerie nodded. “Perhaps… it can only turn out this way. Shaun, you really… did a good job. To be\nhonest, when Hill Corporation was in that state, your uncle and I thought Hill Corporation would never\nbe able to rise again.”"
      },
      {
        "paragraph": "“Actually, I’ve been busy dating lately. My mom has been the one working hard over the company’s\nmatters.” Shaun looked toward Lea, who was on the patient’s bed, as he said that."
      },
      {
        "paragraph": "Stunned, Valerie lowered her gaze sadly."
      },
      {
        "paragraph": "She used to be sarcastic and mean. However, after problems occurred one after another for Hill\nCorporation, it made her calm down and reflect on herself a lot."
      },
      {
        "paragraph": "“Shaun, your mom…” From outside the door, Spencer barged in. When he saw Lea, who had an\noxygen tube up her nose, his eyes reddened."
      },
      {
        "paragraph": "“Uncle Spencer, Mason has been caught. Since Ivan has hurt Willie, you can now avenge Willie.”"
      },
      {
        "paragraph": "Shaun gazed at Spencer and said, “I know you’ve always blamed my mom. If it weren’t for her\nchoosing Mason back then and bringing trouble into the family, Willie wouldn’t have ended up like that.\nIn order to find evidence of Mason’s crimes, my mom deliberately allowed Mason to kidnap her.\nAlthough we already implanted a tracker in her body, she still got hurt by Mason.”"
      },
      {
        "paragraph": "Spencer let out a heavy sigh. “In fact… I don’t blame her anymore. After all, we’re family. I just can’t\nhelp but think of Willie now as a retard whenever I see her. That’s why I simply don’t meet her. Shaun,\nhow is she now?”"
      },
      {
        "paragraph": "“Her head has suffered a heavy blow, so she’s still in a coma. But she has already gotten through the\nmost critical stage,” Valerie explained."
      },
      {
        "paragraph": "“That’s good. ” Spencer nodded. “It’s best not to tell Mom and Dad about this, lest they get worried\nsince they’re so old. The Campos family has finally received retribution.”"
      },
      {
        "paragraph": "“After Mason was caught, Maurice had been under control too. I plan to take this opportunity to acquire\nCampos Corporation.”"
      },
      {
        "paragraph": "Shaun suddenly said, “Campos Corporation has already invested 5oo billion dollars in the electric\nappliances industry, and many products are already semi-finished. As long as we utilize Hill\nCorporation’s latest technology, Hill Corporation can save a large amount of money. We can increase\nthe manufacturing too.”"
      },
      {
        "paragraph": "Spencer’s eyes lit up. “That’s not bad. Campos Corporation’s equipment may be of little value to other\ncompanies, but it’s a great addition to Hill Corporation. Shaun, you’re very smart.”"
      },
      {
        "paragraph": "Valerie was excited as well. “The Hill family can be the wealthiest family in Australia again.”"
      },
      {
        "paragraph": "Shaun nodded."
      },
      {
        "paragraph": "He felt pretty emotional too."
      }
    ]
  },
  {
    "title": "Chapter 1432 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Hill Corporation had met its downfall in his hands, but it did not take long for it to rise again in his hands\nas well."
      },
      {
        "paragraph": "Spencer glanced at Shaun, whose eyes were bloodshot. Then, he glanced at Catherine, who was\nsilent at the side. He said, “Shaun, you should accompany Miss Jones home to rest. You both have\nworked tirelessly the whole night. Leave this place to your aunty and me. It’s our turn to do something\nfor the Hill family.”"
      },
      {
        "paragraph": "Shaun hesitated slightly, but Catherine had already walked over and held his hand. “Come on. Let’s go\nback and have some rest. We’ll come again in the evening.”"
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "Since Catherine has spoken, Shaun left with her."
      },
      {
        "paragraph": "“Your mom will only wake up in the evening or at night. There’s nothing you can do by staying here.\nYou might as well go back and sleep for a while."
      },
      {
        "paragraph": "Then, you’ll have more energy to take care of more things,” Catherine explained gently."
      },
      {
        "paragraph": "Shaun’s hand held hers tightly. He remained silent for a long time before he said regretfully, “It’s too\nbad that… Liam can’t see all of this.”"
      },
      {
        "paragraph": "That short sentence made Catherine feel strangely bitter."
      },
      {
        "paragraph": "If it were not for Liam, she and the children might not be here in one piece."
      },
      {
        "paragraph": "“Mason will be sentenced to death, ” Catherine said after a long while."
      },
      {
        "paragraph": "“A death sentence is for sure for all the bad things he has done. We just don’t know how much more he\nhas done that we’re unaware of.”"
      },
      {
        "paragraph": "Shaun frowned. “Wesley used to do things for Mason in secret, so he must’ve done a lot of illegal stuff.\nSince I’ve used his son to threaten him too, I think he’ll expose Wesley.”"
      },
      {
        "paragraph": "Catherine’s eyes lit up. “If Wesley is caught, then Ethan can be avenged. I can immediately divorce him\nas well.”"
      },
      {
        "paragraph": "“He will be caught. Wesley is who he is today because he got on the same boat as the Campos family.\nNow that the Campos family has fallen, Wesley’s good days will be coming to an end too.”"
      },
      {
        "paragraph": "Shaun wrapped his hand around Catherine’s waist."
      },
      {
        "paragraph": "He chuckled and said, “Weren’t you quite worried about Rebecca before this? I’ll be back to the\nposition of Australia’s wealthiest man soon. Cathy, don’t worry. No one can hurt you and the children\nanymore. I’ll protect all of you in the future..”"
      },
      {
        "paragraph": "“Who knows if you’ll attract other women again after you become the wealthiest man? Even Hannah\nwas attracted to you when you were at your worst. What if a second Sarah appears? ” Catherine’s red\nlips curved into a mocking smile."
      },
      {
        "paragraph": "“Cathy, I swear that won’t happen anymore. Making that mistake once in the past is painful enough.”"
      },
      {
        "paragraph": "Shaun hurriedly hugged her and said, “And I think you bring good luck to me. You see, when I divorced\nyou back then, I immediately fell from the top someone plotted against me. I even almost lost my life a\nfew times. Not long after I’ve gotten back together with you, I have risen again. Aren’t you the one\nwho’s bringing good luck to me?”"
      },
      {
        "paragraph": "Catherine smiled and rolled her eyes. “In that case, you only got together with me because you want\nme to bring you luck?”"
      },
      {
        "paragraph": "“Cathy, your words really hurt me. Are my feelings for you not clear enough? I can give you all the\nshares I have in Hill Corporation. I’ll work for you in the future.” Shaun hugged Catherine tightly. “\nCathy, I’ll give you the shares, okay? I’ll transfer them to you in the evening. Don’t leave me in the\nfuture.”"
      },
      {
        "paragraph": "“You’re crazy. I don’t want the shares.” Catherine quickly hugged his neck. “ I was just teasing you, silly.\nDo I still not know your feelings for me?”"
      },
      {
        "paragraph": "“But I really want to give them to you,” Shaun said softly."
      },
      {
        "paragraph": "“Stop fooling around. You can just give them to Suzie and Lucas in the future. I’m not interested in your\nmoney.” Catherine winked at him ambiguously. “I’m only interested in you.”"
      }
    ]
  },
  {
    "title": "Chapter 1433 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun’s eyes heated up. As his thin lips curved upward, he deliberately opened a button in front of his\nchest and revealed his sexy collarbone. “Good girl, I’ll give myself to you after we get back.”"
      },
      {
        "paragraph": "“Pervert. ” Blushing, Catherine rolled her eyes and pushed him away."
      },
      {
        "paragraph": "“It’s all because of you.” Shaun chased after her and grabbed her hand."
      },
      {
        "paragraph": "When they returned to the Hill family’s residence, Suzie and Lucas immediately surrounded them. “"
      },
      {
        "paragraph": "Scummy dad, Mom, where did you guys go on a date behind our backs last night? Hmph, you dumped\nus and spent time alone again.”"
      },
      {
        "paragraph": "“You misunderstood. Your granny got hurt last night, so we went to the hospital to accompany her, ”\nCatherine explained while patting the children’s heads."
      },
      {
        "paragraph": "“What? Granny is hurt? I want to go to the hospital to visit Granny,” Suzie exclaimed agitatedly. She\ndesperately wanted to rush out immediately."
      },
      {
        "paragraph": "“Why did Granny get hurt?” Lucas was calmer than Suzie."
      },
      {
        "paragraph": "“It’s because someone bad has been trying to deal with the Hill family. However, he was finally caught\nlast night.” Shaun then crouched down and said gently, “I’ll bring guys to visit Granny in the evening.\nAfter a few days, you both can go to preschool too.”"
      },
      {
        "paragraph": "“Really?” Lucas and Suzie were very excited. As they could only stay in the villa every day, they were\nvery bored."
      },
      {
        "paragraph": "“It’s true. Let your dad sleep for a while. He didn’t sleep for the whole night last night, ” Catherine said\ngently to the children."
      },
      {
        "paragraph": "“Scummy dad, quickly go and get some sleep. When you wake up, you can take us to visit Granny,”"
      },
      {
        "paragraph": "Suzie said."
      },
      {
        "paragraph": "“Mom, you should sleep for a while too.” Lucas said gently, “You must be tired.”"
      },
      {
        "paragraph": "“Let’s go. We’ll sleep together.” Shaun hugged Catherine’s waist."
      },
      {
        "paragraph": "Catherine felt slightly embarrassed, and her face heated up, especially with the children’s innocent\ngazes on her."
      },
      {
        "paragraph": "However, Shaun did not give her the chance to speak as he dragged her to the bedroom upstairs\nstraight away."
      },
      {
        "paragraph": "“I don’t think it’s appropriate sleeping together in broad daylight,” Catherine whispered."
      },
      {
        "paragraph": "“What’s so inappropriate? Could… I still do something to you?” Shaun purposely smiled evilly. “Don’t\nput me in a difficult position. I don’t have any more energy.”"
      },
      {
        "paragraph": "“Go and die, pervert.” Catherine did not hesitate to pinch him on the waist."
      },
      {
        "paragraph": "However, she did not use a lot of strength. In turn, it made Shaun’s heart itch instead."
      },
      {
        "paragraph": "“Since you called me a pervert, I must do something.” Shaun grabbed her soft, slender waist before\nlowering his head and smacking his lips on hers."
      },
      {
        "paragraph": "After a long, deep kiss, he carried her to the bed."
      },
      {
        "paragraph": "Catherine exclaimed. Just as she thought he was about to do something, he placed his arm behind her\nhead. “Sleep.”"
      },
      {
        "paragraph": "Catherine lay down on her side. After watching the outline of his handsome face for a while, she\ngradually could not resist her sleepiness and fell asleep."
      },
      {
        "paragraph": "When she woke up, it was because of the children’s laughter."
      },
      {
        "paragraph": "She opened her eyes to see Suzie’s chubby, pink face at a close distance."
      },
      {
        "paragraph": "She was so startled that she wanted to sit up. However, she realized her whole body was trapped in\nShaun’s arms."
      },
      {
        "paragraph": "Perhaps her movements were too big, but Shaun woke up too. When he opened his eyes and saw the\ntwo children on the bed, he had a slight headache."
      },
      {
        "paragraph": "“How embarrassing.” Suzie pulled a face. “Scummy Dad, Mom, you’re both grown-ups, yet you guys\nstill hug each other to sleep like little kids.”"
      },
      {
        "paragraph": "Catherine’s face began to flush. “I… I just took your dad as a blanket.”"
      },
      {
        "paragraph": "“Really?” Suzie was taken aback."
      }
    ]
  },

  {
    "title": "Chapter 1434 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Lucas said in a low voice, “You guys are deceiving us kids. I heard that when parents hug each other to\nsleep, they’ll easily have a new baby.”"
      },
      {
        "paragraph": "“You guys want a new baby?” Suzie was stunned for a moment before her eyes reddened. “Isn’t having\nLucas and me enough? You still want a new baby? I don’t approve of it.”"
      },
      {
        "paragraph": "Catherine and Shaun were awkward and speechless."
      },
      {
        "paragraph": "“Lucas, who did you hear that from? Your mom and I were just sleeping,” Shaun explained while the\ncorners of his mouth twitched. “Having both of you as third wheelers is enough. We don’t need another\none.”"
      },
      {
        "paragraph": "“When did we become third wheelers?” Suzie was confused."
      },
      {
        "paragraph": "“It means we are always in their faces.” Lucas said, “We’re disturbing his and Mom’s alone time.”"
      },
      {
        "paragraph": "“That’s too much.” Suzie was furious. “We didn’t even hate you for snatching our mom. Go away.”"
      },
      {
        "paragraph": "The little girl crawled over and pushed Shaun away,"
      },
      {
        "paragraph": "sitting in Catherine’s embrace. “Mom, you guys have slept for a very long time. When are we going to\nthe hospital to visit Granny?”"
      },
      {
        "paragraph": "Catherine looked at the time. It was already 3:00 p.m. “Let’s go now.”"
      },
      {
        "paragraph": "When they were about to depart, Shaun received a call from the police station. “It seems like Mason\nhas confessed to some new offenses, so the police have asked me to go over. You can go ahead with\nthe children first. I’ll arrange for Hadley to escort you guys.”"
      },
      {
        "paragraph": "Catherine nodded."
      },
      {
        "paragraph": "Once Shaun arrived at the police station, the chief, who was in charge of the case, gave him a copy of\nMason’s statement."
      },
      {
        "paragraph": "After reading through it, Shaun remained silent for a long time."
      },
      {
        "paragraph": "He really did not expect Mason to have done a lot more bad deeds than he had imagined."
      },
      {
        "paragraph": "Furthermore, it seemed like Mason was afraid that Shaun would hurt his son too. As such, he\nexplained everything clearly."
      },
      {
        "paragraph": "“Please continue interrogating him on whether there are any accomplices or not,” Shaun said."
      },
      {
        "paragraph": "“We would, but he had a lot of injuries on him when we caught him during dawn. Currently, his body\ncan’t take it, so we plan to let him rest for two days. Then, we’ll continue interrogating him.”"
      },
      {
        "paragraph": "“Thank you.”"
      },
      {
        "paragraph": "Shaun took the statement and left."
      },
      {
        "paragraph": "He drove to the hospital straight away. However, he did not go to Lea’s ward. Instead, he went to\nChester’s office."
      },
      {
        "paragraph": "Chester had just returned after finishing his rounds. He removed his stethoscope and punched Shaun’s\nbody lightly. A smile then etched on his handsome face. “Congratulations, Young Master Hill. The\npublic is in an uproar now. You, Young Master Hill, are about to become the First Young Master of\nAustralia again. Tsk, you stole the limelight from me again.”"
      },
      {
        "paragraph": "Shaun gazed at Chester with furrowed brows and did not say a word."
      },
      {
        "paragraph": "“Alright, don’t look so solemn. I’ve asked the doctor who’s in charge of your mom. She’ll recover after\none or two months’ rest, ” Chester said with a smile."
      },
      {
        "paragraph": "“I just came from the police station. When the police interrogated Mason, he revealed some things that\nI think you need to know. ” Shaun passed the statement to Chester. “Three years ago, Charity really\nwas framed for Shelley’s death. The person who planned all of it was Mason.”"
      },
      {
        "paragraph": "Chester’s body stiffened. He gazed at that statement and did not move."
      },
      {
        "paragraph": "Seeing that Chester did not take the statement, Shaun kept it. “What Cathy said was real. Back then,\nafter I sent Rebecca away, it was Mason who brought Rebecca out. He made her undergo plastic\nsurgery to have Shelley’s looks and arranged for her to be by my side. At that time, the milk Shelley\ngave me to drink contained drugs that made my memory deteriorate. After Catherine realized Shelley\nwas Rebecca in disguise, they played along and burnt the real Shelley. Afterward, they blamed it on\nCharity.”"
      },
      {
        "paragraph": "Chester turned around. His handsome face was so calm that it looked cold."
      },
      {
        "paragraph": "However, only he knew how tight his heart was clenching that he felt like he could suffocate for a few\nseconds."
      }
    ]
  },
  {
    "title": "Chapter 1435 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine had told Chester about that before."
      },
      {
        "paragraph": "He did believe it to a certain extent. However, deep down in his heart, he refused to accept that truth."
      },
      {
        "paragraph": "The reason being once he accepted it, it meant that he was the one who personally found a lawyer to\nsend Charity to jail and sentenced her."
      },
      {
        "paragraph": "He would be the one who contributed to the cause of Charity’s death too."
      },
      {
        "paragraph": "Chester would rather think of Charity as a despicable, bad woman, and that she had only herself to\nblame."
      },
      {
        "paragraph": "She deserved it even if she died."
      },
      {
        "paragraph": "However, the perpetrator had now admitted it himself."
      },
      {
        "paragraph": "Ha, Chester was wrong. He made a grave mistake."
      },
      {
        "paragraph": "“Why did Mason shift the blame to Charity then? Was he close to her? ” After a long while, Chester\nasked hoarsely."
      },
      {
        "paragraph": "“Charity… Frankly speaking, she’s a sacrifice.”"
      },
      {
        "paragraph": "Shaun said uncomfortably, “Because those days, Charity, Cathy, and Freya were close, and we\ndespised Charity because of Sarah. Mason thought if he pushed the blame onto Charity at that time, it\nwould cause a rift in my relationship with Cathy."
      },
      {
        "paragraph": "“Cathy would firmly believe that Charity was innocent, while we would think that she was taking\nCharity’s side. It truly happened that way. My relationship with Cathy started deteriorating from that"
      },
      {
        "paragraph": "time onward, and even you started having opinions toward Cathy. To make it worse, Rebbeca drugged\nme, which made my illness more severe. ”"
      },
      {
        "paragraph": "“Mason… He really schemed everything so cruelly.” Chester looked outside the window. There was a\nbottomless coldness in his eyes."
      },
      {
        "paragraph": "He admitted that he was ruthless, but he would never set up innocent people."
      },
      {
        "paragraph": "“That’s right. If only I believed in Cathy back then. She said she had done a DNA test between\nRebecca and Jeffery, but I didn’t believe her. ” Shaun’s lips lifted in a self-deprecating smile. “Charity’s\ndeath indirectly caused Jennifer and Boris’ deaths. Since everyone in the Neeson family is dead,\nthere’s nowhere I can atone for my sins. I can’t possibly help Thomas and Sarah, right?”"
      },
      {
        "paragraph": "Chester remained silent. Beneath his short hair, his dark gaze was downcast. No one knew what he\nwas thinking."
      },
      {
        "paragraph": "At first glance, people would think that he was indifferent."
      },
      {
        "paragraph": "However, Shaun knew that Chester was not that kind of person. Chester was a person who hid things\ndeeper than him."
      },
      {
        "paragraph": "“ I’m leaving.” Shaun patted Chester’s shoulders before turning around to leave."
      },
      {
        "paragraph": "“Will you tell Catherine about this?” Chester suddenly asked."
      },
      {
        "paragraph": "“…I won’t. Maybe it’s because I’m too selfish. I’m afraid knowing about it will make her more remorseful\nand upset over Charity’s matter. I want to be with Catherine. After all, we’ve finally"
      },
      {
        "paragraph": "managed to make up. I’m scared that the rift from the past will reappear.”"
      },
      {
        "paragraph": "Shaun left after he spoke."
      },
      {
        "paragraph": "Chester stood in front of the full-length windows alone for a long time."
      },
      {
        "paragraph": "The trial that sent Charity to jail kept replaying in his mind like a slow movie."
      },
      {
        "paragraph": "That day, she repeatedly said she was wrongly accused and that she was innocent."
      },
      {
        "paragraph": "He did not believe her and looked at her as if he was looking at a cruel murderer."
      },
      {
        "paragraph": "When all the yelling made her hopeless, her cool, slightly reddened eyes became lifeless and dim."
      }
    ]
  },
  {
    "title": "Chapter 1436 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Chester flung his hand and swept the glass on the table to the floor."
      },
      {
        "paragraph": "It was as if that was the only way to stop him from feeling so annoyed."
      },
      {
        "paragraph": "Shaun returned to Lea’s ward."
      },
      {
        "paragraph": "Lea was already awake. However, she exuded a wave of lifelessness."
      },
      {
        "paragraph": "“Shaun, you came just at the right time. We don’t know what’s wrong with your mom. I’ve been talking\nto her for a long time, yet she hasn’t uttered a word. It’s very unlike her.” Valerie came over and\nwhispered, “Is she still hung up on Mason since he has gotten caught…”"
      },
      {
        "paragraph": "“No…” Shaun cut her off. He glanced at the few people in the ward and said, “Maybe it’s because she\nfound out that Liam is hers and Brennan’s son and my biological brother.”"
      },
      {
        "paragraph": "“What?”"
      },
      {
        "paragraph": "Valerie and Spencer were shocked. “Wasn’t Liam hers and Mason’s?”"
      },
      {
        "paragraph": "Catherine frowned as she glanced at Lea. She and Shaun had known about it early on, but they were\nafraid it would upset Lea. It must have been Mason who said it himself."
      },
      {
        "paragraph": "“He’s not Mason’s son.” Lea finally spoke. However, her hoarse voice was empty and sad. “I was\nmistaken all along.”"
      },
      {
        "paragraph": "“You… How could you be so silly?” Spencer sighed heavily. “As the child’s mother, you can’t even\nfigure out who’s the father.”"
      },
      {
        "paragraph": "Lea could not even feel any embarrassment. In fact, she felt that living was meaningless. “In the past, I\nalways thought I was a failure of a mother. Now, I realize that I’m not even worthy of being a mother.\nFor more than 20 years, I was fooled by a man.”"
      },
      {
        "paragraph": "She choked, and her eyes reddened. Then, she raised her head and said to Shaun, “Shaun, I’ve\nwronged you, and I’ve wronged Liam too. Liam is dead. It was Mason who killed him. I’m so useless\nand stupid. I caused Liam’s death.”"
      },
      {
        "paragraph": "As she spoke, she covered her eyes and wept."
      },
      {
        "paragraph": "She was a tough woman. She did not cry that way even when Mason abandoned her."
      },
      {
        "paragraph": "However, when she found out the truth, she broke down and cried."
      },
      {
        "paragraph": "At that moment, everyone was at a loss for words. “It’s not completely your fault.”"
      },
      {
        "paragraph": "Shaun suddenly said, “Actually, I’ve already known about this for a while now. I’ve asked Dad about it.\nThat night, you were drunk, and he went over to look for you. When he woke up the next morning, he\nwas embarrassed to face you because of his men’s pride. Hence, he left. Afterward, Mason came and\npretended to be him. Dad thought you got pregnant with Mason’s child not long after you divorced him,\nso his hatred toward you deepened. If only you and my dad were mature enough at that time. You were\nthe prideful princess of the Hill family who looked down on him, while he, having married into the Hill\nfamily, was taunted by you, and he had his own pride too.”"
      },
      {
        "paragraph": "“At that time, Dad and Mom both said that Brennan was quite good.” Spencer said, “Yet, you said he\nwas targeting the Hill family’s family business. In the end, the one who was really targeting the Hill\nfamily’s business was Mason.”"
      },
      {
        "paragraph": "“Enough, Brother. Stop talking. Don’t upset Lea anymore.” Valerie rolled her eyes at Spencer. “\nAnyway, both you and Brennan are to blame for this matter. There’s no need to shoulder everything\nyourself.”"
      },
      {
        "paragraph": "“No, the fault mainly lies with me.” Lea shook her head. After wiping her face with a tissue, she asked,\n“Shaun, where’s your dad?”"
      },
      {
        "paragraph": "“The reason he came back this time is mainly to get revenge. Now that he has gotten his revenge, he’ll\nreturn to Country Y after some time. After all, he’s Garson Corporation’s director, and his company is\nover there. He said he despises Canberra,” Shaun said with a hint of sadness."
      },
      {
        "paragraph": "“Wow. He’s actually Garson Corporation’s director?” Valerie was surprised. “That’s the top mega-\ncorporation of Country Y. I never expected he would have today’s achievements when he was so poor\nback then.”"
      },
      {
        "paragraph": "“He has always been a smart and capable person. When he was studying, his results were the top in\nthe school. I was the one who was prejudiced against him.” Lea said with difficulty, “Shaun, please tell\nhim thank you… for last night.”"
      },
      {
        "paragraph": "“Mm.”"
      },
      {
        "paragraph": "Shaun took out a document. He said, “This is the Hill family’s manor’s Certificate of Title. ”"
      }
    ]
  },
  {
    "title": "Chapter 1437 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“This… Where did this come from?” Valerie immediately took it. The moment she opened it up, she\nfroze. How did the names on it change to Suzie and Lucas’s?"
      },
      {
        "paragraph": "“When Hill Corporation was going through a crisis and was forced to sell Hill Manor… it was my dad\nwho secretly bought the manor. He wanted to help the Hill family overcome this crisis. He wanted to\ngive the manor to me at first, but when he learned that he had grandchildren, he changed the names t\no Lucas and Suzie’s. It’s a gift for the two children. ”"
      },
      {
        "paragraph": "Shaun continued saying, “After this matter is over, I plan to have Grandpa and Grandma move back to\nHill Manor since they are more used to living there. As for all of you, you can move back anytime if you\nwant. The manor is huge, so you can accompany the two elders.”"
      },
      {
        "paragraph": "“Shaun, please do ask when your father is available to have a meal together.” Spencer said\nemotionally, “It’s to thank him. He has really helped the Hill family a lot this time.”"
      },
      {
        "paragraph": "“I think my father may not be too willing to meet with you.” After a moment’s silence, Shaun said, “ Back\nthen, he was forced by Mason to leave the country, and he was hunted down by Mason’s men. My\ngrandmother also died because of this. He… actually hates the Hill family. He regrets marrying\nsomeone from the Hill family."
      },
      {
        "paragraph": "Spencer was suddenly at a loss for words."
      },
      {
        "paragraph": "Lea held onto the quilt tightly. Her heart felt incomparably bitter. If it were her, she would feel the same."
      },
      {
        "paragraph": "In the evening, Catherine and Shaun left the hospital with the children."
      },
      {
        "paragraph": "She asked casually, “When you went to the police station, did Mason hand over any incriminating\nevidence?”"
      },
      {
        "paragraph": "“Oh, yeah.” Shaun’s eyes glinted. He quickly kept his eyes on the road and drove seriously. “It has to\ndo with Yule Corporation. Yule Corporation and Campos Corporation previously worked together to\nopen an investment company. However, the police found that Campos Corporation had been\ncommitting accounting fraud and manipulating the stock price of listed companies. Hence, Yule\nCorporation’s investment company was frozen too."
      },
      {
        "paragraph": "But since Yule Corporation had nothing to do with this matter, they could get away. In other words, the\nCampos family has no control over Yule Corporation now, and it can return to the Yule family’s hands.”"
      },
      {
        "paragraph": "Catherine paused. “Most of it should have fallen into Damien and Melanie’s hands since my\ngrandparents and my dad differ in opinions.”"
      },
      {
        "paragraph": "“Your dad has opened another logistics company, and the elites from Yule Corporation have all gone to\nhis side. Even if Yule Corporation returns to Damien’s hands, they’ re at the end of their era. ” Shaun\npaused before continuing, “I’m just worried that Damien will ask your grandparents to plead with your\ndad to merge his new company with Yule Corporation and let the two brothers manage the company\ntogether.”"
      },
      {
        "paragraph": "Catherine frowned at those words."
      },
      {
        "paragraph": "Thinking about it now, there was that possibility."
      },
      {
        "paragraph": "During the period of time when Yule Corporation was controlled by Campos Corporation, Joel’s new\ncompany took advantage of the opportunity to expand. Today, they had thousands of logistics outlets\nacross the country, and they were even in collaboration with major e-commerce companies. Damien\nwould definitely be jealous. In fact, he would likely tell the two elders that Joel stole Yule Corporation’s\nbusiness, and the two elders would definitely threaten Joel with their death again."
      },
      {
        "paragraph": "Just as she was thinking about it, Joel called her. “ Cathy, don’t come back for the time being. Your\ngrandparents and Damien came over to cause trouble again. My head hurts from all the fuss they’re\nmaking. I can’t be bothered to go back either, so I’ll just sleep at the office.”"
      },
      {
        "paragraph": "“Dad, did Damien return to Yule Corporation?” Catherine asked."
      },
      {
        "paragraph": "“Yeah. After the Campos family fell, there was no need to worry about Kawada alone, so Damien\nbecame the chairman of Yule Corporation."
      },
      {
        "paragraph": "However, Yuel Corporation was hollowed out by the Campos family and Kawada, and Damien claimed\nthat I founded a new company to go against him. Hence, he wants me to either let the two companies\nmerge or let the old employees who came to me go back to him.”"
      },
      {
        "paragraph": "Joel scoffed coldly. “In his dreams. I’m not going to bother with him or your grandparents. What I have\nwill be left to you.”"
      },
      {
        "paragraph": "“Yeah, it’s better to avoid them.” Catherine agreed."
      }
    ]
  },
  {
    "title": "Chapter 1438 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "After finishing the call, Shaun turned his head and said, “I’m going back to the company. I’ll be working\novertime tonight, but you can take the children back to Hill Manor tomorrow. It’s bigger there, so it’ll be\nmore fun for them.”"
      },
      {
        "paragraph": "“Yes, yes! Can I ride a horse again?” Suzie turned to Lucas happily. “I’m telling you, Hill Manor is really,\nreally big. There’s a playground, a horse ranch, a small river, and lots and lots of fruits. It’s really fun.”"
      },
      {
        "paragraph": "Although Lucas had never been to Hill Manor before, Suzie’s words made him a little excited."
      },
      {
        "paragraph": "“It’s fine for you two to stay there, but I… I haven’t divorced Wesley yet. ” Catherine was still concerned\nabout this matter. Although she did not care about how other people saw her, she did not feel\ncomfortable being with Shaun like this."
      },
      {
        "paragraph": "“Don’t worry. I don’t believe Wesley’s not involved in Mason’s incident.” Shaun snorted. “It’s just a\nmatter of time before the divorce.”"
      },
      {
        "paragraph": "“Hm.” Catherine nodded."
      },
      {
        "paragraph": "With his current capability, she believed him."
      },
      {
        "paragraph": "After separating from Shaun, she had just taken the two children to the Hill residence when she\nreceived a call from Logan. His voice sounded urgent and in pain. “Miss Jones, Austin and I have\ngotten into an accident.”"
      },
      {
        "paragraph": "“What happened?” Catherine was shocked. “How are you now?”"
      },
      {
        "paragraph": "So many things had happened the past few days that she almost forgot she sent Logan and Austin to\nkeep an eye on the prison. When she counted down the days, today was the day Jeffery and Sally"
      },
      {
        "paragraph": "would be released from prison."
      },
      {
        "paragraph": "“This evening, after Jeffery and his wife were released, an unlicensed luxury car picked them up. I\nfollowed your instructions and followed them with Austin separately. But after following them for about\nhalf an hour, I noticed that Austin had disappeared. I searched his vicinity for a long time and found him\ntossed in an alley, covered in blood. When I went to save him, I was ambushed by two people and\nsuffered some injuries. Fortunately, I managed to take Austin and escaped to somewhere crowded, so\nthey didn’t come after us.”"
      },
      {
        "paragraph": "Catherine asked anxiously, “How is Austin?”"
      },
      {
        "paragraph": "“His injuries are worse than mine. He has been stabbed in the lower abdomen, so it’ll be difficult for him\nto recover in a month. I also got cut in many places.”"
      },
      {
        "paragraph": "Logan fell silent for a moment before saying, “I fought with those two guys, and their skills were the\nsame as mine. They had probably honed them on various battlefields. They’re even more powerful\nthan the assassins in Neah Bay. Otherwise, Austin wouldn’t have been knocked down so easily.”"
      },
      {
        "paragraph": "Catherine was horrified. What kind of force was backing Rebecca?"
      },
      {
        "paragraph": "“I don’t feel rest assured keeping you both in Melbourne. I’ll tell Shaun to get someone to pick you up, ”\nshe said."
      },
      {
        "paragraph": "“Okay. ” Logan did not refuse. “I just… find it a bit strange. The other party seemed to know I was with\nAustin, so they ambushed me after defeating Austin. I think Rebecca seems to know us very well.”"
      },
      {
        "paragraph": "“I’m guessing it’s because Wesley has told Rebecca about me. She must know me very well now. I was\ncareless. ” Catherine was filled with chagrin. “By the way, did you see who picked up Jeffery and"
      },
      {
        "paragraph": "Sally?”"
      },
      {
        "paragraph": "“The car windows were tinted, so I couldn’t look inside.”"
      }
    ]
  },
  {
    "title": "Chapter 1439 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine’s head began to hurt."
      },
      {
        "paragraph": "She had not done anything yet, but her left- and right-hand man were already crippled."
      },
      {
        "paragraph": "Furthermore, she still did not know anything about Rebecca."
      },
      {
        "paragraph": "Forget it. She would just have to deal with the situation as it developed."
      },
      {
        "paragraph": "Hill Corporation."
      },
      {
        "paragraph": "Chance had been waiting at the door for a full hour."
      },
      {
        "paragraph": "The current Shaun was in full swing. After the fall of the Campos family, Shaun bought over Campos\nCorporation at breakneck speed, and the whole world now knew his name."
      },
      {
        "paragraph": "He fell in his early thirties, but he climbed back up at the fastest speed."
      },
      {
        "paragraph": "However, such was the society that trimmed one’s sail to the wind. From evening to late night, many\nprominent people had been wanting to make an appointment with him. However, most of them were\nturned away."
      },
      {
        "paragraph": "“Mr. Ziegler, Eldest Young Master has told you to come in.” Hadley opened the door and spoke."
      },
      {
        "paragraph": "“Thank you.” Chance nodded and strode in."
      },
      {
        "paragraph": "Shaun finished signing the last contract and put it aside. Then, he raised his head and looked at\nChance. “You’re here for Yael’s matter, right?”"
      },
      {
        "paragraph": "“Eldest Young Master… How are you planning to deal with her?” Chance asked hesitantly. “ I know she\nkilled Liam, and you might not intend to let her go.”"
      },
      {
        "paragraph": "“You still want her?” Shaun mocked. “These days, in order to get the antidote from me, she has been\nusing all ways to seduce Ivan and sleep with him. Do you not despise her?”"
      },
      {
        "paragraph": "“I had given up on her ever since I found out that she was flirting with Ivan. ” Chance shook his head\ndecisively. “I just care about the child in her belly. ”"
      },
      {
        "paragraph": "“I’m a man of my word. If you hadn’t tipped me off after you went undercover, Lucas and Suzie might\nhave gotten into an accident. ” Shaun stuffed the pen into the pen holder, put it down, and interlaced\nhis slender fingers. “After the child is born, Yael will be handed over to the police, and you’ll raise the\nchild.”"
      },
      {
        "paragraph": "“Thank you. ” Chance’s furrowed brows relaxed. “ Eldest Young Master, can you let me back into\nLiona? It’s fine even if I’m not the master. I just want to work for you again.”"
      },
      {
        "paragraph": "“No need, Chance. You already have a weakness, so Liona isn’t a place for you to enjoy your\nretirement. You should hurry up and find a place to live in peace with your child.” Shaun said faintly, “As\nfor Liona, I already have a new candidate for the master.”"
      },
      {
        "paragraph": "“Well, I expected that. Thank you, Eldest Young Master. I’ll see you someday.”"
      },
      {
        "paragraph": "Chance smiled wryly and nodded. Then, he turned his tall, sturdy figure and left."
      },
      {
        "paragraph": "Shaun sat quietly in his chair for a while. After about ten or so minutes later, a short-haired and fit\nwoman walked in and knelt on one knee. “Eldest Young Master, I’m back.”"
      },
      {
        "paragraph": "The light fell on the woman’s face, illuminating a very young and cold face with slightly tan skin. Her\neyes were like ice blades."
      },
      {
        "paragraph": "The person was Elle Charlton. Shaun had sent her abroad for brutal special training for a period of\ntime, and now, Elle was the new master of Liona."
      },
      {
        "paragraph": "“Mm, Chance just left.” Shaun waved his hand, motioning for her to get up."
      },
      {
        "paragraph": "Elle paused, looking awkward. “Are you really going to make me Liona’s master?”"
      },
      {
        "paragraph": "“Hill Corporation’s crisis has made me see clearly that many people in Liona aren’t loyal. The most\nimportant things for the master of Liona to have are loyalty and skill, which you’ve gained after the\nspecial training. Elle, I hope you can lead Liona back to its heyday as soon as possible.”"
      },
      {
        "paragraph": "Shaun knocked on the table and said in a low voice, “Actually, what I value most is your loyalty to\nCathy.”"
      },
      {
        "paragraph": "Elle paused for a moment before she said, “I will continue to be loyal to Miss Jones, just like how I’m\nloyal to you.”"
      },
      {
        "paragraph": "“No, I want you to be more loyal to her, Suzie, and Lucas, ” Shaun said. “Sometimes, my decision is not\nnecessarily right.”"
      },
      {
        "paragraph": "Elle opened her mouth. A moment later, she nodded. “I understand.”"
      },
      {
        "paragraph": "“I have a task for you now. Arrange for someone to go to Melbourne and pick up Logan and Austin."
      },
      {
        "paragraph": "They’re injured. Take them back to Liona for them to recover first, ” Shaun said."
      }
    ]
  },
  {
    "title": "Chapter 1440 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Yes, I’ll get to it right away.”"
      },
      {
        "paragraph": "The next morning, Shaun was still sleeping in the lounge in his office when he suddenly heard Hadley’s\nvoice from outside."
      },
      {
        "paragraph": "“Eldest Young Master is still sleeping…” “Yes, I know. I won’t wake him up.”"
      },
      {
        "paragraph": "After the beautiful voice sounded, the door was"
      },
      {
        "paragraph": "gently pushed open, and Catherine walked in wearing a one-shoulder red plaid dress. Her exposed\nshoulder was as white as milk, looking bewitching and seductive. Along with her delicate eyes and\nfeatures, Shaun suddenly felt a fire in his calm chest."
      },
      {
        "paragraph": "“You’re awake.” Catherine paused the moment she met his eyes."
      },
      {
        "paragraph": "“Why are you here so early?” Shaun rubbed his slightly messy hair."
      },
      {
        "paragraph": "“ I’m here to see… if you have hidden any beautiful"
      },
      {
        "paragraph": "women in the office lounge… Ah.” Catherine deliberately joked and looked around."
      },
      {
        "paragraph": "However, before she could finish her sentence, she was pulled into a strong and hot chest by an arm."
      },
      {
        "paragraph": "“There is one beautiful woman… right here.” Shaun then flipped her over and pressed her on the bed\nbefore planting a domineering kiss on her."
      },
      {
        "paragraph": "Catherine smacked his back hard, but he ignored her. The kiss burned as hot as Mars."
      },
      {
        "paragraph": "“Shaun, stop it. The door isn’t closed.” She scratched his back anxiously."
      },
      {
        "paragraph": "Shaun immediately picked her up. Without breaking the kiss, he closed the door quickly with his other\nhand and locked it."
      },
      {
        "paragraph": "Catherine was dumbstruck. “ I’m here to send you breakfast.”"
      },
      {
        "paragraph": "“ I’ve received it. Time to eat. It tastes delicious. ” Shaun chuckled in his husky voice."
      },
      {
        "paragraph": "Catherine immediately blushed. The two of them had been very busy lately, and there was not much\ntime for intimacy. Hence, she could understand his desire."
      },
      {
        "paragraph": "Everything that happened next followed a logical sequence."
      },
      {
        "paragraph": "However, he was just unable to please her using the conventional way."
      },
      {
        "paragraph": "After an unknown amount of time, Shaun went to the bathroom. As cold water poured from the shower,\nhe hammered his fist hard on the wall."
      },
      {
        "paragraph": "“Don’t be like that. You’ll get better.”"
      },
      {
        "paragraph": "A petite body hugged him from behind."
      },
      {
        "paragraph": "Shaun’s body trembled, and he turned around to face a stunningbeauty in front of him. Hisbreathing\nbecame erratic, but he could only laugh bitterly. “You know of my condition, yet you still deliberately\ntempt me.”"
      },
      {
        "paragraph": "“You don’t say it, but I know you don’t feel comfortable.” Catherine stuck her tongue out with her face\nflushed."
      },
      {
        "paragraph": "“Little vixen.” Shaun’s eyes deepened as he hugged her tightly and said in a husky voice, “Don’t show\nyour shoulders in the future.”"
      },
      {
        "paragraph": "“Huh?” She was confused."
      },
      {
        "paragraph": "“Your shoulder is lethal to men. It’s too seductive.” Shaun gnashed his teeth."
      },
      {
        "paragraph": "“No wonder… ” Catherine understood immediately. She had underestimated herself."
      },
      {
        "paragraph": "“You don’t come here often, so… stay with me longer, ” Shaun said, then kissed her again."
      },
      {
        "paragraph": "It was like he would never get tired of kissing her. He held her and moved them back to the bed again.\nThat was when his phone suddenly rang. Catherine picked the phone up, answered the call, and\npressed the speaker button. The voice of the police sounded. “President Hill, Mason Campos\ncommitted suicide in jail last night.”"
      }
    ]
  },
  {
    "title": "Chapter 1441 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Suicide?”"
      },
      {
        "paragraph": "Shaun looked down and met Catherine’s eyes. He saw the shock in her eyes."
      },
      {
        "paragraph": "“How did he commit suicide?”"
      },
      {
        "paragraph": "“He smashed his head on the wall.” The police said in a low voice, “He used a lot of force. It was clear\nthat he didn’t intend on surviving it. He died on the way to the hospital. I was hoping to get more\ninformation out of him, but I guess there would be no leads now.”"
      },
      {
        "paragraph": "“Did anyone visit him before his suicide?” Shaun went straight to the point."
      },
      {
        "paragraph": "“Yes, his woman, Joanne Holt.”"
      },
      {
        "paragraph": "Shaun fell silent. Many things were becoming clearer to him."
      },
      {
        "paragraph": "“We’re planning to interrogate that woman, ” said the policeman."
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "Shaun put down his phone and frowned deeply."
      },
      {
        "paragraph": "Catherine put on her clothes. She did not expect this to happen. “If he dies, the trail that Wesley is\ninvolved in the crimes will disappear.”"
      },
      {
        "paragraph": "“It’s my fault. ” Shaun’s expression was as cold as ice. “I should’ve thought that someone would use\nunscrupulous methods to threaten Mason with his child.”"
      },
      {
        "paragraph": "There was nothing that could threaten people like Mason. His only weakness was his own child."
      },
      {
        "paragraph": "Previously, Shaun had used his child to threaten him to confess his crimes honestly. Now, another\nperson had used his child to silence him."
      },
      {
        "paragraph": "“Forget it. Compared to the other person, you were just threatening him verbally. You would never raise\na hand against a child. But Wesley is different… He has no humanity left to speak of.” Catherine\nclenched her fists in abhorrence."
      },
      {
        "paragraph": "“You also think it was Wesley?” Shaun looked at her."
      },
      {
        "paragraph": "“Besides him, what other partners and accomplices did Mason have?” Catherine said in a low voice, “\nAfter all, when it comes to Mason and his position, the people he has common interests in won’t be\nordinary.”"
      },
      {
        "paragraph": "Shaun silently caressed her long hair. Just like that, his mood was ruined early in the morning."
      },
      {
        "paragraph": "He originally thought he could get Wesley and her a divorce as soon as possible."
      },
      {
        "paragraph": "“Cathy, don’t worry. I’ll tell Chester to lay on the pressure. If Wesley wants to maintain Golden\nCorporation, he’ll have to sign the divorce agreement as soon as possible. Otherwise, I’ll leave him with\nnothing.”"
      },
      {
        "paragraph": "A ruthless look flashed in Shaun’s eyes."
      },
      {
        "paragraph": "Wesley no longer had the assassins from Neah Bay helping him or the backing from Mason. As such,\ndealing with him would be easy."
      },
      {
        "paragraph": "“Well, forget it. Stop thinking about it. Let’s eat breakfast.” Catherine rested her chin on his shoulder. “I\nspecially brought you breakfast and"
      },
      {
        "paragraph": "put it on the desk outside, but it’s probably cold by now.”"
      },
      {
        "paragraph": "“You made it?” Shaun’s eyes lit up. “Yeah.” She answered lazily like a cat. “Thank you.” Shaun was\noverjoyed."
      },
      {
        "paragraph": "For him, there was nothing more delightful than eating breakfast she personally made."
      },
      {
        "paragraph": "“Just a thank you?” Catherine snorted absent- mindedly. “I got up at six in the morning just to make you\nbreakfast.”"
      },
      {
        "paragraph": "“Didn’t I thank you already?” Shaun glanced at the bed meaningfully."
      }
    ]
  },
  {
    "title": "Chapter 1442 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine was stunned for a moment. When she understood his meaning, she blushed and pinched his\nwaist fiercely. “You pervert.”"
      },
      {
        "paragraph": "“Ouch. It hurts. I’ll stop teasing you.” Shaun quickly pressed her into his arms and kissed her little ear.\n“I’ll tell you some news. I’ve already appointed Elle as the new master of Liona. In the future, you can\ntell Elle to handle any task you have. After all, Logan and Austin are both injured, and they won’t\nrecover in a short time. I think… Rebecca already knows of your left and right arm. That was why she\nhurt them as soon as she came back.”"
      },
      {
        "paragraph": "Catherine was deeply touched by his arrangement. Logan and Austin’s injuries troubled her, so\nShaun’s actions were a solution to her most pressing issue. “ I never thought Elle would be the master\nof Liona. She’s still young, and she’s also a woman…”"
      },
      {
        "paragraph": "“So what if she’s a woman? Don’t underestimate women. You’re a woman, but you’re much smarter\nand more rational than me.” Shaun kissed her cheek. “Elle is young, but her advantage is that she’s\nloyal to you.”"
      },
      {
        "paragraph": "Catherine looked startled. “Didn’t you prohibit Yael from being too loyal to Sarah?”"
      },
      {
        "paragraph": "“Sarah is Sarah, and you are you. You gave birth to my children, and you were willing to forgive me. I’m\nmore than happy to place you in the most important position.” Shaun took out a golden token from the\ndrawer and put it in her hand. “This is Liona’s new command token. With this, you can mobilize all the\npeople in Liona.”"
      },
      {
        "paragraph": "“Why are you giving me this? I don’t want it.” Catherine pushed it away."
      },
      {
        "paragraph": "“Take it. They’ll listen to me even without the token. ” Shaun hugged her and said dotingly, “ I’ll expand\nLiona’s power and give you the same status as me.”"
      },
      {
        "paragraph": "Catherine was touched. She raised her head and took the initiative to kiss his thin lips. “Shaun, let’s\ncarry on like this in the future, okay?”"
      },
      {
        "paragraph": "“Yeah, we will.” Shaun helped her get dressed and carried her out to have breakfast."
      },
      {
        "paragraph": "Although it was a little cold, the breakfast she made was still delicious."
      },
      {
        "paragraph": "He finished everything, and Catherine was prepared to leave when she said, “ I’ve taken the kids to the\nmanor. I’m planning to find a new preschool for them in the afternoon.”"
      },
      {
        "paragraph": "“No need. I’ve already found a good preschool for them, which is just at the foot of Sherman Mountain.\nIt’s the royal preschool near the Snow family’s house. The preschool is where all the country’s political\nbigwigs send their children to. It’s armed with a police corps and special forces, so the children will be\nabsolutely safe.”"
      },
      {
        "paragraph": "Catherine was stunned. She had heard of that preschool before. “ It isn’t a place you can send the kids\nto just because you have money, right?”"
      },
      {
        "paragraph": "“I asked Ryan for help,” Shaun said."
      },
      {
        "paragraph": "“Well, that’s good. If they go there, I won’t have to worry about Rebecca going after the kids.”"
      },
      {
        "paragraph": "In the morning, after Catherine sent the two children to the manor, she went to the hospital to visit Lea."
      },
      {
        "paragraph": "After leaving the hospital, she went to a nearby supermarket."
      },
      {
        "paragraph": "It seemed that a lot of new items had to be bought for the new place."
      },
      {
        "paragraph": "She first bought some toys and pajamas for the kids and then went to the men’s clothing section on the\nfourth floor."
      },
      {
        "paragraph": "“Could you fetch the suit from the model at the window for me to take a look, please?”"
      },
      {
        "paragraph": "Catherine had just finished speaking when a surprised voice sounded behind her. “Carrie.”"
      },
      {
        "paragraph": "Catherine turned around as an unruly mixed-race man strode in with large strides. His handsome face,\nwhich seemed like it was carved elaborately by the Gods, instantly captured the gaze of all the clerks in\nthe store."
      },
      {
        "paragraph": "“Matthew, why are you here?” Catherine raised her brows in surprise."
      },
      {
        "paragraph": "After that supper in Melbourne, she thought it was impossible for her to cross paths with Matthew\nagain."
      },
      {
        "paragraph": "“I came to Canberra this morning. I didn’t expect I would meet you in the afternoon. This must be fate.”\nMatthew still spoke with an accent, but it made his voice sound more attractive as a result."
      },
      {
        "paragraph": "“Yes.” Catherine did not expect this either. “Are you here to buy some clothes too?”"
      }
    ]
  },
  {
    "title": "Chapter 1443 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Yeah. I didn’t buy any clothes when I came to Canberra, so I thought about buying a few.” Matthew’s\nblue eyes exuded a charming smile. “We met just in time. Would you mind if I consult you?”"
      },
      {
        "paragraph": "Catherine was just about to speak when the clerk came over with a brown suit. “Miss Jones, is this the\nsuit you were talking about?”"
      },
      {
        "paragraph": "“Uh… Yes. ” Catherine nodded. “ Can you help me get one with a bigger size?”"
      },
      {
        "paragraph": "“Of course.” The clerk turned and went to change it. Before she left, she secretly sized Matthew up."
      },
      {
        "paragraph": "“Why did she call you Miss Jones?” Matthew blinked in confusion. “Isn’t your last name Yule?”"
      },
      {
        "paragraph": "“Sorry, my last name is actually Jones. ” Catherine smiled helplessly. “My name is Catherine Jones. ”"
      },
      {
        "paragraph": "“Carrie… No, Catherine. You’ve gone too far. I told you my real name and thought of you as a friend,\nbut you gave me a fake name.” Matthew had a bitter look on his handsome face."
      },
      {
        "paragraph": "If it were anyone else, Catherine would not bother to explain herself. However, Matthew was different.\nThe familiar and amiable feeling she got from him made her not want to see him angry. “ I’m sorry. It’s\nbecause I’m somewhat considered a public figure, and my reputation isn’t that good. When we met in\nMelbourne, I thought our paths crossed coincidentally and that we wouldn’t meet again."
      },
      {
        "paragraph": "That was why I made up a fake name.”"
      },
      {
        "paragraph": "“A public figure?” Matthew blinked. “Are you a celebrity? An artiste?”"
      },
      {
        "paragraph": "“No.” Catherine shook her head. “It’s more like… somewhat of an online celebrity.”"
      },
      {
        "paragraph": "“Oh.” A vague look of understanding flashed in Mathew’s eyes. “In any case, I guess this can be\nconsidered as us getting reacquainted. You live in Canberra, right? I’ll also settle down here in the\nfuture. This is great. You’re my first friend in Canberra. I’m very glad to meet you again.”"
      },
      {
        "paragraph": "He extended his right hand like a gentleman. Catherine shook his hand."
      },
      {
        "paragraph": "The shop attendant came over with a new suit, and Catherine said, “Help me wrap this up. Also, give\nme a set of the same size for the army green suit over there.”"
      },
      {
        "paragraph": "“Are you buying clothes for your husband?”"
      },
      {
        "paragraph": "Matthew hid the sourness in his heart and asked her."
      },
      {
        "paragraph": "Catherine pursed her lips and said honestly, “ Strictly speaking, he’s my ex-husband and my current\nboyfriend.”"
      },
      {
        "paragraph": "“But didn’t your friend back then say that you were married?”"
      },
      {
        "paragraph": "“I am, but my husband and I share no feelings. Also, he deceived me into marrying him. We’ve been\nliving separately for a long time and want to get divorced. We’ll have to go through the legal process\nsoon. ” Catherine smiled helplessly when she saw the stunned look in his eyes. “ Sorry, I may have\nscared you. My love life is actually very messy. I’ve gotten back together with my ex-husband, and we\nhave two children together.”"
      },
      {
        "paragraph": "“I didn’t expect… you’d have two marriages at such a young age.” Matthew said emotionally, “Since\nyou’re divorced, it must be because you don’t get along well. Yet, why did you get back together with\nhim? Is it because of the children?”"
      },
      {
        "paragraph": "“That’s half-right. The children are one of the reasons, but another reason is that I still love him.”\nCatherine admitted it openly."
      },
      {
        "paragraph": "Matthew froze for a moment, a complicated feeling spreading in the depths of his heart."
      },
      {
        "paragraph": "After a pause, he said, “ It’s a little unexpected, but it’s fine. I grew up abroad, so I’m relatively open-\nminded. As long as you like him, it’s fine.”"
      },
      {
        "paragraph": "“Thank you. ” Catherine was a little surprised. The average person would not be able to accept it."
      },
      {
        "paragraph": "In any case, Matthew’s words made her very happy."
      },
      {
        "paragraph": "“You have a good eye. Why don’t you… help me pick out some clothes?” Matthew’s long and slender\nfingers traced on the brand-new clothes."
      },
      {
        "paragraph": "“You’re handsome. You’ll look good in anything.” Catherine sized him up and finally picked out a few\nbrightly colored clothes."
      },
      {
        "paragraph": "“You want me to wear this kind of… orange clothes?” The corners of Matthew’s mouth twitched. He had\nnever worn such brightly colored clothes before."
      }
    ]
  },
  {
    "title": "Chapter 1444 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Didn’t you say I have a good eye?” Catherine looked confused. “ Besides, you have such a good\nfigure, and you’re at a nice age. You don’t have to wear dark colors all the time. Young men should\nwear bright clothes.”"
      },
      {
        "paragraph": "Then, she picked out more than ten outfits in one go."
      },
      {
        "paragraph": "The clothes in this shop were more suitable for people of Matthew’s age. He could wear a white vertical\nstriped shirt with jeans, and he could also wear a sky blue plaid shirt with beige cropped trousers."
      },
      {
        "paragraph": "If she had a younger brother, she would definitely dress him up like this."
      },
      {
        "paragraph": "Matthew watched her in shock. Those clothes were completely different from his usual dressing style."
      },
      {
        "paragraph": "He especially liked black, but Catherine did not pick a single one for him."
      },
      {
        "paragraph": "“ Sorry, I seem to have chosen too many. You can just buy…”"
      },
      {
        "paragraph": "“All of them.” Matthew took out a black card."
      },
      {
        "paragraph": "Catherine was stunned. She remembered that Shaun had a similar card, and it was not a card"
      },
      {
        "paragraph": "available to ordinary people. Moreover, the clothes in this shop were very expensive. Yet, Matthew"
      },
      {
        "paragraph": "spent hundreds of thousands of dollars without batting an eye."
      },
      {
        "paragraph": "“Matthew, why don’t you give your family a call? Buying this many clothes is expensive…”"
      },
      {
        "paragraph": "“No need. Money like this is chump change.” Mathew laughed. “My family ancestors had worked so\nhard to earn money. I don’t think I can spend it all in my life even if I tried.”"
      },
      {
        "paragraph": "Catherine was speechless."
      },
      {
        "paragraph": "This was a kind of humblebrag."
      },
      {
        "paragraph": "“By the way, since you’re from Canberra, do you know any good villas or manors here? I want to buy\none so that my parents will have a place to live in when they come over at the end of the month.”\nMatthew looked deep into her eyes as he spoke."
      },
      {
        "paragraph": "“At present, the best villas are at the west of the city. The environment there is excellent, and it’s close\nto the sea… ” Catherine said as she thought about it."
      },
      {
        "paragraph": "“When are you available? Could you accompany me to have a look? I’m not familiar with this place\nyet.” Matthew shrugged and looked at her expectantly."
      },
      {
        "paragraph": "“I have to arrange preschool for my children these"
      },
      {
        "paragraph": "two days…”"
      },
      {
        "paragraph": "“Then we’ll do it after two days.” Matthew looked at his watch. “ It’s getting late. Let me treat you to\ndinner.”"
      },
      {
        "paragraph": "“I…”"
      },
      {
        "paragraph": "“Are you busy? If you’re not available, I’ll eat some noodles around here by myself.” Matthew’s\nhandsome face became lonely."
      },
      {
        "paragraph": "Catherine, who was originally going to refuse, suddenly could not bear to. “I’ll treat you to dinner\ninstead, but I have to go back early. I can’t stay out too late.”"
      },
      {
        "paragraph": "“Great! Thank you.” Matthew’s eyes lit up. His already good-looking eyes sparkled like stars. “But\nthere’s no need for you to treat me. I’ll treat you.”"
      },
      {
        "paragraph": "Catherine smiled. It did not matter whose treat it was. It was just a meal."
      },
      {
        "paragraph": "However, for convenience’s sake, she chose a fondue restaurant upstairs."
      },
      {
        "paragraph": "“I don’t know if you’re used to eating fondue, but this is a pretty famous fondue restaurant franchise in\nCanberra. The food here is pretty good.” Catherine’s phone rang just as she took a seat."
      },
      {
        "paragraph": "When she saw the incoming call on it, she picked it up with a guilty conscience. “Hi…”"
      }
    ]
  },
  {
    "title": "Chapter 1445 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“ I’m on the way back to the villa. What about you? Are you with the children?” Shaun’s hoarse voice\ncame through from the other end."
      },
      {
        "paragraph": "“I’m out eating fondue with a friend. ” Catherine rubbed her nose."
      },
      {
        "paragraph": "“Who?” Shaun asked overbearingly, “Freya?”"
      },
      {
        "paragraph": "“No, a colleague in the company. You go and accompany the children. I’ll go back once I’m done.”\nCatherine nodded vaguely. She did not mean to lie. Shaun’s jealousy was just too strong."
      },
      {
        "paragraph": "“What colleague? Male or female?”"
      },
      {
        "paragraph": "“Shaun Hill, are you done?” Catherine pretended to be angry and said, “Why are you asking so much?\nDon’t you trust me?”"
      },
      {
        "paragraph": "“Is it that difficult to answer my question of whether it’s a guy or girl?” Shaun asked coldly."
      },
      {
        "paragraph": "“So what if it’s a guy? It’s none of your business. I’m just eating with a friend.” Catherine hung up the\nphone without a second thought."
      },
      {
        "paragraph": "Opposite her, Matthew looked at her playfully. “I’m your colleague?”"
      },
      {
        "paragraph": "Catherine explained awkwardly, “I can’t help it. If my boyfriend finds out that I’m eating with a\nhandsome hunk who’s younger than him, he’ll definitely get jealous. He’s a very domineering person.”"
      },
      {
        "paragraph": "“Then… Have you eaten with other young and handsome hunks before? ” A dim light flashed in\nMatthew’s deep eyes."
      },
      {
        "paragraph": "“No, ” Catherine told the truth. “I don’t have many guy friends. You’re the first. I feel… a sense of\nfamiliarity with you. If I had a younger brother, he’d probably be like you.”"
      },
      {
        "paragraph": "Matthew froze."
      },
      {
        "paragraph": "Catherine smiled. “ I don’t have a younger brother, so don’t misunderstand. My parents only gave birth\nto me.”"
      },
      {
        "paragraph": "“Your parents didn’t have another child?” Matthew asked deliberately."
      },
      {
        "paragraph": "Catherine shook her head, not wanting to answer this question. “Let’s order. You’re the guest, so you\ngo ahead.”"
      },
      {
        "paragraph": "“I don’t know much about the food here. Why don’t you order instead?” Matthew shook his head."
      },
      {
        "paragraph": "Catherine did not insist and only ordered a few dishes she thought were delicious."
      },
      {
        "paragraph": "Unexpectedly, Mathew said that besides the strong taste, it was very delicious. “I didn’t expect black\npudding and foie gras to be so delicious. We never eat this overseas. You people have very peculiar\nfood.”"
      },
      {
        "paragraph": "“Although it’s peculiar, it’s delicious.”"
      },
      {
        "paragraph": "Catherine found that Matthew’s and her preferences in food were very similar."
      },
      {
        "paragraph": "She liked beef a lot, and so did Matthew. She liked portobello mushrooms, which Matthew also liked."
      },
      {
        "paragraph": "This resulted in them ordering everything in twos."
      },
      {
        "paragraph": "“By the way, Matthew, are you going to settle in Canberra? What are you going to do here?” Catherine\nasked casually after the meal was almost over."
      },
      {
        "paragraph": "“I plan to open a bank…”"
      },
      {
        "paragraph": "“Ahem. ” Catherine almost choked to death from the mutton slices."
      },
      {
        "paragraph": "When she looked up, her eyes were hazy, and her lips were slightly red and swollen. She looked as\ncute as she could be."
      },
      {
        "paragraph": "Matthew’s eyes darkened slightly, and he smiled naturally. “Is it that weird to open a bank? My family\nhas opened many banks overseas.”"
      },
      {
        "paragraph": "“No wonder…” Catherine murmured. No wonder he could spend several hundreds of thousands\nwithout batting an eye. “But you’re still so young. Opening a bank is too…”"
      }
    ]
  },

  {
    "title": "Chapter 1446 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“ I’m young?” Matthew was stunned. “Not really. When I was 16, my dad left his business to me. I had\nto study and manage many businesses like banks and hotels.”"
      },
      {
        "paragraph": "Catherine looked outside the window."
      },
      {
        "paragraph": "“What are you looking at?” Matthew was puzzled."
      },
      {
        "paragraph": "“I’m looking if there are any cows outside taking a dump.” Catherine joked."
      },
      {
        "paragraph": "Matthew was at a loss for words."
      },
      {
        "paragraph": "He was telling the truth, yet she thought he was bullsh*tting."
      },
      {
        "paragraph": "“You don’t believe me?”"
      },
      {
        "paragraph": "“All I know is that when I was z1, I was still dating and worried about love every day. How am I\nsupposed to believe you if you say you’ve been managing so many businesses since you were\nsixteen?” Catherine shook her head. “People your age are at the peak of your youth. You should be\ndating, not earning money.”"
      },
      {
        "paragraph": "“Do you want to introduce a girl to me?” Matthew suddenly raised his brows."
      },
      {
        "paragraph": "Catherine paused. “You’re too young. I don’t know anyone young and suitable for you. You should go\nfind one yourself.”"
      },
      {
        "paragraph": "“But I like older girls like you.” Matthew looked at her with his Duchenne-smiling blue eyes."
      },
      {
        "paragraph": "Catherine was so stunned that she almost choked again. She widened her eyes. “Stop. I think of you a\ns a younger brother. If you have any other thoughts, we cannot stay friends.”"
      },
      {
        "paragraph": "Matthew looked at her firmly for a while before saying, “You really don’ t want to think about it? I’m rich.\nI’m super, super-rich. You can’t even imagine the amount of money I have…”"
      },
      {
        "paragraph": "Catherine frowned deeply. “Do you think I’ll give up my boyfriend just because you have money?”"
      },
      {
        "paragraph": "“That’s not what I mean…” Matthew hurriedly picked up his drink and blocked the look in his eyes."
      },
      {
        "paragraph": "He was actually trying to test her."
      },
      {
        "paragraph": "“Good. Otherwise, we can’t be friends.” Catherine sincerely admitted that she was a little upset and\ndisappointed with Matthew just now. “Relying on money to attract women is not a glorious thing. I’m not\nshort of money either.”"
      },
      {
        "paragraph": "“But doesn’t everyone think that the more money they have, the better? Greed is endless.” Matthew\nsaid thoughtfully."
      },
      {
        "paragraph": "Catherine chuckled. “You say you are ridiculously rich, but you’ re still here eating fondue with me.\nLook over there. There are working-class employees with a monthly salary of several thousand, yet\nthey’re eating the same things as us.”"
      },
      {
        "paragraph": "Matthew opened his beautiful lips slightly. However, he was at a loss for words. Only after a moment\ndid he find his voice. “ I’m very handsome “My boyfriend is also very handsome. ” Catherine interrupted\nhim. “He’s not inferior to you, and he also has the charm of a mature man.”"
      },
      {
        "paragraph": "Matthew rubbed his forehead, feeling powerless. “Is there really no part of me that attracts you?”"
      },
      {
        "paragraph": "Catherine looked at his young and handsome face and somehow felt amused. Nevertheless, she said\nseriously, “I really can only think of you as a younger brother. If not for that reason, I wouldn’t be here"
      },
      {
        "paragraph": "eating with you. If you want to flirt, then you have the wrong person. I suggest you find someone else.”"
      },
      {
        "paragraph": "Noticing that the patience in her eyes was gone, Matthew hurriedly said, “I was just joking. Actually I\nalso have an older sister like you, and she looks a little like you. That was why I felt close to you when I\nfirst saw you.”"
      },
      {
        "paragraph": "He really did not expect Catherine to have such a huge reaction to his reply."
      },
      {
        "paragraph": "Generally, women like her admire powerful people. Since she knew he was rich, would she not flirt with\nhim a little?"
      },
      {
        "paragraph": "Just as he was spacing out, Catherine looked behind him, and her face suddenly paled. Then, she\ncleared her throat and stood up, saying with a pleasing tone, “Shaunny, why are you here?”"
      },
      {
        "paragraph": "“How would I know that you’re having dinner with your male colleague if I don’t come here?” A gloomy\nvoice sounded behind him."
      },
      {
        "paragraph": "Turning around, Mathew saw a slender and noble – looking man, dressed in a grey suit, standing\nbehind him."
      }
    ]
  },
  {
    "title": "Chapter 1447 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "After seeing Shaun’s face clearly."
      },
      {
        "paragraph": "Matthew seemed to understand why Catherine said her boyfriend was not inferior to him."
      },
      {
        "paragraph": "He had seen Shaun’s face in the photo brought by his assistant. He was very handsome in the photo,\nbut in person, he looked more noble and elegant."
      },
      {
        "paragraph": "Matthew admitted he was very handsome too, but the age gap was undeniable."
      },
      {
        "paragraph": "The steady and calm temperament on Shaun’s body was also something brewed by years, and was\nsomething that Matthew lacked."
      },
      {
        "paragraph": "Shaun’s clear gaze swept over Matthew’s face. A mixed-race young man…Wait, mixed-race."
      },
      {
        "paragraph": "He remembered Rodney saying that Catherine ate supper with a mixed-race young man in Melbourne\nthe previous time. They ate from Melbourne to Canberra?"
      },
      {
        "paragraph": "Shaun’s handsome face turned cold immediately with a bitter frost. His sneering gaze fell on\nCatherine’s guilty and pretty little face. “Your colleague is mixed-raced? He’s very young too, huh?”"
      },
      {
        "paragraph": "The sexy trailing voice rose with a chilling hint. People close to him could feel his anger at that moment."
      },
      {
        "paragraph": "Catherine felt her scalp tingle. She could only tell the truth. “Actually, he’s the young man I met last time\nwhen I was in Melbourne. He came to Canberra and we just so happened to meet today, so I invited\nhim to a meal. You’re so overbearing and I’m afraid you’ll overthink it, so I simply said that he’s my\ncolleague.”"
      },
      {
        "paragraph": "When she finished speaking, she quickly took the initiative to grab his hand. Without waiting for him to\nreact, she introduced him to Matthew. “Didn’t I tell you before? My boyfriend is also very handsome. I\ndidn’t lie to you.”"
      },
      {
        "paragraph": "The anger on Shaun’s face dissipated a little at her words."
      },
      {
        "paragraph": "Of course, he knew that she was doing it on purpose."
      },
      {
        "paragraph": "However, when she told another man that he was handsome, his proud heart was still slightly\ncomforted."
      },
      {
        "paragraph": "Of course, it did not mean that he was no longer angry. He would have to teach her a lesson when they\ngot back."
      },
      {
        "paragraph": "Since they were outside, he had to assert his dominance."
      },
      {
        "paragraph": "“Hello. Catherine talked about you just now. She said that you’re mature and well-established,”\nMatthew stretched out his hand with a smile."
      },
      {
        "paragraph": "Shaun raised his brows and quickly frowned. “She’s several years older than you, so it’s not\nappropriate for you to call her that. It’s better to call her big sis.”"
      },
      {
        "paragraph": "Matthew was stunned. That man was really petty. Shaun did not even allow him to call her ‘Catherine’."
      },
      {
        "paragraph": "Catherine hurriedly shot a look at him secretly. “ Yeah, call me big sis. You’re a few years younger than\nme, so I’m not used to you calling my name.”"
      },
      {
        "paragraph": "“…Big sis.” Matthew saw her look as if she was afraid of her husband and the corners of his mouth\ntwitched hard."
      },
      {
        "paragraph": "Shaun was slightly satisfied, but he was still very unhappy when he saw Matthew’s fair and alluring\nface. He had to admit that Rodney was right. This person was really handsome, so handsome that it\nrevolted Shaun. Thus, he said, “Then you can call me big bro when you see me.”"
      },
      {
        "paragraph": "Catherine could only look at Matthew expectantly and encouragingly."
      },
      {
        "paragraph": "Matthew was speechless for a while before saying, “ Sorry, but usually it’s other people calling me big\nbro. I’m not used to calling others that.”"
      },
      {
        "paragraph": "Although he was younger than Shaun, with his identity, there were people all around the world\ncompeting to call him big bro. He only called Catherine big sis because he had some affection for her."
      },
      {
        "paragraph": "“You’re very arrogant, kid, ” Shaun chuckled. “ When I was your age, I was also very arrogant. Later,\nafter I suffered losses, I learned how the world really was.”"
      },
      {
        "paragraph": "Matthew chuckled arrogantly. “I have the final say o n how the world really is.”"
      },
      {
        "paragraph": "Catherine. “….”"
      },
      {
        "paragraph": "His bullsh*tting skills were top-notch."
      },
      {
        "paragraph": "“ Immature, ” Shaun’s s*xy lips threw out a single word. It was clear that he did not think highly of\nMatthew."
      },
      {
        "paragraph": "Matthew did not get angry either. ”I’m not immature. It’s just that you don’t know that there are people\nmore talented than you in the world. ”"
      }
    ]
  },
  {
    "title": "Chapter 1448 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun’s eyebrows furrowed."
      },
      {
        "paragraph": "Seeing the atmosphere going downhill, Catherine hurriedly said, “Okay, okay. Matthew Costner, have\nyou finished eating? We…”"
      },
      {
        "paragraph": "“I’m not done eating,” Matthew picked up his fork again."
      },
      {
        "paragraph": "Catherine’s words of ‘We’ll go first’ drowned in her mouth."
      },
      {
        "paragraph": "“Your last name is Costner?” Shaun’s eyes flashed. “What country are you from?”"
      },
      {
        "paragraph": "“Why are you asking that?” Matthew picked up a piece of beef."
      },
      {
        "paragraph": "“Are you from the Costner family in Neah Bay?” Shaun narrowed his eyes."
      },
      {
        "paragraph": "“What Neah Bay? What Costner family?” Matthew looked confused. “I’m from Country L.”"
      },
      {
        "paragraph": "Shaun was silent for a moment, but his exquisite eyes looked carefully at Matthew. He realized that\nbetween Matthew and Catherine, although one was a mixed-race man and the other was a beauty, and\nthey were two different faces, when put together, they seemed to look slightly alike."
      },
      {
        "paragraph": "“What are you looking at?” Catherine asked curiously."
      },
      {
        "paragraph": "“Are you looking at how handsome I am?” Although Matthew revealed a playful face, his heart sank."
      },
      {
        "paragraph": "He felt that Shaun might have noticed something."
      },
      {
        "paragraph": "“It’s nothing. Babe, I’m hungry, ” Shaun turned to Catherine. “I haven’t eaten dinner.”"
      },
      {
        "paragraph": "“Then let’s order more dishes, ” Catherine added a few more dishes. However, because Shaun had a\nbad stomach, she put them all in the non-spicy mushroom soup pot."
      },
      {
        "paragraph": "Matthew was surprised. “You live here yet you can’t eat spicy food?”"
      },
      {
        "paragraph": "“The country is very big, there are many others who eat light food too. There are Australians who don’t\neat vegemite either,” Shaun explained casually."
      },
      {
        "paragraph": "“But is it fun for you to eat together like this? One eats spicy food but the other doesn’t,” Matthew\ngrinned."
      },
      {
        "paragraph": "Shaun frowned, but Catherine took the opportunity to answer first. “Actually, I usually eat light food too.\nIt’s fine to eat spicy food occasionally, but it’s not good for the stomach to eat it often.”"
      },
      {
        "paragraph": "Shaun smirked and turned to press a kiss on Catherine’s face."
      },
      {
        "paragraph": "“What are you doing?” Catherine was a little embarrassed at how intimate he was when there was\nsomeone else around."
      },
      {
        "paragraph": "“I just can’t help but kiss you, ” Shaun smiled with charming eyes. “Babe, I want to eat the prawn.”"
      },
      {
        "paragraph": "“Don’t you have hands?” Catherine rolled her eyes at him."
      },
      {
        "paragraph": "Shaun sighed bitterly. “Babe, you lied to me just now and I haven’t even got over that yet…”"
      },
      {
        "paragraph": "“Fine, I’ll get it for you, ” Catherine straightened up immediately to get him a prawn."
      },
      {
        "paragraph": "Shaun peeled off the shells of the flavorful fresh prawn and fed it to Catherine occasionally."
      },
      {
        "paragraph": "Matthew sat opposite them and suddenly felt like he was a third-wheel."
      },
      {
        "paragraph": "At home, he had to watch as Sheryl and Titus shower each other with affection. When he was out,"
      },
      {
        "paragraph": "he had to watch Catherine and Shaun do the same thing."
      },
      {
        "paragraph": "Really. Was Shaun not supposed to be the richest man in the country?"
      },
      {
        "paragraph": "It was said that he fell from grace a few months ago, but these days, he rose to power again along with\nHill Corporation. Unexpectedly, he was so childish when interacting with women."
      },
      {
        "paragraph": "After eating, Matthew was ready to pay the bill, but Shaun was a step quicker. “My woman invited you\nto the meal. Of course I can’t let the guest pay the bill.”"
      },
      {
        "paragraph": "Matthew smiled and let him do as he pleased."
      },
      {
        "paragraph": "After paying the bill, Shaun grabbed Catherine and said, “Babe, let’s go shopping. It’s been a long time\nsince I accompanied you shopping.”"
      },
      {
        "paragraph": "Catherine knew what he was thinking and could only say to Matthew helplessly, “Sorry. We’ll go now.”"
      }
    ]
  },
  {
    "title": "Chapter 1449 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun looked at his back and frowned gloomily."
      },
      {
        "paragraph": "“Alright, stop being jealous, ” Catherine turned his face over. “How immature are you? Don’ t bother\nwith a little child.”"
      },
      {
        "paragraph": "“Can you call a man who can impregnate a woman, a little child?” Shaun snorted coldly. He did not\nhide the jealousy in his eyes. “Catherine, you lied to me again. When I was in Melbourne, I told you not\nto contact him anymore. You promised, but then you lied to me because of him, and you even secretly\nate hot pot with him.”"
      },
      {
        "paragraph": "“We didn’t eat secretly. We ate openly, ” Catherine pouted. “ I bumped into him by accident when I was\nshopping. He said that he just came to Canberra and was unfamiliar with the place…”"
      },
      {
        "paragraph": "“There are plenty of people who are unfamiliar with Canberra after just coming here. Why did you eat\nwith him out of all the people?” Shaun retorted. “ Since when were you such a saint? Is it because he’s\nhandsome?”"
      },
      {
        "paragraph": "“No…” Catherine lowered her head. “I just felt close to him when I saw him. It’s as if I knew him before.\nAfter speaking, she was afraid that Shaun would get angry and hurriedly explained, “In short, don’t\nmisunderstand. I don’t like him. I just think of him as a younger brother. The person I love is you.”"
      },
      {
        "paragraph": "“Love?” Shaun stopped and looked at her deeply. “ Prove it. Make me believe you.”"
      },
      {
        "paragraph": "“Shaun Hill, that’s enough. You’ve done so many things to hurt me. If I didn’t love you, would I have\ngotten back together with you?” Catherine was a little angry at his inopportune actions and flung his\nhand away, ignoring him."
      },
      {
        "paragraph": "“Cathy, half the reason you got back together with me is because of the children. ” Shaun chased after\nher and grabbed her, and said with a sour tone, “If i t weren’t for the children, you wouldn’t have gotten\nback together with me, right?”"
      },
      {
        "paragraph": "Catherine froze and fell silent for a while."
      },
      {
        "paragraph": "No matter what, the harm Shaun caused her was an indelible scar, especially Charity’s death which\nconstantly made her feel guilty."
      },
      {
        "paragraph": "However, she still got back together with him."
      },
      {
        "paragraph": "Even if she could not live with her conscience, she still chose to do so for the sake of her children."
      },
      {
        "paragraph": "“Forget it, you don’t have to say it. I understand.” Shaun wrapped his arms around her. “I shouldn’t\nhave asked for so much.”"
      },
      {
        "paragraph": "“Shaun, you should know me. Since I agreed to get back together with you, I won’t do anything to let\nyou down.”"
      },
      {
        "paragraph": "Catherine pushed his chest away and said seriously, “I admit that the biggest reason why I got back\nwith you is because of the children, but another reason is also… because I like you. Even if the day"
      },
      {
        "paragraph": "comes when I no longer like you and don’t want to be with you anymore, I’ll say it to your face. I’ve\nbeen betrayed before, so I know very well how much it hurts to be betrayed. Don’t do unto others what\nyou don’t want others to do unto you.”"
      },
      {
        "paragraph": "“Cathy…” Shaun looked at her with eyes filled with surprise, at a loss. “Thank you for liking me. I’ll work\nhard so that you’ll like me for the rest of your life. Don’t leave me, okay?”"
      },
      {
        "paragraph": "“Sorry, Shaun, but a lifetime is very long. You once told me that we would never be separated, but we\nwere still separated. I don’t want to think about the future. I just want to cherish the present.”"
      },
      {
        "paragraph": "Catherine shook her head seriously. “You know, if you keep trying to believe in forever, and that forever\nshatters, the amount of pain you’ll feel is unimaginable. Your memory is blurred so you haven’t\nexperienced what it’s like, but I’ll always remember it.”"
      },
      {
        "paragraph": "“…I understand.”"
      }
    ]
  }


]