[


  {
    "title": "Chapter 1350 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“What the hell do you want, Rodney? Can’t you leave me in peace?” Freya almost had another\nemotional breakdown."
      },
      {
        "paragraph": "“D… Don’t get angry, ” Rodney carefully lowered his dark eyes. “I just want to apologize to you sincerely.\nI know apologizing can’t change the harm I did to you. I admit that I’m a scum, that I went too far, and\nthat I’m stupid. I let you down and let the child down.”"
      },
      {
        "paragraph": "“That’s enough. Don’ t assume I don’t know that you want to marry me because it’s the only way you can\nreturn to the Snow family, ” Freya sneered. “"
      },
      {
        "paragraph": "I’m telling you. I’d rather marry a pig or a dog than marry you.”"
      },
      {
        "paragraph": "Rodney froze. He had almost forgotten about that. He saw her crying and said it subconsciously."
      },
      {
        "paragraph": "“I’m not,” Rodney had just finished speaking when the elevator reached."
      },
      {
        "paragraph": "Freya exited and he followed her."
      },
      {
        "paragraph": "When she reached the door, she turned around. “"
      },
      {
        "paragraph": "Rodney Snow, don’t you find yourself too pretentious? You don’t love me. You only want to go back to\nthe Snow family, yet you’re approaching me in such a deliberate manner. Have you ever thought that this\nis hurting me for the second time? Can you not treat me as a stepping stone? I’m a human, not a stone.\nI’ll be heartbroken and tired after getting hurt time and time again.”"
      },
      {
        "paragraph": "At the end of her sentence, her throat was sore and hoarse. She showed a kind of fatigue as if she was\nabout to break down."
      },
      {
        "paragraph": "Rodney’s face burned at her words and he became even more ashamed."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "He admitted that he wanted to pursue her before not because he liked her but because of the child, and\nbecause he wanted to return to the Snow family."
      },
      {
        "paragraph": "Freya knew that better than anyone."
      },
      {
        "paragraph": "Maybe it was because she just met Patrick, but her emotions were about to spiral out of control."
      },
      {
        "paragraph": "She went on to say, “Your family actually wants you to return to the Snow family, but because of their\nhonor, they’re afraid of being laughed at by others and they’re afraid that my heart will be uneasy, so they\npushed the burden on me. They want us to be together, and they want you to continue to be the"
      },
      {
        "paragraph": "father of the child, but no one asked my opinion. ”"
      },
      {
        "paragraph": "Freya could not hold back and cried. “Why am I always so unlucky? I keep meeting bad men and getting\nforced by them.”"
      },
      {
        "paragraph": "Then, she opened the door, went in, and slammed it shut."
      },
      {
        "paragraph": "Rodney stood outside the door. His throat felt stuck."
      },
      {
        "paragraph": "Others might not understand Freya’s feelings, but he did."
      },
      {
        "paragraph": "That was because he was also badly hurt by someone before."
      },
      {
        "paragraph": "He sat by the door blankly, his mind full of Freya’s tears."
      },
      {
        "paragraph": "Those tears filled up his chest stuffily."
      },
      {
        "paragraph": "After an unknown amount of time, Chester called him."
      },
      {
        "paragraph": "“Did you catch up to Freya?”"
      },
      {
        "paragraph": "“Chester… ” Rodney’s tone was slightly heavy. “ I really think you’ve gone too far with Freya tonight.\nShe’s still the mother of my child.”"
      },
      {
        "paragraph": "Chester.”…”"
      },
      {
        "paragraph": "He was indeed mean to Eliza, but he was not to Freya."
      },
      {
        "paragraph": "After all, he was the one who was snubbed by Freya the entire time."
      },
      {
        "paragraph": "Rodney then said, “Didn’t you tell me that she was pretty good before? Now, look at you. What did you\nsay tonight? You stabbed her like a hedgehog.”"
      },
      {
        "paragraph": "“I’m a hedgehog?” Chester was completely speechless. He regretted calling Rodney."
      },
      {
        "paragraph": "“Yeah, she’s been crying since she left,” Rodney was depressed. “ I’ve never seen her cry like that. ”"
      },
      {
        "paragraph": "“Was it that bad? Did she cry because you angered her?” Chester was confused. He did not remember\nwhat he said, but it would not be enough to make a woman cry, right?"
      }
    ]
  },
  {
    "title": "Chapter 1351 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“She was silently shedding tears when I saw her, ” Rodney’s tone was faint. “In the courthouse earlier, I\nsaw her chatting with Eliza. It seems she saw a TV show Eliza played in before. Maybe she could finally\nget up close with a celebrity she liked, but you single-handedly ruined it.”"
      },
      {
        "paragraph": "“ I think she quite likes Eliza. Why don’t you… give the order and tell Eliza to take the initiative to contact\nher?” Rodney said pleadingly, “Just let Eliza be her friend and make her happy. Fulfill her wish of getting\nclose with her idol.”"
      },
      {
        "paragraph": "The corners of Chester’s mouth twitched. “Why should I agree to your request? I’m not close with Freya.”"
      },
      {
        "paragraph": "“Chester, the child in her belly is mine, which means you’re the child’s godfather,” Rodney said\nimmediately."
      },
      {
        "paragraph": "“I don’t want to be your child’s godfather, ” Chester was full of disdain."
      },
      {
        "paragraph": "“Chester, I only have one child. Are you my bro or not?” Rodney sighed quietly. “I thought about it. In\nfact, I really went too far. I want to make it up to her slowly. Please help me.”"
      },
      {
        "paragraph": "“Alright, fine. I’ll talk to Eliza another day.” Chester was fed up and hung up the phone."
      },
      {
        "paragraph": "“Another day? Do it to…"
      },
      {
        "paragraph": "Before Rodney could finish, the phone was already beeping."
      },
      {
        "paragraph": "He put down his phone angrily and sat at the door, not going anywhere."
      },
      {
        "paragraph": "In the room."
      },
      {
        "paragraph": "After Freya calmed down for a while, she took out the business card from Patrick in her bag."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "This time, she was not joking."
      },
      {
        "paragraph": "She would settle her old scores with Linda one by one."
      },
      {
        "paragraph": "The next day, when she woke up, Aunty Sophia appeared with breakfast and said, “Miss Lynch, I just\nwent out to throw out the trash and saw Young Master Snow. He was sitting outside and sleeping. I t\nlooked like he stayed all night.”"
      },
      {
        "paragraph": "Freya was slightly shocked. Rodney stayed outside the whole night?"
      },
      {
        "paragraph": "“I know you’re at odds with him, so I didn’t let him in…” Aunty Sophia said awkwardly, “But letting him\nstay outside the entire time isn’t…”"
      },
      {
        "paragraph": "Freya hesitated but said, “Let him in.”"
      },
      {
        "paragraph": "Aunty Sophia quickly invited Rodney in. After Rodney changed his shoes, he carefully looked at Freya\nand saw her dressed in loose pink pajamas, sitting at the table peeling boiled eggs."
      },
      {
        "paragraph": "There was a large spread of breakfast on the table, making him hungry."
      },
      {
        "paragraph": "However, she did not speak, so he did not dare to go over, mainly because he was afraid of agitating her\nand her crying."
      },
      {
        "paragraph": "He was really afraid of women crying."
      },
      {
        "paragraph": "“S.i.t.” Freya saw him standing there and her eyes flashed with surprise. It was rare to see him so\nobedient."
      },
      {
        "paragraph": "Rodney took a seat opposite her. “Freya, last night“Rodney, I can give you a chance. Although I still can’t\naccept you, at least the grudge between us can"
      },
      {
        "paragraph": "be resolved,” Freya suddenly interrupted him."
      },
      {
        "paragraph": "Rodney was stunned for a few seconds before his beautiful face showed pleasant surprise. “Say it.”"
      },
      {
        "paragraph": "Freya handed over the business card in her hand. “ Jackson Corporation. It’s a food company founded in\nMelbourne. Recently, they came to Canberra to open a branch. I want you to suppress Jackson\nCorporation’s development.”"
      },
      {
        "paragraph": "Rodney saw the words ‘Patrick Jackson, CEO’ written on the business card."
      },
      {
        "paragraph": "Although he was removed from the Snow family, he had been in the capital for more than a decade. It\nwas child’s play to deal with a domestic enterprise. However, his intuition told him that Freya and this\nman might not have a shallow relationship."
      }
    ]
  },
  {
    "title": "Chapter 1352 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“You have a grudge against this man?”"
      },
      {
        "paragraph": "Rodney suddenly recalled that Freya was pestered b y a good-looking man three years ago. He\nremembered that she once said the entanglement between her ex-boyfriend and childhood friend hurt\nher, and inexplicably felt unhappy. “Is… this person your ex-boyfriend?”"
      },
      {
        "paragraph": "“Yeah, ” Freya chomped down her breakfast. Her long eyelashes cast a shadow on her face. “But the\nreason why I want to suppress Jackson Corporation has nothing to do with that person.”"
      },
      {
        "paragraph": "“Then who does it have to do with?” Rodney asked."
      },
      {
        "paragraph": "“You don’t need to know in detail. In short, if you really want to make up for your guilt, I’ll give you a\nchance. If you don’t want to, I’ll ask Ryan for help, ” Freya said impatiently."
      },
      {
        "paragraph": "Rodney was speechless."
      },
      {
        "paragraph": "He did not know why he should help her deal with her ex-boyfriend."
      },
      {
        "paragraph": "He did not believe that she was suddenly targeting her ex not because of hatred from being dumped."
      },
      {
        "paragraph": "However, seeing her so determined, Rodney had no choice but to mutter, “I’ll do it. It’s just a small food\ncompany. I can handle it. Do you want it to close down or…”"
      },
      {
        "paragraph": "“There’s no need for that. I heard that Jackson Corporation’s assets are more than 200 billion. It’s\nenough if you suppress them to 1oo billion, ” Freya scoffed coldly."
      },
      {
        "paragraph": "Rodney. “….”"
      },
      {
        "paragraph": "That was quite ruthless. “Fine.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "He agreed stiffly."
      },
      {
        "paragraph": "Freya got up and walked upstairs after breakfast, and Rodney could not help but say, “Actually, you can\njust let go of the past. If a person lives in the past all the time, they’ll be unhappy all their lives. ”"
      },
      {
        "paragraph": "“Have you come out of Sarah’s shadow already?” Freya asked him."
      },
      {
        "paragraph": "Rodney choked. “ I don’t want to retaliate against her. In the end, it’s one’s own business to fall in love\nwith someone. You can’t ask others to give you the same love just because you love them. You can only\nblame yourself for being foolish and not knowing the person. Even if you retaliate, it’s impossible to get\nback your lost love.”"
      },
      {
        "paragraph": "“ If you’re so noble, why don’t you go be a saint?”"
      },
      {
        "paragraph": "Freya suddenly turned back and looked at him sarcastically."
      },
      {
        "paragraph": "“ I’m advising you out of kindness,” Shaun’s face turned red from the mockery."
      },
      {
        "paragraph": "“Listening to your tone, it seems you never blamed Sarah before. But have you ever thought that you’re\nalready thirty, but you’ve never experienced what it’s like to love someone and have that person love you\nin return?”"
      },
      {
        "paragraph": "Freya walked to him step by step with sympathy in her eyes. “ If it weren’t for me, you wouldn’t even\nhave experienced what a woman tastes like. You’ve been a fallback guy for more than ten years.”"
      },
      {
        "paragraph": "Rodney’s handsome face was somewhat pale. “ That’s… That was because I was willing to be a fallback\nguy. Sarah always rejected me…”"
      },
      {
        "paragraph": "“You’re wrong. Stop making excuses for your stupidity. You don’t know how greedy a woman can be.\nEven if she has it in her hands, she’ll still be thinking of getting more. Sarah often tells you that if you\nappeared earlier, and if she hadn’t fallen in love with Shaun first, she would definitely fall in love, right?”"
      },
      {
        "paragraph": "Rodney froze and stared at her."
      },
      {
        "paragraph": "Freya looked at his expression and knew that she guessed correctly. “If she’s fine, she’ll call you. If she\nneeds help, she’ll come to you. When she’s in a bad mood, she complains to you. You accompany her\nand wait for her forever. All she has to do is call, and you’ll run to her.”"
      },
      {
        "paragraph": "Rodney blushed in embarrassment. “I…”"
      },
      {
        "paragraph": "Freya interrupted him. “There are often suitors around me, especially when I was dating in the past, but\nevery time I faced those suitors, I refused them firmly. I kept my distance and let them give up\ncompletely. It’s not because they’re not good, but I know that frequent meetings will only give the person\nthe illusion that there’s still a chance. It’ll make the person’s feelings for me go deeper, which is another\nkind of harm.”"
      }
    ]
  },
  {
    "title": "Chapter 1353 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Rodney could not say anything for a long time. Freya’s words made him realize many things."
      },
      {
        "paragraph": "“If a person knows you’re deeply in love with her, but she still frequently looks for you and tells you about\nthe ups and downs of her relationship, to put it bluntly, she’s just using you as a backup plan. It’s so that\nyou have the illusion that if she breaks up, you still have a chance.”"
      },
      {
        "paragraph": "Freya hit the nail on the head. “A woman like that isn’t worth pursuing and cherishing at all. Since she\ndoesn’t love you, she’ll only be ambiguous with you. If a more handsome and richer man appears, she\nwon’t hesitate to kick you away, and flirt with another person instead.”"
      },
      {
        "paragraph": "Rodney thought of that night where Sarah was making out with another man, and his heart suddenly felt\nso bitter that he could not speak."
      },
      {
        "paragraph": "Maybe it was true that women knew women best."
      },
      {
        "paragraph": "“Thank you. I’ll… know better in the future, ” he muttered softly, looking like a dog undergoing training."
      },
      {
        "paragraph": "Freya looked at his expression and felt quite satisfied."
      },
      {
        "paragraph": "“By the way, if you deal with Jackson Corporation, Patrick will definitely find out that it’s you. He’ll\ndefinitely run over and tell you bad things about me, so just ignore him.”"
      },
      {
        "paragraph": "Rodney blinked. “You’re his ex-girlfriend and he was the one who abandoned you. What bad things can\nhe say about you?”"
      },
      {
        "paragraph": "“ In his eyes, maybe… I’m a very, very bad woman. It’s like Cathy in the past. Shaun also regarded her a\ns a cheap woman. Do you think there’s only one woman like Sarah in this world?”"
      },
      {
        "paragraph": "Freya scoffed and went upstairs."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Rodney was naive and never met people like Rebecca and Linda. If he did, it would be an eye- opener."
      },
      {
        "paragraph": "Those three b*tches could make their debut as a group."
      },
      {
        "paragraph": "After Rodney left Brighton Gardens with a heavy heart, he quickly dialed his assistant’s phone number\nand asked him to make arrangements to deal with Jackson Corporation."
      },
      {
        "paragraph": "After all, he was the president of Osher Corporation. It was a small matter to deal with a domestic food\ncompany."
      },
      {
        "paragraph": "After giving the order, he still felt a little upset."
      },
      {
        "paragraph": "He was still handsome, and people used to say that his face was infinitely superior to the male idols in\nthe entertainment industry. He never expected that he would have to deal with Freya’s ex-boyfriend to\nget her attention."
      },
      {
        "paragraph": "He was becoming more and more of a good-for-nothing."
      },
      {
        "paragraph": "In the end, he could not help but call Shaun. “ Shaun, can you ask Catherine a question? Freya told me\nto deal with Jackson Corporation. What does that mean? Is it because she can’t let go of her ex?”"
      },
      {
        "paragraph": "“No need for him to ask.”"
      },
      {
        "paragraph": "A lazy and charming female voice was suddenly heard instead of Shaun’s."
      },
      {
        "paragraph": "Rodney looked at his phone. It was 8 in the morning."
      },
      {
        "paragraph": "What the hell. It was so early but they were already together?"
      },
      {
        "paragraph": "Or did Catherine and Shaun sleep together last night?"
      },
      {
        "paragraph": "He felt like he got another PDA attack again."
      },
      {
        "paragraph": "“You two… haven’t gotten out of bed?” Rodney thought of how he sat in the cold doorway last night and\nimmediately felt depressed."
      },
      {
        "paragraph": "People would not get hurt as long as they did not compare themselves to others."
      },
      {
        "paragraph": "“Is that strange?” This time, it was Shaun who chuckled in a low voice. “When you have a woman, you\nwon’t want to get out of bed either?”"
      }
    ]
  },
  {
    "title": "Chapter 1354 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Shaun, I hate you. Shut up, ” Catherine covered his mouth."
      },
      {
        "paragraph": "“Cathy, you’re so cute every time you say you hate me, ” Shaun smiled wickedly."
      },
      {
        "paragraph": "“Enough, you two,” Rodney could not bear it. Goosebumps all over his skin."
      },
      {
        "paragraph": "“ Shaunny, settle down.” Catherine warned Shaun and said, “It’s not that Freya can’t let go of Patrick. It’s\nbecause she wants to deal with the little btch beside him. If you’re not willing, I’ll deal with it personally. I\nalso just learned that Patrick actually brought that little btch along with him to Canberra.”"
      },
      {
        "paragraph": "“Cathy, what little b*tch? Don’t dirty your hands. I’ll do it for you,” Shaun said energetically."
      },
      {
        "paragraph": "Rodney became anxious. “Hey, don’t snatch this job from me. I didn’t say I was unwilling. I just wanted to\nask.”"
      },
      {
        "paragraph": "“ It’s complicated. You won’t believe us even if we told you, and I don’t want to waste my breath on you\neither, but it’s definitely not because of Patrick.” Catherine hung up the phone."
      },
      {
        "paragraph": "Rodney was scared that Catherine and Shaun would snatch the job from him and immediately told his\nassistant to take action quickly."
      },
      {
        "paragraph": "In Felix Media."
      },
      {
        "paragraph": "Eliza had a commercial to shoot in the morning, but she was suddenly called by Shedrick and had to\npostpone the shoot. She was in a bad mood when she arrived at the company."
      },
      {
        "paragraph": "“President Daley, why did you call me in such a hurry…”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Eliza spoke as she pushed the half-open door to the office, but her words choked at the sight of a\nslender and noble figure in the office chair."
      },
      {
        "paragraph": "“You’re here,” Chester’s slender fingers played with the black pen in his hands. His handsome features\nwere deep like water. “I’ve waited for ten minutes.”"
      },
      {
        "paragraph": "No matter how good Eliza’s temper was, her eyes filled with anger. “What a coincidence. I delayed a\ncommercial shoot for two hours in order to come here, which also disrupted my schedule today.”"
      },
      {
        "paragraph": "“As your boss, isn’t it an employee’s job to come whenever I call?” Chester stared at her cold eyes that\nwere filled with an extra emotion. Surprisingly, he did not feel angry but felt a little playful instead."
      },
      {
        "paragraph": "That expression… was too similar to someone’s."
      },
      {
        "paragraph": "In his memories, only Charity dared to look at him with such eyes."
      },
      {
        "paragraph": "He realized that he was eager to see Eliza’s angry look."
      },
      {
        "paragraph": "Eliza sneered at him. “Young Master Jewell, I’m afraid you didn’t read the contract I signed with the\ncompany. I’ve set up my own studio now. Except for attending the company’s quarterly and annual\nmeetings, or related activities held by the company, I usually don’t even need to come to the company. ”"
      },
      {
        "paragraph": "“Do you think… you have the right to challenge me?”"
      },
      {
        "paragraph": "Chester swiveled the leather chair, his handsome and thin lips curled slightly in mockery. The arrogance\nof his aura made Eliza secretly gnash her teeth."
      },
      {
        "paragraph": "She used to think of Chester as a scumbag, but she did not expect him to have such a cocky and\narrogant side."
      },
      {
        "paragraph": "Sure enough, she did not know him well enough anyway."
      },
      {
        "paragraph": "“You asked me to come here. What do you want?” Eliza was not in the mood to continue chatting with\nhim. “Do you want to continue mocking me and say that I approached Freya and the others because I\nhad an ulterior motive? Or do you want me to stay away from them?”"
      },
      {
        "paragraph": "“Do you have no ulterior motive?” Chester picked up the cigarette case on the table and took one out. “ I\ndon’t believe it.”"
      },
      {
        "paragraph": "“SO…”"
      },
      {
        "paragraph": "“Why did you go to the court yesterday? Do you hate Sarah, or do you hate Shaun? Or is it because you\nknow of Catherine’s relationship with Shaun, so you deliberately went because you knew they would be\nthere?” Chester lit the cigarette and narrowed his eyes in speculation."
      },
      {
        "paragraph": "“Whatever you think,” Eliza answered faintly. “ Whether you think I have an ulterior motive or that I just\nwant to watch Sarah’s luck run out, I don’t care.”"
      },
      {
        "paragraph": "After exhaling the smoke, Chester’s exquisite eyes narrowed slightly."
      },
      {
        "paragraph": "A moment later, he rose slowly and his voice was cold as ice. ”I think you hate Sarah, but you have no\nhistory with Sarah. Or… you’re watching on behalf of someone.”"
      },
      {
        "paragraph": "Eliza remained silent."
      }
    ]
  },
  {
    "title": "Chapter 1355 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "However, her heart seized up nervously."
      },
      {
        "paragraph": "“Eliza, tell me. Is Charity still alive?” Chester suddenly grabbed her chin. “Since she was a good\nchildhood friend of yours, it’s not impossible for her to come to you if she didn’t die.”"
      },
      {
        "paragraph": "“Hah…”"
      },
      {
        "paragraph": "Eliza looked like she heard a joke. Her beautiful eyes showed hateful anger. “Do you think a person can\njump into the rough seas without dying? If you have the ability, then go try it yourself. She’s dead. I also\nwished that… she didn’t die.”"
      },
      {
        "paragraph": "Even though her soul was still alive, her body was dead forever."
      },
      {
        "paragraph": "“I really don’t understand. You keep obsessing over whether Charity is dead or not. What does she have\nto do with you?” Eliza sneered. “Don’t tell me she’s one of the women you had in the past.”"
      },
      {
        "paragraph": "Chester turned away and closed his eyes."
      },
      {
        "paragraph": "He also did not know why he was so obsessed over whether Charity was dead or not."
      },
      {
        "paragraph": "Perhaps it was his last bit of conscience."
      },
      {
        "paragraph": "“You guessed it right. She liked me a lot in the past. She liked me to death, ” Chester’s thin lips lifted as\nhe said word by word."
      },
      {
        "paragraph": "Eliza’s heart almost burst with anger. “ I think that if you two really had a relationship before, it would be\nthe most regrettable thing in her life.”"
      },
      {
        "paragraph": "“How can you be so sure? You’re not her, ” Chester smiled wickedly."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“I know her. She’s a proud person. She must be very disgusted by a man like you who only knows how\nto get into heat when you see women, ” Eliza said coldly."
      },
      {
        "paragraph": "Chester’s cold eyes shivered and as his long legs approached her. “ Since you said that I go into heat\nwhen I see a woman, maybe you’re right. I’m in heat when I see you now.”"
      },
      {
        "paragraph": "The man’s tall and upright figure pressed on her."
      },
      {
        "paragraph": "Eliza’s heart tightened and she subconsciously took two steps back until her body hit the wall behind her."
      },
      {
        "paragraph": "Chester’s hands pressed on the wall, trapping her body in between him and the wall."
      },
      {
        "paragraph": "The faintly sweet scent of the woman’s body wafted into his nose."
      },
      {
        "paragraph": "His body froze."
      },
      {
        "paragraph": "It was the scent he smelled for the first time on his most memorable night."
      },
      {
        "paragraph": "He did not think about it before and ignored it."
      },
      {
        "paragraph": "However, when the familiar scent reemerged, he could still recall it."
      },
      {
        "paragraph": "Later, he asked and found out that it was the shampoo brand Charity used."
      },
      {
        "paragraph": "She only loved that kind."
      },
      {
        "paragraph": "He did not expect Eliza to use that brand too."
      },
      {
        "paragraph": "He looked down. The woman in his arms looked up a t him, her dark and shiny eyes hiding a bright burst\nof anger."
      },
      {
        "paragraph": "She looked like her. She looked so much like her."
      },
      {
        "paragraph": "Chester’s throat bobbed as his head went hot, and he lowered his head and kissed her beautiful lips\nforcefully."
      },
      {
        "paragraph": "Although he had many women before, this impulse had disappeared for a long, long time."
      },
      {
        "paragraph": "Her lips tasted similar to the one in his memory,"
      },
      {
        "paragraph": "sweet like jelly."
      },
      {
        "paragraph": "He succumbed to the taste of her lips and could not hold back."
      }
    ]
  },
  {
    "title": "Chapter 1356 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Eliza froze."
      },
      {
        "paragraph": "She never thought that Chester would be… so shameless."
      },
      {
        "paragraph": "He was getting married soon."
      },
      {
        "paragraph": "Even if she knew that there was no marriage fidelity when it came to people like him, she had said that\nshe was Charity’s childhood friend."
      },
      {
        "paragraph": "However, he was still so scummy."
      },
      {
        "paragraph": "Was he so horny that he had no moral boundaries? To think that she once loved such a man."
      },
      {
        "paragraph": "Eliza felt nauseous, deeply disgusted."
      },
      {
        "paragraph": "She pushed him hard, but the man’s chest was extremely sturdy."
      },
      {
        "paragraph": "She had no choice but to bite him fiercely until blood welled up."
      },
      {
        "paragraph": "Chester suddenly woke up. Eliza pushed him away and slapped him across the face."
      },
      {
        "paragraph": "The entire office fell into silence after the slap."
      },
      {
        "paragraph": "“You dare to hit me?” Chester’s eyes were heavy, just like an enraged venomous snake."
      },
      {
        "paragraph": "“Why wouldn’t I dare hit you? If I don’t beat up a rogue who tried to assault me, am I supposed to keep\nyou and bring you home to meet my parents instead?” Eliza sneered."
      },
      {
        "paragraph": "“Very good, Eliza Robbins. You’ve completely infuriated me this time. Since you called me a rogue, I’ll\nshow you how much of a rogue I am.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Chester picked her up by the waist and threw her onto the sofa, pressing his tall body down on her."
      },
      {
        "paragraph": "“Chester Jewell, let go!” Eliza really did not expect this man to be so crazy. Furthermore, Chester worked\nout regularly and was very strong. When she was pressed by him like this, her strength was like an ant\ncompared to an elephant."
      },
      {
        "paragraph": "Even when she raised her leg to kick upward, Chester clamped her legs and chuckled in a low voice.\n“You’re quite active.”"
      },
      {
        "paragraph": "Eliza’s eyes reddened in anger. “Chester Jewell, if you want to play with women, there are plenty for you\nto choose from. Why are you so fixated on me? Because I’ m Charity’s friend? Do you like to play with\nsisters so much? Aren’t you afraid that…"
      },
      {
        "paragraph": "Charity will die without peace?”"
      },
      {
        "paragraph": "Die without peace."
      },
      {
        "paragraph": "The three words smashed down on him like a hammer."
      },
      {
        "paragraph": "Chester’s body froze."
      },
      {
        "paragraph": "Eliza took the opportunity to push him away. She quickly straightened her clothes and rushed out of the\noffice."
      },
      {
        "paragraph": "Unexpectedly, after taking a few steps, she saw Cindy carrying a sachet and walking over loftily."
      },
      {
        "paragraph": "When she saw Eliza’s messy clothes and hickeys on her neck, she glanced at the president’s office door\nbehind Eliza and her eyes flashed scornfully. “Eliza, I didn’t expect you to be so cheap, or have you\nalways been like that? The people in the company called you noble and virtuous, but it turns out you’re\njust like this.”"
      },
      {
        "paragraph": "Eliza gave her a cold look and turned to leave without looking back."
      },
      {
        "paragraph": "“ Stop. Don’t you see that Cindy is talking to you?”"
      },
      {
        "paragraph": "Beside Cindy, her assistant Ada shouted, “Hey, didn’t you hear Cindy talking to you? Are you deaf? Do\nyou not want to work in the company anymore?”"
      },
      {
        "paragraph": "However, Eliza completely ignored her as if she did not hear them and left. Ada was furious. “Cindy, that\nb*tch is too disrespectful to you.”"
      },
      {
        "paragraph": "“It’s fine. She’s just President Daley’s plaything. He already has a wife. Did you think he would marry\nher?”"
      },
      {
        "paragraph": "Cindy laughed mockingly and went forward to push open the office door."
      },
      {
        "paragraph": "When she saw the figure sitting on the sofa, she was instantly dumbfounded. Her entire body seemed to\nfreeze."
      },
      {
        "paragraph": "She looked around the office but did not see Shedrick at all. In other words, the person who was with\nEliza just now… was Chester?"
      },
      {
        "paragraph": "How could that be?"
      }
    ]
  },
  {
    "title": "Chapter 1357 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Cindy’s face paled, especially at the sight of Chester’s lips that were stained with blood and his burning\neyes. She could also tell from his crotch that he was aroused."
      },
      {
        "paragraph": "Cindy was not a fool."
      },
      {
        "paragraph": "She just could not resign herself to the fact that Chester had always given her the cold shoulder no\nmatter how she seduced him back then. She had even doubted if he was the same man who had been\nwith a lot of women previously."
      },
      {
        "paragraph": "At this moment, she believed it."
      },
      {
        "paragraph": "It was not because Chester was not into women but simply because he was uninterested in her."
      },
      {
        "paragraph": "Unexpectedly, he was so excited when he was with Eliza."
      },
      {
        "paragraph": "Consumed by jealousy, she felt as if her chest was going to explode."
      },
      {
        "paragraph": "How could Eliza be comparable to her? Eliza must have used some devious tactics to seduce Chester."
      },
      {
        "paragraph": "What a b*tch! If Eliza was standing right in front of her, Cindy would have already slapped her twice to\nvent her anger."
      },
      {
        "paragraph": "After realizing what was happening, Ada, Cindy’s assistant, was stunned as she remained standing\nbehind Cindy."
      },
      {
        "paragraph": "Chester, who was involved in the matter, coolly placed his legs on the coffee table and lit a cigarette.\nSeemingly, he was displeased with Cindy’s arrival. “ Why are you here?”"
      },
      {
        "paragraph": "“You should leave.” Cindy shot Ada a look."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Ada nodded and sighed. She was under the impression that Chester was very concerned about Cindy,\nbut it turned out that it was not the case. If Chester really cared about Cindy, he would not be so calm\nand indifferent without the slightest sense of guilt after being caught red-handed."
      },
      {
        "paragraph": "After the office door was closed, Cindy’s eyes reddened and tears streamed down her face. “ Chester,\nwhy didn’t you look for me if you wanted to satisfy your needs—”"
      },
      {
        "paragraph": "“You?”"
      },
      {
        "paragraph": "Chester interrupted her while throwing her a stony glance. “Sorry, I can’t bring myself to sleep with you.”"
      },
      {
        "paragraph": "Stung by his words, Cindy was dumbfounded and her face turned ghastly."
      },
      {
        "paragraph": "What? He could not bring himself to sleep with her, yet he had no problem with Eliza?"
      },
      {
        "paragraph": "Chester lifted his eyes and darted a cold look at her. “You’re still dreaming, huh? You know full well why I\nmarried you. If you want to pursue this matter, I can strip you of your status as Young Madam Jewell at\nany time.”"
      },
      {
        "paragraph": "“No… No… ” Cindy’s lips quivered, but she was still dissatisfied. “I just… I just love you too much. I can’t\nstand it.”"
      },
      {
        "paragraph": "“If you can’t stand it, leave me alone then. Otherwise, I’ll get you another heart so that you can stand it,\nokay?” Chester reminded her with a mirthless smile."
      },
      {
        "paragraph": "Cindy shuddered. Others might not believe that Chester was cruel, but she did."
      },
      {
        "paragraph": "This man was different when he was with Rodney and Shaun. Indeed, he was a heartless, indifferent,\nand dangerous man."
      },
      {
        "paragraph": "“Get lost.” The words escaped Chester’s thin lips."
      },
      {
        "paragraph": "Cindy gnashed her teeth. “Fine, I’ll leave.”"
      },
      {
        "paragraph": "A teardrop rolled down her face. When she turned around and walked to the door, she looked back\nagain. “Chester, I know you’re unhappy with me and it’s unsurprising that you’re keeping another woman,\nbut I only hope that you’ll look for any other woman except Eliza. Eliza isn’t as simple as you think.\nFurthermore, she doesn’t deserve you.”"
      },
      {
        "paragraph": "“What are you trying to say?” Chester narrowed his eyes."
      },
      {
        "paragraph": "“Well, you might not know this.”"
      },
      {
        "paragraph": "Cindy bit her lip. “Eliza used to be Monte Patterson’s woman. When she was in college, she became his\nkept woman for four years. Eliza managed to sign a contract with Felix Media only because Monte pulled\nsome strings with Shedrick. But her performance was too poor in the first few years. Even after Monte\nspent a fortune on her, he failed to make her popular."
      },
      {
        "paragraph": "“Later, the Pattersons made Monte get engaged to a young lady from an eminent family as they looked\ndown on Eliza due to her background. Therefore, Eliza was abandoned by Monte two years ago.”"
      },
      {
        "paragraph": "Monte Patterson?"
      },
      {
        "paragraph": "Chester’s eyes were terrifyingly frosty."
      },
      {
        "paragraph": "Cindy shuddered. ” I’m not lying to you. President Daley and many people know about this as well. ”"
      }
    ]
  },

  {
    "title": "Chapter 1358 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Okay, I understand. Get lost.” Chester spoke impassively."
      },
      {
        "paragraph": "Those who did not know him well would think that Chester was totally unbothered by the issue."
      },
      {
        "paragraph": "Nevertheless, Cindy understood him pretty well, considering that she had been with him for a long time."
      },
      {
        "paragraph": "The more infuriated Chester was, the more indifferent he appeared."
      },
      {
        "paragraph": "Cindy just did not expect Chester to care so much about Eliza. She began to grit her teeth. The shooting\nof The Belle was about to begin, and Eliza was cast as the supporting female role. Cindy would definitely\npull some tricks out of her sleeve to make Eliza realize the consequences of overestimating herself and\napproaching her man."
      },
      {
        "paragraph": "Shortly after Cindy left, Chester kicked the coffee table violently."
      },
      {
        "paragraph": "With his kick, everything on the big coffee table became messy."
      },
      {
        "paragraph": "His handsome face darkened, while his eyes appeared strange with some unfathomable emotion."
      },
      {
        "paragraph": "Shedrick walked in and caught sight of the blood at the corner of Chester’s mouth. He gasped in shock\nbefore he smirked. “You said that you wanted to talk to Eliza in my office. Tsk, now I’m wondering if you\nwere talking to her or dominating her. What a fierce situation it must’ve been. If I’d known this earlier, I\nwould’ve gotten a condom ready for you.”"
      },
      {
        "paragraph": "Chester glanced at him coldly. “I heard Eliza used to be Monte’s kept woman.”"
      },
      {
        "paragraph": "Shedrick was momentarily stunned before he nodded. “Yeah.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Once Shedrick replied, he could clearly sense that the atmosphere in the office had turned cooler as\nthough the air conditioner was switched on."
      },
      {
        "paragraph": "“Why… didn’t I hear you mention it before?” Chester’s eyes flashed with a hint of deep hatred."
      },
      {
        "paragraph": "“When you play around with women… you’ve never been bothered if it’s their first time. Right?” Shedrick\nmuttered."
      },
      {
        "paragraph": "Chester was at a loss for words."
      },
      {
        "paragraph": "Indeed, he had never been bothered about this. However, when the thought that Eliza had been with\nsomeone else occurred to him, he would become grumpy for some reason. Given her haughtiness, why\nwas she willing to be a kept woman?"
      },
      {
        "paragraph": "After all, this woman was such a hypocrite."
      },
      {
        "paragraph": "She probably played hard to get by behaving haughtily in front of him."
      },
      {
        "paragraph": "Damn it. The minute he recalled kissing her just now, he felt like a fool who had fallen into her trap."
      },
      {
        "paragraph": "“Fine. It’s good that you’re not involved with her,” Shedrick suddenly said, “Although this was two years\nago, Monte really pampered her like a baby back then. Eliza seemed to have fallen for Monte and even\ntried to kill herself for him two years ago “Killed herself?” Chester was astounded. Based on Eliza’s\ncharacter, he never expected her to be the sort of person who would try to kill herself."
      },
      {
        "paragraph": "“I’m not sure to what extent she went either. Anyway, her agent said that she had a narrow escape from\ndeath at that time and she could’ve lost her life. When I visited her in the hospital later, I bumped into\nMonte. Monte said that she deliberately tried to kill herself in hopes that he’d change his mind. Although\nshe didn’t hurt herself"
      },
      {
        "paragraph": "badly, Monte was quite pissed about it. After he got home from the hospital, his parents arranged for him\nto get married.”"
      },
      {
        "paragraph": "As Shedrick explained, he handed a cigarette to Chester."
      },
      {
        "paragraph": "Chester took it and fiddled with it. His long eyelashes cast a shadow beneath his eyes."
      },
      {
        "paragraph": "He seemed to be smiling, yet the look of resentment in his eyes grew stronger."
      },
      {
        "paragraph": "Little did he expect Eliza to be such a despicable, unscrupulous woman."
      },
      {
        "paragraph": "“Later on, Eliza seemed to have transformed into a different person. ” Shedrick laughed. “She became\ndiligent, self-motivated, and indifferent. Even her acting became fabulous. Hmm, I quite like the current\nEliza. At least, she’s the artist who brings the most profits to the company.”"
      },
      {
        "paragraph": "“Enough. Don’t tell me anything else about her. ” Chester rose to his feet resentfully."
      },
      {
        "paragraph": "Initially, he found Eliza to be rather unique, but he had no feelings for her now."
      },
      {
        "paragraph": "Eliza was such a scheming woman. If he got involved with her, he would be in serious trouble."
      },
      {
        "paragraph": "Somehow, he was in a foul mood. His chest appeared to be stuffed with hostility."
      },
      {
        "paragraph": "After he got into the car, his phone rang. It was a call from Rodney. “I asked you to talk to Eliza, so how\ndid it go?”"
      },
      {
        "paragraph": "“I forgot, ” Chester said icily, “Don’t mention this woman anymore.”"
      }
    ]
  },
  {
    "title": "Chapter 1359 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“What’s wrong?” Rodney could not figure Chester out."
      },
      {
        "paragraph": "“After asking about Eliza, I found out that she has a dark past. You’d better stop Freya from interacting\nwith her too much. ” Chester hung up as soon as he finished speaking."
      },
      {
        "paragraph": "He then took out a cigarette and smoked leisurely in the car."
      },
      {
        "paragraph": "In addition to the smell of smoke, the scent of Eliza’s lips was still lingering in his mouth."
      },
      {
        "paragraph": "It was too damn sweet."
      },
      {
        "paragraph": "However, he found it both sweet and disgusting at this moment."
      },
      {
        "paragraph": "11:00 a.m."
      },
      {
        "paragraph": "Shaun drove to the seaside villa. He was driving an excavator."
      },
      {
        "paragraph": "Sarah walked out with a pale look. After hearing all the noise, she almost broke down. “Shaun, what are\nyou doing?”"
      },
      {
        "paragraph": "Plants were her favorite, yet he rolled across all of them on the excavator."
      },
      {
        "paragraph": "Shaun was wearing a pair of sunglasses. He lowered the window and stuck his carefree handsome face\nout. “Of course, I’m ruining it. Yesterday, the judge said that you must return the villa to me. When it hit\nme that you’ve been occupying this place, which used to be mine and Cathy’s home, for so many years, I\njust feel so disgusted that I want to destroy it right away.”"
      },
      {
        "paragraph": "“ Shaun, you… ” Sarah began to tremble with anger."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“This place doesn’t belong to you anymore.” Shaun added, “No, it has never belonged to you. Pack your\nstuff and get out right now.”"
      },
      {
        "paragraph": "“The court has given me one week. You have no right to make me leave now, ” Sarah bellowed with\ndissatisfaction."
      },
      {
        "paragraph": "“Fine. You can stay here for another one week, but the court didn’t state that I can’t destroy this place.\nIt’s fine if you continue staying here as long as you don’t mind sleeping on rubble.”"
      },
      {
        "paragraph": "Shaun snorted before he carried on with his excavation."
      },
      {
        "paragraph": "The bucket of the excavator rammed into the French window, creating a loud crash. With that, the entire\nwindow broke."
      },
      {
        "paragraph": "Sarah became agitated. “Stop it, Shaun! I’ve had enough. Give me an hour and I’ll move out.”"
      },
      {
        "paragraph": "There were a lot of branded bags, clothes, and jewelry inside. She would not have enough time to pack\nthem all."
      },
      {
        "paragraph": "“I’ll give you… ten minutes at most,” Shaun sneered."
      },
      {
        "paragraph": "“You…”"
      },
      {
        "paragraph": "“Nine minutes left.” Shaun raised his brows."
      },
      {
        "paragraph": "Sarah’s blood was boiling. She was afraid of saying something again as she would be left with only eight\nminutes."
      },
      {
        "paragraph": "She immediately dashed upstairs and packed the most expensive jewelry in the bedroom into a suitcase.\nBefore she finished packing everything, the excavator had entered the living room."
      },
      {
        "paragraph": "“Shaun, you’re such a madman!” Sarah ran out of the bedroom hysterically."
      },
      {
        "paragraph": "“Time’s up.” When Shaun saw the suitcase in her hand and the expensive necklace that was stuck at the\nzip, his eyes flashed with hatred. What a money-grubber she was."
      },
      {
        "paragraph": "He was deeply disgusted at the fact that she was his first love."
      },
      {
        "paragraph": "Shaun operated the excavator again. Soon, the whole villa was destroyed."
      },
      {
        "paragraph": "Sarah watched the scene with bloodshot eyes while standing outside."
      },
      {
        "paragraph": "‘Shaun Hill, just you wait. ‘ She would never forget the humiliation she suffered today. She would soon\nput him through hell. She took the suitcase and left the place with disheveled hair."
      }
    ]
  },
  {
    "title": "Chapter 1360 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "After Shaun was done with the excavation, he gave Catherine a video call."
      },
      {
        "paragraph": "“Look, Cathy. I destroyed the seaside villa myself. ”"
      },
      {
        "paragraph": "Catherine, who was in the office, was stunned for a few seconds when she saw Shaun standing among\nthe ruins. She probably did not expect the seaside villa to be destroyed to this extent."
      },
      {
        "paragraph": "“You’re too idle, huh?” She was speechless. “You said you were going to work this morning, but you\nended up demolishing the villa. How did you destroy it?”"
      },
      {
        "paragraph": "“With an excavator.”"
      },
      {
        "paragraph": "“You actually know how to operate an excavator?” Catherine was taken aback."
      },
      {
        "paragraph": "“Mm. I just learned it this morning.” Shaun smiled faintly."
      },
      {
        "paragraph": "Catherine was at a loss for words."
      },
      {
        "paragraph": "When he made such a remark, did he consider the feelings of those learning how to operate an\nexcavator? They would usually spend half a year, or at least three to four months to complete training."
      },
      {
        "paragraph": "“Congratulations. You’ve acquired another money- making skill,” Catherine teased him with a laugh."
      },
      {
        "paragraph": "“Cathy, I wanted to destroy this place myself because our home was contaminated by Sarah. I don’t want\nit to be an eyesore for you, ” Shaun said earnestly."
      },
      {
        "paragraph": "Catherine’s eyes revealed a hint of gentleness. “ Where’s Sarah?”"
      },
      {
        "paragraph": "“I chased her out. She swiftly packed some jewelry in a suitcase before she left.” Shaun’s face expressed\nsarcasm and grief. “… Why did I meet such a woman back then? I feel disgusted when it hits me that"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "she used to be my girlfriend.”"
      },
      {
        "paragraph": "“Think about me and you won’t feel disgusted, then.” Catherine blinked playfully."
      },
      {
        "paragraph": "Shaun melted. “Cathy, have lunch with me today, alright? I miss you.”"
      },
      {
        "paragraph": "“We just saw each other less than two hours ago.” With his affectionate gaze on her, Catherine’s face\nflushed."
      },
      {
        "paragraph": "“But I miss you. If you don’t come over, I’ll go to your office and eat with you, ” Shaun said with a grin."
      },
      {
        "paragraph": "“The food in our office is so-so…”"
      },
      {
        "paragraph": "“It doesn’t matter. Anything will taste good as long as I’m with you.” Shaun could not wait to see her."
      },
      {
        "paragraph": "Catherine’s face was burning."
      },
      {
        "paragraph": "After hanging up, she calmed down to ease the butterflies in her stomach. Then, she asked Harvey to\ncome in. “Ask the kitchen to prepare an extra portion of food. Shaun will be here to have lunch.”"
      },
      {
        "paragraph": "Harvey was speechless. “President Hill is really clingy.”"
      },
      {
        "paragraph": "“Yeah.”"
      },
      {
        "paragraph": "A sweet smile spread across Catherine’s face."
      },
      {
        "paragraph": "Perhaps no one would have expected Shaun to be so clingy when he was in a relationship."
      },
      {
        "paragraph": "Meanwhile, Sarah finally appeared in front of Wesley after some struggle."
      },
      {
        "paragraph": "At this point, she really had nothing left."
      },
      {
        "paragraph": "The villa was gone. Moreover, she had to return the 1oo billion dollars. She had never thought that she"
      },
      {
        "paragraph": "would have nobody else to count on except for Wesley."
      },
      {
        "paragraph": "Nevertheless, the moment she saw Wesley’s grim expression, she sank into despair."
      },
      {
        "paragraph": "She was aware that Wesley was even more cruel and indifferent than her."
      },
      {
        "paragraph": "He had been keeping her by his side all along only because she was still of use."
      },
      {
        "paragraph": "“I thought you were a useful pawn, but unexpectedly…” Wesley shook his head. Clearly, he was\nextremely disappointed in Sarah. “You even lost 100 billion dollars now. How are you different from the\nmost ordinary woman out there?”"
      }
    ]
  },
  {
    "title": "Chapter 1361 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South] Chapter 1366"
      },
      {
        "paragraph": "Rebecca did not know that there was someone standing behind the glass window on the fifth floor,\nsilently watching her leave."
      },
      {
        "paragraph": "That man coolly stuck his hands into his pockets."
      },
      {
        "paragraph": "The lights above him highlighted his curly hair that fell over his shoulders. A lot of men looked\nunattractive with long hair, yet he had an alluringly handsome face that resembled a devil’s."
      },
      {
        "paragraph": "Nevertheless, anyone who caught sight of him would be filled with dread because of his mysterious\nazure eyes. His eyes could send chills down one’s spine."
      },
      {
        "paragraph": "Everyone knew that the owner of Neah Bay, Titus Costner, had the same kind of eyes."
      },
      {
        "paragraph": "That man was Titus’ son, Matthew Costner—the future successor of Neah Bay."
      },
      {
        "paragraph": "“Young Master…” A tanned subordinate walked over. “I’ve inquired about it. Her last name is Jones, and\nshe came from Australia.”"
      },
      {
        "paragraph": "“Jones?” Matthew narrowed his eyes slowly. “"
      },
      {
        "paragraph": "Don’t you think… she looks like my mom?”"
      },
      {
        "paragraph": "After keeping silent for a moment, the subordinate responded, “After taking a closer look at her, I think\nshe’s undergone plastic surgery before."
      },
      {
        "paragraph": "Perhaps she found out about Madam’s appearance and underwent plastic surgery to look like her.”"
      },
      {
        "paragraph": "“My mom hardly shows her face. What’s more, her expressions and behavior are like my mom’s too.”\nMatthew said with a complicated tone, “My mom told me that she gave birth to a child before she came"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South] Chapter 1366"
      },
      {
        "paragraph": "to Soromon Island. This means that I have a stepsister who shares the same mom as me.”"
      },
      {
        "paragraph": "“Are you suspecting it’s her?” The subordinate was astonished."
      },
      {
        "paragraph": "“Ask the hotel staff to find a way to get two strands of her hair. I want DNA tests done for her and my\nmom as soon as possible. I want to know the result tomorrow morning.”"
      },
      {
        "paragraph": "After Matthew gave the order, he turned around and left."
      },
      {
        "paragraph": "When dawn broke the next morning, the subordinate came to him with the result. “Young Master, it turns\nout that she’s indeed related to you. Her DNA is a gg percent match to your mom’s. This also means that\nyou’re definitely related to her. ”"
      },
      {
        "paragraph": "Matthew took the reports to have a look. His eyes revealed a look of delight."
      },
      {
        "paragraph": "If his mother learned that he had found her long- lost daughter, she would be very pleased."
      },
      {
        "paragraph": "He immediately took the report and rushed to the chateau."
      },
      {
        "paragraph": "Upon learning her mom’s whereabouts, he promptly headed to the lake behind the chateau."
      },
      {
        "paragraph": "A married couple was fishing by the lake. Despite being in their middle ages, the two of them maintained\na youthful appearance. The woman was pretty, while the man was handsome. Both of them seemed like\nthey were only in their 30s."
      },
      {
        "paragraph": "“Darling, don’t keep your eyes fixed on the fishing rod. Look at me.” At this moment, Titus, the dominant\nowner of Neah Bay, was far from arrogant and domineering like how others perceived him to be. He\nclung to his wife like a puppy."
      },
      {
        "paragraph": "“ Shut up and be quiet. Don’t scare my fish away. ” Sheryl Olsen shot Titus a fierce glare."
      },
      {
        "paragraph": "Titus blinked gloomily. “Wifey, do you love me or the fish more?”"
      },
      {
        "paragraph": "Sheryl was speechless. “You’re still so childish at this old age. Stop being silly.”"
      },
      {
        "paragraph": "“Am I that old? I feel like I’m only in my early 30s, ” Titus replied with a grin."
      },
      {
        "paragraph": "Sheryl was at a loss for words."
      },
      {
        "paragraph": "“Mommy…” Matthew hurriedly ran to her."
      },
      {
        "paragraph": "Titus cast a disdainful look at him. “Why are you back? Didn’t I ask you to manage our family business?\nYou always travel to and from.”"
      },
      {
        "paragraph": "Being treated with disdain by his father, Matthew was completely speechless. He felt as though he was a\ngiveaway prize that his mother gave his father and was not at all welcomed"
      }
    ]
  },
  {
    "title": "Chapter 1362 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Rebecca did not know that there was someone standing behind the glass window on the fifth floor,\nsilently watching her leave."
      },
      {
        "paragraph": "That man coolly stuck his hands into his pockets."
      },
      {
        "paragraph": "The lights above him highlighted his curly hair that fell over his shoulders. A lot of men looked\nunattractive with long hair, yet he had an alluringly handsome face that resembled a devil’s."
      },
      {
        "paragraph": "Nevertheless, anyone who caught sight of him would be filled with dread because of his mysterious\nazure eyes. His eyes could send chills down one’s spine."
      },
      {
        "paragraph": "Everyone knew that the owner of Neah Bay, Titus Costner, had the same kind of eyes."
      },
      {
        "paragraph": "That man was Titus’ son, Matthew Costner—the future successor of Neah Bay."
      },
      {
        "paragraph": "“Young Master…” A tanned subordinate walked over. “I’ve inquired about it. Her last name is Jones, and\nshe came from Australia.”"
      },
      {
        "paragraph": "“Jones?” Matthew narrowed his eyes slowly. “"
      },
      {
        "paragraph": "Don’t you think… she looks like my mom?”"
      },
      {
        "paragraph": "After keeping silent for a moment, the subordinate responded, “After taking a closer look at her, I think\nshe’s undergone plastic surgery before."
      },
      {
        "paragraph": "Perhaps she found out about Madam’s appearance and underwent plastic surgery to look like her.”"
      },
      {
        "paragraph": "“My mom hardly shows her face. What’s more, her expressions and behavior are like my mom’s too.”\nMatthew said with a complicated tone, “My mom told me that she gave birth to a child before she came"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "to Soromon Island. This means that I have a stepsister who shares the same mom as me.”"
      },
      {
        "paragraph": "“Are you suspecting it’s her?” The subordinate was astonished."
      },
      {
        "paragraph": "“Ask the hotel staff to find a way to get two strands of her hair. I want DNA tests done for her and my\nmom as soon as possible. I want to know the result tomorrow morning.”"
      },
      {
        "paragraph": "After Matthew gave the order, he turned around and left."
      },
      {
        "paragraph": "When dawn broke the next morning, the subordinate came to him with the result. “Young Master, it turns\nout that she’s indeed related to you. Her DNA is a gg percent match to your mom’s. This also means that\nyou’re definitely related to her. ”"
      },
      {
        "paragraph": "Matthew took the reports to have a look. His eyes revealed a look of delight."
      },
      {
        "paragraph": "If his mother learned that he had found her long- lost daughter, she would be very pleased."
      },
      {
        "paragraph": "He immediately took the report and rushed to the chateau."
      },
      {
        "paragraph": "Upon learning her mom’s whereabouts, he promptly headed to the lake behind the chateau."
      },
      {
        "paragraph": "A married couple was fishing by the lake. Despite being in their middle ages, the two of them maintained\na youthful appearance. The woman was pretty, while the man was handsome. Both of them seemed like\nthey were only in their 30s."
      },
      {
        "paragraph": "“Darling, don’t keep your eyes fixed on the fishing rod. Look at me.” At this moment, Titus, the dominant\nowner of Neah Bay, was far from arrogant and domineering like how others perceived him to be. He\nclung to his wife like a puppy."
      },
      {
        "paragraph": "“ Shut up and be quiet. Don’t scare my fish away. ” Sheryl Olsen shot Titus a fierce glare."
      },
      {
        "paragraph": "Titus blinked gloomily. “Wifey, do you love me or the fish more?”"
      },
      {
        "paragraph": "Sheryl was speechless. “You’re still so childish at this old age. Stop being silly.”"
      },
      {
        "paragraph": "“Am I that old? I feel like I’m only in my early 30s, ” Titus replied with a grin."
      },
      {
        "paragraph": "Sheryl was at a loss for words."
      },
      {
        "paragraph": "“Mommy…” Matthew hurriedly ran to her."
      },
      {
        "paragraph": "Titus cast a disdainful look at him. “Why are you back? Didn’t I ask you to manage our family business?\nYou always travel to and from.”"
      },
      {
        "paragraph": "Being treated with disdain by his father, Matthew was completely speechless. He felt as though he was a\ngiveaway prize that his mother gave his father and was not at all welcomed"
      }
    ]
  },
  {
    "title": "Chapter 1363 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "At the thought that his father was going to feel horrible later, Matthew was inwardly elated."
      },
      {
        "paragraph": "“Mommy, I have a piece of staggering news for you this time.” Matthew’s face was filled with excitement."
      },
      {
        "paragraph": "“What news?” Sheryl looked at him in bewilderment."
      },
      {
        "paragraph": "“I found the child you previously gave birth to. ” As soon as Matthew finished speaking, Titus tugged at\nhis collar."
      },
      {
        "paragraph": "“What did you just say?” Titus’ gaze made him seem as if he wanted to devour Matthew."
      },
      {
        "paragraph": "“Shoo! ” Sheryl pushed Titus away. “When you married me, you promised that you’ll accept my other\nchild if I ever find them later on.”"
      },
      {
        "paragraph": "Titus’ mouth hung open, and his face expressed his grievances."
      },
      {
        "paragraph": "“Don’t worry, I’ll only acknowledge the child and won’t have anything to do with my ex, ” Sheryl said with\na soft tone."
      },
      {
        "paragraph": "Only then did Titus’ expression soften. “Fine, then. You can’t be in touch with that man, or I’ll certainly\nruin his family.”"
      },
      {
        "paragraph": "Sheryl looked at Matthew eagerly without being bothered about Titus."
      },
      {
        "paragraph": "“Mommy, look.” Matthew handed two DNA test reports to her. “Recently, there was a woman who visited\nthe casino and won three days in a row."
      },
      {
        "paragraph": "She’s quite brilliant. When I went for an inspection, I spotted her and instantly thought that she looked\nlike you. So I asked someone to take her hair for the DNA test.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "After looking at the reports, Sheryl was thrilled. “It turns out that I gave birth to a daughter back then.\nHurry up and bring her over, Matthew.”"
      },
      {
        "paragraph": "“Hold on, wifey. I find it a bit strange, ” Titus said, “ Why did she show up in the casino and gamble for\nthree consecutive days? It seems like she’s trying to get someone to appear.”"
      },
      {
        "paragraph": "“But the DNA test results can’t be wrong. Even if she has an ulterior motive, we can find out by asking\nher.”"
      },
      {
        "paragraph": "Sheryl could not wait to meet her daughter. “ Hubby, I hope you can understand. She’s not only my\nbiological daughter but also the only bridge"
      },
      {
        "paragraph": "between me and my parents. Back then, the waves swept me to Soromon Island. I don’t have the\nfaintest idea where I came from. All I had was a piece of wood carved with the name ‘Sheryl’ in my hand.\nI don’t know who my parents are, whether I have any siblings, and where I live. I know nothing.”"
      },
      {
        "paragraph": "“Alright, Sheryl. I’ll support you.” Titus let out a sigh and hugged her."
      },
      {
        "paragraph": "Having fallen for her at first sight, he only had himself to blame."
      },
      {
        "paragraph": "Shortly after, Matthew brought Rebecca over."
      },
      {
        "paragraph": "On her way here, Rebecca was perturbed, nervous, and overjoyed."
      },
      {
        "paragraph": "Never in her wildest dreams did she think that her plan would actually work."
      },
      {
        "paragraph": "The hair that Titus obtained for the DNA test belonged to Catherine. Wesley had collected all of\nCatherine’s hair that fell throughout his stay with her."
      },
      {
        "paragraph": "Rebecca deliberately left Catherine’s hair on her comb and the floor of the hotel."
      },
      {
        "paragraph": "The hotel staff had taken Catherine’s hair when Rebecca was not around."
      },
      {
        "paragraph": "Soon, Rebecca would become the daughter of the owner of Soromon Island as well as the sister of the\nfuture owner of Neah Bay. By then, destroying Shaun and Catherine would just be as easy as squashing\nan ant."
      },
      {
        "paragraph": "She just hoped that Sheryl’s memory would never be restored."
      },
      {
        "paragraph": "Matthew took her to the chateau. After a short while, a married couple walked down the stairs."
      },
      {
        "paragraph": "Rebecca had seen Sheryl in the Jones family’s photo. Only when she met Sheryl in person did she\nrealize she looked much better in real life. Sheryl looked mature and charming. Just like a blooming rose,\nshe appeared icily elegant and noble."
      },
      {
        "paragraph": "After feeling dazed, Rebecca soon began to put on an act. “Mom…”"
      }
    ]
  },
  {
    "title": "Chapter 1364 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Matthew’s expression shifted a little, whereas Sheryl looked at Rebecca with perplexity. “You know I’m\nyour mom, huh?”"
      },
      {
        "paragraph": "“I’ve seen you in Granny’s photo.” Rebecca began to choke up. “Something happened to you soon after\nyou gave birth to me.”"
      },
      {
        "paragraph": "“What happened?” Sheryl asked gently, but her gaze became sharp without anyone noticing it."
      },
      {
        "paragraph": "With her current status and rank, she had to be alert now that a daughter who seemingly came from\nnowhere was acknowledging her."
      },
      {
        "paragraph": "“You got swept up in a typhoon.” Rebecca bit her lip. “I was too young back then, so I’m not very sure. I\nonly got to know about the incident when Granny mentioned it during her last moments a few years ago.\nShe said that you suddenly headed to Country T because of a call. At that time, there was a typhoon and\nyou went missing after that. The police said that the typhoon might’ve swept you into the sea and you\ndidn’t survive. Grandpa and Granny even had a cenotaph erected for you.”"
      },
      {
        "paragraph": "Sherly’s chest stiffened."
      },
      {
        "paragraph": "She had been rescured from the sea. Apart from the island owner and a few of his confidants, no one\nelse knew about the incident. Now that those confidants had passed away, only Titus and Mathew knew\nabout it."
      },
      {
        "paragraph": "“So is my mom already dead?” Sherly was baffled, and her heart ached."
      },
      {
        "paragraph": "“Not only is Granny dead, but Grandpa has also long since passed away. They were already in their\n80s.” Redecca sighed with red eyes. “You also have an elder brother called jeffery jones, and Uncle\ntreats me pretty well.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Really?” A look of distress washed over Sherly’s face."
      },
      {
        "paragraph": "Despite her memory loss, she could remember that it was her parents who raised her ever since she\nwas born. She was supposed to fulfill her filial duty at this time, yet she ended up in this distant place. “Is\nmy brother doing well?”"
      },
      {
        "paragraph": "“No, he’s in jail.” Rebecca sighed."
      },
      {
        "paragraph": "Sheryl was stunned, Then, she narrowed her beautiful eyes. “What happened?”"
      },
      {
        "paragraph": "“It’s quite a complicated matter.”"
      },
      {
        "paragraph": "Rebecca pursed her lips. After hesitating for a moment, she said, “It has to do with his daughter. Oh well,\nlet’s drop it. Mom, I actually came to Neah Bay this time to look for you. I wasn’t sure if you were still\nalive either. But a year ago, I came across a man who told me that he saw someone in Neah Bay who\nlooked like me. I thought you might still be alive, so I came here with a purpose. I was just trying my luck,\nbut I didn’t expect…”"
      },
      {
        "paragraph": "Tears trickled down her face again. “ I didn’t know how else I could search for you. I won three days in a\nrow in the casino, hoping to attract attention among the people in Neah Bay. Perhaps you’d be aware of\nme and notice our resemblance…”"
      },
      {
        "paragraph": "“Enough. I understand everything.” Sheryl went to Rebecca and hugged her gently. Her previous doubts\nabout Rebecca coming to Neah Bay had vanished at this moment. “You must’ve had a hard time over\nthe years, my girl.”"
      },
      {
        "paragraph": "“No, I’m more than happy just being able to see my biological mother in my lifetime,” Rebecca said amid\nher sobs."
      },
      {
        "paragraph": "Titus, who was beside them, knitted his brows together. He then asked with a cold, deep tone, “ Which\nman told you about it? What does he look like?”"
      },
      {
        "paragraph": "Titus was tall and sturdily built."
      },
      {
        "paragraph": "Therefore, his air of authority instantly made Rebecca nervous and frightened. “I… I have no idea as\nwell. He was sitting beside me in the first class seat of a plane.”"
      }
    ]
  },
  {
    "title": "Chapter 1365 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Alright, hubby. She’s my daughter. The DNA test results can’t be wrong.” Sheryl gave Titus a nasty look."
      },
      {
        "paragraph": "Titus snorted. “ She’s had plastic surgery before. ” With his keen eyes, he realized it at first glance."
      },
      {
        "paragraph": "He hated women who had undergone plastic surgery as they were inauthentic and stiff."
      },
      {
        "paragraph": "Rebecca’s face was not even half as natural as Sheryl’s."
      },
      {
        "paragraph": "Considering that Titus had taken an instant liking to Sheryl back then, he should not be averse to her\ndaughter. For some reason, however, he subconsciously felt that Rebecca lacked the aura Sheryl had\nwhen she was young even though they bore a passing resemblance."
      },
      {
        "paragraph": "Rebecca’s expression stiffened. “I didn’t mean to have plastic surgery. I offended some powerhouses in\nAustralia a couple of years ago, so I had no choice but to have plastic surgery and leave. This is an old\nphoto of me.”"
      },
      {
        "paragraph": "She turned on her phone and searched for an old photo before handing it to them."
      },
      {
        "paragraph": "Luckily, she looked more like Jeffery. Her past appearance bore a slight resemblance to both Catherine\nand Sheryl."
      },
      {
        "paragraph": "Sheryl took a look at the photo and glanced at her afterward. There was not the slightest doubt in\nSheryl’s mind about it anymore, especially after she caught sight of Jeffery in the photo. Although"
      },
      {
        "paragraph": "Jeffery looked old, she could tell from his face that he was quite like herself. “ Is this my elder brother?”"
      },
      {
        "paragraph": "“Mm. ” Rebecca nodded. “Uncle is quite nice. Even during those ten years or so when I was kidnapped\n“You were kidnapped?” Sheryl widened her eyes."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Yeah. When I was playing with Uncle and the rest at the age of four or five, I ran around and got\nkidnapped. I stayed in the countryside after that,” Rebecca told half-truths, “Uncle and Granny didn’t give\nup searching for me and they finally found me several years back. They even pulled some strings and\nsent me to college.”"
      },
      {
        "paragraph": "“It’s all my doing.” Sheryl was heartbroken."
      },
      {
        "paragraph": "All of a sudden, Titus asked brutally, “Who were"
      },
      {
        "paragraph": "you trying to avoid that you had to undergo plastic surgery? How did you offend those powerhouses?”"
      },
      {
        "paragraph": "Rebecca opened her mouth and said, “The Jones family is a bit complicated. I have a cousin who’s m y\nuncle’s daughter. She’s very pretty, and many say that she looks like my aunt. She also bears a slight\nresemblance to Mom. Ever since I returned, Granny and Uncle have been treating me very well and\ntrying their best to make it up to me. My cousin, whom they had been pampering earlier, was probably\njealous and kept finding faults with me."
      },
      {
        "paragraph": "Later… because her childhood sweetheart fell in love with me, our relationship turned sour.”"
      },
      {
        "paragraph": "Upon hearing it, Sheryl took an immediate dislike to her so-called niece. She said with a scoff, “Mutual\nlove is needed in relationships. Since her childhood sweetheart doesn’t like her even though they grew\nup together, what gives her the right to hold a"
      },
      {
        "paragraph": "grudge against you? This shows that her character is horrible.”"
      },
      {
        "paragraph": "Rebecca was inwardly delighted to hear Sheryl say that. Nevertheless, she expressed a sorrowful look. “\nSoon after my relationship with Ethan was confirmed, she did everything possible to be involved with the\nthen wealthiest man in Australia, Shaun Hill. She wanted to take revenge on us.”"
      },
      {
        "paragraph": "“ Shaun Hill?” Titus frowned. “I’ve heard someone mention this name before. Incidentally, he seems to be\none of the top lawyers in the world.”"
      },
      {
        "paragraph": "“He’s not only the top lawyer in Australia but also the wealthiest man in Australia.”"
      },
      {
        "paragraph": "Rebecca added, “My cousin seduced Shaun and caused trouble for the Jones family. By the way, you\nused to develop a company called Hudson. Granny initially planned to let me take over Hudson, but my\ncousin pretended to be your daughter with Shaun’s help and took over the company. When Granny\nwanted to expose her, she even… went as far as pushing Granny down the stairs in the house when\nGranny was sick. She even got Shaun to dispute a lawsuit for her. We couldn’t beat Shaun.”"
      }
    ]
  },
  {
    "title": "Chapter 1366 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Initially, she planned to push the blame for Granny’s death to me, but Uncle and Aunt took responsibility\nfor it in order to save me. I spent several nights escaping Melbourne and secretly left Australia after that.”"
      },
      {
        "paragraph": "“What?” Sheryl’s expression changed drastically."
      },
      {
        "paragraph": "One owed a great debt of gratitude to their mothers for bringing them to this world. At the thought that\nher mother was killed, Sheryl wished she could cut her so-called niece into pieces."
      },
      {
        "paragraph": "“How cruel! ” Matthew was so infuriated that he began to criticize as well, “She killed her biological\nparents and grandmother? Why does such a cruel woman exist?”"
      },
      {
        "paragraph": "“ I reckon she was jealous. When I got engaged to Ethan, Uncle and Aunt didn’t object to it. Instead, they\nshowed us their support. Besides, Uncle and Granny, who took pity on me for being kidnapped back\nthen, went all out to make it up to me. My cousin wasn’t happy about it. She thought that I snatched\neverything from her ever since I returned."
      },
      {
        "paragraph": "At the same time, she hated Uncle and Aunt. After all, she had been pampered since young.”"
      },
      {
        "paragraph": "After grumbling about it, Rebecca noticed the furious look on Sheryl’s face. She held her hand. “ Mom, I\nbelieve what goes around comes around. I heard Shaun has been a shadow of his former self recently.\nHe’s no longer the wealthiest man in Australia, and Hill Corporation is currently dead in the water. As for\nmy cousin, she married Shaun afterward but he soon fell for someone else and dumped her. This could\nbe karma.”"
      },
      {
        "paragraph": "“Karma?” Sheryl smirked indifferently. “How is that enough? I didn’t know about them back then, but now\nI know. I won’t let these people off the hook.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“By the way, where’s your dad?” Matthew finally raised a question that Sheryl had been wanting to ask.\nHowever, she dared not ask because of Titus’ presence."
      },
      {
        "paragraph": "As expected, Titus’ face turned grim within seconds. He glowered at his son so hard that he wished he\ncould eat him up."
      },
      {
        "paragraph": "Matthew touched his nose, thinking that his father was truly petty. Anyway, this issue had to be clarified\nsooner or later."
      },
      {
        "paragraph": "“My dad?” Rebecca sighed. “Mom, you might not know that you gave birth to me before you got\nmarried… After Dad got into a relationship with you, his family made him marry another woman. He\nhasn’t known about my existence for 20 years. ”"
      },
      {
        "paragraph": "Sheryl was utterly disappointed. “I was so blind at that time, huh?”"
      },
      {
        "paragraph": "Titus then sneered, “He’s trash. How dare he be so irresponsible toward the woman he fooled around\nwith? What a coward and a scumbag! Wifey, you had such bad taste before this.”"
      },
      {
        "paragraph": "Sheryl indeed felt humiliated, yet she could not deny the truth."
      },
      {
        "paragraph": "Rebecca laughed. “Karma struck again recently. The media suddenly revealed that his wife cuckolded\nhim plenty of times and even gave birth to a daughter who belonged to someone else. But the most\nshameful thing was that the man whom his wife had an affair with was my dad’s biological brother. It\nmeans that the daughter is now my dad’s niece.”"
      },
      {
        "paragraph": "“That’s really confusing. ” Sheryl subconsciously knitted her brows together. Apparently, her ex- boyfriend\nwas not just scummy but also silly. This was the kind of man who disgusted her the most."
      },
      {
        "paragraph": "“After that, my cousin impersonated me and acknowledged my dad.” Rebecca shrugged. “She did that\nbecause my dad’s family is the wealthy Yule family in Australia. But in recent years, the Yule family has\nbeen doing badly. Yule Corporation has changed hands. As such, my cousin failed to take advantage of"
      },
      {
        "paragraph": "anything. I don’t feel like acknowledging my dad, so I’m not bothered about him. Anyway, I hate him and\nwill never forgive him.”"
      },
      {
        "paragraph": "“He doesn’t deserve your forgiveness.”"
      },
      {
        "paragraph": "Sheryl held Rebecca’s hands. “You have me as your mom now and that’s more than enough. Just stay\nhere from now on. Let me introduce you to them. This is your brother, Matthew Costner. This is your\nuncle, who’s also my current husband.”"
      },
      {
        "paragraph": "Titus nodded impassively, whereas Matthew flashed Rebecca a smile. “Don’t worry, Sis. I’ll protect you in\nthe future. Let me know if anyone bullies you. As for your cousin…”"
      },
      {
        "paragraph": "His eyes narrowed grimly. “Mom, we can ignore the other problems but she killed our Granny and even\ntortured Sis so badly. We definitely can’t let her off the hook, Shaun too.”"
      },
      {
        "paragraph": "“Yeah. I’ll let you settle it.” Sheryl asked Rebecca,“"
      },
      {
        "paragraph": "What’s your cousin’s name?”"
      },
      {
        "paragraph": "“Catherine Jones,” Rebecca immediately answered. “Catherine Jones.”"
      },
      {
        "paragraph": "Sheryl was stunned as she muttered this name. It was a nice name, which gave her an inexplicable\nsense of familiarity."
      }
    ]
  },

  {
    "title": "Chapter 1367 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Mom…” When Rebecca noticed that Sheryl was zoning out, she quickly called out to her for fear that\nSheryl would recall something."
      },
      {
        "paragraph": "Sheryl came back to her senses and said apologetically, “Matthew, I’ll leave Catherine to you to deal\nwith. She must pay back for what she has done to my daughter.”"
      },
      {
        "paragraph": "“No problem, Mom. I’ll head to Australia with some people tomorrow, ” Matthew promptly said, “\nCoincidentally, I’ve been sick of staying in Neah Bay every day.”"
      },
      {
        "paragraph": "“Take your time. Now that I know where my hometown is, I’ll definitely go back and pay my respects to\nmy parents, ” Sheryl said sorrowfully, “As for my brother, I have to find a way to find him. When the time\ncomes, we’ll head there together. You can bring Rebecca around to familiarize her with Neah Bay during\nthis period.”"
      },
      {
        "paragraph": "“Alright then.” Matthew obeyed his mother’s order reluctantly."
      },
      {
        "paragraph": "Meanwhile, Rebecca was inwardly elated. With the Costner family and Sheryl’s help, she would certainly\nbe able to deal with Catherine and Shaun. It would be as easy as squashing an ant."
      },
      {
        "paragraph": "‘Catherine Jones, Shaun Hill, just wait.’"
      },
      {
        "paragraph": "Rebecca was going to make a comeback in no time and settle the old scores with them one by one."
      },
      {
        "paragraph": "‘Also, Catherine, I’m sure it’ll be interesting to be tortured by your biological mother and brother.’"
      },
      {
        "paragraph": "Hehe. As for herself, she would soon become the successor of Soromon Island. Haha."
      },
      {
        "paragraph": "“By the way, do you know my name from back then?” Sheryl asked."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Mom, your name is Sheryl Jones,” Rebecca finally said something that was true."
      },
      {
        "paragraph": "“Sheryl Jones,” Sheryl mumbled the name. She knew that her name was Sheryl but did not know her last\nname. The name Sheryl Jones sounded familiar to her. “Hubby, Matt, my name will be Sheryl Jones from\nnow on.”"
      },
      {
        "paragraph": "“Wifey, it’s up to you as long as you’re happy with it. ” Titus’ sharp eagle-like gaze swept over Rebecca."
      },
      {
        "paragraph": "Although Rebecca had not slipped up when she was explaining everything earlier, Titus just disliked this\nstepdaughter for no apparent reason."
      },
      {
        "paragraph": "It was not because Rebecca was not his daughter."
      },
      {
        "paragraph": "As much as he was narrow-minded, he would still fulfill his promises to his wife. However, he was\nsubconsciously resistant to the sudden appearance of this stepdaughter."
      },
      {
        "paragraph": "Australia."
      },
      {
        "paragraph": "In the office of Jackson Corporation."
      },
      {
        "paragraph": "At this moment, a few senior shareholders were telling Patrick off."
      },
      {
        "paragraph": "“Patrick, what on earth is going on? Why have the media been reporting that our cookies have\nacrylamide that can lead to cancer? It’s true that our cookies have acrylamide, but the levels of\nacrylamide are so low that it won’t cause cancer at all. Now that people are magnifying the issue, it’s\nobvious that someone is wilfully finding fault with our company.”"
      },
      {
        "paragraph": "“This cookie is our company’s bestseller, yet the supervision department has now suspended our\nproduction. They’re trying to make us lose our livelihood.”"
      },
      {
        "paragraph": "“Other food companies use this chemical in their products too. What gives them the right to find fault with\nus?”"
      }
    ]
  },
  {
    "title": "Chapter 1368 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Patrick, did you offend someone out there? This person seems to be quite powerful, considering that\nthey managed to do this. Why don’t… you look for Miss Lynch? She’s the goddaughter of the future\nprime minister now. It should be easy to ask her for help.”"
      },
      {
        "paragraph": "“Yeah. After all, you were in a relationship with Miss Lynch for a couple of years. She’ll take your history\ninto consideration.”"
      },
      {
        "paragraph": "The shareholders made these remarks straightforwardly in front of Linda."
      },
      {
        "paragraph": "Linda’s body swayed a little, and her face paled."
      },
      {
        "paragraph": "Patrick’s face turned ghastly. Even so, he could not expose that it was Freya’s doing."
      },
      {
        "paragraph": "He never thought that Freya would end up going so far."
      },
      {
        "paragraph": "After all, they used to be in love with each other. How could she be so cruel?"
      },
      {
        "paragraph": "He regretted approaching her of his own accord that night and giving her his business card."
      },
      {
        "paragraph": "However, he could not expose it to the company’s shareholders as they would be more unhappy with\nhim and Linda."
      },
      {
        "paragraph": "“Enough. Just drop it. I’ve already broken up with Freya for years and we no longer talk to each other. I’ll\nfind a way to settle this issue,” Patrick forced his mouth open and said with a deep voice."
      },
      {
        "paragraph": "“That’s true.” One of the shareholders threw Linda a glance. “Miss Lynch came to the office and\nquarreled with some of our people previously."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Perhaps she’s still holding a grudge against you. ”"
      },
      {
        "paragraph": "At the mention of this issue, all the shareholders were unhappy with Patrick."
      },
      {
        "paragraph": "At first, everyone thought that Freya was the one who behaved arrogantly and unreasonably when she\nfought with Linda back then. Later, when Patrick got into a relationship with Linda, many employees\nsecretly discussed it and thought that Linda deserved to be beaten up. They believed that what made\nFreya’s blood boil was the fact that Patrick had long since been involved with Linda."
      },
      {
        "paragraph": "Linda bit her lip and lowered her head."
      },
      {
        "paragraph": "Patrick shot a glance at her, his eyes flashing with guilt. He leaped to his feet and said, “Let’s dismiss. I’m\ngoing to have lunch with the supervision"
      },
      {
        "paragraph": "department later. I’ll try my best to settle the issue.”"
      },
      {
        "paragraph": "“Even if you settle it, our company’s reputation is still ruined. The food industry is different from others.\nPeople won’t forget about it just because the incident is over. It takes several years of PR to save our\nreputation.”"
      },
      {
        "paragraph": "All the shareholders grumbled before they walked away."
      },
      {
        "paragraph": "Patrick clenched his fists. Only after Linda closed the door did she turn around and say guiltily, “The\nshareholders are right. If Freya…”"
      },
      {
        "paragraph": "“Don’t mention her anymore, ” Patrick said frostily, “This was her doing.”"
      },
      {
        "paragraph": "“Huh?” Linda pursed her lips and asked with surprise, “Why did she do that? Is it because she still hates\nyou?”"
      },
      {
        "paragraph": "“Yeah.” Patrick furrowed his brows deeply, his eyes glinting with fury and misery. “I really don’t\nunderstand when she started acting so cruelly. Or has she always been like this? After gaining her\ncurrent status, she has learned to bully people.”"
      },
      {
        "paragraph": "“It’s my fault.” Linda was filled with annoyance and guilt. “If I had known this would happen, I wouldn’t\nhave contacted you whenever something happened to me back then. Also, I wouldn’t have gotten\ntogether with you. Patrick, why don’t… we… break up now?”"
      },
      {
        "paragraph": "Linda said sorrowfully as tears slid down her face. “ I’m sure Freya can’t get over you, that’s why she still\nhates you. She might agree to be with you again if you pursue her. What’s more, she’s currently the\ngoddaughter of the future prime minister. If you marry her, she’ll be a real help to your future, unlike me. I\ncan’t do anything else except some secretarial work and household chores.”"
      },
      {
        "paragraph": "When Patrick heard those words at the end of her sentence, he was suddenly reminded of her selfless\ndedication in the past three years. With that, he felt even guiltier deep down. “Linda, don’t say things like\nthese. Secretarial work can be quite tiring at times. What’s more, it’s good enough that you can cook and\ndo the cleaning for me even though you’re worn out. Freya never did these back then, so you’re much\nbetter than her.”"
      },
      {
        "paragraph": "“But…”"
      },
      {
        "paragraph": "“Just drop it. I’m not a social climber. Considering that you’ve sacrificed so much for me, I won’t dump\nyou just because of the company,” Patrick interrupted her, “Go and rest. I really need to meet the\nsupervision department now.”"
      },
      {
        "paragraph": "”Let me accompany you, ” Linda promptly said."
      }
    ]
  },
  {
    "title": "Chapter 1369 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“No need.” Patrick shook his head and rejected Linda’s offer."
      },
      {
        "paragraph": "At noon, Patrick had lunch with the supervision department and offered them some benefits. Only then\ndid he find out that Rodney was the mastermind behind the incident."
      },
      {
        "paragraph": "He immediately drove to Osher Corporation."
      },
      {
        "paragraph": "Rodney did not allow Patrick to come up and made him wait two hours downstairs."
      },
      {
        "paragraph": "After two hours, Patrick knocked on the door and entered Rodney’s office. In the spacious office, he saw\nRodney leaning on the leather chair with his legs lazily placed on the desk. Rodney was throwing the\ndarts in his hand onto the wall."
      },
      {
        "paragraph": "Obviously, he was not skillful as the darts did not hit the red bullseye."
      },
      {
        "paragraph": "“F*ck. How unlucky,” Rodney cursed."
      },
      {
        "paragraph": "The assistant then reminded, “President Snow, Patrick is here.”"
      },
      {
        "paragraph": "Only then did Rodney lift his eyes and turn his gaze to Patrick, who was wearing a blue shirt and a pair\nof black pants. He had to admit that Patrick had a decent appearance. Although he was far more\nattractive than Patrick, Patrick was considered good-looking compared to others."
      },
      {
        "paragraph": "He had seen Patrick before. Three years or so ago, Patrick had pestered Freya at the entrance of\nHudson Corporation. In the end, Rodney acted as Freya’s shield and drove him away."
      },
      {
        "paragraph": "“What’s the matter?” Rodney lazily opened his mouth."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "From the haughtiness and laziness in his gaze, Patrick could tell that it was because Patrick was born\ninto the prestigious Snow family."
      },
      {
        "paragraph": "As Jason said earlier, Rodney looked at people with his nose in the air. He gave the impression that he\ntreated others with utter disdain."
      },
      {
        "paragraph": "His attitude left Patrick feeling humiliated. However, he had no choice but to endure it and say, “President\nSnow, I just want to find out in what way Jackson Corporation has offended you.”"
      },
      {
        "paragraph": "“I dislike you simply because you look ugly, ” Rodney teased."
      },
      {
        "paragraph": "“President Snow… ” Patrick clenched his fists until they cracked."
      },
      {
        "paragraph": "“You want to fight, huh?” Rodney put down his long legs. Although he could not beat up Shaun and\nChester, that did not mean that he could not beat up others."
      },
      {
        "paragraph": "“President Snow, I don’t like to solve problems with fists, ” Patrick said as he tried his best to cool “From\nyour tone, you seem to be implying that I like to solve problems with my fists, huh?” Rodney’s exquisite\nface became grim."
      },
      {
        "paragraph": "Patrick was at a loss for words."
      },
      {
        "paragraph": "Rodney was completely different from what the rumors described him. He was the young master of the\nSnow family, yet he behaved like a rogue."
      },
      {
        "paragraph": "“President Snow, if I’ve offended you in any way, I’d like to apologize to you,” Patrick said seriously,\n“Jackson Corporation and Osher Corporation are in two different lines of business. One deals with food\nproducts, while the other deals with cosmetics products. I don’t see why we have to be enemies.\nPerhaps there’s a misunderstanding…”"
      },
      {
        "paragraph": "“There’s no misunderstanding. It’s merely because you’ re annoying, and someone wants me to deal\nwith you.” Rodney raised his brows and laughed. “ Indeed, you’re… good at acting. From your decent\nappearance alone, I wouldn’t be able to tell that you’re a scumbag.”"
      },
      {
        "paragraph": "“Is it Freya?”"
      },
      {
        "paragraph": "Patrick jerked. He remembered that Rodney disliked Freya, so why was he helping her now?"
      }
    ]
  },
  {
    "title": "Chapter 1370 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Rodney kept quiet."
      },
      {
        "paragraph": "His silence signified acknowledgment."
      },
      {
        "paragraph": "After being struck by the thought, Patrick still did not understand how Freya made this request to\nRodney. “Young Master Snow, aren’t you… into Sarah?”"
      },
      {
        "paragraph": "Since Rodney was fond of Sarah, why was he helping Freya and turning against him?"
      },
      {
        "paragraph": "All Patrick wanted was to clarify the issue, yet he was unaware that his question had hit a nerve in\nRodney, causing him to feel infuriated and ashamed."
      },
      {
        "paragraph": "Indeed, everyone knew that Rodney was fond of Sarah, but that woman cuckolded him."
      },
      {
        "paragraph": "“Who I like is none of your damn business.” Rodney’s expression was grim."
      },
      {
        "paragraph": "A surge of emotions overwhelmed Patrick deep down. He could not help but say, “Young Master Snow,\nyou used to be part of the Snow family, after all. Why are you always swearing— ”"
      },
      {
        "paragraph": "“Who said those from wealthy families can’t swear?” Rodney interrupted him. His charming eyes were\nfilled with sarcasm. “You don’t swear, but you enjoy playing the field. Well, it’s better for people to speak\nharshly than act like a hoodlum, isn’t it?”"
      },
      {
        "paragraph": "“You don’t know what’s going on between Freya and me either.” Stung by his mocking words, Patrick\nbecame glum and irritated. Even so, his handsome face remained tranquil. “Young Master Snow, if you\ndon’t mind, can you let me tell you about what happened between me and Freya in the past?”"
      },
      {
        "paragraph": "Rodney took the glass from the table and sipped on the water. He did not interrupt Patrick or reject him."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Patrick’s eyes flashed with bitterness. “Freya and I were college mates. I was her senior, and she was\nthe one who pursued me. She was enthusiastic, generous, and pretty. Initially, I had never thought of\ngetting into a relationship, but I was gradually attracted to her. We then got together. After graduating, I\ntook over my family’s company and was preoccupied with it. At that time, Freya wasn’t interested in her\ncareer and her life revolved around me. It wasn’t too bad at first. But later on, I often had to work late\nnights, so she was unhappy that I couldn’t accompany her."
      },
      {
        "paragraph": "“Linda and I had grown up together when we were young, so she was like a sister to me. Our families\nshare a good relationship too. After she graduated, the Shelby family got her to work in Jackson\nCorporation to gain exposure, but I wasn’t interested in her. If I were, I wouldn’t have gotten together with\nFreya. Even so, Freya always misunderstood us, thinking that I behaved flirtatiously with Linda. We\nargued time and again, and the remarks she made would always be worse than before."
      },
      {
        "paragraph": "“I tried my best to put up with Freya because I loved her. We were planning to get married and I was\neven supposed to meet up with her parents to discuss our marriage. But Linda was involved in an\naccident that day. Moreover, her parents had gone on vacation. Because of this matter, Freya broke up\nwith me."
      },
      {
        "paragraph": "“At first, I thought she wasn’t serious about the break-up. Who knew she suddenly came to Canberra for\nwork. I looked for her and begged her, but she wouldn’t forgive me. At that time… she even dragged you\nin to provoke me.”"
      },
      {
        "paragraph": "Feeling helpless, Patrick continued, “I gave up on her. Shortly after I returned to Melbourne, she followed\nsuit. She came to my office and beat up Linda like a madwoman. That was unscrupulous and\nunreasonable of her. We were no longer in touch since then."
      },
      {
        "paragraph": "“I thought our relationship was over. But I bumped into her when I had a meal by the seaside a few days\nago. I kindly sent her home, yet she wanted me to break up with Linda or she’d deal with Jackson\nCorporation. I thought she was kidding when she said that, but she actually coaxed you into doing it.”"
      },
      {
        "paragraph": "After Jackson finished speaking, he looked at Rodney and added weakly, “Young Master Snow, I hope\nyou’ll advise Freya. We can’t possibly get back together anymore, and I hope she’ll stop turning against\nLinda. Considering that Linda has sacrificed so much for me, I won’t break up with her or hurt her.”"
      },
      {
        "paragraph": "Rodney crossed his arms."
      },
      {
        "paragraph": "He looked Patrick up and down seriously."
      },
      {
        "paragraph": "Chester had always made fun of Rodney due to his low emotional intelligence and stupidity."
      },
      {
        "paragraph": "Nevertheless, it did not mean that he was actually a fool."
      },
      {
        "paragraph": "“Why am I hearing you grumble about Freya’s shortcomings? If she’s so terrible, why did you decide to\nbe with her in the first place? Why did you fall for her?”"
      },
      {
        "paragraph": "Rodney suddenly asked while raising his brows."
      }
    ]
  },
  {
    "title": "Chapter 1371 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Patrick was stunned. “Actually, aside from the matter with Linda, Freya is fine…”"
      },
      {
        "paragraph": "Rodney scoffed. “You gave a long-winded explanation about how innocent you and Linda are, claiming\nthat Linda has sacrificed a lot for you. Isn’t it safe to say that Linda has feelings for you? You kept\nsomeone who likes you by your side, but you didn’t allow your girlfriend to grumble about it. Did you think\nFreya was a saint?"
      },
      {
        "paragraph": "Patrick’s mouth hung open."
      },
      {
        "paragraph": "Rodney directly rose to his feet. “When you were about to meet Freya’s parents, you immediately\nabandoned her to look for the woman who likes you just because she was met with an accident. Why\ndidn’t you call Freya to explain it or bring her along?”"
      },
      {
        "paragraph": "Patrick’s handsome face paled little by little."
      },
      {
        "paragraph": "Rodney snorted. “You were so busy with work that you didn’t have time to accompany her. All she did\nwas grumble about it, she didn’t even initiate a break-up. Instead of being content, you kept finding fault\nwith her. Have you ever thought that she had also made sacrifices for you? Considering that she chose\nto stay by your side instead of chasing after her dreams.”"
      },
      {
        "paragraph": "The more Rodney spoke, the more furious he became. “Don’t make yourself sound like a noble person.\nThe Lynch family’s business is impressive, and it has far surpassed Jackson Corporation over the last\nfew years. You’re nothing."
      },
      {
        "paragraph": "“Furthermore, Freya was invited to work with us in Osher five years ago but she rejected it. Do you know\nwhy she rejected it? It was all because of you. All because of love."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“If you weren’t involved with that childhood sweetheart of yours, why did you get together with her so\nsoon after? At the end of the day, you’re just a f*cking hypocrite."
      },
      {
        "paragraph": "“You think that Freya taught Linda a lesson because she still has feelings for you, huh? Someone like\nyou is far from worthy of her."
      },
      {
        "paragraph": "“Well, you should be fortunate that I’m the one who’s dealing with you this time. If it had been for\nsomeone else, Jackson Corporation would’ve already collapsed. After all, there are a lot of people who\ndislike Linda. You should f*cking blame yourself for being blind as you found a troublemaker to be your\ngirlfriend. Get lost!”"
      },
      {
        "paragraph": "Indeed, Rodney had erupted with rage."
      },
      {
        "paragraph": "He just could not grasp why a scummy person like Patrick could win Freya’s love and make her his\ngirlfriend back then. After all, Freya was a young cosmetic chemist with the highest potential."
      },
      {
        "paragraph": "All the top cosmetic companies had been going all out to get Freya to join them."
      },
      {
        "paragraph": "He really had no idea what gave Patrick such a sense of superiority."
      },
      {
        "paragraph": "His criticisms made Patrick’s mind go blank. After a while, he asked, “What do you mean? What has\nLinda done? Also, who has she offended?”"
      },
      {
        "paragraph": "“Don’t you get what I mean? Get out! Talking to you makes my blood boil,” Rodney criticized."
      },
      {
        "paragraph": "“Young Master Snow, don’t go too far. ” Patrick had never suffered such humiliation. “You’re no longer\npart of the Snow family.”"
      },
      {
        "paragraph": "“Even if I’m not part of the Snows, I still have the ability to torture you, ” Rodney sneered."
      },
      {
        "paragraph": "Clenching his fists, Patrick turned around and left the office. The moment he opened the door, he saw\nFreya. Her hair was tied into a bun, and the prominent features on her pretty face made her seem like\nshe was mixed-blood."
      }
    ]
  },
  {
    "title": "Chapter 1372 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "At that moment, Freya’s pretty eyes were filled with sarcasm as she looked at Patrick."
      },
      {
        "paragraph": "“Freya…” Patrick went absent-minded for a moment. “Why are you here?”"
      },
      {
        "paragraph": "“ If I hadn’t come here, I wouldn’t have gotten to listen to you talking about our past. I could hear that you\nfelt wronged many times when you dated me. It must’ve been difficult and hard for you to put up with\nme.” Freya chuckled and mocked him."
      },
      {
        "paragraph": "Patrick felt strangely ashamed."
      },
      {
        "paragraph": "He recalled Rodney’s words from just now. His recount had only consisted of Freya’s shortcomings."
      },
      {
        "paragraph": "Actually, there were times when she was good too…"
      },
      {
        "paragraph": "However, it was not the time to talk about those things."
      },
      {
        "paragraph": "“Freya, can’t we just separate peacefully?” Patrick said in agony, “You have a high status now. Linda\nwon’t be able to harm you at all. Let bygones be bygones.”"
      },
      {
        "paragraph": "“Of course, the matters between us can be bygones. However, Linda owes me a life. That can never be\nforgotten.” Freya looked at Patrick coldly. “You’d better let go of that woman quickly. If not, I won’t mind\nburying the Jackson family’s future along with her.”"
      },
      {
        "paragraph": "Patrick’s body jolted. He could see strong, haughty coldness on Freya’s face."
      },
      {
        "paragraph": "She had never looked like this before. In her eyes, he seemed to just be an ant."
      },
      {
        "paragraph": "That feeling made Patrick discontented, angry, and humiliated."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Aren’t you leaving? Must I call the guards to chase you away?” Rodney walked over while smiling and\nraising his eyebrows."
      },
      {
        "paragraph": "Patrick clenched his fists. He left without turning his head back."
      },
      {
        "paragraph": "“When did you come? Why are you here?”"
      },
      {
        "paragraph": "After Patrick left, Rodney became nervous. He did not expect Freya to come and look for him first. It was\nas if the sun had risen from the west."
      },
      {
        "paragraph": "“The company still owes me a balance payment of five million dollars for the formulation last time"
      },
      {
        "paragraph": "which they said will be paid this month. I need your signature.” Freya gave him the document."
      },
      {
        "paragraph": "“Oh, okay. I thought you especially came to thank me because I helped you to teach those people a\nlesson…”"
      },
      {
        "paragraph": "Rodney took the document and put down his signature with a pen."
      },
      {
        "paragraph": "“You caused me to be in this state, yet you still want me to thank you?” Freya hmphed."
      },
      {
        "paragraph": "“Alright, are you satisfied this time? You said that… as long as I deal with the Jackson family, some of the\ngrudges between us can be resolved. ” Rodney looked at her awkwardly. “I did my best. Jackson\nCorporation’s reputation has hit rock bottom. As long as the supervision department keeps halting\nJackson Corporation’s most profitable products from being manufactured, Jackson Corporation will face\na cash flow crisis soon.”"
      },
      {
        "paragraph": "Freya lifted her eyelashes. She raised her head and glanced at him."
      },
      {
        "paragraph": "Rodney had always given her the impression that he had low EQ. He seemed to have a problem with his\nbrain and was easily tricked by women."
      },
      {
        "paragraph": "However, she had heard how Rodney scolded Patrick just now from outside. His words were right"
      },
      {
        "paragraph": "on point and satisfying to hear."
      },
      {
        "paragraph": "She never expected he would say those words. “You… Why are you looking at me like that?”"
      },
      {
        "paragraph": "Freya’s dark eyes were large and bright. Rodney felt nervous from her gaze for the first time."
      },
      {
        "paragraph": "“How rare.” Freya suddenly smiled and said, “Actually, now that you’re not dating Sarah anymore, there\naren’t as many holes in your brain.” Rodney shot her an angry stare."
      },
      {
        "paragraph": "Freya blinked her eyes charmingly. “Why are you glaring at me? My status is higher than yours now. I\ncan torture you.”"
      },
      {
        "paragraph": "Were those not the words Rodney had said to Patrick just now?"
      }
    ]
  },
  {
    "title": "Chapter 1373 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Forget it. Since you helped me this time, I’ll treat you to a meal,” Freya suddenly said, “There’s a\nMexican restaurant that’s quite good downstairs. I’ll treat you to that.”"
      },
      {
        "paragraph": "Rodney was taken aback. He was surprised. “O-Okay.”"
      },
      {
        "paragraph": "It was about time to get off work too."
      },
      {
        "paragraph": "Rodney immediately closed his computer and followed her downstairs."
      },
      {
        "paragraph": "The Mexican restaurant was just at the adjacent building. Freya ordered a serving of quesadillas,\nguacamole, nachos, and some other dishes."
      },
      {
        "paragraph": "Rodney glanced at the menu. He could not resist saying, “This place is a little too cheap, I…”"
      },
      {
        "paragraph": "“What? Are you expecting me to treat you to expensive food?” Freya blinked her eyes. “You’re not worth\nme spending more than 500 dollars.”"
      },
      {
        "paragraph": "Rodney was speechless. “No, I can treat you. I don’t have the habit of letting women pay the bill.”"
      },
      {
        "paragraph": "“No, I already said I’m treating you.” Freya shook her head."
      },
      {
        "paragraph": "“Then I’ll treat you to a meal next time, ” Rodney said hurriedly. There was a word for that. It was to\nreciprocate."
      },
      {
        "paragraph": "Freya glanced at him with a vague smile. “Rodney, don’t take me as a stepping stone to enter the Snow\nfamily. I’ll go to the Snow family and discuss it with your grandpa for them to agree to let you return to the\nSnow family. I have the baby of the Snow family in my stomach. They’ll surely follow my wishes. ”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Rodney was stunned. Obviously, he did not expect that she would be so kind. “Why are you helping me?\nActually, my grandpa asked me to marry you so that I can marry into the Snow family. That’s because\nthey hope the child can have a complete family…”"
      },
      {
        "paragraph": "“If the child’s parents don’t love each other but force themselves to be together, the child won’t have a\ncomplete family either.” Freya shook her head."
      },
      {
        "paragraph": "“Don’t you hate me? You even cried last time, and you were quite agitated…” Rodney said reluctantly,"
      },
      {
        "paragraph": "“ I can sense that you don’t like your current life. ”"
      },
      {
        "paragraph": "“ I have no choice. The doctor said I might not be able to get pregnant again if I abort this child."
      },
      {
        "paragraph": "Moreover, it’s already been a full three months. It’s impossible to abort it now. This is my fate.”"
      },
      {
        "paragraph": "Freya said regretfully, “The things in the past can’t be changed, but the future is in my own hands. I don’t\nwant other people to manipulate my fate.”"
      },
      {
        "paragraph": "“I’m sorry…” Rodney gazed at her in a daze. Actually, he thought Freya was quite pitiful too."
      },
      {
        "paragraph": "Especially after meeting Patrick, he felt that Freya was not any better than him in terms of relationships."
      },
      {
        "paragraph": "“Actually, your parents also hope that you can return to the Snow family. Whenever I’m with Aunty\nWendy, she looks quite sad when she mentions you. She might say that she has gotten over it and\ndoesn’t care about it anymore, but she can’t deceive me.”"
      },
      {
        "paragraph": "Freya said, “To be honest, I hate you. However, I understand your love for Sarah. You can’t control who\nyou fall in love with. I just hope you can be more alert in the future and think more about your family who\nloves you. Don’t hurt them again because of your selfishness. You can love someone,"
      },
      {
        "paragraph": "but it shouldn’t hurt others.”"
      },
      {
        "paragraph": "These days, maybe it was because she had been triggered by Patrick, Freya had the time to think things\nthrough."
      },
      {
        "paragraph": "It was pointless for her to keep hating Rodney."
      },
      {
        "paragraph": "Looking back at herself, had she not kept clinging to Patrick, that unworthy guy, for so many years as\nwell?"
      },
      {
        "paragraph": "The most pathetic thing was that Patrick only remembered her shortcomings even though she had done\nso much."
      },
      {
        "paragraph": "Freya laughed. She lifted the cup of coffee and took a huge sip."
      },
      {
        "paragraph": "Rodney pressed his thin lips together with mixed feelings. Freya’s words surprised him."
      },
      {
        "paragraph": "It seemed like he could finally understand why the Snow family said Freya was nice."
      },
      {
        "paragraph": "She was really nice."
      },
      {
        "paragraph": "Why was he so blind back then that he abandoned the Snow family, Freya, and his child for Sarah?"
      },
      {
        "paragraph": "He even passed off Freya, a pearl, as rubbish."
      }
    ]
  },
  {
    "title": "Chapter 1374 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Freya, that night… when you suddenly cried… I thought it was because of me and Chester. Actually, it\nwas because you met Patrick, right?”"
      },
      {
        "paragraph": "Rodney suddenly said, “Hearing him say those words today, I’m guessing he said some unpleasant\nwords that night that made you lose control. You don’t have to pay him any mind. Patrick is not a good\nperson. He’s just a fool like I was in the past. He’s not worth you being sad over.”"
      },
      {
        "paragraph": "“I wasn’t sad because of him. I stopped loving him a long time ago. I was just… discontent. I worked hard\nand gave my everything, yet in the end, it still wasn’t good enough for him.”"
      },
      {
        "paragraph": "“I understand. It’s just like how I treated Sarah. In the end, she treated me as a backup—an idiotic\nperson and a fool. In fact, she utterly looks down on me. I can’t understand which part of me made her\nlook down on me. I graduated from a renowned university. The company that I established…”"
      },
      {
        "paragraph": "Rodney paused. He suddenly said, “Why don’t I order some wine? You can drink water. It’s not fun just\nsitting and chatting.” “… Suit yourself.”"
      },
      {
        "paragraph": "Freya hesitated and said."
      },
      {
        "paragraph": "Frankly speaking, if she were not pregnant, she would want to order two bottles of wine too."
      },
      {
        "paragraph": "After that, Rodney had the waiter bring two bottles of wine over."
      },
      {
        "paragraph": "However, Rodney could not hold his liquor. He was drunk after a meal."
      },
      {
        "paragraph": "He drank too much. In the end, he hugged the bottle and vented drunkenly, “Actually… I know that\nShaun, Chester, and you are mocking me because… I… I’m stupid. I think I’m very stupid too, a"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "complete idiot. Just for a woman… You don’t even know… She said I’m useless and I can’t compare to\nShaun… And Chester…. Even the Snow family doesn’t want me… I’m worthless…"
      },
      {
        "paragraph": "“I saw her… making out with that… President Yard with my own eyes… I caught her red-handed… But\nshe didn’t panic, and she even… blamed me instead…"
      },
      {
        "paragraph": "“I don’t understand… What did I do wrong? Even if she didn’t love me… For more than ten years… I\ncomplied with her demands. I put her… in my heart."
      },
      {
        "paragraph": "Did I f*cking do that… for her to humiliate me in the end?”"
      },
      {
        "paragraph": "Initially, Freya felt annoyed when she listened to him. Afterward, she saw his eyes redden. Toward the\nend, she did not know whether Rodney was foolish or pitiful."
      },
      {
        "paragraph": "Actually, she and Rodney had gone through similar situations."
      },
      {
        "paragraph": "They deeply loved a person and even gave their best, yet their feelings were not reciprocated and they\nwere even trampled on in return."
      },
      {
        "paragraph": "Freya kept drinking water in silence. After they finished the meal, she gave Ryan a call."
      },
      {
        "paragraph": "Half an hour later, Ryan arrived. He was speechless when he saw Rodney, who was utterly drunk. “It’s\njust dinnertime and he’s already this drunk?”"
      },
      {
        "paragraph": "“Maybe he’s in a bad mood. Send him back. ” Freya had kept listening to Rodney as he talked about the\nfact that they only slept together once. Her scalp had gone numb. She regretted treating him to a meal."
      },
      {
        "paragraph": "Ryan glanced at her in astonishment when he heard that. He smiled and said, “I thought you hated him."
      },
      {
        "paragraph": "Ah, should I help you throw him into the river to feed the fish and get revenge for you?”"
      },
      {
        "paragraph": "“Forget it. Hating someone requires energy too. I don’t want to hate anymore. It’s too tiring and quite\npointless as well. Moreover, I don’t want to be the Snow family’s tool.”"
      },
      {
        "paragraph": "Freya smiled and waved her hand. She turned around and took her bag, preparing to leave."
      },
      {
        "paragraph": "“Wait, I’ll give you a ride too, ” Ryan called out to her."
      },
      {
        "paragraph": "“No need. I have something else to do.” Freya left."
      },
      {
        "paragraph": "Ryan watched her from behind. His heart was filled with emotion."
      },
      {
        "paragraph": "Actually, the Snow family’s original intent was to let Freya vent her anger when Rodney pursued her.\nWhen they made up afterward, the baby in her stomach could have a father too. At the same time,\nRodney could return to the Snow family again and the Snow family could keep their pride."
      },
      {
        "paragraph": "However, nobody had asked whether Freya agreed to it or not."
      }
    ]
  },
  {
    "title": "Chapter 1375 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "However, Freya must be very clear about it too."
      },
      {
        "paragraph": "She might seem silly, but actually, she understood some things clearly."
      },
      {
        "paragraph": "A girl like her was so transparent that it strangely made people feel bad for her."
      },
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "It was already late in the morning when Rodney woke up."
      },
      {
        "paragraph": "He sat up abruptly and realized the place looked familiar. However, he could not remember where he\nwas for a while."
      },
      {
        "paragraph": "Then, Ryan walked in. “Brother Rodney, you’re awake.”"
      },
      {
        "paragraph": "Rodney was stunned for a few seconds, then he remembered. This was Ryan’s place."
      },
      {
        "paragraph": "“You finally acknowledge me.” Rodney shot Ryan an icy glare. “You didn’t answer when I called you last\ntime. I even thought you’d never acknowledge me as your cousin again.”"
      },
      {
        "paragraph": "Ryan laughed. “You know I have to obey Grandpa’s words. If Grandpa hadn’t agreed, I wouldn’t be\naddressing you as my brother either.”"
      },
      {
        "paragraph": "“Agree?”"
      },
      {
        "paragraph": "Rodney was puzzled. “Agree to what?”"
      },
      {
        "paragraph": "“Agree to let you come back to the Snow family. ”"
      },
      {
        "paragraph": "Ryan leaned on the cupboard lazily. He folded his arms across his chest."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Really?” Rodney was delighted. “I knew it. Grandpa still loves me! Everything he said before must’ve\nbeen said in a moment of anger…”"
      },
      {
        "paragraph": "“You’re overthinking,” Ryan cut him off. “It’s because Sister Freya went to the Snow family last night. She\nrequested Grandpa and your parents to let you return to the Snow family. That’s why Grandpa agreed.”"
      },
      {
        "paragraph": "Rodney’s body jolted. He remembered that he had eaten and chatted with Freya last night. His and\nFreya’s relationship had eased a little. However, he did not expect that she would personally go to the\nSnow family and request his family to let him return."
      },
      {
        "paragraph": "As he kept thinking about it, he increasingly felt"
      },
      {
        "paragraph": "that he had been too merciless in the past."
      },
      {
        "paragraph": "Frankly speaking, Freya was a person with a sharp mouth but a soft heart."
      },
      {
        "paragraph": "She was harsh and mean on the surface, and sometimes, her words were really unpleasant to hear. She\nand Rodney were like enemies, but in the end, she still helped him."
      },
      {
        "paragraph": "He lowered his gaze in a daze. He should be delighted, but his heart felt heavy from the pressure."
      },
      {
        "paragraph": "“By the way, I was having a meal with her last night “You were drunk. She called me to pick you up.”\nRyan gazed at Rodney and sighed. “Say, you got so lucky back then but you ruined it yourself. Freya is\nsuch a good woman but you didn’t know how to cherish her.”"
      },
      {
        "paragraph": "“Don’t make it sound like… she was mine from the start, ” Rodney said with complicated feelings, “ She\ndoesn’t even like me.”"
      },
      {
        "paragraph": "“You have a point there. ” Ryan touched his chin. “ Too bad your mom insisted that my dad take her in as\na goddaughter. There were a lot of ways to compensate her. Since you didn’t want to marry"
      },
      {
        "paragraph": "her, you could’ve let me do it. I don’t mind her being pregnant with a child. Ah, it’s too bad.”"
      },
      {
        "paragraph": "“What nonsense are you spewing?” Rodney was utterly speechless and shocked when he heard Ryan’s\nwords. He felt a twinge of anger too. “Are you crazy? How can two cousins use the same woman? It’ll be\na joke if it gets out, okay?”"
      },
      {
        "paragraph": "“What do you mean by ‘use’? Don’t make it sound so ugly. What happened to you and Freya was an\naccident, ” Ryan said lazily, “I don’t mind whether a woman still has her virginity or not as long as I like\nher.”"
      },
      {
        "paragraph": "“Ryan Snow, Freya is your sister in name now. Keep your dirty thoughts to yourself, ” Rodney warned\nangrily."
      }
    ]
  },
  {
    "title": "Chapter 1376 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Why are you so nervous?” Ryan smiled vaguely. “"
      },
      {
        "paragraph": "You don’t even have any feelings for her. You should be happy that there’s an excellent man who likes\nher.”"
      },
      {
        "paragraph": "Rodney went silent for a moment from being rebuked and then spoke again, “I’m just afraid that the\nSnow family will become a joke, okay?"
      },
      {
        "paragraph": "Moreover, Uncle Nathan is about to be the prime minister. Shouldn’t you, as his son, create less trouble\nfor him?”"
      },
      {
        "paragraph": "“I have no problems with my behavior, and I’m more well-behaved than you. You have no right to say\nthose words to me,” Ryan retorted. He was unconvinced."
      },
      {
        "paragraph": "Rodney let out a hmph. “Anyway, Grandpa will never agree to let you marry a pregnant woman. Your\nparents won’t allow it either. Don’t make a mess to the point you get chased out of the Snow family like\nme.”"
      },
      {
        "paragraph": "“Aren’t you coming back now after being chased out? How will you know the results without trying t o\nfight for something?” Ryan folded his arms across his chest. He looked languid."
      },
      {
        "paragraph": "“You…” Rodney gritted his teeth speechlessly. It was the first time he realized Rodney was so irritating."
      },
      {
        "paragraph": "“Let’s go back to the Snow family.” Ryan turned around elegantly."
      },
      {
        "paragraph": "After Rodney brushed his teeth and washed his face, he changed into Ryan’s clothes and went back to\nthe Snow family’s residence with him."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "He was quite nervous during the trip back. However, after he stepped in through the door, he realized\nthat everyone was not ostracizing him that much anymore. He was so touched that tears almost welled\nup in his eyes."
      },
      {
        "paragraph": "He knelt on a cushion with a loud thud. “Grandpa, I promise I won’t repeat my previous mistakes. Do you\nreally… agree to let me come back?”"
      },
      {
        "paragraph": "Old Master Snow let out a hmph. “ I didn’t want to agree at first. However, since Freya made the request\nand pleaded with me, I can only follow her wishes.”"
      },
      {
        "paragraph": "Although Ryan had told Rodney about it before, Rodney’s heart trembled once again when he heard it\nfrom his grandpa’s mouth."
      },
      {
        "paragraph": "“I won’t say any more. I only agreed because of Freya. After all, the Snow family owes her. Look out for\nyourself from now on. Since you’ve ended"
      },
      {
        "paragraph": "things with Sarah, don’t contact her anymore in the future. If this happens another time, it’ll be useless\neven if a king pleads for you.” Old Master Rodney walked away with the aid of his cane after he finished\nspeaking."
      },
      {
        "paragraph": "Rodney simply knelt there in a daze. He was absent- minded. He could really… come back."
      },
      {
        "paragraph": "“Get up.” Wendy helped him up."
      },
      {
        "paragraph": "“Mom…” Rodney gazed at his mother. He felt bitter. “I’m sorry. I’ve made you and Dad worry about me.”"
      },
      {
        "paragraph": "“Since your grandpa said it’s in the past, let it be bygones.” Wendy sighed. There was a trace of regret\ndeep within her eyes. “You haven’t come"
      },
      {
        "paragraph": "back for a long time. Go to your room and have a rest.”"
      },
      {
        "paragraph": "“Mom, what exactly did Freya tell you all?” Rodney could not resist asking."
      },
      {
        "paragraph": "After a moment of silence, Wendy said, “She suddenly came over last night and said she hoped that\nyour grandpa would agree to let you return to"
      },
      {
        "paragraph": "the Snow family. She said you’ve been apologizing to her lately. She said she understood the Snow\nfamily’s and your intentions, but she doesn’t want to be tied to you because of the child. The love she\nyearns for is true love between two people."
      },
      {
        "paragraph": "“She requested us to consider her feelings and not use every method to make you and her get together.\nOnly the elders would be happy in that case, but both of you, as the people involved, won’t be happy. If\nwe didn’t agree, she’d leave the Snow family and abort the baby.”"
      },
      {
        "paragraph": "Rodney was stunned. He did not expect Freya to say such words in front of his grandpa. “Was she not\nafraid that Grandpa would be angry?”"
      },
      {
        "paragraph": "“Your grandpa was slightly angry at first, but he figured it out afterward. Your grandpa is smart. Freya is\nsmart too. She gave you and the Snow family a way out. Actually, we were too selfish. Back then, we\nwanted you to pursue Freya and you could only return to the Snow family after you marry her. One of the\nreasons was because we wanted to bring both of you together. Secondly, it would indeed be a dishonor\nto the Snow family if we agreed to let you return after publicly cutting all ties with you."
      },
      {
        "paragraph": "Therefore, Freya gave us a way out. Think about it,"
      },
      {
        "paragraph": "we were all too much. We didn’t care about her feelings and never asked whether she was willing to or\nnot.”"
      },
      {
        "paragraph": "Wendy patted Rodney’s shoulders. “What she said was right. Some things can’t be forced. You don’t\nhave to pursue her anymore. We know there’s no attraction between you both. You can just treat her as\nyour cousin in the future.”"
      },
      {
        "paragraph": "“… Cousin?” Rodney was dumbfounded. That word made him very uncomfortable."
      },
      {
        "paragraph": "Ryan laughed and said from the side. “Brother Rodney, you must be quite happy now, right?”"
      }
    ]
  },
  {
    "title": "Chapter 1377 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "What was there for him to be f*cking happy about?."
      },
      {
        "paragraph": "Rodney was frustrated too. He did not know what was wrong with him. “But… she’s carrying my child in\nher stomach.”"
      },
      {
        "paragraph": "“Then you should take care of that child more in the future,” Wendy said while smiling, “You’re fortunate\nthat it’s a baby girl. Girls are scarce in the Snow family. Your grandpa was very happy when he found out\nabout it.”"
      },
      {
        "paragraph": "Rodney blinked his eyes. He was stunned."
      },
      {
        "paragraph": "He knew it! It was a girl. Having a baby girl was good. She would be soft and adorable. Moreover, girls\nusually looked like their fathers. If she inherited his exquisite looks… Ahem, she would surely be the\nnumber one beauty in the whole of Canberra."
      },
      {
        "paragraph": "“What are you thinking about?” Wendy waved her hand in front of Rodney. “Looking at your silly grin, you\nmust be ecstatic. You even forced Freya to abort the baby back then. Almost. He had almost lost the\nbaby.”"
      },
      {
        "paragraph": "Rodney shuddered. That was right. His little angel was nearly gone."
      },
      {
        "paragraph": "“Mom, don’t worry. I’ll definitely take care of Freya in the future, ” Rodney said immediately."
      },
      {
        "paragraph": "Ryan reminded him, “You don’t have to go out of your way to take care of Freya. As her brother, I’ll take\ncare of her. You just need to take care of the child. After all, you getting too close to her will affect her\nchances of marrying other people.”"
      },
      {
        "paragraph": "Wendy nodded. “What Ryan said is right.” Rodney was speechless. “ ”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "That was not f*cking right."
      },
      {
        "paragraph": "Damn Ryan! Did he think he did not know his thoughts? He never found Ryan to be this big of an\neyesore previously."
      },
      {
        "paragraph": "Rodney had lunch at the Snow family’s residence. I n the evening, he accompanied Wendy to go\nshopping. Soon, there were reporters who took pictures of the scene of him chatting happily with Wendy."
      },
      {
        "paragraph": "Not long after, the ‘friends’ who began avoiding him some time back called him. “Brother Snow, we\nhaven’t met up for a long time. We miss you a lot. Let’s have a gathering tonight.”"
      },
      {
        "paragraph": "“Gathering my ass!” Rodney hung up straight away."
      },
      {
        "paragraph": "F*ck, they utterly ignored him when he was in a desolate state, yet they immediately called him when he\nreturned to the Snow family. He did not need such useless friends!"
      },
      {
        "paragraph": "At this moment, he received messages from a group chat he was in with his best friends."
      },
      {
        "paragraph": "Chester: [I heard Rodney has returned to the Snow family. Congratulations! I didn’t expect you to deal\nwith Freya that soon. Will I be able to attend a wedding soon?]"
      },
      {
        "paragraph": "Shaun: [That sounds impossible. Freya isn’t that silly.]"
      },
      {
        "paragraph": "Chase: [Right, how can Freya be so silly? I’ll give her some advice later. There’s no need to make herself\npitiful by getting married for the sake of the child.]"
      },
      {
        "paragraph": "Rodney gritted his teeth. This bunch of terrible friends! He replied: [I’m not going to marry Freya, okay! I\nonly got to return because Freya pleaded"
      },
      {
        "paragraph": "with my grandpa. I don’t have to pursue her anymore.]"
      },
      {
        "paragraph": "Chase: [That’s great. Freya can finally escape from your evil clutches.]"
      },
      {
        "paragraph": "Shaun: [I’m relieved too. If not, I’m afraid my wife will get angry over Freya’s matter again and lash out at\nme.]"
      }
    ]
  },


  {
    "title": "Chapter 1378 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Rodney was exasperated."
      },
      {
        "paragraph": "This bunch of horrible friends."
      },
      {
        "paragraph": "Was he that unbearable? They made it seem as if he was utterly unworthy of Freya."
      },
      {
        "paragraph": "As Rodney was busy typing on his phone, he was not aware of what was happening in front of me. He\nbumped straight into Wendy."
      },
      {
        "paragraph": "“This kid! Are you here to accompany me shopping or play on the phone?” Wendy complained angrily."
      },
      {
        "paragraph": "“Sorry, Mom.” Rodney quickly turned off his phone. He followed Wendy’s gaze and immediately started\nflattering her. “Mom, this dress looks very nice. The color is vibrant and suits your beautiful looks a lot.”"
      },
      {
        "paragraph": "“Enough, I’ll be laughed at by others if I still wear such a dress at my age. I think this dress suits Freya\nquite a lot,” Wendy said."
      },
      {
        "paragraph": "Rodney was stunned. Only upon closer look did he notice it was a bright yellow dress. Even with Freya’s\npregnant belly, it would not be obvious with this dress. Moreover, Freya’s skin was fair and she was\nbeautiful. It would surely suit her."
      },
      {
        "paragraph": "“Let’s buy it, then,” Rodney said without being able to help himself."
      },
      {
        "paragraph": "“Mm.” Wendy nodded. She was about to take her card and swipe it, but Rodney fought to use his card."
      },
      {
        "paragraph": "“Mom, you don’t have to spend your money when you’re out with me. I’ll help you give this dress to\nFreya later. It just so happens that I have to thank her in person.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Wendy smiled in satisfaction and said, “Okay, it’s rare to see you being so sensible now. I’m very happy\nseeing you two cousins getting along nicely.”"
      },
      {
        "paragraph": "The corners of Rodney’s mouth twitched. To hell with cousins!"
      },
      {
        "paragraph": "Would there be someone who was pregnant with her cousin’s child? Ew, he did not want to be cousins."
      },
      {
        "paragraph": "However, if they were not cousins, what would they be?"
      },
      {
        "paragraph": "Friends? Husband and wife?"
      },
      {
        "paragraph": "Ahem."
      },
      {
        "paragraph": "Rodney was shocked by his own thoughts."
      },
      {
        "paragraph": "He drove to Brighton Gardens to look for Freya after sending Wendy back when they were done\nshopping."
      },
      {
        "paragraph": "5:00 p.m."
      },
      {
        "paragraph": "Freya went downstairs and was about to go to the supermarket in the neighborhood to buy some snacks."
      },
      {
        "paragraph": "When she reached her building’s entrance, a slender figure quickly walked over to her. “Freya… ”"
      },
      {
        "paragraph": "Seeing Linda’s face, Freya’s mood was ruined and she no longer wanted snacks."
      },
      {
        "paragraph": "Linda was doll-faced. She looked very innocent, but Freya knew that she was a scheming b*tch."
      },
      {
        "paragraph": "“Freya, I beg you. Please spare Jackson Corporation.” Linda suddenly knelt in front of Freya."
      },
      {
        "paragraph": "There were many people passing by the neighborhood’s entrance. In an instant, a lot of people stopped\nto look at what was happening. Not only that, some people even started looking at Freya as though she"
      },
      {
        "paragraph": "was an evil woman."
      },
      {
        "paragraph": "Freya felt that she was extremely unlucky."
      },
      {
        "paragraph": "She was too lazy to care about Linda and walked past her."
      },
      {
        "paragraph": "Who knew that Linda would chase after her while still on her knees and grab her skirt."
      },
      {
        "paragraph": "Freya was walking and did not notice it, so Linda was yanked and ended up sprawled on the ground."
      },
      {
        "paragraph": "She gritted her teeth and shouted aggrievedly while tolerating the pain, “Freya, as long as you’re willing\nto spare Jackson Corporation, I’m willing to leave Patrick. Jackson Corporation is Patrick’s blood, sweat,\nand tears. I beg you to spare Jackson Corporation. I know I can’t compare to your current identity, but\nI’ve never thought of fighting with you over Patrick. He thought you found another man back then and\nyou didn’t want him anymore. I only got together with him a few years after you said you wanted to break\nup with him.”"
      },
      {
        "paragraph": "The people at the side immediately started pointing fingers."
      },
      {
        "paragraph": "“This is too much. She was the one who broke up with the man first and had another man. Now she still\nwants to get revenge on her ex-boyfriend. How can there be such a woman?”"
      }
    ]
  },
  {
    "title": "Chapter 1379 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“That’s right. They’ve already broken up for a few years but she still doesn’t let the guy find a new\ngirlfriend. She even wants to destroy his company now that he found one. That’s too immoral.”"
      },
      {
        "paragraph": "“Look at her. She already looks like a scheming btch with that face of hers. You can tell at one glance\nthat she’s a petty btch.”"
      },
      {
        "paragraph": "“I think that woman looks quite familiar. She lives in the same neighborhood as us, right?”"
      },
      {
        "paragraph": "“Ah, every corner of Brighton Gardens is worth a lot. There are many daughters of wealthy families who\nlive there. This lady is too pitiful. She offended a woman like that.”"
      },
      {
        "paragraph": "“Young lady, quickly get up. Don’t keep lying here.”"
      },
      {
        "paragraph": "An older woman stepped over and talked to Linda gently."
      },
      {
        "paragraph": "“Aunty, thank you. However, if she doesn’t spare my boyfriend and his company, I won’t get up,”"
      },
      {
        "paragraph": "Linda sobbed and said, “Freya, I guarantee I won’t have anything to do with the Jackson family in the\nfuture. I beg you.”"
      },
      {
        "paragraph": "She bowed down and slammed her head on the ground with loud bangs as she knelt."
      },
      {
        "paragraph": "“Linda, your schemes are even more brilliant than before, huh?” Freya was exasperated."
      },
      {
        "paragraph": "She had not done anything, yet a few words from Linda made her sound like an evil person."
      },
      {
        "paragraph": "“I’m not in the mood to watch you act. If you want to knock your head on the ground, do it all you want.”"
      },
      {
        "paragraph": "Freya lowered her head and flung Linda’s hand away after she finished speaking."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Linda refused to let go and clung to Freya. Her eyes were red from crying. “Freya, promise me and I’ll\nleave immediately. If you’re still not satisfied, you can ask me to do anything.”"
      },
      {
        "paragraph": "“Linda…”"
      },
      {
        "paragraph": "At that moment, a Porsche quickly stopped by the roadside. Patrick ran out of the car. When he saw\nLinda lying on the ground with her head smeared with blood from knocking her head on the ground,\nanger welled up in him. He rushed over and saw Freya’s pretty face which was filled with sarcasm and\nmercilessness."
      },
      {
        "paragraph": "He was so angry that he simply slapped her across the face. “You’re too evil! ”"
      },
      {
        "paragraph": "Freya felt that her face was burning in pain while her head was dizzy."
      },
      {
        "paragraph": "She looked at Patrick’s angry and handsome face. This scene seemed to overlap with the one from three\nyears ago."
      },
      {
        "paragraph": "However, she was no longer the Freya from three years ago."
      },
      {
        "paragraph": "“Patrick…”"
      },
      {
        "paragraph": "Before she could finish her sentence, a gruff, angry voice could be heard all of a sudden. “Patrick\nJackson, how dare you f*cking hit her?”"
      },
      {
        "paragraph": "Rodney, who was wearing a pink shirt, appeared not far away. He held four shopping bags in his hands,\nand his eyes were wide from glaring."
      },
      {
        "paragraph": "After he shouted, he simply tossed the bags aside."
      },
      {
        "paragraph": "Rodney quickly rushed over and threw a fist in Patrick’s face."
      },
      {
        "paragraph": "“Fck, who do you think you are? How dare you hit her? Do you know who she is? Canberra is my turf.\nYou dare to hit my woman on my turf? Are you fcking tired of living?”"
      },
      {
        "paragraph": "Although Rodney’s figure was not buff and he was known as a flirtatious man, he often spent time with\nShaun and Chester, who were both skilled in fighting. He had indirectly been trained and was stronger\nthan ordinary people."
      },
      {
        "paragraph": "Patrick’s fighting skills were not bad too, but he was bound to lose after getting hurt by Rodney’s first\npunch."
      },
      {
        "paragraph": "Moreover, Rodney was ruthless and he was talkative too."
      },
      {
        "paragraph": "He punched Patrick until his handsome face was swollen all over and his body was heavily wounded."
      },
      {
        "paragraph": "Freya was stunned. She did not know why Rodney suddenly appeared."
      },
      {
        "paragraph": "Moreover, it was like he had gone crazy. Did she not just get hit once? Did he have to be so agitated?"
      },
      {
        "paragraph": "As Rodney had always fooled around with women, she really could not tell that he could fight so well. It\ntotally looked like cockfighting."
      },
      {
        "paragraph": "However, Freya was quite satisfied watching it."
      },
      {
        "paragraph": "Three years ago, she had gone to Jackson Corporation to mess with Linda. At that time, Patrick had\nslapped her too. Afterward, although Forrest had rushed over, he was too calm and"
      },
      {
        "paragraph": "mature. He just scolded Patrick with a few sentences before bringing her away."
      },
      {
        "paragraph": "Rodney’s personality was different from Forrest’s. He was haughty and did things before thinking about it\nfirst, unlike Forrest."
      }
    ]
  },
  {
    "title": "Chapter 1380 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "In the past, Freya hated Rodney’s personality quite a lot. However, she realized that he had an\nadmirable side to him too."
      },
      {
        "paragraph": "“Stop fighting! ” Linda cried out. When she saw that no one responded, she could only grab Freya’s skirt\nand say, “Freya, please ask Young Master Snow to stop. Don’t fight anymore. Someone might die. You\ncan’t abuse the power of the Snow family and bully people like this.”"
      },
      {
        "paragraph": "The number of people who gathered around to watch was increasing."
      },
      {
        "paragraph": "When they heard ‘the Snow family’, they immediately started to clamor."
      },
      {
        "paragraph": "“Is the Snow family the family of Nathan Snow, the future prime minister?”"
      },
      {
        "paragraph": "“ It should be. I heard that Nathan’s goddaughter lives in this neighborhood.”"
      },
      {
        "paragraph": "“So she’s the Snow family’s goddaughter?”"
      },
      {
        "paragraph": "“No wonder she’s so arrogant. Nathan hasn’t even assumed the position of the prime minister yet. If her\ndad becomes the prime minister, won’t things get worse?”"
      },
      {
        "paragraph": "Every one of those words traveled into Freya’s ears."
      },
      {
        "paragraph": "Freya pushed Linda away furiously. “Shut your mouth! You’ve been doing all the talking from the start till\nthe end. You guys just randomly came over and started hitting others. Did I force you to kneel? I dated\nPatrick for five to six years. I was his girlfriend but he was always with you when you were sick,\naccompanied you when you went shopping, and he even stayed by your side whenever you were in a\nbad mood. He even bought sanitary pads for you when your period came. Yet you still have the nerve to\nsay you both were innocent? Even though I didn’t say anything, it doesn’t mean I’m a fool.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Freya talked very loudly. The people around them heard her too. The way they looked at Linda became\nslightly strange too."
      },
      {
        "paragraph": "“ It can’t be. If it were me, I’d be exasperated too. ”"
      },
      {
        "paragraph": "“I don’t know which one of them is telling the truth. Let’s call the police first before someone’s life is in\ndanger.”"
      },
      {
        "paragraph": "Initially, Linda wanted to continue her act. However, she saw that Patrick had already fallen on the\nground and was being kicked by Rodney like a sandbag."
      },
      {
        "paragraph": "She frantically rushed over and flung herself over Patrick. “Please stop hitting him. Hit me instead.”"
      },
      {
        "paragraph": "She looked beautiful as she wept. Any man would not be able to stand it if they saw that doll-like face."
      },
      {
        "paragraph": "Linda thought Rodney would surely not raise his hand against a woman."
      },
      {
        "paragraph": "However, Linda had underestimated Rodney. Rodney was not gentlemanly at all. He lifted Linda straight\naway and slapped her across the face."
      },
      {
        "paragraph": "“Linda! ”"
      },
      {
        "paragraph": "Patrick’s eyes were bloodshot from anger. He stumbled and rushed forward to push Rodney away in a\nhurry. “Rodney Snow, it’s fine if you want to hit me. Come at me if you can! But how are you still a man if\nyou hit women?”"
      },
      {
        "paragraph": "“Who was the one who hit women first?” Rodney sneered furiously, “Why didn’t you say the same things\nwhen you hit Freya just now? You really have double standards.”"
      },
      {
        "paragraph": "“That was because she bullied Linda first…”"
      },
      {
        "paragraph": "“How did Freya bully Linda? Did she hit Linda? Linda chose to knock her head on the ground. You\nshould be asking her why she came here to do that. No one forced her to. Also, why did Linda\nintentionally choose to create a scene at the entrance of the neighborhood? Was she afraid other people\nmight not be able to see it? Since she loves to knock her head on the ground so much, she should just\ndo it on a television program. I promise to give her a platform where she can knock her head on the\nground all she wants.”"
      },
      {
        "paragraph": "Rodney made loud accusations. Although he had arrived late, he did not believe that Freya, who was\npregnant, would raise a hand against others."
      },
      {
        "paragraph": "Patrick was stunned for a few seconds until Linda suddenly flung herself into his embrace amidst the\ncold wind. “Patrick, I’m sorry. I just wanted to beg her to spare Jackson Corporation. I’m willing to leave\nyou for it. I knelt willingly. It wasn’t Freya’s fault.”"
      },
      {
        "paragraph": "“Don’t say any more.” Patrick had blamed her a little at first, but after seeing her face which was swollen\nfrom getting slapped, he was enraged. “ Rodney, you should stop talking too. To be blunt, the Snow\nfamily are the ones who are bullying us non-locals.”"
      }
    ]
  },
  {
    "title": "Chapter 1381 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South] Chapter 1384"
      },
      {
        "paragraph": "In the past, Freya hated Rodney’s personality quite a lot. However, she realized that he had an\nadmirable side to him too."
      },
      {
        "paragraph": "“Stop fighting! ” Linda cried out. When she saw that no one responded, she could only grab Freya’s skirt\nand say, “Freya, please ask Young Master Snow to stop. Don’t fight anymore. Someone might die. You\ncan’t abuse the power of the Snow family and bully people like this.”"
      },
      {
        "paragraph": "The number of people who gathered around to watch was increasing."
      },
      {
        "paragraph": "When they heard ‘the Snow family’, they immediately started to clamor."
      },
      {
        "paragraph": "“Is the Snow family the family of Nathan Snow, the future prime minister?”"
      },
      {
        "paragraph": "“ It should be. I heard that Nathan’s goddaughter lives in this neighborhood.”"
      },
      {
        "paragraph": "“So she’s the Snow family’s goddaughter?”"
      },
      {
        "paragraph": "“No wonder she’s so arrogant. Nathan hasn’t even assumed the position of the prime minister yet. If her\ndad becomes the prime minister, won’t things get worse?”"
      },
      {
        "paragraph": "Every one of those words traveled into Freya’s ears."
      },
      {
        "paragraph": "Freya pushed Linda away furiously. “Shut your mouth! You’ve been doing all the talking from the start till\nthe end. You guys just randomly came over and started hitting others. Did I force you to kneel? I dated\nPatrick for five to six years. I was his girlfriend but he was always with you when you were sick,\naccompanied you when you went shopping, and he even stayed by your side whenever you were in a\nbad mood. He even bought sanitary pads for you when your period came. Yet you still have the nerve to\nsay you both were innocent? Even though I didn’t say anything, it doesn’t mean I’m a fool.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South] Chapter 1384"
      },
      {
        "paragraph": "Freya talked very loudly. The people around them heard her too. The way they looked at Linda became\nslightly strange too."
      },
      {
        "paragraph": "“ It can’t be. If it were me, I’d be exasperated too. ”"
      },
      {
        "paragraph": "“I don’t know which one of them is telling the truth. Let’s call the police first before someone’s life is in\ndanger.”"
      },
      {
        "paragraph": "Initially, Linda wanted to continue her act. However, she saw that Patrick had already fallen on the\nground and was being kicked by Rodney like a sandbag."
      },
      {
        "paragraph": "She frantically rushed over and flung herself over Patrick. “Please stop hitting him. Hit me instead.”"
      },
      {
        "paragraph": "She looked beautiful as she wept. Any man would not be able to stand it if they saw that doll-like face."
      },
      {
        "paragraph": "Linda thought Rodney would surely not raise his hand against a woman."
      },
      {
        "paragraph": "However, Linda had underestimated Rodney. Rodney was not gentlemanly at all. He lifted Linda straight\naway and slapped her across the face."
      },
      {
        "paragraph": "“Linda! ”"
      },
      {
        "paragraph": "Patrick’s eyes were bloodshot from anger. He stumbled and rushed forward to push Rodney away in a\nhurry. “Rodney Snow, it’s fine if you want to hit me. Come at me if you can! But how are you still a man if\nyou hit women?”"
      },
      {
        "paragraph": "“Who was the one who hit women first?” Rodney sneered furiously, “Why didn’t you say the same things\nwhen you hit Freya just now? You really have double standards.”"
      },
      {
        "paragraph": "“That was because she bullied Linda first…”"
      },
      {
        "paragraph": "“How did Freya bully Linda? Did she hit Linda? Linda chose to knock her head on the ground. You\nshould be asking her why she came here to do that. No one forced her to. Also, why did Linda\nintentionally choose to create a scene at the entrance of the neighborhood? Was she afraid other people\nmight not be able to see it? Since she loves to knock her head on the ground so much, she should just\ndo it on a television program. I promise to give her a platform where she can knock her head on the\nground all she wants.”"
      },
      {
        "paragraph": "Rodney made loud accusations. Although he had arrived late, he did not believe that Freya, who was\npregnant, would raise a hand against others."
      },
      {
        "paragraph": "Patrick was stunned for a few seconds until Linda suddenly flung herself into his embrace amidst the\ncold wind. “Patrick, I’m sorry. I just wanted to beg her to spare Jackson Corporation. I’m willing to leave\nyou for it. I knelt willingly. It wasn’t Freya’s fault.”"
      },
      {
        "paragraph": "“Don’t say any more.” Patrick had blamed her a little at first, but after seeing her face which was swollen\nfrom getting slapped, he was enraged. “ Rodney, you should stop talking too. To be blunt, the Snow\nfamily are the ones who are bullying us non-locals.”"
      }
    ]
  },
  {
    "title": "Chapter 1382 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“You…” Patrick frowned angrily. He stared at Freya. When he saw her swollen pretty little face, his heart\nwent still for a moment. Had he hit her that hard?"
      },
      {
        "paragraph": "“Patrick, how many times have you hit me? You hit me three years ago, and you hit me again three years\nlater,” Freya said calmly, “Do you think I’m an easy target?”"
      },
      {
        "paragraph": "“F*ck, this isn’t the first time he hit you?! Why didn’t you say that earlier?” Rodney said fiercely, “I\nshould’ve hit him harder just now.”"
      },
      {
        "paragraph": "Freya looked at Rodney in a daze."
      },
      {
        "paragraph": "His handsome face was obviously filled with anger. She was not used to it."
      },
      {
        "paragraph": "After all, they were sworn enemies who had been going against each other."
      },
      {
        "paragraph": "Jessica squinted her pretty eyes. Although Patrick had been hit until he had bruises all over his body and\nhis face was swollen, it was not hard to observe from his clothing that he appeared to be a well-\nmannered handsome person. Such a man actually raised his hand against a woman repeatedly."
      },
      {
        "paragraph": "Moreover, Freya was pregnant now. If anything had happened to her, the child would have been harmed\ntoo."
      },
      {
        "paragraph": "Jessica moved her lips coldly. “You’re very bold. You dared to hit a member of the Snow family.”"
      },
      {
        "paragraph": "Patrick’s body trembled. Although that woman’s gaze was indifferent, the surrounding air was\ncompressed till the pressure was exceedingly low. He felt chilly all over and regretted it a lot. “Eldest\nYoung Lady Snow, I’m sorry. I was too rash…”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Can the problem be solved with just an apology when a member of the Snow family was hit?” Jessica’s\ndelicate brows raised slightly."
      },
      {
        "paragraph": "“But I was hit by Young Master Snow till I’m in this state as well…”"
      },
      {
        "paragraph": "Jessica laughed, sounding utterly icy. “I never thought there would come a day when a member of the\nSnow family would be bullied by a non-local. ”"
      },
      {
        "paragraph": "Patrick broke out in a cold sweat. Linda toughened herself and stepped forward. She said, “Everything\nhappened because of me. Eldest Young Lady Snow, if you want to punish someone, just punish me\nalone.”"
      },
      {
        "paragraph": "Linda…. Patrick’s eyes trembled."
      },
      {
        "paragraph": "Linda said with tears in her eyes, “Don’t say anything. It was my fault today. I overestimated myself.”"
      },
      {
        "paragraph": "Patrick clenched his fists. He had overestimated himself too."
      },
      {
        "paragraph": "Freya watched coldly as patrick and Linda echoed each other. She was not upset. She just felt\ndisgusted."
      },
      {
        "paragraph": "Jessica glanced at Linda and smiled vaguely. “There’s a time and place to act like you are deeply in love.\nSometimes, in some places, putting on such an act will only make you pay a hevier price.”"
      },
      {
        "paragraph": "Linda was taken aback."
      },
      {
        "paragraph": "“Your last name is Shelby, right? I’ll remember it.” Jessica glanced at Rodney and Freya. “Let’s go.”"
      },
      {
        "paragraph": "“Mm.”"
      },
      {
        "paragraph": "Freya nodded and left with Rodney."
      },
      {
        "paragraph": "Throughout the entire time, she never shot a glance at Patrick."
      },
      {
        "paragraph": "When she recalled she previously thought that Patrick was handsome and gentlemanly, she felt\ndisgusted. He had utterly sullied the word gentlemanly’."
      },
      {
        "paragraph": "Patrick absentmindedly watched Freya from behind."
      },
      {
        "paragraph": "Jessica’s appearance made him truly aware of the stark difference between him and Freya now."
      },
      {
        "paragraph": "He actually raised his hand and hit Freya. Was he crazy?"
      },
      {
        "paragraph": "How could he afford to offend the prime minister’s goddaughter?"
      },
      {
        "paragraph": "“Patrick, what do we do now?” Linda thought of the last words Jessica said. Would the Shelby family be\ntargeted too? The Shelby family was lacking compared to Jackson Corporation. If the Shelby family were\nmet with a misfortune, she would no longer be the young lady of the Shelby family."
      }
    ]
  },
  {
    "title": "Chapter 1383 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "No, Linda did not want to end up as an ordinary girl."
      },
      {
        "paragraph": "“I don’t know either.” Patrick shook his head absently."
      },
      {
        "paragraph": "He could not go against Jessica. The Lynch family had already surpassed Jackson Corporation by a\ngreat length in these few years under the leadership of Forrest, let alone the Snow family."
      },
      {
        "paragraph": "He was not even the Lynch family’s opponent."
      },
      {
        "paragraph": "Linda gritted her teeth. “Patrick, I have an idea. The fact that we got hit today is true. As long as we\ncirculate the video of Rodney hitting us, it’ll surely raise a commotion. The Snow family does have\noverwhelming power and Nathan is the future prime minister. However, no one will know the results\nwhen it’s not the final moment yet. There are many people in the dark who want to replace Nathan. They\nmust really want the Snow family’s reputation to be stained. We can grab this opportunity.”"
      },
      {
        "paragraph": "Patrick was taken aback. He gazed at Linda as if he had just gotten to know her for the first time."
      },
      {
        "paragraph": "Linda cried. “I have no choice either. Moreover, the Snow family is bullying you too much.”"
      },
      {
        "paragraph": "“Linda, Nathan is undoubtedly the most excellent one among the candidates for prime minister. A prime\nminister decides a country’s development and future…” Patrick pressed his lips together. “ If the one who\nassumes the position is not a good person…”"
      },
      {
        "paragraph": "“Patrick, look at Rodney and Jessica’s haughty expressions. How good can someone from the Snow\nfamily be? Besides, Freya is so arrogant now as well. When her godfather becomes the prime minister,\nwill we still have a way to survive?” Linda smiled bitterly. “We’re just ordinary people. I’m selfish. I just\nwant to take care of you and my family and spend our days properly.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Patrick frowned. He was hesitating because of her words. After a long time, he clenched his fists and\nnodded."
      },
      {
        "paragraph": "A sedan drove toward the Snow family’s residence."
      },
      {
        "paragraph": "On the way, the car stopped. Jessica asked the driver to go to the pharmacy. Not long after, the driver\nbrought an ice pack and a bottle of medicine back."
      },
      {
        "paragraph": "“Miss Lynch, apply the ice pack on your face first and then apply some medicine.”"
      },
      {
        "paragraph": "“Thank you.” Freya received the items. She did not expect that despite looking cold, Jessica was very\nthoughtful and attentive."
      },
      {
        "paragraph": "Freya applied the ice pack to her wound. The burning pain was instantly soothed."
      },
      {
        "paragraph": "Rodney only realized it afterward. F*ck, why was he so dense? He never thought of buying medicine for\nFreya. He thought that after getting hit in the face, the swelling would subside and recover without\nneeding any medication."
      },
      {
        "paragraph": "He was frustrated when he thought about it. Sure enough, there was a reason why he was still single."
      },
      {
        "paragraph": "It was normal that he had been dumped by other people."
      },
      {
        "paragraph": "He had to improve in the future."
      },
      {
        "paragraph": "“Uh… Hey… Why don’t we go to the hospital and do an ultrasound in case something happened to the\nchild?” he immediately suggested."
      },
      {
        "paragraph": "“It’s alright. Besides my face, I don’t feel uncomfortable anywhere else.” Freya rejected him."
      },
      {
        "paragraph": "“But…”"
      },
      {
        "paragraph": "“ She got hit in the face, not her stomach. ” Jessica could not stand it either."
      },
      {
        "paragraph": "Jessica was really impressed with Rodney’s EQ. If he continued nagging, Freya would only suspect that\nhe only cared about the child and not her face."
      },
      {
        "paragraph": "Rodney pressed his lips together in frustration. He was just afraid that the slap was too strong and it\naffected the baby too."
      },
      {
        "paragraph": "“You did well today.” It was a rare occasion that Jessica was praising Rodney."
      },
      {
        "paragraph": "Rodney was surprised. “But… the fact that I beat someone up even got on the news. Grandpa and the\nothers must be very angry.”"
      },
      {
        "paragraph": "“That’s right, so didn’t you think of it first before you hit him?” Jessica reminded him coldly."
      },
      {
        "paragraph": "Freya said hurriedly, “Jessica, what happened today was because of me. If the Snow family pursues this\nmatter, I’ll shoulder the responsibility.”"
      },
      {
        "paragraph": "“You’ve misunderstood. If I’m angry at Rodney, I wouldn’t have praised him. ” Jessica laughed coldly.\n“That Patrick and Linda are indeed loathsome. You don’t have to care about the following matters. I’ll\ntake care of it.”"
      },
      {
        "paragraph": "Freya was startled. She had heard about Jessica’s ruthlessness before. If Jessica took action, she might\nnot be as gentle as Rodney and Freya when dealing with the two."
      }
    ]
  },

  {
    "title": "Chapter 1384 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Rodney was very surprised. “Sis, I didn’t expect that.”"
      },
      {
        "paragraph": "“ It’s because Linda is too pretentious and she’s an eyesore. I hate fake women like her the most, ”\nJessica said indifferently."
      },
      {
        "paragraph": "Freya understood. It seemed that Jessica was not joking when she said, ‘Putting on a show will only\nmake you pay a heavier price’ to Linda."
      },
      {
        "paragraph": "Rodney praised, “ Sis, what you said is right. That Linda is too f*cking pretentious. She kept sobbing. It\nmade her look as though she was the victim and we were bullying her.”"
      },
      {
        "paragraph": "“Since you could notice that, why couldn’t you see through Sarah’s tricks back then?” Jessica suddenly\nasked."
      },
      {
        "paragraph": "Rodney could not find any words to reply."
      },
      {
        "paragraph": "Freya said, “When you love and care for someone, you’ll think that everything that person says is\ncorrect. Everything that person does will make your heart ache. It’s just like how we bystanders can see\nthrough Linda’s pretentiousness but Patrick can’t. I n his eyes, Linda is a naive woman who would\nsacrifice everything for him. However… her love for Patrick is indeed real.”"
      },
      {
        "paragraph": "“That’s right.”"
      },
      {
        "paragraph": "Jessica nodded. “But I hate this type of woman a lot. You can love someone, but it can’t be done on the\nbasis of hurting someone else.”"
      },
      {
        "paragraph": "Freya had an astonished expression."
      },
      {
        "paragraph": "She did not expect that Jessica’s thoughts were exactly the same as hers."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "In the past, she had always thought that Jessica was cold-blooded and heartless. It turned out Jessica\nwas not that bad."
      },
      {
        "paragraph": "After arriving at the Snow family."
      },
      {
        "paragraph": "Freya had already prepared herself for a scolding, but when Wendy walked over with a worried\nexpression and touched her face, she felt like something was stuck in her throat."
      },
      {
        "paragraph": "“Freya, it must hurt a lot, right?” Wendy sighed."
      },
      {
        "paragraph": "“Aunty Wendy…” Freya opened her mouth, a feeling of warmth surging in her chest."
      },
      {
        "paragraph": "Although she was the Snow family’s goddaughter, she did not have a lot of feelings for the Snow family.\nShe always thought the Snow family treated her well only because of the child in her stomach."
      },
      {
        "paragraph": "“Alright, don’t say anything more. I heard everything from Jessica. That Patrick was too much.” Wendy\nsaid angrily at Jessica, “He still dared to be so arrogant despite knowing Freya is part of the Snow family.\nI don’t wish to see any of Jackson Corporation’s products launched in the market.”"
      },
      {
        "paragraph": "Jackson Corporation was done for if none of their products could be launched in the market."
      },
      {
        "paragraph": "“Mom, there’s the Shelby family too, ” Rodney said in a hurry."
      },
      {
        "paragraph": "“Don’t worry, I won’t let this matter slide easily.” Wendy harrumphed. She was a complete bad*ss!"
      },
      {
        "paragraph": "“Rodney, you did well.” It was a rare time when Old Master Snow praised Rodney."
      },
      {
        "paragraph": "“Grandpa…” Rodney was shocked, and his handsome face blushed slightly. He felt embarrassed. “I was\ntoo angry and didn’t think before acting. I’ve brought trouble to the Snow family again.”"
      },
      {
        "paragraph": "“Even if the Snow family doesn’t want trouble to come knocking at our door, it doesn’t mean you should\nlive with your tail between your legs. The Snow family shouldn’t have to tolerate it even when we’ve"
      },
      {
        "paragraph": "received a slap in the face.” Old Master Snow scoffed and said, “Alright, it’s getting late now. Let’s have\ndinner. Freya, you should spend the"
      },
      {
        "paragraph": "night here. Someone might harass you again if you go back now.”"
      },
      {
        "paragraph": "Freya hesitated for a moment but eventually nodded."
      },
      {
        "paragraph": "She did not really want to return to Brighton Gardens either. If it were before, she could look for\nCatherine. However, Catherine had already gotten back together with Shaun. It was not appropriate for\nher to be a third wheel."
      },
      {
        "paragraph": "After having dinner, Freya went upstairs to rest."
      },
      {
        "paragraph": "Ever since she became pregnant, the Snow family had gotten her a bedroom here. However, she rarely\nused it."
      },
      {
        "paragraph": "After taking a bath, Freya walked toward the balcony. She wanted to look at the night view outside."
      },
      {
        "paragraph": "The Snow family’s garden was gorgeous. There was a bridge and a creek. It was quaint and looked like\na cottage garden."
      },
      {
        "paragraph": "However, not long after she stepped out, Rodney walked out onto the balcony beside hers."
      },
      {
        "paragraph": "He had just finished bathing and was only wearing a pair of… tiny, short pants. He was shirtless."
      },
      {
        "paragraph": "Maybe he did not expect that there would be someone on the balcony next to him. He even did some\nstretches. However, when he saw Freya beside him and their gazes met, they both became\ndumbfounded."
      },
      {
        "paragraph": "Although they had sex before, Freya had not gotten a close look back then. Her gaze instinctively landed\non his underwear. It was pink…"
      },
      {
        "paragraph": "The corners of Freya’s mouth twitched. This flashy guy."
      },
      {
        "paragraph": "Rodney was stunned too. Freya, who was opposite him, was wearing a sky blue silk nightdress. As the\nsilk material clung to her body, he could clearly tell that Freya was not wearing anything underneath."
      }
    ]
  },
  {
    "title": "Chapter 1385 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Rodney’s face was flushed red in an instant."
      },
      {
        "paragraph": "A wave of heat surged to his head uncontrollably. When he realized it, Freya was already scolding him\nwith a flushed face, “Rodney Snow, you freaking pervert! ”"
      },
      {
        "paragraph": "After she said that, she slammed the door with a bang and even locked it."
      },
      {
        "paragraph": "Rodney was stunned. After he looked downward, he quickly went into his bedroom while blushing."
      },
      {
        "paragraph": "F*ck, he was really crazy!"
      },
      {
        "paragraph": "Had he become silly after being celibate all his life? His body reacted with just a glance."
      },
      {
        "paragraph": "F*ck, it was so embarrassing."
      },
      {
        "paragraph": "Young Master Snow was in despair and on the verge of breaking down for the first time in his life."
      },
      {
        "paragraph": "He really did not have an image anymore. He would definitely be laughed at by Freya after this."
      },
      {
        "paragraph": "Young Master Snow could not sleep for the whole night."
      },
      {
        "paragraph": "In the next room, Freya could not sleep because of Rodney."
      },
      {
        "paragraph": "Initially, she was thinking about the matter regarding Patrick and Linda. Afterward, she could not recall\nher thoughts at all because of Rodney."
      },
      {
        "paragraph": "She did not want to think about it, but the scene at the balcony had made her too embarrassed."
      },
      {
        "paragraph": "Although she was already pregnant, she was in a blur at that time."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Frankly speaking, she was still an innocent girl."
      },
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "Freya opened the door of her room and came out. At the same time, the door next to hers quickly\nopened as well. Rodney walked out wearing an orange shirt."
      },
      {
        "paragraph": "This man always liked to wear bright colors."
      },
      {
        "paragraph": "People who were in high positions usually liked to wear clothes in more mature colors. Rodney was an\nexception."
      },
      {
        "paragraph": "After all, he looked handsome and flirtatious. He would look like a celebrity regardless of what he wore."
      },
      {
        "paragraph": "However, at that moment, Freya could not look at his face at all."
      },
      {
        "paragraph": "She turned around and left straight away."
      },
      {
        "paragraph": "Rodney’s face darkened. When he saw her avoiding him as though he was a poisonous snake, he could\nnot resist grabbing her hand immediately. “What are you doing?”"
      },
      {
        "paragraph": "“Rodney, let go. You pervert.” Freya resisted strongly."
      },
      {
        "paragraph": "Rodney wanted to spit out blood from frustration. He blurted out, “I’m not. If it weren’t for you standing at\nthe balcony dressed like that, would"
      },
      {
        "paragraph": "that have happened to me?”"
      },
      {
        "paragraph": "Freya was taken aback. How was she dressed last night?"
      },
      {
        "paragraph": "She belatedly remembered. Her petite face, which looked mixed, blushed even harder."
      },
      {
        "paragraph": "“Go to hell.”"
      },
      {
        "paragraph": "Freya kicked his leg."
      },
      {
        "paragraph": "Rodney doubled over and exclaimed in pain."
      },
      {
        "paragraph": "Carson walked down from upstairs. When he saw the scene, he smirked playfully. “ Brother, Freya, what\nare you guys fighting over so early in the"
      },
      {
        "paragraph": "morning?”"
      },
      {
        "paragraph": "“I… I… I’m about to be disabled because of her.” Rodney grimaced with pain."
      },
      {
        "paragraph": "Carson took a glance. He smiled and said, “It’s okay. You already have a child anyway. There’s no need\nto worry even if you become s.ex.ually incapable.”"
      },
      {
        "paragraph": "Was Carson still his brother?"
      },
      {
        "paragraph": "Freya burst into laughter. “Carson, let’s go down together for breakfast.” “Okay.” Carson nodded."
      }
    ]
  },
  {
    "title": "Chapter 1386 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Rodney followed behind them gloomily."
      },
      {
        "paragraph": "After going downstairs, Old Master Snow, Jason, Nathan, and the others were already there. It was rare\nfor all the Snow family members to present at breakfast."
      },
      {
        "paragraph": "Rodney grinned and said, “Uncle Nathan, why did you all come over too? Is it because you know I’m\nback? There’s no need to be so grand early in the morning.”"
      },
      {
        "paragraph": "Nathan glanced at him helplessly."
      },
      {
        "paragraph": "Jason pressed the middle of his brows. “We’re discussing something. The video of you hitting Patrick at\nthe entrance yesterday was uploaded onto the internet. The Kramer family’s people are adding fuel to\nthe fire behind the scenes. It’s spreading very quickly and has become quite a big issue.”"
      },
      {
        "paragraph": "Rodney and Freya’s expressions changed at the same time. They quickly turned on their phones."
      },
      {
        "paragraph": "[Nathan Snow’s Nephew Violently Hitting Commoners] was already widely circulated."
      },
      {
        "paragraph": "It was a complete video that showed Freya walking out of the neighborhood before Linda went over and\nsaid a few sentences. Afterward, Linda knelt on the ground and Freya immediately walked forward."
      },
      {
        "paragraph": "From the video, it looked as though Freya was dragging Linda. Next, Patrick appeared and slapped\nFreya. Then, Rodney rushed over and beat Patrick u"
      },
      {
        "paragraph": "The scene of Rodney beating up Patrick continued for a full six or seven minutes. Then, Rodney hit\nLinda as well."
      },
      {
        "paragraph": "The netizens commented on the video."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "[Freya is so arrogant. That person already knelt for her, yet she ignored her and even dragged her\nacross the ground. I heard she’s Nathan’s goddaughter. F*ck, if it were my girlfriend, I wouldn’t even care\nwho it was. I’d hit anybody, even a king.]"
      },
      {
        "paragraph": "[Nathan hasn’t assumed the position of the prime minister yet. Even a goddaughter is being so arrogant\nand conceited. If Nathan becomes the prime minister, won’t the Snow family even dare to flip the skies?]"
      },
      {
        "paragraph": "[Haven’t the skies been flipped already? Didn’t you see how ruthlessly Rodney hit that guy? I heard"
      },
      {
        "paragraph": "that the guy who was beaten up is even hospitalized now. His injuries are pretty severe.]"
      },
      {
        "paragraph": "[Wasn’t Rodney caught?]"
      },
      {
        "paragraph": "[Caught my *ss. Someone from the Snow family came and took him away after that. Nothing happened\nat all.]"
      },
      {
        "paragraph": "[I think we can’t conclude anything by just watching the video. Why did that woman kneel to Freya?]"
      },
      {
        "paragraph": "[I heard Freya made a move against Jackson Corporation. Didn’t you see that Jackson Corporation has\nbeen getting into a ton of scandals lately? Actually, their food has no problems at all."
      },
      {
        "paragraph": "It’s the Snow family who’s manipulating everything behind the scenes.]"
      },
      {
        "paragraph": "[That’s too f*cking much. Do they really think we commoners without power or influence are easy to\nbully?]"
      },
      {
        "paragraph": "[In my opinion, Nathan doesn’t have the right to be the prime minister at all. The people in the Snow\nfamily are all a pile of trash.]"
      },
      {
        "paragraph": "Freya’s face paled from reading the comments."
      },
      {
        "paragraph": "She did not expect that things would develop until that extent. “I’m sorry. It’s all my fault— ”"
      },
      {
        "paragraph": "“Why is it your fault? I should be the one to blame. I was the one who hit them.” Rodney stood in front of\nFreya."
      },
      {
        "paragraph": "Freya looked at his back in a daze. She had complicated feelings right now."
      },
      {
        "paragraph": "Nathan raised his hand. “As my goddaughter, don’t you even have the right to teach a shameless person\na lesson? I’m the one who has too many competitors. They joined hands to pull me down this time.”"
      },
      {
        "paragraph": "“Dad, what should we do now?” Ryan asked calmly."
      },
      {
        "paragraph": "Jason lit a cigarette. He said, “Freya, this ex- boyfriend of yours isn’t simple.”"
      },
      {
        "paragraph": "Freya was confused. Did Patrick care about Linda to that extent?"
      },
      {
        "paragraph": "He would rather go against the future prime minister and completely ruin her reputation. If it were not\nbecause the Snow family were big- hearted, she would have already been chased out by the Snow\nfamily members."
      }
    ]
  },
  {
    "title": "Chapter 1387 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Nathan narrowed his eyes. “He really isn’t simple. I haven’t seen a scoundrel like him for a long time.”"
      },
      {
        "paragraph": "Freya gritted her teeth. “Why don’t I make a statement and make things clear about how the situation\ncame about?”"
      },
      {
        "paragraph": "“It’s no use. No one will believe empty words. These people are inciting conflict between civilians and\ndignitaries. I’ve always had a large number of civilian supporters. If the trust they have for me decreases,\nit’ll affect the vote in next month’s election.”"
      },
      {
        "paragraph": "Nathan stood up and patted Freya’s shoulder gently. “ I can find someone from the supervision\ndepartment to prove that you’ve never targeted Jackson Corporation, but it’s a fact that Rodney beat him\nup. The only way is for you to announce that you’re four months pregnant. Patrick hit a pregnant woman,\nand Rodney, who is the father, retaliated in anger.”"
      },
      {
        "paragraph": "Freya was shocked, and Ryan said hurriedly, “Dad, that’s the same as telling the public that Freya got"
      },
      {
        "paragraph": "pregnant before marrying. It’ll affect her reputation, and when she wants to marry in the future…”"
      },
      {
        "paragraph": "“That’s why Rodney has to take responsibility. The two of you have to register and get a marriage\nlicense.”"
      },
      {
        "paragraph": "Jason took a deep drag off his cigarette. “You need to understand that there were many onlookers in the\nneighborhood yesterday. The people who live in Brighton Gardens are rich and wealthy, so they won’t be\neasy to control. I’m just worried that our large number of opponents will try their best to get the onlookers\nto speak up. Many people must be scolding you for last night. From the video, the Snow family knows\nthat you were just protecting you and your child, but others don’t think so.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Freya, I’m sorry.” Nathan looked at her helplessly. “This campaign has taken us decades’ worth of effort.\nThere can’t be any mistakes.”"
      },
      {
        "paragraph": "Freya was stunned."
      },
      {
        "paragraph": "She had to tell the public about her four-month pregnancy?"
      },
      {
        "paragraph": "Once the public learned about it, Rodney’s action of beating up Patrick could be justified."
      },
      {
        "paragraph": "What about her?"
      },
      {
        "paragraph": "Was she really going to marry a person she did not love?"
      },
      {
        "paragraph": "However, everything only started because of her. She was the one who told Rodney to deal with Jackson\nCorporation. In the end, it happened because of her personal grudges."
      },
      {
        "paragraph": "“Let… me think about it.”"
      },
      {
        "paragraph": "She said with much difficulty, “This isn’t just about me either. Rodney— ”"
      },
      {
        "paragraph": "“I’m willing to marry you,” Rodney blurted out without thinking."
      },
      {
        "paragraph": "Freya gave a wry smile. He was really willing to sacrifice himself for the Snow family."
      },
      {
        "paragraph": "“Think about it. We won’ t force you, ” Old Master Snow suddenly said, “If we lose, then we lose. We can\nonly blame fate for our failure. What’s important is that the Snow family has a clear conscience.”"
      },
      {
        "paragraph": "The people from the Snow family fell silent for a long time."
      },
      {
        "paragraph": "Freya did not know how she got back to her room."
      },
      {
        "paragraph": "Her mind was blank until Catherine called. “Freya, are you okay?”"
      },
      {
        "paragraph": "“Cathy, I think… the only thing I can do now is marry Rodney.” Freya told her about the Snow family’s\ndecision and said hoarsely, “Patrick is so ruthless.”"
      },
      {
        "paragraph": "“ I’m guessing that it was Linda who encouraged him behind the scenes.” Catherine was deeply\nannoyed. “I should’ve been the one to do it. I forgot that the Snow family is going through extraordinary\ntimes now. Although their status is prominent, they still have to be careful.”"
      },
      {
        "paragraph": "“It was my fault, ” Freya murmured, “I can’t drag the Snow family down because of me.”"
      },
      {
        "paragraph": "“It looks like you’ve already made a decision,” Catherine noted."
      },
      {
        "paragraph": "“Linda and Patrick really pissed me off this time. They want to bring me down, but I won’t let them\nsucceed. It’s just marriage, anyway. When the crisis is resolved, I’ll make sure they’re left with nothing.”\nFreya’s eyes spewed out flames of hatred."
      },
      {
        "paragraph": "Catherine opened her mouth but did not know what to say."
      },
      {
        "paragraph": "There seemed to be no other good choice. “Maybe… Rodney actually isn’t that bad. He used to like\nSarah, but he’s probably returned to his senses now. He’s handsome and can cook too. Maybe you two\ncan be happy together. ”"
      }
    ]
  },
  {
    "title": "Chapter 1388 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Are you comforting me?” Freya smiled wryly."
      },
      {
        "paragraph": "“Humans always need a little hope for the future. ” Catherine smiled. “ If you really think about it, you two\nhave already slept together. He’s good-looking and has a good figure…”"
      },
      {
        "paragraph": "“He’s not bad. He can be quite flirty too. He wears pink underwear.” Freya could not help but spit out."
      },
      {
        "paragraph": "“Ahem. You even saw him in his…” Catherine’s tone became ambiguous."
      },
      {
        "paragraph": "“I saw it accidentally, okay? It’s not what you think,” Freya hurriedly explained."
      },
      {
        "paragraph": "“I know. After all, you two have slept together before, ” Catherine said with an understanding tone."
      },
      {
        "paragraph": "Freya blushed. There was no way to clear her name. “I did sleep with him, but I didn’t take a proper look\nat him before…”"
      },
      {
        "paragraph": "“Does that mean you’ve been looking at him seriously recently?”"
      },
      {
        "paragraph": "“Catherine…” Freya gnashed her teeth. She did not want to talk to Catherine anymore."
      },
      {
        "paragraph": "“Okay, I’m just kidding.” Catherine laughed. “ Freya, no matter what you do, I’ll respect your decision.\nJust remember that you have to protect your own heart. If you do that, no one will be able to hurt you.”"
      },
      {
        "paragraph": "“It’s not that easy to protect the heart, ” Freya muttered, “You didn’t protect your heart when you married\nShaun before either.”"
      },
      {
        "paragraph": "“Yeah, but even if you can’t do it, you have to remember that women should love themselves a little\nmore,” Catherine said."
      },
      {
        "paragraph": "“Yeah, I know.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Freya nodded. For the kind of dedication and love she once gave to Patrick, once was enough."
      },
      {
        "paragraph": "In this world, the only person who would never hurt her was herself."
      },
      {
        "paragraph": "Before long, there was a knock on the door from outside."
      },
      {
        "paragraph": "Her heart thumped."
      },
      {
        "paragraph": "Frankly speaking, she did not want to see the Snow family now."
      },
      {
        "paragraph": "It was because it would make her feel stressed and guilty."
      },
      {
        "paragraph": "After hesitating for a few seconds, she went over and opened the door."
      },
      {
        "paragraph": "What she saw was Rodney’s beautiful face. At that moment, there was a complicated look on his face. “\nCan I come in and talk to you?”"
      },
      {
        "paragraph": "“Sure.” Freya turned and walked in."
      },
      {
        "paragraph": "Rodney closed the door, and the room was eerily quiet for a while."
      },
      {
        "paragraph": "He took out a ring box and opened it. He knelt on one knee before revealing a dazzling diamond ring\ninside. “I hope you can marry me. I know I was very bad before and made many mistakes. Maybe in your\neyes and in the eyes of others, I have no sense of responsibility. I even did things to hurt you for Sarah.\nBut give me a chance. Let me take care of you and our child.”"
      },
      {
        "paragraph": "Freya was stupefied. A proposal?"
      },
      {
        "paragraph": "She never expected Rodney to propose to her."
      },
      {
        "paragraph": "After all, they had spent more time quarreling and fighting than peacefully living together."
      },
      {
        "paragraph": "Furthermore, he did not like her. He was only"
      },
      {
        "paragraph": "acting like this for the sake of the Snow family’s future."
      },
      {
        "paragraph": "”Will you… marry me?” Rodney looked at her apprehensively."
      }
    ]
  },


  {
    "title": "Chapter 1389 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "In truth, Rodney did not know what had happened to him. When he was downstairs and the Snow family\nsuggested that he marry her, he was not as resistant to it as before."
      },
      {
        "paragraph": "Maybe it was because of the child, or maybe it was because he thought that Freya was actually a good\nperson. She would be a good wife."
      },
      {
        "paragraph": "Maybe he had some feelings for her."
      },
      {
        "paragraph": "He admitted that he might not love her now, but he would slowly learn to love her and their child. He\nwould become a responsible man in the future."
      },
      {
        "paragraph": "Freya pursed her lips silently, and he became nervous. “Hey, say something. I’ll get nervous if you don’t\nsay anything.”"
      },
      {
        "paragraph": "“It’s your second time proposing. What do you have to be nervous about?” Freya spat out."
      },
      {
        "paragraph": "Rodney froze and suddenly blushed when he remembered how he had proposed to Sarah in the\nrestaurant previously. “I was serious about Sarah before, but my relationship with her is a matter of the\npast. It’s impossible between Sarah and me. I’m proposing to you seriously now. Actually… I think that…\nyou’re… not bad. Look, after we get married and the Snow family resolves this crisis, we can punish\nPatrick Jackson together. Think about it, people outside are hurling abuse at us. Patrick and Linda must\nbe feeling very smug about it. Are you able to accept it?”"
      },
      {
        "paragraph": "Freya gritted her teeth. Of course, she could not accept it."
      },
      {
        "paragraph": "“Rodney, I’m just unhappy with the fact that you’re proposing to me so casually after proposing to Sarah\nbefore. You’re making me look like a scrap collector and I’m collecting trash that even Sarah didn’t want.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Rodney Snow, the leftover scraps, became angry and blurted out, “You can’t say that. You were\nabandoned by Patrick and I was abandoned by Sarah. Look how well matched we are.”"
      },
      {
        "paragraph": "“What is that supposed to mean? Are you saying that I’m also trash?” Freya was in the middle of her\npregnancy, so she was particularly sensitive."
      },
      {
        "paragraph": "“Ahem, that’s not it. I’m just saying that we’ve gone through the same misfortunes, ” Rodney said\nawkwardly, “Besides, I don’t think you’re trash."
      },
      {
        "paragraph": "You’re exceptional and the most promising cosmetic chemist in the world. You have a great future, you’re\nfive years younger than me, and you’re beautiful. If I marry you, I’d be like cow dung stuck on a flower.”"
      },
      {
        "paragraph": "Freya was originally a little angry, but she could not help but laugh at his words. “Alright, at least you’re\nself—aware.”"
      },
      {
        "paragraph": "Rodney, “…..”"
      },
      {
        "paragraph": "Yes, she had never expected him to become so humble and flatter her. He had never acted like this in\nfront of Sarah before."
      },
      {
        "paragraph": "“Um… Lady, can you let me get up now? My knee hurts from kneeling,” Rodney asked stiffly."
      },
      {
        "paragraph": "“What did you call me?” Freya raised a thin brow. “ I’m half a decade younger than you, but you have the\nnerve to address me as ‘Lady’? Why don’t you call me ‘Ma’am’ instead?”"
      },
      {
        "paragraph": "Rodney was exasperated. If she became ‘Ma’am’ before marrying him, would she become an empress\nafter marrying him?"
      },
      {
        "paragraph": "“Also, I remember watching on the news back then that you knelt for a long time when you proposed to\nSarah. But now you’re saying that your knee hurts after just a while? Sure enough, your heart isn’t\nsincere enough.” Freya snorted."
      },
      {
        "paragraph": "Rodney was desperate. “Ma’am, how long do you want me to kneel before agreeing?”"
      },
      {
        "paragraph": "Freya smiled. “Just half an hour, then I’ll agree. ” Half an hour."
      },
      {
        "paragraph": "The corners of Rodney’s mouth twitched."
      },
      {
        "paragraph": "“What, are you unwilling?” Freya raised her brows."
      },
      {
        "paragraph": "“ .. No, it’s just half an hour. That’s child’s play, ” Rodney immediately said."
      },
      {
        "paragraph": "Freya glanced at him. “ Say, you didn’t care about the Snow family’s reputation at all when you were with\nSarah in the past, but you care about it so much now. You’re really trying hard in order to let your uncle\nbecome prime minister.”"
      },
      {
        "paragraph": "Rodney opened his mouth. After a moment, he said in a complicated tone, “The main reason is that…\nI’m also responsible for this mess. Although no one is blaming me, my heart… still feels uncomfortable.\nOur child will have to be born sooner or later. It’s not good for her to be an illegitimate child. If we get\nmarried, at least others will know that she’s Rodney Snow’s daughter and no one will laugh at her. ”"
      }
    ]
  },
  {
    "title": "Chapter 1390 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Freya froze. She had thought about those problems before."
      },
      {
        "paragraph": "“Continue kneeling, ” Freya finally said and sat down by the dressing table. She began to write\nsomething."
      },
      {
        "paragraph": "Rodney did not know what she was writing, but since she was telling him to kneel, it probably meant that\nshe would agree to marry him."
      },
      {
        "paragraph": "As long as she agreed, he would kneel. Rodney knelt while watching Freya’s figure."
      },
      {
        "paragraph": "Although she was four months pregnant, it did not look obvious as she was wearing loose clothing. His\ngaze fell on her chest…"
      },
      {
        "paragraph": "He could not help but think about the scene from last night."
      },
      {
        "paragraph": "Maybe it would be nice to get married."
      },
      {
        "paragraph": "He would finally have a woman by his side in the future."
      },
      {
        "paragraph": "He had been abstaining for decades. If he continued, he might have to become a eunuch."
      },
      {
        "paragraph": "After kneeling for half an hour, Freya walked over with a piece of paper. “Get up.”"
      },
      {
        "paragraph": "Rodney stood up with a sore knee, and Freya handed him the piece of paper. “Read it. If you agree to it,\nthen we can get married.”"
      },
      {
        "paragraph": "Rodney opened it up to read it."
      },
      {
        "paragraph": "After marriage, Rodney is not allowed to touch Freya. Both parties are married in name only."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "If Rodney has an extramarital affair in the future, Freya will not ask for any money or property."
      },
      {
        "paragraph": "However, the child will stay with Freya."
      },
      {
        "paragraph": "After the divorce, Rodney must pay for child support."
      },
      {
        "paragraph": "The marriage will be for three years. If Freya asks for a divorce, Rodney must agree."
      },
      {
        "paragraph": "Rodney is not allowed to have any extramarital affairs within these three years. If he wants to cheat,\nFreya will definitely agree as long as they divorce first."
      },
      {
        "paragraph": "Rodney is not allowed to meet or have anything going on with Sarah Neeson. If Freya finds out, they will\ndivorce immediately regardless of whether three years have passed or not."
      },
      {
        "paragraph": "Rodney must accompany the child for one hour every day, unless he’s on business trips."
      },
      {
        "paragraph": "After marriage, Rodney will cook."
      },
      {
        "paragraph": "After marriage, Rodney must respect the woman’s parents."
      },
      {
        "paragraph": "What… the hell was this?"
      },
      {
        "paragraph": "Rodney’s mouth twitched as he almost vomited blood. “This is unfair. Why is it all about me cheating?\nWhat if you cheat instead?”"
      },
      {
        "paragraph": "“I won’t cheat. I’m not a scumbag like you, ” Freya interrupted him. “Women think about problems with\nour hearts and brains, but you men think about problems with your lower body. It’s different.”"
      },
      {
        "paragraph": "“… Enough with the personal attacks.” Rodney got angry. “Also, why do I have to agree if you ask for a\ndivorce? It seems you’re the sole decision-maker in this marriage.”"
      },
      {
        "paragraph": "“It’s good that you know.” Freya nodded. “I’m adding those conditions because we have no emotional\nfoundation. Life is too long, so who knows if you or I will fall in love with another person in the future? In\nthree years, your uncle’s position as prime minister will be stable, so we can"
      },
      {
        "paragraph": "divorce at that time.”"
      },
      {
        "paragraph": "“But the child will only be two years old. It won’t be good for the child if her parents divorce, ” Rodney\nargued."
      },
      {
        "paragraph": "Freya was silent."
      },
      {
        "paragraph": "Rodney immediately said, “Yes, we don’t have an emotional foundation now, but that doesn’t mean we\nwon’t have one in the future. We’ll be living together every day from now on. What if… What if I develop\nfeelings for you…”"
      },
      {
        "paragraph": "Freya looked at him with astonishment, and Rodney felt his face heat up in embarrassment due to her\nbright eyes. “What I mean is… Look, I’m so handsome, and you’re beautiful. Maybe I’ll be a good\nhusband and a good father after marriage. I just don’t think we should have ideas about divorcing before\nwe even get married. We should work hard together for the child’s sake. If we really can’t do it, we can\ngive up then."
      },
      {
        "paragraph": "“ .. Fine. ” Freya hesitated before nodding. “We’ll divorce if we’re unable to have feelings for each other.”"
      },
      {
        "paragraph": "“Okay.” Rodney was overjoyed. He coughed into his fist and said, “ Since we’ll be trying to have feelings\nfor each other for the sake of the child, then I think"
      },
      {
        "paragraph": "… we still have to be intimate. See, many couples grow their feelings in bed—”"
      },
      {
        "paragraph": "“In your dreams! ” Freya snapped back to her senses and interrupted him with a red face. “ Rodney\nSnow, you’re a hoodlum.”"
      },
      {
        "paragraph": "“I’m just telling the truth, ” Rodney muttered, “It’s appropriate…”"
      },
      {
        "paragraph": "“No.” Freya looked away. “… I can’t do it without feelings.”"
      },
      {
        "paragraph": "“Fine.” Rodney was despondent. He felt that he was too miserable. After abstaining for several decades,\nhe still had to abstain after marriage."
      },
      {
        "paragraph": "Forget it. He would help the Snow family get through this crisis first."
      },
      {
        "paragraph": "“Then I’ll go downstairs and talk to my parents. After lunch, we’ll let the officials come over and process\nthe formalities for us,” Rodney said in a low voice."
      },
      {
        "paragraph": "“… Okay.”"
      },
      {
        "paragraph": "Freya resigned herself to fate. In any case, she had to get married sooner or later. She just did not have\nthe time to give her parents a call."
      },
      {
        "paragraph": "“Put your hand out. I’ll put the ring on you.” Rodney took out the ring."
      },
      {
        "paragraph": "“No need…”"
      },
      {
        "paragraph": "“What kind of marriage doesn’t have a ring?” Rodney grabbed her hand and slid the ring on her ring\nfinger. It was a perfect fit."
      },
      {
        "paragraph": "Freya looked down at the ring on her hand. It was quite beautiful and she actually liked it. No woman\nwould dislike rings. “Let me ask you, was Sarah’s bigger or is mine?”"
      },
      {
        "paragraph": "“Why do you keep comparing everything to Sarah?” Rodney felt depressed. “Can you mention that name\nless in the future? It’s like there’s a ghost haunting us.”"
      },
      {
        "paragraph": "“Answer my question. ” Freya snorted and planted her hands on her hips."
      },
      {
        "paragraph": "“Yours is bigger. Yours is nine carats.” Rodney was secretly relieved. Fortunately, Wendy had told him to\nbuy the biggest one when he went to buy it."
      },
      {
        "paragraph": "“Okay, you can leave now.” Only then did Freya smile in satisfaction and wave her hand."
      },
      {
        "paragraph": "The corners of Rodney’s mouth curved upward. He quickly went down to tell his parents about the happy\nnews."
      },
      {
        "paragraph": "In the afternoon, the people from the city hall personally came over to register their marriage."
      },
      {
        "paragraph": "It did not take long for the certificate to fall into Freya’s hands."
      },
      {
        "paragraph": "Everyone in the Snow family was overjoyed. Jason even gifted her a villa. “This will be Rodney’s and\nyour house in the future. It’s not far from here, and it’s 1,500 square meters. There are two servants\nthere too.”"
      },
      {
        "paragraph": "Freya felt that the real estate certificate in her hand was too heavy. The people living in that\nneighborhood were powerful and noble, so it was a place in the capital with the best security. The land\nthere was extremely expensive, and a villa there would cost at least a few billion dollars."
      },
      {
        "paragraph": "“Jason has given you a house, but I don’t know what I can give you. I’ll just give you a washboard.”\nWendy smiled and handed the board over. “If"
      },
      {
        "paragraph": "Rodney makes you angry, make him kneel on it. If he refuses to kneel, you can just call me.”"
      },
      {
        "paragraph": "“Mom…” Rodney became unhappy."
      },
      {
        "paragraph": "“Thank you, Aunty. I like this gift very much.” Freya smiled brightly."
      },
      {
        "paragraph": "“Aunty? You should call me ‘Mom’ now.” Wendy"
      },
      {
        "paragraph": "stroked her head, in a good mood. Her wish was finally fulfilled."
      },
      {
        "paragraph": "4:00 p.m."
      },
      {
        "paragraph": "Jason took the two of them to Snow Corporation to hold a press conference."
      },
      {
        "paragraph": "Since this matter involved the future prime minister, most journalists from the country were in attendance."
      }
    ]
  },
  {
    "title": "Chapter 1391 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Chairman Snow, why are you here? Where’s Minister Snow? Is he not planning to explain the case of\nhis goddaughter bullying others?”"
      },
      {
        "paragraph": "“Does Freya Lynch intend to apologize? But what’s the point of apologizing? She caused Jackson\nCorporation’s share price to fall for several days. Billions have evaporated from the stock market.”"
      },
      {
        "paragraph": "“I heard that Miss Lynch dated President Jackson from the Jackson Corporation previously. Later on, she\nproposed to break up. But when she saw Patrick Jackson get a new girlfriend, she became unhappy and\nthreatened Patrick that if he did not break up with his girlfriend, she would target Jackson Corporation.”"
      },
      {
        "paragraph": "“ I also heard that Young Lady Snow wants to deal with Jackson Corporation and the Shelby family. Is\nthis true?”"
      },
      {
        "paragraph": "“The Snow family has to apologize for this matter.”"
      },
      {
        "paragraph": "“Didn’t the Snow family expel Rodney Snow from the family not long ago? Why is he back so quickly?\nWas the Snow family just putting on a show?”"
      },
      {
        "paragraph": "Some reporters had been bribed by Nathan’s competitors and asked a series of humiliating questions."
      },
      {
        "paragraph": "However, Jason was a person who had experienced a lot in life. He remained calm from start to finish."
      },
      {
        "paragraph": "After more than ten minutes, the reporters’ throats became hoarse from yelling. They finally could not\nhold back and said, “Why aren’t you answering any of our questions? Are you guilty?”"
      },
      {
        "paragraph": "“Have you given us the opportunity to answer? ” Jason’s sharp eyes fell on the reporters. It was just one\nlook and one sentence, but it made the reporters tremble."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“I’m holding a press conference today because this incident is getting bigger and bigger. It has brought a\nlot of trouble to the Snow family, ” Jason said faintly, “I came here today with my son and daughter-in-law\nto apologize.”"
      },
      {
        "paragraph": "“So you admit that you were wrong, and you admit that the Snow family was indeed bullying others?” the\nreporters immediately piped up again."
      },
      {
        "paragraph": "“It’s indeed wrong to beat people up.” Jason frowned. “But I believe that anyone will get angry if they see\ntheir four-month pregnant wife get slapped.”"
      },
      {
        "paragraph": "The reporters were in an uproar. “What does that mean? Miss Lynch is pregnant? When did Rodney\nSnow become her husband?”"
      },
      {
        "paragraph": "Jason gave Rodney a look, and Rodney stood up. “I believe everyone knows that during Osher\nCorporation’s product launch banquet, someone plotted against Freya and me, leading to us spending\nthe night together. I didn’t expect her to get pregnant that night and only found out about it recently. I’ve\nalready broken up with Sarah Neeson, and Freya is currently my wife."
      },
      {
        "paragraph": "“Yesterday, I was delivering something to her when I saw her getting slapped by Patrick Jackson. My\nmind went blank from anger. She’s four months pregnant, and there was a time when she nearly\nmiscarried. The Snow family has been very cautious during this time, but… I’m sorry.”"
      },
      {
        "paragraph": "He bowed and said, “As for me hitting Linda Shelby, it’s true that I hit her. She was standing in front of\nPatrick and I couldn’t control my anger at that time.”"
      },
      {
        "paragraph": "The reporters were dumbfounded. No one expected Freya to be pregnant."
      },
      {
        "paragraph": "”That’s impossible. She doesn’t look like she’s four months pregnant at all. ” Some reporters raised their\ndoubts."
      }
    ]
  },
  {
    "title": "Chapter 1392 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“These are the receipts for the pregnancy check- ups and related examinations. She’s been going for\nmaternity check-ups every month.”"
      },
      {
        "paragraph": "Rodney projected the pregnancy reports directly on the big screen behind him. “What would you do if\nyou saw your four-month pregnant wife get beaten? I admit that I was impulsive, and I apologize. But in\nthat kind of situation, I couldn’t help but lose my rationality.”"
      },
      {
        "paragraph": "The reporter said, “But as far as we know, Miss Lynch targeted Jackson Corporation first."
      },
      {
        "paragraph": "Otherwise, Linda Shelby wouldn’t have gone to trouble Miss Lynch. Also, she went on her knees to beg,\nbut Miss Lynch was indifferent and arrogant.”"
      },
      {
        "paragraph": "Freya frowned. “I believe you all must have watched the video. In that case, you should know that I’ve\nnever touched Linda from beginning to end. She suddenly appeared, knelt in front of me unprovoked,\nand begged me. I was confused."
      },
      {
        "paragraph": "Frankly speaking, I don’t know her well and we don’t have a good relationship. Why should I talk to her? I\nfelt sick just by hearing her voice, so I wanted to leave directly. She was the one who kept clinging to\nme.”"
      },
      {
        "paragraph": "“Aren’t you going too far?” a reporter accused her."
      },
      {
        "paragraph": "“Do I have to pretend to be full of goodwill toward a person like Linda? Like is like, and hate is hate."
      },
      {
        "paragraph": "When Patrick and I were dating, Linda hung around us constantly using her identity as Patrick’s\nchildhood friend. Have you ever experienced what it’s like to have your boyfriend bring along another girl\nwhen you two are shopping, watching movies, going out on a date, and having meals together?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Freya said with a hint of disgust, “I broke up with Patrick because I couldn’t stand it. I believe many\nemployees in the Melbourne branch of Jackson Corporation can attest to this. When Patrick and I were\ndating, Linda stuck to Patrick all the time Sorry, but I’m not that magnanimous. I hate this woman.”"
      },
      {
        "paragraph": "“So you targeted Jackson Corporation because you hate her?” the reporter asked sharply."
      },
      {
        "paragraph": "Jason picked up another report. “We’ve asked the supervision department about this. A number of hot-\nselling products by Jackson Corporation contain acrylamide. The supervision department is investigating\ntheir company because the composition exceeds the international standards. At the same time, the\nsugar content also exceeds the standard."
      },
      {
        "paragraph": "“ If you don’t believe me, you can look at this lab test. This is a serious matter, so Jackson Corporation\nwas asked to stop production and rectify the problem. However, Jackson Corporation insisted on\nopening a branch in the capital. As Patrick doesn’t have the ability to solve this crisis, he framed Freya\nand said that she was targeting him. He wanted to use Freya to help Jackson Corporation through this\ncrisis.”"
      },
      {
        "paragraph": "The reporters looked at each other."
      },
      {
        "paragraph": "Jason’s gaze swept through the group of reporters one by one. “ It’s indeed wrong to beat people, and\nthe Snow family apologizes for that. But where did the rumors on the internet about Freya using her\nstatus to bully others come from? The Snow family will take legal action against those who dare to\nslander our reputation. The press conference today ends here.”"
      },
      {
        "paragraph": "He turned off the microphone and left with Rodney and Freya."
      },
      {
        "paragraph": "The press conference had been broadcasted live."
      },
      {
        "paragraph": "The people on the internet were talking about it like crazy."
      },
      {
        "paragraph": "[Holy cow, Freya is four months pregnant! I couldn’t tell at all. She’s still so beautiful at four months.]"
      },
      {
        "paragraph": "[Please, that’s not the point, okay? The point is that Freya never targeted Jackson Corporation at all.]"
      },
      {
        "paragraph": "[Did you see the urgent notice that the supervision department released just now? There really is\nsomething wrong with Jackson Corporation’s biscuits. Don’t buy them in the future.]"
      },
      {
        "paragraph": "[I used to work in Jackson Corporation. Patrick and Linda’s relationship is exactly how Freya described it.\nAt that time, although everyone knew he was dating Freya, he would come to work and get off work with\nLinda every day. Many newcomers in the company misunderstood that they were the ones in a\nrelationship instead.]"
      },
      {
        "paragraph": "[It’s not just going to and getting off work. I often saw Patrick shopping with Linda back then. I was\nalready confused at that time. I was wondering if Freya truly did not mind it.]"
      }
    ]
  },
  {
    "title": "Chapter 1393 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "[I went to university with Patrick and Freya. I can testify that Freya was really good to Patrick. She was\nsubservient to him, but he was always indifferent to her. One day, when Freya got sick, I watched her get\nan infusion alone.]"
      },
      {
        "paragraph": "[On Patrick’s birthday, Freya called many alumni to celebrate his birthday together, but he didn’t even\nshow up.]"
      },
      {
        "paragraph": "[That’s nothing. When Patrick was supposed to meet with Freya’s parents to talk about their marriage, he\nran to meet Linda instead. As a result, he stood Freya’s parents up and made them wait for two hours.]"
      },
      {
        "paragraph": "[Holy sh*t, is that true? He’s such a scumbag. He can compete with Wesley Lyons.]"
      },
      {
        "paragraph": "[Wesley is a despicable man with no morals. Patrick is a scumbag who wasted Freya’s youth.]"
      },
      {
        "paragraph": "Catherine replied to Netizen A: [Patrick has never realized how scummy he is. He thinks that Freya\nshouldn’t mind Linda’s existence. He dated Freya for five years, but the person who traveled with"
      },
      {
        "paragraph": "Freya was me, the person she usually ate with was me, the person she watched movies with was me,\nthe person who went shopping with her was also me. He never did anything for Freya. He accompanied\nLinda for everything and would still complain that Freya wasn’t good enough. Hah. Does he think that\nFreya would still have old affections for him? In his dreams!]"
      },
      {
        "paragraph": "[OMG. Catherine replied to me. Am I dreaming?] [Catherine and Freya are best friends.]"
      },
      {
        "paragraph": "[I finally understand why Freya ignored Linda. If it were me, I might have gotten physical. I suddenly feel\nthat Freya has a good temper.]"
      },
      {
        "paragraph": "Shaun replied to Catherine: [I support you, babe. Yes, Patrick Jackson is not good. He’s trash.]"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine replied to Shaun: [Hmph. He used Freya to cut ties with me, saying that I encouraged them to\nbreak up. If I could do it again, I wouldn’t just encourage her to break up with him. I’d have provoked him\ntoo.]"
      },
      {
        "paragraph": "Shaun replied to Catherine: [Let me do that kind of thing. Don’t wear out your hands.]"
      },
      {
        "paragraph": "The netizens: [Ugh, Eldest Young Master Hill is flirting with Miss Jones again.]"
      },
      {
        "paragraph": "On the other side."
      },
      {
        "paragraph": "In Jackson Corporation."
      },
      {
        "paragraph": "Patrick’s father and mother rushed to the capital as soon as they learned of the press conference by the\nSnow family."
      },
      {
        "paragraph": "When Mr. Jackson saw Patrick, the first thing he did was give him a fierce slap. “You imbecile! You were\nstupid enough to be the pawn of those bigwigs fighting against Nathan Snow. Who do you think you are?\nYou actually dare to go against the Snow family and the future prime minister?! Are you out of your\nmind?”"
      },
      {
        "paragraph": "Patrick’s head buzzed from the slap."
      },
      {
        "paragraph": "He never thought that Freya would be pregnant. She was pregnant and married?"
      },
      {
        "paragraph": "For some reason, the moment he learned of that, his mind became painfully blank."
      },
      {
        "paragraph": "“Uncle…” Linda rushed over and stood in front of Patrick. “Don’t blame Patrick. Freya really did target\nJackson Corporation, but they’re wealthy and powerful, so they refuse to admit it. Yesterday at the police\nstation, Jessica Snow also warned that she won’t let the Jackson and Shelby families go. Patrick was\ndesperate and had no choice.”"
      },
      {
        "paragraph": "“Shut up! ” Mr. Jackson used to have a good impression of Linda. After all, their families had good\nrelations, but when he saw the comments on the internet, he could not help but hate her now. Patrick\nand Freya were about to get married back then, but they broke up because of her."
      },
      {
        "paragraph": "Under Forrest’s leadership, Lynch Corporation flourished and even far surpassed Jackson Corporation. If\nnot for Linda, the Jackson and Lynch families would have been joined by marriage."
      },
      {
        "paragraph": "As for Jackson Corporation, what awaited them might be the end."
      }
    ]
  },
  {
    "title": "Chapter 1394 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Uncle…” Linda’s body shook as her eyes overflowed with tears."
      },
      {
        "paragraph": "“Dad, don’t blame Linda. It was my choice,” Patrick said feebly."
      },
      {
        "paragraph": "Mr. Jackson said furiously, “Those bigwigs planted false evidence against the future prime minister. Do\nyou think the Snow family will just let it go? Jason Snow already said that they’ll pursue it to the end. The\npeople competing against Nathan Snow will immediately go into hiding and push you out to be the\nscapegoat. Do you think it’s as simple as Jackson Corporation’s ruin? The Snow family has every reason\nto say that you’re the mastermind."
      },
      {
        "paragraph": "You’ve caused so much trouble for the Snow family this time. They’ll never let you off."
      },
      {
        "paragraph": "“Nathan Snow will use you as an example for the others and warn the outside world that the Snow family\nisn’t easy to mess with. Not anyone can provoke the Snow family.”"
      },
      {
        "paragraph": "Patrick’s body trembled."
      },
      {
        "paragraph": "Mrs. Jackson also cried. “Son, you’re so foolish!"
      },
      {
        "paragraph": "How is our family supposed to fight against the Snow family…”"
      },
      {
        "paragraph": "As soon as those words fell, a large group of police officers came in from outside."
      },
      {
        "paragraph": "“Excuse me, we received a report from the Snow family that Patrick Jackson hired people online to\nsmear and frame Minister Snow and his daughter. Patrick Jackson, you’re under arrest.”"
      },
      {
        "paragraph": "An officer cuffed Patrick’s hands behind his back."
      },
      {
        "paragraph": "“I didn’t! ” Patrick completely panicked."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Do you dare to say that you weren’t the one who uploaded the video?”"
      },
      {
        "paragraph": "The officer asked sharply, “It’s because you uploaded the video that the outside world began to think that\nMinister Snow allowed his family to bully others. When the matter grew worse, you kept silent and let the\nnetizens scold the Snow family, which is the same as tacitly agreeing to their words. At the same time,\nyou found people to spread rumors that Freya Lynch privately retaliated"
      },
      {
        "paragraph": "against Jackson Corporation. The IP address led us back to your company.”"
      },
      {
        "paragraph": "Patrick’s heart chilled."
      },
      {
        "paragraph": "He admitted that he had tacitly agreed with the insults from the netizens, but he never got anyone to\nspread rumors."
      },
      {
        "paragraph": "He subconsciously looked at Linda."
      },
      {
        "paragraph": "Linda’s heart trembled. She cried and looked at the police. “We didn’t. This is a false accusation.”"
      },
      {
        "paragraph": "The officer sneered, “Enough. It’s the Snow family’s false accusation that there’s a problem with Jackson\nCorporation’s products, and it’s the police’s false accusation that you slandered the Snow family…”"
      },
      {
        "paragraph": "“That’s not what she meant… ” Patrick hurriedly explained."
      },
      {
        "paragraph": "“Take him away.” Two officers directly dragged Patrick out."
      },
      {
        "paragraph": "“Patrick… ” Mrs. Jackson cried anxiously. “What are we supposed to do now? Dear, think of a way. We\nhave to save Patrick.”"
      },
      {
        "paragraph": "Mr. Jackson clenched his fist. “How are we supposed to save him? Who will dare to offend the Snow\nfamily to save him now? Linda, what the hell were you doing? Why didn’t you stop Patrick from doing\nsuch a thing?”"
      },
      {
        "paragraph": "Linda went pale with fright. Not only did she not stop him, but she actually instigated the matter."
      },
      {
        "paragraph": "She was just miffed that Freya became Nathan’s goddaughter. She thought that if Nathan’s reputation\nwas ruined, Freya would not have a good time either."
      },
      {
        "paragraph": "“We’ll go… and beg Freya. ” After a long time, Mr. Jackson let out a heavy sigh."
      },
      {
        "paragraph": "“Then… why don’t we tell Linda to apologize?” Mrs. Jackson asked tentatively."
      },
      {
        "paragraph": "“What’s the point of telling her to go? So she can kneel? Or cling to Freya’s hand and refuse to let g o?”\nMr. Jackson flung his hand and left."
      },
      {
        "paragraph": "Mrs. Jackson followed him. After they left the office, she said to her husband, “You went too far just now.\nI know you’re angry at Linda, but if Jackson Corporation really collapses, Patrick will only be able to\ncount on the Shelby family.”"
      }
    ]
  },
  {
    "title": "Chapter 1395 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Don’t you get it? The Snow family won’t let the Jackson family off, and they won’t let the Shelby family\noff either. Besides… We’ll talk about it if Patrick gets released. What I’m worried about is that… the Snow\nfamily won’t let him off.” Mr. Jackson sighed heavily."
      },
      {
        "paragraph": "Mrs. Jackson froze."
      },
      {
        "paragraph": "In the Snow residence."
      },
      {
        "paragraph": "Freya had just finished her dinner at the large round table when Jessica received a call and said to\nNathan, “Uncle, Patrick Jackson has been arrested.”"
      },
      {
        "paragraph": "“Hm.” Nathan frowned deeply and took a sip of tea. “How’s the situation with the Kramer family?”"
      },
      {
        "paragraph": "“Minister Kramer is claiming to be sick and is not meeting any guests. He has taken a few days off,”\nJessica said faintly, “I’m guessing he’ll behave himself with his tail tucked between his legs for now.”"
      },
      {
        "paragraph": "“He’ll tuck his tail between his legs for a short while and then resurface to give me a hard time again?”\nNathan looked at Ryan. “I originally thought of letting Minister Kramer enjoy his life in retirement, but it\nseems there’s no need for that. Rid the Kramer family of all their positions within two days. They can be\ndisposed of.”"
      },
      {
        "paragraph": "“Okay.” Ryan nodded with a sharp look on his handsome face that Freya had never seen before."
      },
      {
        "paragraph": "Freya was stunned. Nathan was always kind in front of her, so much so that she had almost forgotten\nthat no one in politics would be that simple."
      },
      {
        "paragraph": "“As for Patrick…” Nathan smiled and glanced at Freya. “Since he offended our family’s little princess, let\nhim spend the rest of his life in jail.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Freya drew in a cold breath. “For life?”"
      },
      {
        "paragraph": "Ryan looked at her. “ Since he dared to go against the Snow family, he should be prepared for the worst.\nBesides, if we don’t teach him a fatal lesson, how will other people know to treat the Snow family with\nrespect?”"
      },
      {
        "paragraph": "“The Snow family always had a good reputation, but it was almost ruined by Patrick Jackson. ” Old\nMaster Snow nodded to agree with Ryan’s words."
      },
      {
        "paragraph": "Freya’s red lips moved, but in the end, she did not know what to say."
      },
      {
        "paragraph": "She hated Patrick, but not so much that she wanted him to rot in prison for the rest of his life."
      },
      {
        "paragraph": "However, he had offended the future prime minister, whose authority would not tolerate being offended."
      },
      {
        "paragraph": "“By the way, Rodney,” Wendy suddenly said,“ Since you’re married now, you should accompany Freya\nback to Melbourne and meet your parents-in- law. Go tomorrow.”"
      },
      {
        "paragraph": "“Okay. ” Rodney nodded obediently and looked at Freya. “Um… Shaun and Chester heard that I got\nmarried and asked me to treat them at the club this evening.”"
      },
      {
        "paragraph": "“Mmh.”"
      },
      {
        "paragraph": "Freya hummed in acknowledgment. If he wanted to go, then he should just go. Why was he telling her\nthis?"
      },
      {
        "paragraph": "Rodney felt a little uncomfortable with her indifferent attitude. “I’m just telling you in case you think that\nI’m going to see Sarah.”"
      },
      {
        "paragraph": "“If you dare to see Sarah again, I’ll break your legs,” Jason warned him."
      },
      {
        "paragraph": "Rodney’s legs trembled as he smiled. “I have nothing to do with her anymore.”"
      },
      {
        "paragraph": "After dinner, Rodney drove to the clubhouse."
      },
      {
        "paragraph": "Chester arrived first and was sitting on the sofa alone. He was playing with the lighter in his hand\nthoughtfully."
      },
      {
        "paragraph": "“What are you thinking of? You’re lost in thought.” Rodney sat next to him. “Where’s Shaun?”"
      },
      {
        "paragraph": "“He should be on the way. When I called an hour ago, he said he would come after playing basketball\nwith his kids. He should be on the road now,” Chester answered casually."
      },
      {
        "paragraph": "Rodney was speechless. “What’s the big deal about having a woman and kids? But… hehe. I have a\nwoman and a kid too now. Chester, only you and Chase are still unmarried. Well, good luck.”"
      },
      {
        "paragraph": "“I don’t envy those who are married, ” Chester said faintly."
      },
      {
        "paragraph": "“That’s true. You’d rather hang yourself on a tree, ” Rodney teased."
      },
      {
        "paragraph": "“You seem quite happy about your marriage. When we asked you to marry Freya before, you acted as if\nyou would rather die.” Chester glanced at him and gave him a vague smile."
      }
    ]
  },
  {
    "title": "Chapter 1396 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Am I happy?” Rodney looked confused. “I’m not. ”"
      },
      {
        "paragraph": "Chester snorted. Rodney’s face was full of pride, but he did not notice it himself."
      },
      {
        "paragraph": "“I just feel like… you know, people have to get married sooner or later. Even if I don’t marry Freya, my\nmom will keep arranging blind dates for me. At least Freya is carrying my child. She’s beautiful and\ntalented. My family likes her very much as well, so she’s a good marriage partner,” Rodney mulled over it\nand said."
      },
      {
        "paragraph": "“Congratulations. But if it were not for this incident with Patrick, Freya wouldn’t have married you.”\nChester smirked. “You got the good end of the bargain.”"
      },
      {
        "paragraph": "“Don’t say that. I’m not bad either.”"
      },
      {
        "paragraph": "Rodney had just finished speaking when the door of the room was pushed open. Shaun came in with his\nhands in his pockets. “What are we talking about? Hurry up and get it over with. I want to go home to my\nwife and kids.”"
      },
      {
        "paragraph": "“You can’t even do it. What’s the point of going back?” Rodney attacked him mercilessly."
      },
      {
        "paragraph": "Shaun’s expression darkened. “ Rodney Snow, do you want to die?”"
      },
      {
        "paragraph": "Chester smiled. “He got married today, so cut him some slack. Come, Rodney, cheers. I wish you a\nhappy wedding night! ”"
      },
      {
        "paragraph": "Rodney stiffened."
      },
      {
        "paragraph": "Chester secretly whispered in his ear, “A woman’s pregnancy is stable after three months. It hasn’t been\neasy for you. You only did it once in the 3o years of your life, and you didn’t do it in a state of"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "consciousness either. Do you… want me to teach you a few tricks?”"
      },
      {
        "paragraph": "“Get out!” Rodney jumped up with a red face."
      },
      {
        "paragraph": "“We’re all men here. What’s there to be ashamed of?” Chester did not know whether to laugh or cry."
      },
      {
        "paragraph": "Rodney wanted to cry. “You think too much. Before we got married, Freya signed an agreement with me.\nI’m not allowed to touch her after marriage. We’re only a couple in name.”"
      },
      {
        "paragraph": "Shaun was happy at his misfortune. “That’s nice.” “Nice my *ss! I’m a normal man—”"
      },
      {
        "paragraph": "“Haven’t you been living like this the entire time anyway? Just don’t touch her.” Chester smiled."
      },
      {
        "paragraph": "“No. I wasn’t married before, but now that I am, this kind of thing is justified. Why can’t I touch her?”\nRodney could not accept this. “Help me think of a way.”"
      },
      {
        "paragraph": "“There’s nothing to think of. She’s pregnant now, so you can’t use force since it’ll hurt the child.” Chester\ngave him three words, “Hold it in.”"
      },
      {
        "paragraph": "Rodney, “….”"
      },
      {
        "paragraph": "He angrily took a large gulp from his glass."
      },
      {
        "paragraph": "Shaun also slowly drank two to three glasses. He did not dare to drink too much for fear of getting drunk."
      },
      {
        "paragraph": "At g:oo p.m., he was going to leave."
      },
      {
        "paragraph": "“Damn it, Shaun. You’re so boring. ” Rodney was chagrined. “Today is my wedding day, but you’re going\nback so early.”"
      },
      {
        "paragraph": "“You can learn from me. Get used to accompanying your wife and child.” Shaun smirked and left coolly."
      },
      {
        "paragraph": "When he returned home, Catherine was still"
      },
      {
        "paragraph": "reading stories to the two children."
      },
      {
        "paragraph": "He climbed onto the bed and hugged her from behind. “Cathy, I’m drunk.”"
      },
      {
        "paragraph": "Suzie looked at him with disgust. “ Ugh, scummy dad, you’re so shameless. You’re an adult but you’re\nstill acting all pampered.”"
      },
      {
        "paragraph": "“Shame on you!” Lucas also spat out these three words. “What do you two know? It’s natural to act like\nthis to one’s wife.” Shaun hugged Catherine without letting go, making the kids feel goosebumps rising\nall over their bodies from his lovey-dovey side."
      }
    ]
  },
  {
    "title": "Chapter 1397 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine blushed a little at his shamelessness. “ Freya and Rodney are going back to Melbourne\ntomorrow. I’m planning to go back with them."
      },
      {
        "paragraph": "Tomorrow is my grandmother’s birthday, so I want to go and pay my respects to her.”"
      },
      {
        "paragraph": "“Why didn’t you tell me earlier?” Shaun frowned. “ Hadley has already arranged my itinerary for the\nnext two days…”"
      },
      {
        "paragraph": "“It’s fine. I can go back by myself. Freya will be with me…” Catherine consoled him."
      },
      {
        "paragraph": "“ She’s her, and I’m me. It’s different. Besides, it’s our grandmother. Of course, I should go with you. ”\nShaun buried his face in her neck."
      },
      {
        "paragraph": "“Ahem. Can you pay attention to your surroundings? There are two innocent children here.” Suzie\nplanted her hands on her hips."
      },
      {
        "paragraph": "Lucas frowned. “You’re taking up all of Mommy’s time now. She finally has some free time today, but\nyou want to cling to her again. Can’t you share her with us a little?”"
      },
      {
        "paragraph": "“Yeah, ” Suzie complained, “If I had known that you’d be so clingy, I would never have supported you\ntwo in getting back together.”"
      },
      {
        "paragraph": "Shaun’s face was filled with depression and embarrassment at the children’s words."
      },
      {
        "paragraph": "“Pfft.” Catherine could not help but laugh. She pushed Shaun away and took the two children into her\narms."
      },
      {
        "paragraph": "“Mommy, can we go with you?” Suzie acted pampered."
      },
      {
        "paragraph": "“No, you’re still in danger now.” Catherine shook her head. “I’ll be back in two days.”"
      },
      {
        "paragraph": "After a pause, she turned back to Shaun. “You don’t have to stick to me all day. Sometimes, distance is\nnice as well.”"
      },
      {
        "paragraph": "“Are you… tired of me?” Shaun suffered a blow."
      },
      {
        "paragraph": "Catherine shrugged. “I see your face every day. I can’t even see what’s handsome about you\nanymore.”"
      },
      {
        "paragraph": "Shaun’s charming face immediately darkened."
      },
      {
        "paragraph": "Suzie and Lucas laughed happily, especially Suzie. “ Scummy dad, Mommy is right. I thought you were"
      },
      {
        "paragraph": "handsome before, but after looking at you so much, I don’t feel anything anymore. Your face has lost its\nappeal.”"
      },
      {
        "paragraph": "Shaun wanted to vomit blood. He had always been confident in his own appearance, so he did not\nexpect to suffer a blow from his wife and daughter."
      },
      {
        "paragraph": "Forget it. Sometimes, a little distance was needed."
      },
      {
        "paragraph": "“Okay, I’ll agree to you going, Cathy, but you have to come back on time. Don’t keep me waiting alone\nfor too long,” Shaun said with a helpless face."
      },
      {
        "paragraph": "“You seem to be mistaken. I don’t need your permission to go anywhere. I’m just informing you,”\nCatherine reminded him with a grin."
      },
      {
        "paragraph": "Shaun was sullen. “You’re right. In this family, you have the final say.”"
      },
      {
        "paragraph": "“Mommy, you’re amazing.” Suzie and Lucas doggedly praised her."
      },
      {
        "paragraph": "It was normal for Suzie to say something like that, but not Lucas. Catherine glanced at Lucas. Although\nthe child was still cold and aloof, after she and Shaun got back together, he seemed to have become a\nlittle more cheerful."
      },
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "Shaun personally drove Catherine to the airport."
      }
    ]
  },
  {
    "title": "Chapter 1398 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rodney and Freya had already arrived. When they saw Catherine, Freya immediately went over to take\nher hand. “Cathy! With you around, going back to Melbourne won’t be so boring this time. Stay in our\nhouse tonight.”"
      },
      {
        "paragraph": "“Oh, sure. I don’t have a place to stay in Melbourne anyway.” Catherine smiled."
      },
      {
        "paragraph": "“Look after my woman,” Shaun looked at Rodney and instructed him."
      },
      {
        "paragraph": "“I got it. But when it comes to your woman, it’s more likely that she’ll look after me,” Rodney said in a\nlow voice, “Honestly, why did you agree to let Catherine come with us?”"
      },
      {
        "paragraph": "“You don’t welcome her?” Shaun was unhappy. “ It’s your honor to have her go with you.”"
      },
      {
        "paragraph": "Rodney was exasperated. “Enough. Catherine is a treasure in your heart, but she isn’t in mine. Don’t\nyou know that she’s the third wheel here? I planned to… make use of this opportunity so that Freya\nand I could get to know each other better. Maybe we could…”"
      },
      {
        "paragraph": "He paused as his handsome face turned slightly red."
      },
      {
        "paragraph": "Shaun glanced at him in disdain. “Don’t worry, even if Cathy weren’t going with you, it’ d still be\nimpossible. Stop dreaming.”"
      },
      {
        "paragraph": "Rodney, whose parade was rained upon, did not want to bother with Shaun anymore."
      },
      {
        "paragraph": "“Cathy, be careful. ” Shaun walked up to Catherine and touched her little face. He warned, “Stay away\nfrom other men.”"
      },
      {
        "paragraph": "“Save that line for yourself.”"
      },
      {
        "paragraph": "Catherine tossed the words back to him and walked hand in hand with Freya to the departure gate."
      },
      {
        "paragraph": "Shaun narrowed his eyes at the sight of her and Freya holding hands, his heart feeling a little\nuncomfortable. He did not like it when she held hands with others, even if the person was a woman."
      },
      {
        "paragraph": "On the plane, Freya and Catherine sat together. The two women whispered and chattered, seemingly\nhaving endless topics to talk about."
      },
      {
        "paragraph": "Rodney sat behind them, and the women ignored him. Feeling bored, he simply closed his eyes and\nslept all the way to Melbourne."
      },
      {
        "paragraph": "The plane landed at Melbourne Airport."
      },
      {
        "paragraph": "Forrest had been waiting for a long time, dressed in a full suit. When he saw Rodney, his handsome\nface was full of indifference. “Young Master Snow, you can be left to your own devices here. You don’t\nhave to come to the Lynch family. Everyone knows that you only married my little sister because you\nwere forced to, so it’s unnecessary to try and please your father and mother-in-law. Both parties will\njust feel troubled.”"
      },
      {
        "paragraph": "Rodney looked embarrassed. It was his fault. When he had dinner with the Lynch family the previous\ntime, he still had Sarah in his heart so his attitude back then was not very good. “Even if we were\nforced to get married, it’s a fact that we’re married. The whole country knows about it. If I’ m here in\nMelbourne but don’t visit the Lynch family, you’ll also be embarrassed when the news spreads.”"
      },
      {
        "paragraph": "“You’ve already caused the Lynch family to be embarrassed multiple times. ” Forrest did not look happy\nat all."
      },
      {
        "paragraph": "Rodney touched his nose. “No matter how much you don’t welcome me, I still have to do my duties. My\nparents prepared a lot of betrothal gifts, so I have to deliver them to the Lynch family.”"
      },
      {
        "paragraph": "Forrest glanced at him coldly before turning around to take Freya by the shoulders. “Let’s go home."
      },
      {
        "paragraph": "Catherine, stay with us for a few days.”"
      },
      {
        "paragraph": "“I have to go to the cemetery now to pay respects to my grandparents.” Catherine refused with a smile."
      },
      {
        "paragraph": "“Then I’ll arrange for a car to send you there…”"
      },
      {
        "paragraph": "“There’s no need. The branch office has arranged a car to fetch me. Go back home earlier. I’ll come\nbother you at night.” Catherine waved."
      },
      {
        "paragraph": "Forrest nodded. When he was just about to leave with Freya, he seemed to think of something and\nsuddenly stopped. “By the way, Catherine. I heard that… your aunt and uncle will be released from\nprison soon.”"
      },
      {
        "paragraph": "“What?” Freya got worked up before Catherine could open her mouth. “They were suspected of\nstealing Cathy’s inheritance and even murdered Old Madam Jones. They should be spending the rest\nof their lives in prison. Why are they being released so soon?”"
      },
      {
        "paragraph": "“I heard that… they’ve been behaving well in prison and also made some worthy contributions. ”\nForrest frowned and said, “They’re set to be released next week.”"
      }
    ]
  },

  {
    "title": "Chapter 1399 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine frowned deeply."
      },
      {
        "paragraph": "She had spent a lot of effort to put Jeffery Jones and Sally Lennon in jail."
      },
      {
        "paragraph": "Unexpectedly, they would be released before even four years had passed."
      },
      {
        "paragraph": "No one could accept something like this."
      },
      {
        "paragraph": "“What were their contributions?” Catherine asked curiously."
      },
      {
        "paragraph": "“I’m not sure.” Forrest shook his head."
      },
      {
        "paragraph": "Catherine’s brows wrinkled. “It doesn’t make sense. What contributions could remit more than 20 years\nof their prison sentence? I wonder if… it has something to do with Rebecca.”"
      },
      {
        "paragraph": "Freya was surprised. “You suspect that she’s back? That’s impossible. After Jeffery and his wife went\nto jail, Rebecca ran away without a care for her parents and hasn’t returned. That kind of person has\nno conscience at all.”"
      },
      {
        "paragraph": "“I don’t know, but Australia is her home. It’s normal for her to come back.” Catherine sighed."
      },
      {
        "paragraph": "“But does she have the ability to save Jeffery and his wife?”"
      },
      {
        "paragraph": "“ She’s been hiding in the dark, and I’ve never won against her in our later confrontations. If she’s really\nback, she must have made preparations.” Deep concern flashed in Catherine’s eyes."
      },
      {
        "paragraph": "The matter with Wesley was not solved yet, and Shaun was fighting against the Campos family. If\nRebecca came back now, it would be troublesome."
      },
      {
        "paragraph": "Rodney looked left and right. “Who’s Rebecca?”"
      },
      {
        "paragraph": "Freya glared at him. “Cathy’s cousin. She’s a terrible woman, maybe even more terrible than Sarah.”"
      },
      {
        "paragraph": "Rodney was stunned. He was cheated by Sarah for more than a decade, but there was someone who\nwas better at deceiving others than Sarah?"
      },
      {
        "paragraph": "“Let’s stop talking about these unhappy things. Your status isn’t low now. Even if she’s back, there’s no\nneed to be afraid,” Forrest said with a faint smile."
      },
      {
        "paragraph": "“That’s true. Cathy, I’m now Uncle Nathan’s goddaughter. I’ll definitely help you.” Freya wrapped an\narm around Catherine. “Actually, it’s good if she comes back. We can settle all the scores we have with\nher. This time, we’ll make sure that she can’t escape.”"
      },
      {
        "paragraph": "“Thank you, but it was just a thought. Maybe she didn’t come back at all.”"
      },
      {
        "paragraph": "Catherine smiled. After Freya and the others left, she walked toward the underground parking lot."
      },
      {
        "paragraph": "Before long, a middle-aged man hurried over. “ Chairman Jones, I’m sorry. I was late because of the\ntraffic. This is the car you wanted…”"
      },
      {
        "paragraph": "“It’s fine.” Catherine took the car keys. “You can go back to work.”"
      },
      {
        "paragraph": "After she got into the car, she went and bought some flowers."
      },
      {
        "paragraph": "The shop was on an old street in Melbourne."
      },
      {
        "paragraph": "She entered the large flower shop and said, “Mister, give me some flowers, please.”"
      },
      {
        "paragraph": "“Got it.” The man quickly prepared the flowers and handed them to her."
      },
      {
        "paragraph": "“Do you sell wreaths?” Catherine asked."
      },
      {
        "paragraph": "“No.” The man shook his head. “A young man came by earlier and bought all of my stock. He probably\nwants to pay tribute to an elder.”"
      },
      {
        "paragraph": "Catherine was stunned. It seemed like there were weirdos everywhere. “Okay, I’ll look elsewhere then.”"
      },
      {
        "paragraph": "However, after going to around five shops, she found that the wreaths had all been bought by the same\nperson."
      }
    ]
  }
]