[
  {
    "title": "Chapter 1450 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun lowered his eyes full of guilt. To put it bluntly, the scars he inflicted on her would always be\nthere. “Cathy, I was angry today because I was afraid of losing you. Think about it. If one day, I lied to\nyou and said that I was eating with a colleague, but you found out that I was actually eating with a\nyoung girl you don’t know, would you feel uncomfortable?”"
      },
      {
        "paragraph": "Catherine bit her lips. If she were in his shoes, she would indeed feel uncomfortable."
      },
      {
        "paragraph": "“Sorry. I… won’t meet him in the future.”"
      },
      {
        "paragraph": "“There’s no need for that,” Shaun rubbed her head and suddenly smiled. “Didn’t you say it yourself?\nYou think of him as a younger brother. I should trust you more. Just don’t lie to me next time.”"
      },
      {
        "paragraph": "“You really… won’t mind?” Catherine was stunned."
      },
      {
        "paragraph": "“Only him. It doesn’t apply for others, ” Shaun said faintly. “Don’t worry, although I agree for you to\ncontinue meeting him, I’ll never eat or go out with other young girls alone.”"
      },
      {
        "paragraph": "Catherine’s heart softened at his words. She stood on her tiptoes and took the initiative to hook her\narms around his neck, and kissed him on the lips. “ Thank you, Shaunny. Don’t worry. At most, I’ll help\nMatthew have a look when he wants to buy a house. He really doesn’t know much about the capital. If\nhe invites me for dinner, I’ll call you too. If you don’t go, I won’t eat alone with him either.”"
      },
      {
        "paragraph": "“Okay.” Shaun felt his mouth taste as sweet as honey from her kiss."
      },
      {
        "paragraph": "If they were not in a public area, he wanted nothing more than to pull her into his arms and give her a\nlong and hot kiss. “Cathy, did you say that he wanted to buy a house in Canberra?”"
      },
      {
        "paragraph": "“Yeah, he said his parents would come back and settle down for a while,” Catherine said."
      },
      {
        "paragraph": "“Do you know what his family does?” Shaun asked."
      },
      {
        "paragraph": "“He said he owns banks, but I’ m not sure either. After all, he’s still so young.” Catherine thought about\nit. “By the way, I saw that he has the same black card as you. His status must be pretty extraordinary.”"
      },
      {
        "paragraph": "Shaun’s eyebrows raised. “ Cathy, you might not know this, but my black card was issued in Country L,\nand there are only fifty cards in the world. The"
      },
      {
        "paragraph": "only people who can get the black card are old families standing on the top of the pyramid in various\ncountries around the world. The Campos family was the number one family in the country before, but\nMason was not qualified to apply for one because the Campos family only rose to the top for a short\namount of time.”"
      },
      {
        "paragraph": "Catherine was stunned for a long time. “You mean that Matthew was born in a family that’s on the top\nof the pyramid in another country, and his family has stood at the top for hundreds of years?”"
      },
      {
        "paragraph": "“Maybe it’s more than that,” Shaun shook his head and frowned. “If his parents want to come here,\nthen their status is probably higher than mine. I wonder why such powerful people are suddenly coming\nhere. I’m afraid Canberra’s business world won’t be peaceful for long.”"
      },
      {
        "paragraph": "Catherine’s eyes flashed. “By the way, you asked him if he was from the Costner family in Neah Bay.\nHave you heard of that last name before?”"
      },
      {
        "paragraph": "“Yeah, ” Shaun nodded. He lowered his eyes and thought deeply, suddenly remembering the familiarity\nCatherine felt towards Matthew. Would a person suddenly feel that way for another person?"
      },
      {
        "paragraph": "Could Matthew Costner really be from that Costner family?"
      },
      {
        "paragraph": "Why did he suddenly appear here?"
      },
      {
        "paragraph": "Furthermore, why did he meet Catherine multiple times coincidentally?"
      },
      {
        "paragraph": "“Shaunny, stop thinking about it, ” Catherine pulled his hand. “I think that Matthew is a good person.\nEven if his family wants to develop here, at most, you’ll be healthy business competitors. Or are you\nworried that your position as the richest man in the country would be taken away?”"
      }
    ]
  },
  {
    "title": "Chapter 1451 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“I don’t care about that. I just want you and the children to be by my side.”"
      },
      {
        "paragraph": "Shaun smiled. “Forget it, let’s not think about this. I’ll go with you to the shop in front.”"
      },
      {
        "paragraph": "Catherine looked at the shop and immediately blushed. It was a shop selling lingerie. “It’s not good for\nyou to follow me there. I don’t lack…”"
      },
      {
        "paragraph": "“You can buy fancier ones even if you don’t lack any. I like to see you wear them,” Shaun said\nambiguously in her ear. The unhappiness from before was all gone."
      },
      {
        "paragraph": "However, they did not know that somewhere on the fourth floor, Matthew held a cup of tea and watched\nthis scene quietly."
      },
      {
        "paragraph": "Today, he deliberately pretended to bump into Catherine by coincidence, deliberately took out his black\ncard, and deliberately acted like he was very rich. He was sure that a woman like Catherine would try\nto flirt with him."
      },
      {
        "paragraph": "However, she did not."
      },
      {
        "paragraph": "She did not even give him the chance to flirt."
      },
      {
        "paragraph": "After Shaun came, she openly got close to Shaun."
      },
      {
        "paragraph": "“Young Master… ” A subordinate appeared behind him."
      },
      {
        "paragraph": "“Shaun Hill might be suspicious about my identity, ” Matthew sighed softly."
      },
      {
        "paragraph": "The subordinate was surprised. “How could that be? Shaun Hill has never been involved with us, and\nwith the Hill family’s status, he’s not qualified enough to contact the Costner family.”"
      },
      {
        "paragraph": "“He also asked if I was from the Costner family in Neah Bay. That’s strange. How did he hear about the\nCostner family?” Matthew wondered."
      },
      {
        "paragraph": "“What now?” The subordinate added, “Right, the madam said that Shaun Hill and Catherine Jones are\nboth evil villains and want us to end the Hill family.”"
      },
      {
        "paragraph": "“Shaun recently managed to rise up again, so it won’t be easy to end him. The plan will have to be\nrearranged,” Matthew stroked his chin. “ Say, what part of Shaun is attractive to women? Isn’t he just a\nscumbag?”"
      },
      {
        "paragraph": "“Yes, everyone on the Internet says that he’s the worst scumbag there is. Maybe… women like him"
      },
      {
        "paragraph": "because he’s rich.” The subordinate said, “Shaun made a comeback just after Catherine got back\ntogether with him. Maybe Catherine knew that he was going to become the richest man again and got\nback together with him in advance?”"
      },
      {
        "paragraph": "“Is that so?” Matthew did not comment further."
      },
      {
        "paragraph": "However, he felt like Catherine was not that kind of person."
      },
      {
        "paragraph": "He was getting more and more confused."
      },
      {
        "paragraph": "“By the way, Young Master. About the clothes that Catherine chose for you… Should I throw them\naway?”"
      },
      {
        "paragraph": "“Why should you throw them away? Do I have too much money? Take it back for me to wear, ”\nMatthew held the teacup and left."
      },
      {
        "paragraph": "The subordinate was stunned. Since when did the Young Master like to wear such bright clothes?"
      },
      {
        "paragraph": "Did he not come here to avenge the Eldest Young Lady? Why did he behave like he had just awakened\nto love?"
      },
      {
        "paragraph": "After returning to Hill Manor."
      },
      {
        "paragraph": "While Catherine was bathing the children, Shaun took the chance to dial Brennan’s number. “Dad,\nhave you heard of a person called Matthew Costner?”"
      },
      {
        "paragraph": "“His last name is Costner?” Brennan was slightly confused."
      },
      {
        "paragraph": "“Yeah, he’s in his early twenties. He’s been popping up around Cathy recently, so I feel like it’s not a\ncoincidence. Cathy also said that he has the same black card as me.”"
      },
      {
        "paragraph": "“I’ve never heard of a person called Matthew Costner,” Brennan said. “However, Titus Costner and his\nwife have a son who’s about the same age. Of course, it’s not necessarily him since there are many\npeople in the Costner family, especially in Country L. The banks there are basically controlled by the\nCostner family.”"
      },
      {
        "paragraph": "“He said he’s from Country L, ” Shaun said."
      },
      {
        "paragraph": "“Then, he’s definitely from the Costner family. As for which branch, I don’t know.” Brennan wondered,\n“Why did someone from the Costner family come to Australia? They basically have no economic\ndealings with the country.”"
      },
      {
        "paragraph": "“Could it be… Cathy’s mother is really Titus’ wife?” Shaun guessed. “She might have recovered her\nmemory and returned to find her daughter.”"
      },
      {
        "paragraph": "”That’s possible. Didn’t you say that Matthew’s parents are coming here? Keep an eye on him for now.\nHis parents will have to show up sooner or later, ” Brennan said."
      }
    ]
  },
  {
    "title": "Chapter 1452 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Yeah, ” Shaun hung up the phone and felt his head hurt."
      },
      {
        "paragraph": "They finally settled down after going through so much. If Cathy’s mother appeared, would she oppose\nhim with Cathy?"
      },
      {
        "paragraph": "At the end of the month."
      },
      {
        "paragraph": "In a palace garden, the production crew got busy before the sky brightened."
      },
      {
        "paragraph": "Today was the first official shooting day for The Belle, a new film by the famous director Andy Cheever."
      },
      {
        "paragraph": "The workers began to whisper before the actors arrived."
      },
      {
        "paragraph": "“I didn’t expect both Eliza Robbins and Cindy Turner to act together."
      },
      {
        "paragraph": "“Yeah, I heard that both of them were competing for the heroine role, but Eliza lost and became the\nsupporting lead.”"
      },
      {
        "paragraph": "“That female lead is very unpleasant. I feel sorry for Eliza. In fact, I think it’s more appropriate for Eliza\nto be the heroine.”"
      },
      {
        "paragraph": "“ Shh, keep your voice down. Do you want to die? Cindy is the future young lady of the Jewell family.\nNo one dares to say a word against her in the industry unless they want to lose their job.”"
      },
      {
        "paragraph": "“Look, Miss Turner is here. She came so early.” Someone gave a soft reminder."
      },
      {
        "paragraph": "The people looked over and saw Cindy coming in while wearing her costume and her hair tied in two\nbuns. Behind her were three assistants."
      },
      {
        "paragraph": "“Miss Turner, why are you here so early?” A crew leader walked over and asked her."
      },
      {
        "paragraph": "“I wanted to familiarize with the studio sooner, lest I make any mistakes in filming later, ” Cindy smiled\ngently. “You guys can get back to work. Don’t mind me.”"
      },
      {
        "paragraph": "Then, Cindy looked over her script."
      },
      {
        "paragraph": "The people looked at her back and said, “Woah, I thought that she would put on airs, but she’s\nunexpectedly so amiable.”"
      },
      {
        "paragraph": "“She’s diligent and hardworking too. Look at her hair buns. I guess she had to get up at five in the\nmorning to style it.”"
      },
      {
        "paragraph": "“Although her acting skills aren’t as good as Eliza’s, she’s hardworking. Look, Eliza hasn’t arrived yet.”"
      },
      {
        "paragraph": "Before long, Director Cheever arrived. When he saw Cindy studying the script earnestly, he nodded in\nsatisfaction."
      },
      {
        "paragraph": "Although he did not like Cindy taking the heroine role, she at least put in the effort and could be\nconsidered a promising talent."
      },
      {
        "paragraph": "One after another, the actors all arrived except Eliza, who had not appeared yet. Director Cheever’s\nexpression also gradually turned grim."
      },
      {
        "paragraph": "With his fame, what he hated most was tardiness."
      },
      {
        "paragraph": "“Look, who’s that? He’s so handsome. Is he also one of the cast?”"
      },
      {
        "paragraph": "“Are you blind? That’s Young Master Jewell from the Jewell family.” After someone scolded the person,\neveryone turned their eyes to Chester."
      },
      {
        "paragraph": "Cindy’s eyes were even brighter. She never imagined that Chester would visit on the first day of\nshooting."
      },
      {
        "paragraph": "“Chester, why are you here…”"
      },
      {
        "paragraph": "She walked over with a face full of surprise and wrapped her hands around Chester’s arm."
      },
      {
        "paragraph": "Today, Chester was dressed in gray trousers and he wore a white shirt along with a waistcoat. His\nhandsome face was like a charming romantic prince, but his good looking-eyes were sharp and cold."
      },
      {
        "paragraph": "“To have a look,” Chester faintly threw out the words but did not push her hand away. After all, in the\neyes of outsiders, he would be marrying Cindy soon."
      }
    ]
  },
  {
    "title": "Chapter 1453 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Cindy was not naive enough to think that Chester was here to see her."
      },
      {
        "paragraph": "Even when their relationship was not as bad as before, he had never come to see her when she was\nfilming."
      },
      {
        "paragraph": "Why did he suddenly come today?"
      },
      {
        "paragraph": "She suddenly remembered that day when she saw Eliza coming out of the office in a disheveled\nmanner. He was there at that time, and his face was burning unabashedly."
      },
      {
        "paragraph": "Her heart clenched with hatred."
      },
      {
        "paragraph": "However, she did not dare to show any of it on her face."
      },
      {
        "paragraph": "No matter what Chester thought, he was her boyfriend. In the eyes of others, he came here for her."
      },
      {
        "paragraph": "“President Jewell, you’re here to see Cindy, right?” Director Cheever smiled and came over to greet\nhim. “Cindy’s performance today was very good. She came here early in the morning and"
      },
      {
        "paragraph": "continuously discussed her role with me. She’s very dedicated.”"
      },
      {
        "paragraph": "Cindy smiled modestly. “It’s my honor that Director Cheever gave me this opportunity. I’ve been\npreparing for this film for five to six years, so I can’t drag the crew down. I still have a lot of"
      },
      {
        "paragraph": "shortcomings, so I ask for your guidance on this. ”"
      },
      {
        "paragraph": "“Don’t worry, as long as you work hard, I can make you a work of art, ” Director Cheever nodded."
      },
      {
        "paragraph": "A touch of surprise flashed in Chester’s dark eyes."
      },
      {
        "paragraph": "He thought that Andy would be disgusted with Cindy because she got the role through connections.\nUnexpectedly, Cindy had Andy praise her on the first day itself even though it was said that he was\nvery strict. It seemed like Cindy spent some effort on this."
      },
      {
        "paragraph": "He glanced at Cindy faintly. Cindy, who was smiling, suddenly had a shiver like she was being seen\nthrough and changed the subject. “Director Cheever, when will we start shooting?”"
      },
      {
        "paragraph": "“Do you think I don’t want to start early? The supporting female lead hasn’t arrived.”"
      },
      {
        "paragraph": "Andy became displeased at the mention of this matter, and he spoke bluntly even to Chester. “ Young\nMaster Jewell, help me tell President Daley to talk to Eliza. I hate actors who are late the most. It’s the\nfirst day of filming yet she’s still not here even though it’s already g. If this happens again, I’ll definitely\nreplace her.”"
      },
      {
        "paragraph": "He originally had a good impression of Eliza. She was young and had a talent for acting. However, he\ndid not expect her to be the type to put on airs."
      },
      {
        "paragraph": "Now, Director Cheever lost all favorable opinions of her."
      },
      {
        "paragraph": "Chester frowned slightly."
      },
      {
        "paragraph": "He also did not expect Eliza to be someone who would show up late."
      },
      {
        "paragraph": "Was it because she did not want to be the supporting female lead and was deliberately showing\ndefiance?"
      },
      {
        "paragraph": "She was not that stupid, right?"
      },
      {
        "paragraph": "“Have you called her?” He asked faintly."
      },
      {
        "paragraph": "“I called her half an hour ago. She said she’s on the way, but she hasn’t arrived, ” Andy snorted. “I’ve\nseen tons of artists like her. Most of them just use excuses. They say that they’re on the way, but they\nactually just got up. It’s a lie to trick you.”"
      },
      {
        "paragraph": "Cindy said softly, “Director Cheever, why don’t we shoot the second scene first? The second scene"
      },
      {
        "paragraph": "involves a male actor and me. I’m almost done with the preparations.”"
      },
      {
        "paragraph": "“Alright, ” Andy nodded. “Young Master Jewell, please go to the pavilion over there and have a seat.”"
      },
      {
        "paragraph": "“Okay,” Chester nodded and was just about to walk over when suddenly, two people burst through the\nentrance of the studio. The person in front was Eliza, who was dressed in a gray tracksuit. Her thick\nand long hair draped messily over her shoulders, and her pure and natural face was flushed. Her face\nwas full of collagen, making her look eighteen."
      },
      {
        "paragraph": "Behind her was a small assistant. Both of them were panting and out of breath."
      }
    ]
  },
  {
    "title": "Chapter 1454 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Director Cheever looked at her and snorted coldly. “ Miss Robbins, you’re finally here. We’ve been\nwaiting for you for half an hour.”"
      },
      {
        "paragraph": "“I’m sorry, Director Cheever.”"
      },
      {
        "paragraph": "Eliza’s heart sank. Yesterday, Director Cheever still communicated with her over the phone pleasantly.\n“I didn’t mean to…”"
      },
      {
        "paragraph": "“Eliza, be mindful next time and don’t be late again. ” Cindy hurriedly took Chester’s hand and said, “\nLook, Chester came here to see me and he"
      },
      {
        "paragraph": "arrived earlier than you. And why haven’t you put o n your makeup yet?”"
      },
      {
        "paragraph": "Eliza froze. “I…”"
      },
      {
        "paragraph": "“Enough dawdling. Hurry up and put on your makeup and get changed. Your scene will have to be\nmoved to the afternoon.” Director Cheever stormed off without waiting for her to finish."
      },
      {
        "paragraph": "“Eliza, hurry up and go. The director is really angry,” Cindy urged her."
      },
      {
        "paragraph": "Eliza glanced at Cindy and Chester. Her mood was already sullen, but when she saw these two people,\nshe felt even more annoyed and simply left."
      },
      {
        "paragraph": "“Stop…” Chester’s deep voice suddenly stopped"
      },
      {
        "paragraph": "her. “You saw your boss but didn’t even greet him. Is this how Shedrick trains his artistes? Do I… have\nto hire someone to teach you proper manners and etiquette?”"
      },
      {
        "paragraph": "Eliza closed her eyes and took a deep breath. She turned around and smiled apologetically. “Sorry,\nYoung Master Jewell, I forgot to greet you because I was in a hurry to do my makeup. Please forgive\nme.”"
      },
      {
        "paragraph": "Chester looked at her flushed face and said indifferently, “I don’t want you to see you late again, and I\nhope you won’t discredit Felix Media and me.”"
      },
      {
        "paragraph": "“I’m sorry, Young Master Jewell. This won’t happen again,” Eliza apologized and turned to leave."
      },
      {
        "paragraph": "Cindy looked up at Chester. When she saw him staring at Eliza’s back thoughtfully, she gritted her\nteeth and forced a smile. “Chester, it’s so sunny here. Let’s go over there and rest. I’ll try to finish\nfilming early and then we can have dinner together.”"
      },
      {
        "paragraph": "“I’m afraid that eating with you will affect my appetite,” Chester turned away expressionlessly."
      },
      {
        "paragraph": "Cindy’s expression twitched slightly, but she forced it down and smiled awkwardly, “Didn’t you come\nhere for me today?”"
      },
      {
        "paragraph": "“For you?” Chester smiled thinly. “Haven’t I made myself clear regarding our relationship?”"
      },
      {
        "paragraph": "“Then… Are you here for Eliza?” Cindy asked in a low voice. “You forgot what I told you about Monte\nPatterson and her before…”"
      },
      {
        "paragraph": "“Cindy Turner…” Chester looked back at her ruthlessly, “Don’t act like you were completely untainted\nbefore meeting me. I know very well that you went to the hospital to restore your hymen."
      },
      {
        "paragraph": "You’re no different from her. If I were you, I’d be too ashamed to talk about others.”"
      },
      {
        "paragraph": "Cindy’s eyes filled with panic followed by embarrassment. “That’s not what I meant… I’m just worried\nthat you’ll provoke Monte…”"
      },
      {
        "paragraph": "“Do you think I’m no match for Monte?” Chester narrowed his eyes coldly."
      },
      {
        "paragraph": "“Of course not…” Cindy was at a loss."
      },
      {
        "paragraph": "“If you don’t know how to talk, then shut your mouth. Even if I want to play around with women, it’s\nnone of your business. Besides, I don’t have"
      },
      {
        "paragraph": "those kinds of thoughts for Eliza. If you directed your schemes towards filming, your acting skills\nwouldn’t be so bad, ” Chester said and strode away with his long legs, disappearing from Cindy’s sight."
      },
      {
        "paragraph": "Cindy forced herself to hold back from crying in anger."
      },
      {
        "paragraph": "Chester was increasingly disrespectful to her with his words. It was like he was made of arsenic."
      },
      {
        "paragraph": "“Cindy, you’re so blessed. It’s your first day filming and Young Master Jewell came here to see you, ”\nThe third supporting female lead ran over to curry favor with her."
      }
    ]
  },
  {
    "title": "Chapter 1455 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“When you get married to Young Master Jewell, don’ t forget to invite us, ” the male lead also said\nfawningly."
      },
      {
        "paragraph": "“Of course, ” Cindy looked up and smiled. No matter how Chester was in private, in the eyes of others,\nshe was the soon-to-be Mrs. Jewell which everyone was envious of."
      },
      {
        "paragraph": "In the small private lounge, the little assistant Leanne was complaining. “They’re going too far. How\ncould they give us such a small lounge? You’re still an A-list actress. In the past, you were the apple of\neveryone’s eye.”"
      },
      {
        "paragraph": "“Don’t say that. Many people would pay just to join Director Cheever’s crew, ” Eliza said faintly."
      },
      {
        "paragraph": "“But you didn’t want to join. It was the company who arranged for you to play the supporting female\nrole,” Leanne fumed. “The second female lead is purely to act as a foil to Cindy. Why should you be her\nfoil? She’s not as beautiful as you are and her acting skills aren’t as good as yours either. Why"
      },
      {
        "paragraph": "don’t we stop acting in this film? Don’t suffer through this.”"
      },
      {
        "paragraph": "Eliza smiled helplessly, “Is this considered suffering? Did you forget how everyone only rolled their\neyes at me when I wasn’t popular in the past? I even had to do my own makeup, and I stayed in small\nhotels.”"
      },
      {
        "paragraph": "Leanne gritted her teeth. “But your status is different now. There’s clearly someone trying to ostracise\nyou. You should have told Young Master Jewell earlier that you weren’t late on purpose. It’s because\nthe crew arranged for you to stay at the most remote hotel. It takes 4o minutes to get here by car, but\nthis morning, the car’s tire got punctured. We couldn’t get a taxi and had to walk all the way here.”"
      },
      {
        "paragraph": "Eliza’s expression was helpless. How would she say it?"
      },
      {
        "paragraph": "It was obvious that the person behind this was Cindy."
      },
      {
        "paragraph": "Most likely, Cindy became jealous after she saw how Eliza came out of the office with disheveled\nclothes last time and found out that only Chester was inside."
      },
      {
        "paragraph": "Leanne continued to complain, “Also, no one in the crew called us to tell us that we had to get your\nmakeup done before arriving. No one came to do the makeup either. It’s baffling.”"
      },
      {
        "paragraph": "“Go talk to the costume team later. Stop talking about it now. Someone’s coming.”"
      },
      {
        "paragraph": "Eliza reminded her."
      },
      {
        "paragraph": "Soon, the stylist came in. After an hour, Eliza looked at the styling and frowned."
      },
      {
        "paragraph": "Leanne could not hold back any longer. “That style is horrendous. You’re making Eliza look old. It’s like\nshe’s a maid.”"
      },
      {
        "paragraph": "The stylist was unhappy when she heard the words. “What does that mean? I studied this shape for\nmore than a month before coming up with it. You can’t blame me for that. The main problem is her\nface.”"
      },
      {
        "paragraph": "“Hah. Eliza has played in so many dramas and everyone on the Internet praises her for her beauty. It’s\nyour face that’s the problem, ” Leanne said angrily. “We’re not asking you to make her stunning, but\nyou can’t make her this ugly. You’ll affect her filming career in the future.”"
      },
      {
        "paragraph": "“This film isn’t meant to portray how beautiful she is. She’s just the supporting female lead. If she’s too\nbeautiful, what about the heroine? Some actors deliberately dress up as ugly and sacrifice their image\nin order to perform their roles. If Eliza can’t do that, then it won’t work. Why doesn’t she go play in an\nidol drama instead?”"
      },
      {
        "paragraph": "The stylist said with a cold face, “If you’re not satisfied with me, tell the director and get someone else.”"
      },
      {
        "paragraph": "Then, she left straight away."
      },
      {
        "paragraph": "“This is driving me mad. They’re doing this on purpose. I’ll ask the other stylists if they can change it,”\nLeanne went out."
      },
      {
        "paragraph": "Eliza looked at herself in the mirror quietly."
      },
      {
        "paragraph": "Then, she removed the hairpin, undid the bun on her head, and combed her hair back with the comb,\nrevealing her white and supple face."
      },
      {
        "paragraph": "After fixing her hair, she picked up the eyebrow pencil and drew crescent-shaped eyebrows. Her eyes\nwere like stars, and her lips were red and luscious."
      },
      {
        "paragraph": "After everything was done, she put down the lipstick."
      },
      {
        "paragraph": "When she turned around, she saw Chester standing at the door. The man’s figure was tall and\nscholarly, but the smile on his handsome face looked slightly wicked."
      }
    ]
  },
  {
    "title": "Chapter 1456 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Eliza frowned. She did not know how long he had been standing there. “Young Master Jewell, you’re a\nt the wrong place. Cindy’s lounge isn’t here.”"
      },
      {
        "paragraph": "“ I didn’t know that you’re quite good at styling, ” Chester had been standing there since she started\nworking on her hair."
      },
      {
        "paragraph": "He saw her fingers nimbly weaving in and out of the hair at the back of her head as if she had eyes\nthere."
      },
      {
        "paragraph": "This woman knew where her beauty was. It was a very simple hairstyle, but it was enough to\nemphasize her exquisite and refined face. He did not know a woman in a costume could look so\nbeautiful."
      },
      {
        "paragraph": "“ I can’t help it. Someone bribed the stylist and is deliberately working against me, so I have to fend for\nmyself, ” Eliza said indifferently, as if she was talking about a matter that was inconsequential to her."
      },
      {
        "paragraph": "“Are you saying that Cindy did it?” Chester looked a t her, his dark eyes showing a slight sneer. “Are\nyou complaining to me?”"
      },
      {
        "paragraph": "Eliza frowned."
      },
      {
        "paragraph": "She could not figure out what Chester meant by that. Was he condemning her for talking about Cindy?"
      },
      {
        "paragraph": "Or was he reminding her that Cindy was his woman, and she had no right to talk about Cindy?"
      },
      {
        "paragraph": "“Whatever you think it is. In any case, I can handle myself. ” Eliza stood up and said, “Young Master\nJewell, could you leave? I want to close the door and change my clothes.”"
      },
      {
        "paragraph": "“Are you angry because I didn’t help you?” Not only did Chester not intend to leave, but he also braced\nhimself against the door and his thin lips curled in rumination."
      },
      {
        "paragraph": "“No. I wouldn’t dare get angry at someone with your status, ” Eliza answered calmly."
      },
      {
        "paragraph": "“That means you want to be angry, but you’re suppressing it, ” Chester looked down at her dark and\ncalm eyes."
      },
      {
        "paragraph": "Similar. Too similar. It was just like the woman he personally sent to prison."
      },
      {
        "paragraph": "Eliza was speechless, not understanding what he was pestering her for. “Young Master Jewell, what\nexactly do you want?”"
      },
      {
        "paragraph": "She was very busy and did not have time to waste on him."
      },
      {
        "paragraph": "Chester leaned against the door lazily. “Your lounge is very small.”"
      },
      {
        "paragraph": "Eliza pursed her lips. “The crew arranged it.”"
      },
      {
        "paragraph": "“Eliza Robbins…” Chester’s voice lowered, and his eyes darkened slightly. “ I can give you a chance. A\nchance for you to be someone who stands above others.”"
      },
      {
        "paragraph": "After all, Charity was dead, and Charity’s family was no more. Her only friends were Freya and\nCatherine, but he could not give anything to those two. Only Eliza…"
      },
      {
        "paragraph": "Although he hated her disorderly past, she was Charity’s only friend. Even after she died, she passed\non her dream to Eliza."
      },
      {
        "paragraph": "Eliza froze and remembered how Chester forcefully kissed her last time, and instantly seemed to\nunderstand something."
      },
      {
        "paragraph": "Her disgust towards Chester reached its peak at that moment."
      },
      {
        "paragraph": "“I appreciate your kindness, but I have no interest in pestering a man who is about to get married, ”\nEliza said as she looked directly at him."
      },
      {
        "paragraph": "Chester raised his brows, knowing perfectly well that she misunderstood."
      },
      {
        "paragraph": "However, even if she misunderstood, he had thrown out a topic that excited all the women in the\nentertainment industry. Yet, she refused it."
      },
      {
        "paragraph": "Was she still attached to Monte Patterson? For some reason, a sudden rage welled up."
      }
    ]
  },
  {
    "title": "Chapter 1457 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Eliza, you don’t have to act innocent,” Chester said with a snort, “Everyone knows that Monte has\nmessed around with you before this.”"
      },
      {
        "paragraph": "Chester was taken aback by this remark that came out of his own mouth."
      },
      {
        "paragraph": "He knew that he had always spoken nastily, but he did not expect himself to be this nasty."
      },
      {
        "paragraph": "It was not his intention to humiliate Eliza when he came here. However, seeing her attitude… He just\nwent out of control."
      },
      {
        "paragraph": "Eliza widened her pretty eyes."
      },
      {
        "paragraph": "She probably did not expect to hear such a remark from Chester as well."
      },
      {
        "paragraph": "Silence filled the lounge for a short while. Chester thought she would fly into a rage, but she lifted her\nchin with her eyebrows arched arrogantly. “ So are you unhappy because I turned you down and didn’t\nlet you fool around with me?"
      },
      {
        "paragraph": "Chester’s eyes darkened. He stood up and approached her slowly. “Eliza, are you trying to provoke\nme?”"
      },
      {
        "paragraph": "“I don’t know what you mean by that. Am I supposed to show an aggrieved and tearful look in front of\nyou to make myself seem as though I fell for a scumbag instead of being played around with?” Eliza\nshrugged in a self-deprecating and frank manner. “Even if I behave that way, you won’t take pity on me.\nYou’d rather see me as a phony who’s trying to retain my dignity even though I’m a b*tch.”"
      },
      {
        "paragraph": "She was overly forthright in her words."
      },
      {
        "paragraph": "Chester felt dumbfounded for a few seconds. A moment later, a bizarre glint flashed across the depths\nof his eyes. With a flirtatious tone, he said, “ You’re right, Eliza. You know me so well despite having\nknown me just a short while ago.”"
      },
      {
        "paragraph": "“After talking to you a few times, I’m pretty clear about what kind of person you are. Aren’t all wealthy\nyoung men like you equally awful?” Eliza turned around and took a light green dress off the hanger. “I\ndon’t want to be dragged into this mess anymore. Unlike men, women will develop feelings after\nsleeping with someone for a long time. But for men, they feel increasingly bored of the women they\nsleep with because the feeling of novelty has worn off.”"
      },
      {
        "paragraph": "“You really… understand men. Did you learn this from Monte?” Chester’s brows revealed a glint of\ncoldness."
      },
      {
        "paragraph": "“Don’t you already know what happened between Monte and me?” Eliza frowned with a trace of doubt.\n“Please go out first. I need to change my clothes.”"
      },
      {
        "paragraph": "“ Is it urgent?” Chester closed the door behind him and sat on the chair. “You can change now.”"
      },
      {
        "paragraph": "Eliza was speechless."
      },
      {
        "paragraph": "How awful this man was! There was not even a restroom in this huge lounge. Where could she go and\nget changed?"
      },
      {
        "paragraph": "“Why aren’t you changing? Do you want me to change your clothes for you?” Chester crossed his legs\nwith a lazy look."
      },
      {
        "paragraph": "“I’ll go to the restroom outside and change,” Eliza replied."
      },
      {
        "paragraph": "“Go ahead. But you’re a celebrity and there might be hidden cameras planted in the restroom. It’d be\ninteresting if the footage was posted online.” Chester laughed."
      },
      {
        "paragraph": "Eliza looked somber. She could not borrow someone else’s lounge either. Otherwise, other people\nwould"
      },
      {
        "paragraph": "wonder why she could not change in her own lounge. If they looked into the issue, they would find out\nthat Chester was in her lounge."
      },
      {
        "paragraph": "Once this issue was exposed, not only would she be criticized but she would also be labeled as a\nshameless woman who seduced someone else’s fiancé."
      },
      {
        "paragraph": "Eliza could not help but sigh. Did she owe him in her previous life?"
      },
      {
        "paragraph": "Even after she had risen from the dead, he still refused to let her go."
      },
      {
        "paragraph": "In the end, she had no choice but to sit on the chair."
      },
      {
        "paragraph": "“Don’t you want to change?” Chester asked sarcastically."
      },
      {
        "paragraph": "“Yeah, but there’s a man right here. Seeing your hungry eyes, I’m afraid you won’t let me put on my\nclothes again after I take them off.” Eliza made the flirtatious remark with an impassive tone."
      },
      {
        "paragraph": "Gazing at her, Chester snickered."
      }
    ]
  },
  {
    "title": "Chapter 1458 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "It had been a long while since Chester met such an interesting woman. Unfortunately…"
      },
      {
        "paragraph": "“Ellie, why did you close the door?”"
      },
      {
        "paragraph": "Leanne’s voice suddenly rang from outside. “I’m so mad. When I looked for those makeup artists just\nnow, they said they were busy. When I looked for the head of the department, he claimed that we were\nlate and caused a lot of problems for them… ”"
      },
      {
        "paragraph": "The door was forcefully opened."
      },
      {
        "paragraph": "At the sight of the man who opened the door, Leanne was instantly dumbfounded. She stammered, “Y-\nYoung Master Jewell…”"
      },
      {
        "paragraph": "“Mm.” Chester acknowledged her with a captivating hoarse voice before striding out with his long legs."
      },
      {
        "paragraph": "Leanne’s eyes settled on his silhouette for a moment before she glared at Eliza."
      },
      {
        "paragraph": "Eliza was overwhelmed with unease. “Don’t misunderstand…”"
      },
      {
        "paragraph": "“Of course, I won’t misunderstand. What could I misunderstand? It must be due to your late arrival\nwhich made Young Master Jewell upset. That’s why he scolded you, right?” Leanne said in a huff,\n“Have you explained yourself to Young Master Jewell?”"
      },
      {
        "paragraph": "Eliza looked down and laughed. Well, Leanne understood her so well that she did not have to clarify\nanything."
      },
      {
        "paragraph": "“Wow, Eliza. Your hairstyle looks great. Who did it? It’s beautiful.” Leanne suddenly squealed. “You look\ngorgeous.”"
      },
      {
        "paragraph": "“I did it on my own, ” Eliza said, “Have you forgotten that I learned these things from the internet when I\ndidn’t have any makeup artists to do it for me back then?”"
      },
      {
        "paragraph": "“I remember now. That was two years ago. I didn’t expect that we’d go back to that situation.” Leanne\nlet out a sigh."
      },
      {
        "paragraph": "By the time Eliza was done changing and stepped out, the first scene had already been shot."
      },
      {
        "paragraph": "Director Cheever was fuming with anger. “Where’s Eliza? Why isn’t she here yet? Does she need the\nentire morning to put on her makeup and get changed? I’m not paying her to put on her makeup.”"
      },
      {
        "paragraph": "“Director Cheever, I did it for her an hour ago, ” a makeup artist said."
      },
      {
        "paragraph": "“But why is she still not here yet? She must be dawdling. If she’s late again tomorrow, she won’t have\nto come anymore.” Director Cheever was infuriated."
      },
      {
        "paragraph": "“I’m sorry, Director Cheever. I won’t behave like this again tomorrow.” Eliza walked over to the director\nin a light green dress. Her hair was pinned with a purple barrette on the right side, revealing her bright\nforehead and small face. It was a challenge to many other female celebrities, yet she looked simply\nperfect from all angles. With her starry eyes and pretty face, she looked radiant."
      },
      {
        "paragraph": "A lot of female celebrities needed to apply filters to their photos."
      },
      {
        "paragraph": "However, Eliza looked as though she was using a camera filter in real life."
      },
      {
        "paragraph": "Silence fell on the set for a moment. Chester, who was smoking at the gazebo, caught sight of the\nscene. His dark eyes narrowed while his lips curled into a faint smile."
      },
      {
        "paragraph": "Eliza was clever as she knew which part of her was most beautiful."
      },
      {
        "paragraph": "If a photo of her was taken right now and exposed to the public, it would evoke heated discussions on\nher beauty and probably make history."
      },
      {
        "paragraph": "Cindy was so jealous that her heart ached. Although the makeup artist had taken great pains to make\nher beautiful, her face was not as pretty as Eliza’s. Besides, she had made her debut as a singer.\nEliza’s looks in historical movies were unparalleled."
      },
      {
        "paragraph": "At this moment, Cindy grabbed the chance to shoot a look at the makeup artist."
      },
      {
        "paragraph": "After the makeup artist came to her senses, she said nervously, “Sorry, Director Cheever. This isn’t the\nmakeup I did for Miss Robbins previously. I considered that she’s the first supporting actress in the\nmovie who’s mostly villainous, so I deliberately applied makeup that made her look a little fierce… ”"
      },
      {
        "paragraph": "Director Cheever instantly grasped the point. The assistant director beside him glanced at Cindy’s\nexpression and immediately criticized, “Eliza, I know you want to look good, but not every character\nneeds to look beautiful. Your looks need to reflect your character’s personality. Do you know why this\nmovie is called The Belle? It’s precisely because the female lead and her dancing skills are beautiful.\nWith your current looks, you’ll be stealing the limelight from the lead actress.”"
      }
    ]
  },
  {
    "title": "Chapter 1459 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "The assistant director had made it very clear that the first supporting actress’ beauty had surpassed\nthat of the female lead, which would twist the intended theme of the movie."
      },
      {
        "paragraph": "Upon hearing his words, Director Cheever became annoyed. “Eliza, if you want a role that allows you\nto look beautiful and a character that has a distinct personality as well as characteristics, you’re in the\nwrong set. Since today is the first day of shooting, you can still leave. But… if the crew suffers any\nlosses because of you, you need to compensate us. ”"
      },
      {
        "paragraph": "“Director Cheever, I think it’s Eliza’s first time being involved in blockbuster movies like this, so she\nmight not be clear about some things.”"
      },
      {
        "paragraph": "Cindy promptly came over and explained, “Eliza, just follow the makeup artist’s arrangement. I have a\nscene that requires me to fall into mud tomorrow. Director Cheever asked me to go bare-faced and cast\nmy image aside. Actually, Director Cheever is renowned for his filmmaking expertise, so we should\nbelieve in him. What’s more, every attempt is a new breakthrough.”"
      },
      {
        "paragraph": "Director Cheever nodded in satisfaction. He did not expect Cindy to be so aware of things. Although\nshe was Young Master Jewell’s fiancée, she did not put on airs. Instead, she was rather cooperative."
      },
      {
        "paragraph": "“Eliza, I have a tight schedule. Can you stop wasting everyone’s time?” The winner of the best actor\naward and the male lead of the movie, Norman Judge, was impatient with Eliza, who was merely a\npopular idol."
      },
      {
        "paragraph": "With all the criticisms Eliza was receiving, Leanne became exasperated and anxious. When she was\nabout to speak, Eliza cast a look at her while shaking her head. She then said, “Look at my face. Do I\nhave any eyeliner or any other makeup on me? I only applied a little lip balm on my lips and arched my"
      },
      {
        "paragraph": "eyebrows so that my style will suit my character in the movie. I even tied up my hair into the most\nordinary bun.”"
      },
      {
        "paragraph": "Everyone was stunned. Only then did they realize that her face was bare without any foundation on it."
      },
      {
        "paragraph": "Hardly anyone would be bold enough to go barefaced when shooting a movie these days."
      },
      {
        "paragraph": "However, Eliza looked so pretty without any makeup…"
      },
      {
        "paragraph": "Many of the actresses present were deeply jealous."
      },
      {
        "paragraph": "Eliza showed her phone screen. “This was what the makeup artist did to me. Frankly, with this makeup,\nI wonder if I’m playing the first supporting female role or her mom?”"
      },
      {
        "paragraph": "Director Cheever was dumbfounded after catching a glimpse of it. Eliza was naturally beautiful, but that\nmakeup style really made her appear quite old- fashioned."
      },
      {
        "paragraph": "The makeup artist began to panic. “Director Cheever, didn’t you tell me during the meeting earlier to\nconceal Eliza’s beauty a little when I applied makeup on her? You wanted me to make her look slightly\nmore ferocious and scheming.”"
      },
      {
        "paragraph": "“Yes. Makeup can highlight one’s ferocity and beauty, but I don’t think this is necessary.”"
      },
      {
        "paragraph": "Eliza’s impassive gaze was filled with confidence. “ I’m called an actress because of my acting. It’s\nthrough the eyes that one acts. Director Cheever, I can show you the ferocious and scheming side as\nyou wish.”"
      },
      {
        "paragraph": "“Eliza, don’t be too full of yourself. ” Cindy tried to advise Eliza. “Previously, you’ve always played the\nfemale lead who’s beautiful and kind. But now, you’re the first supporting female actress who’ll be cast"
      },
      {
        "paragraph": "as a cruel and wicked woman. It’s not that simple.”"
      },
      {
        "paragraph": "“Exactly. ” Norman expressed his dissatisfaction. “ It’s not easy to act in Director Cheever’s movies.\nEven experienced actors like me only manage to pass on the third or fourth try.”"
      },
      {
        "paragraph": "“I can give it a try.”"
      },
      {
        "paragraph": "Eliza said with a smile, “Coincidentally, both Miss Turner and I will be acting in the next scene."
      },
      {
        "paragraph": "Director Cheever, if I fail, I’ll leave the set. I’ll compensate however much I’m supposed to. Of course, if\nI pass, I hope I get to stay in a hotel that’s closer to the set instead of staying alone in a hotel that’s\nover 30 kilometers away."
      },
      {
        "paragraph": "“In addition, please arrange a better car for me instead of a shabby Ford that’ll suddenly have its tire\npunctured when I drive to a remote place. Also, send me important news in advance and not… after I\narrive at the set when everyone has already had their hair styled without my knowledge. As for the\nrest… I’m not going to argue over my lounge, which is smaller than the third supporting actress’.”"
      }
    ]
  },
  {
    "title": "Chapter 1460 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Eliza’s calm, gentle voice sounded."
      },
      {
        "paragraph": "As she was speaking, Director Cheever’s expression turned grimmer. If Eliza had not personally\nmentioned this, he would not have known that she had been staying alone in a hotel that was 30\nkilometers away. Even the car that she used for traveling was a shabby Ford."
      },
      {
        "paragraph": "He also just found out that nobody from the production department had informed Eliza of anything\nregarding the shooting."
      },
      {
        "paragraph": "“Is everything she said true?” Director Cheever shifted his stern gaze to the production crew."
      },
      {
        "paragraph": "“How could it be?” Leader Wells from the production department immediately stood up. “ Yesterday, I\nasked a crew member to text her assistant. Clearly, she came late on purpose. How dare she lay the\nblame on us? She even said that she doesn’t want to stay with Cindy, that’s why I had to arrange for\nher to stay farther away. This place is remote, and there are only two good hotels here. ”"
      },
      {
        "paragraph": "“You don’t want to stay with me?” Cindy was astonished. “Why? Is it because… you’re unhappy that\nI’m the female lead of the movie?”"
      },
      {
        "paragraph": "Eliza could not be bothered to look at her. Considering that she was pursuing a career as an actress, it\nwould be exhausting for her to act in real life as well. “Director Cheever, can we start now?”"
      },
      {
        "paragraph": "At the sight of Eliza’s behavior, Director Cheever furrowed his brows. He honestly felt that she was\nwillful."
      },
      {
        "paragraph": "He disliked having willful crew members as it was not easy to control them. “Eliza, let me remind you\nthat I’ve only passed two people on their first try so far. Don’t be too full of yourself.”"
      },
      {
        "paragraph": "Eliza smiled. “I have no choice but to prove myself with my ability because I really don’t want to shoot\nin a makeup style that makes me look ugly and old- fashioned. Having said that, it shouldn’t count if it’s\nnot me who yells ‘cut’.”"
      },
      {
        "paragraph": "“Of course.” Director Cheever nodded and glanced at Cindy after that. “Get ready for the fifth scene.”"
      },
      {
        "paragraph": "Cindy was stunned. “Isn’t that supposed to take place at four o’clock in the afternoon?”"
      },
      {
        "paragraph": "“Let’s make it more difficult for her,” Director Cheever replied nonchalantly."
      },
      {
        "paragraph": "Cindy was secretly pleased. She remembered that the fifth scene was the hardest of all in the movie.\nThe scene would have the supporting actress force the female lead into a corner and poison her."
      },
      {
        "paragraph": "The shooting began shortly after."
      },
      {
        "paragraph": "After ‘action’ was called out, Eliza promptly opened her eyes and got into the mood to act. She held a\nbowl of medicine in her hand. Despite her pure and clean face, she exuded a sense of creepiness."
      },
      {
        "paragraph": "“Sister, I came to visit you…” Once Eliza started speaking, her voice sent a chill down everyone’s\nspine."
      },
      {
        "paragraph": "“What are you trying to do?” Cindy panicked at the sight of the medicine she was holding."
      },
      {
        "paragraph": "“Obviously, I’m here to visit you. Since you’re so sick, you need to drink medicine. ” Eliza reached out\nto Cindy as she approached her."
      },
      {
        "paragraph": "“Don’t come over.” Cindy shuddered in fear and retreated to the side. “Come on, I guarantee that you’ll\nno longer be in pain after you finish the medicine.” A mirthless smile spread across Eliza’s face. “You’ll\nno longer be in pain or jealous. You’ll go to a place where humans can’t live, and it’s relaxing there…”"
      }
    ]
  },
  {
    "title": "Chapter 1461 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“You’re crazy. You must’ve spiked the drink, right? I won’t drink it.” Cindy began to scream. “Daphne,\nwe used to be friends. Have you forgotten our promise to fly high together…”"
      },
      {
        "paragraph": "“Yeah, but I’ll €y high on my own. I’m really sick of you. Whenever we’re together, you’re forever the\none in the limelight. All he thinks about and sees is you.” Eliza made this statement coolly throughout,\nbut her eyes revealed wickedness and cruelty. “Go to hell, Sister.”"
      },
      {
        "paragraph": "As soon as she finished speaking, she squeezed Cindy’s chin forcefully."
      },
      {
        "paragraph": "Director Cheever watched the scene from the camera. Despite looking pretty and clean, Eliza was able\nto portray the ferocity, insanity, and wickedness of the character superbly."
      },
      {
        "paragraph": "Eliza had not screamed or deliberately widened her eyes."
      },
      {
        "paragraph": "It felt like… it was in her nature to be so evil. Compared to Eliza, Cindy’s expression was…"
      },
      {
        "paragraph": "relatively exaggerated and unnatural."
      },
      {
        "paragraph": "She could not express her fear and frustration well so she had to resort to shrieking and goggling."
      },
      {
        "paragraph": "Needless to say, Eliza beat Cindy hands down in acting."
      },
      {
        "paragraph": "“Norman, join the scene.” Director Cheever turned around and called for the male lead."
      },
      {
        "paragraph": "Norman was stunned. “I’m supposed to appear in the sixth scene. Should I join now?”"
      },
      {
        "paragraph": "“I want to see what Eliza’s full potential is,” Director Cheever said, “I hope you can continue from her\npart.”"
      },
      {
        "paragraph": "Norman nodded with a somber expression. He might not be fond of Eliza previously, but he treated all\nactors with respect. Moreover, he was really impressed by Eliza’s acting."
      },
      {
        "paragraph": "“Stop.” Norman dashed in when he saw Eliza forcing Cindy to drink the medicine. Filled with disbelief,\nhe roughly dragged Eliza away. “What are you feeding her?”"
      },
      {
        "paragraph": "Eliza’s vicious expression was instantly replaced with an aggrieved and confused look. She acted just\nlike an innocent girl. “I’m feeding her some medicine. She’s very sick.”"
      },
      {
        "paragraph": "In the gazebo."
      },
      {
        "paragraph": "The second cigarette that Chester smoked had finished burning without him realizing it."
      },
      {
        "paragraph": "He took a light breath and produced a masculine nasal voice."
      },
      {
        "paragraph": "Indeed, that woman… would take him by surprise time and again."
      },
      {
        "paragraph": "She actually acted so flawlessly in front of Director Cheever, who aimed for perfection."
      },
      {
        "paragraph": "In the last scene, Norman personally killed Eliza. Eliza expressed her feelings of despair and hatred for\nher lover in such a distinct and organized manner as if she was truly experiencing love, hatred, despair,\nand death herself."
      },
      {
        "paragraph": "Chester put out the cigarette in his hand before he turned around and left."
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "Director Cheever made a hand gesture. The scene finally came to an end."
      },
      {
        "paragraph": "Eliza wiped the tears in the corners of her eyes with a tissue. After that, she walked up to him"
      },
      {
        "paragraph": "Composedly. “Director Cheever, was my performance okey?”"
      },
      {
        "paragraph": "Director Cheever gazed at her seriously. She had just withdrawn from a scene full of conflict, yet she\ncould detach herself from her role so swiftly. Even an experienced actor like Norman needed time to\ncome back to himself."
      },
      {
        "paragraph": "She was born to make a career out of acting."
      },
      {
        "paragraph": "Unfortunately, she was not the female lead of this movie. Otherwise…"
      },
      {
        "paragraph": "Director Cheever sighed internally. “You can stay.” Director Cheever nodded and said to the production\ncrew, “Arrange for Eliza to stay in a nearer hotel and get the third supporting actress to exchange\nlounges with her. Today is just going on from now onward. Don’t treat me like a fool. If anyone does this\nagain, you won’t have to come anymore does this again, you won’t have to come anymore regardless\nof who got you here. Alright, let’s have lunch.”"
      }
    ]
  },
  {
    "title": "Chapter 1462 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Director Cheever left as soon as he finished speaking."
      },
      {
        "paragraph": "Eliza followed suit."
      },
      {
        "paragraph": "Everyone gazed at her silhouette incredulously. They could not believe that someone could actually\npass on their first try when filming with Director Cheever."
      },
      {
        "paragraph": "Moreover, Eliza was not nervous at all when shooting with Norman, the best actor. Her acting was even\ncomparable to his, causing the female lead, Cindy, to pale into insignificance."
      },
      {
        "paragraph": "Cindy, who was being supported by her assistant, was inwardly seething. She did not expect Eliza to\nbe able to act so brilliantly."
      },
      {
        "paragraph": "She had to kick Eliza out, or Eliza would outperform her once the movie was released."
      },
      {
        "paragraph": "Something seemed to hit Cindy."
      },
      {
        "paragraph": "She darted a glance at the gazebo, only to realize that Chester had left without her knowledge."
      },
      {
        "paragraph": "She sighed in annoyance. Chester must have witnessed what had happened just now."
      },
      {
        "paragraph": "After Chester got into the car, the chauffeur asked, “ Young Master Jewell, are you going back to\nCanberra?”"
      },
      {
        "paragraph": "“Not yet. Let’s find a place to have lunch. ” Chester closed his eyes."
      },
      {
        "paragraph": "The chauffeur dropped him off at a restaurant. Just when Chester finished his meal, he received a call\nfrom Shedrick. “What are you doing?”"
      },
      {
        "paragraph": "“I’m eating. What’s the matter?” Chester asked nonchalantly."
      },
      {
        "paragraph": "“Director Cheever called me just now, ” Shedrick said while feeling torn, “He asked if he can make Eliza\nthe female lead. He said as long as we agree, he’ll personally make a movie for Felix Media next year\nand it’ll be up to us to decide the cast.”"
      },
      {
        "paragraph": "Chester raised his brows but grasped the message in no time."
      },
      {
        "paragraph": "If he were Director Cheever, he would do the same too."
      },
      {
        "paragraph": "Eliza had proven that she could act extremely evil no matter how beautiful she was."
      },
      {
        "paragraph": "If she continued to act in the movie, Cindy would not only lose to her in terms of acting but also beauty."
      },
      {
        "paragraph": "After the movie was released, people would surely lash out at the female lead, which was an outcome\nfar from what Director Cheever expected."
      },
      {
        "paragraph": "In this case, Eliza must be replaced. However, given that Director Cheever appreciated talented actors,\nhe would definitely not be able to bring himself to do that."
      },
      {
        "paragraph": "As such, Director Cheever had no choice but to find a way to switch Cindy out."
      },
      {
        "paragraph": "Shedrick gave a light cough. “Director Cheever said that if Eliza plays the female lead in the movie, the\nmovie will certainly be nominated for an international award. He’s willing to make a new movie that\nsuits Cindy next year.”"
      },
      {
        "paragraph": "“Cindy is my fiancée. Plus, the shooting has begun. Switching her out just like that will make me look\nso bad,” Chester said franHy. As much as he"
      },
      {
        "paragraph": "resented Cindy, she would affect his dignity."
      },
      {
        "paragraph": "“But even if she stays… Eliza will still outdo her. ” Shedrick coughed lightly before he continued, “\nDirector Cheever said he’ll carry on with the"
      },
      {
        "paragraph": "shooting. When Cindy is switched from the female lead to the supporting actress, the public will leave\nsome nasty comments. Even so, that’s not something he can control.”"
      },
      {
        "paragraph": "“Do you believe so?” Chester’s elegant and handsome face gave nothing away."
      },
      {
        "paragraph": "“Director Cheever said you were there this morning too.”"
      },
      {
        "paragraph": "Shedrick whispered, “Just announce to the public that Cindy is suddenly unavailable as she’s getting\nmarried soon. Since she wants to be on camera, we’ll let her attend a few variety shows. Come to think\nof it, if Eliza shoots to fame, she’ll become the company’s milch cow. I didn’t expect this woman to\nperform so well when we signed a contract with her. Tsk. She was average several years ago, but after\nshe broke up, her acting skills have improved significantly.”"
      },
      {
        "paragraph": "“Her acting skills improved significantly due to the breakup?” Chester curled his lips as he recalled\nEliza’s gaze that was filled with resentment, despair, and misery just now."
      },
      {
        "paragraph": "Was it because she had experienced that kind of pain?"
      },
      {
        "paragraph": "Was she that concerned about Monte?"
      }
    ]
  },
  {
    "title": "Chapter 1463 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shedrick said, “Sure enough, good actors will only be able to perform well if they have experienced the\nsituation themselves. By the way, since you’re not saying anything, I’ll… ask Cindy to come back. I’ll tell\nher that it’s your decision, okay?”"
      },
      {
        "paragraph": "“You’re good at shifting the responsibility to me, huh?” Chester expressed a sense of sarcasm."
      },
      {
        "paragraph": "“Ahem. Do I have any other choice? Everyone knows that she’s your woman. How can I manage her?”\nShedrick said embarrassedly, “Why don’t you tell her in person?”"
      },
      {
        "paragraph": "“No need. I don’t want to say such harsh things to her.”"
      },
      {
        "paragraph": "Chester hung up the call."
      },
      {
        "paragraph": "On the set."
      },
      {
        "paragraph": "After Eliza finished her lunch, she leaned idly on the chair to rest."
      },
      {
        "paragraph": "Leanne quickly advised her, “Don’t rest anymore."
      },
      {
        "paragraph": "The shoot that’s scheduled this afternoon is about to begin. Although you’ve managed to convince\nDirector Cheever with your acting this morning, he dislikes snobbish actors.”"
      },
      {
        "paragraph": "“You’re overthinking it. I just feel that… I might not be able to shoot this afternoon.” Eliza lazily took a\nbottle of mineral water and sipped on it."
      },
      {
        "paragraph": "Leanne was stunned. “Why?” Eliza’s exquisite lips curled up."
      },
      {
        "paragraph": "At this moment, the door of her lounge was kicked open."
      },
      {
        "paragraph": "Cindy walked in with exasperation. “Eliza, what a scheming woman you are!”"
      },
      {
        "paragraph": "“What are you saying?” Eliza tilted her head with an innocent look."
      },
      {
        "paragraph": "“Stop pretending!” Cindy roared, “You deliberately dolled yourself up to shoot with me. You\noutperformed me in every way so that Director Cheever would switch out my role as the female lead.\nMy company has called me back because you’re now the female lead of the movie.”"
      },
      {
        "paragraph": "Leanne gaped and cast a look at Eliza. It finally dawned on her why Eliza said she might not be able to\nshoot this afternoon."
      },
      {
        "paragraph": "Eliza smiled faintly. “Was I the one who caused you to act worse than me? Was I the one who caused\nyou to be born with an uglier face than mine?”"
      },
      {
        "paragraph": "“You…” Cindy glowered at her viciously. After a while, she snorted. “Eliza, don’t think that you can rise\nto the top just because you’re the female lead now. Let me tell you that I’m going to marry Chester, the\nman who dominates half of the entertainment industry. No matter how high you climb, I can destroy you\nanytime. I’ll keep today’s incident in mind. Since you made a move on me, I’ll make you regret it.”"
      },
      {
        "paragraph": "“Haven’t you already kept it in mind since this morning’s incident?”"
      },
      {
        "paragraph": "Eliza’s eyes turned grim. “You deliberately asked them to place me in a hotel at a remote place and get\nme a shabby car to make me late. You also bribed the crew from the production and costume\ndepartments. Even my lounge was worse than the third supporting actress’ lounge. Cindy, you’re so\nskilled at being a bully even before you marry into the Jewell family.”"
      },
      {
        "paragraph": "“Well, you deserve all this, ” Cindy said coldly, “I’ve never seen such a shameless person like you who\nseduces someone else’s fiancé.”"
      },
      {
        "paragraph": "“You sound as if you have a sense of shame.”"
      },
      {
        "paragraph": "Eliza remained on the chair without bothering to get up. Although she had to lift her head to look at\nCindy, she still displayed a strong aura. “At least I gained a foothold in the entertainment industry with\nmy acting. What about you? As a singer, you plagiarized your former best friend’s works. As an\nactress, could you have won the award if Chester hadn’t pulled some strings? To be honest, why do\nyou want to be an actress? You might as well serve Chester well on the bed. Perhaps he’ll be able to\nbuy you the best actress award next year.”"
      },
      {
        "paragraph": "Leanne quaked in her boots as she gazed at Eliza’s frosty expression."
      },
      {
        "paragraph": "How audacious of Eliza to have a row with Cindy."
      },
      {
        "paragraph": "“Well done, Eliza. I’ll remember every word you said and let Chester know about it. With that, your\nacting career will end here.” Cindy turned around while trembling. Having trained herself to be calm and\nsensible for years, she did not attack Eliza in the end."
      },
      {
        "paragraph": "She just kicked the door of the lounge violently when she left."
      }
    ]
  },

  {
    "title": "Chapter 1464 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "As soon as those who were watching the drama outside the door saw Cindy’s furious expression, they\navoided her for fear that they would suffer."
      },
      {
        "paragraph": "Anxious, Leanne shifted her gaze to Eliza. “Miss Robbins, I know you hate Cindy, but you made her\nlook so bad. After all, she’s Young Master Jewell’s fiancée. Even President Daley has to treat her with\nrespect.”"
      },
      {
        "paragraph": "“It’s fine. If I fail to become an actress, you can join me in starting a business in the future, ” Eliza said\nin a light-hearted manner, “My entrepreneurial skills are better than my acting skills.”"
      },
      {
        "paragraph": "Leanne was speechless. “Please don’t lie to me. When have you ever started a business? What’s\nmore, it’s all too easy for the Jewell family to destroy anyone.”"
      },
      {
        "paragraph": "“ I know.” Eliza laughed with a trace of sarcasm in her voice."
      },
      {
        "paragraph": "No one knew it better than her because she was the one who had gotten destroyed previously."
      },
      {
        "paragraph": "Soon, Director Cheever held an urgent meeting. “ Since Cindy is getting married at the end of this year,\nshe might not have enough time to shoot a movie. After discussing with her company, we’ve decided to\nsubstitute her with Eliza. She’ll now be the female lead. The first supporting actress will only join the\ncast the day after tomorrow, so everyone can rest in the next two days. Eliza, do familiarize yourself\nwith the script for the female lead in the meantime.”"
      },
      {
        "paragraph": "“Alright. ” Eliza took the script under everyone’s surprised looks."
      },
      {
        "paragraph": "No one believed that Cindy left so abruptly because of her wedding."
      },
      {
        "paragraph": "It was probably because Eliza’s acting was too superb. If Cindy continued to be the female lead, she\nwould be beaten hands down. Hence, she had no choice but to quit. That was also why Eliza and\nCindy had a row this afternoon."
      },
      {
        "paragraph": "However, everyone was shrewd enough to keep quiet."
      },
      {
        "paragraph": "Since there were no scenes to shoot this afternoon, Eliza headed back to the hotel by car."
      },
      {
        "paragraph": "She planned to return to Canberra for two days after taking a bath."
      },
      {
        "paragraph": "As it was sweltering in the bathroom, she only came out with a towel wrapped around her body."
      },
      {
        "paragraph": "The moment she came out, she was stunned at the sight of the figure on the couch. Chester was still\ndressed in the same expensive shirt and pants from this morning. Beneath his short black hair was an\nelegant and handsome face."
      },
      {
        "paragraph": "Who would have thought that such a person would barge into someone else’s room without knocking\non the door?"
      },
      {
        "paragraph": "“Chester Jewell, how did you get in?” Eliza became sulky. Under such circumstances, she could not\nhelp but lose her composure."
      },
      {
        "paragraph": "“Through the door.” Chester raised two long fingers that held a thin room card between them."
      },
      {
        "paragraph": "He gazed at the woman in front of him with interest. The pink towel was wrapped around the woman’s\nprivate parts, revealing only her shoulders and calves that were covered with water droplets. She had\njust washed her thick hair. She had not dried it and it was tied into a bun. Her face and collarbone were\nso exquisite that any man would be crazy about her."
      },
      {
        "paragraph": "However, what caused Chester to zone out was her dark eyes."
      },
      {
        "paragraph": "She looked like Charity when she was a teen."
      },
      {
        "paragraph": "This was also what Charity had looked like after Chester did it with her for the first time. She had come\nout of the bathroom with her hair tied into a bun. Her eyes had also looked the same way, carrying a\nhint of unease and bashfulness as she tried to calm herself down."
      },
      {
        "paragraph": "All of a sudden, Chester felt his body burning uncontrollably."
      },
      {
        "paragraph": "Many people said that he was a playboy, but only he knew that he was not a horny man. At that\nmoment, however, he was just like a young man who had never seen the world before."
      }
    ]
  },
  {
    "title": "Chapter 1465 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "It was as though Chester had turned into his young self from back then."
      },
      {
        "paragraph": "How long has it been? Seven or eight years?"
      },
      {
        "paragraph": "It had been so long that he had nearly forgotten about it."
      },
      {
        "paragraph": "Eliza was shaking with rage, but she regained her composure very soon. She hurriedly walked to the\nbedside and grabbed the clothes on the bed."
      },
      {
        "paragraph": "Chester fixed his eyes on her slim calves beneath the towel without looking away."
      },
      {
        "paragraph": "Eliza could only turn a blind eye to him and headed to the bathroom with her clothes."
      },
      {
        "paragraph": "As she was wrapped in a towel, she could not take large strides into the bathroom. Therefore, she\nwalked with graceful movement."
      },
      {
        "paragraph": "She was so nervous that she dared not breathe hard for fear that Chester would force a passionate\nkiss onto her like he previously did."
      },
      {
        "paragraph": "She still had her clothes on back then. If he did it right now, she would not be able to fight back."
      },
      {
        "paragraph": "Luckily, Chester remained seated there without rising to his feet."
      },
      {
        "paragraph": "Only after Eliza entered the bathroom and closed the door did she heave a sigh of relief."
      },
      {
        "paragraph": "Chester smoked a cigarette, and the smoke obscured the flame within the depths of his eyes."
      },
      {
        "paragraph": "He took another deep breath. Amid his discomfort, he cursed inwardly."
      },
      {
        "paragraph": "He never thought that he would one day fall for a woman because of her silhouette."
      },
      {
        "paragraph": "It must be due to the fact that he had not been in a relationship for a long while."
      },
      {
        "paragraph": "That was very incompetent of him."
      },
      {
        "paragraph": "Soon, the door of the bathroom was opened once more. Eliza walked out wearing an ordinary pink\nstriped T-shirt and a pair of jeans. She looked like a young woman who was still in university."
      },
      {
        "paragraph": "“ I didn’t expect you to wear a pink shirt, ” Chester blurted it out subconsciously."
      },
      {
        "paragraph": "“Why can’t I wear pink?” Eliza asked. It was true that she rarely wore pink, but this shirt was"
      },
      {
        "paragraph": "sponsored by a luxurious brand. Since she had received the endorsement fees, she had to wear it."
      },
      {
        "paragraph": "Chester, who was holding a cigarette, was stunned. His long eyelashes cast shadows beneath his\neyes."
      },
      {
        "paragraph": "Indeed, who said Eliza could not wear it? From the moment he met her, her gaze that closely\nresembled Charity’s made him feel as though Charity’s spirit was in Eliza’s body."
      },
      {
        "paragraph": "After all, he remembered that Charity had never worn pink. She was always cold and distant. Even the\ncolor of her clothes said it all."
      },
      {
        "paragraph": "“Chester Jewell, I don’t care what you do with the other female artists under Felix Media, but let me\nremind you that you need to knock on the door before you enter my room next time. Don’t barge in\nwithout my permission.”"
      },
      {
        "paragraph": "Eliza could no longer put up with this human. “ Although I’ve been signed to Felix Media, I didn’t sell my\nwhole body to the company. Please give me some privacy.”"
      },
      {
        "paragraph": "“Aren’t you clear about my motive for barging in?”"
      }
    ]
  },
  {
    "title": "Chapter 1466 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Chester propped both his legs up on the coffee table, his eyes dark and bottomless. “Eliza, you’re quite\na scheming woman. You made a bet with Director Cheever on your acting in front of the crew. You\nsimply outdid the male lead, who’s the best actor, much less Cindy. You wanted to let Director Cheever\nknow that you’re a perfect actress so that he won’t be able to bring himself to lose you."
      },
      {
        "paragraph": "However, since you’re staying, you’d steal the limelight from Cindy who’s supposed to play the lead.\nHence, Director Cheever had no choice but to kick Cindy out. Cindy doesn’t want to let you steal her\nthunder following the release of the movie. As such, she couldn’t do anything else other than leave\nreluctantly.”"
      },
      {
        "paragraph": "“Well, there’s nothing I can do about it. Initially, I just wanted to obediently play the first supporting\nfemale role, but your fiancée bribed the crew to trouble me on the first day.”"
      },
      {
        "paragraph": "Eliza started packing her things calmly. She was going to check out and return to Canberra later."
      },
      {
        "paragraph": "“To be honest, your fiancée Cindy doesn’t like me because she saw me coming out of your office\nlooking disheveled the other day. She’s been thinking of me as a thorn in her side since then. If\neveryone had been willing to peacefully finish shooting this movie, I’d be happy to play opposite her as\nthe first supporting actress. But obviously, she had no intention of doing so.”"
      },
      {
        "paragraph": "Eliza raised her head and looked at Chester coolly. “ Sorry, I can’t tolerate and shy away from her all\nthe time. The more I shy away, the more she takes pleasure in bullying me. What’s more, why am I to\nblame for her poor acting?”"
      },
      {
        "paragraph": "“How dare you badmouth my fiancée in front of me and make her seem worthless?! ” Chester grimly\nunfastened a button on his collar."
      },
      {
        "paragraph": "“I’m just telling the truth. If you wish to hear insincere remarks, you can look for someone else.”"
      },
      {
        "paragraph": "Eliza continued impassively, “She’s not worthless. She should be… good in bed. Otherwise, why would\nyou have chosen her out of many other beautiful women?”"
      },
      {
        "paragraph": "“Eliza, are you saying I pick a marriage partner with the lower half of my body?” Chester stood up and\nwalked up to her. He pinched her chin, smiling mirthlessly."
      },
      {
        "paragraph": "Only at that point did he realize that her skin was so soft. It felt wonderful to the touch."
      },
      {
        "paragraph": "With her chin being pinched, her pink lips that curled upward a little looked so sexy that he had the\nsudden impulse to kiss them."
      },
      {
        "paragraph": "Eliza held her breath. She could clearly sense the changes in the man’s gaze and his menacing scent\nat such a close distance. As a result, she did not dare act recklessly. “No. I just think that you’re more\nconcerned about the lower half of your body than love.”"
      },
      {
        "paragraph": "“You understand me really well.” Chester approached her with a sinister smile."
      },
      {
        "paragraph": "Eliza slowly retreated until her bottom landed on the bed."
      },
      {
        "paragraph": "Chester bent over and pinned both her hands on the bed. Both of them remained in a flirtatious\nposition. “Eliza, don’t forget that at the end of the day, Cindy is my fiancée. When you forced Director\nCheever to kick her out, it was a slap in the face for me. People who previously dared do this to me are\nno longer in Australia.”"
      },
      {
        "paragraph": "“So?” Eliza scanned the man closely with her stony eyes."
      },
      {
        "paragraph": "Chester felt helpless. With his handsome face and outstanding identity, any woman who saw him back\nthen would blush and melt. Only Eliza behaved like a cold-blooded woman. “I can destroy you.”"
      },
      {
        "paragraph": "After some time, he continued, “Having said that, if you consider spending the night with me, I might let\nyou go.”"
      },
      {
        "paragraph": "Eliza looked down with a note of sarcasm flashing across the depths of her eyes."
      },
      {
        "paragraph": "This was the man she used to be madly in love with. He was really… disgusting."
      },
      {
        "paragraph": "“If I could agree, I wouldn’t have fought back in the office last time.” Eliza shook her head. “Young\nMaster Jewell, actually… You used to do it with Charity, huh?”"
      },
      {
        "paragraph": "Chester’s body stiffened."
      },
      {
        "paragraph": "The mention of Charity touched his raw nerve."
      },
      {
        "paragraph": "“But I heard when Charity was arrested back then, you were the one who personally got an attorney to\nsend her to jail.”"
      },
      {
        "paragraph": "Eliza broke free from his hand and said with a cold gaze, “Although I haven’ t talked to Charity for a\nlong time, I’ll remember her face forever. She’s my childhood friend. I’m sorry but I can’t spend the\nnight with the man who used to sleep with my friend. I just find it uncomfortable. I’d rather lose\neverything.”"
      }
    ]
  },
  {
    "title": "Chapter 1467 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Plus… I don’t want to be treated as a toy by men.”"
      },
      {
        "paragraph": "Eliza lifted her hand and removed her watch. There was a prominent scar on her wrist. “Can you see\nthis? This happened in my previous relationship. Everyone said that I approached Monte because of\nhis status. In fact, I was really in love with him but he abandoned me. I chose to kill myself, but I didn’t\ndie. Hah. In the end, he mocked my attempt to kill myself and said it was a way of winning his\nsympathy.”"
      },
      {
        "paragraph": "Chester fixed his astonished gaze on the prominent scar on her wrist. He could not figure out why a\ncool person like her would kill herself."
      },
      {
        "paragraph": "How madly was she in love with Monte, that scumbag?"
      },
      {
        "paragraph": "“I’m not Monte, ” Chester said with a hoarse voice, “Monte chases after women to win their hearts and\nbodies, but I just want your body.”"
      },
      {
        "paragraph": "Eliza was stunned. Suddenly, she laughed. “Indeed, you’re openly scummy. Are you trying to say that\nI’m not attractive at all except for my body?”"
      },
      {
        "paragraph": "Chester’s deep gaze was thought-provoking. “ Maybe…”"
      },
      {
        "paragraph": "“Fine. Ever since I entered this industry, I’ve seen people cutting corners. But if I take off my clothes in\nfront of you today, I can do it in front of another man tomorrow as well.”"
      },
      {
        "paragraph": "Eliza shook her head. “If I were to lead such a life, I’d rather leave this place.”"
      },
      {
        "paragraph": "“When a celebrity is at their lowest ebbs, do you know how many people will treat them as a laughing\nstock?” Chester teased."
      },
      {
        "paragraph": "“I know. Some celebrities have switched their careers to become teachers and even sales people.\nRegardless, those are still jobs. Making 3,000 to 4,000 dollars per month is still enough to get by,” Eliza\nresponded indifferently."
      },
      {
        "paragraph": "Staring fixedly at her, Chester could not help but be convinced of her words."
      },
      {
        "paragraph": "There had been too many women around him who tried so hard to climb the ladder. Among them,\nCindy was the most aggressive one."
      },
      {
        "paragraph": "However, Eliza was an exception. She was just as cool and clear as a pool of water."
      },
      {
        "paragraph": "She crammed her things into her suitcase and zipped it up without looking at him. “Young Master\nJewell, if you’d like to stay here, you can continue staying here. I’m going back to Canberra.”"
      },
      {
        "paragraph": "Once she finished speaking, she wanted to pick up the other suitcase."
      },
      {
        "paragraph": "A long hand quickly reached out and took the suitcase before she could do it."
      },
      {
        "paragraph": "“Coincidentally, I’m going back to Canberra too. Let’s go back together.” Chester glanced at her."
      },
      {
        "paragraph": "“I think you’re mistaken, you’re supposed to pick Cindy up.” Eliza tried to get her suitcase back, but she\nwas unable to move it at all even after some time. “Young Master Jewell, I’m going to be in trouble if\npeople spot me being with you.”"
      },
      {
        "paragraph": "“Are you still afraid of getting into trouble when you’re already prepared to quit the entertainment\nindustry and look for another job?” Chester curled his lips with a playful expression."
      },
      {
        "paragraph": "Eliza was speechless. “If Cindy finds out about it, she won’t let me go even if I decide to leave the\nentertainment industry.”"
      },
      {
        "paragraph": "“That’s your problem, then. ” Chester pulled her suitcase away."
      },
      {
        "paragraph": "Eliza swiftly went after him. The two of them began pulling at each other."
      },
      {
        "paragraph": "“You really want others to see this, huh?” Chester raised his brows."
      },
      {
        "paragraph": "Eliza had no choice but to head downstairs reluctantly. Then, she got into his car."
      },
      {
        "paragraph": "When the chauffeur saw Eliza, there was hardly any expression on his face. Shortly after, he started\nthe car calmly."
      },
      {
        "paragraph": "Eliza, who was at her wit’s end, texted Leanne to inform her that she had left."
      },
      {
        "paragraph": "The journey back to Canberra took about one and a half hours."
      },
      {
        "paragraph": "After looking down at her phone for a while, Eliza felt uncomfortable, so she closed her eyes."
      },
      {
        "paragraph": "As she had read the script until late at night yesterday, she soon fell asleep."
      },
      {
        "paragraph": "Chester turned around and looked at the woman who was leaning against the window with her eyes\nclosed. Her eyelashes were thick like feathers, while her nose was tiny yet tall. She was too pretty."
      },
      {
        "paragraph": "He rested his eyes on her for some time."
      },
      {
        "paragraph": "Upon noticing his behavior, the chauffeur in front deliberately made a turn."
      }
    ]
  },
  {
    "title": "Chapter 1468 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Eliza’s head immediately tilted toward him and happened to fall on his shoulder."
      },
      {
        "paragraph": "Chester glanced at the chauffeur who smiled bashfully. After all, the chauffeur understood him the\nmost, considering that he had worked for him for many years."
      },
      {
        "paragraph": "From the way Chester looked at the woman, the chauffeur was certain that he had feelings for her."
      },
      {
        "paragraph": "In fact, Chester had no intention of doing anything to her."
      },
      {
        "paragraph": "Ever since Eliza said that she did not want to share the same man as Charity, he had given up the idea\nof sleeping with her."
      },
      {
        "paragraph": "Other women could do that except for her because she was Charity’s friend."
      },
      {
        "paragraph": "At this point, however, this woman was leaning on his shoulder. The scent that emanated from her hair\nwas exactly the same as Charity’s scent."
      },
      {
        "paragraph": "Strange enough, he had always remembered Charity’s scent."
      },
      {
        "paragraph": "Chester tightened his grasp on his phone. Every time this woman sprang to mind, he felt as if someone\nwas crushing his heart."
      },
      {
        "paragraph": "The sensation has been getting stronger recently."
      },
      {
        "paragraph": "After the one -hour journey, Eliza woke up when the car stopped."
      },
      {
        "paragraph": "She opened her eyes in a daze, only to find herself resting on the man’s shoulder."
      },
      {
        "paragraph": "She lifted her head and met Chester’s dark gaze that carried a discreet smile. “Was my shoulder\nuseful?”"
      },
      {
        "paragraph": "Eliza frowned in annoyance. She had planned to keep a distance from him, yet she ended up sleeping\non his shoulder."
      },
      {
        "paragraph": "“Sorry. I was too deeply asleep.”"
      },
      {
        "paragraph": "“Because of you, my shoulder is aching.” Chester cocked his brows. “Don’t you feel the need to make it\nup to me?”"
      },
      {
        "paragraph": "“I’ll make more money for the company.” As soon a s Eliza finished her sentence, she gazed out the\nwindow only to realize that she had arrived at her neighborhood."
      },
      {
        "paragraph": "Nevertheless, how did he know where she lived?"
      },
      {
        "paragraph": "She suddenly recalled that her company had her address. What an omnipotent man he was."
      },
      {
        "paragraph": "“Money?” Chester smirked. “Sorry, money is something I need the least.”"
      },
      {
        "paragraph": "“That’s your problem.” Eliza opened the door to get out of the car."
      },
      {
        "paragraph": "A hand suddenly grabbed her wrist and pulled it. Eliza, who was caught off guard, fell onto his chest."
      },
      {
        "paragraph": "“Chester Jewell, let go of me.” Eliza subconsciously struggled. She then heard the man gasp."
      },
      {
        "paragraph": "“Eliza, where are your hands pressing? ” Chester asked throatily."
      },
      {
        "paragraph": "Eliza looked down and saw that her hands were not pressing against the part where she was not\nsupposed to press. Even so… he had a strong reaction even though her hands were just pressing\nagainst his thighs."
      },
      {
        "paragraph": "Slightly dazed, she asked, “Chester Jewell, how desperate are you? Even Cindy can’t satisfy your\ndesires, huh?”"
      },
      {
        "paragraph": "“Eliza, tell me how many times you’ve seduced me today? I’ve always been enduring it.” An evil, wry\nsmile spread across Chester’s handsome face."
      },
      {
        "paragraph": "Eliza opened her mouth. Just as she was about to speak, Chester interrupted her, “Don’t explain. I\nwent to your room to get even with you, yet you were taking a bath. What was worse, you came out of\nthe bathroom without putting on your clothes."
      },
      {
        "paragraph": "Also, you rested your head on my shoulder in the car. For your information, I’m particularly powerful in\nthis aspect.”"
      },
      {
        "paragraph": "He approached her and uttered the last few words by her ear flirtatiously."
      },
      {
        "paragraph": "Instead of finding it flirtatious, Eliza felt so disgusted that she knitted her brows together."
      },
      {
        "paragraph": "At the sight of her expression, Chester lost his temper. “Eliza, are you a f*cking rock?”"
      },
      {
        "paragraph": "Even a man like him had shown a reaction."
      }
    ]
  },
  {
    "title": "Chapter 1469 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Nope, ” Eliza replied brutally. After a moment of silence, she said, “If you were single, I might have a\nslight interest in you. But now that you’re already married, you even came to flirt with me. As a decent\nwoman, I feel that you’re— ”"
      },
      {
        "paragraph": "“What about me?” Seeing her holding back, Chester interrupted her impatiently."
      },
      {
        "paragraph": "“Too much of a scumbag, ” Eliza said, “Your behavior is disgusting, yet you enjoy it, thinking that you’re\nvery good at flirting.”"
      },
      {
        "paragraph": "Chester’s handsome face darkened as she was making him look terrible."
      },
      {
        "paragraph": "“Well done, Eliza.” He smiled grimly before he suddenly pushed her out of the car. “Get out.” Eliza\nhurriedly got out and took her suitcase."
      },
      {
        "paragraph": "After realizing that she was not looking back at all, Chester took out a cigarette. He snapped the\ncigarette into two instead of lighting it."
      },
      {
        "paragraph": "A moment later, he laughed darkly, which sent a chill down the chauffeur’s spine."
      },
      {
        "paragraph": "Chester returned to the top floor of his residence that was over 300 square meters. Once he got out of\nthe elevator, he caught sight of Cindy at the door."
      },
      {
        "paragraph": "The minute she saw Chester, she walked up to him with reddened eyes. “Young Master Jewell,\nShedrick asked me to quit Director Cheever’s movie. He said Eliza will take over as the female lead…”"
      },
      {
        "paragraph": "“I know.” Chester unlocked the door with his fingerprint."
      },
      {
        "paragraph": "Cindy tugged on his shirt. “Chester, everyone out there knows that I’m your fiancée. Moreover, I’ve\nalready joined the crew for The Belle and started shooting. If I quit after one day, how will the public\nview me? They’ll surely assume that Director Cheever disapproves of my acting. Everyone will make\nfun of me. I’m going to marry you soon. Not only will this matter bring shame on me but also you and\nthe Jewell family.”"
      },
      {
        "paragraph": "Chester turned around and looked at her dark, appealing eyes."
      },
      {
        "paragraph": "He could not help but think about Eliza, who was cool and sensible. Although she spoke harshly, at\nleast she was genuine and frank."
      },
      {
        "paragraph": "“Chester… Why are you looking at me this way?” His stare made Cindy uneasy. “I’m just telling the\ntruth.”"
      },
      {
        "paragraph": "“Cindy, so you do realize that you’ve brought shame on me, huh?” Chester snorted. “I helped you\nsecure a role in Director Cheever’s movie, yet you were asked to leave after one day. You’re really a\ndisgrace to me.”"
      },
      {
        "paragraph": "Cindy’s face flushed with embarrassment. “ It was all Eliza’s doing—”"
      },
      {
        "paragraph": "“Was it because she acted so well and it made you pale into insignificance?” Chester interrupted her, “ I\nwas at the set. As an outsider, I could see how she beat you hands down. Do you think Director"
      },
      {
        "paragraph": "Cheever would allow you to carry on with the shooting and let you make a fool of yourself? Either way,\nyou’re a disgrace.”"
      },
      {
        "paragraph": "Stung by his criticisms, Cindy felt a burning sensation on her face. “The company shouldn’t have\nallowed Eliza to join the movie in the first place.”"
      },
      {
        "paragraph": "“ I thought you’d be able to beat Eliza, considering how well you usually act in front of me. Who knew\nyour acting is fine in real life but so awful in front of the camera.”"
      },
      {
        "paragraph": "A sarcastic look washed over Chester’s face.“ Moreover, are you under the impression that Director\nCheever is a fool? Given your lousy acting on the first day, why would he want to keep you?”"
      },
      {
        "paragraph": "When Cindy opened her mouth, Chester said impatiently, “Enough. Stop acting in front of me. You can’t\ndo anything well. Also, let me remind you that I agreed to marry you but that doesn’t mean you can use\nmy identity to bully others out there.”"
      },
      {
        "paragraph": "Cindy’s face turned ghastly. “ Is it because of Eliza? As I said, Monte has fooled around with her before"
      },
      {
        "paragraph": "Before she could finish her sentence, Chester squeezed her neck."
      },
      {
        "paragraph": "“Cindy Turner, what gives you the right to criticize Eliza? If you weren’t useful, I wouldn’t f*cking allow\nsuch a good-for-nothing troublemaker like you to be in my sight. Get lost.” Chester let go of her. “If you\nstill don’t behave yourself, I can choose not to marry you anytime. Do you know that?”"
      },
      {
        "paragraph": "Cindy’s lips quivered. The sight of his indifferent but beautiful gaze filled her with dread and awe."
      },
      {
        "paragraph": "“Alright, Chester. Don’t be mad. I’ll leave right now.”"
      },
      {
        "paragraph": "She tottered into the elevator."
      }
    ]
  },
  {
    "title": "Chapter 1470 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "After the elevator went down, Cindy was trembling with resentment."
      },
      {
        "paragraph": "She wished she could kill Eliza if possible. Nevertheless, what she feared most right now was that\nChester would decide not to marry her."
      },
      {
        "paragraph": "She loved this man. Although he was indifferent and cruel, she was still in love with him."
      },
      {
        "paragraph": "As for Eliza…"
      },
      {
        "paragraph": "It was not too late for her to deal with Eliza after she married Chester."
      },
      {
        "paragraph": "Cindy gnashed her teeth. At this moment, her phone rang and displayed a strange number."
      },
      {
        "paragraph": "Perturbed, she picked up the call without much thought. A pleasant laugh subsequently sounded. “ Hi,\nCindy. It’s been a long time since we met. How clever you are now. You’re going to marry Young Master\nJewell soon.”"
      },
      {
        "paragraph": "Cindy was momentarily stunned and found it hard to believe. “Are you… Rebecca?”"
      },
      {
        "paragraph": "Back then, the Jones family had fallen apart and Jeffery was arrested. She had never seen Rebecca\nsince then, yet Rebecca managed to get her private number."
      },
      {
        "paragraph": "“Cindy, I didn’t expect you to be able to recognize m y voice. I thought you had forgotten me long ago, ”\nRebecca replied with a laugh."
      },
      {
        "paragraph": "Cindy furrowed her brows, not knowing what to say."
      },
      {
        "paragraph": "She used to approach Rebecca because she was useful to her. After Rebecca vanished for several\nyears, Cindy did not dare approach her since she was unaware of her current situation. Rebecca might"
      },
      {
        "paragraph": "be down and out at this point."
      },
      {
        "paragraph": "“How have you been these years? I heard you have a best friend called Sarah Neeson, but it seems\nthat she’s not doing fine after Shaun dumped her.” Rebecca sounded relaxed."
      },
      {
        "paragraph": "Cindy opened her mouth a little. “How do you I know a lot.” Rebecca snickered. “Ever since Catherine\nexposed you for copying her work, your relationship with Chester hasn’t been great, right?”"
      },
      {
        "paragraph": "Cindy’s heart did a flip, and she kept quiet."
      },
      {
        "paragraph": "“Fine. Let’s not talk about those unhappy experiences, ” Rebecca said with a smile, “I’m returning to\nAustralia the day after tomorrow. Let’s meet up when I get back to Canberra.”"
      },
      {
        "paragraph": "Cindy felt uneasy. “You’re planning to come to Canberra, but this is Shaun and Catherine’s territory"
      },
      {
        "paragraph": "“I’m coming back this time with the purpose of dealing with them, ” Rebecca said in a light-hearted\nmanner, “ Don’t worry. I wouldn’t be planning to come back if I’m not full of confidence. Shaun is\nbrilliant, but compared to the world, he’s actually nothing. To some people, they can destroy him as\neasily as squashing an ant.”"
      },
      {
        "paragraph": "“Rebecca, you’re…”"
      },
      {
        "paragraph": "“Bear in mind not to tell anyone about my matters. We’re friends, right? I still remember that you want\nto marry into the Jewell family and secure the position as Young Madam Jewell. I can help you with it, ”\nRebecca said pensively."
      },
      {
        "paragraph": "Cindy gasped. She understood Rebecca’s character fairly well. Rebecca could be crueler than anyone\nelse."
      },
      {
        "paragraph": "“Rebecca, welcome back.” Cindy smiled vaguely."
      },
      {
        "paragraph": "In the clubhouse at night."
      },
      {
        "paragraph": "Chester struck a snooker ball violently using a cue."
      },
      {
        "paragraph": "The clacks of other balls on the table instantly sounded."
      },
      {
        "paragraph": "One of the balls even flung off the table and hit Rodney’s face. He swiftly retreated."
      }
    ]
  },
  {
    "title": "Chapter 1471 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Damn, Chester. You haven’t touched a woman for a long time, huh? Why are you taking it out on us?”\nRodney jeered."
      },
      {
        "paragraph": "Chester pulled a long face without uttering a word."
      },
      {
        "paragraph": "Rodney and Shaun exchanged glances. “Are you unhappy because of Cindy?”"
      },
      {
        "paragraph": "“When has she made me happy?” Chester asked with a low and indifferent voice."
      },
      {
        "paragraph": "Rodney and Shaun both went silent at the same time."
      },
      {
        "paragraph": "After some time, Rodney said, “Just get another woman. It’s not as if you’re a man of high integrity. You\nplay around with women a lot. Hehe. What’s more, with your family occupying half of the entertainment\nindustry, you can get any beautiful woman to sleep with you. Nothing can stop you from doing it.”"
      },
      {
        "paragraph": "Shaun nodded in agreement."
      },
      {
        "paragraph": "Unlike them, Chester was probably the sort who would be unfaithful to his partner even after he got\nmarried. In fact, marriage was nothing to him."
      },
      {
        "paragraph": "“Hah… ” A hoarse laugh escaped Chester’s throat, sounding creepy."
      },
      {
        "paragraph": "Rodney shuddered and subconsciously said, “What about the one you had a meal with… What’s her\nname, that actress…”"
      },
      {
        "paragraph": "“Eliza Robbins,” Shaun reminded."
      },
      {
        "paragraph": "“Yeah. Eliza is quite good-looking. Freya has always talked about how beautiful she is.” After Rodney\nfinished speaking, he somehow noticed that Chester’s expression had become grimmer. Even the"
      },
      {
        "paragraph": "surroundings were frosty now. “Uh… Did I say something wrong?”"
      },
      {
        "paragraph": "“Chester has an unfavorable impression of her. She’s not his cup of tea,” Shaun said."
      },
      {
        "paragraph": "“Oh, right. Look how terrible my memory is.” Rodney tapped his head."
      },
      {
        "paragraph": "Chester’s temples twitched. If he had known this, he would have chosen to stay home. Chatting with\nRodney and Shaun made his blood boil."
      },
      {
        "paragraph": "“By the way, why did you go all the way to the set today?” Shaun suddenly asked, “You seem quite idle,\nhuh?”"
      },
      {
        "paragraph": "Chester opened his mouth. “Tell me… Have you guys ever met a woman who made you feel aroused i\nn spite of yourselves?”"
      },
      {
        "paragraph": "Shaun and Rodney cast strange gazes at him at the same time."
      },
      {
        "paragraph": "After a moment, Shaun smirked. “Aren’t you aroused at the sight of every woman? What gives? Which\nwoman are you planning to fool around with this time?”"
      },
      {
        "paragraph": "“Fool around?” Chester chuckled. It turned out that in the others’ eyes, he was a complete scumbag."
      },
      {
        "paragraph": "“You always fool around, don’t you?” Rodney said."
      },
      {
        "paragraph": "“Maybe. But this woman doesn’t give me any chances.” Chester suddenly squinted and smiled. “To be\nfrank with you guys, it’s been a long while since I met such an interesting woman.”"
      },
      {
        "paragraph": "“Oh no, have you already fallen in deep, Chester?” Rodney tutted."
      },
      {
        "paragraph": "“This guy?” Shaun lifted his brows. “That’s impossible. I’m afraid he doesn’t know how it feels to fall\ndeeply for someone. It’s probably because he hasn’t won that woman’s love.”"
      },
      {
        "paragraph": "“Perhaps. ” Rodney nodded. “But honestly, some women are willing to let you mess around with them.\nHowever, good women won’t be involved with men who are going to get married. If a woman\napproaches you even though she knows you’ll be getting married soon, she’s basically a mistress. If I\nwere a woman, I wouldn’t do this.”"
      },
      {
        "paragraph": "Shaun nodded. “That’s right. Chester, if the woman rejects you, let her be. Don’t hurt her.”"
      },
      {
        "paragraph": "Rodney said with a smile, “Don’t worry. Chester isn’t the kind who likes to force people.”"
      },
      {
        "paragraph": "Chester was at a loss for words. Indeed, he would not force people."
      },
      {
        "paragraph": "Nevertheless, Eliza, that b*tch, made his heart tickle."
      }
    ]
  },
  {
    "title": "Chapter 1472 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "It was a rare day off. Eliza slept in."
      },
      {
        "paragraph": "After she woke up, she started making breakfast. Suddenly, she received a call."
      },
      {
        "paragraph": "“Miss Robbins, I received information from the police station. After Mason was caught, he confessed\nthat he burned Shelley to death and shifted the blame on you. Charity was innocent. The police have\nalready revoked Charity’s criminal charges.”"
      },
      {
        "paragraph": "Eliza was frying an egg. When she heard that news, she did not move for a long time until the voice\nfrom the other side of the phone rang out again. “ Miss Robbins, are… Are you still listening?”"
      },
      {
        "paragraph": "“I heard you.” Eliza flipped the egg again. She said, “Charity is already dead. Her parents are dead too.\nWhat use is there in revoking her criminal charges?”"
      },
      {
        "paragraph": "That person went silent upon hearing that."
      },
      {
        "paragraph": "“Thank you. I’m hanging up.” Eliza put down her phone. She turned off the fire and closed her eyes."
      },
      {
        "paragraph": "She had never felt so upset since her rebirth."
      },
      {
        "paragraph": "Her body would have already been eaten up by the fish. However, they just said she was innocent."
      },
      {
        "paragraph": "Haha."
      },
      {
        "paragraph": "Eliza rested her hands on the kitchen countertop. She started chuckling until her eyes reddened."
      },
      {
        "paragraph": "It turned out that Mason was the one who framed her that year. However, what grudges did she have\nwith Mason?"
      },
      {
        "paragraph": "A happy family was utterly destroyed because of it."
      },
      {
        "paragraph": "She was not in the mood to have breakfast now. When it was almost noon, she opened the door and\nwent downstairs to throw the garbage out."
      },
      {
        "paragraph": "When she arrived downstairs, a silhouette walked out from the entrance of the staircase. “Ellie…”"
      },
      {
        "paragraph": "When Eliza saw that figure, she felt a hint of disgust in her heart. She immediately turned around and\ndid not even want to throw the garbage out any more. However, a hand grabbed her from behind."
      },
      {
        "paragraph": "“Ellie, I’m Dad.” Jacob Robbins grabbed her hand. “Let go.” Eliza turned her head back coldly."
      },
      {
        "paragraph": "Looking at those cold eyes, Jacob shivered. Nevertheless, he still gritted his teeth. “Ellie, I’m sick.\nYou’re a superstar now, and you earn a lot of money. Give me some money to treat my illness.”"
      },
      {
        "paragraph": "“Treat your illness?” Eliza sneered. “What illness do you have? Where’s your medical record?”"
      },
      {
        "paragraph": "“It’s… It’s at home. I forgot to take it,” Jacob said, “ I don’t need a lot. Just give me a million dollars.”"
      },
      {
        "paragraph": "“Your illness must be quite severe. One million dollars is enough to treat cancer. Could it be that you\nhave cancer?” Eliza said with a smile."
      },
      {
        "paragraph": "“That’s right. Eliza, if you want me to stay alive, then give me the money. I guarantee I won’t ask for\nmoney from you again,” Jacob said."
      },
      {
        "paragraph": "“Forget it. You said the same thing too when you came to borrow two million dollars from me last time.”\nEliza withdrew her hand. “I remember saying that it’ll be the last time I give you money. We no longer\nhave any relationship between us. Also, don’t take me as a fool. You’re thinking of taking the money\nand spending it on your son again, right?”"
      },
      {
        "paragraph": "Jacob, whose true intentions had been exposed, was not ashamed at all. He simply said loudly, “You’re\nmy child. What’s wrong if I ask you for some"
      },
      {
        "paragraph": "allowance money? You earn a few billion dollars a year, yet you want to shoo me away with just two\nmillion dollars? In your dreams. I’m telling you, you must give me the money today. If you don’t, I’ll\nmake this issue go big. I’ll tell other people that"
      },
      {
        "paragraph": "you, a superstar, refuse to provide for your father. ” “… Suit yourself.” Eliza turned around and left."
      },
      {
        "paragraph": "She would never give even a penny to Jacob."
      },
      {
        "paragraph": "In the past when she was not yet Eliza, all of Eliza’s money had been blackmailed off her by that father\nof hers when she just entered the entertainment industry."
      },
      {
        "paragraph": "All those years, Jacob’s other family relied on Eliza’s money to survive. Jacob had abandoned Eliza\nand her mother when she was young. Whenever Eliza thought of Jacob, she would feel furious."
      },
      {
        "paragraph": "“Don’t go.” Jacob grabbed her and started shouting, “Everyone, come over here and look! This is the\nsuperstar Eliza Robbins. I’m her dad. She… ”"
      }
    ]
  },
  {
    "title": "Chapter 1473 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Enough. Stop talking. I’ ll give you the money,” Eliza interrupted Jacob."
      },
      {
        "paragraph": "“Hurry, then.” Jacob smiled smugly. He used that tactic every time, and it never failed."
      },
      {
        "paragraph": "“Follow me upstairs. I have no money on me.” Eliza turned around and went upstairs."
      },
      {
        "paragraph": "Jacob immediately followed her."
      },
      {
        "paragraph": "Both of them did not know that when Chester walked over with his hand in his pocket, he happened to\nsee a middle-aged man following Eliza upstairs."
      },
      {
        "paragraph": "He squinted his eyes. He went after them, but he was a step late. Eliza had already brought that\nperson upstairs."
      },
      {
        "paragraph": "After entering her home, Eliza closed the door. She took a paring knife and handed it to Jacob. “Peel\nan apple for me. I’ll go take my card.”"
      },
      {
        "paragraph": "“Okay.” Jacob did not hesitate at all. As long as there was money, he was willing to peel anything, let\nalone an apple."
      },
      {
        "paragraph": "After Eliza went upstairs, she quickly took a card from her wallet and threw it at Jacob. “There’s a\nmillion dollars inside.”"
      },
      {
        "paragraph": "Jacob’s eyes lit up. He quickly put the apple and the knife aside. He put the card in his pocket. “I knew\nthat I didn’t have you, this daughter, in vain…”"
      },
      {
        "paragraph": "Before he could finish speaking, he fell to the ground with a sweep of Eliza’s foot."
      },
      {
        "paragraph": "“How dare you hit me?” Jacob scrambled up, infuriated. Just as he was about to raise his hand, Eliza\nsuddenly smashed a wine bottle at a spot beside his head."
      },
      {
        "paragraph": "The glass shards scattered on Jacob’s face. His pupils constricted on the spot from the fright."
      },
      {
        "paragraph": "He could not imagine what would have happened if that bottle had been hit on his face…"
      },
      {
        "paragraph": "Jacob gulped down his saliva. When he saw Eliza’s delicate and pretty face, he became cocky again. “\nHow dare you hit me…”"
      },
      {
        "paragraph": "Before he could finish his sentence, Eliza took one of the shards behind him and stabbed it into his\narm. Jacob howled in pain and tried to resist with all his might, but Eliza dislocated one of his arms\nstraight away. When he fought some more, his other hand was dislocated too."
      },
      {
        "paragraph": "“Eliza, you’re crazy. Kill me if you can! As long as you don’t kill me, I’ll definitely expose what happened\ntoday.” Jacob’s features were twisted due to pain."
      },
      {
        "paragraph": "“Are you forcing me to kill you?” Eliza raised her eyebrows. Her eyes were filled with cold ruthlessness."
      },
      {
        "paragraph": "“You… What are you going to do?” Jacob was flustered. “Don’t act recklessly. Your Aunty Rachel and\nNicholas know that I came to your place today.”"
      },
      {
        "paragraph": "“Jacob, do you think I’m easy to bully? Too bad I’m no longer the Eliza of the past. The previous Eliza\nsimply let you bully her because you always hit her when she was young. She was afraid of you, but\nI’m not.” Eliza stood up. She stepped on Jacob’s finger hard."
      },
      {
        "paragraph": "Jacob yelled in pain. Eliza took a cloth and stuck it in his mouth."
      },
      {
        "paragraph": "“You should be content with what you have.”"
      },
      {
        "paragraph": "Eliza sneered, “When I was young, you weren’t even willing to pay a single penny for my school fees.\nNot only that, you didn’t even want to see me."
      },
      {
        "paragraph": "Never mind that you betrayed my mom and married another person. You even kept blackmailing me for\nyour other son even though I went through many difficulties to achieve what I have today. Buying a\nhouse, a car, and starting a company for him wasn’t enough for you. You’re a family full of vampires.\nToo bad…”"
      },
      {
        "paragraph": "Too bad the real Eliza Robbins was already dead. The Eliza at that moment was Charity."
      },
      {
        "paragraph": "Eliza was originally a soft-hearted, introverted girl. Although Charity had occupied Eliza’s body, Charity\nstill had all of Eliza’s memories."
      },
      {
        "paragraph": "Charity was a person who had died once before. Her life in jail had been tough. After that, she worked\nhard at the mine too."
      }
    ]
  },
  {
    "title": "Chapter 1474 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "She was a woman in her 2os, yet her heart was already as hard as a stone."
      },
      {
        "paragraph": "Eliza bent down and fumbled around Jacob’s pocket. She found a phone, and the phone’s voice\nrecording function was turned on."
      },
      {
        "paragraph": "Jacob’s expression changed."
      },
      {
        "paragraph": "“You’re really a good father. You even have to keep a voice recording when meeting me. You were\nthinking of getting some dirt on me and uploading it on the internet if I didn’t listen to you, right?” Eliza\nlaughed coldly and kicked him away. “ I’ll be confiscating the phone. However, let me warn you that I’m\njust teaching you a small lesson today. I won’t give you even a penny in the future. If this happens\nanother time, I’ll definitely make your dearest son lose an arm or a leg. You’d better"
      },
      {
        "paragraph": "believe me. Now get lost! ”"
      },
      {
        "paragraph": "Jacob concealed his dark gaze. He lowered his head and nodded carefully. Then, he walked toward\nthe door while limping."
      },
      {
        "paragraph": "When he opened the door, a towering silhouette"
      },
      {
        "paragraph": "shrouded him."
      },
      {
        "paragraph": "The man had a handsome, gentlemanly face. His whole body exuded extravagance. Jacob’s eyes lit up\nwhen he saw him. He immediately said, “Young Master, you must be Eliza’s man. Let me tell you, this\nwoman is too evil. I’m her dad but she dislocated my arms and even hit me.”"
      },
      {
        "paragraph": "Chester lowered his head as his bottomless eyes studied Jacob."
      },
      {
        "paragraph": "He had seen Jacob entering with his whole body still fine. After just a short while, Jacob now had a few\nwounds on his face and both of his arms rested weakly by his sides due to being dislocated."
      },
      {
        "paragraph": "A weird gleam flashed across Chester’s dark eyes."
      },
      {
        "paragraph": "“It looks like you didn’t take my words just now to heart. ” Eliza walked over. Her delicate face had a\nsmile on it, but it gave off a dark and dangerous feeling."
      },
      {
        "paragraph": "It was the first time Chester saw that side of Eliza. “ You did this?”"
      },
      {
        "paragraph": "“Yes, she’s the one who did this.” Jacob nodded while trembling. “This woman is too vicious. I’m her\nbiological dad. I was just asking for money from her because I’m sick.”"
      },
      {
        "paragraph": "“ So… even after talking to you for so long, you just think I was joking?” Eliza sneered and stepped\nforward. Jacob was so scared that he did not dare to stay there for another second. He did not even\ntake the elevator and ran away frantically using the stairs."
      },
      {
        "paragraph": "Eliza turned around and went back into her home. She slammed the door, but it did not shut. It was\nblocked by Chester’s hand."
      },
      {
        "paragraph": "“Eliza, you’re quite cocky, huh?” Chester eyed the woman in front of him. She wore a white T-shirt and\na pair of gray casual pants. Her hair was tied into a ponytail. When ruthless, she could even hit her\nbiological father. This sort of woman was rare."
      },
      {
        "paragraph": "“It’s none of your f*cking business.” Eliza raised her head, her eyes filled with disdain."
      },
      {
        "paragraph": "She was in a terrible mood, especially now when she was facing the person who sent her to jail."
      },
      {
        "paragraph": "Chester’s expression changed. He squinted his eyes. “Very well, Eliza. No one has dared to speak to\nme this way before.”"
      },
      {
        "paragraph": "“I’m in a very bad mood right now, ” Eliza said"
      },
      {
        "paragraph": "coldly."
      },
      {
        "paragraph": "Chester was stunned upon hearing that. He looked a"
      },
      {
        "paragraph": "s if he had listened to a joke."
      },
      {
        "paragraph": "Was he not the one who was supposed to say those words? It was the first time a woman dared to\nspeak to him that way."
      },
      {
        "paragraph": "“So stay away from me,” Eliza continued."
      },
      {
        "paragraph": "“Eliza, do you have a death wish?” Chester was exasperated. “You’re my company’s artist, yet you hit\nyour father with your own hands to that state. Do you think he won’t report it to the police? Or do you\nthink he’d be so stupid to be threatened by you?”"
      },
      {
        "paragraph": "“Of course, I know he won’t feel threatened by me.”"
      },
      {
        "paragraph": "Eliza went back into her home and took the paring knife from the table."
      }
    ]
  },
  {
    "title": "Chapter 1475 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“What are you doing?” Chester thought Eliza just wanted to peel a fruit or something, but she was\nwearing gloves when she took the knife. She reached her hand out behind her and stabbed her back\nhard. Blood dripped down her whole back in an instant."
      },
      {
        "paragraph": "“Eliza, are you crazy?!” Chester’s eyes widened as he yelled frantically."
      },
      {
        "paragraph": "Eliza ignored him. After she removed the knife, she took off the gloves and called the police. She said\nweakly, “Hi, is this the police station? Someone stabbed me. I’m making a police report.”"
      },
      {
        "paragraph": "Chester watched that scene in shock."
      },
      {
        "paragraph": "Until Eliza put down the phone, and Chester understood everything. “Eliza, you crazy woman.”"
      },
      {
        "paragraph": "“You’re right. I’m a crazy woman.”"
      },
      {
        "paragraph": "Eliza turned her head back, and her face was turning paler. “Actually, it’s just money, but I simply don’t\nwant to give him even a penny. Why should I? Besides giving birth to me, he didn’t spend a single\npenny on me. When I was young, my mom and I were just his punching bags. He hit us whenever he\nwanted to. After I grew up and became a superstar, he would come looking for me to ask me for\nmoney. Not only do I have to provide for him, but I also have to provide for his son and his current wife\ntoo. Ha, I’m definitely making him die today. ”"
      },
      {
        "paragraph": "Chester opened his mouth slightly. It was the first time he saw such a cold and crazy gleam in a\nwoman’s eyes. “Aren’t you afraid that… I’ll tell the truth?”"
      },
      {
        "paragraph": "“President Jewell, if you don’t want to lose me, your moneymaker, you should stay silent. ” Eliza smiled\nbefore fainting."
      },
      {
        "paragraph": "However, she did not fall to the floor. Chester carried her in a hurry."
      },
      {
        "paragraph": "The woman in his embrace was petite, and her face was so pale like she was going to die at any\nsecond."
      },
      {
        "paragraph": "Chester felt as if his heart was being twisted like a pretzel. He immediately administered first aid for\nEliza, then he carried her and went downstairs hurriedly."
      },
      {
        "paragraph": "He quickly sent her to the hospital’s emergency room. He put on a white coat and then used a pair of\nscissors to cut her clothes open to treat her injury."
      },
      {
        "paragraph": "Eliza’s estimation was very precise. The injury was deep, but it was not life-threatening."
      },
      {
        "paragraph": "After news got out that superstar Eliza Robbins was stabbed in her home and hospitalized, it garnered\nthe media’s attention. In less than half an hour, there were already many paparazzi at the hospital’s\nentrance. At the same time, another group of reporters was rushing to the police station."
      },
      {
        "paragraph": "After checking the security cameras, the police arrested the prime suspect, Jacob Robbins."
      },
      {
        "paragraph": "When Jacob was taken into the police station, he was still blabbering, “ I’m not the culprit. I didn’t try to\nkill Eliza. It was her. She hit me! She beat up her own father. All the wounds on me were inflicted by\nEliza.”"
      },
      {
        "paragraph": "“Enough. Shut up. The weapon Eliza was stabbed with is a paring knife. Your fingerprints are on it, and\nher bank card is in your pocket too.” The police slapped the table."
      },
      {
        "paragraph": "Jacob was dumbfounded. He understood everything in an instant. “She was the one who gave me the\ncard. She gave me that knife and asked me to peel a n apple. She deliberately made me leave my"
      },
      {
        "paragraph": "fingerprints on the knife.”"
      },
      {
        "paragraph": "“Where’s the evidence?” the police asked, “You’re just saying empty words without proof.”"
      },
      {
        "paragraph": "“Evidence?” Jacob said in a hurry, “I bumped into a man when I was leaving. He’s a witness. Nothing\nhappened to Eliza at that time.”"
      },
      {
        "paragraph": "“Are you talking about this person?” The police took a picture out."
      },
      {
        "paragraph": "Jacob glanced at it. He nodded. “Yes, it’s him.”"
      },
      {
        "paragraph": "“I’m sorry, we’ve already questioned him. He said that when he went in, he saw that Eliza was\nunconscious and you were escaping in a panicked manner. He was the one who sent Eliza to the\nhospital,” the police sneered."
      },
      {
        "paragraph": "Jacob was dumbfounded. After a moment, it seemed like he had gone crazy. “Eliza, you b*tch. How\ndare you frame me?!”"
      },
      {
        "paragraph": "However, no one believed him."
      }
    ]
  },
  {
    "title": "Chapter 1476 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Not long after, the netizens dug up Jacob’s past. He was Eliza’s biological father, but he liked gambling\nand drinking ever since Eliza was young. Someone came forward and said that he was Jacob’s\nneighbor for more than 20 years previously. Not only did Jacob not have a job back then, but he often\nhit Eliza and her mother too."
      },
      {
        "paragraph": "Afterward, Eliza’s mother could not take it anymore and divorced Jacob. She brought Eliza with her and\nmoved away."
      },
      {
        "paragraph": "Jacob remarried another woman and had a child with her. However, the whole family was gluttonous\nand lazy. Before Eliza became famous, Jacob, his newly married wife, and his child led a poor,\ndestitute life. After Eliza became famous, Jacob suddenly bought a few houses. His son even drove a\nPorsche that was worth more than a million dollars and started a company. However, according to the\ncompany’s employees, they said Jacob’s son was not capable at all. The company had been"
      },
      {
        "paragraph": "losing money all along. The whole family was exploiting Eliza’s money."
      },
      {
        "paragraph": "The netizens started scolding them furiously."
      },
      {
        "paragraph": "[Eliza is so unlucky to have such a father. She’s too miserable.]"
      },
      {
        "paragraph": "[Hah, I heard the wife Jacob married afterward only plays poker all day long. All three of them in the\nfamily have been spending Eliza’s money. When they ran out of money, they would ask for more from\nEliza.]"
      },
      {
        "paragraph": "[I guess Eliza couldn’t tolerate it anymore. She didn’t want to give Jacob any more money and they\nboth started arguing. Therefore, Jacob took a knife and stabbed Eliza. Jacob has a criminal record. I\nheard he used a knife and stabbed his ex-wife before too. He’s too evil.]"
      },
      {
        "paragraph": "[Jacob’s son is a useless good-for-nothing. He only knows how to drive his sports car and flirt with\nwomen every single day. His house and car were all paid for by Eliza. Eliza wasn’t willing, so Jacob\nsaid he was going to reveal to the media that Eliza didn’t want to care for him and abused him. She had\nno choice.]"
      },
      {
        "paragraph": "[I feel bad for Eliza. I wonder how her condition is now?]"
      },
      {
        "paragraph": "[Jacob must be severely punished. This kind of person isn’t worthy of being a father at all.]"
      },
      {
        "paragraph": "In the hospital’s hallway, Chester silently lit a cigarette while still in his white coat."
      },
      {
        "paragraph": "Eliza’s manager, Hailey Zimmer, rushed over. When she saw Chester, she was startled. “Young…\nYoung Master Jewell… You…”"
      },
      {
        "paragraph": "Actually, she had a lot of things to say. For example, why was Chester at Eliza’s home? Why was it\nChester who sent Eliza to the hospital?"
      },
      {
        "paragraph": "Luckily, only her, Shedrick, and the police knew about it. It would be troublesome if someone had taken\na picture."
      },
      {
        "paragraph": "“What’s going on between Eliza and Jacob?” Chester asked with an indifferent expression."
      },
      {
        "paragraph": "Hailey sighed. “It’s almost the same as what’s being said on the internet. Jacob has never provided for\nEliza. When Eliza was four years old, her parents got a divorce. After that, she lived with her mother.\nHer mother had a hard life while raising her. She went to work during the day and even had to work\npart-time jobs at night. Finally, Eliza managed to gain some popularity."
      },
      {
        "paragraph": "“That was when Eliza’s dad began looking for her. He wanted her to give him allowance money every\nmonth. In the past, Eliza was an honest child. She was afraid Jacob would defame her. All the money\nshe earned was taken away by Jacob. The rest was given to her biological mother. Actually, she never\nhad much money. It’s just that she’s toughened up that she now has some savings after steadily\ngaining popularity in these two years.”"
      },
      {
        "paragraph": "“ I understand. ” Chester nodded. “You can go in.” Hailey immediately entered the ward."
      },
      {
        "paragraph": "Chester stood in front of the window. He could not help but think, ‘Was that why she chose to take the\nrisk? She’d rather take a knife and stab herself.’"
      },
      {
        "paragraph": "Seriously, it was the first time he saw a woman who would treat herself so harshly."
      },
      {
        "paragraph": "Eliza, Eliza…"
      },
      {
        "paragraph": "What kind of person was she?"
      },
      {
        "paragraph": "She made him lie to the police and said it was Jacob who stabbed her."
      },
      {
        "paragraph": "Ha."
      }
    ]
  },
  {
    "title": "Chapter 1477 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "In the ward."
      },
      {
        "paragraph": "Eliza finally regained consciousness."
      },
      {
        "paragraph": "She first saw Hailey and Leanne. However, Hailey was very busy. She kept making phone calls with\nher back facing Eliza."
      },
      {
        "paragraph": "“I’m sorry. I’m really sorry. It most probably has to be postponed to next month due to Eliza’s injury… If\nyou’re in a rush, you can switch to another artist. Or you can wait for Eliza…”"
      },
      {
        "paragraph": "“You’ve finally woken up. I was scared to death. ” Leanne saw Eliza first. Her eyes lit up."
      },
      {
        "paragraph": "Hailey turned her head too. She hung up after speaking a few more sentences and looked at Eliza. She\nsighed. “Your injury is really giving me a headache.”"
      },
      {
        "paragraph": "“I’m sorry, Hailey, ” Eliza apologized weakly. “I most probably can’t join the production of The Belle. And\nthere are still two commercials and three events that I was scheduled to attend this month.”"
      },
      {
        "paragraph": "“The people from the commercials and events called. One of them is more urgent, so I rejected it. We\nhave to pay the damages for the breach of contract as well. The others said they’re willing to wait for\nyou.” Hailey rubbed the middle of her brows. “The person we’ve truly let down is Director Cheever. He\nwas determined to make you famous and cast you as the female lead.”"
      },
      {
        "paragraph": "Eliza closed her eyes. Being unable to participate in The Belle was quite a pity, but she did not regret it.\nShe was in a very bad mood yesterday when Jacob came and offended her. She had wanted to get rid\nof him for a long time already."
      },
      {
        "paragraph": "“However, I’ve already asked the doctor. She said your injuries are not that serious and you can\nmanage to join the production after a month."
      },
      {
        "paragraph": "Director Cheever said he can film other scenes first. Nevertheless, after you return to the production,\neven if you have to work overtime and stay up all night, you have to finish filming the rest of your\nscenes within two months. During that period, there’ll be a lot of wire stunt scenes. You body… ”"
      },
      {
        "paragraph": "“I can do it.” Eliza nodded."
      },
      {
        "paragraph": "Hailey was not happy. Instead, she frowned. “ Although you can join the production with your injury, it\nstill hasn’t recovered completely yet. If you go on the wire, it’ll affect the wound…”"
      },
      {
        "paragraph": "“It’s okay, ” Eliza said, “Director Cheever is already being extremely accommodating by being willing to\nwait for me. It’s my honor too. If I can’t even bear such small inconveniences, how can I live up to\nDirector Cheever’s expectations?”"
      },
      {
        "paragraph": "Hailey sighed. A look of deep thought flashed across her eyes. “By the way, Eliza, be honest with me."
      },
      {
        "paragraph": "What’s going on… between you and Young Master Jewell? Why was he at your place? Also, I heard he\nwas the one who sent you here.”"
      },
      {
        "paragraph": "“I don’t know why he went to my place either.” Eliza frowned. She said sarcastically, “But men are\nalways filled with dirty thoughts when they see pretty women.”"
      },
      {
        "paragraph": "Leanne was stunned. “Oh my gosh, no wonder Young Master Jewell came to the filming set yesterday.\nHe even came to your dressing room. I thought he came to visit Cindy, but… Tsk, Young Master Jewell\nis too much. His girlfriend was around, yet he was still openly…”"
      },
      {
        "paragraph": "“Speak carefully.”"
      },
      {
        "paragraph": "Hailey glared at Leanne. She did not feel happy. Instead, she had a mild headache. Eliza was the most\noutstanding artist she had. She just hoped that Eliza would work hard to earn money. She did not hope\nEliza would be involved in any relationships, especially since Young Master Jewell was not someone\nany ordinary people could offend."
      },
      {
        "paragraph": "“To be honest, if Young Master Jewell wasn’t going to get married and didn’t have an official girlfriend,\nI’d be very happy if he wanted to pursue you. After all, Young Master Jewell has great authority. He can\nallow you to reach greater heights. But… the public already knows that he’s about to marry Cindy. It’ll\nbe troublesome if you get involved with him. If news gets out, your reputation will be tarnished.”"
      },
      {
        "paragraph": "Hailey said, “Moreover, I had a few interactions with Cindy before. I’m already one of the best\nmanagers in the company. Even President Daley has to treat me with respect when he sees me. But\nCindy looks down on me just because she thinks she’s Young Master Jewell’s woman. Someone like\nher is narrow-minded. If she finds out, she’ll stop at nothing to oppress you.”"
      },
      {
        "paragraph": "“I understand everything you said. That’s why I’ve been rejecting Chester’s advances.” Eliza frowned. “"
      },
      {
        "paragraph": "People like him just treat us as a past-time activity.”"
      },
      {
        "paragraph": "“It’s good that you understand. I hope Young Master Jewell will give up soon, ” Hailey reminded her,\n“Monte is the best example.”"
      },
      {
        "paragraph": "Speaking of Monte, Eliza went silent."
      },
      {
        "paragraph": "Actually, she did not have much impression of Monte anymore. When she woke up, she found out that\nthe previous Eliza had committed suicide for Monte."
      },
      {
        "paragraph": "He was nothing but another scumbag."
      }
    ]
  },
  {
    "title": "Chapter 1478 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Get some rest. Let Leanne stay here and take care of you. I still have to manage your matters. There’s\na bunch of reporters outside,” Hailey said, “By the way, how should we deal with your father’s matter?”"
      },
      {
        "paragraph": "“How is the media reporting on things?” Eliza asked."
      },
      {
        "paragraph": "“Luckily, they already dug out information on Jacob and his family. They even contacted many people\nwho are familiar with Jacob and his family to give statements. Anyway, the outsiders already know that\nthey’re a family of vampires. The public sympathizes with you a lot now.”"
      },
      {
        "paragraph": "Eliza gave it some thought and said, “Reveal the name of Jacob’s neighborhood and the address of his\nson’s company. Also, find a lawyer to get back the money I gave Jacob before. At the same time, sue\nJacob. Since he injured me, he should go to jail.”"
      },
      {
        "paragraph": "Hailey glanced at her in surprise. “What?” Eliza asked."
      },
      {
        "paragraph": "“Nothing, ” Hailey said with complicated feelings, “ I just think that you’ve changed quite a lot now."
      },
      {
        "paragraph": "You used to be soft-hearted and kept caring about that almost non-existent father-daughter\nrelationship. Actually, you were quite weak at that time.”"
      },
      {
        "paragraph": "“I won’t be weak anymore, ” Eliza said, “Those who didn’t treat me well have no right to take my things\naway from me.”"
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "Hailey left."
      },
      {
        "paragraph": "Leanne fed Eliza some porridge."
      },
      {
        "paragraph": "Not long after, the door was pushed open again. The person who came in was Chester."
      },
      {
        "paragraph": "He wore a white coat and glasses. He had mild short"
      },
      {
        "paragraph": "-sightedness, so he usually wore glasses when he was working. However, that did not affect his\nhandsome looks. On the contrary, it made him look more elegant, gentlemanly, and smart."
      },
      {
        "paragraph": "Leanne used to hear people say that Chester was the most good-looking when he wore a white coat.\nAt this moment, she almost forgot to shift her eyes when she saw the sight for herself today."
      },
      {
        "paragraph": "She was only reminded after Eliza cleared her throat lightly. When Leanne came back to her senses,\nshe felt frustrated and awkward."
      },
      {
        "paragraph": "Leanne did not understand. Chester was clearly such a scummy person, but why did his appearance\nlook so clear and bright like the moon? As expected, men could not be judged by their looks."
      },
      {
        "paragraph": "“You can step out first, ” Chester said to Leanne right away."
      },
      {
        "paragraph": "Leanne made a troubled expression. “Young Master Jewell, Eliza’s injury hasn’t recovered yet. You\nshouldn’t—”"
      },
      {
        "paragraph": "“Do I look that immoral to you?” Chester interrupted her. “Moreover, I’m her doctor in charge. I was the\none who treated her injury.”"
      },
      {
        "paragraph": "“Oh…” Leanne had no choice but to leave."
      },
      {
        "paragraph": "Eliza looked at Chester with a weak, pale face. “ Thank you, Young Master Jewell.”"
      },
      {
        "paragraph": "“Is that enough?” Chester sat at the bedside, smirking. “Eliza, I’m a person who abides by the laws. But\nfor you, I made a false statement for the first time. Not only that, but I was also the one who sent you to\nthe hospital.”"
      },
      {
        "paragraph": "Eliza did not say a word, and her eyes were cold like glass."
      },
      {
        "paragraph": "“Eliza, I’ve seen too many cunning and despicable women like you. However, I’ve never seen someone\nwho treats herself as cruelly as you.” Chester adjusted his glasses. “You’ve successfully piqued my\ninterest in you.”"
      }
    ]
  },
  {
    "title": "Chapter 1479 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Eliza laughed."
      },
      {
        "paragraph": "Chester did not think it was a happy laugh. “What are you laughing at?”"
      },
      {
        "paragraph": "“Ah, you sound like those campy bossy presidents in dramas that I’ve acted in before. Like ‘Woman,\nI’m interested in you, ‘ or ‘Woman, I’ve fallen for you.”’ Eliza’s slightly pale lips lifted. “ But those bossy\npresidents are wooing their wives while you’re wooing a mistress. Also, you’re doing it so obviously. I\ndon’t know whether to compliment you for being thick-skinned or shameless.”"
      },
      {
        "paragraph": "Chester’s handsome face turned as dark as the bottom of a pan. “Eliza, I just helped you, yet you’re\nhumiliating me now. How many times have you humiliated me, huh?”"
      },
      {
        "paragraph": "No woman had humiliated him multiple times yet escape unscathed."
      },
      {
        "paragraph": "“I’m not humiliating you. What I said is true.” Eliza shrugged. “If you think my honest words are\nhumiliating, I can’t do anything about it.”"
      },
      {
        "paragraph": "“Eliza, you… Do you think that I don’ t dare to do anything to you?” Chester grabbed her wrist. Just as\nhe yanked it, Eliza sucked in a breath from the pain."
      },
      {
        "paragraph": "When he saw that she was in pain yet she was merely frowning and tolerating it, Chester’s heart\ntightened. He released his grip instinctively."
      },
      {
        "paragraph": "Eliza took quite some time to recover from the pain and said, “How can someone like you be the doctor\nin charge? Can I request another doctor?”"
      },
      {
        "paragraph": "“Do you know how many people in the whole world are begging me to treat their illnesses?” Chester let\nout a hmph. “No matter what, Eliza, you owe me a favor this time.”"
      },
      {
        "paragraph": "Eliza twirled with a lock of her long hair. “Actually, I can refuse to owe you this favor. You were the one\nwho became involved in this. Even without you, I could’ve still called 000. There’d still be doctors to\nsave me in the hospital. Just because you got involved, Hailey now has to make arrangements with the\npolice to cover the fact that you were in my home.”"
      },
      {
        "paragraph": "Chester was truly furious. He had sent her to the hospital and saved her, yet she was saying that what\nhe did was unnecessary."
      },
      {
        "paragraph": "“Eliza, you must have a death wish. Believe it or not, I’ll reveal the truth and let other people see how\nthe pure, lawless Goddess Eliza schemed against and framed her father. By then, your image will\ncollapse. The advertisement companies and producers working with you will request compensation. If\nFelix Media disregards this matter, you’ll end up in a dead-end.”"
      },
      {
        "paragraph": "Eliza squinted her eyes. She said coldly, “ So what are you going to do? Threaten me to sleep with\nyou? Be your woman and a secret mistress?”"
      },
      {
        "paragraph": "Chester’s delicate lips moved. Those things sounded pretty shameful, but he really had a strong\ninterest in this woman. However, for some reason, when he saw himself reflected in her cool eyes, he\nsuddenly could not bring himself to say it."
      },
      {
        "paragraph": "He started feeling slightly annoyed too. Knock, knock."
      },
      {
        "paragraph": "Suddenly, there were knocks on the door. A tall, beautiful woman wearing loose clothing walked in with\na bouquet. “Eliza, I heard you’re hospitalized"
      },
      {
        "paragraph": "When Freya saw Chester, who was standing in the ward, she trailed off."
      },
      {
        "paragraph": "Catherine, who came in afterward, was stunned too. “Young Master Jewell, why are you here too?”"
      },
      {
        "paragraph": "“I’m her doctor,” Chester said calmly."
      },
      {
        "paragraph": "Catherine was surprised. “But haven’t you always been in charge of the patients in the oncology\ndepartment? Why…”"
      },
      {
        "paragraph": "“There has been a shortage of staff here recently, so I was temporarily transferred here.” Chester\nglanced at Eliza, who was on the bed. “I’ll be"
      },
      {
        "paragraph": "leaving first. I’ll check up on you again later.”"
      },
      {
        "paragraph": "After he spoke, he went out handsomely with his long legs."
      },
      {
        "paragraph": "Freya watched him from behind with a strange gaze. Then, she looked at Eliza. She blurted out, “F*ck,\nEliza. Could Young Master Jewell have fallen for you?”"
      },
      {
        "paragraph": "“Fallen for me?” Eliza laughed. “You’ve overestimated me.”"
      }
    ]
  },
  {
    "title": "Chapter 1480 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine frowned. She placed the supplements she brought on the bedside table. “Chester is a good\nfriend, but if he’s to be a husband or a boyfriend, I think anyone who falls in love with him will be\nunlucky. He’s not a person who’ll remain loyal to any woman.”"
      },
      {
        "paragraph": "Freya said, “But hasn’t he already decided to marry Cindy?”"
      },
      {
        "paragraph": "“Do you think… Cindy can handle him?” Catherine raised her eyebrows. “If she could, Chester wouldn’t\nbe marrying her.”"
      },
      {
        "paragraph": "“Don’t worry, I never had the thought of being together with him.” Eliza raised her head and smiled\nweakly. “I understand that he just has a temporary interest in me. Nothing will come out of this even\nafter he gets to have me. Moreover, I don’t like him at all.”"
      },
      {
        "paragraph": "“Don’t worry. I believe Eliza is a cool-headed person. I didn’t understand why Chester kept targeting\nyou during the meal last time, but now I understand. Chester must’ve been annoyed because he\ncouldn’t get you,” Freya said with a smile."
      },
      {
        "paragraph": "Eliza grinned and switched the topic. “I didn’t expect you guys to come and visit me. Actually, I— ”"
      },
      {
        "paragraph": "“We’re friends,” Freya interrupted her, “I don’t know why, but I thought you felt very familiar the first time\nI saw you. I think this is what it means to hit it off with someone. Chester did say bad things about you,\nbut making friends is a thing that has to be done through a person’s own interactions. No one is more\nclear than themselves whether that friend is worth making or not.”"
      },
      {
        "paragraph": "“Thank you.” Eliza’s gaze was gentle."
      },
      {
        "paragraph": "If she had to say who could make her feel a sense of familiarity, it would only be the two people in front\nof her."
      },
      {
        "paragraph": "They were her friends in the past too."
      },
      {
        "paragraph": "“If there are any problems, you can look for us for help anytime, ” Catherine said, “Shaun is an\noutstanding lawyer. He has a friend who runs a great law firm. If this case needs to be filed as a\nlawsuit, you can look for me anytime.”"
      },
      {
        "paragraph": "“Okay, ” Eliza opened her mouth and said, “ Actually, I’m not afraid to tell you guys that I got this injury\nfrom deliberately stabbing myself. Jacob kept threatening me again and again. I’ve had enough of that\nperson, so I thought of this idea.”"
      },
      {
        "paragraph": "After she spoke, she smiled bitterly. “ I don’t want to lie to you guys. I’m not a kind person.”"
      },
      {
        "paragraph": "Catherine and Freya were astonished."
      },
      {
        "paragraph": "However, it was only for a short moment. Afterward, there was admiration in their gazes. Freya smiled\nand said, “That’s great. Cathy and I hate simple -minded girls who pretend to be kind. Women should\nbe a little cruel.”"
      },
      {
        "paragraph": "“But there’s no need to use tactics that’ll hurt yourself to inflict harm on the enemy next time. You can\nlook for us for help, ” Catherine said."
      },
      {
        "paragraph": "“… Thank you.” Eliza raised her head and showed a warm smile from the bottom of her heart."
      },
      {
        "paragraph": "Since her rebirth, it was only now that she felt a moment of warmth."
      },
      {
        "paragraph": "Catherine and Freya only stood up and left after staying in the ward for an hour."
      },
      {
        "paragraph": "After closing the door, Catherine raised her head and saw Chester walking in her direction."
      },
      {
        "paragraph": "Freya could not help but mutter, “Is he that free?” Catherine frowned and walked toward Chester. “"
      },
      {
        "paragraph": "Young Master Jewell, it’s getting dark soon. Isn’t it your break time yet?”"
      },
      {
        "paragraph": "“Eliza has to be put on an IV now,” Chester said gently."
      },
      {
        "paragraph": "“Young Master Jewell, you’re the hospital’s top doctor. There’s no need for you to personally take care\nof Eliza’s injury, right?” Catherine said jokingly."
      }
    ]
  },
  {
    "title": "Chapter 1481 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“She’s the patient I rescued myself. I like to be responsible for a patient till the end, ” Chester replied\nwith a calm gaze."
      },
      {
        "paragraph": "Freya mocked him, “It seems like you don’t just want to be responsible for her injury till the end, though.\nRight?”"
      },
      {
        "paragraph": "“ I think you guys haven’ t known each other for a long time. It’s better to not meddle in some things.”\nChester glanced at Freya calmly."
      },
      {
        "paragraph": "Freya was furious. She had always been a person who could not hold in her anger. She said right\naway, “Even if we haven’t known each other for a long time, Eliza is still our friend. Allow me to be\nhonest. You’re already about to marry Cindy, so don’t disturb Eliza anymore. She’s a good lady."
      },
      {
        "paragraph": "She’s not those women that you’re used to toying around with.”"
      },
      {
        "paragraph": "“You both aren’t people of the same world,” Catherine spoke as well, “I believe she doesn’t desire\nanything you have. If you want to play, you can. You should find the people who want the things you\nhave. Moreover, Cindy isn’t a person to be offended. If she finds out, she’ll target Eliza.”"
      },
      {
        "paragraph": "“I can handle Cindy.” Chester was unconvinced."
      },
      {
        "paragraph": "Freya let out a snort. “Since you’ve said those words, I can confirm that you don’t understand Cindy at\nall. Cindy is absolutely narrow-minded. Indeed, she may not do anything at first, but she’s good at\nholding grudges. Then, when everyone isn’t on their guard, she’ll open her mouth and bite hard into\nthat person until flesh shows.”"
      },
      {
        "paragraph": "Catherine said, “Young Master Jewell, don’t make us think badly of you. Although I thought you were a\nplayboy before, at least I didn’t think you were a scumbag.”"
      },
      {
        "paragraph": "“You’re wrong. I’ve been a scumbag all along. Also, me being a scumbag or not is none of your\nbusiness.” After Chester spoke, he left in long strides."
      },
      {
        "paragraph": "Freya watched him from behind and stomped her feet. “This is exasperating. I thought Rodney was the\nperson I hated the most in the world. I didn’t expect Chester to be more hateful.”"
      },
      {
        "paragraph": "Catherine frowned. “No matter what, if Chester uses despicable methods, we have to help Eliza.”"
      },
      {
        "paragraph": "“Yes, we can’t let her end up as a mistress. Chester doesn’t care, but Eliza is a celebrity. If it gets out,\nher whole life will be ruined, ” Freya said in frustration."
      },
      {
        "paragraph": "In the ward."
      },
      {
        "paragraph": "Chester pushed the door and entered."
      },
      {
        "paragraph": "Leanne was holding a chamber pot for Eliza to relieve herself."
      },
      {
        "paragraph": "Both of them became frantic when a man suddenly walked in. Luckily, there was a blanket covering\nEliza’s lower body, but Eliza was still frustrated from feeling awkward. “Chester, can’t you knock before\ncoming in?”"
      },
      {
        "paragraph": "“I’m sorry. I didn’t know… ” Chester did not expect it either. He shrugged. “But you’ re a patient, and I’m\na doctor. I’ve seen these kinds of things too many times every single day, so there’s no need for you to\noverreact.”"
      },
      {
        "paragraph": "“You…” Eliza’s chest heaved out of anger."
      },
      {
        "paragraph": "It was rare to see her get angry. Chester strangely felt pleasant. “Besides, when I saved you, I already\nsaw your top half. I’ve already seen everything.”"
      },
      {
        "paragraph": "Leanne’s face was flushed red. It was either because she felt awkward, or she was blushing in Eliza’s\nstead."
      },
      {
        "paragraph": "“Are you done peeing?” Chester asked."
      },
      {
        "paragraph": "“You keep looking in my direction, how can I pee?” Eliza could not tolerate it anymore."
      },
      {
        "paragraph": "“Do it quickly. You have to be put on an IV.” Only then did Chester turn around."
      },
      {
        "paragraph": "After Leanne was done with everything, Eliza lay on the bed. It was the first time she felt so helpless."
      },
      {
        "paragraph": "Chester hung the IV and held Eliza’s hand. His tone was gentle and hoarse. “Relax a little.”"
      },
      {
        "paragraph": "That voice…"
      },
      {
        "paragraph": "Eliza recalled that many years ago, he had said the same words into her ear during their first time\nhaving sex together."
      },
      {
        "paragraph": "However… As they got older, his voice became more raspy and captivating."
      },
      {
        "paragraph": "Although she tried to ignore it as much as possible, Eliza’s ears still turned slightly red."
      }
    ]
  },
  {
    "title": "Chapter 1482 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“What are you thinking about?” Chester suddenly looked at Eliza, a trace of a smile flashing across his\neyes."
      },
      {
        "paragraph": "“What could I possibly be thinking? I just want you to do this faster.” Eliza turned her head away coldly."
      },
      {
        "paragraph": "“These things can’t be done quickly,” Chester said."
      },
      {
        "paragraph": "Leanne’s whole face was red as she stood at the side. She wanted to think purely, but those two\npeople’s erotic words made her unable to think pure thoughts."
      },
      {
        "paragraph": "In the end, Eliza could not tolerate it anymore. “Is your hospital short of nurses? Why does a doctor like\nyourself have to do such a trivial thing like inserting a needle?”"
      },
      {
        "paragraph": "“The nurses’ skills are not as good as mine. I’m afraid they’ll prick and hurt you.” Chester’s handsome\nlips lifted into a sexy smile. It was utterly charming."
      },
      {
        "paragraph": "However, Eliza did not waver at all. “It’s alright,"
      },
      {
        "paragraph": "I’m not afraid of the pain.”"
      },
      {
        "paragraph": "“But my heart will ache for you, ” Chester said with a smile."
      },
      {
        "paragraph": "Eliza sneered. She was used to that. When that man wanted to have a woman, he could say all types\nof romantic words. However, when he got bored, his attitude would change faster than anybody else."
      },
      {
        "paragraph": "It was just like what she had experienced in the past. When she was still studying in the past, Young\nMaster Jewell was handsome and gentle. Although she had locked her heart away tightly, she still fell\nfor him. She also vividly remembered his heartless expression after he changed his attitude."
      },
      {
        "paragraph": "“Young Master Jewell, how many women have you said those words to before? Did you say those\nwords to Charity before as well?” she suddenly asked."
      },
      {
        "paragraph": "The smile in Chester’s eyes froze a little. He lowered his head, and Eliza continued saying, “I heard the\npolice released a statement that Charity was innocent back then. She was framed by someone else. It\nseemed like the person who went against her in the court that year was the best lawyer you had. You\nsent an innocent person to jail with your own hands. How do you feel about it now?”"
      },
      {
        "paragraph": "The lines on Chester’s face tensed inch by inch. After a long while, he said in a low voice, “I owe her.”"
      },
      {
        "paragraph": "“Owe?” Eliza laughed sarcastically. “Unfortunately, Charity’s parents are dead. She’s dead too. Besides\nsaying that you owe her, it seems like nothing can be changed.”"
      },
      {
        "paragraph": "“Eliza, let’s not talk about this anymore. I’m inserting a needle into you. If you make my mood g o bad,\nI’m afraid I might prick you.” Chester’s eyes were as dark as midnight. However, his voice was gentle."
      },
      {
        "paragraph": "“Make it hurt, ” Eliza said calmly, “If my body is in more pain, I won’t feel so uncomfortable facing you.”"
      },
      {
        "paragraph": "Chester lowered his gaze. Finally, he inserted the needle into the back of her hand."
      },
      {
        "paragraph": "His skills were excellent. She felt no pain at all. It just felt like an ant’s bite."
      },
      {
        "paragraph": "“Later, I’ll have someone send some food over. After the IV has finished dripping, press the bell. I’ll\ncome and change it for you. ” Chester left after he spoke."
      },
      {
        "paragraph": "Leanne walked over and said, “If Young Master"
      },
      {
        "paragraph": "Jewell wasn’t about to get married, I would’ve almost got captivated by his voice. I don’t know whether\nit’s better to say he’s a scumbag or an affectionate person.”"
      },
      {
        "paragraph": "“Don’t sully the word ‘affectionate’,” Eliza said."
      },
      {
        "paragraph": "Chester returned to his office."
      },
      {
        "paragraph": "He lit a cigarette, and his bottomless eyes were looking outside the window where the sky was getting\ndarker."
      },
      {
        "paragraph": "He knew that Charity’s name was a mark that he could not erase for the rest of his life."
      },
      {
        "paragraph": "At the same time, Catherine walked into the president’s office of Hill Corporation."
      },
      {
        "paragraph": "Shaun, who was wearing an expensive suit, was talking to a senior manager. When the senior\nmanager saw that she had arrived, he nodded while smiling and went out."
      },
      {
        "paragraph": "“Did I disturb you?” Catherine walked over and sat on his legs right away. “ It’s already past 6:00 p.m.\nand way past office hours.”"
      }
    ]
  },
  {
    "title": "Chapter 1483 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Did you miss me?” Shaun held her slender waist. His eyes and brows looked gentle. “There’s been\nquite a lot of matters going on recently. I can’t get off work at set times like other employees.”"
      },
      {
        "paragraph": "“I don’t really miss you because I see you every day anyway… Ow… ” As Catherine was talking, she\ngot pinched hard on the waist."
      },
      {
        "paragraph": "She glared at Shaun in anger. “What are you doing?”"
      },
      {
        "paragraph": "“You dared to say you didn’t miss me, ” Shaun said with a tone of punishment."
      },
      {
        "paragraph": "“I see you every night. Why do I have to miss you?” Catherine pouted. She had basically moved into\nthe Hill family’s manor. That place was huge anyway. She and the children had a house to themselves,\nso she did not need to be afraid of feeling awkward whenever she faced the Hill family’s elderly for not\nbeing divorced yet."
      },
      {
        "paragraph": "“But even if I get to see you every day, I still miss you.” As Shaun spoke, he raised her chin lightly and\nwas about to kiss her."
      },
      {
        "paragraph": "Catherine avoided him quickly. “Don’t mess around. I came to find you for a problem.”"
      },
      {
        "paragraph": "“Mm?”"
      },
      {
        "paragraph": "“I went to the hospital to visit Eliza today. Something happened to her.”"
      },
      {
        "paragraph": "Shaun paused for a moment. He only could recall who Eliza was after a long while. “When did you\nguys become so close?”"
      },
      {
        "paragraph": "“Actually, we didn’t really contact each other after the meal last time but Freya insisted on dragging me\nalong today. We chatted for a while. I admire her quite a lot.”"
      },
      {
        "paragraph": "Catherine said honestly, “You know that I don’t have many friends even after coming to Canberra for so\nlong. There used to be Charity…”"
      },
      {
        "paragraph": "When Shaun heard her mentioning Charity, his body tensed."
      },
      {
        "paragraph": "Catherine glanced at him, but she had never lingered on that topic. “Eliza is quite a nice girl. Although\nshe’s involved in the complicated entertainment industry, she’s independent. I think"
      },
      {
        "paragraph": "… It feels as though we’ve known each other for a long time.”"
      },
      {
        "paragraph": "“It’s good to be able to make another friend, ”"
      },
      {
        "paragraph": "Shaun said in agreement."
      },
      {
        "paragraph": "“But…” Catherine paused. “Chester is a bit strange. When I went there, I found out he’s Eliza’s doctor\nin charge. Isn’t he in charge of the severe cases in the oncology department? Eliza got stabbed with a\nknife. No matter what, it shouldn’t be Chester"
      },
      {
        "paragraph": "who’s supposed to be in charge of her, right?”"
      },
      {
        "paragraph": "Shaun raised his eyebrows. “You suspect that he’s interested in Eliza?”"
      },
      {
        "paragraph": "“It’s very obvious that he is.”"
      },
      {
        "paragraph": "Catherine said angrily, “I already asked him about it and he didn’t deny it. He even talked in a tone that\nimplied that we shouldn’t meddle in his business."
      },
      {
        "paragraph": "Does he think that I want to meddle in his business? He can do anything he wants with other women,\nbut Eliza is a proper girl. He’s already going to marry Cindy, yet he’s still getting involved with Eliza at\nthis time. Doesn’t he feel shameful? Does he have integrity? Are women just playthings for him?”"
      },
      {
        "paragraph": "Shaun patted the back of her head in a hurry. He said gently, “Is there a misunderstanding?"
      },
      {
        "paragraph": "According to what I know about Chester, he isn’t someone who takes relationships seriously. Even if he\nlooks for women, he would never force others. Both parties will always be consenting. You know that\nwith his identity, many women throw themselves at him, especially women in the entertainment\nindustry.”"
      },
      {
        "paragraph": "“What do you mean?”"
      },
      {
        "paragraph": "Catherine flung Shaun’s hand away. “You’re saying that Eliza seduced him, right?”"
      },
      {
        "paragraph": "Shaun frowned. “Cathy, don’t be so agitated. Maybe… After all, you’ve only known Eliza for a short\ntime.”"
      },
      {
        "paragraph": "“No, when Eliza was talking to us, she was very truthful and straightforward. She never thought of\nhiding anything.” Catherine got down from his legs furiously. “It’s you men who have wandering eyes\ndespite already having someone. In the end, you guys still accuse the woman of being indecent.”"
      },
      {
        "paragraph": "“Cathy, I…”"
      }
    ]
  },
  {
    "title": "Chapter 1484 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Shaun, I can’t be bothered to care about you anymore, ” Catherine said angrily, “From how I see it,\nyou don’t understand your friend at all. You’d better give him some advice. He’s about to get married. If\nhe has any needs, he can just look for Cindy. There’s no need to pester Eliza.”"
      },
      {
        "paragraph": "She left immediately after speaking."
      },
      {
        "paragraph": "Shaun’s scalp tingled. Women’s moods were as unpredictable as the summer weather."
      },
      {
        "paragraph": "He had no choice but to chase after her. “Alright, Cathy. Don’t be angry. I said the wrong thing just now.\nI’ll find Chester later and ask about the situation, okay? Also, don’t include me in this situation. I only\nhave you in my heart now.”"
      },
      {
        "paragraph": "Catherine gave him a sidelong glance. “Shaun, you’re a man. Men have their own understanding and\nway of thinking. However, I’m absolutely sure that Eliza isn’t that type of person. Besides, a smart\nwoman wouldn’t choose to do that. She’s extremely popular now. If news goes out and the public finds\nout that she’s involved in other people’s marriage,"
      },
      {
        "paragraph": "her career will be ruined. Moreover, a woman like Cindy shouldn’t be messed with. Frankly speaking,\nChester is too selfish. He only thinks with his lower half. He doesn’t know that if he does that, he’ll ruin\na person’s future. Wasn’t ruining Charity before enough for him?”"
      },
      {
        "paragraph": "“… Okay, you’re right.” Shaun agreed with her obediently. He was afraid he would offend her and make\nher upset again."
      },
      {
        "paragraph": "“ I’m leaving. Come back only after you convince him.” After Catherine spoke, she took her bag and\nleft."
      },
      {
        "paragraph": "Shaun laughed bitterly while looking at her from behind."
      },
      {
        "paragraph": "However, if everything she said was true, Chester’s actions were really too much."
      },
      {
        "paragraph": "After finishing up his work, Shaun drove to the hospital right away."
      },
      {
        "paragraph": "“You’re still on call at such a late hour?” After Shaun went into the office, he glanced at Chester, who\nwas wearing a white coat, in astonishment."
      },
      {
        "paragraph": "Chester was different from the other doctors. Not only was he Jewell Corporation’s youngest head,"
      },
      {
        "paragraph": "but his medical skills were also among the best in the whole world. Many patients worldwide were\nwilling to spend a tremendous amount of money to hire him to treat their illnesses. However, with his\nqualifications, if it were not to conduct surgery at night or if there were no emergency patients, he did\nnot need to be on the night shift."
      },
      {
        "paragraph": "“Did Catherine tell you to come? ” Chester raised his eyes. Behind the lenses, his calm eyes were\nexceptionally sharp."
      },
      {
        "paragraph": "Shaun dragged a chair out and sat down. He gave Chester a strange glance. “When Catherine told me\nabout it before, I didn’t really take it seriously."
      },
      {
        "paragraph": "However, looking at the situation now, I really have to ask… What’s wrong with you?”"
      },
      {
        "paragraph": "Shaun suddenly remembered that the night before yesterday when they played pool, Chester had\nlooked like he was in a very bad mood. Rodney had talked to Chester for a long while, but Chester’s\nexpression was still very awful."
      },
      {
        "paragraph": "“I just think she’s quite interesting.” Chester unbuttoned the collar of his shirt. His thin lips lifted into a\nsmile."
      },
      {
        "paragraph": "“Did she agree to be in an ambiguous relationship with you? Or did she promise you something?”\nShaun asked. He was puzzled."
      },
      {
        "paragraph": "“… No.” After a moment of silence, Chester denied it."
      },
      {
        "paragraph": "Shaun was surprised. “This isn’t your style."
      },
      {
        "paragraph": "Chester, you would never force women.”"
      },
      {
        "paragraph": "“I’ve never forced her.” Chester shrugged. “I’m still in the process of pursuing her.”"
      },
      {
        "paragraph": "“Pursuing?”"
      },
      {
        "paragraph": "Shaun frowned. “Sorry to be frank, but you’re already about to get married. You don’t have the right to\npursue women anymore. Chester, I know you’re not marrying Cindy out of love, but marriage is\nmarriage. Of course, it’s very typical for rich men t o have a few women beside them even after they’re\nmarried."
      },
      {
        "paragraph": "“However, you have to find a woman who can accept this kind of thing. The fact that Eliza can be good\nfriends with Freya and Cathy means that the three have similar personalities and are the same type of\npeople. They’re not to be played with. They don’t care about get"
      },
      {
        "paragraph": "ting an influential man because they have spiritual wealth. They like to rely on themselves more.”"
      }
    ]
  },

  {
    "title": "Chapter 1485 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“I know.”"
      },
      {
        "paragraph": "Chester spun the pen in his hand."
      },
      {
        "paragraph": "He understood everything Shaun said after getting rejected by Eliza a few times."
      },
      {
        "paragraph": "When he took Charity into account, he also thought he should stay away from Eliza."
      },
      {
        "paragraph": "However, sometimes, people were just that weird."
      },
      {
        "paragraph": "Chester could not understand why he suddenly went to her place in the morning."
      },
      {
        "paragraph": "He only knew that after seeing Eliza beat Jacob up to that state, he did not think she was double-faced.\nInstead, he felt a strange sense of admiration."
      },
      {
        "paragraph": "Chester did not like whiny women who pretended to be weak. When Eliza took the knife and stabbed it\ninto her back, he felt like he was also stabbed by something at that moment."
      },
      {
        "paragraph": "She was clearly such a scheming woman, and he hated scheming women the most."
      },
      {
        "paragraph": "However, Eliza was an exception."
      },
      {
        "paragraph": "At first, Chester kissed her because of her eyes. Afterward, he was attracted to her personality."
      },
      {
        "paragraph": "“No way, you have feelings for her?” Shaun suddenly said with a strange gaze when he saw Chester\nkeeping silent."
      },
      {
        "paragraph": "“Have feelings?” Chester was stunned. The pen he was spinning fell on the table. He laughed. “If\nyou’re talking about having feelings in the bed, I did experience that before. But having feelings out of"
      },
      {
        "paragraph": "bed…”"
      },
      {
        "paragraph": "Chester was in a daze. He recalled the time he just started dating Charity a long time ago."
      },
      {
        "paragraph": "“Shaun, I don’t know, ” Chester said in a low voice, “I just feel like I must have this woman.”"
      },
      {
        "paragraph": "“You’ve never had this kind of feeling where you must have a woman. The word ‘reluctant’ isn’t in your\ndictionary.”"
      },
      {
        "paragraph": "Shaun stood up and patted Chester’s shoulder. “ Chester, you don’t truly like Cindy. There’s no need to\nmarry her. Even if you have to marry, you can at least find an interesting woman whom you won’t hate\nfacing every day. If you want to have Eliza, you have to cancel your engagement. Otherwise, if you\nforcefully try to pull a tree, you’ll only end up snapping the tree.”"
      },
      {
        "paragraph": "“Do you think my parents will let me cancel my marriage with Cindy? Even the invitations are done, ”\nChester said indifferently."
      },
      {
        "paragraph": "“Then stay away from Eliza. What’s the point if you already know you two are not people from the same\nworld? I’ve already said all I have to. I have to go back now.”"
      },
      {
        "paragraph": "Shaun opened the door."
      },
      {
        "paragraph": "Chester suddenly said, “When you got together with Catherine back then, have you never thought that\nthe two of you weren’t people from the same world? But didn’t you still continue anyway?”"
      },
      {
        "paragraph": "Shaun was taken aback. “My memory of the past is a bit blurry, but I’m different from you. I knew\nclearly that I loved her. It’s different from you who want to possess Eliza.”"
      },
      {
        "paragraph": "“How is it different?”"
      },
      {
        "paragraph": "“The former lasts for a lifetime, while the latter is just temporary. Eliza won’t be the only one for you.”"
      },
      {
        "paragraph": "Shaun left straight away after speaking."
      },
      {
        "paragraph": "When Shaun returned to the Hill family’s manor, Catherine went up to him. “You went to look for"
      },
      {
        "paragraph": "Chester, right? How did it go?”"
      },
      {
        "paragraph": "“I’ve said everything I had to.” Shaun pondered for a moment. Then, he frowned and said, “But I feel\nlike Chester is slightly different this time.”"
      },
      {
        "paragraph": "“Which part of him is different?” Catherine was puzzled."
      },
      {
        "paragraph": "“He might really have feelings for Eliza,” Shaun said, “At the very least, besides Charity back then, I’ve\nnever seen him trying to get a woman this way.”"
      }
    ]
  },
  {
    "title": "Chapter 1486 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Don’t mention Charity,” Catherine said angrily, “ Didn’t Chester just want to toy Charity when he dated\nher back then? After he had her, he just left.”"
      },
      {
        "paragraph": "“It didn’t seem like that, ” Shaun muttered, “When he was dating Charity, he was quite patient. He’s a\nperson who’s extremely impatient toward women. Charity was the only person he was willing to wait\nfor. Afterward, they suddenly broke up. Besides, Chester kept thinking that Charity was bullying Sarah\nat that time. They both might’ve had some other problems.”"
      },
      {
        "paragraph": "“When did Charity bully Sarah? It was Sarah who pretended to be weak and made people think that\nothers were bullying her, ” Catherine said frustratedly."
      },
      {
        "paragraph": "“We didn’t know that at that time.” Shaun held her hands hurriedly. “Let’s not mention the past\nanymore. Cathy, I haven’t eaten yet. I’m hungry.”"
      },
      {
        "paragraph": "“Can’t you go to the kitchen to look for food if you’re hungry? I’m not your cook.” Catherine flung his\nhand away. “Hmph, speaking of Sarah, I haven’t seen her for quite some time. Don’t think I’ll just let\nthis slide. I’ll slowly teach her a lesson.”"
      },
      {
        "paragraph": "She ignored Shaun and left after speaking."
      },
      {
        "paragraph": "Suzie and Lucas walked over, simply watching the fun. “Scummy Daddy, did you offend Mommy\nagain?”"
      },
      {
        "paragraph": "Shaun let out a long sigh."
      },
      {
        "paragraph": "Melbourne."
      },
      {
        "paragraph": "An airplane from abroad landed at Melbourne Airport."
      },
      {
        "paragraph": "After waiting for more than ten minutes outside, Matthew saw Titus circling Sheryl as they walked out\ntogether. Both of them had already been married for tens of years, yet they were still like a couple—\nespecially his father, who longed to be with his mom for every single moment."
      },
      {
        "paragraph": "Rebecca followed behind. She was like a princess with a few bodyguards following behind her while\ncarrying the luggage."
      },
      {
        "paragraph": "“Dad, Mom, Sis.” Matthew went forward."
      },
      {
        "paragraph": "“Matt.” Rebecca smiled sweetly. “Why did you come back to Australia first? You didn’t wait for us. I f it\nweren’t because I wanted to accompany Mom more, I would’ve come back with you too.”"
      },
      {
        "paragraph": "“I came back in advance to get Uncle Jeffery and Aunt Sally out of jail.” Matthew smiled as he looked at\nSheryl. “Mom, let me bring you to meet Uncle Jeffery and Aunt Sally. They initially wanted to pick you\nup, but I let them wait in the villa.”"
      },
      {
        "paragraph": "“Okay.” Sheryl nodded. She felt slightly emotional."
      },
      {
        "paragraph": "After having lost her memories for more than ten years, she was finally in her homeland."
      },
      {
        "paragraph": "Along the way, Matthew drove the car toward the city center. Sheryl looked out of the window while\nRebecca introduced the names of some places in Melbourne to her."
      },
      {
        "paragraph": "Sheryl looked for a while and suddenly said, “I think that this place is quite familiar.”"
      },
      {
        "paragraph": "Titus hugged his beloved wife and asked, “Do you remember something?”"
      },
      {
        "paragraph": "“I think I vaguely remember some things, especially the school we passed by just now. Did I study there\nbefore?” Sheryl suddenly asked."
      },
      {
        "paragraph": "Rebecca’s heart skipped a beat upon hearing that.“ I don’t know about that, Mom. You left too early.\nGranny didn’t talk to me about it before.”"
      },
      {
        "paragraph": "“Oh.” Sheryl was slightly regretful. “I want to walk around Melbourne more during these few days. Like\nthe place I studied in before and the house I lived in. Maybe it’ll be helpful in recovering my memories. ”"
      },
      {
        "paragraph": "“Are the memories of the past that important? Didn’t we already manage to find Rebecca?” Titus said\nall of a sudden as he felt uncomfortable."
      },
      {
        "paragraph": "Sheryl glared at him angrily. “What are you saying? How can those memories not be important? I’ve\nlost more than 2o years of my memories. Half of my life is blank. Who can take it?”"
      },
      {
        "paragraph": "Matthew smiled and said, “Mom, Dad is afraid you’ll remember your past relationship. He’s jealous.”"
      },
      {
        "paragraph": "“You brat, no one will think you’re a mute even if you don’t say anything. ” Titus looked as though\nsomeone had stepped on his toe. He glared at his son fiercely."
      },
      {
        "paragraph": "“We’ve been together for so long. Do you think I’ll still care about that relationship in the past? Do you\nstill not understand me?” Sheryl held her husband’s arm speechlessly and said, “I remember vividly\nhow well you’ve been treating me in these tens of years.”"
      }
    ]
  },
  {
    "title": "Chapter 1487 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Only then did Titus’ cold face relax slightly. He whispered in Sheryl’s ear, “When we go back later, say\nthat you love me.”"
      },
      {
        "paragraph": "Sheryl. “…..”"
      },
      {
        "paragraph": "She really could not stand this old man acting so childishly."
      },
      {
        "paragraph": "Matthew pretended not to see them. In any case, he was already used to it. To his parents, he was just\na free gift."
      },
      {
        "paragraph": "Rebecca had no such thoughts. Her mind was in a clamor now. She never expected Sheryl to\nremember something as soon as she returned to Melbourne. Maybe she had never recovered her\nmemories before because she did not go to any familiar places, but if she stayed a little longer here\nand went to places she previously lived, she might recover her memory. If that happened, she would\nfind out that her daughter was named Catherine Jones."
      },
      {
        "paragraph": "Rebecca had to stop Sheryl from regaining her memory."
      },
      {
        "paragraph": "How would she do that?"
      },
      {
        "paragraph": "They soon arrived at the villa. Jeffery and Sally had been waiting at the door for a while."
      },
      {
        "paragraph": "After the car stopped, the strong and powerful Titus first came down, followed by a charming and\nbeautiful woman. The woman had taken good care of her beauty and did not look a day beyond 30."
      },
      {
        "paragraph": "Jeffery stared at her for a while and felt his eyes redden. “Sherry…”"
      },
      {
        "paragraph": "He cried and rushed over but was blocked by the domineering Titus."
      },
      {
        "paragraph": "“Dad, this is Uncle and Aunty,” Matthew reminded him to stop his father from being so jealous."
      },
      {
        "paragraph": "“I can tell, ” Titus said faintly. He just did not want to let unfamiliar men embrace Sheryl."
      },
      {
        "paragraph": "“You’re my older brother, right?” Sheryl looked at Jeffery. When she saw him, she seemed to\nexperience a familiar feeling."
      },
      {
        "paragraph": "“Sherry, I really didn’t expect that… you’re still alive. ” Jeffery was truly excited. After all, he grew up\nwith his little sister. It was only after Sheryl left that he gradually became blinded by greed."
      },
      {
        "paragraph": "“Sherry, I’m your sister-in-law. You’re still as young and beautiful as before. ” Sally sighed with emotion.\n“You’re not like your brother and me."
      },
      {
        "paragraph": "We’ve gotten so old we look like we’re in our 60s.”"
      },
      {
        "paragraph": "“Aunty, you two must have suffered in prison, ” Rebecca hurriedly said, reminding Sheryl that her\nbrother and sister-in-law became like this because of Catherine."
      },
      {
        "paragraph": "Jeffery froze when he heard Rebecca call Sally ‘ Aunty’, but fortunately, Sally reacted quickly and said,\n“Let’s not talk about that. Come in.”"
      },
      {
        "paragraph": "“Jeffery, Sally, thank you for taking care of Mom, Dad, and Rebecca all these years,” Sheryl said\ngratefully. “You’ve brought her up very well.”"
      },
      {
        "paragraph": "Jeffery remained silent, but Sally said guiltily, “ Don’t say that. It was our fault that Rebecca was\nabducted by traffickers back then. Fortunately, we didn’t give up and managed to get her back. Also,\nI’m really sorry, Sherry. The Hudson Corporation you founded back then was supposed to be left to\nRebecca, but my daughter was too vicious and took away all the family’s properties. I—”"
      },
      {
        "paragraph": "“Don’t say any more. I don’t blame you, ” Sherry interrupted her with cold eyes. “Although I don’t care\nabout that property, some people should get the punishment they deserve.”"
      },
      {
        "paragraph": "Jeffery stammered, “ S— Sherry, she’s still my flesh and blood. You can teach her a lesson, but spare\nher life, okay? Let her live.”"
      },
      {
        "paragraph": "“You’re too soft—hearted.” Sheryl sighed. “But I understand. Don’t worry. At most, I’ll let her lose her\nreputation and be left with nothing. I’ll make her pay the consequences for her deeds.”"
      },
      {
        "paragraph": "Matthew, who was at the side, could not help but frown. He thought about Catherine and was a little\npuzzled. Was she such a bad person?"
      },
      {
        "paragraph": "“By the way, Jeffery, could you take me to the place I used to live in before? I want to get my memory\nback as soon as possible,” Sheryl said."
      }
    ]
  },
  {
    "title": "Chapter 1488 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Memory?” Sally froze for a moment before nodding quickly. “Of course, of course.”"
      },
      {
        "paragraph": "After lunch."
      },
      {
        "paragraph": "Jeffery and Sally called Rebecca to the study."
      },
      {
        "paragraph": "Sally lowered her voice and said agitatedly, “ Rebecca, what’s going on? Didn’t you say before that she\ncan’t remember anything about the past? If she remembers, then we’re finished. Look at Titus. He’s not\nsomeone we can offend.”"
      },
      {
        "paragraph": "“It’s all your fault. Why did you have to lie?” Jeffery almost went crazy from anger. “You even\nimpersonated Catherine. Do you want to die?”"
      },
      {
        "paragraph": "“Mom, Dad, if it weren’t for me, the two of you would still be in jail, ” Rebecca said coldly. “Besides,\nhave you ever considered this? If Catherine is one day acknowledged by Sheryl, it’ll be child’s play if\nshe wants to deal with me. I’ll be tortured to death by her.”"
      },
      {
        "paragraph": "“Old man, have you forgotten how Shaun sold our daughter to the backwoods?” Sally held back her\ntears and reminded him fiercely."
      },
      {
        "paragraph": "Jeffery was suddenly speechless. His anger had calmed down after being locked up for several years,\nbut Rebecca’s bitter experience also made him furious."
      },
      {
        "paragraph": "“Mom, Dad, don’t worry. I’ll think of a way. Just watch out and don’t let anything slip, ” Rebecca said."
      },
      {
        "paragraph": "“Are we really going to bring her to the places she used to go in the past?” Jeffery asked blankly."
      },
      {
        "paragraph": "“Take her to a few unfamiliar places and stall her for two days.”"
      },
      {
        "paragraph": "Rebecca reminded them, “Remember. Drill it into your heads that Catherine Jones is your biological\ndaughter.”"
      },
      {
        "paragraph": "Jeffery and Sally nodded."
      },
      {
        "paragraph": "After returning to her room, Rebecca called Wesley. “Is there any way to stop Sheryl from recovering\nher memory? We’ re in the same boat now. If I’ m exposed, I’ll rat you out too. Don’t forget, you’re in a\nbad situation now as well.”"
      },
      {
        "paragraph": "Wesley pinched his temples. “There’s a person who might come in handy, but I want to ask you. When\nare they going to make their move against Shaun and Catherine? Shaun is at the peak of his power\nnow. He’s pressing down on me so hard I can barely breathe.”"
      },
      {
        "paragraph": "“We’ll go to Canberra in a few days. ” Rebecca hung up the phone."
      },
      {
        "paragraph": "Wesley quickly drove to Sarah. “You’re a psychologist. Is there a way to make a person who lost their\nmemory because of an accident never recover their memory?”"
      },
      {
        "paragraph": "“Never?” Sarah raised her brows and gave him a strange look."
      },
      {
        "paragraph": "“After this matter is settled, I won’t treat you poorly,” Wesley said in a low voice."
      },
      {
        "paragraph": "“Forgive me for saying this, President Lyons, but can you really make a comeback?” Sarah was\nskeptical. She had seen for herself how Shaun suddenly rose back to power again."
      },
      {
        "paragraph": "“Do you think I’ll be brought down so easily? Before Mason fell, I already got a portion of his\nconnections abroad. Shaun and the Jewell family have joined hands to suppress me these days, but"
      },
      {
        "paragraph": "the people who will deal with Shaun and Catherine have appeared.” Wesley let out a low chuckle. “That\nperson is the one I need your help in preventing her from recovering her memory.”"
      },
      {
        "paragraph": "Sarah raised her eyebrows. “I know of a medicine for treating mental illness. After taking it, it’ll\ntemporarily cause the person to be unable to recover their memory. But there’ll be some side effects.”"
      },
      {
        "paragraph": "“What side effects?”"
      },
      {
        "paragraph": "“It’ll cause hallucinations sometimes.” Sarah smiled. “Do you want it?”"
      }
    ]
  },
  {
    "title": "Chapter 1489 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Wesley was silent for a while before asking, “Will the side effects be obvious?”"
      },
      {
        "paragraph": "“If she doesn’t take it that much, the effects won’t be noticeable at first. But if she takes it for a long\ntime… I can’t guarantee anything,” Sarah said honestly."
      },
      {
        "paragraph": "“A long time… How long is half of it?” “Around two to three years.”"
      },
      {
        "paragraph": "“That’s enough. Give me the medicine.” A cruel light flashed in Wesley’s eyes. Two to three years was\nenough for him to stand on the top of the world."
      },
      {
        "paragraph": "Besides, the person Titus Costner cared about most was Sheryl. If Sheryl suffered from a nervous\nbreakdown, Titus would definitely be affected."
      },
      {
        "paragraph": "There was also Rebecca, so they could change a lot of things in two to three years."
      },
      {
        "paragraph": "In Melbourne."
      },
      {
        "paragraph": "In the past two days, Jeffery brought Sheryl and Titus to many places."
      },
      {
        "paragraph": "“Sherry, this is our family’s old company, Summit Design. In the past, you used to help Dad here during\nsummer break. Unfortunately, it doesn’t belong to us now, so you can just look at the entrance.” Jeffery\nrevealed a trace of regret."
      },
      {
        "paragraph": "Sheryl looked at the building in front of her. The feeling of familiarity disappeared completely after she\nfelt it on the first day. “If it was a business left behind by our dad, why doesn’t it belong to the Jones\nfamily?”"
      },
      {
        "paragraph": "Jeffery lowered his head with embarrassment, and Sally sighed before saying, “ It’s because of Shaun.\nAfter we got Rebecca back, we recruited her into Summit to try and make it up for her, but Catherine\nwasn’t happy about it. She thought that Rebecca wanted to steal Summit and hated us, so when she\ngot together with Shaun, she tried to use underhanded methods to go against Summit, causing Summit\nto become infamous. After the turnover of funds… we had to sell Summit.”"
      },
      {
        "paragraph": "“Aunty, Uncle, I’m sorry,” Rebecca immediately apologized. “I shouldn’t have come back then.”"
      },
      {
        "paragraph": "“Don’ t say that. It’s because we didn’t teach our daughter well.” Sally pretended to be sad."
      },
      {
        "paragraph": "Sheryl became more annoyed the more she listened, and her impression of Catherine got worse."
      },
      {
        "paragraph": "Ever since she came back, she had heard countless stories of what demented things Catherine did to\nher own parents and Rebecca."
      },
      {
        "paragraph": "How could a person be so vicious?"
      },
      {
        "paragraph": "After returning to the hotel, she immediately called Matthew. “Didn’t you go to Canberra for a few days?\nHow are the preparations for teaching Catherine a lesson going? Since Hudson Corporation was\nfounded by me and left to Rebecca, it’s time for me to get it back.”"
      },
      {
        "paragraph": "Matthew’s blue eyes flickered with conflict. After a moment, he said, “Mom, there’s something you don’t\nknow about. I looked into Hudson and found that Catherine is the only shareholder. In other words, all\nthe power is in her hands. The previous shareholders were all kicked out by her. It’s basically\nimpossible to get Hudson back.”"
      },
      {
        "paragraph": "“That woman… is pretty crafty.”"
      },
      {
        "paragraph": "Sheryl was a little surprised. If Catherine had not done so many evil deeds, she might even admire her.\n“As far as I know, she only took over Hudson in recent years. She’s such a young woman, yet she was\nable to kick away all those old shareholders."
      },
      {
        "paragraph": "She’s definitely a ruthless and bold person.” Titus remained silent."
      },
      {
        "paragraph": "“Forget it. It’s just a small company anyway. It’s fine even if we don’t get it back. Contact some people,\nmake some trouble, and once their funding gets cut off, Hudson naturally won’t be able to last,” Sheryl\nsaid faintly, “Just let it fall.”"
      },
      {
        "paragraph": "Matthew frowned. “Catherine has Hill Corporation backing her. If their funding gets cut off, Hill\nCorporation will definitely help her. Also… she’s acknowledged Joel Yule as her\nfather…………………………………………………………………………… Although Joel has left Yule\nCorporation, he opened a logistics company by himself that has become one of the top logistics\ncompanies in the country after just one year. They might even be expanding globally soon. ”"
      },
      {
        "paragraph": "“Joel Yule?” Sheryl frowned. “What a stupid man. He can’t even figure out who his real daughter is.”"
      },
      {
        "paragraph": "Titus, who was at the side, immediately became upset. “It’s fine if he can’t figure it out. Are you\nplanning to go to his door and personally explain it to your old flame? I don’t want you to have anything\nto do with him. What’s more, you have a daughter with him and I heard that he isn’t married now. I’m\nafraid he’ll get the wrong idea.”"
      },
      {
        "paragraph": "Sheryl originally thought of going to Joel herself,"
      },
      {
        "paragraph": "but she dismissed the idea after Titus’ words."
      },
      {
        "paragraph": "“If you ask me, there’s no need to worry about Joel at all, ” Titus said faintly, “Joel’s company is\nexpanding, so their funds must be stretched taut. He won’t be able to help Catherine at all. The only"
      },
      {
        "paragraph": "one we have to deal with is Hill Corporation.”"
      }
    ]
  },
  {
    "title": "Chapter 1490 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Sheryl nodded. “Don’t you know a person here? Just contact that person.”"
      },
      {
        "paragraph": "“That was what I was thinking as well.”"
      },
      {
        "paragraph": "Titus wrapped his arms around her. “We’ll fly to Canberra tomorrow and have a meal with that person.\nIt’s a small matter.”"
      },
      {
        "paragraph": "Matthew listened to his parents’ casual tone and frowned slightly."
      },
      {
        "paragraph": "He naturally knew of his father’s methods. Titus had connections all over the world."
      },
      {
        "paragraph": "He did not have a good impression of Shaun, but Catherine…"
      },
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "Sheryl, Titus, Matthew, and Rebecca flew to Canberra."
      },
      {
        "paragraph": "When the plane landed, Rebecca took a deep breath. ‘Canberra, I’m back.’ That year, she had run\naway"
      },
      {
        "paragraph": "from this place in a wretched state. Now, she was back."
      },
      {
        "paragraph": "Soon, an extended bulletproof Rolls-Royce personally took them to a secluded and gorgeous courtyard\nhouse."
      },
      {
        "paragraph": "After a feast, Matthew took them back to the mansion he had bought in the capital."
      },
      {
        "paragraph": "When the two women went to wash up, Matthew called out to Titus, “Dad…”"
      },
      {
        "paragraph": "“What is it?” Titus’s dignified eyes looked at him. “ You look like you have something to say to me.”"
      },
      {
        "paragraph": "Matthew was slightly annoyed. He wanted to talk to Titus, but his father was constantly stuck to\nSheryl’s side and Rebecca would be around as well."
      },
      {
        "paragraph": "“Dad, let’s talk in the study, ” Matthew said in a low voice."
      },
      {
        "paragraph": "Titus nodded. After they entered the study, he suddenly said, “By the way, you mentioned before that\nyou met a very beautiful woman and fell in love with her at first sight, right?”"
      },
      {
        "paragraph": "Matthew paused. If he told Titus that he had fallen in love with Catherine at first sight, Titus might kill\nhim. “Oh, nah. I found out later that she’s already married.”"
      },
      {
        "paragraph": "Titus looked at him with slight sympathy. It was not easy for Matthew to like someone, but the woman\nended up being married."
      },
      {
        "paragraph": "“Dad, actually… I want to talk to you about Catherine…” Titus bit the bullet and spoke."
      },
      {
        "paragraph": "“Don’t tell me that the married woman you like is her, ” Titus suddenly said."
      },
      {
        "paragraph": "Matthew, “….”"
      },
      {
        "paragraph": "It seemed there was no way to continue this conversation."
      },
      {
        "paragraph": "Seeing Matthew fall silent, Titus’ face immediately turned icy. “She seduced you.”"
      },
      {
        "paragraph": "“No, Dad. I met her by coincidence the day I came to Canberra. I didn’t even know she was Catherine\nback then. She saved me,” Matthew hurriedly explained."
      }
    ]
  },
  {
    "title": "Chapter 1491 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Do you think she saved you out of the goodness of her heart?” Titus sneered. “Have you forgotten\nhow many people tried getting close to you since you were a child? You grew up in Neah Bay. How are\nyou still so naive?”"
      },
      {
        "paragraph": "“Dad, she didn’t know my identity at that time. I had just arrived in Canberra. Besides, how would she\nhave found out my identity?”"
      },
      {
        "paragraph": "Matthew did not agree with his father’s words. “Of course, I also suspected her before. After I came to\nCanberra, I met her several times after the first time. I think that… Catherine isn’t such a bad woman.”"
      },
      {
        "paragraph": "“There are lots of women who are good at acting.” Titus frowned coldly. “She didn’t even spare her\nbiological parents. After all that she’s done, you’re still speaking up for her. If your mom hears about\nthis, just see what she’ll do to you.”"
      },
      {
        "paragraph": "“That’s why I’m not telling her.” Matthew pouted. “Dad, actually… I just think that sometimes, what you\nhear may not be the truth.”"
      },
      {
        "paragraph": "“What does that mean?” Titus narrowed his eyes. “ Are you suspecting that Rebecca and Jeffery are\nlying? Matthew, watch what you say. Rebecca did the DNA test. She’s your mother’s biological\ndaughter.”"
      },
      {
        "paragraph": "“I don’t know, Dad. Maybe… if you meet Catherine, you’ll find out that she’s not that bad, ” Titus said, “\nShaun doesn’t seem that unbearable either. He spoils his wife a lot.”"
      },
      {
        "paragraph": "“Why should I meet her? Don’t forget, I came here t o solve the issues as soon as possible and take\nyour mother back. ” Titus walked to the door and turned around to say to Matthew, “I’ve heard what you\nhad to say. This conversation ends here.” Titus left, and Matthew let out a vexed sigh."
      },
      {
        "paragraph": "At noon the next day."
      },
      {
        "paragraph": "Rebecca walked into a high-end restaurant with a designer bag."
      },
      {
        "paragraph": "“Rebecca, it’s really you.”"
      },
      {
        "paragraph": "Linda stood up, and her pupils shook when she saw Rebecca. She was also a person who bought and\nwore luxury items, so she could see at a glance that Rebecca’s bag was one that had just been\nreleased in Country F. It had not started selling in Australia yet, and the price was around a couple\nhundred thousand dollars."
      },
      {
        "paragraph": "Furthermore, it was clear at first glance that Rebecca’s dress was expensive too."
      },
      {
        "paragraph": "“Linda, it’s been a long time.” Rebecca sashayed over and hugged her. “ It seems you haven’t been\ndoing well recently. Your face looks haggard.”"
      },
      {
        "paragraph": "“It’s been tough.” Linda smiled bitterly. “You might not know this since you just came back but Freya got\nrevenge on Jackson Corporation a few days ago. Freya has the Snow family behind her, and the Snow\nfamily has been suppressing the Shelby and Jackson families. The only thing Jackson Corporation has\nleft is its name, and Patrick… he was put into jail and can’t be rescued.”"
      },
      {
        "paragraph": "Her eyes reddened as she spoke. She was truly in love with Patrick."
      },
      {
        "paragraph": "“He’s just a man, ” Rebecca smiled faintly. “Patrick can be considered an excellent man in Melbourne,\nbut if you put him against the men abroad, he can’t compare to them. You can just get a better man. I’ll\nintroduce you to one.”"
      },
      {
        "paragraph": "Linda shook her head without having to think about it. “I grew up with Patrick and have liked him since"
      },
      {
        "paragraph": "we were children. I didn’t start liking him recently. Rebecca, could you…”"
      },
      {
        "paragraph": "After a pause, she said bitterly, “Never mind. He offended the Snow family. How could you help him?”"
      },
      {
        "paragraph": "“Don’t say that. I do have a way, ” Rebecca played with her fingers and said casually."
      },
      {
        "paragraph": "Linda looked up at her. “Don’t lie to me.”"
      },
      {
        "paragraph": "“Why would I lie to you? Since you helped me by telling me about Freya doing the DNA test, I’m willing\nto help you this time too.” Rebecca smiled. “ I hope… we can continue to work together in the future.\nFrankly, don’t you hate Freya?”"
      },
      {
        "paragraph": "“Of course.” Linda nodded. Her eyes revealed hatred."
      },
      {
        "paragraph": "“Catherine’s friend is my enemy.” Rebecca smiled insincerely and picked up her cup. “Let’s toast to my\nreturn.”"
      }
    ]
  },
  {
    "title": "Chapter 1492 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Hill Manor."
      },
      {
        "paragraph": "At 8:oo a.m., Catherine prepared breakfast. Lucas was dressed handsomely in his uniform and sat\ndown to eat his noodles obediently, but Suzie did not behave herself. She did not like to eat breakfast\nand only wanted to eat doughnuts."
      },
      {
        "paragraph": "“Suzie, you can’t eat sweets in the morning.” Shaun coaxed his daughter and fed her spoonful by\nspoonful."
      },
      {
        "paragraph": "That scene made Catherine feel quite happy. In the past, she was the one who had to do this kind of\nthing, but she finally did not need to do it anymore."
      },
      {
        "paragraph": "“ Scummy dad, I don’t wanna eat noodles. ” Suzie puffed up her little cheeks."
      },
      {
        "paragraph": "Lucas snorted bluntly. “If you eat snacks every day, you’ll become fat. I won’t admit to you being my\nlittle sister in preschool then.”"
      },
      {
        "paragraph": "“Mommy, he’s picking on me again.” Suzie began to complain."
      },
      {
        "paragraph": "Catherine rubbed her forehead."
      },
      {
        "paragraph": "The phone that Shaun left on the table suddenly rang. It was from Hadley."
      },
      {
        "paragraph": "He answered the call, and after a moment, his handsome face darkened. “I’ll come to the company\nright away.”"
      },
      {
        "paragraph": "Catherine looked up at him. “Didn’t you say you wanted to send them to preschool together? You’re\nleaving now?”"
      },
      {
        "paragraph": "“Something came up at the company.” Shaun reached out to rub her hair. “I have to go now.”"
      },
      {
        "paragraph": "Catherine looked at his solemn expression and nodded."
      },
      {
        "paragraph": "After breakfast, she drove the two children to the preschool at the foot of the mountain."
      },
      {
        "paragraph": "When the two children went in, she drove to the company."
      },
      {
        "paragraph": "Along the way, she suddenly received a call from Freya. “Patrick was released.”"
      },
      {
        "paragraph": "“Huh?” Catherine was taken aback. “Did the Snow family let him go so soon? Didn’t they say he would\nbe locked up for decades?”"
      },
      {
        "paragraph": "“Yeah, that’s what I thought at first, ” Freya said in a low voice, “ I asked my godmother about it. The\nSnow family has never intended to release Patrick. He was supposed to be locked up for at least ten"
      },
      {
        "paragraph": "years, but he was suddenly released. Godmother said it was an order from the executive council…”"
      },
      {
        "paragraph": "“Is Patrick great enough to be saved by the people in the executive council?” Catherine was baffled."
      },
      {
        "paragraph": "“I also find it strange. If the Jackson family were that capable, his parents wouldn’t have needed to beg\nmy parents.” Freya was also confused. “But it’s true. Patrick is fine now.”"
      },
      {
        "paragraph": "The more Catherine listened, the more she felt that it was strange."
      },
      {
        "paragraph": "“By the way, do you know that something happened to Hill Corporation?” Freya suddenly asked."
      },
      {
        "paragraph": "“What happened?” Catherine was at a loss."
      },
      {
        "paragraph": "“Didn’t Shaun tell you?” Freya was surprised. “Hill Corporation has been included in an investigation\nblacklist. Currently, all the relevant departments have set up investigation teams to charge into Hill\nCorporation for investigation.”"
      },
      {
        "paragraph": "Catherine suddenly remembered how Shaun had left in a hurry this morning and got a bad feeling. “\nWhy is Hill Corporation suddenly being blacklisted for no reason? By the way, isn’t Shaun close to the\nSnow family?”"
      },
      {
        "paragraph": "Freya opened her mouth, and after a moment, she said with difficulty, “I heard my godfather say that\nHill Corporation might be facing an unprecedented crisis this time. It’s not the same as what happened\nlast time. Shaun might lose everything.”"
      },
      {
        "paragraph": "“You’re joking, right?” Catherine could not believe it. “Hill Corporation just made a comeback and it’s\ntime for them to rise…”"
      }
    ]
  },
  {
    "title": "Chapter 1493 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“He seems to have offended someone terrifying."
      },
      {
        "paragraph": "Even my godfather can’t go up against that"
      },
      {
        "paragraph": "person, ” Freya interrupted her and said with a hint of helplessness."
      },
      {
        "paragraph": "Catherine’s brain went abuzz with noise."
      },
      {
        "paragraph": "Shaun and she had gone through so much to be able to get to where they were now. Mason went to jail\nand they could finally finish Wesley off, but now, they had apparently offended an even more terrifying\nperson."
      },
      {
        "paragraph": "Who was it?"
      },
      {
        "paragraph": "She was incredibly tired and at a loss."
      },
      {
        "paragraph": "Whether it was Shaun or herself, it had not been easy for them to reach this point."
      },
      {
        "paragraph": "“Are you okay?” Freya asked with concern."
      },
      {
        "paragraph": "“I don’t know, Freya. I’ll go to Hill Corporation and take a look, ” Catherine said tiredly."
      },
      {
        "paragraph": "After hanging up the call, she made a detour to Hill Corporation."
      },
      {
        "paragraph": "Currently, reporters were clamoring outside of Hill Corporation. Hence, Catherine entered from the\nparking lot. When she reached the top floor, she saw several people in blue uniforms walking around\nwith several boxes."
      },
      {
        "paragraph": "The company employees stood on two sides until someone from the secretary’s office noticed her. “\nMiss Jones…”"
      },
      {
        "paragraph": "“Where’s President Hill?” Catherine asked."
      },
      {
        "paragraph": "“President Hill and a few directors are inside.” The secretary led her in."
      },
      {
        "paragraph": "In the large office, Shaun, Lea, Spencer, and various directors were present. They all had unpleasant\nexpressions on their faces."
      },
      {
        "paragraph": "“President Hill, I hope that you can find out about the situation from Senator Snow as soon as\npossible,” one of the directors said, “No matter what, Hill Corporation is suddenly being investigated\nwith great fanfare for no reason."
      },
      {
        "paragraph": "Reporters are swarming outside the company. What will others think about Hill Corporation?”"
      },
      {
        "paragraph": "“Damn it, what’s happening to Hill Corporation this year? It wasn’t easy to bring down the Campos\nfamily and climb up again, but now we’re being investigated again. Many companies have called to"
      },
      {
        "paragraph": "ask about the situation. We’ve signed so many contracts. If all the work is delayed again like last time,\nwe’ll really lose everything this time.” Spencer also lost his temper."
      },
      {
        "paragraph": "“Everyone, go back and rest for now. I’ll personally go over to look for Senator Snow later, ” Shaun said\nin a low voice."
      },
      {
        "paragraph": "When the directors left one after another, Catherine walked over to Shaun’s side. “Why didn’t you tell\nme about such an important matter?”"
      },
      {
        "paragraph": "“I didn’t want you to overthink.” Shaun cradled her hand gently in his large palm."
      },
      {
        "paragraph": "Catherine frowned at him. “I found out anyway. Freya called me earlier and said that… we might have\noffended someone terrifying. I’m afraid it won’t be easy to solve this. We both know that the biggest\nfear in the business world isn’t competitors but investigations…”"
      },
      {
        "paragraph": "Especially an investigation that happened without reason."
      },
      {
        "paragraph": "If anything was found, it could make the company lose its reputation and its stock price plummet—\neven causing the company to be delisted."
      },
      {
        "paragraph": "Especially Hill Corporation, which had just launched new products. It would cause many companies\nthat originally wanted to cooperate to avoid Hill Corporation instead."
      },
      {
        "paragraph": "“Cathy, don’t let your imagination run wild. I’ve experienced all sorts of things to get to where I am\ntoday.” Shaun’s handsome face smiled. “You have to believe in me.”"
      },
      {
        "paragraph": "“Shaunny…”"
      },
      {
        "paragraph": "Catherine’s red lips parted. She suddenly froze when a thought flashed in her head."
      },
      {
        "paragraph": "“What’s wrong?” Shaun asked softly."
      },
      {
        "paragraph": "“I remembered something, ” Catherine said, “Freya said that Patrick was released on orders from the\nexecutive council, and now Hill Corporation is being investigated. I’m wondering if these two matters\nare connected. In this country, the only force that the Snow family is powerless against is the executive\ncouncil.”"
      },
      {
        "paragraph": "Shaun frowned. After a moment, he said, “I didn’t think about the Jackson family, but your words have\nreminded me. Cathy, go to the company. I’ll go to the Snow residence…” “I’ll go with you.” Catherine\nimmediately stood up. “Shaunny, I want to face this with you. If you can’t overcome this hurdle, I’ll have\nto leave your side.”"
      }
    ]
  },
  {
    "title": "Chapter 1494 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun froze and stared at her with an unpleasant expression."
      },
      {
        "paragraph": "“ Shaunny, I’m sorry. Even if what I said is hard to hear, I have to do it for the children,” Catherine bit\nher lip and said in a low voice."
      },
      {
        "paragraph": "“No, I’m unhappy because you think of me as useless. No matter who the mastermind is, I won’t be\npulled down that easily.” Shaun hugged her gently. “If there really comes a day when I can’t protect you\nand the children, you don’t have to say anything more. I’ll let you go.”"
      },
      {
        "paragraph": "Catherine did not say anything, but her eyes stung. She loved him, and he loved her."
      },
      {
        "paragraph": "However, reality was not a fairy tale. They had to be responsible for their children."
      },
      {
        "paragraph": "After reaching the Snow residence."
      },
      {
        "paragraph": "When the butler brought them in, they heard Rodney’s voice when they arrived at the door."
      },
      {
        "paragraph": "“Uncle, Shaun is like my brother and he has a good relationship with the Snow family. You have to help\nhim.”"
      },
      {
        "paragraph": "“ Second Master Snow, Young Master Hill and Miss Jones are here, ” the butler said."
      },
      {
        "paragraph": "Shaun and Catherine took a look and saw that besides Nathan, Freya and Rodney were present too."
      },
      {
        "paragraph": "Shaun nodded at them and punched Rodney’s shoulder gently. “Thanks.”"
      },
      {
        "paragraph": "“We’re brothers.” Rodney chuckled and rubbed his nose."
      },
      {
        "paragraph": "Shaun did not say anything else and looked at Nathan. “Uncle Nathan, you know how I am. The Hill\nfamily has stood at the top of the business world for more than a hundred years and has always abided\nby the rules. This is the first time that such a large-scale investigation has been carried out. I just want\nto know what they want.”"
      },
      {
        "paragraph": "“Shaun, I’ll tell you the truth.” Nathan lit a cigarette. “I contacted the executive council, and they warned\nme not to intervene in this matter."
      },
      {
        "paragraph": "Otherwise, I won’t be able to afford the consequences.”"
      },
      {
        "paragraph": "Everyone’s expressions changed."
      },
      {
        "paragraph": "Rodney stood up furiously. “Do they want to ruin Hill Corporation?”"
      },
      {
        "paragraph": "“Most likely,” Nathan nodded and said helplessly, “ Even though you’ve come to me for help, the only\nthing I can give you is an apology.”"
      },
      {
        "paragraph": "Shaun’s handsome face sunk. “You’ll be the prime minister next month. What if I delay it until then?”"
      },
      {
        "paragraph": "“Shaun, I suspect that it’s not the executive council that’s targeting you. Someone might have told them\nto do it, and that force is one that the executive council can’t afford to offend. I think it’s imperative that\nyou find out who you offended first. Only then will you be able to come up with a solution, ” Nathan\nreminded him."
      },
      {
        "paragraph": "“I understand.” Shaun nodded."
      },
      {
        "paragraph": "Rodney was stunned. “That can’t be. Shaun does have a lot of enemies, but they’re third-rate trash like\nMason and Wesley. How did he provoke someone who even the highest power in the country can’t"
      },
      {
        "paragraph": "afford to offend?”"
      },
      {
        "paragraph": "“You don’t know, but there are always more powerful people in the world, ” Nathan said meaningfully."
      },
      {
        "paragraph": "After leaving the Snow residence."
      },
      {
        "paragraph": "Shaun and Rodney were walking side by side. Catherine and Freya walked behind them."
      },
      {
        "paragraph": "“Cathy, don’t worry. There’ll definitely be a way.” Freya did not know how to comfort Catherine, but she\nsaid it anyway."
      },
      {
        "paragraph": "“There is a way, but Freya, I need your help, ” Catherine suddenly said, “ It may be the only way to get\na clue on who this person is.”"
      }
    ]
  },
  {
    "title": "Chapter 1495 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Me?”"
      },
      {
        "paragraph": "Freya was a little stunned. “Are you sure?”"
      },
      {
        "paragraph": "“Actually, I suspect that the people who rescued Patrick from prison and the people who are targeting\nHill Corporation are the same,” Catherine said with a complicated tone, “ It’s too much of a coincidence.\nBoth events happened at the same time and the orders came from the executive council.”"
      },
      {
        "paragraph": "“You mean… because I offended Patrick, those people are targeting Hill Corporation as you’re my\nfriend and Shaun is your boyfriend?”"
      },
      {
        "paragraph": "“No, I suspect that it’s Linda.”"
      },
      {
        "paragraph": "Catherine made a guess. “We know very well about the Jackson family’s ability, especially after seeing\nthe look on the faces of Patrick’s parents. They were really powerless and even gave up on saving their\nson, but he was suddenly released. It’s definitely thanks to someone close to him and who wanted to\nsave him, so it’s very likely to be Linda.”"
      },
      {
        "paragraph": "“Linda?” Freya was astonished. “Is she that capable? As far as I know, Linda has been overwhelmed\nthese days. The Shelby family is going bankrupt.”"
      },
      {
        "paragraph": "“Have you forgotten what happened three years ago?” Catherine reminded her. “When I asked you to\ngo to Melbourne to do the DNA test for Shelley Neeson and Jeffery Jones, you were seen by Linda and\nRebecca took the opportunity to flee.”"
      },
      {
        "paragraph": "Freya’s brain flashed. “You mean that Rebecca is helping Linda?”"
      },
      {
        "paragraph": "“When my mom’s grave was destroyed, I received a warning letter from Rebecca. She may have found\na new force to back her abroad. It seems she’s sure that she can bring me down, ” Catherine said with\ndeep concern, “Even Jeffery and his wife easily got out of prison. Logan and Austin were attacked as\nwell.”"
      },
      {
        "paragraph": "Freya found it a little difficult to accept that fact. “S o you think that the force behind Rebecca can give\norders to the people in the executive council?”"
      },
      {
        "paragraph": "“I don’t want it to be true either, ” Catherine said with a heavy expression."
      },
      {
        "paragraph": "“If it’s true, then Rebecca definitely came back for revenge. It’s impossible for a vicious person like her\nto let us go.” Freya gnashed her teeth in annoyance. “It’s so unfair. Why hasn’t God given her\nretribution yet?”"
      },
      {
        "paragraph": "“You have the protection of the Snow family, so you should be fine, ” Catherine comforted her.\n“Besides, I’m the one she’s after. I think that if the person behind this really is her, when Hill\nCorporation falls, her next target will be Hudson Corporation. ”"
      },
      {
        "paragraph": "“Why isn’t she going after you first?”"
      },
      {
        "paragraph": "“Because I’m Hudson Corporation’s only shareholder and all the power is in my hands, so it won’t be\neasy for them to start with me. On the other hand, Shaun is supporting me. If they get rid of my\nsupporter, it’ll be easier to deal with me afterward, ” Catherine explained faintly."
      },
      {
        "paragraph": "Freya admired her more and more."
      },
      {
        "paragraph": "She had to say that after experiencing so many things, Catherine had become increasingly calm."
      },
      {
        "paragraph": "“ I want to help you… Do you want me to start with Patrick?” Freya thought about it for a long time and\nfinally seemed to understand."
      },
      {
        "paragraph": "Catherine nodded. “Shaun and I are in the light, but the person behind the scenes is in the dark. We\nknow nothing about that force. I think that the other party’s power isn’t small, so it’s impossible to go\nagainst them headfirst. We can only ferret out the culprit and sit down to have a talk about it. I think that\nRebecca probably just hooked up with a powerful man abroad. A person like that definitely won’t be\nmuddled by love, so it’s possible to solve this if we offer him some benefits.”"
      },
      {
        "paragraph": "Freya had a headache now. “So what should I do with Patrick?”"
      },
      {
        "paragraph": "“I think he still has feelings for you.” Catherine looked at her with a slightly helpless and apologetic\nexpression. “ If there are feelings, there’ll be guilt.”"
      },
      {
        "paragraph": "Freya laughed and held her bulging belly. “I’m married now and pregnant too. Don’t forget, when he\nuploaded the video, he was basically trying to kill me.”"
      }
    ]
  },
  {
    "title": "Chapter 1496 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Actually, I think it was Linda who incited him.”"
      },
      {
        "paragraph": "Catherine said, “We’ve known Patrick for a long time. He’s actually a little similar to Ethan, but he’s not\nas despicable as Ethan when it comes to the business world. Every step he takes is genuine, and he\nhas never thought about taking shortcuts. To put it bluntly, he’s just indecisive when it comes to\nrelationships. He’s naive and easily cheated by innocent-looking but calculative women.”"
      },
      {
        "paragraph": "Freya was silent. She agreed with Catherine on that point."
      },
      {
        "paragraph": "“Look, didn’t Ethan come to his senses later?” Catherine continued."
      },
      {
        "paragraph": "“That’s because what Rebecca loved wasn’t Ethan himself. What she loved were his bright prospects.\nWhen Ethan was left with nothing, she wanted nothing more than to get rid of him. But Linda… truly\nloves Patrick.” Freya suddenly lowered her voice. “If she didn’t love him, she would’ve given up on him\nalready. I think… now that Patrick has been released, he’ll be even more grateful to Linda.”"
      },
      {
        "paragraph": "“You’ve forgotten something. Wasn’t there an anonymous post that discredited your godfather and the\npolice tracked it to Jackson Corporation? If i t wasn’t Patrick who did it, then it must be Linda. Patrick\nwas locked up in prison for more than a month, so he must have thought about the ins and outs of this\nmatter clearly. He’s not a fool, ” Catherine reminded her meaningfully."
      },
      {
        "paragraph": "Freya’s eyes brightened as she clicked her tongue. “ Cathy, I realize that you’re becoming more and\nmore clever.”"
      },
      {
        "paragraph": "“If I didn’t toughen up, I would’ve been devoured alive a long time ago. After facing people like Wesley,\nmy mind has advanced by leaps and bounds.” Catherine let out a low sigh."
      },
      {
        "paragraph": "“Okay, I’ll help you.” Freya patted her shoulder."
      },
      {
        "paragraph": "“You’d better tell Rodney about it. He’s a man, so he’ll want to keep up appearances, ” Catherine said."
      },
      {
        "paragraph": "“He doesn’t like me anyway. He won’t care.” Freya looked indifferent."
      },
      {
        "paragraph": "Catherine looked at her appearance and was a little speechless."
      },
      {
        "paragraph": "Freya’s thoughts were always so simple."
      },
      {
        "paragraph": "They arrived at the gate to see that Rodney and Shaun were waiting for them."
      },
      {
        "paragraph": "“What are you two talking about? You talk more than men.” Rodney frowned at them."
      },
      {
        "paragraph": "“Don’t women always talk more than men?” Catherine patted Freya’s shoulder, nodded at her, and left\nwith Shaun."
      },
      {
        "paragraph": "Freya looked at their backs thoughtfully."
      },
      {
        "paragraph": "“What are you thinking about? Let’s go back.” Rodney pulled her hand and went next door."
      },
      {
        "paragraph": "After their marriage, the mansion the Snow family gave them was just around the corner. It was a five\nto six-minute walk away."
      },
      {
        "paragraph": "Freya was distracted and only noticed that he was holding her hand when they reached the door of the\nvilla. She immediately shook off his hand. “Rodney Snow, don’t try to take advantage of me.”"
      },
      {
        "paragraph": "“ I’m doing this because you’re pregnant and I’m afraid you’ll fall. Don’t be insensitive.” Rodney was a\nlittle sullen. He was thinking about Hill Corporation. How would he be in the mood to take advantage of\nher? He had only subconsciously taken her hand."
      },
      {
        "paragraph": "“It’s not like I’m too big-bellied to walk. Besides, even if I’m ten months pregnant, I don’t need your\nhelp.” Freya let out a haughty snort and walked into the house."
      }
    ]
  },

  {
    "title": "Chapter 1497 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rodney’s handsome face immediately turned dark."
      },
      {
        "paragraph": "“By the way, ” Freya suddenly looked back as an odd look flashed on her beautiful face. “Well… I might\nbe seeing Patrick often in the coming days.”"
      },
      {
        "paragraph": "Rodney froze and blew up after a few seconds. “ Freya Lynch, are you insane? You’re still going to him\neven after what he did to you? Are you that unwilling to move on from him? Are you that foolish?”"
      },
      {
        "paragraph": "“I’m less of a fool than you are.”"
      },
      {
        "paragraph": "Freya originally wanted to have a proper talk with him, but his unpleasant words had made her angry."
      },
      {
        "paragraph": "“I’ve already turned over a new leaf, but you’re the one who wants to meet him while carrying my child.\nDon’t even think about it,” Rodney said angrily, “You’d better know your place and don’t embarrass the\nSnow family. Did you forget how you were slapped back then? Wake up.”"
      },
      {
        "paragraph": "“I know all that. Don’t talk as if I’m that kind of person. I’m different from you. I want to meet him\nbecause I want to find out who saved him. Cathy said that the person who saved Patrick might be the\nsame person who’s targeting Hill Corporation, and that person is Rebecca.”"
      },
      {
        "paragraph": "“Rebecca?” Rodney froze. Why did that name come up again?"
      },
      {
        "paragraph": "“Yes, the woman who impersonated Shelley and duped the three of you idiots three years ago."
      },
      {
        "paragraph": "Rebeca escaped back then and is back for revenge, ” Freya snapped bluntly."
      },
      {
        "paragraph": "Rodney, who was called an idiot, said, “… Can you blame me for that? When the DNA test was done,\nthe deceased was really Shelley.”"
      },
      {
        "paragraph": "“Right, the person who kicked up the biggest fuss was you. You just brainlessly defended anyone\nrelated to Sarah.”"
      },
      {
        "paragraph": "Freya took a deep breath. “Also, I’m just informing you about this. I’m not asking for your permission.”"
      },
      {
        "paragraph": "Rodney’s blood pressure immediately shot up. “It was Catherine who told you to go, wasn’t it? She’s\nsuch a scheming woman.”"
      },
      {
        "paragraph": "“It’s not just for Catherine, it’s also because of Linda, ” Freya interrupted him. “If I don’t get rid of Linda,\nI’ll never be able to face Charity in the other world. I’ll never let her have the opportunity to rise to\npower like Rebecca has.”"
      },
      {
        "paragraph": "Then, she said nothing more and went upstairs. Rodney looked at her decisive figure."
      },
      {
        "paragraph": "He was a little dazed and sullen. She wanted to approach Patrick because she wanted to deal with\nLinda?"
      },
      {
        "paragraph": "For some reason, his heart felt very uncomfortable. It was as if he was being cheated on."
      },
      {
        "paragraph": "He thought about it before following her. Since he was upset, he did not think about his actions and\nslammed open the bedroom door. “Freya, I’m telling you…”"
      },
      {
        "paragraph": "His words were suddenly stuck in his throat."
      },
      {
        "paragraph": "In the bright bedroom, Freya was bending over and taking off her dress."
      },
      {
        "paragraph": "For the first time, he saw her five-month pregnant figure clearly."
      },
      {
        "paragraph": "She had taken care of herself very well. Except for her big belly, her legs were still slender and\nbeautiful—especially the sexiest spot above…"
      },
      {
        "paragraph": "Freya turned around and saw the man who suddenly broke in. She screamed in surprise. Her dress\nwas by her feet, and when she saw him, she"
      },
      {
        "paragraph": "subconsciously tried to hide. However, as soon as she moved, she tripped over her dress and was\nabout to fall to the floor."
      },
      {
        "paragraph": "“Watch out!”"
      },
      {
        "paragraph": "Rodney was so startled his soul almost left his body. He rushed over to hold her. He hesitated and did\nnot dare to press on her belly, so he had no choice but to press his arm on her chest."
      },
      {
        "paragraph": "The soft feeling made Rodney feel a buzz in his brain, and something hot flowed from his nose."
      },
      {
        "paragraph": "“Rodney… ” Freya looked at the hand on her chest and blushed with shame, wanting nothing more\nthan to dig a hole and bury herself in it. She looked up with anger and embarrassment but froze when\nshe saw Rodney having a nosebleed."
      },
      {
        "paragraph": "“You… Why is your nose bleeding?”"
      },
      {
        "paragraph": "It was fine if she had not turned her head, but once she did, Rodney saw her even more clearly. His\nnosebleed became worse."
      },
      {
        "paragraph": "After living for 30 years, this was the first time he had been so humiliated. It even happened in front of\nFreya."
      },
      {
        "paragraph": "“I have sinusitis. You have a problem with that?” After Rodney roared with a blush, he carried her to the\nbed and covered her body with the blanket. ” You’d better watch yourself. Your belly is so big. If you fall,\nit’ll result in the loss of two lives instead of one.”"
      }
    ]
  },
  {
    "title": "Chapter 1498 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Then, Rodney hurried away. His figure looked like he was fleeing."
      },
      {
        "paragraph": "Freya stared and finally reacted. Sinusitis?"
      },
      {
        "paragraph": "Did he think she was stupid?"
      },
      {
        "paragraph": "Did he get a nosebleed from being too excited after seeing her?"
      },
      {
        "paragraph": "She was originally a little embarrassed, but she suddenly found it interesting."
      },
      {
        "paragraph": "Was there a need for such an exaggerated reaction? It was not like he had never seen a woman\nbefore. He made it seem as though he had never seen a woman’s bare flesh in his life. Tsk, his fire\nburned quite strongly."
      },
      {
        "paragraph": "After changing into loose loungewear, Freya put on a gloating face."
      },
      {
        "paragraph": "She knocked on the door of the next room. “Hey, Rodney, have you died of blood loss?”"
      },
      {
        "paragraph": "Barn!"
      },
      {
        "paragraph": "The door was suddenly opened, and Rodney appeared after changing into a mint-green shirt. The\nrefreshing color made him more pretty and charming, like a complete lady killer."
      },
      {
        "paragraph": "Although Freya thought the colors this man wore were too over-the -top, she had to admit that the\nbright colors of his clothes made him look like a teen idol."
      },
      {
        "paragraph": "However… Wait, why did he change his clothes? He even changed his pants, and his hair was covered\nwith water droplets."
      },
      {
        "paragraph": "Her gaze immediately became ambiguous and strange. “You took a shower in broad daylight?”"
      },
      {
        "paragraph": "Rodney’s handsome face stiffened. “The blood got on my clothes, so I might as well take a shower.”"
      },
      {
        "paragraph": "“Oh, I thought you got a nosebleed because you couldn’t hold back after seeing my enchanting figure.\nAnd then you couldn’t control yourself and had to take a cold shower to put out the flames in your\nbody.” Freya raised her brows with a vague smile."
      },
      {
        "paragraph": "Rodney’s stiff face immediately seemed to freeze."
      },
      {
        "paragraph": "He was mortified. Did this woman install a camera in his bathroom?"
      },
      {
        "paragraph": "She hit the nail on the head. However, he had his ego."
      },
      {
        "paragraph": "“Freya Lynch, have some shame.” Rodney gnashed his teeth and said, “You’re a pregnant woman yet\nyou didn’t even hesitate to say that your body is enchanting. How shameless are you?”"
      },
      {
        "paragraph": "“Hah. If I wasn’t enchanting, why did you get a nosebleed from seeing me?” Freya retorted."
      },
      {
        "paragraph": "“I told you I have sinusitis.” Rodney refused to admit it."
      },
      {
        "paragraph": "“Really?”"
      },
      {
        "paragraph": "“Absolutely.” He scoffed."
      },
      {
        "paragraph": "“Okay then, I thought that it was because you saw me… ” Freya said faintly. “That’s good. I was really\nafraid that my guess was right. After all, if you really did solve your problem with a cold shower, you\nwere too quick.”"
      },
      {
        "paragraph": "Rodney, “….”"
      },
      {
        "paragraph": "What did that mean?"
      },
      {
        "paragraph": "Did he understand that correctly?"
      },
      {
        "paragraph": "Rodney was completely miffed as if he had suffered a massive blow."
      },
      {
        "paragraph": "“Shouldn’t you know very well what I’m like? Where do you think the child in your belly came from?”\nRodney could hold back his yell."
      },
      {
        "paragraph": "“How would I know? I wasn’t conscious that day, so I have no memory.” Freya smiled. “Don’t get\nworked up. I’m not trying to mock you.”"
      }
    ]
  },
  {
    "title": "Chapter 1499 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rodney sneered."
      },
      {
        "paragraph": "She was not trying to mock him? It was clearly an undisguised personal attack."
      },
      {
        "paragraph": "“Freya Lynch, you’re mocking my masculinity. I’ll prove it to you right now.” Rodney pressed one hand\non her shoulder and slammed the other on the wall."
      },
      {
        "paragraph": "The man’s body was much taller than her."
      },
      {
        "paragraph": "Although he was not a bulky man, it still made her tense and she found it a little difficult to breathe\nwhen his aura pressed down on her. Furthermore, he had just showered, so there was a faint fragrance\non his skin."
      },
      {
        "paragraph": "However, Freya refused to admit defeat. She looked up as her eyes curved into a smile. “Are you sure\nyou want to prove yourself to a woman who’s five months pregnant? If I resist, won’t it cause two\ndeaths instead of one?”"
      },
      {
        "paragraph": "Rodney, who had summoned up his courage after a lot of difficulties, instantly deflated like a balloon."
      },
      {
        "paragraph": "“Freya, you’re really cruel. Just you wait. I’ll settle the score with you sooner or later.” Rodney could\nonly hold back and snort."
      },
      {
        "paragraph": "Freya clicked her tongue. “With my skills, I’ll be able to take you down within a minute.”"
      },
      {
        "paragraph": "Rodney, “…”"
      },
      {
        "paragraph": "He glared at her angrily."
      },
      {
        "paragraph": "He wanted nothing more than to eat her up."
      },
      {
        "paragraph": "He swore on his name that one day, he would press her on the bed and devour her."
      },
      {
        "paragraph": "One day, he would make her sing out her surrender."
      },
      {
        "paragraph": "“Move.” Freya pushed him and said seriously, “ Rodney, we both know whether you really have\nsinusitis. You’re at the age where your urges are strongest. If you want to find a woman outside, I won’t\nstop you, but don’t hold back until you cause problems for yourself.”"
      },
      {
        "paragraph": "Rodney looked at her expression and saw that she was not joking. He felt a little uncomfortable. “\nFreya, what kind of person do you take me for? Do you think I’m Chester?”"
      },
      {
        "paragraph": "“Is it a good idea to drag your friend into this?” Freya was slightly speechless. “In the past, you used to\nkeep your body chaste for Sarah, but there’s no need to continue doing so now.”"
      },
      {
        "paragraph": "“If I were to go out and fool around, my parents would throw me out of the house.”"
      },
      {
        "paragraph": "“Then you can go in secret. It’s fine as long as they don’t find out.” Freya thought about it and said, “ I\nwon’t snitch on you.”"
      },
      {
        "paragraph": "“You’re such a kind person,” Rodney said mockingly, “You should have married Chester instead. One\nlikes to fool around with women, and the other allows her husband to do so. Isn’t it a match made in\nheaven?”"
      },
      {
        "paragraph": "Freya became annoyed. “Do you think I want this? We didn’t marry because of love. If I were married\nto a man I like, I’d break his legs even if all he did was have a meal with another woman behind my\nback.”"
      },
      {
        "paragraph": "Rodney felt complicated. In fact, he also wanted a marriage like that."
      },
      {
        "paragraph": "It was fine if his wife was strict. It was better than not being allowed to touch or care about her."
      },
      {
        "paragraph": "“You can treat me like that too,” he suddenly said. “Huh?” Freya was stunned. “But… I don’t like you.”\n“Feelings can grow.”"
      },
      {
        "paragraph": "Rodney frowned. “You told me to go find a woman, but I can’t do it. If I were such a casual man while\nbeing friends with people like Chester, I’d have become a playboy already. I just can’t do it. Even when\nI was with Sarah, I never touched her before.”"
      },
      {
        "paragraph": "“Is it because… Sarah was too arrogant? She looked down on you, so she didn’t let you touch her.”\nFreya asked blankly."
      },
      {
        "paragraph": "“Freya Lynch, are you trying to make me die from anger?” Rodney’s temper surged. “When we were\ntogether, she tried to stay the night with me but I refused. I’m… a conservative person, okay?”"
      }
    ]
  }
]