[
  {
    "title": "Chapter 1950 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "As soon as the car was parked, Rodney scrambled over."
      },
      {
        "paragraph": "He was so worried that he did not sleep the entire night. With his unshaven face, he looked very\ndisheveled."
      },
      {
        "paragraph": "“Freya, you’re here…”"
      },
      {
        "paragraph": "He walked up to her and watched her get out of the car. Dressed in a pink hoodie and a pair of jeans\ncovering her legs, she looked like a college student rather than a mother who had just given birth to a\nchild."
      },
      {
        "paragraph": "He hurried over and extended his hands to hold Freya, but she promptly dodged him."
      },
      {
        "paragraph": "Desperate, he wanted to hug her by force. However, a strong hand stretched out and stopped him."
      },
      {
        "paragraph": "“Rodney, Freya is here to talk about her divorce.” Ryan stared at Rodney gently, but his eyes carried a\nhint of warning."
      },
      {
        "paragraph": "The second Rodney heard the word ‘divorce’, he glanced at Ryan, who was standing in front of Freya.\nThe two of them were around the same age. One was pretty, and the other was handsome."
      },
      {
        "paragraph": "The scene was an eyesore to him, and it made him boil with anger."
      },
      {
        "paragraph": "“Ryan Snow, go away.”"
      },
      {
        "paragraph": "He moved Ryan’s hand away and said furiously, “ Did you instigate Freya to divorce me behind my\nback? You’re such a scheming man. You’re trying to coax us into getting a divorce so that you can be"
      },
      {
        "paragraph": "with her, right? Dream on. The Snow family won’t allow two brothers to marry the same woman. You\ncan forget it.”"
      },
      {
        "paragraph": "Ryan’s handsome face gave nothing away, as if Rodney was not referring to him."
      },
      {
        "paragraph": "On the other hand, Freya and Heidi, who just got off, froze for a moment."
      },
      {
        "paragraph": "Subsequently, Freya criticized Rodney angrily, “Are you out of your mind? Me wanting to divorce you\nhas nothing to do with Ryan at all.”"
      },
      {
        "paragraph": "“Freya, you’re too naive. He’s interested in you and has long been eyeing you, ” Rodney said with\nexasperation as he pointed at Ryan."
      },
      {
        "paragraph": "Heidi furrowed her brows before looking at her son. Even Freya’s mind momentarily went blank."
      },
      {
        "paragraph": "Ryan was interested in her? How could that be?"
      },
      {
        "paragraph": "However, Ryan’s gentle face remained calm. “Mom, you know that Freya had a premature delivery\nbecause she was mad at him. At that time, I couldn’t put up with the situation any longer. But since they\nalready had Dani, I couldn’t  bear to see"
      },
      {
        "paragraph": "the child come into this world to divorced parents. So, I deliberately provoked Rodney in private, telling\nhim that I was interested in Freya. I told him that if he didn’t cherish Freya, I’d take her away from him.\nIt’s most probably because of my provocative remarks that made him notice that he has feelings for\nFreya, so they got back together shortly after that.”"
      },
      {
        "paragraph": "Heidi grasped the point, but Rodney was in a daze for a moment before he snorted. “Don’t try to fool\nme.”"
      },
      {
        "paragraph": "“At that time, I sincerely hoped that you would come to your senses and cherish her, Rodney.” Ryan\nshrugged helplessly. “Look. If I hadn’t provoked you, you wouldn’t have realized that you’re concerned\nabout Freya. You’re afraid that someone will snatch her away.”"
      },
      {
        "paragraph": "“He’s not afraid that someone will snatch me away."
      },
      {
        "paragraph": "He just wants to save his dignity, considering his identity as my husband.”"
      },
      {
        "paragraph": "Freya disagreed with Ryan’s view. “Because Sarah has made him lose his dignity once, he now cares\nabout his dignity more than anyone else.”"
      },
      {
        "paragraph": "“Freya, I really care about you…” Seeing Freya’s indifferent expression, Rodney was at his wits’ end.\n“Can’t you feel my love for you recently?”"
      },
      {
        "paragraph": "“Do you mean when you lied to me that you were talking business with Mr. Micheal the whole night\nwhen, in fact, you were with Sarah? Or when you lied to me halfway through the movie that your office\nwas on fire and left me alone for Sarah?” Freya smiled discreetly."
      },
      {
        "paragraph": "Rodney’s face was red with shame. “That was because…”"
      }
    ]
  },
  {
    "title": "Chapter 1951 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Fine. You don’t have to explain further.” Freya looked at Rodney. “Rodney, if you explain again, I’ll find\nyou even more disgusting. Unfortunately, you have no self-awareness at all.”"
      },
      {
        "paragraph": "Her eyes made no pretense of the hatred she felt. This time, Rodney was indeed hurt."
      },
      {
        "paragraph": "She hated him?"
      },
      {
        "paragraph": "Why did she hate him?"
      },
      {
        "paragraph": "Did they have to end up like this?"
      },
      {
        "paragraph": "“Let’s go in.” Heidi’s head hurt listening to their argument. Anyway, she knew that it was no use\ncommunicating with Rodney. Hence, she walked directly into the living room."
      },
      {
        "paragraph": "It was early in the morning, but everyone in the Snow family was there."
      },
      {
        "paragraph": "Since Freya was determined to divorce Rodney, she would not treat the elders of the Snow family as\ncautiously as she did before."
      },
      {
        "paragraph": "She placed the divorce papers on the table right away."
      },
      {
        "paragraph": "Old Master Snow’s expression turned ghastly while Wendy leaped to her feet anxiously. “Freya— ”"
      },
      {
        "paragraph": "“Mom,” Freya interrupted her. “This might be the last time I’m calling you Mom. I’m thankful for the\nSnow family’s care all this while, but sadly, I can’t be your daughter-in-law anymore. I came here today\nto officially tell you that I’ve decided to divorce Rodney. I hope you can advise him, and please, don’t\nstop me.”"
      },
      {
        "paragraph": "She sounded determined."
      },
      {
        "paragraph": "Wendy’s words got stuck in her throat."
      },
      {
        "paragraph": "Jason said sadly, “Freya,  this issue is Rodney’s fault. We’ll teach him a harsh lesson. How about this?\nWe’ll keep an eye on him and make sure he doesn’t see Sarah anymore.”"
      },
      {
        "paragraph": "“Dad, you don’t need to keep an eye on me. I’m not going there anymore.” Rodney’s handsome face\nturned pale. He did not expect things to work out this way either."
      },
      {
        "paragraph": "“Freya, he still has feelings for you. He might be soft-hearted, but nothing has happened between him\nand Sarah. I’ve asked him about it before. If he had wronged you, I would’ve kicked him out without\nhesitating, ” Old Master Snow said seriously."
      },
      {
        "paragraph": "Deep down, Freya sighed at how scheming Old Master Snow was. He might sound like he was siding\nwith her, but she knew that he would not kick Rodney out so easily at this point."
      },
      {
        "paragraph": "In fact, he was just trying to sound nice."
      },
      {
        "paragraph": "“Yeah, Freya. Divorce is always bad for a woman’s reputation. Besides, Dani is reliant on her dad."
      },
      {
        "paragraph": "When you took her back to Melbourne previously, she always cried for her parents’ cuddles, ” Wendy\nadvised earnestly."
      },
      {
        "paragraph": "“Dani might not be able to get used to it at first, but she’ll be okay as time passes.”"
      },
      {
        "paragraph": "Freya was not swayed at all. “Regardless of what you guys say, I have made up my mind. I don’t mind\nlosing everything. All I want is the child’s custody.”"
      },
      {
        "paragraph": "“But why on earth must you get a divorce?” Rodney was exasperated, his bloodshot eyes filled with\nanxiety. “Do you want to leave me so badly? If you had caught me in bed with someone else, I"
      },
      {
        "paragraph": "would’ve admitted it right away. But I didn’t do anything.”"
      },
      {
        "paragraph": "Freya sniggered coldly. “It’s because that woman is none other than Sarah. Perhaps I wouldn’t be so\ndetermined if you took care of another woman out of guilt. I don’t care if you find Sarah to be a sad\nwoman. I’m sorry, but I wish I could skin her alive. If the law permits, I even wish to stab her to death.”"
      },
      {
        "paragraph": "Rodney was astounded. He could feel the resentment in her gaze. “Well…”"
      },
      {
        "paragraph": "“ If you sympathize with her, that’s your business. My hatred for her is my own, and I hate those who\nside with her as well. Do you get it?”"
      }
    ]
  },
  {
    "title": "Chapter 1952 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Do you have to take it that far?”"
      },
      {
        "paragraph": "Freya’s gaze made Rodney go insane. “You hate me just because I’m helping Sarah out. Please, I’m\nyour husband,” Rodney roared."
      },
      {
        "paragraph": "He was unsure if he was shouting because of his disappointment in her or that he could not accept the\nsituation. All it took was a few days for their relationship to fall apart."
      },
      {
        "paragraph": "“Stop it.” Freya’s eyes mocked him.  “When  I caught Sarah in the apartment the day before yesterday,\nthat was the last chance I gave you, but you didn’t cherish it. Instead, you hugged Sarah and criticized\nme. From that moment onward, our relationship has come to an end.”"
      },
      {
        "paragraph": "Rodney froze."
      },
      {
        "paragraph": "Did it mean that she had already decided to get a divorce that day?"
      },
      {
        "paragraph": "He was so foolish to think that she was just angry for a while."
      },
      {
        "paragraph": "“ Is there a need to act like this?” he muttered. He seemed as though he could not resign himself to the\ntruth, yet he was throwing piercing remarks."
      },
      {
        "paragraph": "“Shut up, ” Old Master Snow shouted  at Rodney as he flew into a fury. Was Rodney unaware  of how\nmany silly things he had done?"
      },
      {
        "paragraph": "After Old Master Snow finished speaking, he turned to look at Freya. “Freya, now that you’ve planned\nto divorce him, we won’t force you to stay with him. But let me remind you that I’ve allocated ten\npercent of the Snow Corporation’s shares for Dani after she was born. What’s more, she’s the only\ngrandchild in the Snow family. We have to keep her i n the Snow family.”"
      },
      {
        "paragraph": "Freya’s heart sank. Ultimately, the thing she feared most still happened.“ I have to take Dani away, but I\ncan give you back the shares. Grandpa, I was pregnant with Dani for nine months before I gave birth to\nher. I can’t leave her to Rodney. If he marries Sarah in the future, the wicked woman will never treat\nDani well. You guys can’t guard against her either. Perhaps Grandpa and Grandma can take care of\nDani, but she can’t leave me as I’m her biological mother. Besides, she still needs breast milk,\nconsidering that she’s so young.”"
      },
      {
        "paragraph": "Rodney opened his mouth and wanted to say that Sarah was not that wicked. However, at the thought\nof his tense relationship with Freya, he held back."
      },
      {
        "paragraph": "He was no fool. He could tell that his grandfather was trying to use the child as a pretext of making\nFreya stay."
      },
      {
        "paragraph": "Old Master Snow said nonchalantly, “I will never allow Sarah to join the Snow family.”"
      },
      {
        "paragraph": "Freya laughed and refuted decently, “You’ve warned Rodney not to be with Sarah, but is he listening to\nyou?”"
      },
      {
        "paragraph": "Old Master Snow was stung by her words, and his face turned grimmer. “Freya, you just have to talk\nback to me, huh? Can’t you trust me once more?”"
      },
      {
        "paragraph": "“Grandpa, Sarah and her brother have tortured me very badly in the past few years. Her brother\nattempted to rape  me, hit me, humiliate  me. Later, I got pregnant and was forced to get engaged with\nRodney in the end. Even then, Rodney continued to be with Sarah, which made me a laughing stock."
      },
      {
        "paragraph": "After that, I was forced to marry Rodney. I really don’t want Sarah to be in my life anymore. She has\ngiven me trauma, and I guess you guys feel the same. I’m no match for her.”"
      },
      {
        "paragraph": "Freya said frankly, “I can’t force Rodney to stay as well. Now that the Snow family’s situation is stable,\nI’m tired. I can’t hold on anymore. You guys don’t"
      },
      {
        "paragraph": "wish to see me fail to suppress my hatred and stab Rodney to death when I wake up one day, do you?”"
      },
      {
        "paragraph": "Once she finished speaking, she began laughing like a lunatic, and her eyes reddened."
      },
      {
        "paragraph": "Rodney shuddered. “Freya, stop laughing like this. Why do you want to stab me? Don’t you have\nfeelings for me? We had such a sweet life before this. Have you forgotten it?”"
      },
      {
        "paragraph": "“Oh. That has become my biggest regret, ” Freya said indifferently."
      },
      {
        "paragraph": "“You… ” Rodney was so furious that his eyes turned red. He dashed toward Freya to grab her\nshoulders so that he could shake her to wake her up."
      },
      {
        "paragraph": "However, Ryan stopped him and reminded, “Can’t you see that she has already made up her mind?"
      },
      {
        "paragraph": "Otherwise, my mom and I wouldn’t have come here. It’s useless to persuade her. You might as well talk\nabout the divorce.”"
      }
    ]
  },
  {
    "title": "Chapter 1953 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“I won’t approve the divorce unless I’m dead.” Rodney kicked the table in front of him and glowered at\nFreya. Then, he turned around and rushed out."
      },
      {
        "paragraph": "The Snows fell silent. After some time, Wendy said arduously, “Now that Rodney has left, let’s talk \nabout your wedding some other day…”"
      },
      {
        "paragraph": "“I don’t want to drag this further, ” Freya said indifferently. “Just decide whether you agree on our\ndivorce now. If you do, please advise Rodney. I’m tired of such a life.”"
      },
      {
        "paragraph": "Old Master Snow’s face was grim."
      },
      {
        "paragraph": "If they agreed to it, what would happen if Rodney, that b*stard, really does marry Sarah into the family?"
      },
      {
        "paragraph": "If they did not agree with it, Freya might go mad and kill Rodney one day, which would cause a lot of\nproblems."
      },
      {
        "paragraph": "At this moment, Heidi said, “Dad, I’ve discussed this with Nathan. Our grandchildren will have their own\nlives. Now that the Snow family is stable, we can’t be so inconsiderate toward Freya. After all, she has\nsacrificed a lot for the Snow family. We all know that Sarah should not be taken lightly, but there is\nnothing you guys can do to her either."
      },
      {
        "paragraph": "What’s going to happen if we force Freya to deal with Sarah and drive her to depression?"
      },
      {
        "paragraph": "“Furthermore, even if they get a divorce, Freya is still my goddaughter. I’ve discussed this with her.\nAfter the divorce, she can move into The Lodge."
      },
      {
        "paragraph": "Whenever you guys miss Dani, she can come over for a visit or stay anytime. To speak frankly, she’ll\nstill be under the Snow family’s watch.”"
      },
      {
        "paragraph": "Heidi went quiet for a moment and turned solemn. “ What’s more, I’m  asking this since Rodney  isn’t\nhere. Will Sarah leave? I  think you guys won’t believe it either. If Rodney becomes so muddle- headed\nthat he marries her, don’t you think it’s terrifying? She has killed several people without leaving any\nevidence behind. To be safe, Dani should stay away from Rodney.”"
      },
      {
        "paragraph": "Heidi was no doubt the prime minister’s wife, considering that she could speak so straightforwardly."
      },
      {
        "paragraph": "After a while, Old Master Snow let out a long sigh. “ Fine. I’m not going to stop you. Wendy, Jason, go"
      },
      {
        "paragraph": "and talk Rodney into getting a divorce. Since he can’t get over Sarah, he should stop pestering Freya.”"
      },
      {
        "paragraph": "“Alright. ” Wendy’s face fell. She could not bear to lose Freya, who was such a great daughter-in-law."
      },
      {
        "paragraph": "At the same time, it annoyed her that Sarah would marry into the family."
      },
      {
        "paragraph": "“Freya, although we agree on your divorce, you have to bring Dani here more often.” Wendy held Freya\nas she said, “Our relationship is doomed to be short. Rodney isn’t blessed enough to be with you. ”"
      },
      {
        "paragraph": "“Don’t worry, Aunty Wendy. Whenever you miss Dani, you can take her to the Snow family. Given that\nyou guys are her grandparents. I hope she’ll be close to you.”"
      },
      {
        "paragraph": "Freya spoke eloquently. Despite the bitter row earlier, she did not wish to offend the Snow family."
      },
      {
        "paragraph": "As soon as Freya left the Snow family’s residence, she felt utterly relieved."
      },
      {
        "paragraph": "She leaned on the chair with a relaxed smile on her face."
      },
      {
        "paragraph": "As she gazed out of the window, her dark eyes seemed to light up."
      },
      {
        "paragraph": "Ryan observed her curiously. “Aren’t you sad? After all, you’ve spent quite a long time with Rodney. ” “I\nwould be sad if Sarah hadn’t appeared. ” Freya shrugged. “But now, all I feel about this marriage is\nrage. I even feel like a fool.”"
      }
    ]
  },
  {
    "title": "Chapter 1954 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Ryan thought to himself that Freya must hate Sarah very much."
      },
      {
        "paragraph": "How much did Sarah hurt her?"
      },
      {
        "paragraph": "“So… did you actually like Rodney?” Ryan suddenly asked, his cool eyes sparkling with anticipation."
      },
      {
        "paragraph": "“There was a time when he treated Dani and me well, and it was quite romantic. Besides, with his\nhandsome looks, I definitely had feelings for him. At that time, I really did think about spending  the rest\nof my life with him. In fact, I could choose  to put up with him and be more strict with him to"
      },
      {
        "paragraph": "keep this marriage, but I don’t want to.”"
      },
      {
        "paragraph": "Freya pointed at her chest. “There’s a scar here. Even if Sarah really does leave, I’ll be reminded of\nhow much effort I need to put in to keep such a man. Compared to Sarah, I’ll always pale into\ninsignificance, which is why I gave up our relationship.”"
      },
      {
        "paragraph": "Her nose turned sour, and she looked out of the window. “There’s a deep scar in my heart, and I’ve\ntried to remove it. But Sarah would always show up"
      },
      {
        "paragraph": "and stab it. I don’t want to live in the darkness anymore. Rodney doesn’t understand, but I don’t plan on\nwaiting until he does. So, I give up.”"
      },
      {
        "paragraph": "She gave up."
      },
      {
        "paragraph": "She said it so directly and determinedly."
      },
      {
        "paragraph": "Ryan slowly averted his gentle gaze from her. Admiration and sympathy washed over him."
      },
      {
        "paragraph": "He had the urge to tell her that he understood even though Rodney did not."
      },
      {
        "paragraph": "Unfortunately, fate had messed up his relationship with Freya, who was now his sister."
      },
      {
        "paragraph": "However, there would be ample time for him to go after Freya since Rodney did not cherish her."
      },
      {
        "paragraph": "At night in the pub."
      },
      {
        "paragraph": "Only after Rodney called a few times did Chester pick up his phone."
      },
      {
        "paragraph": "“What’s the matter? I just performed an operation.” Chester’s nonchalant voice rang out."
      },
      {
        "paragraph": "“Chester, come over and drink with me. I’m worn out. ” Rodney burped, and his handsome face was\nflushed red. “Freya wants to divorce me. She said that she hates me, but I don’t get why she has to do\nthis. Doesn’t she trust me at all?”"
      },
      {
        "paragraph": "Chester did not say a word. Instead, he slowly undid the white coat he was wearing."
      },
      {
        "paragraph": "“Did you hear what I said? Come over.” Rodney said miserably, “ I’m distressed. Come over and drink\nwith me.”"
      },
      {
        "paragraph": "“I have a night shift later.” Chester turned Rodney down tacitly after hanging his coat."
      },
      {
        "paragraph": "“You can exchange your shift with someone else since you’re Young Master Jewell and the hospital is\nyours. But I’m getting a divorce soon,” Rodney said and then took another gulp of wine. “I’m at the pub,\nwhere we often used to hang out.”"
      },
      {
        "paragraph": "Chester remained quiet for a moment before he said, “I said I’m busy.”"
      },
      {
        "paragraph": "Rodney froze. No matter how much he had drunk, he grasped the message. “What do you mean,\nChester? Has Shaun told you something? He’s your buddy, but I’m your buddy too.”"
      },
      {
        "paragraph": "Chester’s attractive brows furrowed. “Rodney, you’re my buddy. You might not know me perfectly well,\nbut you should at least 20 percent, right?”"
      },
      {
        "paragraph": "Rodney could not get his head around it. “I understand that Shaun doesn’t like Sarah, but Sarah has\nnothing to do with you. She has always respected you and treated you as her elder brother Chester\nsighed softly. “She knows full well whether she treated me as her elder brother or took advantage of\nme. Rodney, I was the one who sent Charity to jail when she was innocent. Now, she is nowhere to be\nfound. Because of Charity, Jennifer and Boris died too. Do you think I’m so cold- blooded that I don’t\nfeel a thing?”"
      },
      {
        "paragraph": "Although he did not express it sometimes, what frustrated him was that Rodney could not grasp the\npoint."
      },
      {
        "paragraph": "He felt that Rodney should be careful."
      }
    ]
  },
  {
    "title": "Chapter 1955 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rodney was momentarily stunned before he muttered, “What does Jennifer’s and Boris’s death have to\ndo with Sarah? Jennifer died because she fell, whereas Boris died because his son made him mad.\nCharity’s death was caused by Wesley and Mason. You can’t just shift all the blame onto Sarah.”"
      },
      {
        "paragraph": "“Oh, I see. Look, we don’t see eye to eye with each other, so there’s nothing we can  talk about. I’m\nvery busy. Goodbye.”"
      },
      {
        "paragraph": "Chester hung up the call."
      },
      {
        "paragraph": "Rodney looked at his phone in a daze. He could not believe what was happening."
      },
      {
        "paragraph": "When he had a row with Shaun the last time, Chester was not like this."
      },
      {
        "paragraph": "Now, surprisingly, Chester completely ignored him too."
      },
      {
        "paragraph": "His wife was going to divorce him, and his best buddy seemed to be distancing himself from him."
      },
      {
        "paragraph": "All of a sudden, Rodney was lonely and at his wits’ end."
      },
      {
        "paragraph": "He was usually closest to Shaun and Chester. At this moment, he had no idea who to contact."
      },
      {
        "paragraph": "No one understood him. Who could understand him?"
      },
      {
        "paragraph": "He browsed through his contact numbers and somehow dialed Rory’s number. “Come over and drink\nwith me.”"
      },
      {
        "paragraph": "Rory immediately answered that he was coming."
      },
      {
        "paragraph": "Rodney’s eyes flashed with a bitter smile. Oh, look. He still had friends. Although Shaun and Chester\nrefused to meet him, it was not a must to have them."
      },
      {
        "paragraph": "He drank the wine in large gulps. By the time Rory came over, he was already drunk."
      },
      {
        "paragraph": "“Buddy, why are you so drunk?” Rory asked as he sighed."
      },
      {
        "paragraph": "“They don’t understand me,” Rodney said glumly, “ Freya wants to divorce me because she found out\nthat I’m hiding Sarah. I didn’t f*cking do anything to wrong her, but she said she hates me.”"
      },
      {
        "paragraph": "“Is that necessary?” Rory frowned. In his eyes, women came and went and could be replaced at any\ntime. “Buddy, you’re too concerned about her.”"
      },
      {
        "paragraph": "“Exactly. I treat her so well.” Rodney was so drunk that Rory’s words made him feel like he had finally\nfound a confidant. “I’ve been treating her so well. I’ve been the one doing the cooking and gifting her\neverything. I’ve never even treated Sarah so well. Plus, Sarah has sacrificed so much for me, so why\ncan’t I compensate her to ease my guilt?”"
      },
      {
        "paragraph": "“Sure you can. Since you’re the one earning the money, you can spend it however you like. Women\nhave no right to have a hand in it,” Rory said lazily. “Freya is too discontented. If it weren’t for you,\ncould she have become the prime minister’s goddaughter and set up a business so successfully?\nConversely, Sarah has done so much for you, yet she gained nothing.”"
      },
      {
        "paragraph": "“Precisely. She’s too greedy,” Rodney mumbled in agreement."
      },
      {
        "paragraph": "He did not know how long they had talked for or how much he had drunk, but in the end, he was so\ndrunk that he lay on the table drowsily."
      },
      {
        "paragraph": "Rory helped him to get in his car. “Let me send you home.”"
      },
      {
        "paragraph": "“No… I’m not going home… It’s pointless,” Rodney mumbled."
      },
      {
        "paragraph": "After some thought, Rory realized that Rodney’s"
      },
      {
        "paragraph": "wife and child were not at home. Indeed, it was pointless to go home."
      },
      {
        "paragraph": "Coincidentally, Sarah had sent Rory a few WhatsApp messages to ask about Rodney’s"
      },
      {
        "paragraph": "condition before this. Hence, Rory sent Rodney to her apartment straight away."
      },
      {
        "paragraph": "Rory brought Rodney, who was blind drunk, to the bed and winked at Sarah. “I’ll leave him in your\ncare.”"
      },
      {
        "paragraph": "“Young Master Wooten, why is he so drunk?” Sarah revealed a worried look. “ Is it because Freya\nfound out about me and argued with him? I really didn’t mean to ruin their marriage.”"
      }
    ]
  },
  {
    "title": "Chapter 1956 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“You may think that way, but Freya doesn’t think the same. She’s making a fuss and asking for a\ndivorce now.”"
      },
      {
        "paragraph": "Rory said in disdain, “But I think she’s just threatening Rodney. It can’t be for real.”"
      },
      {
        "paragraph": "All color drained from Sarah’s face. She made a regretful expression. “It’s all my fault. I shouldn’t have\nappeared.”"
      },
      {
        "paragraph": "“Take good care of Rodney.” Rory did not say anything else. He turned around and left."
      },
      {
        "paragraph": "After he left, Sarah limped toward the bedroom with the aid of crutches."
      },
      {
        "paragraph": "The housekeeper had prepared a small tub of hot water."
      },
      {
        "paragraph": "“Leave it there. I’ ll wipe Rodney. You can go and rest earlier.” Sarah caressed Rodney’s good- looking\nface repeatedly. Her eyes were filled with affection."
      },
      {
        "paragraph": "The housekeeper’s eyes gleamed."
      },
      {
        "paragraph": "She had been taking care of the place for quite a while. After the incident the day before yesterday, she\ncould tell that Sarah was Rodney’s mistress."
      },
      {
        "paragraph": "She did not know the details."
      },
      {
        "paragraph": "However, the housekeeper had seen a lot of similar cases."
      },
      {
        "paragraph": "Wealthy businessmen often kept mistresses outside."
      },
      {
        "paragraph": "After a moment of hesitation, she listened to Sarah and left. Before that, she told Sarah, “Call me if you\nneed any help.”"
      },
      {
        "paragraph": "After the door closed, Sarah gazed at the man on the bed. Her lips curved smugly."
      },
      {
        "paragraph": "Initially, she had been thinking about how she could set Rodney up and get him on her bed."
      },
      {
        "paragraph": "She was even considering using hypnosis if she had no other choice."
      },
      {
        "paragraph": "Sarah did not expect that Rory would send Rodney over to her place."
      },
      {
        "paragraph": "That was an excellent opportunity."
      },
      {
        "paragraph": "Since her return to Australia, she had been aiming for the position of Young Madam Snow."
      },
      {
        "paragraph": "Sarah slowly climbed onto the bed and unbuttoned the buttons on Rodney’s shirt one by one. Her voice\nwas very seductive."
      },
      {
        "paragraph": "Rodney felt like he was having a dream. In the dream, Freya kept calling out to him."
      },
      {
        "paragraph": "His heart was set on fire."
      },
      {
        "paragraph": "When he woke up, his head hurt so much like it was about to split."
      },
      {
        "paragraph": "His stomach did not feel well either. He felt like puking."
      },
      {
        "paragraph": "He had not drunk that much in so long."
      },
      {
        "paragraph": "However, after Rodney opened his eyes, he realized he was lying on an unfamiliar bed. There was the\nscent of a woman enveloping the bed."
      },
      {
        "paragraph": "Wait, the smell was not that unfamiliar. It was… Sarah’s bed."
      },
      {
        "paragraph": "Moreover, Rodney only had a pair of pants on. What happened?"
      },
      {
        "paragraph": "Rodney’s head felt as if it had been struck by lightning. He immediately got up but fell to the ground\nbecause he was too drunk."
      },
      {
        "paragraph": "“Rodney, are you okay?” Sarah’s voice came from the side."
      },
      {
        "paragraph": "Rodney turned his head back while trembling. He saw Sarah in her body-hugging silk pajamas, with\nher slightly messy hair tumbling down her shoulders. Her sexy curves were on full display."
      },
      {
        "paragraph": "He looked behind Sarah. It seemed that she had gotten down from the sofa. Did that mean they had\nnot slept together?"
      },
      {
        "paragraph": "Rodney was nearly scared to death."
      },
      {
        "paragraph": "He quickly stood up with the support of the bed. His clothes were missing, so he could only use the\nblanket to cover himself awkwardly. “Sarah, I…"
      },
      {
        "paragraph": "Why am I here? Nothing happened… between us… last night, right?”"
      }
    ]
  },
  {
    "title": "Chapter 1957 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rodney was nervous. He was utterly flustered."
      },
      {
        "paragraph": "Sarah glanced at him and smiled. “You were so drunk last night. What could’ve happened?”"
      },
      {
        "paragraph": "Rodney breathed out a huge sigh of relief."
      },
      {
        "paragraph": "“Don’t worry. I slept on the sofa last night.” Sarah rubbed her tired eyes and said, “But you vomited, so I\ntook off your clothes and sent them for washing. You can ask Hans to send a set of clothes over.”"
      },
      {
        "paragraph": "“Okay. ” Rodney was relieved. Seeing Sarah’s tired appearance, he felt very guilty. “Thank you for last\nnight. I drank too much last night. Rory, that crazy guy, must’ve sent me to your place because he\nthought something was going on between us.”"
      },
      {
        "paragraph": "“Don’t blame Rory. You were the one who said you didn’t want to go home. Rory didn’t know where to\nsend you, so he brought you to my place.”"
      },
      {
        "paragraph": "Sarah said guiltily, “He said you went to drink because you were frustrated over Freya wanting to get a\ndivorce. Rodney, why don’t I go and explain things to Freya?”"
      },
      {
        "paragraph": "“Never mind. I think she’ll be so angry that she might even hurt you. ” Rodney smiled bitterly. “ I don’t\nunderstand why she hates you so much.”"
      },
      {
        "paragraph": "“Maybe it’s because of the things my brother did before.” Sarah was regretful. “After all, it was because\nof my brother’s actions that her life changed. If my brother hadn’t drugged her, she wouldn’t have…\nhad your child back then. It’s a given that she despises my brother.”"
      },
      {
        "paragraph": "Rodney’s expression could not help but change slightly."
      },
      {
        "paragraph": "That was true."
      },
      {
        "paragraph": "Why did Freya hold so much hatred for Sarah?"
      },
      {
        "paragraph": "Was it because she never wanted to marry him or have his child?"
      },
      {
        "paragraph": "What Thomas did had bound Rodney and Freya together tightly."
      },
      {
        "paragraph": "Before this, Rodney had hated it as well, but he did not regret it afterward."
      },
      {
        "paragraph": "He even felt thankful after having Dani."
      },
      {
        "paragraph": "However, Freya might not feel the same way. Maybe she did not like him at all."
      },
      {
        "paragraph": "Besides, she had never said that she loved him before."
      },
      {
        "paragraph": "“Rodney, are you okay?” Sarah asked worriedly."
      },
      {
        "paragraph": "“It’s… It’s nothing.”"
      },
      {
        "paragraph": "Rodney tried to stop himself from thinking nonsense. “Where’s my phone?”"
      },
      {
        "paragraph": "“Here.”"
      },
      {
        "paragraph": "After Rodney took his phone, he gave Hans a call."
      },
      {
        "paragraph": "Hans rushed over with the clothes after having his breakfast. When he saw the harmonious scene of\nRodney and Sarah having breakfast together, a hint of resignation flashed across his eyes."
      },
      {
        "paragraph": "When they left the condominium, Hans could not help but say, “Last night, you and Miss Neeson… Do\nyou need me to buy medicine for her?”"
      },
      {
        "paragraph": "“Medicine?” Rodney was stunned for a few seconds before he reacted. He glared at Hans angrily, “Do I\nlook like a person who has no morality? I was drunk last night and Rory sent me here. I didn’t do a\nthing.”"
      },
      {
        "paragraph": "Hans reminded him. “Young Master Snow, you may not be too happy with me saying some things out\nloud but if you want to continue  being  together with Young Madam Snow, you should keep your\ndistance from Miss Neeson. You’re already married,"
      },
      {
        "paragraph": "yet you spent the whole night in another woman’s home. If this goes out, no one will believe that you\nguys are innocent.”"
      },
      {
        "paragraph": "Rodney was annoyed from hearing his words. “I didn’t wish for it to happen too. I already said that I\nwas drunk last night. Besides, Freya won’t believe me even if I’m innocent. She doesn’t like me  at  all.\nShe only wants to divorce me.”"
      },
      {
        "paragraph": "“Young Master Snow, I think Miss Lynch must’ve really thought of spending her life with you before\nthis.” Hans was in disagreement."
      },
      {
        "paragraph": "“You think? That’s just your thoughts.” Rodney let out a hmph. Just as he was about to say something,\nOld Master Snow called him all of a sudden."
      },
      {
        "paragraph": "“Grandpa…”"
      },
      {
        "paragraph": "After Rodney picked up the call, Old Master Snow said, “After you left yesterday, we came to an\nagreement with Freya. You should arrange a time to get the proof of divorce with Freya.”"
      },
      {
        "paragraph": "Upon hearing that, Rodney was like a bomb that was detonated. “Why should I get a divorce just\nbecause you told me to? It’s not your marriage. It’s mine. I won’t get a divorce.”"
      },
      {
        "paragraph": "His sentence made Old Master Snow’s blood pressure rise. Old Master Snow did not know what sin he\ncommitted in his past life to have such a grandson."
      }
    ]
  },
  {
    "title": "Chapter 1958 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Since you know that it’s your marriage, why didn’t you cherish it? I’m too lazy to talk to you. You can\ndrag out this marriage, but Freya has no intention of spending her days with you anymore. I can see\nthat she has made up her mind.”"
      },
      {
        "paragraph": "Old Master Snow said resignedly, “Just let her go. Let yourself off the hook too.”"
      },
      {
        "paragraph": "“Let go?” Rodney was so agitated that he was about to lose control. “Grandpa, all of you were the ones\nwho said she’s a very good woman and asked me to marry her. I got married because of you all, and\nnow I have to get divorced because you all told me to. I’m a person with feelings and opinions as well!”"
      },
      {
        "paragraph": "Rodney hung up after he spoke. He still had not fully vented his anger even after hanging up and\nsimply smashed the phone."
      },
      {
        "paragraph": "He walked in long strides. After getting in the car, he drove speedily toward Freya’s company."
      },
      {
        "paragraph": "When Rodney arrived, her office door was closed. Freya’s secretary, Charlene, passed by. She\nreminded him, “Miss Lynch hasn’t been coming to the company these few days.”"
      },
      {
        "paragraph": "“When will she be here?” Rodney’s expression was dark, which made Charlene afraid."
      },
      {
        "paragraph": "“This… I’m not very sure.” Charlene took a step backward. “But Miss Lynch said that you two are\ngetting a divorce, so there’s no need to inform you about her schedule anymore.”"
      },
      {
        "paragraph": "“Ha… A divorce. In her dreams.”"
      },
      {
        "paragraph": "Rodney smashed his fist into the wall. He turned away and left furiously."
      },
      {
        "paragraph": "As he was leaving, he even kicked the trash can by the wall hard."
      },
      {
        "paragraph": "In the official residence, Freya’s mood in the morning was ruined after receiving Charlene’s call. “I most\nprobably won’t be going to the company in these few days. If Rodney comes again, you don’t have to\ncare about him.”"
      },
      {
        "paragraph": "Rodney did not even like her that much. Was it necessary to make it look as if he could not forget her?"
      },
      {
        "paragraph": "Freya thought that she was not charming enough that she would have an effect on him."
      },
      {
        "paragraph": "She honestly did not want to drag things out with Rodney."
      },
      {
        "paragraph": "In the evening, Catherine gave Freya a call when Dani was having a nap. “Come on out. I know that\nyou’re in a bad mood. We’ll accompany you to relax and also celebrate that you’re about to get a\ndivorce.”"
      },
      {
        "paragraph": "“We?” Freya was puzzled."
      },
      {
        "paragraph": "“Eliza just happened to be done filming and is back to rest, ” Catherine said."
      },
      {
        "paragraph": "“Oh,” Freya replied. She agreed to Catherine’s suggestion."
      },
      {
        "paragraph": "After giving the nanny some reminders, she drove to the private club that Catherine mentioned."
      },
      {
        "paragraph": "When she entered, Catherine had already booked a private room. Catherine and Eliza were sitting on\nthe tall chairs and singing a song."
      },
      {
        "paragraph": "As a popular celebrity, Eliza looked like she was holding a concert with her shining aura and pretty long\nlegs even though she was just sitting there."
      },
      {
        "paragraph": "Catherine was not lacking either. Both of them were sitting next to each other. They could totally\nbecome a singing duo."
      },
      {
        "paragraph": "A young waiter, who was pouring wine, glanced at them. It was as if his soul was being sucked out and\nhe was in a daze."
      },
      {
        "paragraph": "When Catherine saw Freya entering, she greeted her."
      },
      {
        "paragraph": "Freya sat at the side and quietly watched the two sing."
      },
      {
        "paragraph": "One of them was cool and carefree, while the other was bright and charming. She was the only one\nwho was lifeless."
      }
    ]
  },
  {
    "title": "Chapter 1959 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "After the song ended, Catherine and Eliza went to Freya’s side."
      },
      {
        "paragraph": "“Dear Freya, I added a song to the playlist for you.” Catherine handed the microphone to Freya. “ It’s\ncalled ‘Release’,”"
      },
      {
        "paragraph": "“Release from what?” Eliza asked."
      },
      {
        "paragraph": "Freya was taken aback. “Hasn’t Cathy told you yet?”"
      },
      {
        "paragraph": "“I arrived a few minutes earlier than you. She pulled me over to sing the moment I came in.” Eliza\nlooked at Freya’s sickly expression. She raised her eyebrows. “Did something happen between you\nand Rodney?”"
      },
      {
        "paragraph": "“Not only is there a problem but we’re also preparing to get a divorce. ” Freya sighed.”That b* stard was\nsecretly hiding Sarah, the woman that Cathy and I hate the most. Forget it. You don’t"
      },
      {
        "paragraph": "know who Sarah is. She’s a very bad, evil woman. I despise her to the point that I want to grind her\nbones and scatter her ashes.”"
      },
      {
        "paragraph": "Eliza was about to grab a wine glass. Upon hearing Freya’s words, her hand stiffened. She only\ngrabbed the wine glass after pausing for two seconds."
      },
      {
        "paragraph": "After Catherine, who was at the side, glanced at Eliza’s hand, she took a sip of wine without saying a\nword."
      },
      {
        "paragraph": "“You’re so good. Doesn’t Rodney know that he should cherish you?” Eliza swayed her wine glass\nabsent-mindedly. An icy gleam flashed across the depths of her eyes."
      },
      {
        "paragraph": "“Rodney liked Sarah a lot since way back then.” Freya shrugged. “ Sarah has many schemes. She has\ndone so many evil things, yet Rodney  still feels guilty toward her. I’m really not her opponent."
      },
      {
        "paragraph": "Even Cathy lost to her before.”"
      },
      {
        "paragraph": "“That’s really remarkable.” Eliza’s eyelids drooped. Her lips curved into a faint smile."
      },
      {
        "paragraph": "Catherine patted Freya’s back. “Don’t let Sarah be a trauma in your heart. Getting a divorce isn’t that\nbad. Look, you’re pretty and rich now. With Rodney gone, you still can have many other choices. The\nyoung lad who was pouring the wine just now was pretty handsome.”"
      },
      {
        "paragraph": "The corners of Freya’s lips twitched. “You didn’t… choose this place on purpose, did you? Aren’t you\nafraid that Shaun will get jealous?”"
      },
      {
        "paragraph": "“I’ve already explained it to him. He’ll understand. Besides, he won’t overestimate himself and compare\nhimself to my good sisters. That’s like bringing destruction upon himself.” Catherine was smiling,\nlooking like a big sister who had her man in her grasp."
      },
      {
        "paragraph": "Freya was surprised. “I appreciate your kindness, but I’m already terrified of relationships. That young\nlad just now does look quite charming, but those who work here are mostly aiming for money and\nbenefits.”"
      },
      {
        "paragraph": "Catherine laughed. “ So what? Some men look for pretty and young women outside. Aren’t those\nwomen doing it for the money and advantages as well? Do you think those guys are really that\ncharming? Just like Sarah. If Rodney wasn’t the prime minister’s nephew, would she even be\ninterested in him? No way.”"
      },
      {
        "paragraph": "Eliza nodded. She said calmly, “I know quite a few influential women in the entertainment industry.\nThey all like to look for handsome young guys in the same industry. Both parties fulfill their respective\nneeds. The women lead carefree and unrestrained lives.”"
      },
      {
        "paragraph": "Freya was horrified. “You both aren’t planning to make me into the kind of rich woman who plays\naround with younger men, right?”"
      },
      {
        "paragraph": "Eliza laughed upon hearing that. “Those rich women are usually older. You’re only 26 years old. You’re\nyoung and beautiful. It’s just a matter of bending your fingers if you want any man. Cathy is just trying\nto tell you not to be disheartened because of one or two relationships, right?”"
      },
      {
        "paragraph": "Catherine was astonished. She did not expect that Eliza knew her quite well. “That’s right, Freya.  Two\nof your relationships failed but I don’t wish for you to be traumatized. You might think that you’re a\nfailure and not charming, but that’s not  true.  You just haven’t met the right person.”"
      },
      {
        "paragraph": "Freya went silent. Her eyes reddened, and some emotions came gushing out."
      },
      {
        "paragraph": "That was right. She was traumatized. She even doubted herself before this."
      },
      {
        "paragraph": "She thought maybe there was a problem with her personality that made her not likable to men."
      },
      {
        "paragraph": "She did not even want to date anyone for the rest of her life."
      },
      {
        "paragraph": "” In  my eyes, you’ re  an excellent girl.”   Eliza gave Freya a tissue.” It’s not that you’re not good. There\nare  just too many men who can’t withstand  the test.”"
      }
    ]
  },
  {
    "title": "Chapter 1960 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya accepted the tissue. She was touched. “By the way, Eliza, you’re not interested in dating or men\nat all. Is it because you’ve met horrible guys before as well?”"
      },
      {
        "paragraph": "Eliza lowered her head and gazed at the dark red liquid in the wine glass."
      },
      {
        "paragraph": "She could not help but lament. The guys she met were not only horrible."
      },
      {
        "paragraph": "They were scumbags."
      },
      {
        "paragraph": "Whether as Charity or Eliza, who had already passed away, they both sacrificed their lives for\nscumbags."
      },
      {
        "paragraph": "Seeing that Eliza went silent all of a sudden, Catherine recalled Chester saying viciously that Eliza only\nobtained her current achievements through men."
      },
      {
        "paragraph": "She did not suspect Eliza’s character, but everyone had their own sad stories. She quickly nudged\nFreya lightly."
      },
      {
        "paragraph": "Freya was stunned for a moment. Then, she came back to her senses. “It’s okay if you don’t want to\nanswer. I was just asking.”"
      },
      {
        "paragraph": "“Actually… It’s nothing big.”"
      },
      {
        "paragraph": "Eliza curved her intricate lips faintly.  “It’s just  that I was tricked when I was young and naive. That\nperson was sweet with his words and was romantic. I was inexperienced, and I even thought I had met\nm y true love. I didn’t care when everyone was mocking me. I thought those people were jealous and\nenvious of me. Who said that a poor girl who wasn’t from a good family didn’t deserve to meet her true\nlove? However, it turns out he just wanted to have s*x with me because I was beautiful and young.”"
      },
      {
        "paragraph": "She took a sip of wine elegantly. The wine dyed her lips red, like a thorny rose. Her smile became more\nnonchalant. “After that, he got engaged to another woman and told me not to pester him. He said that I\nlooked disgusting when I was pestering him.”"
      },
      {
        "paragraph": "“That’s too much.” Freya was enraged from hearing Eliza’s words."
      },
      {
        "paragraph": "She understood that feeling very well. She had experienced the same when she was with Patrick and\nRodney."
      },
      {
        "paragraph": "Eliza sighed. “Is that considered too much?"
      },
      {
        "paragraph": "Actually, these things happen a lot in the entertainment industry. Look at my hand…”"
      },
      {
        "paragraph": "She removed the strap of her watch and revealed a scar on her wrist."
      },
      {
        "paragraph": "Catherine and Freya were stunned due to shock."
      },
      {
        "paragraph": "They could not believe it. The cold-hearted Eliza had attempted suicide for that man?"
      },
      {
        "paragraph": "Catherine felt sorry for Eliza. “Eliza, it’s not worth it. When I used to be in despair, I never thought of\ntaking my own life for a man.”"
      },
      {
        "paragraph": "“That’s right. It wasn’t worth it. At that time, I thought that losing love was equivalent to losing\neverything. When that man knew that I attempted suicide, he came over to see me. However, it wasn’t\nbecause he cared about me. He told me not to use those cheap tricks to make him soft-hearted. He\nsaid that it was idiotic and disgusting. He even told me to go farther away to kill myself if I wanted to\ncommit suicide.”"
      },
      {
        "paragraph": "Eliza laughed nonchalantly as if she was not talking about herself."
      },
      {
        "paragraph": "Catherine grabbed Eliza’s shoulders unconsciously. “Tell me, who was it?”"
      },
      {
        "paragraph": "Which b*stard dared to hurt her friend? She would definitely make his life hard."
      },
      {
        "paragraph": "“It’s no longer important who did it.” Eliza put her watch back on. Her eyes were calm with no emotion\nin them. “When I look back in the past, I just think that there are still many more meaningful things in\nlife. Love shouldn’t control our emotions. Life doesn’t become meaningless without love.”"
      },
      {
        "paragraph": "“You have a point there.” Freya had the same sentiments. “Men are nothing. Career and money can\nmake us happier. Come, let’s drink and sing. ”"
      },
      {
        "paragraph": "The three of them only left after having fun at the club until 7:00 p.m."
      },
      {
        "paragraph": "Although they did not drink much, no one dared to drive."
      },
      {
        "paragraph": "Catherine called Shaun over to pick her up."
      },
      {
        "paragraph": "When Shaun arrived, he heard Catherine shouting, “ Happy breakup! I wish you happiness. You can go\nand find a better one…”"
      },
      {
        "paragraph": "Shaun rubbed his ears."
      },
      {
        "paragraph": "He yanked Catherine, who was having barbequed meat, into his embrace. “You’re so carefree here\nand left me to tend to the two children alone.”"
      },
      {
        "paragraph": "Catherine let out a hmph. She twisted her body. “Go away. Even the sight of you men is hateful. What a\nbunch of scumbags. ”"
      }
    ]
  },
  {
    "title": "Chapter 1961 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun said, “… I didn’t offend you, though.”"
      },
      {
        "paragraph": "Catherine glanced at him. “You still hurt me a lot in the past. Don’t touch me tonight. It’s annoying.”"
      },
      {
        "paragraph": "F*ck, he got caught up in the mess even though he laid low."
      },
      {
        "paragraph": "It was all that b*stard Rodney’s fault. Young Master Hill’s hatred for Rodney deepened further."
      },
      {
        "paragraph": "“Come on. Let’s go home.”"
      },
      {
        "paragraph": "Freya walked over with her bag. “I have to go back to be with Dani. Dani still isn’t familiar with the\nofficial residence’s nanny. She might miss me.”"
      },
      {
        "paragraph": "Catherine waved her hand. “Let’s go. Shaun will give you all a ride.”"
      },
      {
        "paragraph": "“No need. My van is downstairs.” Eliza bid goodbye to the others at the parking lot."
      },
      {
        "paragraph": "There was a driver who had tanned skin in the van. After Eliza got in, she rubbed her temples. Her\neyes that still looked happy just now slowly turned icy. “"
      },
      {
        "paragraph": "How’s the investigation on Sarah going?”"
      },
      {
        "paragraph": "The driver was taken aback. He said, “We found out that she went to a manor and worked as a\nwaitress some time back. After that, she went missing.”"
      },
      {
        "paragraph": "“Waitress?” Eliza laughed coldly. “I see.” The driver was confused."
      },
      {
        "paragraph": "“You don’t have to investigate this anymore, ” Eliza said, “Rodney is hiding her in a condominium."
      },
      {
        "paragraph": "She’s well-protected.”"
      },
      {
        "paragraph": "The driver was astonished. “No wonder we couldn’t find her. So… what do we do now? With Rodney\nbehind her back, it seems like…”"
      },
      {
        "paragraph": "“Rodney said he’ll get Sarah out of Australia half a month later, but I think Sarah won’t leave so easily.”"
      },
      {
        "paragraph": "After thinking for a moment, Eliza’s eyes became sinister and ruthless. “Sarah must die, and I won’t let\nher have an easy death. Keep an eye on her. Once she leaves the sight of Snowden’s people, think of\na way and make a move.”"
      },
      {
        "paragraph": "“But… ” The driver was in a dilemma. “Ever since Nathan became the prime minister, Snowden’s\ninfluence has become greater. I’m afraid you’ll be dragged into this afterward…”"
      },
      {
        "paragraph": "“If something happens, you guys can leave first. Ever since I started preparing to get my revenge, I\nnever thought of keeping my life.”"
      },
      {
        "paragraph": "Eliza looked outside the window. She was supposed to be dead long ago."
      },
      {
        "paragraph": "Maybe the heavens allowed her to come back to get revenge because her resentment was too strong,\nand the underworld did not want to accept her."
      },
      {
        "paragraph": "She was clear about Sarah’s intentions. Sarah wanted to marry Rodney and enter the Snow family."
      },
      {
        "paragraph": "Ha. As long as Eliza was alive, Sarah would never achieve that."
      },
      {
        "paragraph": "Freya got out of the car at the entrance of the official residence."
      },
      {
        "paragraph": "However, before she could go in, someone hugged her."
      },
      {
        "paragraph": "“Wifey, you finally showed up. I’ve been waiting here for so long.” Rodney hugged her tightly."
      },
      {
        "paragraph": "He had been waiting here from evening until night. He had not even eaten his dinner."
      },
      {
        "paragraph": "Nevertheless, when he thought of Freya wanting to divorce him, he did not have an appetite at all."
      },
      {
        "paragraph": "Once Rodney embraced Freya’s soft body and her familiar scent wafted toward him, his heart\ntrembled. He had the urge to meld her into his body."
      },
      {
        "paragraph": "Why was that woman so disobedient? Rodney missed her and the child."
      }
    ]
  },
  {
    "title": "Chapter 1962 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rodney did not want to return to that cold home at all."
      },
      {
        "paragraph": "“Let go.”"
      },
      {
        "paragraph": "Freya could smell Rodney’s scent, but she was utterly disgusted."
      },
      {
        "paragraph": "However, Rodney was hugging her very tightly."
      },
      {
        "paragraph": "“I’m not letting go. Freya, I’m so hungry. I’m starving. I don’t even want  to eat when you and Dani\naren’t around. Let’s go home, okay?” Rodney pleaded."
      },
      {
        "paragraph": "“Go look for Sarah if you’re hungry. It’s not my f*cking business. I just want to get a divorce.” After\nresisting for a long time, Freya still could not escape his embrace."
      },
      {
        "paragraph": "In the end, Shaun got down the car and yanked Rodney’s arm away. Freya ran inside the official\nresidence as if she was escaping."
      },
      {
        "paragraph": "She did not intend to keep being involved with Rodney. She did not even want to listen to his\nexplanation."
      },
      {
        "paragraph": "“ Shaun, what are you doing?” Rodney flung a fist toward Shaun when he saw that Freya was gone in\na second. “Do you know how long I waited here just to see her? This is a problem between us husband\nand wife. Why are you meddling in our affairs?”"
      },
      {
        "paragraph": "Shaun grabbed Rodney’s fist. There was mockery in his deep -set eyes. “You spent the night at\nSarah’s place last night, yet now you’re here to pester Freya. Rodney, be a man and know some\nshame. ”"
      },
      {
        "paragraph": "Rodney’s pretty face twitched out of embarrassment for a moment. He did not think Shaun would know\nabout that."
      },
      {
        "paragraph": "Before he could talk, Catherine, who heard everything from the side, raised her bag and flung it at\nRodney’s face furiously."
      },
      {
        "paragraph": "“Stupid scumbag, what do you take Freya for? Is she a fool? How dare you appear before her?\n*sshole! Monster. To think that I actually had a good impression of you before. I must’ve been blind. Get\nlost and die.”"
      },
      {
        "paragraph": "After hitting Rodney a few times with her bag, Catherine still had not worked off her anger. She gave\nRodney a few more hard kicks."
      },
      {
        "paragraph": "“Okay. That’s enough.” Shaun was scared from seeing Catherine’s crazy strength. He quickly stopped\nher."
      },
      {
        "paragraph": "“Get lost. You’re so disgusting.” Catherine glared at Rodney viciously. “Freya’s right. You can go and\nlook for Sarah if you want to eat. Don’t disgust Freya further.”"
      },
      {
        "paragraph": "“Enough. I did sleep at Sarah’s place last night, but  I didn’t do anything.” Rodney’s face was wounded\nfrom getting hit. He had never felt so embarrassed, but he could not raise his hand against a woman."
      },
      {
        "paragraph": "Catherine sneered. “Ha. The fact that you didn’t do anything isn’t the point anymore. The point is that\nyou’re already married, yet you still spent the night with Sarah alone. Only a fool will believe that\nnothing happened between you two.”"
      },
      {
        "paragraph": "Rodney’s clenched fist trembled. “Catherine,"
      },
      {
        "paragraph": "Shaun, please don’t tell Freya about this. I can swear “I didn’t  tell her.”  Shaun  interrupted  him.  “But\neven if I don’t say anything, Freya still won’t  want  to be with you anymore.”"
      },
      {
        "paragraph": "After he spoke, he pulled Catherine along and got in the car."
      },
      {
        "paragraph": "On the way, Catherine kept scolding Rodney. “How can such a person exist? Rodney keeps refusing to\nget a divorce, yet he went to Sarah’s place and spent"
      },
      {
        "paragraph": "the whole night  there. He even thinks he’s innocent. Isn’t that weird? Is he not clear of what he should\nand shouldn’t do after getting married?”"
      },
      {
        "paragraph": "Shaun kept quiet."
      },
      {
        "paragraph": "To be honest, he could not understand why Rodney had become like this either."
      },
      {
        "paragraph": "“I’m telling you, you’re not allowed to be like that in the future. ” Catherine glared at Shaun. “ If you dare\nspend the night at another woman’s place, I’ll castrate you before breaking up with you.”"
      },
      {
        "paragraph": "Shaun, who was caught up in her anger despite being innocent, was speechless. “ I won’t. I don’t even\ndrink when I’m outside. I’m aware that I have a wife and children. I won’t even be friends with other\nwomen.”"
      }
    ]
  },
  {
    "title": "Chapter 1963 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine nodded. She was pretty satisfied with Shaun’s awareness. “By the way, how did you know\nthat Rodney spent the night at Sarah’s place?”"
      },
      {
        "paragraph": "“I arranged for some people to keep an eye on the place where Sarah lives. Rodney was most\nprobably drunk last night, so Rory sent him there.”"
      },
      {
        "paragraph": "Shaun frowned. “Rory used to be one of Rodney’s fair-weather friends in the past. He’s quite capable,\nbut he’s too flirty. He switches partners as if he’s changing clothes.”"
      },
      {
        "paragraph": "“I know. It’s the same with Chester.” Catherine showed a knowing expression."
      },
      {
        "paragraph": "Shaun was rendered speechless for a moment. Then, he said, “Rory isn’t as handsome nor as capable\nas Chester. His character isn’t very good either. I interacted with him a few times some years back, but\nI don’t really approve of him. Rory is quite a dangerous person. He’ll treat you well and utilize you when\nyou’re useful. When you become useless, he’ll kick you aside without hesitation. As for women, I guess\nhaving two or three girlfriends simultaneously and having fun with them together is a frequent pastime\nfor him. I even accidentally found out that he once shared a woman with a rich businessman who\nalready had a family.”"
      },
      {
        "paragraph": "Catherine felt deeply disgusted. However, when she recalled being pulled onto Rodney’s yacht and\ngetting bullied in the past, it seemed there were lots of sleazy and flirty young masters on the yacht at\nthat time as well. She did not remember whether Rory was among them or not."
      },
      {
        "paragraph": "“Why is Rodney even friends with that kind of person?” She could not understand it."
      },
      {
        "paragraph": "“Canberra’s social circle isn’t huge. They had fun and drank together when they were young. After that,\nthey were involved in business and helped each other out occasionally. That’s why Rory is close to"
      },
      {
        "paragraph": "Rodney.”"
      },
      {
        "paragraph": "Shaun said disapprovingly, “However, I don’t agree with Rodney getting too close with that kind of\nperson.”"
      },
      {
        "paragraph": "Catherine let out a snort. “A person like Rory must think that it’s a normal thing for men to have\nmistresses. Rodney must’ve been more or less influenced.”"
      },
      {
        "paragraph": "Shaun did not say a word, meaning he agreed with what she said."
      },
      {
        "paragraph": "The car drove silently for a while. Catherine suddenly thought of something. She looked at the man\nbeside her. “Something’s not right. Didn’t you lose your memories? How do you know that you had\ninteractions with Rory a few years ago?”"
      },
      {
        "paragraph": "Screech."
      },
      {
        "paragraph": "The car did an emergency brake by the side of the road."
      },
      {
        "paragraph": "Shaun stopped. He widened his dark eyes in astonishment. “I didn’t think too much about it. When you\nasked me about it, the memory of when I met Rory in the past flashed across my mind naturally.”"
      },
      {
        "paragraph": "Catherine was shocked too. “Could it be… Are you really about to recover your memories?”"
      },
      {
        "paragraph": "Shaun frowned upon hearing her words. He was slightly flustered. “Cathy, I really yearn for my\nmemories, but I’m scared too. I’m afraid to remember  the things I previously  did  to hurt you.”"
      },
      {
        "paragraph": "“You did many, many  things  that hurt me before.”"
      },
      {
        "paragraph": "Catherine’s throat was bitter. “But since I’ve agreed to get back together with you, I’ve decided to let go\nof those things. However, if you remember them, I"
      },
      {
        "paragraph": "hope you understand how badly you treated me in the past. You can slowly atone for the mistakes you\nmade to the children and me.”"
      },
      {
        "paragraph": "Shaun’s heart twitched."
      },
      {
        "paragraph": "He held Catherine’s hands while trembling and embraced her. “A scene suddenly flashed across my\nmind just now. Did I… force you to eat cat food in the past?”"
      },
      {
        "paragraph": "He did."
      },
      {
        "paragraph": "It was because Shaun ate the cat pudding that she had made. In the end, he forced her to eat a bowl of\ncat food. She was utterly disgusted."
      },
      {
        "paragraph": "It was okay if he did not mention it. As soon as he said it, Catherine wanted to take revenge."
      }
    ]
  },
  {
    "title": "Chapter 1964 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Cathy, say no more.” Shaun sensed Catherine’s dangerous gaze. He quickly said, “I’ll buy a bag of cat\nfood later and eat it to atone for my mistakes, okay?”"
      },
      {
        "paragraph": "“Haha, it’s good that you have self-awareness. ” Cathy let out a hmph coldly. She crossed her arms\nand turned her face away."
      },
      {
        "paragraph": "Shaun had a headache. How many insane things did he do in the past?"
      },
      {
        "paragraph": "At that moment, he hoped that he would not recover his memories."
      },
      {
        "paragraph": "In the official residence."
      },
      {
        "paragraph": "Freya frantically went back to the building in the backyard. She was worried that Aunty Loretta would\nnot be able to handle Dani."
      },
      {
        "paragraph": "However, when she entered the living room, she could not find Dani. Instead, she heard the child’s\nlaughter coming from the room on the right."
      },
      {
        "paragraph": "As Freya hurriedly walked toward the source of the sound, she was stunned."
      },
      {
        "paragraph": "When she left the place in the evening, it was still an ordinary bedroom."
      },
      {
        "paragraph": "However, it had turned into a pink mini playground now."
      },
      {
        "paragraph": "The floor was covered with pink cartoon foam mats. There was even a pink tent, a rocking horse, a\nswing, and a pool of play balls."
      },
      {
        "paragraph": "Dani was lying on the floor with a beam."
      },
      {
        "paragraph": "Ryan was sitting at the side. He was holding a cute teddy bear in his hands, entertaining Dani until she\nlaughed to the point her dimples were showing."
      },
      {
        "paragraph": "Freya was in a daze for a long time. She almost thought she had come to the wrong place."
      },
      {
        "paragraph": "When Dani saw her, she waved her tiny hands happily."
      },
      {
        "paragraph": "That scene made Freya’s heart feel relieved."
      },
      {
        "paragraph": "Although she had decided to divorce Rodney, she was worried about Dani the most. Dani relied on him\nquite a lot. She was afraid Dani would throw tantrums. However, it seemed that Dani’s mood was quite\ngood even though she had left for the whole evening."
      },
      {
        "paragraph": "“You’re back.” Ryan put down the toy. He was wearing a pure white silk pajama top with a pair of blue\npajama pants. He did not care much about his hair and simply let his freshly-blown hair cover his\nforehead. He looked like a friendly guy who lived next door."
      },
      {
        "paragraph": "Freya found him cute with just a glance."
      },
      {
        "paragraph": "Although she met Ryan frequently, it was the first time she saw him wearing pajamas in private."
      },
      {
        "paragraph": "She had to admit that the Snow family’s genes were excellent. Since she had been looking at Rodney’s\ngorgeous face every single day in the past, she should have been immune toward handsome guys."
      },
      {
        "paragraph": "However, Ryan and Rodney’s looks were of different styles."
      },
      {
        "paragraph": "Rodney had more of a devil-like appearance. He liked to be flashy with his clothes as if he was worried\nother people did not know he was handsome."
      },
      {
        "paragraph": "On the other hand, Ryan’s fashion sense was usually reserved. It would feel as if the spring wind was\nblowing whenever he smiled. He was handsome and elegant. He was younger than Rodney by a few\nyears."
      },
      {
        "paragraph": "Freya used to think that Rodney was fresh and good-looking."
      },
      {
        "paragraph": "However, now that she compared him to Ryan, she suddenly realized that a five or six-year gap in age\ncould make a huge difference. Ryan, who was standing in front of her, had a clean face and fair skin.\nHe did not look sleazy at all."
      },
      {
        "paragraph": "Even the handsome guys she saw in the club that night seemed dim in comparison."
      },
      {
        "paragraph": "“What are you looking at?” Ryan asked while smiling."
      },
      {
        "paragraph": "“Oh, I was just wondering why you came over in your pajamas?” Freya secretly wondered why she was\nstill in the mood to admire handsome men when she was about to divorce."
      },
      {
        "paragraph": "Could it be that Catherine and Eliza’s brainwash attempt tonight was slightly successful?"
      },
      {
        "paragraph": "“I was about to read a book after bathing, but I came over when I heard Dani crying.” Ryan pinched\nDani’s little nose lightly. “Luckily, she stopped crying when I played with her.”"
      },
      {
        "paragraph": "“Thank you. Sorry for making you accompany Dani again.” Freya was embarrassed. “ I should’ve come\nback earlier, but…”"
      },
      {
        "paragraph": "“ It’s okay. It’s normal to be in a bad mood if your marriage failed. Sometimes, it’s good to get some\nfresh air and have a drink with friends. ” Ryan gazed at Freya attentively. “But don’t be sad for too long.\nDani needs you.”"
      }
    ]
  },
  {
    "title": "Chapter 1965 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya felt like crying when she thought of Dani. She quickly turned her face away. “Mm, I’ll be strong for\nDani. But how did you know that I went drinking with my friends?”"
      },
      {
        "paragraph": "“The smell of alcohol on you is so strong. My nose isn’t blocked.” Ryan took Dani from Freya’s arms.“\nGo get a bath. I’ll play with Dani for a while more.”"
      },
      {
        "paragraph": "Freya opened her mouth. She felt bad. She wanted to let Aunty Loretta take over, but she could not say\nit in the end when she saw Dani having so much fun with Ryan."
      },
      {
        "paragraph": "“By the way, don’t breastfeed the child after drinking wine. I heard that alcohol will diffuse into\nbreastmilk. The child will get drunk too,” Ryan said all of a sudden after raising his head."
      },
      {
        "paragraph": "Freya’s face flushed red in an instant upon hearing that. Although Ryan was her brother in name, they\nwere not related by blood, after all. She still felt awkward when she listened to a man mentioning that\nkind of stuff. “You don’t even have a child."
      },
      {
        "paragraph": "Why do you… know so much?”"
      },
      {
        "paragraph": "“Am I not allowed to know those things if I don’t have a child?” Ryan blinked his eyes. “I know a bit of\neverything.”"
      },
      {
        "paragraph": "“… Okay.” Freya fiddled with her hair awkwardly. “ Why did this room become a playroom?”"
      },
      {
        "paragraph": "“My mom asked me to change it. ” Ryan raised his eyebrows. “Are you satisfied with it? Don’t worry, all\nthese are odorless. They’re very safe.”"
      },
      {
        "paragraph": "“I like it very much. Thank you. Help me thank Godmother as well.”"
      },
      {
        "paragraph": "Freya was really touched."
      },
      {
        "paragraph": "Nathan and his wife had been treating her very well during these few days. They cared about her and\ngave her enough space."
      },
      {
        "paragraph": "The interior of the room was thoughtfully designed too."
      },
      {
        "paragraph": "She could see that Ryan was an attentive person."
      },
      {
        "paragraph": "“We’re family. There’s no need to say thank you.” Ryan smiled. He stretched his feet. “If you keep being\nso polite, I’m going to get angry.”"
      },
      {
        "paragraph": "“Okay then. I won’t thank you anymore. Dani… is your niece anyway. ” Freya laughed with relief. She\nturned around and went upstairs to take her bath."
      },
      {
        "paragraph": "Half an hour later, she entered the playroom again. The smell of alcohol was gone, and there was a\nslight fragrance on her. She took Dani from Ryan’s arms. “You can go back to sleep.”"
      },
      {
        "paragraph": "“Mm, remember to call me if there’s anything.” Ryan glanced at Freya’s wine-colored pajamas."
      },
      {
        "paragraph": "He had seen his mom wearing that color before. It looked old-fashioned on a woman her age."
      },
      {
        "paragraph": "However, Freya had fair skin, big eyes, and her features were charming. When she wore that color, he\nbecame hot-blooded with just a glance."
      },
      {
        "paragraph": "His gaze subtly swept across her chest."
      },
      {
        "paragraph": "He could not help but find it funny. It seemed that Freya was quite wary of him."
      },
      {
        "paragraph": "However, that was normal."
      },
      {
        "paragraph": "After Ryan left, Freya called Aunty Loretta over to bathe Dani."
      },
      {
        "paragraph": "Aunty Loretta said, “You don’t have to bath her anymore. Young Master and I already bathed Dani\nbefore you came back.”"
      },
      {
        "paragraph": "Freya was taken aback. “He even knows how to bathe a child?”"
      },
      {
        "paragraph": "“No, he doesn’t. But it’s not a tough thing to do. I finished bathing Dani in an instant with him carrying\nher. Young Master is meticulous and learns everything quickly. He even said that he can bathe Dani\nalone without me next time, ” Aunty Loretta said as she smiled."
      },
      {
        "paragraph": "Freya could not help but think that Ryan would be a good man after having his own family in the future."
      },
      {
        "paragraph": "Wait…"
      },
      {
        "paragraph": "Freya stopped her thoughts right there."
      },
      {
        "paragraph": "She grabbed her head."
      },
      {
        "paragraph": "Before she got married, did she not think that Rodney would be a good man as well?"
      },
      {
        "paragraph": "Forget it. She should stop simply making assumptions. She had a bad eye for men anyway."
      }
    ]
  },
  {
    "title": "Chapter 1966 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "The next day, Freya was disturbed from her sleep by her phone’s ringtone."
      },
      {
        "paragraph": "It was the advisor from the wedding photography studio. That advisor previously served Rodney and\nFreya enthusiastically. When the advisor found out that he would be taking wedding photographs for\nPrime Minister Snow’s goddaughter and nephew, he was overjoyed."
      },
      {
        "paragraph": "“Miss Lynch, you and Mr. Snow have reserved a wedding photoshoot for tomorrow. Do remember to\ncome, ” the advisor said. “We’ll first go to the seaside in the morning to take photos…”"
      },
      {
        "paragraph": "After listening to the advisor, Freya remembered that she and Rodney did not only book a wedding\nphotoshoot but also a wedding planner, hotel, and gifts for their guests."
      },
      {
        "paragraph": "It was so awkward."
      },
      {
        "paragraph": "“I’m sorry.” Freya bit the bullet and cut off the advisor’s chatter. “I’m afraid tomorrow’s schedule has to\nbe canceled…”"
      },
      {
        "paragraph": "“Did something urgent came up?” The advisor was anxious. “But we’ve already arranged our\nphotographer and team.”"
      },
      {
        "paragraph": "“We won’t be doing the photoshoot anymore.” Freya did not hide the truth. The photoshoot could not be\ndone anyway. There was no need to delay other people’s time. “Let’s do it this way. Make a  list of all\nyour losses and give it to me. I’ll take responsibility and compensate you.”"
      },
      {
        "paragraph": "The advisor was dumbfounded. He initially intended to release Freya and Rodney’s wedding"
      },
      {
        "paragraph": "photos so that their company’s popularity would skyrocket. “Why is that? Is it because you two aren’t\nfree? If so, we can postpone it first— ”"
      },
      {
        "paragraph": "“We’re not planning to hold the wedding anymore.” Freya interrupted him."
      },
      {
        "paragraph": "“How can you not have a wedding? Every woman yearns to have a romantic wedding—”"
      },
      {
        "paragraph": "Freya cut him off annoyedly. “We’re already going to be divorced, so there’s no need to have a wedding\nanymore. I’m sorry. I’ll compensate for your loss.”"
      },
      {
        "paragraph": "She hung up. She did not want to hear the advisor talking anymore."
      },
      {
        "paragraph": "The whole thing was a joke from the start. She should not have agreed to have a wedding ceremony\nback then."
      },
      {
        "paragraph": "After Freya brushed her teeth and washed her face, Aunty Loretta came up and said, “Madam Snow\nasked you to go to the main building to have breakfast if you’ve woken up. Young Master has gone\nthere too.”"
      },
      {
        "paragraph": "Freya had a headache. It was quite stressful to face Prime Minister Snow and his wife early in the\nmorning."
      },
      {
        "paragraph": "Aunty Loretta smiled and said, “Since you’ve moved into the official residence, you should get closer to\nthe prime minister and the others."
      },
      {
        "paragraph": "Actually, the prime minister’s family members are all pretty approachable.”"
      },
      {
        "paragraph": "After giving it some thought, Freya brought Dani to the main building."
      },
      {
        "paragraph": "It was her first time having breakfast with Nathan and his family at the official residence."
      },
      {
        "paragraph": "It was not like those scenes on the television where the wealthy families had their meals in silence."
      },
      {
        "paragraph": "They could not even show their teeth when they ate, and they were not allowed to talk."
      },
      {
        "paragraph": "Nathan told Freya to be at ease. He even had a conversation with her about her newly established\ncompany."
      },
      {
        "paragraph": "“Your idea of establishing a local cosmetics brand is quite good, ” Nathan said. “Although Australia’s\ndevelopment has been rapid these few years, our local brands are mediocre when placed on the\ninternational platform. I hope you’ll be able to have some accomplishments.”"
      },
      {
        "paragraph": "“I’ll do my best. ” Upon receiving encouragement from the prime minister, Freya nodded\nenthusiastically."
      },
      {
        "paragraph": "Ryan chuckled. “You don’t have to be so nervous. This isn’t the office. You’re not my dad’s subordinate,\nand you’re not a civil servant as well. He won’t bite you.”"
      },
      {
        "paragraph": "“You rascal.” After Nathan glared at Ryan, he smiled and said to Freya, “Ryan’s not wrong. Relax.\nSince you’ve moved into the official residence, we’re family. You can say whatever you want.”"
      },
      {
        "paragraph": "Freya was touched upon hearing his words. She asked, “Sarah has done so many evil things. Is there\nreally no way to catch her?”"
      },
      {
        "paragraph": "After a moment of silence, Nathan said, “I do believe you. I believe that Sarah is an evil woman too.\nHowever, as the prime minister, my words represent the country’s law. The law emphasizes evidence.\nIf there’s no evidence from your side, the police can’t apprehend Sarah.”"
      }
    ]
  },
  {
    "title": "Chapter 1967 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya was utterly disappointed."
      },
      {
        "paragraph": "“My dad can’t arrest people by force, ” Ryan explained. “We’re not sure how much Rodney is willing to\ngo for Sarah either. If Rodney spreads the word that my dad abused his status as a prime minister to\nrandomly arrest others after we catch Sarah, it’ll leave an unerasable stain on my dad’s career. In the\nnext election, some politicians will surely use this to defame my dad.”"
      },
      {
        "paragraph": "Freya tightened her grip on the fork and knife. Rodney. It was Rodney again."
      },
      {
        "paragraph": "“I’m sorry. Actually, Shaun personally contacted  me regarding your question as well.” Nathan sighed. “\nHowever, I told him that although I won’t make a move in this matter, I can turn a blind eye."
      },
      {
        "paragraph": "Therefore, I asked him to figure it out himself.”"
      },
      {
        "paragraph": "Freya’s eyes lit up. She understood his meaning."
      },
      {
        "paragraph": "After breakfast, Heidi said, “Yesterday, Rodney kept making a fuss at the gates, wanting to come in. I\ndidn’t let him in, but I think he’ll still come over."
      },
      {
        "paragraph": "You should hide in the official residence for the next few days.”"
      },
      {
        "paragraph": "Freya was in a dilemma. “But I was planning to go to the wedding planner to deal with the cancelation\nof the wedding…”"
      },
      {
        "paragraph": "Ryan was about to head out. As he put on his suit, he said nonchalantly, “It’s not a big deal. I’ll help you\nto do it.”"
      },
      {
        "paragraph": "“Let Ryan do it.” Heidi nodded. “You’re still inexperienced in taking care of these matters. It’s easy to\nget blackmailed if the problem is not properly dealt with.”"
      },
      {
        "paragraph": "Freya understood. If the other party took advantage of the fact that it was a shameful matter and\ndemanded unreasonable compensation, she would be uncomfortable if she had to compensate too\nmuch."
      },
      {
        "paragraph": "Therefore, she accompanied Dani and stayed in the official residence for the next few days without\ngoing anywhere else."
      },
      {
        "paragraph": "Just then, something awkward happened. When Freya was breastfeeding Dani, the sound of footsteps\ncould be heard at the door."
      },
      {
        "paragraph": "She thought it was Aunty Loretta who came. After all, this building was her and Dani’s little haven."
      },
      {
        "paragraph": "However, when she turned her head back and saw Ryan walking in wearing a tailored suit, she was so\nshocked and awkward. She instinctively wanted to cover herself with her clothes but once she moved,\nDani started crying in dissatisfaction as she was not full yet."
      },
      {
        "paragraph": "Freya could only… continue feeding Dani."
      },
      {
        "paragraph": "Ryan simply walked in and put an intricate little box on the tabletop in front of Freya. Then, he glanced\nat her with a calm gaze. “My colleague’s"
      },
      {
        "paragraph": "wife runs a cake shop, so he gave me some. Try it.”"
      },
      {
        "paragraph": "Freya was blushing madly, and her face felt hot."
      },
      {
        "paragraph": "It was the first time she breastfed in front of a man aside from Rodney."
      },
      {
        "paragraph": "Nevertheless, she still had to act calm and not let Ryan sense that she was embarrassed."
      },
      {
        "paragraph": "Moreover, Ryan looked at ease in front of Freya too as if she was just carrying the child. If she were to\navoid him, the situation would turn ambiguous."
      },
      {
        "paragraph": "“Thank you. But… I’m on a diet.” Freya forced herself to say that."
      },
      {
        "paragraph": "“Diet?” Not only did Ryan not move his gaze away but he even eyed her from top to bottom. “You ate a\nlot in the past two nights even though you’re on a diet.”"
      },
      {
        "paragraph": "That was because the official residence’s meals were too delicious."
      },
      {
        "paragraph": "Also… could Ryan stop standing in front of her?"
      },
      {
        "paragraph": "“Uhm… Can you move away? Now isn’t a good time for me.” Freya could not bear it in the end."
      }
    ]
  },
  {
    "title": "Chapter 1968 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Ryan stared at Freya’s blushing face. He suddenly laughed. “So you’re  feeling  embarrassed.  This\nisn’t a big deal. When I was studying abroad, I saw plenty of foreign women breastfeeding in public at\nthe stations.”"
      },
      {
        "paragraph": "That was another country and not Australia."
      },
      {
        "paragraph": "Moreover, Freya was a young girl from the new generation. She was easily embarrassed."
      },
      {
        "paragraph": "“But… I still respect women.”"
      },
      {
        "paragraph": "Ryan patted her head as he smiled. Then, he turned around and left."
      },
      {
        "paragraph": "Freya touched the spot on her head where he had patted her just now. It felt weird."
      },
      {
        "paragraph": "However, she did not think too much of it."
      },
      {
        "paragraph": "After breastfeeding, Freya unboxed the cake that Ryan brought over. It was not very big, just a small\nslice. She took a bite of it, and it was unexpectedly tasty. The taste was similar to the authentic French"
      },
      {
        "paragraph": "desserts that she had when she was working overseas."
      },
      {
        "paragraph": "However, the cake was too small. After finishing the slice, she was left wanting more."
      },
      {
        "paragraph": "Therefore, Freya sent Ryan a WhatsApp message. [ What’s the name of the cake shop that belongs to\nyour colleague’s wife? Is there a contact number for the shop? The cake is pretty delicious.]"
      },
      {
        "paragraph": "Ryan: [Aren’t you on a diet?]"
      },
      {
        "paragraph": "Could a woman be taken seriously when she said she was on a diet? Hmph."
      },
      {
        "paragraph": "Freya: [I’ll only have the energy to go on a diet after I’m full.]"
      },
      {
        "paragraph": "Ryan sent an animated WhatsApp sticker that wrote ‘That makes sense’ to her. [I don’t have to ask my\ncolleague. The cake shop is just beside my office. If you want to eat it, I’ll bring it back for you. Besides,\nthe gates of the official residence are heavily guarded. Commoners won’t dare to send things over.]"
      },
      {
        "paragraph": "Freya thought he had a point there."
      },
      {
        "paragraph": "The official residence was different from the previous villa she lived in. People would not dare to deliver\ndesserts over even if she placed an order."
      },
      {
        "paragraph": "Every person who came near the gates of the official residence had to be checked as there might be\nspies among those people."
      },
      {
        "paragraph": "Freya: [But will I be troubling you?]"
      },
      {
        "paragraph": "Ryan: [It’s alright. I usually like to feed little pigs when I’m free anyway.]"
      },
      {
        "paragraph": "Freya let out an angry laugh. Ryan was indirectly mocking her."
      },
      {
        "paragraph": "She replied furiously: [Very well, Ryan. You’re dead meat.]"
      },
      {
        "paragraph": "Ryan immediately sent a WhatsApp sticker of someone kneeling to apologize."
      },
      {
        "paragraph": "Freya visualized the scene of Ryan, the big shot, serving her a cup of tea as he knelt before her. She\nwas entertained."
      },
      {
        "paragraph": "It was pretty amusing."
      },
      {
        "paragraph": "Freya continued staying at home for a few more days. After Dani had gotten used to life at the official\nresidence, Freya went to the cosmetics company to work."
      },
      {
        "paragraph": "Wasting time every day and not working was not a good idea. She could not avoid Rodney forever\neither."
      },
      {
        "paragraph": "The first day she went to the company, she held an important meeting. After that, she went to the\nlaboratory and started developing products."
      },
      {
        "paragraph": "Although there was a team in the laboratory, they were not as skilled as her."
      },
      {
        "paragraph": "Freya was busy until 4:00 p.m. She was about to get off work and had just stepped out of the elevator."
      },
      {
        "paragraph": "Suddenly, a horde of reporters rushed over."
      }
    ]
  },
  {
    "title": "Chapter 1969 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Miss Lynch, I heard that you’re planning to divorce Rodney Snow. Is that true?”"
      },
      {
        "paragraph": "“I heard that you both have decided to hold a wedding at the end of the year, but now it’s canceled.\nMay I ask why you two are getting a divorce? You guys seemed to be very in love before.”"
      },
      {
        "paragraph": "“Is it because Rodney has betrayed you? Or is it because you have another man?”"
      },
      {
        "paragraph": "“What will happen to the child if you and Rodney are divorced? Will you be chased out of the Snow\nfamily and no longer be the goddaughter of the prime minister?”"
      },
      {
        "paragraph": "“That’s right. After all, everyone knows that the prime minister only took you in as his goddaughter\nbecause you were pregnant with Rodney’s child back then.”"
      },
      {
        "paragraph": "A series of questions were asked. Freya, who had just come out of the laboratory, was utterly\nconfused."
      },
      {
        "paragraph": "She did not even know why those reporters would come over all of a sudden."
      },
      {
        "paragraph": "She should have brought someone with her if she had known."
      },
      {
        "paragraph": "Freya was caught off guard."
      },
      {
        "paragraph": "She lost her balance because someone bumped into her. Moreover, she was wearing high heels, so\nshe fell to the ground."
      },
      {
        "paragraph": "Reporters were like that. When they saw someone who used to be on the top about to get a divorce\nand was in distress, they would not show that person too much sympathy. On the contrary, they would"
      },
      {
        "paragraph": "think the miserable state of that person would give them a juicier piece of news. They had even thought\nof the headlines already."
      },
      {
        "paragraph": "They were not afraid of offending the prime minister’s office."
      },
      {
        "paragraph": "Since Rodney and Freya were about to be divorced, Freya would be nothing in Canberra after losing\nthe support of the Snow family."
      },
      {
        "paragraph": "Freya was exasperated. She had been knocked over, yet none of those reporters came to help her up."
      },
      {
        "paragraph": "They kept taking pictures of her."
      },
      {
        "paragraph": "She wanted to stand up, but a reporter even pushed his way to Freya’s front and took close-up pictures\nof her."
      },
      {
        "paragraph": "“Go away.” Freya was infuriated. She hit the camera out of the way. “You guys are simply bombarding\nme with questions and taking photos as you wish. Are all of you even qualified to be reporters?”"
      },
      {
        "paragraph": "“Miss Lynch, once Rodney leaves you and you lose the backing of the Snow family, do you still think\nyou can act as how you did before?” The reporter whose camera had been hit sneered. “You’d better\nbe careful. My camera is costly. It’s tens of thousands of dollars. You’ll have to compensate me if you\ndamage it.”"
      },
      {
        "paragraph": "“Then I won’t just hit the camera. I’ll even smash it.”"
      },
      {
        "paragraph": "A strong force yanked the male reporter away all of a sudden."
      },
      {
        "paragraph": "Ryan, who was wearing a black coat, snatched the camera from the man’s hands. Then, he threw it on\nthe ground without hesitation. The camera was smashed in half."
      },
      {
        "paragraph": "After recognizing Ryan’s handsome and ruthless expression, no one dared to say a word."
      },
      {
        "paragraph": "Who in the news industry would not recognize that face? Ryan was the prime minister’s biological son.\nThere were rumors that Prime Minister Snow was showing his son his full support in becoming the\nyoungest prime minister of Australia. Ryan had even become a senator at such a young age."
      },
      {
        "paragraph": "No one dared to underestimate Ryan because of his young age."
      },
      {
        "paragraph": "After all, everything that he had done in the political world was unrelated to his age."
      },
      {
        "paragraph": "Even the older politicians who were 50 or 60 years of age did not dare to go against him."
      },
      {
        "paragraph": "Freya was stunned too. She did not expect that Ryan would appear here. Was he not supposed to be\nin the office at this time?"
      },
      {
        "paragraph": "Besides, she was used to Ryan’s calm and elegant demeanor. As he was not smiling right now, it was\nas if there was ice in his eyes. She could really feel the same aura that was on Prime Minister Snow\ncoming from Ryan."
      },
      {
        "paragraph": "“Didn’t you want compensation? I’ll pay you back.” Ryan took a card out of his wallet and shoved it into\nthe male reporter’s pocket. Then, he gave him a clean punch. “Oh, I forgot to tell you that your medical\nfees are included as well.”"
      },
      {
        "paragraph": "That male reporter was trembling. He was so scared that he remained sprawled on the ground and did\nnot dare to get up. He was afraid that he would continue getting punched by Ryan if he got up. “You…\nYou can’t hit me. I didn’t do anything wrong. I was just conducting a normal interview.”"
      },
      {
        "paragraph": "“A normal interview?” Ryan pulled another reporter’s camera over and pressed the lens against the\nface of the male reporter who was on the ground. “Do you think this is a normal interview?”"
      },
      {
        "paragraph": "The male reporter’s face flushed red. He did not dare to say a word. The surrounding reporters did not\ndare to voice out their dissatisfaction either."
      }
    ]
  },
  {
    "title": "Chapter 1970 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Did people not say that Freya would not have the backing of the prime minister’s family after she and\nRodney divorced? Why was the prime minister’s son helping her even now?"
      },
      {
        "paragraph": "Those reporters regretted it badly."
      },
      {
        "paragraph": "They initially wanted to get a piece of breaking news, yet they offended someone instead."
      },
      {
        "paragraph": "Ryan smashed another camera on the spot. His sharp gaze swept across those reporters. “I meet local\nand foreign reporters every day. However, this is the first time I’ve seen reporters like you bunch who\nhave no standards at all. Are most of the reporters in Australia like all of you? Or are you guys the\nproblematic ones? Do I have to get the Department of Communications to check whether you’re all\nqualified to be reporters?”"
      },
      {
        "paragraph": "“Senator Snow, we were wrong.”"
      },
      {
        "paragraph": "A female reporter stepped forward and stammered, “We were just too impatient.”"
      },
      {
        "paragraph": "Ryan went to Freya’s side and helped her up from the ground. Then, he replied to the female reporter,\n“You’re not impatient. You guys just like to add insult to injury. You all think that since Freya and\nRodney are about to divorce, she’ll lose the protection of the Snow family. Therefore, you don’t have to\nbe respectful to her anymore and can even mock her without fear.”"
      },
      {
        "paragraph": "Those reporters’ faces were flushing because they felt mocked by Ryan’s sharp words."
      },
      {
        "paragraph": "Freya’s heart stirred."
      },
      {
        "paragraph": "Although she had already experienced the fickleness of human feelings, Ryan’s words still made her\nfeel like she was being protected."
      },
      {
        "paragraph": "Ryan stared at those people sharply. “I’m telling you. Even if Freya divorces Rodney in the future, she’s\nstill someone who’s under the protection of the prime minister’s office and is the prime minister’s\ngoddaughter.”"
      },
      {
        "paragraph": "It was a simple sentence, yet it shocked all the reporters."
      },
      {
        "paragraph": "There was too much information in that one sentence. Firstly, Freya and Rodney might really get a\ndivorce. Secondly, even if Freya divorces Rodney, her identity and status as the prime minister’s\ngoddaughter would not change."
      },
      {
        "paragraph": "However, the reporters had come over and troubled the prime minister’s goddaughter."
      },
      {
        "paragraph": "All of them were ashen-faced. They even felt like dying."
      },
      {
        "paragraph": "That male reporter who was lying on the ground was trembling hard. He quickly looked at Freya with a\npleading gaze. “Miss Lynch, I was in the wrong just now. I’m sorry. Please forgive me.”"
      },
      {
        "paragraph": "He got on his knees and bowed with his forehead on the ground."
      },
      {
        "paragraph": "“What are you doing? Get up.” Freya was flustered."
      },
      {
        "paragraph": "She hated people who simply kneeled and bowed the most. It seemed like he would keep doing that if\nshe did not forgive him. If word got out, the outsiders would say that she was abusing her power to\nbully people."
      },
      {
        "paragraph": "More importantly, they were outside. Luckily, it was not the time to get off work yet, so there were very\nfew people around."
      },
      {
        "paragraph": "However, that reporter did not listen to her at all. He kept bowing his head."
      },
      {
        "paragraph": "Ryan asked coldly, “You don’t even have to bow your head to the prime minister, yet you’re doing that\nwhen you see us. Are you trying to force the"
      },
      {
        "paragraph": "Snow family to establish a monarchy?”"
      },
      {
        "paragraph": "The male reporter was utterly shocked when such a grave accusation was thrown at him."
      },
      {
        "paragraph": "Ryan sneered. He pulled Freya to his car that was parked by the roadside."
      },
      {
        "paragraph": "Freya was in a daze all the way there. When she recalled the reporters’ expressions, it seemed that\nthey were terrified with just a single sentence from Ryan."
      },
      {
        "paragraph": "She could not help but secretly glance at Ryan’s handsome face. She remembered she had even\nwarned him that he was dead meat on Whatsapp a few days ago."
      },
      {
        "paragraph": "Who exactly was Ryan?"
      }
    ]
  },
  {
    "title": "Chapter 1971 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Ryan was Freya’s brother in name."
      },
      {
        "paragraph": "However, he was also a senator, a figure that made people fear him."
      },
      {
        "paragraph": "Screech."
      },
      {
        "paragraph": "There was the sound of tires skidding. A limited- edition sports car stopped in front of Freya and Ryan."
      },
      {
        "paragraph": "Rodney hurried down the car. He heard some media had found out that he and Freya had canceled the\nwedding. He was afraid those reporters would not dare to look for him and would look for Freya\ninstead."
      },
      {
        "paragraph": "However, he did not expect that he would see Ryan holding Freya’s hand when he arrived. They were\nabout to get in the car."
      },
      {
        "paragraph": "Freya was following Ryan with an obedient look. She did not have the haughty expression that she\nusually showed Rodney."
      },
      {
        "paragraph": "With just a glance, that scene triggered Rodney intensely."
      },
      {
        "paragraph": "“Ryan, you bastard.  I knew none of your words were true.” Rodney threw a punch after he rushed\nover."
      },
      {
        "paragraph": "Ryan’s eyes gleamed. Actually, he could have dodged the punch."
      },
      {
        "paragraph": "In that split second, he pulled Freya behind him and took the punch."
      },
      {
        "paragraph": "Seeing that Ryan, who had helped her just now, was hit, Freya shouted angrily, “Rodney, are you\ncrazy? You hit Ryan.”"
      },
      {
        "paragraph": "She charged forward and hit Rodney with her bag."
      },
      {
        "paragraph": "The bag cost tens of thousands of dollars. It was huge, and getting struck by it would hurt a lot."
      },
      {
        "paragraph": "After getting hit once, Rodney quickly protected his face. Catherine had just hit him on the face with her\nbag a few days ago. Freya and Catherine were truly sisters. Even their style of hitting people was the\nsame."
      },
      {
        "paragraph": "“Don’t you know why I hit Ryan? Freya, you’re my wife, yet you’re holding another man’s hands."
      },
      {
        "paragraph": "We’re not divorced yet!”"
      },
      {
        "paragraph": "Rodney grabbed the opportunity and snatched Freya’s bag. He said furiously, “No wonder you kept\nnagging about divorcing me. You even moved to the"
      },
      {
        "paragraph": "official residence. I guess you must’ve fallen for Ryan, right? Are you thinking of becoming the prime\nminister’s wife because you believe he’ll become Australia’s prime minister in the future?”"
      },
      {
        "paragraph": "Freya widened her eyes. Were Rodney’s words still sane? He thought of others so badly. Ryan was his\ncousin."
      },
      {
        "paragraph": "Before she could say anything, Ryan warned with a cold expression. “Rodney, we’re in public, and our\nidentities are special. Can you be more rational with your words? Freya was surrounded by those\nreporters just now, so I rushed over to help her. I simply pulled her hand when I was bringing her away.”"
      },
      {
        "paragraph": "“Did you have to hold her hand if you were only bringing her away? Just be frank that you wanted to\ntake advantage of her.”"
      },
      {
        "paragraph": "Ryan was an eyesore to Rodney anyway. “Other people might not know you well, but how can I not\nunderstand you when I grew up with you? You’ re like a smiling tiger. You look honest, but you’ve been\na wicked person since young. If you don’t have any feelings for Freya, why are you helping her to get a\ndivorce? Could she have been able to persuade your parents with her mere abilities? You must’ve\nhelped her behind the scenes as well.”"
      },
      {
        "paragraph": "Ryan raised his finger and wiped the wound on the corner of his mouth. “Rodney, as humans, we\nshould have a conscience. When you were a good person and treated Freya well, I sincerely hoped\nthat you guys would have a good relationship."
      },
      {
        "paragraph": "However, you’re not doing a good job as a husband anymore. I can’t go against my conscience and\nhelp you just because you’re my brother. After all, Freya is my family too.”"
      },
      {
        "paragraph": "“She’s just your sister-in-law, ” Rodney said angrily, “Your relationship as a family was established\nbecause of me.”"
      },
      {
        "paragraph": "Freya frowned. She understood what Rodney’s words meant. He meant that if it were not for him, she\nwould not have been able to form a connection with Nathan and his family."
      },
      {
        "paragraph": "She knew it herself, but Rodney’s words made her heart grow cold."
      },
      {
        "paragraph": "However, what right did she have to speak? What Rodney said were facts."
      }
    ]
  },
  {
    "title": "Chapter 1972 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Ryan patted Freya’s shoulder to soothe her. He said, “It might’ve been that way at first, but there has to\nbe fate between people as well. After interacting with her, my parents thought Freya was nice, so they\nwillingly took her in as their goddaughter. My mom also believed that there was fate between them.\nOtherwise, why did they help Freya at the end instead of you?”"
      },
      {
        "paragraph": "After pausing for a moment, Ryan added, “Rodney, the reporters were asking the same things that you\nwere saying just now. Many outsiders are gossiping about it as well. No wonder other people don’t\nrespect Freya whenever she goes out. To be frank, isn’t it because you, her husband, have those same\nthoughts as well? That it’s only because of you that she has her current identity in Canberra?”"
      },
      {
        "paragraph": "Freya silently agreed with Ryan’s words."
      },
      {
        "paragraph": "At the same time, he made her feel supported."
      },
      {
        "paragraph": "In the past, Freya’s interactions with Rodney were shallow. Even in her heart, she believed that with his\nstatus, Rodney would not fall for her."
      },
      {
        "paragraph": "Therefore, she never thought of getting close to him."
      },
      {
        "paragraph": "It was different now. She really treated Ryan as her family."
      },
      {
        "paragraph": "Rodney gritted his teeth upon hearing Ryan’s words. He was ashamed. “Ryan, don’t talk nonsense"
      },
      {
        "paragraph": "It’s not like what you said. I had enough of you. Why do you keep driving a wedge between Freya and\nme? You’re trying to quicken our divorce and reap the benefits from it, right? In your dreams."
      },
      {
        "paragraph": "The Snow family won’t agree. Your parents won’t either. This is incest.”"
      },
      {
        "paragraph": "“Your words are getting ridiculous.”"
      },
      {
        "paragraph": "Freya had the urge to slap Rodney across his face. “ There’s nothing going on between Ryan and me.\nDon’t think that everyone is as dirty as you.”"
      },
      {
        "paragraph": "“I’m dirty?” Rodney clenched his fists tightly."
      },
      {
        "paragraph": "Freya could not be bothered to fight with him. “ Rodney, if I were you, I’d proceed with the divorce\nprocedures as soon as possible. I already said that I’ve made up my mind. If you want to drag this on,\nI’ll have no choice but to file for a divorce. You won’t be willing to let Sarah carry the bad reputation as\na home-wrecker, right?”"
      },
      {
        "paragraph": "“Sarah isn’t a home-wrecker. How many times do I have to say this?” Rodney retorted. “You can’t insult\npeople without reason.”"
      },
      {
        "paragraph": "“Insult?” Freya laughed. “ If so, I’ll let the public decide. My husband is spending money to shelter his\nex-girlfriend. Oh, by the way, he’s also planning to spend money to send her overseas and plan out her\nfuture life. He’ll even give her a sum of money as compensation. I don’t think other husbands or wives\nhave such good treatment even when they divorce. Let’s see if the public will scold you or praise you\nfor being righteous.”"
      },
      {
        "paragraph": "“That’s because Sarah sacrificed a lot for me— ”"
      },
      {
        "paragraph": "“Did she accompany you to start your career or go through hardships with you? Or did she give you\ncompany shares?” Freya interrupted Rodney sharply. “She didn’t do any of these, right? What you\nhave today was built upon the foundation that your parents and ancestors laid down for you. You didn’t\nthank your parents and grandparents, but you’re grateful toward Sarah instead. Do you still refuse to\nadmit it when I say that there’s something wrong with your brain?”"
      },
      {
        "paragraph": "Rodney’s lips moved. It was a rare moment that even his mind was stunned from being criticized."
      },
      {
        "paragraph": "“I really hope my child won’t be like you in the future.” There must be a hole in Rodney’s brain."
      },
      {
        "paragraph": "Freya pulled Ryan into the car after she spoke."
      },
      {
        "paragraph": "“Wait…”"
      },
      {
        "paragraph": "Rodney chased after them."
      },
      {
        "paragraph": "Ryan had quick reflexes. He stood in front of Freya."
      },
      {
        "paragraph": "Rodney glared at Ryan viciously. “Move away. Are you asking for another punch?”"
      },
      {
        "paragraph": "“Rodney, I was just caught off guard just now. If we are to fight each other, it’s not likely that I’ll lose, ”\nRyan said calmly."
      },
      {
        "paragraph": "Rodney choked."
      }
    ]
  },
  {
    "title": "Chapter 1973 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rodney knew that his cousin had been clever since young. Ryan even got admitted to a top university\noverseas. Not only that, he had obtained certificates in various types of martial arts when he was\nabroad."
      },
      {
        "paragraph": "Rodney calmed down and said furiously, “Freya, if you want to get a divorce, I’ll fight you till the end for\nthe child’s custody rights. I don’t care what Grandpa has promised you. I won’t hand Dani over to you.”"
      },
      {
        "paragraph": "Matters that involved children were always the final straw between husband and wife."
      },
      {
        "paragraph": "Freya was utterly infuriated. “You told me to abort the child when I was pregnant back then, but now\nyou’re fighting me for the child’s custody rights. Do you know no shame? When the child was not\nfeeling well and crying a few days back, you were with Sarah the whole night. You have no right to take\ncare of Dani at all.”"
      },
      {
        "paragraph": "“Why don’t I have the right? My blood flows in the child too. Besides, I do well on usual days except for\nthat particular night. Dani relies on me a lot too."
      },
      {
        "paragraph": "Usually, I’m the one who coaxes Dani to sleep. The nanny can be the witness to this.”"
      },
      {
        "paragraph": "Rodney did not want to go that far. However, he truly did not want to get a divorce. He could only make\nthreats using the child. “Moreover, my family is in Canberra, and my financial status is better than\nyours. If we were to bring this to the court, the chances of me winning are higher. You said I’m having\nan affair, but you have no evidence.”"
      },
      {
        "paragraph": "Freya glared at him hatefully."
      },
      {
        "paragraph": "The child was her limit. At that moment, they did not have an ounce of feelings between them anymore.\nThere was only hatred."
      },
      {
        "paragraph": "Rodney was sad from Freya’s stare. Even when they had huge fights in the past, she would not look at\nhim this way. He softened his tone. “Freya, why do you have to do this? As long as we don’t get a\ndivorce, the child is still yours. Dani would hope that her parents stay together too.”"
      },
      {
        "paragraph": "Freya trembled."
      },
      {
        "paragraph": "She did not listen to what Rodney said toward the end."
      },
      {
        "paragraph": "She was utterly enraged."
      },
      {
        "paragraph": "To her, it was as if Rodney was snatching the child that she had painstakingly given birth to."
      },
      {
        "paragraph": "What would he do after he snatched Dani away? Give her to Sarah?"
      },
      {
        "paragraph": "Dani was Freya’s child. That evil woman would never treat Dani well."
      },
      {
        "paragraph": "“Rodney, don’t be so sure about this.”"
      },
      {
        "paragraph": "Ryan’s voice sounded heavenly. “Even if there’s a lawsuit, it’s not definite that the judge will grant you\nthe child’s custody rights if there’s the prime minister’s office supporting Freya. You’re indeed very\ncareful. Sarah isn’t staying in a property that’s under your name now. However, when we go to court,\nwe can get the people who used to be your closest friends to be witnesses, like Shaun and Chester.\nBesides, you must be unfamiliar with Australia’s law. The judge will usually give the child’s custody\nrights to the mother for children below three years old. After all, Freya’s financial situation is pretty good\ntoo. Actually, you don’t stand a chance of winning,” Ryan said."
      },
      {
        "paragraph": "Rodney’s pretty and handsome face was so angry that it looked as if it was cracking. “Ryan, do you\nhave to go against me? Think clearly. Although you have your dad’s help, you can’t lose the support of"
      },
      {
        "paragraph": "Snow Corporation if you want to advance further in the future.”"
      },
      {
        "paragraph": "In the Snow family, Nathan’s family possessed influence."
      },
      {
        "paragraph": "Jason’s family had money. The future development of Snow Corporation was slowly being handed to\nRodney. Therefore, he had the qualifications to say those words."
      },
      {
        "paragraph": "Money and influence complemented each other."
      },
      {
        "paragraph": "Ryan smiled and did not say a word. After letting Freya get in the car, he started the car and left."
      },
      {
        "paragraph": "Freya sat in the passenger seat. She saw Rodney standing at the same spot and kicking the lamp post\nout of anger from the rearview mirror."
      }
    ]
  },
  {
    "title": "Chapter 1974 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya could not understand it."
      },
      {
        "paragraph": "No matter how awful Rodney was in the past, she thought that he still had some good traits."
      },
      {
        "paragraph": "How did things turn out like this?"
      },
      {
        "paragraph": "“ I’m sorry.” Freya glanced at Ryan while feeling depressed. “If there’s really a need to file for a divorce,\nI’ll solve the problem myself.”"
      },
      {
        "paragraph": "She did not want Ryan and Rodney’s relationship to turn awkward. She did not want to hold him back\nfrom his future either."
      },
      {
        "paragraph": "Freya was well aware of Ryan’s capabilities. It was highly possible that he would become Australia’s\nyoungest prime minister in the future."
      },
      {
        "paragraph": "“It’s okay. You don’t have  to take  Rodney’s words  to heart, ” Ryan said nonchalantly."
      },
      {
        "paragraph": "“But…”"
      },
      {
        "paragraph": "“Some things aren’t that simple. ” Ryan reminded her. “The situation with Snow Corporation is quite\ndifferent from my dad’s side. My uncle has three"
      },
      {
        "paragraph": "children.”"
      },
      {
        "paragraph": "Freya said, “But didn’t you say that the subsidiary that Rodney has will be the largest development\nproject in the future?”"
      },
      {
        "paragraph": "After a moment of silence, Ryan glanced at her. “ So… if you happen to meet Jessica,  you can act\npitiful.”"
      },
      {
        "paragraph": "Freya understood in an instant. Her heart trembled."
      },
      {
        "paragraph": "Although she did not want to admit it, Ryan’s thoughts made her have mixed feelings at that moment.\nSure enough, no one with such a status could have simple thoughts."
      },
      {
        "paragraph": "“Of course, if you believe in me, you don’t have to care about the child’s custody rights or anything\nelse, ” Ryan said. “This matter is nothing hard for me.”"
      },
      {
        "paragraph": "“Really?” Freya bit her lip and looked at him with complicated feelings. “Ryan, why are you helping me\nout so much? Rodney is the one who’s my— ”"
      },
      {
        "paragraph": "Ryan interrupted her. “Actually, anyone who has eyes will be able to see that Rodney is at fault in this\nmatter. My uncle and the rest even conceded to let you take care of Dani. Everyone is afraid that\nRodney will let Sarah take care of the child as her stepmother after getting Dani’s custody rights. No\none trusts Sarah. Freya, the Snow family members"
      },
      {
        "paragraph": "might have their own thoughts, but we’re sincere about the child. Dani is my niece too. If one step goes\nwrong, it might ruin the child’s entire life."
      },
      {
        "paragraph": "“People should do what is right and not what is wrong.”"
      },
      {
        "paragraph": "Freya wavered."
      },
      {
        "paragraph": "That was right. No matter what Ryan was scheming, he had his limits too."
      },
      {
        "paragraph": "“If it weren’t for Dani and me, you and Rodney wouldn’t have to—”"
      },
      {
        "paragraph": "“You’re my family. It’s my duty to protect you. ” Ryan cut her off."
      },
      {
        "paragraph": "Looking at the young, handsome man who was driving, Freya was touched. She felt embarrassed too.\n“But I haven’t done anything. How could you consider me your family?”"
      },
      {
        "paragraph": "Ryan raised his eyebrows. He said playfully, “You got a point there. Should I stop treating you as a\nfamily member—”"
      },
      {
        "paragraph": "“Ryan.” Freya quickly interrupted him with a stern face.  “You can’t  go back on your word. A person\nwith a status like yours should be a man of his word.”"
      },
      {
        "paragraph": "“Ah, okay. Since you said so, I can only accept my fate.” Ryan sighed, feeling a headache."
      },
      {
        "paragraph": "Seeing him acting that way, Freya could not resist pinching him on his arm."
      },
      {
        "paragraph": "“Ow, it hurts,” Ryan howled."
      },
      {
        "paragraph": "“ I only pinched you lightly.” Freya was startled by his voice."
      },
      {
        "paragraph": "“My mouth hurts, Sis, ” Ryan said."
      },
      {
        "paragraph": "Freya’s lips curved. “Alright. Since you called me ‘ Sis’, I’ll go through the trouble and buy some\nmedicine for you.”"
      },
      {
        "paragraph": "“Hey, I got hit for your sake, okay?” Ryan put on an innocent expression."
      },
      {
        "paragraph": "Speaking of that, Freya started feeling guilty. She could not help but scold Rodney, that lunatic, in her\nheart again."
      },
      {
        "paragraph": "“Wait, there’s a pharmacy in front. Stop here.” Freya quickly said."
      }
    ]
  },
  {
    "title": "Chapter 1975 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Ryan stopped the car by the roadside. Freya immediately ran down. Within a few minutes, she came\nout holding a bottle of medication."
      },
      {
        "paragraph": "Ryan started the car right away. Freya complained, “ Why are you in such a hurry? You haven’t applied\nthe medication yet.”"
      },
      {
        "paragraph": "“Eldest Young Lady Lynch, didn’t you see there was a ‘No Stopping’ sign by the roadside?” Ryan said\nwith a resigned tone."
      },
      {
        "paragraph": "Freya was stunned. She did not notice that. “Were you fined when I was buying the medicine?”"
      },
      {
        "paragraph": "“Yes.” Ryan nodded."
      },
      {
        "paragraph": "Freya gave it some thought and immediately pushed the responsibility away. “You can’t blame it on me.\nWhy didn’t you say anything when you stopped the car?”"
      },
      {
        "paragraph": "“Yes, you’re right.” Ryan nodded his head obediently. “My mom taught me since I was young that I can’t\nquarrel with women.”"
      },
      {
        "paragraph": "Freya was satisfied. “Your mom’s education is correct. You’ll get a girlfriend soon with that attitude.”"
      },
      {
        "paragraph": "A hint of amusement flashed across Ryan’s eyes. “I have to drive. Can you help me apply the\nmedication? My mouth hurts.”"
      },
      {
        "paragraph": "Freya had no choice but to open the bottle of medicine and dip a cotton bud in it. She went near him to\napply the medication."
      },
      {
        "paragraph": "It was her first time looking at Ryan at such a close distance. His eyebrows were sharp, and his nose\nwas tall. There were no freckles or wrinkles on his skin. It was clear. It was a shame there was a wound\non his intricate lips."
      },
      {
        "paragraph": "However, they were still of the opposite genders. Freya felt embarrassed being so close to Ryan."
      },
      {
        "paragraph": "She applied the medication to the wound. It looked as if there was lipstick on one side of his lips. It was\nbright red."
      },
      {
        "paragraph": "Freya could not help bursting into laughter."
      },
      {
        "paragraph": "Ryan glanced at her while he was driving. He saw that her face was about to touch his shoulders. She\nwas also laughing like a sly little fox. Her beautiful face was vibrant."
      },
      {
        "paragraph": "He was in a daze for a moment. When he came back to his senses, he realized that there was a public\nbus in front of his car. He did not notice it and almost ran into it."
      },
      {
        "paragraph": "The car automatically stopped."
      },
      {
        "paragraph": "However, it was too abrupt. Freya’s whole body leaned forward and was about to hit the front."
      },
      {
        "paragraph": "Ryan instinctively reached out his hand to stop her momentum."
      },
      {
        "paragraph": "When the car stopped, both of them were dumbfounded."
      },
      {
        "paragraph": "Ryan was dumbfounded after stretching his hands out too hastily. His palm just so happened to touch\nthe right side of her chest. It looked like he was holding her breasts."
      },
      {
        "paragraph": "When Freya was breastfeeding last time, he did secretly take a glance. However, it could not compare\nto the feeling of touching them himself."
      },
      {
        "paragraph": "They were truly ample."
      },
      {
        "paragraph": "On the other hand, Freya was shocked that the medication she held in her hand spilled on Ryan’s arm\nand dirtied his coat."
      },
      {
        "paragraph": "“I’m sorry.”"
      },
      {
        "paragraph": "“I’m sorry.”"
      },
      {
        "paragraph": "Both of them spoke at the same time. Ryan quickly withdrew his hands. Freya also searched for tissue\nin a hurry to wipe his arm."
      },
      {
        "paragraph": "However, cars were honking and urging them from behind, so Ryan could only continue driving."
      },
      {
        "paragraph": "Freya felt remorseful as she wiped Ryan. “Oh no. This medication is too red. I don’t think it can be\nwashed off.”"
      },
      {
        "paragraph": "Ryan let out a breath of relief. Luckily, she did not notice that he had…"
      },
      {
        "paragraph": "Ahem. It was slightly awkward."
      },
      {
        "paragraph": "Although Ryan did not deny that he wanted to slowly woo her, Freya was not divorced yet. She was still\nher sister-in-law. He was not a person who would act rashly either. After all, he was only trying to let her\nget used to his presence beside her."
      },
      {
        "paragraph": "After she got a divorce, he could gradually take action."
      },
      {
        "paragraph": "That was why he did not want to alarm her yet."
      }
    ]
  },
  {
    "title": "Chapter 1976 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Never mind.”"
      },
      {
        "paragraph": "Ryan did not dare to be distracted anymore. He looked ahead and drove carefully."
      },
      {
        "paragraph": "Freya still felt guilty. “Why don’t I… buy you some clothes?”"
      },
      {
        "paragraph": "“You’ll have to give me a set of clothes.” Ryan laughed without holding back. “I think the shirt I’m\nwearing inside is wet too.”"
      },
      {
        "paragraph": "“Okay. A set of clothes it is.” Freya agreed to it generously. She was not short of money anyway. “ What\nsize do you wear?”"
      },
      {
        "paragraph": "“ Size L.” Ryan was not fat, but his body was buff, which was why he wore a size large."
      },
      {
        "paragraph": "Freya took a mental note. She was thinking of going to the mall tomorrow to go shopping."
      },
      {
        "paragraph": "When they were about to reach the official residence, Freya suddenly realized something. “By the way,\nwhy did you go to my place today? And how did the news of my divorce leak out? They even knew that\nwe had canceled the wedding. Didn’t you"
      },
      {
        "paragraph": "say that you handled it well when you were helping me to take care of this matter back then?”"
      },
      {
        "paragraph": "After asking, she suddenly noticed that it sounded like she was trying to hold Ryan accountable."
      },
      {
        "paragraph": "Therefore, she added, “Don’t misunderstand. I’m not blaming you. I’m just curious. You helped me out\nof kindness. I know that.”"
      },
      {
        "paragraph": "After the car was eerily silent for a while, Ryan chuckled strangely."
      },
      {
        "paragraph": "“Why are you laughing? Don’t take it to heart, ” Freya quickly said as she was afraid that he would be\nangry and overthink."
      },
      {
        "paragraph": "After entering the official residence and parking the car, Ryan rested his left hand on the steering\nwheel. He faced Freya with a resigned expression. “I could arrive in time today because I received\ninformation that the news of you and Rodney divorcing was leaked by the wedding studio you hired. I\nknow the characters of those reporters well, so I rushed over in a hurry. Also, before I rushed over, I\nkept calling you but you didn’t pick up.”"
      },
      {
        "paragraph": "Freya took her phone out. There were really two missed calls from Ryan. He had also sent her a\nmessage, telling her not to leave the company first and wait for him to pick her up."
      },
      {
        "paragraph": "She had switched her phone to silent mode when she was working in the laboratory. She had\ncompletely forgotten about it."
      },
      {
        "paragraph": "Okay, that was awkward."
      },
      {
        "paragraph": "She had personally dealt with the matters of the wedding studio. She even compensated them a sum\nof money. She thought it would be fine."
      },
      {
        "paragraph": "In the end, the wedding studio betrayed her yet she did not even realize it. She thought it was Ryan\nwho did not handle the matters with the wedding planner well."
      },
      {
        "paragraph": "If she could, she really wanted to crawl beneath the car."
      },
      {
        "paragraph": "Even if she was shameless, she still felt so awkward that her face flushed red at that moment. “I… I’m\nsorry. I thought…”"
      },
      {
        "paragraph": "“Miss Lynch, you shouldn’t doubt my ability to get things done. ” Ryan teased her while smiling. “On the\nother hand, your abilities to handle matters… Tsk tsk… You’re still lacking.”"
      },
      {
        "paragraph": "Freya cleared her throat. After rolling her pretty eyes, she said shamelessly, “It’s true that I’m\nincapable. I’m not a guy anyway. It’s okay even if I’m not good at such things.”"
      },
      {
        "paragraph": "Ryan was speechless. He only spoke after a long while, “Watch your words. There’s no need to make\nerotic jokes. I’m still a pure young man.”"
      },
      {
        "paragraph": "“Ahem. That’s impossible.” Freya was on the verge of crying out of frustration. She did not want to do\nthat either, but it was better than letting the awkward situation continue."
      },
      {
        "paragraph": "However, the next topic was awkward too. “At least I won’t make erotic jokes while I’m talking.” Ryan\nwas embarrassed. He could not say whether he was pure or not. Freya could test it out herself."
      }
    ]
  },
  {
    "title": "Chapter 1977 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“I didn’t make erotic jokes. There’s a saying among men. Guys can’t say that they’re incapable,” Freya\nsaid with a straight face."
      },
      {
        "paragraph": "“Are you sure… that you want to discuss this with me?” Ryan looked at Freya."
      },
      {
        "paragraph": "If it was possible, Freya wanted to hit her head and die."
      },
      {
        "paragraph": "Ryan was right. She was a woman who was not divorced yet. Why was she discussing that question\nwith her godbrother?"
      },
      {
        "paragraph": "Was she crazy?"
      },
      {
        "paragraph": "Seeing that Freya’s face was as red as an apple, Ryan changed the topic. “ I’ve asked around. The\nwedding studio’s boss accepted your compensation. Although it was a verbal agreement, he must’ve\nthought that you and Rodney were getting divorced. He didn’t care much about it and leaked the\ninformation as he was currying favor with another big boss. That was why the news traveled to the\nreporters’ ears. Although I’ve stopped the news from spreading around the internet in time, there must\nalready be some rumors in Canberra. Be careful.”"
      },
      {
        "paragraph": "“Ryan, thank you.”"
      },
      {
        "paragraph": "Freya was very grateful. Ryan indeed took care of everything properly. “Just now, if you hadn’t come in\ntime— ”"
      },
      {
        "paragraph": "“Remember to keep your phone reachable at all times.” Ryan interrupted her. His gaze was gentle. “ Of\ncourse, you don’t have to worry. Those reporters won’t trouble you anymore.”"
      },
      {
        "paragraph": "Freya was puzzled.  “What  are you planning  to do?”"
      },
      {
        "paragraph": "“ Since they’re not qualified to be reporters, they don’t have to be reporters anymore,” Ryan spoke\ncasually as if he was discussing that day’s weather."
      },
      {
        "paragraph": "However, Freya strangely felt that he looked… pretty cool."
      },
      {
        "paragraph": "Nevertheless, the more Ryan stood up for her, the more she felt like she owed him."
      },
      {
        "paragraph": "The next day, Freya invited Catherine to go shopping."
      },
      {
        "paragraph": "At first, Catherine thought Freya was buying clothes for herself. When they walked into a men’s\nclothing store, Catherine said, “Shaun doesn’t need clothes. He has too many of them.”"
      },
      {
        "paragraph": "“I’m not asking you to buy clothes for Shaun. I dirtied Ryan’s clothes yesterday. I have to compensate\nhim.” Freya eyed the clothes in the store."
      },
      {
        "paragraph": "She found those clothes too fashionable. Ryan worked in the government’s office. He usually dressed\nquite maturely."
      },
      {
        "paragraph": "“Ryan?” Catherine teased Freya. “It looks like your relationship with him isn’t bad.”"
      },
      {
        "paragraph": "“He’s a nice person. If it weren’t for him, Prime Minister Snow and his wife wouldn’t have helped me so\nmuch. The Snow family wouldn’t have agreed to me divorcing Rodney either.” Freya told Catherine\nabout the incident with the reporters yesterday."
      },
      {
        "paragraph": "Catherine lamented, “It seems like Ryan has positive values. Ah, he’s Rodney’s cousin, but why\ndoesn’t Rodney have such good values? If only you had married Ryan back then. You would’ve been\nthe perfect match.”"
      },
      {
        "paragraph": "Freya tsked. “How could the heavens possibly let me be so lucky? Nice guys are always taken.\nBesides, don’t talk like that anymore. Ryan is my brother in name now.”"
      },
      {
        "paragraph": "Catherine sighed. “Speaking of this, your brothers are all pretty good. Forrest is mature and steady.\nAlthough he hasn’t married yet, he’s not flirty."
      },
      {
        "paragraph": "Ryan’s personality isn’t bad too. I interacted with him before when I was in a miserable state. He wasn’t\narrogant at all. Shaun also said that Ryan… isn’t simple. He’ll most probably  surpass his father in the\nfuture.”"
      },
      {
        "paragraph": "“No way.” Freya was startled. She did not expect that Shaun would have such high opinions of Ryan."
      },
      {
        "paragraph": "Catherine smiled. “He’s the youngest senator in Australia. How could he be in that position if he wasn’t\ncapable? Moreover, I heard Shaun saying that Ryan did a lot of planning behind the scenes to pull\nSenator Mead and his family down. After Senator Mead was arrested, most of his power fell into\nRyan’s grasp.”"
      }
    ]
  },
  {
    "title": "Chapter 1978 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya looked dumbfounded."
      },
      {
        "paragraph": "She did not know about these matters."
      },
      {
        "paragraph": "Next to Ryan, she suddenly felt like an inexperienced fool."
      },
      {
        "paragraph": "“Now that you’ re staying at The Lodge, it’s good for you to get closer to Ryan.” Catherine said, “I know\nyou dislike buttering people up. But since you’ve started a business, it’s difficult to get things done\nwithout any connections. What’s more, you need to ride on the Snows’ coattails as long as you’re still\nmarried to Rodney. Otherwise, what will happen to Dani?”"
      },
      {
        "paragraph": "Freya nodded seriously. Catherine had reminded her of these problems that she had never thought of\nbefore."
      },
      {
        "paragraph": "“This shirt seems to suit Ryan. ” Catherine took a coat and began to discuss it with Freya."
      },
      {
        "paragraph": "Then, Freya returned to the official residence just in time for dinner."
      },
      {
        "paragraph": "However, Nathan and Ryan were talking business over dinner."
      },
      {
        "paragraph": "Unable to break in, Heidi shook her head helplessly and said to Freya, “Get ready in two days and\nattend a dinner with me.”"
      },
      {
        "paragraph": "Freya was flattered. The dinner must be a special occasion to be attended by the prime minister’s wife.\nCoincidentally, rumors of Rodney and her divorce had been circulating recently, so Heidi must have\nthought of bringing her along to back her up."
      },
      {
        "paragraph": "Eternally grateful, Freya nodded promptly."
      },
      {
        "paragraph": "After dinner, she pushed Dani in a stroller and made her way toward the back courtyard. Ryan\nhappened to be heading to his courtyard as well, so he walked with her."
      },
      {
        "paragraph": "“Where are my clothes?” he asked. “You said you wanted to compensate me.”"
      },
      {
        "paragraph": "Freya rolled her eyes at him. “Young Master Snow, why are you in a rush? You’re not in need of clothes\neither.”"
      },
      {
        "paragraph": "“That’s not it. I’m just worried that you’ll go back on your word. ” Ryan sighed. “That shirt was worth one\nmonth of my salary. Although I live here, my salary can’t even compare with that of rich people like\nyou.”"
      },
      {
        "paragraph": "Freya was stung by his remark. On second thought, he might not earn as much as she did."
      },
      {
        "paragraph": "With that, she started to feel smug. “I’ve bought it, but it’s in the house. You can come and take it.”"
      },
      {
        "paragraph": "“Alright.” Ryan’s eyes lit up."
      },
      {
        "paragraph": "Deep down, Freya was baffled as to why he was so happy over some clothes."
      },
      {
        "paragraph": "After entering the bungalow, she handed three bags to Rodney. “Try them on. If they don’t fit right, I can\nexchange them.”"
      },
      {
        "paragraph": "Then, she paused for a moment before explaining, “ They’re not luxury brands. As Cathy said, it’s\nbetter for you to dress in a low-profile manner"
      },
      {
        "paragraph": "considering your identity, so the clothes aren’t expensive. They only cost a few thousand…”"
      },
      {
        "paragraph": "“That’s good enough. I don’t usually wear expensive clothes because of my identity. ” As he spoke,\nRyan took out a creamy cashmere coat, a checked shirt of the same style, and a pair of long black\ntrousers."
      },
      {
        "paragraph": "However, he only tried on the cashmere coat. Since most of his clothes were dark-colored, wearing a\nbright coat made him appear younger and more refreshing. It would not be an overstatement to say\nthat he was a college student."
      },
      {
        "paragraph": "Freya sized him up. Admittedly, his height and physique were perfect. If he were in college, he would\nsurely be a hunk among other students. However, at the thought of his identity, she regretted it a little.\n“Is the color too bright? I should’ve listened to Cathy’s advice and bought the black one…”"
      },
      {
        "paragraph": "“No. This is quite comfortable. Also, it’s boring to wear black all the time.” After Ryan finished speaking,\nhe did not take off the coat. Instead, he picked Dani up and played with her aside."
      },
      {
        "paragraph": "Freya felt much better."
      },
      {
        "paragraph": "After all, him liking the clothes she gifted him meant that she had good taste."
      },
      {
        "paragraph": "Moreover, he was very respectful of her for not taking the coat off after trying it on."
      },
      {
        "paragraph": "The next day, Heidi darted a glance at Ryan at the table during breakfast and smiled. “This set of\nclothes looks pretty good on you. It makes you look gentlemanly. A change of style once in a while is\ngood. Don’t be like your dad, who always dresses as if he’s at work. You’re almost 30, and you still\ndon’t have a girlfriend.”"
      }
    ]
  },
  {
    "title": "Chapter 1979 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Feeling speechless, Ryan reminded Heidi, “Mom, I just turned 26 this year, which is far from 30.”"
      },
      {
        "paragraph": "“After you’ve turned 26, you’ll be 27. How far is that?” Heidi said in a huff, “It’s about time you got a\ngirlfriend. You can get married after a few years of being in a relationship.”"
      },
      {
        "paragraph": "“Mom, I have no thought of getting married.” Ryan took a mouthful of milk and then continued, “I have\nno feelings for the women I’ve met.”"
      },
      {
        "paragraph": "Upon hearing that, everyone at the dining table went quiet and turned their eyes to him."
      },
      {
        "paragraph": "Freya was no exception. She even looked at him strangely."
      },
      {
        "paragraph": "Nathan put down the spoon and said solemnly, “ Perhaps you have no feelings for them because you\nhaven’t found the right person yet.”"
      },
      {
        "paragraph": "“That’s right,” Heidi quickly added. “You best not bring a boyfriend home. I may be open-minded, but\nnot to that extent. I’m still looking forward to having a grandson.”"
      },
      {
        "paragraph": "“Mom, same – sex couples can get married in this day and age, ” Ryan refuted."
      },
      {
        "paragraph": "“That’s their business.” Heidi pulled a long face."
      },
      {
        "paragraph": "Ryan shrugged and kept quiet, but a look of disapproval was written all over his face."
      },
      {
        "paragraph": "The rest of the breakfast went on unpleasantly. At last, Ryan took his leave first."
      },
      {
        "paragraph": "Heidi watched him leave grimly. “Well, what does this mean? Is he really into men?”"
      },
      {
        "paragraph": "Freya quickly comforted her, “No, Godmom. Maybe he just hasn’t met the person he likes.”"
      },
      {
        "paragraph": "“I hope so too. ” Heidi frowned. “But the last time he got into a relationship was in college. As far as I\nknow, it’s been four to five years since his last relationship. A lot of wonderful and pretty girls have gone\nafter him, but he’s not interested in any of them. He isn’t close with any women either. I’m just worried\nthat he’ll be influenced by other beliefs.”"
      },
      {
        "paragraph": "With that, she glared at Nathan. “ It’s all your fault. You just had to send him abroad to study when I\nwanted him to stay here.”"
      },
      {
        "paragraph": "Nathan was ruffled by her words. “Stop overthinking things. That’s impossible. Our son is normal.”"
      },
      {
        "paragraph": "After some thought, he added, “You can choose a few women with excellent family backgrounds and\nintroduce them to him.”"
      },
      {
        "paragraph": "Freya was speechless. At the end of the day, the two of them were worried that Ryan was gay."
      },
      {
        "paragraph": "However, it was true that good-looking men were not fond of women these days."
      },
      {
        "paragraph": "After breakfast, Freya got ready for work. Suddenly, she received a message on her phone. [Freya, I’m\nSarah. I would like to have a talk with you. Can we meet up?]"
      },
      {
        "paragraph": "Talk?"
      },
      {
        "paragraph": "What was there to talk about?"
      },
      {
        "paragraph": "It was not as if Freya was unaware of such a hypocrite’s scheme."
      },
      {
        "paragraph": "If they met up, Sarah would weep coyly halfway through their conversation, as if Freya had bullied her.\nThen, the male character would come over, misunderstand Freya for bullying the hypocrite, and end up\nenemies with her."
      },
      {
        "paragraph": "Freya snorted."
      },
      {
        "paragraph": "She tossed the phone and could not be bothered about Sarah."
      },
      {
        "paragraph": "However, she started contemplating it after tossing her phone. She was fine with Rodney\nmisunderstanding her. She did not plan on being with that b*stard anyway."
      },
      {
        "paragraph": "Perhaps if she beat Sarah up, Rodney would hate her and even divorce her readily."
      }
    ]
  },
  {
    "title": "Chapter 1980 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Hence, Freya replied to Sarah’s message, telling her to meet at a high-end coffee house."
      },
      {
        "paragraph": "After that,  she called Catherine.  “I’ve decided  to slap Sarah twice when I meet her. Since she has\nsprained her ankle, I’ll break her leg and remove all her clothes. Hmph! I’m going to show everyone\nthat shameless woman’s— ”"
      },
      {
        "paragraph": "“Alright. You can do whatever you want since you don’t care whether Rodney will misunderstand you or\nnot. Sadly, the preschool is having some parent- child activities, so I won’t be able to accompany you.”\nCatherine reminded her, “Be careful.”"
      },
      {
        "paragraph": "“Of course, I will. I even plan to record our conversation. When Rodney and I get a divorce, I’ll expose\nher true colors to him.”"
      },
      {
        "paragraph": "Catherine thought about it for a moment before she said, “ Sarah would probably have thought about\nthis trick. She’s very cautious now, and she might not fall for it.”"
      },
      {
        "paragraph": "Freya grasped her point. However, she still wanted to give it a shot."
      },
      {
        "paragraph": "After making a trip to the office, Freya headed to the coffee house in the afternoon."
      },
      {
        "paragraph": "When she arrived, Sarah was already in the private room, and standing at the door was a tall and burly\nbodyguard."
      },
      {
        "paragraph": "Freya did not know the bodyguard, but he was probably a Snowden member whom Rodney had\nassigned to protect Sarah."
      },
      {
        "paragraph": "Sure enough, the bodyguard blushed as soon as he saw her. “Young Madam…”"
      },
      {
        "paragraph": "Freya sniggered. “I think you’re addressing the wrong person. Your Young Madam should be the one in\nthe private room…”"
      },
      {
        "paragraph": "“Don’t say that, Young Madam. Young Master and Miss Neeson’s relationship isn’t what you think… ”\nThe bodyguard bit the bullet and explained, “Young Master has only arranged for me to protect Miss\nNeeson for the time being. In fact, Miss Neeson came here today to talk you out of divorcing Young\nMaster Snow…”"
      },
      {
        "paragraph": "Freya understood what was going on. It was no wonder this bodyguard would tag along with Sarah. “\nSo Rodney doesn’t know that the both of you are"
      },
      {
        "paragraph": "meeting me today?”"
      },
      {
        "paragraph": "The bodyguard shook his head."
      },
      {
        "paragraph": "“Aren’t you afraid that Rodney will be unhappy with you allowing her to meet me without his\nknowledge?” Freya asked with her brows raised."
      },
      {
        "paragraph": "“Young Master Snow doesn’t want to divorce you either. If everything can be made clear, he’ll be happy\nas well,” the bodyguard responded calmly."
      },
      {
        "paragraph": "Freya could somewhat grasp the picture. Sarah must have tricked this bodyguard, but that was not\nsurprising. If Young Master Snow had been tricked terribly, let alone his men."
      },
      {
        "paragraph": "She laughed out loud. Then, she pushed the door and entered the room without bothering to answer\nhim."
      },
      {
        "paragraph": "In the room, Sarah was dressed in a Chanel white coat with her long, black hair falling over her\nshoulders. She gave off an elegant aura."
      },
      {
        "paragraph": "Freya recognized the Chanel coat as she had previously come across it in a magazine. The coat had\njust been made available in the local market and was quite costly. It was worth over 100 thousand\ndollars."
      },
      {
        "paragraph": "Everything Sarah had now — her meals and her accommodation — were all arranged by Rodney."
      },
      {
        "paragraph": "It seemed like he was willing to spend so much on her."
      },
      {
        "paragraph": "As she recalled how touched she previously was to receive a gift from Rodney every morning, Freya\nfound herself silly and superficial."
      },
      {
        "paragraph": "The cheapest thing in the world was money-bought items. “I’m sorry, Freya. My leg is troubling me, so I\ncan’t stand up and welcome you personally.” Sarah pointed at her leg."
      }
    ]
  },
  {
    "title": "Chapter 1981 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya sat directly opposite Sarah. After driving a considerable distance, she happened to feel thirsty, so\nshe poured herself a cup of coffee."
      },
      {
        "paragraph": "Just as Sarah’s red lips parted slightly, Freya interrupted her. “If you’re planning to fake sympathy and\ntell me that you’re not romantically involved with Rodney, you’d better keep your mouth shut. I’m not in\nthe mood to watch you act.”"
      },
      {
        "paragraph": "Sarah darted a look at Freya for a while before she suddenly smirked and laughed. Then, she\napproached Freya and muttered under her breath, “ Sure. But do you want  to know how Jennifer\ndied?”"
      },
      {
        "paragraph": "Jennifer was Charity’s mother."
      },
      {
        "paragraph": "Although Freya had only met Jennifer a few times, she remembered the latter weeping bitterly after\nCharity got into jail. Later, Jennifer was somehow found dead in the bathroom."
      },
      {
        "paragraph": "“Were you the one who killed her?” Freya tightened the grip on her cup."
      },
      {
        "paragraph": "“Who did I kill? What are you saying?” Sarah revealed an innocent look and said in her normal voice, “I\ncame here to tell you that Rodney truly loves you. He told me that he’s married, so it is impossible for\nus to be together. All he wants to do is live a good life with his wife and child.”"
      },
      {
        "paragraph": "Freya glanced at the door and replied in a deep voice,  “ Sarah Neeson, I want to know the  truth.”"
      },
      {
        "paragraph": "Sarah took a sip of coffee. After that, she said elegantly and softly, “ I need to be on guard since there’s\nsomeone at the door. Otherwise, I’ll be in trouble if Rodney finds out my true colors. Also… ”"
      },
      {
        "paragraph": "She pointed at Freya’s handbag and pocket. “I don’t trust you. Who knows if you’re recording our\nconversation.”"
      },
      {
        "paragraph": "Freya secretly sighed. Sure enough, Catherine had anticipated this behavior of Sarah early on."
      },
      {
        "paragraph": "Although Freya was already getting a divorce, Sarah was still on guard against being recorded."
      },
      {
        "paragraph": "Hence, Freya openly took out her phone and paused the recording in front of Sarah. “Is this okay\nnow?”"
      },
      {
        "paragraph": "“I’m sorry, but I can’t trust you completely. ” Sarah went closer to Freya and spoke as softly as a\nmosquito buzzing. Even so, Freya could catch everything she said."
      },
      {
        "paragraph": "“Well, I had a row with Jennifer when I went to meet her that day. I told her that a b*tchy mistress like\nher deserved to have her daughter sent to jail. When she became infuriated, I jumped at the chance to\nhypnotize her. After I left, she became so muddle-headed that she hit the bathroom cabinet and passed\nout. Because she was bleeding a lot and"
      },
      {
        "paragraph": "we missed the chance to resuscitate her, she died.”"
      },
      {
        "paragraph": "Sarah’s red lips curled into a smirk, her eyes filled with malice. “I had always hated Jennifer since I was\nyoung. If it weren’t for her, my family wouldn’t"
      },
      {
        "paragraph": "have ended up in this state. That was why she had to die. But I mustn’t leave any evidence of her\ndeath.”"
      },
      {
        "paragraph": "“B*tch…”"
      },
      {
        "paragraph": "Freya’s eyes seethed with rage, and her whole body was trembling Although she and Catherine had\nsuspected this outcome, that was just their assumption, and it was never confirmed."
      },
      {
        "paragraph": "Now that she knew the truth, she had an overwhelming urge to strangle the woman in front of her."
      },
      {
        "paragraph": "“Besides, I poured Jennifer’s ashes into the drain after she died, ” Sarah continued softly, “How could I\npossibly allow her to be buried with my dad? A"
      },
      {
        "paragraph": "woman like her should stay in the nasty drain.”"
      },
      {
        "paragraph": "Freya glared at Sarah with both her hands trembling."
      },
      {
        "paragraph": "Aunty Jennifer was such a gentle person, yet she could not even rest in peace."
      },
      {
        "paragraph": "“Don’t stare at me like that. Charity knows this too.” Sarah shrugged. “Also, do you know why Thomas\nmessed with you back then? Hah. It was because you were Catherine’s good friend. It happened that\nThomas was interested in you, so I egged him on to barge into your house. I told him he could do\nwhatever he wanted to you because I would get someone to bail him out. Even if he wanted to destroy\nyou, it did not matter."
      },
      {
        "paragraph": "Unfortunately… he almost did it. Too bad."
      },
      {
        "paragraph": "“I was also the one who circulated photos of you in that disheveled clothing to the reporters."
      },
      {
        "paragraph": "“At that time, I was thinking of destroying you completely.”"
      }
    ]
  },
  {
    "title": "Chapter 1982 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Over the years, Freya had been wondering if Sarah had anything to do with those things Thomas did to\nher all those years ago."
      },
      {
        "paragraph": "She had always suspected Sarah’s involvement, but she did not have any evidence."
      },
      {
        "paragraph": "She even felt that Sarah had a hand in the incident that happened during the banquet of Osher’s new\nproduct launch, where Thomas secretly joined the event and drugged her."
      },
      {
        "paragraph": "Now that Sarah had personally confessed to it, Freya could finally confirm that her wonderful youth was\ndestroyed by the Neeson siblings, Sarah and Thomas."
      },
      {
        "paragraph": "“Are you telling me these things to trigger me? I must tell you that you’ve succeeded.”"
      },
      {
        "paragraph": "Freya immediately rose to her feet. Then, she took the boiling hot coffee from the table and splashed it\nonto Sarah’s face."
      },
      {
        "paragraph": "Sarah promptly covered her face with her hands. Although the coffee did not hit her face, she cried out\ndue to the burning pain in her hands"
      },
      {
        "paragraph": "Freya could not care less. She stood up, dragged Sarah out of the chair by her hair, and slapped her in\nthe face."
      },
      {
        "paragraph": "Before she could give any more slaps, the bodyguard at the door dashed in as soon as he heard Sarah\nyelling."
      },
      {
        "paragraph": "Freya was on the brink of losing control. Exasperated, she took the carafe to splash the coffee onto\nSarah’s face."
      },
      {
        "paragraph": "All she knew was that she had to destroy Sarah to take revenge on behalf of Charity’s family and\nherself."
      },
      {
        "paragraph": "Why did Charity and Jennifer end up in such a miserable state?"
      },
      {
        "paragraph": "Freya was miserably hurt too."
      },
      {
        "paragraph": "Meanwhile, Sarah, this instigator, could still sit here and enjoy her life."
      },
      {
        "paragraph": "“Stop.” The bodyguard was so shocked that he kicked the carafe and clutched Freya’s wrist at the\nsame time."
      },
      {
        "paragraph": "On the other hand, Sarah hurriedly hid behind the bodyguard. She screamed in shock and pain, “My\nhands… They hurt so badly.”"
      },
      {
        "paragraph": "The bodyguard turned around, only to catch sight of Sarah’s swollen hands, which gave him a fright."
      },
      {
        "paragraph": "He was doomed. Rodney  had told him  to take care of Sarah, yet she was hurt. He would surely be\npunished."
      },
      {
        "paragraph": "At this point, he deeply regretted taking Sarah out. However, it was too late."
      },
      {
        "paragraph": "“Let go of my hand.” After struggling a few times, Freya still failed to break free from the bodyguard’s\nclutches. She reckoned that the bodyguard Rodney had assigned to protect Sarah was skillful and\nmight not be her match."
      },
      {
        "paragraph": "She gritted her teeth and bellowed while suppressing her rage, “If you still have respect for me, please\nlet go of my hand.”"
      },
      {
        "paragraph": "“Young Madam, you’ve already beaten her up so badly. What else do you want to do?” The bodyguard\nfrowned. If he had not stopped her just now, the coffee from the carafe would have splashed onto\nSarah’s face and damaged her appearance."
      },
      {
        "paragraph": "“What else do I want to do?” A furious look washed over Freya’s pretty face. “I want to kill her.”"
      },
      {
        "paragraph": "“ I’m sorry, but you can’t hurt her.” As soon as the bodyguard finished his sentence, he let go of Freya’s\nhand. He had to send Sarah to the hospital at once."
      },
      {
        "paragraph": "However, the moment he let go of Freya, she grabbed hold of the vase beside her to hurl at Sarah."
      },
      {
        "paragraph": "Given that Sarah’s leg was hurt and that she could not move, she could only shriek in fear as she\nwatched the vase fly toward her."
      }
    ]
  },
  {
    "title": "Chapter 1983 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "The bodyguard did not expect Freya to be so insane, and he swiftly kicked the vase away."
      },
      {
        "paragraph": "Upon hitting the wall, the vase shattered into pieces."
      },
      {
        "paragraph": "At this moment, Rodney rushed in with his people. The minute Sarah saw him, she fell to the floor\ntearfully."
      },
      {
        "paragraph": "“Sarah. ” Rodney subconsciously stretched out his hands to hold her right away. When he saw her\nburned, skinned hands and swollen face, he turned his gaze to Freya in disbelief."
      },
      {
        "paragraph": "Freya stared hard at Sarah, trembling. She knew that with the presence of these people, she could not\nteach Sarah a lesson today."
      },
      {
        "paragraph": "However, she was not satisfied. She wished she could press Sarah on the floor now and punch her."
      },
      {
        "paragraph": "She wanted to stuff Sarah into the drain and make her suffer a living hell."
      },
      {
        "paragraph": "Nevertheless, Rodney found Freya’s expression terrifying. Her eyes were filled with hatred, and her\npretty face was contorted in anger."
      },
      {
        "paragraph": "It baffled him as to how she had turned into such a person."
      },
      {
        "paragraph": "Judging from Freya’s unscathed appearance as well as the carafe and vase in the messy private room,\nhe could guess what was going on before questioning her."
      },
      {
        "paragraph": "“ I’m sorry, Rodney. I shouldn’t have come today.” Sarah suddenly lowered her head and burst into\ntears. “I came to explain to Ms. Lynch in hopes that your relationship wouldn’t be affected by me and\nyou guys wouldn’t get a divorce. But I didn’t know she hated me so much.”"
      },
      {
        "paragraph": "“Forget it.” Looking at Sarah’s injuries, Rodney leaped to his feet in distress and glared at Freya. “\nYou’ve gone too far today.”"
      },
      {
        "paragraph": "“Go away, Rodney.” Freya ignored him and walked toward Sarah."
      },
      {
        "paragraph": "Not only did the bodyguard stop her this time, but even Rodney did the same too."
      },
      {
        "paragraph": "“You’ve hurt her so badly. What else do you want to do?” Rodney was so infuriated that she dragged\nFreya away. Deep down, he felt extremely irritated. Freya’s actions made him feel much more guilty\ntoward Sarah than he already was."
      },
      {
        "paragraph": "“I want to destroy her face.” Freya made her intention clear and said grimly, “Isn’t she shameless? In\nthat case, I’ll splash coffee onto her face. D*mn it. I should’ve brought some sulfuric acid today.”"
      },
      {
        "paragraph": "“You’re vicious.” Rodney found her behavior incredulous."
      },
      {
        "paragraph": "“Yes, this is how vicious I am. ” Freya approached him little by little, with insanity filling her eyes. “\nRodney Snow, you’d better stay away from me. Who knows if I might carry along a knife and stab your\nlower part one day?”"
      },
      {
        "paragraph": "Upon sensing the grimness in her eyes, Rodney subconsciously took two steps back. He felt that the\nmind of the woman in front of him was twisted. “ Freya, when did you become like this?”"
      },
      {
        "paragraph": "“If it isn’t all your woman’s doing.” Freya violently pushed Rodney away and made her way to the door.\nWhen she was out the door, she turned back and glanced at Sarah. “Sarah Neeson, you best not\ncontact me in private anymore. Otherwise, I’ll beat you up every time I see you. Perhaps… I’ll also pour\nyour ashes into the drain.”"
      },
      {
        "paragraph": "With that, she left straight away."
      },
      {
        "paragraph": "Sarah held Rodney as she trembled and wept coyly."
      },
      {
        "paragraph": "“Rodney, you shouldn’t have stopped her just now. Since she dislikes me, you should’ve let her take it\nout on me. I don’t wish for the two of you to end in a divorce.”"
      },
      {
        "paragraph": "Rodney was very disturbed. However, seeing Sarah in this state, he could not bring himself to criticize\nher. Hence, he said, “Sarah, why did you ask her out privately? This is between me and her. I’ve told\nyou not to look for her.”"
      },
      {
        "paragraph": "After pausing for a moment, he told the bodyguard off, “You too. How dare you take her here without\nmy knowledge. If the sitter hadn’t told me that the two of you were out, I wouldn’t have known you\ncame here.”"
      },
      {
        "paragraph": "The bodyguard regretted his deed. Yet before he could say anything, Sarah spoke first, “Don’t blame\nhim. I was the one who begged him to do this. I noticed that you’ve been distressed recently, and I\nknow you don’t want to get a divorce. So, I thought of persuading Freya and explaining to her what\nhappened in the past. But before I could speak further, she splashed the hot coffee at my face… ”"
      },
      {
        "paragraph": "Amid her sobs, she raised her swollen hands."
      }
    ]
  },
  {
    "title": "Chapter 1984 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "A hint of sympathy flashed across Rodney’s eyes, and he promptly picked Sarah up. “Let me take you\nto the hospital."
      },
      {
        "paragraph": "After they arrived at the hospital, the doctor examined Sarah’s condition and said, “Your injuries are\nquite severe. What happened? Judging from your face… were you beaten up? Do I need to call the\npolice?”"
      },
      {
        "paragraph": "Rodney’s throat bobbed, and he heard Sarah reply, “ No need. I accidentally injured myself.”"
      },
      {
        "paragraph": "The doctor had seen all kinds of patients. Nevertheless, he did not ask the patient further since she did\nnot plan to look into the issue. He only added, “Anyway, your condition has been jotted in the medical\nrecord. If you want to look into it, you can always ask me to issue a report to you.”"
      },
      {
        "paragraph": "“Thank you, doctor.” Sarah expressed her gratitude in a low voice and then looked down without saying\nanything else."
      },
      {
        "paragraph": "Those words upset Rodney."
      },
      {
        "paragraph": "He even felt that he had wronged Sarah again. If it were not for him, she could have held Freya\naccountable."
      },
      {
        "paragraph": "At the same time, he could not help but blame Freya. If the hot coffee had splashed onto Sarah’s face,\nher face would have been disfigured."
      },
      {
        "paragraph": "However, he could not believe that Freya was so vicious."
      },
      {
        "paragraph": "Her words may be harsh, but during his time with her, he realized that her bark was worse than her\nbite."
      },
      {
        "paragraph": "After calling the bodyguard out of the ward, the bodyguard said, “When I barged in to save Miss\nNeeson, I happened  to see… Young Madam holding a carafe to splash the coffee at Miss Neeson’s\nface. I t was quite… terrifying. When I kicked the carafe with my Martin boot, it burned the outer layer of\nm y boot.”"
      },
      {
        "paragraph": "Rodney lowered his head and looked at the bodyguard’s boot. Indeed, there was a burn mark on the\nbodyguard’s Martin boot."
      },
      {
        "paragraph": "He dared not imagine what would have happened if the coffee landed on Sarah’s face."
      },
      {
        "paragraph": "A chill rose within him in spite of himself. “Did you hear what they said from outside?”"
      },
      {
        "paragraph": "The bodyguard furrowed his brows. “The private room had good soundproofing. From what I could\nvaguely hear, Miss Neeson seemed to have claimed that she isn’t romantically involved with you, and\nyou like Young Madam… Before I could catch what they said later, I heard a commotion.”"
      },
      {
        "paragraph": "The chill in Rodney slowly spread."
      },
      {
        "paragraph": "Although he knew that Freya would not listen to any explanation, he never thought that she would go\nas far as destroying a woman’s appearance."
      },
      {
        "paragraph": "What an evil deed it was."
      },
      {
        "paragraph": "She had always criticized Sarah for being vicious, yet what she did was even more appalling."
      },
      {
        "paragraph": "He could not even figure out why Freya had become like this."
      },
      {
        "paragraph": "If the bodyguard had not stopped her in time, her action could have been considered a crime."
      },
      {
        "paragraph": "Was she under the impression that she could do whatever she wanted just because she had the\nexecutive council backing her?"
      },
      {
        "paragraph": "When Sarah was finally done with IV infusion, she said softly, “Rodney, don’t stay here with me."
      },
      {
        "paragraph": "There are a lot of people in the hospital. If news about this spreads and Freya sees it, it’ll be difficult for\nyou to mend your relationship with her.”"
      },
      {
        "paragraph": "“I’m sorry, Sarah.” The more forgiving she appeared, the more apologetic Rodney felt. “ It’s all my\nfault.”"
      },
      {
        "paragraph": "“How is it your fault? It’s because of my lack of self— knowledge. I shouldn’t have looked for Freya.”\nSarah let out a deep sigh before saying sorrowfully, “The misunderstanding between her and I is just\ntoo big. Rodney, I really hope you won’t get a divorce. If possible, please send me overseas as soon as\nyou can.”"
      },
      {
        "paragraph": "Looking at her pale face, Rodney nodded with difficulty."
      }
    ]
  },
  {
    "title": "Chapter 1985 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "After leaving the ward, Rodney deliberately went to meet the doctor. “Doctor, will it leave scars on her\nhands?”"
      },
      {
        "paragraph": "“Of course, it will, ” the doctor said. “The scars will be quite obvious in the first two years. Having said\nthat, there’s a kind of ointment available overseas that she can apply on her hands. As time passes,\nthe scars will become less obvious, but it’ll take a few years. Be careful for the next few days, in case\nshe gets a wound infection and develops a fever.”"
      },
      {
        "paragraph": "Rodney nodded. “Please give her the best treatment possible.”"
      },
      {
        "paragraph": "Once he came out, he tried calling Freya a few times. The calls got through, but she refused to pick\nthem up."
      },
      {
        "paragraph": "He started to get infuriated."
      },
      {
        "paragraph": "Freya tossed her phone to one side."
      },
      {
        "paragraph": "After that, she poured a glass of beer and drank it alone by the bar counter."
      },
      {
        "paragraph": "Sarah’s words echoed in her mind, and it filled Freya with hatred. She hated Sarah, as well as Rodney."
      },
      {
        "paragraph": "That woman had done so many bad deeds, yet Rodney continued to defend her."
      },
      {
        "paragraph": "Upon recalling that she was still married to Rodney, she felt sorry for Charity and her old self."
      },
      {
        "paragraph": "When she tried to attack Sarah today, she did not care about anything at all. She did not mind going to\njail or losing her reputation as long as she could kill Sarah."
      },
      {
        "paragraph": "Unfortunately, that b*tch managed to escape."
      },
      {
        "paragraph": "“It’s still early, and you’ve already had so much to drink. What’s wrong?”"
      },
      {
        "paragraph": "Eliza put her white purse beside the beer glass before planting herself on the barstool. She was\nwearing a sweater and a beret along with a pair of huge shades on her nose. If Freya had not taken a\ncloser look at Eliza, she would not have recognized her. However, she looked good in all kinds of\nclothing; it was impossible to hide that star quality of hers."
      },
      {
        "paragraph": "“Eliza, what brings you here? I thought you had gone for a shoot.” Freya may have drunk a lot, but she\nwas not drunk yet. Her mind was still clear. She remembered sending a message in the group chat\nwhen she arrived at the bar."
      },
      {
        "paragraph": "Catherine probably had yet to reply because she was busy with the kids. However, Freya did not\nexpect Eliza to show up."
      },
      {
        "paragraph": "“There aren’t any movies suitable for me, so there are no shoots. I’ve only been shooting for\nadvertisements recently, and I’m not that busy, ” Eliza interrupted her. “You’re already a mother."
      },
      {
        "paragraph": "Don’t drink so much.”"
      },
      {
        "paragraph": "“Yeah, I’m now a mother.” Freya’s eyes reddened. “ But do you know this child came to this world only\nbecause I was tricked? Dani is wonderful and cute. I love her a lot, but who wouldn’t want their child to\nbe born to two loving parents? Since I came to Canberra, my life has taken a turn for the worse. A lot of\nthings have become out of control.”"
      },
      {
        "paragraph": "Eliza kept quiet for a while before she said in a deep voice, “A lot of things are outside our control.”"
      },
      {
        "paragraph": "“Yeah. At least… compared to some people, I’m probably considered lucky,” Freya said miserably. “\nWhen I first came to Canberra, Catherine and I had a good friend named Charity. She had the worst"
      },
      {
        "paragraph": "life. She was accused and sent to jail, and both her parents passed away after. I only got to know from"
      },
      {
        "paragraph": "meeting Sarah today that she was the one who killed Charity’s mom. Sarah actually hypnotized Aunty\nJennifer and caused her to hit herself on the bathroom cabinet in a trance. In the end, Aunty Jennifer\nbled to death. What was worse, Sarah poured her ashes into the drain."
      },
      {
        "paragraph": "“Tell me. How can someone be so vicious and inhumane? I really wanted to kill her today, but Rodney,\nthat b*stard, kept defending her. I’m no match for him.”"
      },
      {
        "paragraph": "The more Freya spoke, the more downhearted she felt. “I’m really useless. I can’t even take revenge\nfor Charity.”"
      },
      {
        "paragraph": "As soon as she finished the sentence, she heard a sudden ‘snap’ beside her."
      },
      {
        "paragraph": "Only then did she realize that Eliza had crushed the beer glass in her hand. Shards of glass pierced\ninto Eliza’s palm, and blood began to ooze out."
      }
    ]
  },
  {
    "title": "Chapter 1986 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "After topping up the alcohol, Eliza gulped down half the glass."
      },
      {
        "paragraph": "It seemed like she was taking the alcohol as plain water."
      },
      {
        "paragraph": "Chester glanced at the alcohol bottle and narrowed his gentle eyes."
      },
      {
        "paragraph": "Whiskey."
      },
      {
        "paragraph": "This woman sure could load herself with so much whiskey."
      },
      {
        "paragraph": "He reached out to seize the bottle away."
      },
      {
        "paragraph": "Eliza turned around to glance at the man, but she could not make out his face. For one, her\nsurroundings were quite dim because she was wearing shades. Another reason was that she was very\ndrunk, but her mind was clear."
      },
      {
        "paragraph": "She thought that the man had come to flirt with her, so she said directly, “If you’re planning to hit on me,\nget lost. I’m not available.”"
      },
      {
        "paragraph": "Chester’s handsome face turned extremely grim at once. He had not been pestering her recently\nbecause of Charity. Was that why she had become more unscrupulous instead?"
      },
      {
        "paragraph": "“Eliza, have I been showing you too much  respect?” Chester put the bottle aside and dragged her off\nthe stool with a long face."
      },
      {
        "paragraph": "Perhaps Chester had pulled too hard as she immediately fell forward. In the process, her shades\ndropped, revealing her red, misty eyes. Although there were no signs of her crying, there were tears in\nher eyes."
      },
      {
        "paragraph": "Chester fixed his eyes on her, and they began to darken. “In a bad mood?”"
      },
      {
        "paragraph": "Eliza did not say a word. Although she could not identify the man’s face, she could somewhat\nrecognize from the voice that he was Chester."
      },
      {
        "paragraph": "How unlucky of her to meet him when she was in a bad mood."
      },
      {
        "paragraph": "She pushed his hand away and bent over to pick up her shades."
      },
      {
        "paragraph": "However, her double vision at that moment made it seem like there was more than one pair of shades\non the floor."
      },
      {
        "paragraph": "She tried to pick it up, but she felt around for a while and found nothing. Instead, she touched Chester’s\nleather shoes."
      },
      {
        "paragraph": "From Eliza’s behavior, Chester knew that she was drunk. Nevertheless, he just watched as she\nscoured the floor for her shades. Once she finally found it, she tottered up and put it on before\nresuming her cool expression."
      },
      {
        "paragraph": "Chester stared at her actions, and when she put on her shades, he realized that her palm was stained\nwith blood."
      },
      {
        "paragraph": "Only then did it occur to him that her palm was wrapped with tissue, which fell while she tried searching\nfor her shades. He threw a look at the tissue and found it stained with blood."
      },
      {
        "paragraph": "“What happened to your hand?” Chester clutched her shoulder again and grabbed hold of her hand.\nThat was when he saw a number of fine scars on her palm and fingers as if something had cut her.\nSome wounds were deep, while some were minor. It did not matter if it were one or two wounds"
      },
      {
        "paragraph": "because a bandage would heal it within a few days. However, having so many wounds required\ntreatment, or they would be inflamed."
      },
      {
        "paragraph": "“It’s nothing big.” Eliza firmly withdrew her fingers from his clutch."
      },
      {
        "paragraph": "She did not want to talk to him. All she wanted to do was sit quietly for a while."
      },
      {
        "paragraph": "If she were not drunk, she could have left. However, Freya was still here, so she had to ask her\nassistant to pick them up."
      },
      {
        "paragraph": "Chester was extremely put out by how this woman dodged him time and time again."
      },
      {
        "paragraph": "Simmering with anger, he immediately dragged Eliza toward the restroom."
      },
      {
        "paragraph": "“What are you doing? Let go of me.” Eliza staggered as she was dragged to the restroom."
      },
      {
        "paragraph": "Chester turned on the tap coldly. After that, he ducked Eliza’s head under the running faucet. “ Eliza,\nmy patience has its limits. Since you don’t appreciate my kindness, I have no choice but to use my own\nways. Only then will you be content.”"
      },
      {
        "paragraph": "The icy water splashed onto her face and hair. She even choked on the water a few times."
      },
      {
        "paragraph": "However, this was not the most terrifying part. What terrified her was when she recalled herself dying in\nCharity’s body."
      },
      {
        "paragraph": "She was drowned in the sea. Before she died, her throat filled with water, which was extremely\nagonizing."
      },
      {
        "paragraph": "At this point, it felt as if she was reliving her nightmare. She went crazy and kept struggling for her life."
      }
    ]
  },
  {
    "title": "Chapter 1987 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Eliza swept everything off the basin cabinet and began to tic uncontrollably."
      },
      {
        "paragraph": "Upon noticing that something was wrong with her, Chester let her go. She anxiously lifted her head and\ncollapsed onto the floor with her face as white as a sheet. Moreover, with her whole face and hair\ndrenched, she was shivering all over. The usually cold look on her face was now replaced with fear. It\nwas as though she had just experienced the most terrifying thing in the world."
      },
      {
        "paragraph": "Chester’s body stiffened."
      },
      {
        "paragraph": "It was his first time seeing Eliza lose herself."
      },
      {
        "paragraph": "It was as though she had been shelled and finally exposed her true colors."
      },
      {
        "paragraph": "He reached out, wanting to hold her."
      },
      {
        "paragraph": "However, Eliza dodged his hands and struggled to stand up. Then, she tottered and ran outside."
      },
      {
        "paragraph": "By the time Chester went after her, he realized that she had left with her hair unkempt and without\nbringing anything along."
      },
      {
        "paragraph": "She did not take her phone or handbag as well. She even left Freya here."
      },
      {
        "paragraph": "Chester did not expect things to turn out this way."
      },
      {
        "paragraph": "All he wanted was to wake her up with water and teach her a lesson."
      },
      {
        "paragraph": "Did she have to be so terrified?"
      },
      {
        "paragraph": "He took out a cigarette and lit it in annoyance."
      },
      {
        "paragraph": "The bartender at the counter carefully brought a glass of cocktail over and asked, “Where’s Eliza? I\nwent to look for medicine, but I couldn’t find any. Her wound needs to be disinfected.”"
      },
      {
        "paragraph": "“Why? Is it because you’ve fallen for her?” Chester shot him a cold glare."
      },
      {
        "paragraph": "The bartender shuddered and quickly replied, “No, no. Considering her status, people like me definitely\ndon’t deserve to be with Miss Robbins. But she crushed a wine glass here just now, so we’re\nresponsible for it.”"
      },
      {
        "paragraph": "“Crushed?” Chester was dumbfounded. He remembered seeing the wound on Eliza’s palm, but it did\nnot hit him that she was injured that way."
      },
      {
        "paragraph": "Shaun had done such a thing before too, but hardly any woman would do so."
      },
      {
        "paragraph": "“Yeah. Miss Robbins has great endurance. When the glass pierced her hand, she didn’t even cry out, ”\nthe bartender said."
      },
      {
        "paragraph": "“Why did she crush the glass?” Chester asked after taking a pull on the cigarette."
      },
      {
        "paragraph": "“…I’m not sure.” The bartender was speechless. Who would know the reason?"
      },
      {
        "paragraph": "After smoking a cigarette, Chester glanced at Freya, wondering who he should inform to pick her up."
      },
      {
        "paragraph": "Back then, he could ask Rodney to pick her up, but not anymore."
      },
      {
        "paragraph": "He should just ask Catherine."
      },
      {
        "paragraph": "Just as he wanted to make a call, Freya’s phone on the counter rang. It was a call from Ryan."
      },
      {
        "paragraph": "Chester immediately answered it. “Freya is drunk in the clubhouse. Come and take her back to The\nLodge.”"
      },
      {
        "paragraph": "Ryan was stunned. “Chester, why are you with her?”"
      },
      {
        "paragraph": "“ I bumped into her. ” Chester gave him the bar’s address."
      },
      {
        "paragraph": "In less than half an hour, Ryan arrived."
      },
      {
        "paragraph": "“That’s fast.” Chester flicked the ashes off his cigarette, and his gaze was obscure."
      },
      {
        "paragraph": "“I appreciate your help, Chester.” Ryan smiled gently without addressing his question explicitly. He\nwalked up to Freya, only to see her lying still on the table, drunk."
      },
      {
        "paragraph": "He furrowed his brows. As far as he could recall, she had never been this drunk before. “Chester, how\nmuch did she drink?”"
      },
      {
        "paragraph": "“I’m not sure, ” Chester replied while looking toward the bartender."
      },
      {
        "paragraph": "The bartender promptly said, “Miss Lynch drank four bottles alone.” Ryan’s mouth twitched, and he\ntook out his phone. “How much is the bill?”"
      }
    ]
  },
  {
    "title": "Chapter 1988 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Mr. Jewell told me to put it on his tab, ” the bartender said."
      },
      {
        "paragraph": "“ It’s just chicken feed, ” Chester said nonchalantly."
      },
      {
        "paragraph": "Considering Chester’s identity, Ryan did not dwell on this matter.  “Thank  you.  I’ll take her back now.”"
      },
      {
        "paragraph": "With that, he picked Freya up. After rubbing her head  against  his chest,  Freya fell asleep peacefully."
      },
      {
        "paragraph": "Ryan’s arms tightened as he walked away with Freya in his arms."
      },
      {
        "paragraph": "Chester was not in the mood to stay there either, so he turned around to leave the clubhouse. After\ngetting into his car, he took Eliza’s phone out of his pocket. The phone was white in color and did not\neven have a cover."
      },
      {
        "paragraph": "He had seen many women’s phone covers that were mostly pink and glittery. Only hers was so simple\nthat it did not seem to belong to a woman."
      },
      {
        "paragraph": "For some reason, Eliza’s face earlier suddenly flashed across his mind."
      },
      {
        "paragraph": "With that, he drove to Felix Media."
      },
      {
        "paragraph": "The moment he entered the president’s office, Shedrick was astonished. “Hey, what brings you here,\nYoung Master Jewell? Hang on. Are my eyes deceiving me? Why is there a woman’s handbag in your\nhand?”"
      },
      {
        "paragraph": "Chester tossed the handbag on the table. “It’s Eliza’s.”"
      },
      {
        "paragraph": "“Why is her handbag with you?” Shedrick’s gaze suddenly became strange and ambiguous. “Could it\nbe that both of you have…”"
      },
      {
        "paragraph": "“You’re overthinking it. When I was in the clubhouse, I spotted her drinking, and she was awfully\ndrunk.” Chester darted a cold glance at him. “You should keep watch of your artists. If any reporters\nhad caught her, she’d be in deep trouble. ”"
      },
      {
        "paragraph": "Shedrick was shocked. “Really? Eliza normally drinks in social functions, but she has great alcohol\ntolerance. She rarely gets drunk.”"
      },
      {
        "paragraph": "“Do you mean that I’m lying?” Chester pointed to the handbag on the table. “ If she weren’t drunk,\nwould she have forgotten to take her handbag?”"
      },
      {
        "paragraph": "“Of course, I’m not doubting you, Young Master Jewell. I’m just worried about Eliza. Could she be\ndistressed by her relationship?”"
      },
      {
        "paragraph": "With that, the atmosphere suddenly turned cold for an instant."
      },
      {
        "paragraph": "“Distressed by her relationship?” Chester smiled grimly. “She went to look for a man, huh?”"
      },
      {
        "paragraph": "“Of course not.” Shedrick suddenly shuddered.  “ She could be distressed by other things. Let me call\nto ask her…”"
      },
      {
        "paragraph": "“Don’t bother calling. Her phone is with me.” Chester crossed his legs and said lazily, “If she wants her\nphone back, tell her to come and take it from me in person.”"
      },
      {
        "paragraph": "Shedrick was speechless."
      },
      {
        "paragraph": "Somehow, he felt that Chester was up to something. “Remember to inform her of what I said.”"
      },
      {
        "paragraph": "Chester left right after he finished speaking."
      },
      {
        "paragraph": "Shedrick was at a loss for words. In this case, why did Chester come over? Did he mean to return\nEliza’s handbag and tattletale on her?"
      },
      {
        "paragraph": "However, Chester left so quickly that Shedrick did not get the chance to tell him about Cindy’s matter."
      },
      {
        "paragraph": "After some thought, Shedrick called Eliza’s manager, Hailey. “Do you have Eliza’s apartment key?\nPlease send her handbag over.”"
      },
      {
        "paragraph": "Hailey was tied up and only had time to go over to Eliza’s apartment at night."
      },
      {
        "paragraph": "She knocked on the door, but no one opened it. So, she unlocked the door with the spare key and\nentered the apartment, only to see Eliza curled up on the couch. Her face was pale, and she was\nshivering all over with her eyes tightly shut. Her hair and clothes were completely drenched."
      },
      {
        "paragraph": "The sight startled Hailey. She then touched Eliza’s forehead and found it burning."
      },
      {
        "paragraph": "She hurriedly called the ambulance to send Eliza to the hospital."
      },
      {
        "paragraph": "The Jewell family’s old residence."
      },
      {
        "paragraph": "While Chester was swimming in the pool, his phone rang."
      },
      {
        "paragraph": "He swam toward his phone. As soon as he picked up the call handsfree, Shedrick’s voice rang out. “\nYoung Master Jewell, when you bumped into Eliza in the clubhouse today, did you do anything to her?”\n“What do you mean?” Chester asked sulkily as he wiped the water off his face."
      }
    ]
  },
  {
    "title": "Chapter 1989 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“What do you mean?” Chester wiped off his face."
      },
      {
        "paragraph": "“After Hailey went to Eliza’s house, she found that she had a fever at home, her clothes and hair were\nall wet.” Shedrick sighed. “Now I’m sent to the hospital. This week, all the activities will be done. I have\nto stop and estimate the loss is tens of millions.”"
      },
      {
        "paragraph": "Chester said after being silent for a while, “I can only watch her drunk and want her to wake up and\npress her head in the washbasin.”"
      },
      {
        "paragraph": "“Brother, I really convinced you.”"
      },
      {
        "paragraph": "Shedrick almost wanted to scold “grass”. Although Chester has long known that Chester is cruel, but at\nleast he is rarely seen to embarrass a beautiful woman except for his harsh words. There are also\nthose who are tired of playing and turn their faces ruthlessly, but they don’t want to do it themselves."
      },
      {
        "paragraph": "“You don’t know Eliza is the most afraid of water.” Shedrick said, “Don’t look at Eliza who is usually very\ndedicated in filming, but as long as she shoots in the water, she finds a stand-in for the scene. You still\nput her head in the water. the wonder of this real trouble. “"
      },
      {
        "paragraph": "Chester obscure the face look” As for you.”"
      },
      {
        "paragraph": "“Hey, I heard Hailey said she had been flooded so is the shadow hey, I told you not I went to the\nhospital to see her in person. She now has our company and lays golden eggs.” Shedrick hung up after\nspeaking."
      },
      {
        "paragraph": "Chester’s mind leaning against the water flashed through Eliza, who was in the club before, shaking\nand horrified after coming out of the water."
      },
      {
        "paragraph": "It turned out that she was afraid of water."
      },
      {
        "paragraph": "That woman even dared to stabbed him with a knife, and the woman was afraid of water."
      },
      {
        "paragraph": "No wonder she looks like that."
      },
      {
        "paragraph": "He lit a cigarette with a cold face."
      },
      {
        "paragraph": "He didn’t put on a bath towel until he finished sucking one of them and drove to the hospital after\nshowering it casually."
      },
      {
        "paragraph": "Late at night, in the hospital."
      },
      {
        "paragraph": "Eliza was admitted to the hospital, and the news was like a small stone dropped into the pond."
      },
      {
        "paragraph": "Chester walked in wearing a mask, and sometimes he heard several nurses whispering beside him."
      },
      {
        "paragraph": "“I heard that Eliza was sent to our hospital, true or false,?”"
      },
      {
        "paragraph": "“It is true that the emergency department is on duty. The colleague who saw it was reported to have a\nfever.”"
      },
      {
        "paragraph": "“I really like Eliza and I really want to get her to sign it.”"
      },
      {
        "paragraph": "“She lives now, and the hospital whose ward has already been sealed let us keep it secret unless we\ndon’t want to work anymore.”"
      },
      {
        "paragraph": "“”"
      },
      {
        "paragraph": "Chester went straight to the emergency department."
      },
      {
        "paragraph": "When Shedrick had just arrived, Hailey and his assistant were also there. The faces of the three people\nwho saw Chester personally came were all strange."
      },
      {
        "paragraph": "“How’s it going?” Chester fell on the bed, Eliza."
      },
      {
        "paragraph": "She did not wake up and closed her eyes with a delicate face, her small face was clean, she did not\nshow a trace of blood, and there was a needle in the back of her hand."
      },
      {
        "paragraph": "He only finds it funny."
      },
      {
        "paragraph": "Is it necessary? He pressed it down, and he was paying attention at the time. He didn’t think that it\nwould be overwhelmed by her and he wanted to teach her a long time."
      },
      {
        "paragraph": "This lesson is quite big, but Chester suddenly discovered that she was standing upright in front of her\nand talking back to him, her appearance was even more moving."
      },
      {
        "paragraph": "Eliza in his eyes should have a thorn, how could the rose be so weak."
      },
      {
        "paragraph": "Hailey said, “The doctor said that she had a fever of 39.”"
      },
      {
        "paragraph": "“Not too high.” Chester said lightly as a doctor who had a fever of 40 degrees."
      },
      {
        "paragraph": "Hailey was choked, or if Chester had her boss, he wanted to scold his mother."
      },
      {
        "paragraph": "Shedrick patted Hailey on his shoulder, “I have taken anti-fever medicine, but the doctor said she might\nhave been in a coma because she was frightened.”"
      },
      {
        "paragraph": "The ward was quiet again. Chester didn’t dare to speak."
      },
      {
        "paragraph": "Hailey and the assistant looked at Chester secretly, and no one knew what he wanted to do."
      },
      {
        "paragraph": "Although I heard that Chester wanted to pack Eliza a while ago, the news was that the two of them who\ndidn’t have the following did not care about it. I didn’t expect that Chester would come in person\ntonight."
      }
    ]
  },
  {
    "title": "Chapter 1990 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "At last, Shedrick decided not to stay in the ward. He said to the assistant, “Please keep watch on her\nhere. I’m going to take my leave first. Do inform me if she wakes up tomorrow.”"
      },
      {
        "paragraph": "After reminding her, he turned around and looked at Chester. “Do you want to leave with me?”"
      },
      {
        "paragraph": "“I’m on duty tonight, ” Chester said nonchalantly."
      },
      {
        "paragraph": "Shedrick was puzzled. Why did Chester have to be on duty when the hospital was his?"
      },
      {
        "paragraph": "Nevertheless, he was too lazy to ask Chester, so he left straight away."
      },
      {
        "paragraph": "After standing for a short while, Chester left the ward too. However, he went to the department of\ninternal medicine in the inpatient unit instead of going home."
      },
      {
        "paragraph": "The doctor on duty, Dr. Judson, was astonished to see him. “Dr. Jewell, why are you here tonight?”"
      },
      {
        "paragraph": "“Professor Webb just did his operation, and I’m quite worried.” Chester sat in front of his desk."
      },
      {
        "paragraph": "“Dr. Jewell, you’re such a responsible doctor,” Dr. Judson said with admiration."
      },
      {
        "paragraph": "However, Chester ignored him. He simply browsed through the medical record and played with his\nphone for a while."
      },
      {
        "paragraph": "At 1:00 a.m., he went to the emergency room."
      },
      {
        "paragraph": "Hailey had already left, and only the assistant was left, sleeping groggily by the bed."
      },
      {
        "paragraph": "Chester glanced at the IV infusion bottle and realized that the bottle was almost empty. Hence, he\nreached out to remove the tube and put in another new bottle."
      },
      {
        "paragraph": "Eliza suddenly jerked on the bed, but she was not awake. She was mumbling as if she had\nencountered something terrifying in her dream."
      },
      {
        "paragraph": "Chester bent over and approached her, only to hear her murmuring, “Save me. I don’t want to die.”"
      },
      {
        "paragraph": "A miserable look washed over her face. She even broke out in a cold sweat."
      },
      {
        "paragraph": "The assistant beside her woke up with a start and was shocked to find Chester here."
      },
      {
        "paragraph": "Chester was not bothered about how the assistant was looking at him. He patted softly on Eliza’s face\nto wake her up."
      },
      {
        "paragraph": "However, she was still unconscious. Even her face began to pale."
      },
      {
        "paragraph": "Chester’s expression changed slightly, and he quickly provided her with a nasal cannula. Only then did\nshe start to look better."
      },
      {
        "paragraph": "After that, Chester remained seated on the chair beside the bed. Seeing his serious expression, the\nassistant trembled with fear."
      },
      {
        "paragraph": "Eliza had a dream."
      },
      {
        "paragraph": "In the dream, she fell into the sea while she was fleeing. Surrounded by the icy seawater, she nearly\nlost her breath."
      },
      {
        "paragraph": "She even seemed to spot her dead body floating in the middle of the sea."
      },
      {
        "paragraph": "She died."
      },
      {
        "paragraph": "Ultimately, she died."
      },
      {
        "paragraph": "She knew that  she could not possibly use Eliza’s body forever. She was Charity, who was just  a soul\nat this point."
      },
      {
        "paragraph": "When one died, where would they go?"
      },
      {
        "paragraph": "However, she was dissatisfied."
      },
      {
        "paragraph": "She was dissatisfied that she died just like that."
      },
      {
        "paragraph": "She had yet to avenge her parents’ death. Given"
      },
      {
        "paragraph": "that Sarah was still alive, what gave her the right to reunite with her parents in the afterlife?"
      },
      {
        "paragraph": "No. She could not die."
      },
      {
        "paragraph": "She struggled to swim upward. It felt as if she had exerted all her energy to do that."
      },
      {
        "paragraph": "When she finally stuck her head out of the water, she saw a gleam of light."
      },
      {
        "paragraph": "Subsequently, an emotional voice sounded beside her ear. “This is wonderful. Lizzie, you’re awake. It\nfrightened me to see you unconscious for so long.”"
      },
      {
        "paragraph": "She finally came to her senses through her bleary eyes. She was a bit slow-witted at first, but after\nsome time, it finally occurred to her that the person was her assistant, Skyler Jayne."
      }
    ]
  },
  {
    "title": "Chapter 1991 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "That was when Charity recalled that she was not dead. Instead, she had re-entered Eliza’s body."
      },
      {
        "paragraph": "She almost lost her life again."
      },
      {
        "paragraph": "“Lizzie, last night… Mr. Jewell has been watching over you.” Skyler suddenly darted a careful glance at\nthe other end of the bed."
      },
      {
        "paragraph": "Only when Eliza turned her face did she notice Chester’s presence."
      },
      {
        "paragraph": "Chester had been here the whole of last night, but he did not expect her to be gentle to him when she\nwoke up. Nevertheless, he never thought she would give him such a frosty look."
      },
      {
        "paragraph": "“Is Young Master Jewell here because he’s worried that I’m still alive?” Eliza asked indifferently with an\nextremely hoarse voice."
      },
      {
        "paragraph": "Beside her, Skyler was so nervous that her heart skipped a beat. Luckily, Chester was not mad, but his\ngaze was dark."
      },
      {
        "paragraph": "“Why didn’t you tell me yesterday that you have a fear of water?” Chester asked while staring at Eliza’s\nghastly face."
      },
      {
        "paragraph": "“Did you give me a chance to tell you? In fact, have you ever treated me as a human?” Eliza chuckled,\nbut it seemed like a sneer. “Young Master Jewell, please leave. I’m exhausted, and honestly, I’m\ntraumatized by your face.”"
      },
      {
        "paragraph": "“Trauma can be overcome.” Chester straightened his body. “What do you want to eat? I’ll get someone\nto send the food over.”"
      },
      {
        "paragraph": "Eliza ignored him and turned to look at her assistant. “Get me a bowl of porridge.”"
      },
      {
        "paragraph": "The assistant felt uncomfortable, especially after she caught sight of Chester’s awful expression."
      },
      {
        "paragraph": "“Alright. I’ll go and get it now.” Skyler did not dare to linger around anymore and jumped at the\nopportunity to escape."
      },
      {
        "paragraph": "Eliza closed her eyes and could not be bothered with Chester."
      },
      {
        "paragraph": "Chester subconsciously wanted to take out his cigarette box. However, at the thought that he was in\nthe hospital, he fought back his urge. Eliza’s behavior now really infuriated him."
      },
      {
        "paragraph": "Since she was ignoring him, so be it."
      },
      {
        "paragraph": "He bent over and lowered his head to kiss her lips."
      },
      {
        "paragraph": "Although her lips were chapped due to fever, it did not prevent him from kissing her."
      },
      {
        "paragraph": "Eliza never thought he would do this. The moment she came to the realization that he was kissing her,\nshe resisted him by pushing him away."
      },
      {
        "paragraph": "Considering that she had been having a fever for one night, she had no strength to resist him."
      },
      {
        "paragraph": "Chester clutched her hands and pressed them before trying to deepen the kiss."
      },
      {
        "paragraph": "Nevertheless, Eliza closed her lips tightly so that he could not do it."
      },
      {
        "paragraph": "Anyway, Chester was not in a rush. So, he slowly kissed her lips over and over again while controlling\nher hands."
      },
      {
        "paragraph": "No longer able to put up with him anymore, Eliza did not hide the hatred in her eyes anymore. “\nChester, are you that desperate? You can’t even let a sick person off.”"
      },
      {
        "paragraph": "“I’m actually not very interested in you looking like that. I had no choice but to do this because you\nrefused to look at me or talk to me. ” Chester bent over and touched her chin. A smile spread across\nhis handsome face. He never thought that he would one day take liberties with a woman."
      },
      {
        "paragraph": "“Eliza, last night was my fault, but I didn’t know you have a fear of water.”"
      },
      {
        "paragraph": "“I know. ” Eliza answered impassively, “I haven’t recovered yet, and I’m exhausted. Can I rest now?”"
      },
      {
        "paragraph": "“Sure you can.” Chester stood still. Eliza grew impatient. “Can you leave?”"
      },
      {
        "paragraph": "“My legs are mine. You have no right to make me leave.” Chester raised his eyebrows and stared into\nEliza’s eyes."
      },
      {
        "paragraph": "“You’re right.”"
      },
      {
        "paragraph": "Eliza nodded weakly but did not talk to him after that."
      }
    ]
  },
  {
    "title": "Chapter 1992 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "In the Lodge."
      },
      {
        "paragraph": "Freya woke up from a hangover with the sunlight shining through the window."
      },
      {
        "paragraph": "She suddenly sat up, and her head hurt."
      },
      {
        "paragraph": "Was she not drinking with Eliza? Why did she end up here?"
      },
      {
        "paragraph": "Was it the next morning already?"
      },
      {
        "paragraph": "Freya did not feel good about the situation. She hurriedly put on her clothes and went downstairs. “\nAunty Loretta, where’s Dani…”"
      },
      {
        "paragraph": "Before she could finish her sentence, she saw Ryan sitting on the couch and carrying Dani in his arms\nwith a milk bottle in his hand. From her chubby face, Dani seemed content with the milk. What a cute\nbaby she was."
      },
      {
        "paragraph": "However, that scene was bizarre."
      },
      {
        "paragraph": "Upon noticing the noise, Ryan lifted his eyes and glanced at Freya. He did not say anything for fear of\ndisturbing Dani."
      },
      {
        "paragraph": "Instead, Aunty Loretta came with a basin of water and explained softly, “Young Master sent you home\nyesterday. You were drunk, but Dani insisted on having you take care of her, and I couldn’t deal with\nher alone, so Young Master coaxed her to sleep."
      },
      {
        "paragraph": "This morning, Dani made quite a fuss, and it was also Young Master who soothed her. Since she’s\nhungry, she’s drinking some milk again.”"
      },
      {
        "paragraph": "Those words made Freya guilty. Nevertheless, she never thought that Ryan would be able to soothe\nDani."
      },
      {
        "paragraph": "After Dani finished her milk, Ryan walked up to Freya with Dani in his arms."
      },
      {
        "paragraph": "Once Dani saw Freya, she stretched out her hands to ask for Freya to hold her."
      },
      {
        "paragraph": "Freya promptly carried Dani and apologized to her guiltily. “I’m sorry, darling. I promise not to get drunk\nanymore. I’m sorry…”"
      },
      {
        "paragraph": "She apologized non-stop, feeling sorry for her child."
      },
      {
        "paragraph": "Not only did she fail to provide Dani with a complete family, but she also did not fulfill her duty as a\nmother."
      },
      {
        "paragraph": "Ryan gazed at her with an unusually solemn face. “I hope you’ll do as you say.”"
      },
      {
        "paragraph": "Freya lifted her head meekly. “Thank you for yesterday.”"
      },
      {
        "paragraph": "“It was no trouble bringing a drunkard back.” Ryan frowned. “But I hope that it won’ t happen again.\nAfter all, Dani is a poor child. I understand that you’ve been occupied with the divorce matter and upset\nwith Rodney being quite close with Sarah recently. It’s only normal, but having said that, you need to\nthink for your child. Since you want to fight for her custody, you need to learn to be bold. She doesn’t\nhave her dad around, and her mom gets drunk. She might be young, but she does yearn for love.”"
      },
      {
        "paragraph": "His comments made Freya blush with shame. “I… I didn’t drink because of Rodney. I met Sarah\nyesterday and found out something from her, so I was very annoyed.”"
      },
      {
        "paragraph": "Ryan’s eyes became rather gentle, but he still said, “ When you’re annoyed, think about your child. She\nneeds you. I might’ve gone too far with my words, but no one can replace a mother’s role.”"
      },
      {
        "paragraph": "“Alright.” Freya nodded obediently, which was unusual."
      },
      {
        "paragraph": "“Go and have your breakfast. I need to go to work.” After pinching Dani’s cheek, Ryan turned around\nand made his way to the door."
      },
      {
        "paragraph": "As Freya watched him change his shoes at the door, she zoned out for a moment."
      },
      {
        "paragraph": "This scene was similar to Rodney heading out to work every morning when they used to live together\nthose days."
      },
      {
        "paragraph": "She shuddered in spite of herself and swiftly asked, “By the way, did you see Eliza when you were in\nthe clubhouse yesterday? Was she drunk?”"
      },
      {
        "paragraph": "Ryan was stunned. “When I arrived, only you and Chester were there. I only went because Chester\ninformed me about it.”"
      },
      {
        "paragraph": "“Chester?” Freya froze. “D*mn. Eliza seemed to have drunk a lot yesterday. Could Chester have done\nsomething to her?”"
      },
      {
        "paragraph": "“That’s impossible. Eliza probably left earlier yesterday.” Ryan reckoned that she might be overthinking\nthings but left after changing his shoes."
      },
      {
        "paragraph": "Freya promptly called Eliza. However, it was a man who answered the call. His voice rang a bell to her."
      },
      {
        "paragraph": "“Eliza, someone would like to speak to you.” “Chester, why is Eliza’s phone with you?” Freya was\nstupefied."
      }
    ]
  },
  {
    "title": "Chapter 1993 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Yeah. Her phone is with me.” Chester furtively glanced over at Eliza. “She’s having porridge on the\nbed.”"
      },
      {
        "paragraph": "Having porridge on the bed…"
      },
      {
        "paragraph": "His words made her think of something. Within a few seconds, a campy plot flashed in Freya’s mind.\nCould Chester have taken advantage of Eliza while the two of them were drunk yesterday and that they\njust only got up?"
      },
      {
        "paragraph": "Freya was worried sick. “Chester, you b*stard! What have you done to Eliza?”"
      },
      {
        "paragraph": "Her voice was so loud that Eliza heard what she said too. Could not bear with Chester anymore, Eliza\nextended her hand. “Chester, pass me my phone.”"
      },
      {
        "paragraph": "“Beg me.” Chester raised his brows."
      },
      {
        "paragraph": "Eliza had an overwhelming urge to throw the porridge at his face there and then, but she held it in."
      },
      {
        "paragraph": "She must not act on impulse when dealing with"
      },
      {
        "paragraph": "people like Chester. Who knew if he would duck her head into the sink?"
      },
      {
        "paragraph": "She did not want to go through what she did yesterday."
      },
      {
        "paragraph": "On the other end, Freya insisted on having Eliza answer the call. However, Chester responded, “ Eliza\ndoesn’t want to beg me. This means you’re not that important, so I’m going to hang up.”"
      },
      {
        "paragraph": "With that, he put the phone back into this pocket."
      },
      {
        "paragraph": "Eliza’s face turned grim. “Young Master Jewell, why are you being a jerk? That’s my phone.”"
      },
      {
        "paragraph": "“Really? I didn’t know. I picked it up yesterday. ” Chester smirked. “ If you treat me nicely, I might\nconsider returning it to you.”"
      },
      {
        "paragraph": "Eliza was tired, so she really did not want to be nice to him."
      },
      {
        "paragraph": "However, her phone contained a lot of secrets, as well as some important numbers. “Young Master\nJewell, I beg you to return the phone to me.”"
      },
      {
        "paragraph": "“Is this how you beg someone?” Chester remained still. “You’re so cold and distant.”"
      },
      {
        "paragraph": "“What do you want me to do then?” Considering Eliza’s head still hurt, she did not want to think too\nmuch."
      },
      {
        "paragraph": "Chester fixed his eyes on her chapped lips and then suddenly laughed. He said, “ I’ll return it to you if\nyou kiss me.”"
      },
      {
        "paragraph": "He specifically asked for a kiss but not a peck."
      },
      {
        "paragraph": "Eliza gazed at him silently, without uttering a word. This atmosphere made the assistant beside her feel"
      },
      {
        "paragraph": "awkward. “I’m going to the restroom.”"
      },
      {
        "paragraph": "She quickly gave an excuse to leave."
      },
      {
        "paragraph": "Chester curled his lips into a playful grin. “Your assistant knows what’s best for us, huh?”"
      },
      {
        "paragraph": "Eliza was filled with conflict and disgust. “My phone is only worth a few thousand dollars. I can buy a\nnew one and get a SIM card.”"
      },
      {
        "paragraph": "“Really? If you don’t see any worth in it, I won’t force you. ” Chester slowly rose to his feet. “This phone\nwill be mine then.”"
      },
      {
        "paragraph": "Seeing that Chester was about to leave, Eliza’s fists tightened under the blanket. “Hold on…”"
      },
      {
        "paragraph": "“Why? Are you hesitating?” Chester halted in his steps, his handsome face revealing a hint of evilness.\n“Everyone has some secrets in their phones. It all depends whether you think a kiss is more important\nthan your secrets.”"
      },
      {
        "paragraph": "Eliza clenched her teeth and stayed quiet for half a minute before her fists relaxed. “Come here.”"
      },
      {
        "paragraph": "Chester walked up to her bed. Then, he bent over and stared at her face. Although her features were\nexquisite, she looked haggard. Compared to those women he had encountered, she was indeed\nunattractive."
      },
      {
        "paragraph": "However, when he exchanged looks with her, he somehow felt like getting a taste of her."
      },
      {
        "paragraph": "Eliza approached his lips without saying anything. Chester noticed she had opened her mouth that was\ntightly shut just now, and her warmth began to surround him."
      },
      {
        "paragraph": "Her thin lips might be cold, but the kiss was hot and raw. There was even a taste of porridge in her\nmouth."
      },
      {
        "paragraph": "While bending over, Chester felt something in his spine."
      },
      {
        "paragraph": "He wondered if it was because he had not been with a woman for a long time."
      }
    ]
  },
  {
    "title": "Chapter 1994 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Or could it be that it was Eliza’s first time taking the initiative?"
      },
      {
        "paragraph": "To his surprise, he felt his heart racing madly. It was quite interesting. Soon, he turned into an active\nkisser too."
      },
      {
        "paragraph": "Before he could savor the kiss, Eliza had already left. The romantic sensation was still on his lips. “ I’m\ndone. Can I have my phone back?”"
      },
      {
        "paragraph": "Chester stared closely at her lips, which were initially pale but had turned pink after the kiss. There\nwere even sparkles in her eyes."
      },
      {
        "paragraph": "The itch in him to do something was very bad. It felt as though it had been scratched and that he could\nnot get enough of it."
      },
      {
        "paragraph": "He even had the thought of pressing her onto the bed regardless."
      },
      {
        "paragraph": "However, he was a rational person. After fixing his eyes on her for a while, he returned the phone to\nher. “Lizzie, you’re so sweet.”"
      },
      {
        "paragraph": "Eliza’s face was void of emotion."
      },
      {
        "paragraph": "Chester pinched her chin. “Don’t you feel shy?”"
      },
      {
        "paragraph": "“I think I need to brush my teeth, ” Eliza said calmly."
      },
      {
        "paragraph": "Chester’s gaze turned grave, but he soon let out a laugh. “You need to get used to this. You can’t\npossibly brush your teeth every time this happens."
      },
      {
        "paragraph": "After all, brushing too many times will damage your teeth.”"
      },
      {
        "paragraph": "With that, he left the ward."
      },
      {
        "paragraph": "Then, he walked to a window and could not help but light a cigarette. That kiss was d*mn amazing."
      },
      {
        "paragraph": "His rationality told him that he should not involve himself with Eliza because of Charity."
      },
      {
        "paragraph": "Nevertheless, that unscrupulous character of his would always try tempting him into the deep abyss,\never since he was young."
      },
      {
        "paragraph": "He wanted Eliza and yearned to get her. This thought had never been this strong."
      },
      {
        "paragraph": "In the ward, Eliza kept a cold face. However, she did not brush her teeth. Instead, she used tissue\npaper to wipe it violently."
      },
      {
        "paragraph": "God knew how badly she wanted to bite his tongue off."
      },
      {
        "paragraph": "The closer she got to Chester, the more disgusted she felt. The kiss was dirty and nauseating."
      },
      {
        "paragraph": "After calming down, she took her phone and gave Freya a call to explain the matter."
      },
      {
        "paragraph": "Upon hearing it, Freya was relieved. “You frightened the wits out of me. I thought Chester took\nadvantage of you because of me. Luckily, he didn’t, or I would never forgive myself. By the way, which\nward are you in? I’ll visit you.”"
      },
      {
        "paragraph": "Eliza told Freya her ward number."
      },
      {
        "paragraph": "Then, Freya contacted Catherine. By the time the two of them arrived at the ward, it was already 11:00."
      },
      {
        "paragraph": "As soon as they entered the ward, Catherine noticed that Eliza looked much more haggard and paler\nthan before."
      },
      {
        "paragraph": "She could not help but say with a frown, “How much did both of you all drink yesterday for Eliza to end\nup in the hospital.”"
      },
      {
        "paragraph": "Freya felt guilty, whereas Eliza smiled nonchalantly. “It had nothing much to do with drinking. I actually\ncaught a cold and had a fever last night.”"
      },
      {
        "paragraph": "“Why was Chester around this morning when you caught a cold and a fever?” Catherine found it\nstrange."
      },
      {
        "paragraph": "“He learned it from my manager. After all, I am signed to his company. ” Obviously, Eliza did not want to\ntalk much about it. “What’s more, my phone was with him yesterday.”"
      },
      {
        "paragraph": "Catherine nodded and said cautiously, “Anyway, you shouldn’t drink so much next time. It’s not good for\nyour health.”"
      },
      {
        "paragraph": "“I didn’t mean to do it. It was all because of Sarah.” Freya was sulky. “Fine. I won’t behave like this\nanymore. Ryan just taught me a lesson this morning. I’ll stay strong for Dani’s sake.”"
      },
      {
        "paragraph": "Eliza did not say a word. She was afraid that the mention of Sarah would make her lose herself."
      },
      {
        "paragraph": "“Alright. I know Sarah is wicked, but don’t worry. Shaun won’t let him off.” Catherine comforted her.\n“Eliza, let me peel an orange for you.”"
      },
      {
        "paragraph": "The two of them accompanied Eliza in the ward for half an hour before they left."
      }
    ]
  },
  {
    "title": "Chapter 1995 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya said with a frown, “Eliza must be tired  from all the drinking yesterday.  She usually says\nwhatever comes to mind, but today she looks  listless. Oh, I forgot to ask if she has had her hand\nbandaged too.”"
      },
      {
        "paragraph": "“Hand?” Catherine was puzzled."
      },
      {
        "paragraph": "“When I told Eliza what Sarah did to Charity yesterday, Eliza was so mad that she crushed the wine\nglass into pieces.” Freya sighed."
      },
      {
        "paragraph": "A glint flashed in Catherine’s eyes. “But she doesn’t know Charity. Why was she so mad?”"
      },
      {
        "paragraph": "“Why not? It’s normal for a humane person to be mad when they hear that.”"
      },
      {
        "paragraph": "Catherine went silent. If it were her, would she fly into a fit of fury and crush the wine glass into pieces?"
      },
      {
        "paragraph": "Of course, it was normal to be angry, but she would probably slap the table or smash the glass. In her\nopinion, people who did this would be those simmering with anger yet had no way to vent it."
      },
      {
        "paragraph": "“You, too, think that my argument makes sense, right?” Freya said with dissatisfaction, “Sadly, the hot\ncoffee didn’t ruin Sarah’s face yesterday.”"
      },
      {
        "paragraph": "“Drop it.” Catherine  looked at her seriously.  “ Freya, you’re now a mother. Can you please don’t act so\nimpulsively? It would be fine if you slapped or punched Sarah when you met with her yesterday. But if\nyou destroyed her looks in public, where they would be witnesses and physical evidence, you can g o\nto jail. Don’t expect that Rodney will hide the truth. After all, Sarah is his weakness.”"
      },
      {
        "paragraph": "Freya’s mouth opened, but her throat felt like it was stuffed with cotton."
      },
      {
        "paragraph": "After a while, she was overwhelmed with rage and discontent."
      },
      {
        "paragraph": "This was not the outcome she anticipated either. However, when Charity was in jail, she always used to\nvisit Boris, who was admitted to the hospital because he was exasperated. Due to that, she interacted\nwith Jennifer frequently, even more than Catherine did."
      },
      {
        "paragraph": "She knew full well that Jennifer was gentle and kind."
      },
      {
        "paragraph": "She still remembered the tearful look on Jennifer’s face, worried about her daughter and husband."
      },
      {
        "paragraph": "Yet, Jennifer died so miserably."
      },
      {
        "paragraph": "Sarah had destroyed the Neeson family, as well as Freya’s irreplaceable youth. She even made Freya\nhate Rodney, which was why Freya could not pull herself together."
      },
      {
        "paragraph": "However, after being reminded by Ryan and criticized by Catherine, Freya realized that she was too\nimpulsive and irresponsible."
      },
      {
        "paragraph": "Catherine patted her shoulder lightly. “I understand your pain. Charity is my good friend, and I respect\nAunty Jennifer as my elder. In fact, I’ve never forgotten how Sarah plotted against Shaun. But Shaun\nand I are trying to come up with an appropriate solution. Even if we want to take revenge against\nSarah, It’s not worth involving ourselves in it.”"
      },
      {
        "paragraph": "“I got it.” Freya nodded dejectedly."
      },
      {
        "paragraph": "The two of them took the elevator down. As soon as they walked out, they came across Rodney, who\nwas holding a lab sheet."
      },
      {
        "paragraph": "Since they were not too far away from each other, it didn’t take long for Rodney to catch sight of them.\nHis handsome face darkened, and his grim eyes settled on Freya. “Why are you guys here?” Are you\nguys planning to trouble Sarah again?”"
      },
      {
        "paragraph": "“So Sarah is staying here as well.” Seeing how protective he was of Sarah, Freya could not help but\nscoff. “Judging from her minor injuries, it’s a waste of resources for her to be hospitalized.”"
      },
      {
        "paragraph": "Rodney’s eyes flashed with fury. He gazed at Freya’s face that he used to find beautiful. However, the\nsight of her hysterical expression yesterday made him feel unfamiliar with her. “Freya, are you for real?\nDo you know how badly you burned her yesterday? If she hadn’t blocked her face with her hands, her\nface would’ve been ruined.”"
      }
    ]
  },
  {
    "title": "Chapter 1996 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“ I missed her face. What a shame, ” Freya teased."
      },
      {
        "paragraph": "“You…” Rodney’s eyes burst with anger. “Are you a human? Where’s your conscience? If you weren’t\nmy wife, I would’ve called the police on you. Also, Sarah keeps telling me not to look into the issue. All\nshe wants is to keep the peace, yet you can’t even let her off.”"
      },
      {
        "paragraph": "“In that case, I have to thank you for not having me arrested.” Freya laughed. At that moment, her\nhatred for Rodney intensified."
      },
      {
        "paragraph": "No matter how protective he was of Sarah back then, Freya would not hate him because it was his\nchoice to love Sarah. However, he should not use his love for Sarah against her."
      },
      {
        "paragraph": "Annoyed, Rodney undid the button on his shirt in front of his chest. “You don’t have to tease me. Ask\nyourself whether it was right to do what you did yesterday. You almost killed Sarah and ruined her\nentire life. Not only doesn’t she hate you, but she’s not calling the police either. Why can’t you learn to\nbe generous? Come with me and apologize to Sarah to beg for her forgiveness now.”"
      },
      {
        "paragraph": "With that, he reached out to grab Freya’s hand."
      },
      {
        "paragraph": "However, Freya acted faster by slapping him on the face while glaring at him resentfully. “You want me\nto come with you and apologize to her? Dream on. Even if she’s dead, I’ll trample all over her tomb in\nthe middle of the night.”"
      },
      {
        "paragraph": "With that, she dragged Catherine away with him. “ Cathy, let’s go.”"
      },
      {
        "paragraph": "She was worried that she would attack Rodney if she looked at him again."
      },
      {
        "paragraph": "Even so, Rodney refused to let her go. He stretched out his hands to stop the two of them. Then, he\nlowered his head and looked at Catherine. “I just want to know if Shaun’s memory has recovered. ”"
      },
      {
        "paragraph": "Needless to say, Catherine knew that denying would be the best choice. However, now that Rodney\nand Freya had come this far, it would be difficult for them to make peace with each other again.\nTherefore, she openly admitted it. “His memory has mostly recovered. He remembers most of his past\nexcept for some little things.”"
      },
      {
        "paragraph": "Rodney was astonished. “Sure enough, Sarah didn’t lie to me.”"
      },
      {
        "paragraph": "“It’s been almost half a month. Are you going to send Sarah overseas?” Catherine asked with her eyes\nfixed on him."
      },
      {
        "paragraph": "Rodney said embarrassedly, “At first, I planned to send her overseas two days ago. But since her hand\nhas been burned, it’ll take at least four to five days for her injury to heal. In fact, it’s uncertain whether\nshe can recover. But Freya, I beg you. After all, you’re my legal wife. I don’t want to investigate the\nmatter to find out who’s right and wrong. All I want from you is to apologize to her. Let’s bring other\nmatters to an end too, okay?”"
      },
      {
        "paragraph": "“Rodney, you just don’t understand how much seeing you standing in front of me is making me hate\nyou. I wish I could divorce you right now.”"
      },
      {
        "paragraph": "Freya immediately pulled Catherine and left. She could not be bothered to look at him anymore."
      },
      {
        "paragraph": "Rodney clutched her wrist with a grim expression."
      },
      {
        "paragraph": "Freya broke free from his clutch and walked away without turning back."
      },
      {
        "paragraph": "As he stared at her silhouette, Rodney felt disappointed and powerless."
      },
      {
        "paragraph": "He even began to blame Freya, wondering why she could never understand him nor put herself into his\nshoes."
      },
      {
        "paragraph": "On this day, Rodney was in and out of the hospital."
      },
      {
        "paragraph": "When Eliza was ready to head back home to rest after having an IV infusion in the afternoon, she\nhappened to see Rodney leaving."
      }
    ]
  },
  {
    "title": "Chapter 1997 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Skyler turned her gaze to where Eliza was looking, only to find a bunch of people walking in and out the\ndoor. “Lizzie, what are you looking at?”"
      },
      {
        "paragraph": "“ I’m looking at how well this hospital is doing. ” Eliza averted her eyes."
      },
      {
        "paragraph": "Skyler said with a smile, “All the hospitals are doing well. What’s more, the Jewell family hospital has\nthe best medical skills in Australia.”"
      },
      {
        "paragraph": "“I’ll come over tomorrow for IV infusion, ” Eliza said, “The doctor said I should have an infusion for three\ndays straight, right?”"
      },
      {
        "paragraph": "Skyler was taken aback as Eliza was known for going against the doctor’s instructions. This time,"
      },
      {
        "paragraph": "she was probably rather obedient because she was in poor health. “Actually, you can get a family\ndoctor over to your house to perform an IV infusion. After all, you’re a public figure…”"
      },
      {
        "paragraph": "“ It doesn’t matter. I feel more at ease having it in the hospital. ” As Eliza was speaking, she made her\nway to the door. “You must be exhausted from the past two days. I’ll ask my bodyguard to accompany\nme to deal with other matters. You can carry on with your work, and there’s no need for you to\naccompany me home later.”"
      },
      {
        "paragraph": "Once Eliza got home, she took her coat off and lay on the couch."
      },
      {
        "paragraph": "The chauffeur came in and closed the door. Then, he carefully put the fruit baskets on the overhead\ntable."
      },
      {
        "paragraph": "Eliza took out a box of cigarettes below the table in front of him. The minute she held the cigarette\nbetween two of her fingers, she exuded a sense of coldness. Then, she lit the cigarette and took a"
      },
      {
        "paragraph": "deep drag like a junkie."
      },
      {
        "paragraph": "Only those who knew her well would understand that this was her only way of venting her feelings\nwhen she felt most miserable."
      },
      {
        "paragraph": "After two solid minutes of silence, she said, “ Sarah will probably be in the burn unit for the next two\ndays. Now that Shaun’s memory has mostly recovered, Rodney trusts Sarah even more. I guess\nRodney will consider sending Sarah abroad once her wound gets better.”"
      },
      {
        "paragraph": "The chauffeur said, “ Sarah will probably try finding a way of staying here.”"
      },
      {
        "paragraph": "“Perhaps she has already found a way.” Eliza’s lower lip suddenly twitched."
      },
      {
        "paragraph": "A puzzled look washed over the chauffeur’s face."
      },
      {
        "paragraph": "Eliza softly exhaled some smoke from his mouth, making her appear hazy. “Didn’t someone spot\nRodney sleeping at Sarah’s place when he was drunk? To Sarah, the fastest way of gaining a foothold\nhere is to get pregnant. I’m sure she has plotted something. Furthermore, her hypnotic skills are very\npowerful. Hypnotizing a man to sleep with her is an easy task for her.”"
      },
      {
        "paragraph": "The chauffeur was so shocked that his jaw dropped. On second thought, it was difficult to prevent\nanything from happening when a man and a woman were together in a room the entire night."
      },
      {
        "paragraph": "“That’s why Sarah doesn’t mind being sent abroad. Once she’s pregnant, Rodney will eventually ask\nher to return.”"
      },
      {
        "paragraph": "Eliza laughed. She was the one who grew up with Sarah, so she knew her well enough. “But I can’t\nmake a move only after she’s back. After all, she’ll be pregnant with Rodney’s child. By then, the"
      },
      {
        "paragraph": "Snowden members will keep a closer watch of me, and I won’t have the chance to do it.”"
      },
      {
        "paragraph": "The chauffeur furrowed his brows nervously. “ These are just your assumptions. Moreover, Miss Jones\nand Young Master Hill will probably do something about it…”"
      },
      {
        "paragraph": "“Yeah. Sarah has too many enemies, but what to do? I want to kill her myself.” Eliza said grimly,  “ Plus,\nI won’t kill her in one go. I’ll torture her little by little. I want her to experience the worst feeling in the\nworld and suffer a living hell.”"
      },
      {
        "paragraph": "The chauffeur fixed his eyes on her amid the smoke. Seemingly, the exquisite, perfect celebrity he\nused to see on TV had transformed into a different person."
      },
      {
        "paragraph": "This look of hers was quite familiar to him. It was similar to when she caught Thomas and tortured him\nevery day— no, it was much crazier than that."
      },
      {
        "paragraph": "After a long time, the chauffeur said, “You were the one who granted me life. If it hadn’t been for you, I\nwouldn’t have come this far. I’m ready to sacrifice for you anytime. However, the hospital is filled with\npeople. I’m worried they’ll find out that it’s your doing…”"
      },
      {
        "paragraph": "“It’s fine. If they do, I’ll take full responsibility for it. You can leave.” Eliza’s tone was dull, yet it conveyed\na sense of hellish madness."
      },
      {
        "paragraph": "No one knew that Eliza had stepped into hell the moment Freya told her the truth yesterday."
      }
    ]
  },
  {
    "title": "Chapter 1998 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Eliza had already turned into a devil. All she wanted to do was take revenge, and nobody could stop\nher."
      },
      {
        "paragraph": "The next day, when Eliza headed to the hospital, she only brought her chauffeur and bodyguard along."
      },
      {
        "paragraph": "She was wearing a pair of shades and a cap. While she was having an IV infusion quietly in the\nemergency room, Chester entered in a white coat and a stethoscope around his neck."
      },
      {
        "paragraph": "“Are you feeling better?” Chester naturally extended his hand to touch her forehead."
      },
      {
        "paragraph": "Eliza subconsciously dodged his hand, leaving it stiffening in the air. Even so, he did not get angry but\nsmiled. “I’m just checking your temperature as a doctor. You don’t have to be nervous.”"
      },
      {
        "paragraph": "“Dr. Jewell, if I’m not mistaken, you’ re a leading doctor from the department of internal medicine.” Eliza\nlooked up and reminded him. However, her shades prevented the emotions in her eyes from being\nseen."
      },
      {
        "paragraph": "“Don’t say that. This hospital is mine, so I have the right to care for all the patients here.” Chester\nsuddenly grabbed her hand and checked her pulse rate."
      },
      {
        "paragraph": "Eliza looked down in surprise. “Are you checking m y pulse rate?”"
      },
      {
        "paragraph": "“Yes. Your body is too frail.” Chester gave a discreet smile. “Is it because you haven’t been sleeping\nwell? You usually have quite irregular periods, and you always stay up late too.”"
      },
      {
        "paragraph": "“I’m going to prescribe some medicine for you to take for a week. Take one dose every day to nurse\nyour health.” Chester frowned. “You may be young now, but your body might not be able to support you\nwhen you’re older. If you fall sick then, it’ll  take ten days to one month to recover.”"
      },
      {
        "paragraph": "“I do need to take care of my health. After all, I’m the goose that lays the golden eggs for your\ncompany. If I’m sick for a long time, it’ll affect your company’s earnings, ” Eliza said perfunctorily."
      },
      {
        "paragraph": "“I’m not bothered about the meager earnings.” Chester suddenly snorted. “Eliza, as a woman, why do\nyou want to live such a tiring life? I really don’t care about that small amount of money.”"
      },
      {
        "paragraph": "Eliza fell silent. With her shades covering half of her face, she gave nothing away. Only her pinkish lips\nwere visible."
      },
      {
        "paragraph": "Chester still remembered the indescribable feeling of the kiss yesterday, which seemed to have\nbrought him back to when he first kissed Charity. He was even savoring the aftertaste when he got\nhome last night."
      },
      {
        "paragraph": "His rationality and instinct conflicted."
      },
      {
        "paragraph": "His rationality told him that he should not be deeply involved with Eliza because of Charity."
      },
      {
        "paragraph": "Nevertheless, his instinct told him that all of him wanted her."
      },
      {
        "paragraph": "He believed that he might be a little abnormal just because he had not gotten her."
      },
      {
        "paragraph": "“Eliza, what do you want? I can give you anything.” Chester reached out to take off her shades."
      },
      {
        "paragraph": "Eliza shunned his hand away and suddenly  asked,  “ I saw Rodney yesterday. Is  Sarah in this hospital\ntoo? Freya said she injured Sarah’s hands.”"
      },
      {
        "paragraph": "“Mm.” At the mention of this issue, Chester’s tone became rather cold. It was as if he was averse to it."
      },
      {
        "paragraph": "Eliza lifted her head. “The day before yesterday, Freya said Sarah admitted killing Jennifer in front of\nher. Sarah even threw Jennifer’s ashes into the drain.”"
      },
      {
        "paragraph": "“Does Freya have any incriminating evidence?” Chester asked all of a sudden."
      }
    ]
  },
  {
    "title": "Chapter 1999 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“No. ” Sarah’s voice was too soft, so Freya didn’ t manage to record it. Eliza shook her head. “I used to\nstay in the same courtyard as Aunty Jennifer when I was young. She was very nice. I always went to\nher place to have meals. Charity was my friend. She died so miserably, and even her family was killed\nby Sarah…”"
      },
      {
        "paragraph": "Chester somehow felt something clenching his heart. He was so exasperated that he lowered his\nvoice. “So does it mean that you’ll be mine if I kill Sarah?”"
      },
      {
        "paragraph": "Eliza raised her head and looked at him before saying firmly, “ I’m aware of your feelings for me. You\nwon’t pursue me.”"
      },
      {
        "paragraph": "“Don’t underestimate yourself. ” Chester laughed. Despite saying that, he admired her quite a lot."
      },
      {
        "paragraph": "Those women who approached him back then did not know their position. They always tried to win his\nheart."
      },
      {
        "paragraph": "“Sarah has Rodney backing her. Rodney is your good friend, and moreover, his identity is unusual."
      },
      {
        "paragraph": "A smart person like you won’t have a falling-out with your buddy for the sake of a woman.”"
      },
      {
        "paragraph": "Chester did not deny it. It was true that he was on bad terms with Rodney, which explained why he\nhardly interacted with him during this period. Even so, he did not wish to have a sour relationship with\nhim. After all, Rodney was different from before."
      },
      {
        "paragraph": "However, Chester could understand Eliza’s mood. “ Don’t worry. Even if I don’t lend you a hand, Shaun\nwill do something about it.”"
      },
      {
        "paragraph": "“Don’t get me wrong. Actually, I’ve never thought of taking revenge. Indeed, I hate Sarah very much,\nbut even Freya and Catherine can’t do anything to her. I know my limits. I’m just… curious about\nSarah.”"
      },
      {
        "paragraph": "Eliza suddenly said, “ It should be okay for me to meet her, right? I wonder what kind of a woman she\nis, considering how much she has wronged Freya, Catherine, and Charity. I want to see if she’s\nsuperhuman or has stunning looks.”"
      },
      {
        "paragraph": "“ She’s not superhuman, nor is she considered to have… stunning looks.”"
      },
      {
        "paragraph": "Chester’s perfectly handsome face moved closer to her, revealing an evil smile. “There’s no issue\nmeeting her since she’s right in this hospital. But if you want my help, you should show your\nappreciation to me, shouldn’t you?”"
      },
      {
        "paragraph": "His eyes clearly revealed hints of flirting. “ I can tell you where she is, but if you’re going alone, you\nwon’t even be able to approach the door. Rodney cares about her a lot. There are bodyguards outside\nher ward.”"
      },
      {
        "paragraph": "“B*stard.” Eliza did not conceal her hatred. “No wonder Freya wants to divorce him.”"
      },
      {
        "paragraph": "“I approve of her decision too.” Chester nodded."
      },
      {
        "paragraph": "Deep down, Eliza teased, ‘What gives you the right to approve of her decision? You’re much more\ndisgusting and wicked than Rodney.’"
      },
      {
        "paragraph": "Nevertheless, she took Chester’s hint but she did not want his kisses anymore. God knew how many\ntimes she brushed her teeth after she got home yesterday. “Young Master Jewell, I can’t say that you’re\ntrying to pursue me, nor am I qualified for that. Having said that, even if you’re interested in me, you"
      },
      {
        "paragraph": "have to give me some benefits. If you have a kept woman, you’ll need to pay her before sleeping with\nher.”"
      },
      {
        "paragraph": "“Do you mean that I can kiss you after letting you meet Sarah?” Chester was deep in thought. “Eliza,\ndon’t trick me. I’m not the sort you can afford to trick.”"
      },
      {
        "paragraph": "“You’re too concerned about getting things straight. It’s quite dull to be with you. ” After Eliza finished\nspeaking and stared at him for a while, she took the initiative to kiss him."
      },
      {
        "paragraph": "While Chester was still pondering over her words, she kissed him of her own accord. He boldly held her\nhead. As he had gained the experience yesterday, it was much smoother today."
      },
      {
        "paragraph": "He used to have no interest in acts like kissing, which involved lips pressing against each other. Plus,\nas a doctor, he was knowledgeable and had always found it unhygienic."
      },
      {
        "paragraph": "However, he started to be swayed."
      },
      {
        "paragraph": "With the woman’s unique breath and fragrance entering his lungs, Chester kissed her more deeply."
      }
    ]
  }
]