[

  {
    "title": "Chapter 1751 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Minister Snow, thank you so much.” Wesley showed a look of heartfelt gratitude. “Don’t worry, I’m not a\nman with traditional values either. Since Miss Mead has taken a fancy to Shaun, I’ll let her keep him.”"
      },
      {
        "paragraph": "“Hannah, look how magnanimous Wesley is.” Gavin smiled at Hannah. “I’ve already told you the truth.\nShaun is not who he used to be. With his status now, I wouldn’t even want him to work as our janitor.\nHow can I agree to your marriage? But since you like him so much, I don’t mind if you keep him as a\ndog.”"
      },
      {
        "paragraph": "“Dad…”"
      },
      {
        "paragraph": "Hannah was shocked."
      },
      {
        "paragraph": "She never thought that Wesley and her father had already reached such an agreement in private."
      },
      {
        "paragraph": "She looked at Shaun anxiously."
      },
      {
        "paragraph": "Shaun trembled in anger and shook her off. “So you wanted me to bring the children here because you\nwant to use them to threaten Catherine.”"
      },
      {
        "paragraph": "“Of course.” Wesley gave him a fake smile. “Did you think that the Mead family liked you? Shaun Hill,\nyou’re not who you used to be anymore. If it weren’t for Hannah liking you, you wouldn’t even be worthy\nof being their dog.”"
      },
      {
        "paragraph": "“That’s enough, Wesley. Stop talking.” Hannah glared at Wesley."
      },
      {
        "paragraph": "“Did I say anything wrong? Miss Mead, would you like me to remind you how he looked down on you\nbefore? Do you remember what Catherine and he did in your bathroom on your birthday? ” Wesley said\nsinisterly, “At that time, Shaun was so stubborn and proud. Haha, it’s a shame that… Well, as long as"
      },

      {
        "paragraph": "you kneel in front of us and wag your tail and lick my shoes clean, we can reward you by letting you eat\nwith the Mead family. Otherwise, there’s still your mother in Hill Manor. Many people in Canberra are\neager for a taste of her.”"
      },
      {
        "paragraph": "Shaun’s fists clenched violently."
      },
      {
        "paragraph": "His dark eyes looked like he wanted to kill Wesley on the spot."
      },
      {
        "paragraph": "Gavin also burst out laughing. “That’s true. Shaun, when your mother was young, she was the greatest\nbeauty in Canberra. I have a few friends who pursued your mother before but were looked down o"
      },
      {
        "paragraph": "n by her. Although she’s a little old now, it won’t be bad to play with her a little.”"
      },
      {
        "paragraph": "“Shut your mouth!” Shaun’s eyes burst with angry flames as he charged at Gavin."
      },
      {
        "paragraph": "Wesley suddenly pulled out a gun and smiled at him. “Come closer and I’ll shoot you. Even if you die\nhere today, no one will dare to do anything to me.”"
      },
      {
        "paragraph": "Gavin smiled and did not say anything."
      },
      {
        "paragraph": "Shaun was furious. “Prime Minister Snow is also here today. This country doesn’t belong to the Mead\nfamily.”"
      },
      {
        "paragraph": "Wesley glanced at Gavin and gave him a cunning smile. “Minister Mead, did you hear that? Why don’t\nI… make this country belong to you tonight?”"
      },
      {
        "paragraph": "“Haha, I believe you, Wesley.” Gavin exhaled a ring of smoke languidly. “In the future, you’ll dominate the\nbusiness world in this country, while the political world will be left to me.”"
      },
      {
        "paragraph": "“You…”"
      },
      {
        "paragraph": "Shaun’s face was appalled."
      },
      {
        "paragraph": "“Shaun, stop talking.” Hannah was afraid that he would say something else to anger Wesley and Gavin.\nHe hurriedly said, “Just… bear with it. Do you want your mom to get into an accident at her age? Your\ngrandparents are still around as well. As long as you’re with me, I’ll protect your family.”"
      },
      {
        "paragraph": "Shaun glared at her with hatred."
      },
      {
        "paragraph": "He looked like he wanted to eat her whole, but he could only grit his teeth in humiliation and hold back."
      },
      {
        "paragraph": "“Hannah, remember your identity. You’ll be the prime minister’s daughter soon. How can you be\ninfluenced by a man?” Gavin slowly stood up.“ If you want, I can send him to your bed tonight and let him\nserve you well.”"
      },
      {
        "paragraph": "“Dad…” Hannah was a little elated."
      },
      {
        "paragraph": "Originally, she was a little upset, but she did want to see Shaun behaving obediently in front of her."
      },
      {
        "paragraph": "Wesley also smiled. “Miss Mead, with your  status, it’s not necessary to humble yourself to please a man.\nMaybe Shaun had that  qualification  in the past, but without Hill Corporation  now,  do you think he’s\nworthy of you to please him?”"
      },
      {
        "paragraph": "Hannah was slightly tempted."
      }
    ]
  },
  {
    "title": "Chapter 1752 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Hannah knew about the Mead family’s plan. Yes, she was going to be the prime minister’s daughter in\nthe future."
      },
      {
        "paragraph": "She thought of how powerless Shaun was earlier in front of Wesley. Actually, he was quite useless."
      },
      {
        "paragraph": "She liked men who were strong and capable. Shaun used to be like that in the past, but now…"
      },
      {
        "paragraph": "“Hannah, did you forget what you said to me before?” Shaun stared at her anxiously. “You said you love\nme.”"
      },
      {
        "paragraph": "When she saw his anxious expression, she suddenly lost interest in him. “I do love you, but you always\nmake me take the initiative. Shaun, I can promise you that as long as you behave in the future and\nbelong only to me, I can guarantee your safety. Are you willing?”"
      },
      {
        "paragraph": "“If I’m not?” Shaun clenched his fists."
      },
      {
        "paragraph": "“If you’re not, then you won’t even be able to crawl out today.” Gavin barked out a cruel laugh. “That’s\ngood. We can let your mom accompany my friends in the business world.” Shaun’s eyes trembled."
      },
      {
        "paragraph": "He took a deep breath and lowered his eyes in humiliation. “Fine. I’ll listen to Miss Mead in the future.”"
      },
      {
        "paragraph": "“Hehe, you’re such a good boy, Shaun.”"
      },
      {
        "paragraph": "Hannah was so delighted that she forgot that she had originally brought Shaun here to get her parents to\nagree to let them marry."
      },
      {
        "paragraph": "“No, Shaun, that’s not it.  You should  say that you’re willing to be a dog for Miss Mead. ” Wesley put the\ngun against Shaun’s temple and warned in a low voice."
      },

      {
        "paragraph": "“I’m willing to be a… dog for Miss Mead. ” Shaun lowered his head as his eyes raged with a cold light."
      },
      {
        "paragraph": "“Haha, how interesting! That’s so funny! ”"
      },
      {
        "paragraph": "The room echoed with the laughter of the crowd."
      },
      {
        "paragraph": "Gavin was very happy. “The man who used to be the richest person in the country, Young Master Hill, is\nwilling to be the Mead family’s dog. How interesting!”"
      },
      {
        "paragraph": "“Minister Mead, this is just a little appetizer."
      },
      {
        "paragraph": "Things will become even more interesting.” Wesley reminded him with a smile."
      },
      {
        "paragraph": "“That’s right. Wesley, the wisest decision I made in my life was choosing to work with you.” Gavin patted\nhis shoulder. “I can hardly wait.”"
      },
      {
        "paragraph": "As soon as the words left his mouth, a bodyguard’s voice came from outside. “Minister Mead, Prime\nMinister Snow and his family have arrived.”"
      },
      {
        "paragraph": "“Let’s go and greet Prime Minister Snow.” Gavin brought his wife downstairs. “Hannah and her dog, hurry\nup and follow us.”"
      },
      {
        "paragraph": "“Go on,” Wesley whispered in Shaun’s ear,“ Actually, it’s quite good for you to be Hannah’s dog. You’ll be\nable to see Catherine be a b*tch for me.”"
      },
      {
        "paragraph": "Then, he laughed and walked off."
      },
      {
        "paragraph": "He did not see how fierce and poisonous Shaun’s eyes were as they stared at his back."
      },
      {
        "paragraph": "Downstairs."
      },
      {
        "paragraph": "Nathan’s family of three, as well as Jason and Rodney, appeared in the banquet hall."
      },
      {
        "paragraph": "“Welcome, Prime Minister Snow. It’s a great honor to have you here for my birthday party.” Gavin smiled\nbroadly as he walked up to shake hands."
      }
    ]
  },
  {
    "title": "Chapter 1753 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Nathan also smiled and shook hands with Gavin. “To think that when we met, Hannah was still in\nelementary school. More than ten years have passed in the blink of an eye.”"
      },
      {
        "paragraph": "“It sure has.” Gavin looked at Ryan behind him. “At that time, your Ryan was also quite young. Now, he\nhas grown up to become your right-hand man.”"
      },
      {
        "paragraph": "Ryan quickly stood up and said politely, “Uncle Gavin, Dad’s most capable right-hand man is you. Today\nis your 5oth birthday, so Dad specially asked someone to prepare a gift for you. Look.”"
      },
      {
        "paragraph": "He opened the box and revealed ginseng inside. “ This ginseng is 300 years old. Dad got people to\nsearch for it for a long time before finally getting it. It’s said the older the ginseng is, the more it can\nprolong one’s life.”"
      },
      {
        "paragraph": "“Haha, thank you. I’ve been feeling a little ill recently. Prime Minister Snow, you’re too compassionate.”\nAlthough that was what Gavin said, he only told someone to take the ginseng without looking at it much."
      },
      {
        "paragraph": "Nathan’s deep eyes overflowed with a faint smile, and he pretended as though he did not see it."
      },
      {
        "paragraph": "However, the gazes of the dignitaries and nobles by the side lingered between the two of them with odd\nlooks."
      },
      {
        "paragraph": "Gavin smiled like an old fox. “Prime Minister Snow, why isn’t Chairman Snow here today? Is it because\nhe looks down on the birthday party of a small minister like me?”"
      },
      {
        "paragraph": "“My dad is a little busy today, so he sent me here instead.” Rodney was dressed in a feminine pink shirt,\nlooking like a rich young master who did not know anything about the world. “Besides, my uncle is the\nprime minister and he personally came. Uncle Gavin, are you still not satisfied with that?”"
      },

      {
        "paragraph": "“I am, of course, I am. But your father and I have known each other for many years. I personally sent an\ninvitation a few days ago, so I didn’t expect him not to come.”"
      },
      {
        "paragraph": "Gavin gave an insincere smile and pointed at Wesley behind him. “chairman Lyons came today too and\nwas just saying how he has admired chairman Snow for a long time. He wanted to meet him in person to\nchat with him. I even said that I would introduce Chairman Snow to him.”"
      },
      {
        "paragraph": "Nathan glanced at Wesley. “You must be Wesley Lyons from Golden Corporation. You’re quite famous\nrecently. I heard a few days ago that you made the top rank in the list of the world’s richest people.\nYou’re quite young and talented.”"
      },
      {
        "paragraph": "“He’s not that young,” Rodney said lazily, “He’s two years older than me.”"
      },
      {
        "paragraph": "Wesley’s thin lips curled slightly. “I heard that Young Master Snow isn’t on the list this time. Young Master\nSnow, you should work hard. I hope that you’ll reach the top 20 in two years.”"
      },
      {
        "paragraph": "Rodney’s handsome face changed slightly. “ President Lyons, it’s better to keep a low profile. Don’t be\ntoo complacent, or else you might capsize.”"
      },
      {
        "paragraph": "“Rodney, President Lyons is my friend. You’re embarrassing me by saying that.” Gavin’s eyes darkened\nslightly, and he seemed to be giving a warning."
      },
      {
        "paragraph": "Rodney sneered and was just about to speak when Nathan pressed on his shoulder gently. “Rodney,\nwhat you said was indeed not very polite. Apologize to President Lyons and Minister Mead.”"
      },
      {
        "paragraph": "“Uncle…” Rodney revealed a look of great annoyance."
      },
      {
        "paragraph": "“Hurry up,”  Nathan warned in a low voice."
      },
      {
        "paragraph": "Rodney gritted his teeth and said, “Uncle Gavin, President Lyons, I’m sorry.”"
      },
      {
        "paragraph": "“It’s okay. Young men are like that. It’s normal to envy others. But Rodney, don’t always think about\nrelying on your own family. You have to work hard too.” Gavin laughed. “By the way, aren’t you close to\nShaun? He’s here as well. That boy is really polite. He insisted on being the Mead family’s dog and\nwouldn’t listen no matter how much I told him not to. I really couldn’t stop him.”"
      },
      {
        "paragraph": "The moment those words were spoken, the people watching immediately went into an uproar."
      },
      {
        "paragraph": "“What? That can’t be, ”  a young man from the Jarvis family said.  “Who’s Eldest Young Master Hill? He\nused to be the most powerful man in the"
      },
      {
        "paragraph": "country. But instead of acting like a man, he wants to be a dog for the Mead family?”"
      },
      {
        "paragraph": "“That’s right. Has the Hill family fallen this far down?”"
      },
      {
        "paragraph": "“Don’t you see how he’s standing behind Hannah without saying a word? Isn’t that exactly what it looks\nlike?”"
      },
      {
        "paragraph": "“But I heard a few days ago that he was still pursuing Hannah.”"
      },
      {
        "paragraph": "”Hah. How would Hannah take a liking to him? She’s probably just toying with him.”"
      }
    ]
  },
  {
    "title": "Chapter 1754 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "The people chattered."
      },
      {
        "paragraph": "Shaun kept his head lowered. Hannah looked back at him, and after feeling some contempt for him, she\nstarted feeling smug."
      },
      {
        "paragraph": "Rodney turned pale with anger and bit his cheeks fiercely."
      },
      {
        "paragraph": "“Shut your mouths! ” He snapped at the people who were talking. “ Shaun is my brother. You’d better\nwatch your words.”"
      },
      {
        "paragraph": "“That won’t do.” Wesley laughed. “He’s going to be a dog. If you want to be his brother, then you—”"
      },
      {
        "paragraph": "“How dare you?” Nathan interrupted him coldly, the aura emanating from his body making the crowd\nflinch."
      },
      {
        "paragraph": "However, Wesely and Gavin did not care at all."
      },
      {
        "paragraph": "“Prime Minister Snow, President Lyons is my friend. You shouldn’t yell at him like that.” Gavin smiled\nvaguely with a hint of warning in his tone."
      },
      {
        "paragraph": "The crowd looked at Gavin in shock. However, after thinking of how things were beginning to stir in the\ncapital recently, they kept their mouths shut."
      },
      {
        "paragraph": "When the big fish fought, little shrimps like them had better stay quiet."
      },
      {
        "paragraph": "“Minister Snow, he’s just a businessman. Am I not even qualified to reprimand him?” Nathan said with an\nexpressionless face."
      },

      {
        "paragraph": "Wesley smiled and said, “I didn’t mean to insult Young Master Snow. It was him who said that Shaun is\nhis brother.”"
      },
      {
        "paragraph": "“That’s right. He’s the one without self-respect. Who is to blame?” Gavin hooked his fingers at Shaun.\n“My shoes are dirty. Come here and lick them clean.”"
      },
      {
        "paragraph": "Everyone looked at Shaun in schadenfreude. Shaun’s body stiffened motionlessly."
      },
      {
        "paragraph": "“Hurry up and go, ” Hannah whispered to him."
      },
      {
        "paragraph": "Shaun finally turned his head to look at her. His eyes were dark like a wolf’s, making Hannah shiver for\nno reason."
      },
      {
        "paragraph": "However, when she remembered that she would be the prime minister’s daughter soon, she simply\nraised her hand and slapped him. “Didn’t you hear what I said?”"
      },
      {
        "paragraph": "She suddenly felt quite good after slapping him."
      },
      {
        "paragraph": "In the past, Shaun looked down on her and acted high and mighty."
      },
      {
        "paragraph": "Now, she could trample on him however she wanted. It was even more satisfying than letting him marry\nher."
      },
      {
        "paragraph": "“Stop!” Rodney roared. “Hannah Mead, how dare you hit him? Who do you think you are?”"
      },
      {
        "paragraph": "“What? Can’t my daughter hit a dog?” Gavin said coldly."
      },
      {
        "paragraph": "“Gavin Mead, what do you mean?” Rodney stepped forward. “As the saying goes, before you hit a dog,\nlook at who its owner is. Shaun is my friend and my brother. My uncle is the prime minister. Aren’t you\ncompletely disrespecting the Snow family now?”"
      },
      {
        "paragraph": "As soon as those words were spoken, the entire banquet was engulfed in a pin drop silence."
      },
      {
        "paragraph": "Everyone looked at Prime Minister Snow with trepidation."
      },
      {
        "paragraph": "“Minister Mead, you’re not trying to slap Shaun but me, aren’t you?” Nathan’s deep gaze looked at\nGavin."
      },
      {
        "paragraph": "Now that things had come to this point, Minister Mead also stopped pretending. He glanced at Wesley\nand laughed. “Prime Minister Snow, you’re too much. I’ve done so much for the Snow family these years,\nbut on my birthday today, your nephew yelled at me because of a dog. I think that you’re the one who\nwants to slap me instead. How about this? If your nephew kneels and gives me an apology, I’ll let what\nhappened today drop.”"
      }
    ]
  },
  {
    "title": "Chapter 1755 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Ryan’s expression was cold. “You want a member of the Snow family to kneel to you? Are you trying to\nrebel?”"
      },
      {
        "paragraph": "“Haha, I’m not trying to rebel, but I just think that the prime minister isn’t as good as me. I also want to\ntaste the feeling of being in control of the country.” Gavin chuckled and smiled sinisterly."
      },
      {
        "paragraph": "Nathan’s eyes were instantly covered with a layer of frosty gloom. “Looks like this feast tonight is being\nheld with other intentions in mind.”"
      },
      {
        "paragraph": "He clasped his hands behind his back and walked around, looking at the guests present with a dark\ngaze."
      },
      {
        "paragraph": "They were all his officials, but now, they were standing at the side with trepidation. They did not utter a\nsingle word."
      },
      {
        "paragraph": "“Haha, that’s not true. After all, today is my birthday,” Gavin said loudly, “To tell you the truth, I don’t really\nthink much of the ginseng you gave  me. Just give me the power in your hands instead. Besides, you’ve\nalready had a taste of what it’s like to be the prime minister. Think about it. If it weren’t for me supporting\nyou all these years, you might not even be able to sit in this position, right?”"
      },
      {
        "paragraph": "Nathan did not say anything, but Ryan could not hold back his anger anymore. He accused furiously and\nyelled, “You’re shameless! If it weren’t for my father, would you be able to come to Canberra and have\nwhat you have now? A person should know how to be content with what he has. You’re already someone\nwho stands above tens of thousands of others.”"
      },
      {
        "paragraph": "“You stinking brat, I’m talking to your father! Who are you to tell me what to do? Scram!” Gavin slapped\nhis hand away. “I don’t want to be second- best. I want to stand above all else.”"
      },

      {
        "paragraph": "Ryan’s body trembled with anger. “You’re courting Before he could finish, Wesley aimed his gun at him. “I\nthink you’re the one courting death.”"
      },
      {
        "paragraph": "Ryan froze, not daring to move."
      },
      {
        "paragraph": "Nathan slowly narrowed his eyes. “Gavin, are you really trying to rebel? Did you really think that I’d dare\ncome here without making any preparations? Guards…”"
      },
      {
        "paragraph": "He let out a low shout, but there was no movement outside."
      },
      {
        "paragraph": "“It seems like no one is listening to you.” Gavin clapped his hands. “Guards…”"
      },
      {
        "paragraph": "The team of guards that was supposed to belong to the Snow family instantly sprang up from all sides,\npointing their guns at the Snow family."
      },
      {
        "paragraph": "A senior captain stepped out and knelt on one knee in front of Gavin. “Team Nine pledges allegiance to\nMinister Mead from today onward.”"
      },
      {
        "paragraph": "“Finn, I single -handedly trained you but you dare to betray me?” Nathan turned pale. Team Nine was the\nmost loyal and closest team around him and was responsible for his personal safety. He did not expect\nthem to change to Gavin’s side."
      },
      {
        "paragraph": "“A wise man submits to circumstances.” Finn snorted coldly. “Besides, nine teams have already jumped\nship to work for Minister Mead. He promised us higher positions and more money. It’s natural to progress\naccording to our own ideals. ”"
      },
      {
        "paragraph": "“What about you guys?” Nathan looked at the guests coldly. “Are you all going to betray me? Don’t forget\nthat you were all supported by me.”"
      },
      {
        "paragraph": "The crowd trembled. A man in his 5os stepped forward and mustered up the courage to say, “ Minister\nMead, Prime Minister Snow really did treat us—”"
      },
      {
        "paragraph": "Before he could finish, Finn opened fire and the man instantly fell to the floor, dead."
      },
      {
        "paragraph": "The guests were instantly horrified, and none of them dared to speak. Some people stood up and tried to\nfawn over Gavin. “I think that Minister Mead is more capable. Nathan, just hand over your power and let\nMinister Mead manage the country. I believe that under Minister Mead’s leadership, Australia will reach\neven higher.”"
      },
      {
        "paragraph": "“Minister Mead? Just call him Prime Minister Mead. Prime Minister Mead, we’ll listen to you.”"
      },
      {
        "paragraph": "“Prime Minister Mead, I’ve always felt that you were more suitable to be prime minister. After Nathan\ncame to power, Australia’s economy was tossed into disarray. You’re much more capable than him.”"
      }
    ]
  },
  {
    "title": "Chapter 1756 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Prime Minister Mead, the Jarvis family is willing  to donate 5o billion dollars to support your\nadministration.”"
      },
      {
        "paragraph": "All of a sudden."
      },
      {
        "paragraph": "The banquet hall was full of flattery."
      },
      {
        "paragraph": "Gavin laughed in triumph at all the praise. “Well, since you’re all so discerning, I can’t let you down.\nNathan, hand over the prime minister’s seal, or I’ll have no choice but to kill your family’s descendants\nfirst.”"
      },
      {
        "paragraph": "With his command, the guards pointed their guns at Rodney, Ryan, and the others."
      },
      {
        "paragraph": "“You… You…” Nathan shook like a leaf. His eyes swept over the guests in the banquet hall one by one.\nThey were once the people he relied on the most, but he did not expect them all to betray him today."
      },
      {
        "paragraph": "“Hurry up,”  Gavin warned, saying, “Or I’ll start with your nephew.”"
      },
      {
        "paragraph": "He waved his hand, and the guards immediately grabbed Rodney."
      },
      {
        "paragraph": "“Stop.” Nathan quickly raised his hand. He glared fiercely at Gavin. “I’m curious where you got the\nmoney to buy off these people.”"
      },
      {
        "paragraph": "His gaze fell on Wesley. “It’s him, right?”"
      },
      {
        "paragraph": "Wesley’s thin lips curled into a smirk. “Prime Minister Snow, before you became the prime minister, I had\nsome dealings with your family at several banquets. Unfortunately, the Snow family felt that my status\nwas too low and looked down on me. It was Prime Minister Mead’s discerning eyes that made me what I\nam today.”"
      },

      {
        "paragraph": "“Nathan, it’s thanks to how blind you were before,” Gavin patted Wesley’s arm and said smugly,“ Wesley\nis a rare talent. You supported Shaun in the past, but I bet you didn’t expect things to turn out like this.\nNow, the business world is in the hands of the Lyons family. I already plan to marry my daughter to him.\nBy then, the Mead family will have the final say in the country.”"
      },
      {
        "paragraph": "“I was indeed blind.” Nathan let out a long sigh and shook his head helplessly. “In other words, I didn’t\njust lose to you tonight. I lost to Wesley too.”"
      },
      {
        "paragraph": "“With those eyes, you can’t be prime minister. It’s time for you to get lost.” Wesley walked up to Rodney\nand patted his face. “Don’t you agree, Young Master Snow? Back then, with your status as Young Master\nSnow and Shuan’s friend, you looked down on me terribly. What should I do to you today?”"
      },
      {
        "paragraph": "As he spoke, he raised his hand toward Finn, who immediately took a knife and put it in his hand."
      },
      {
        "paragraph": "Wesley took the knife and pressed it against Rodney’s ear. “Shall I cut off your ear first?”"
      },
      {
        "paragraph": "Rodney’s beautiful eyes looked at him for a few seconds before he suddenly smiled. “Wesley, do you\nreally think you’re the most powerful person in the country? Do you think you’ll soon become the one in\ncontrol since Golden Corporation’s business has expanded internationally and Jeffery has taken over Hill\nCorporation?”"
      },
      {
        "paragraph": "“Of course.”"
      },
      {
        "paragraph": "The person in front of him suddenly calmed down, which made an ominous feeling rise inexplicably in\nWesley’s heart."
      },
      {
        "paragraph": "However, he told himself that Rodney was just scaring him. After all, everything was under his control."
      },
      {
        "paragraph": "Rodney let out a strange laugh. “Have you ever heard of the saying ‘extreme joy begets sorrow’? Why\ndon’t you call the head of Golden Corporation abroad and see if your powerful subordinates can still be"
      },
      {
        "paragraph": "contacted?"
      },
      {
        "paragraph": "“Or you can call Wade Middleton in Hill Corporation. See if you can get through his phone.”"
      }
    ]
  },
  {
    "title": "Chapter 1757 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "With Rodney’s sudden affirmation, Wesley’s body stiffened in spite of himself."
      },
      {
        "paragraph": "Wesley had spent many years planning everything before coming to this point. No, his plan could not\nhave gone wrong."
      },
      {
        "paragraph": "“Wesley, what does he mean?”"
      },
      {
        "paragraph": "Gavin pulled a long face and walked toward him. Now that he was only one step away from success, he\nwould not allow anything to go wrong."
      },
      {
        "paragraph": "“Minister Mead, I reckon he’s trying to buy time to throw us into chaos. We don’t have to treat his words\nseriously, ” Wesley said with a deep, indifferent voice, “What matters most now is that we need to take\ncontrol of everyone in the Snow family.”"
      },
      {
        "paragraph": "“Don’t worry about this. I’ve already assigned some people to keep an eye on the Snows. They’ve\nprobably been besieged by our people by now.”"
      },
      {
        "paragraph": "Gavin shifted his cold gaze to Nathan. “Nathan, the Snow family has become a shadow of its former self.\nPass the seal to me, and I’ll consider not taking your dad’s life. Otherwise, I’ll deal with your dad and\nbrother before your turn.”"
      },
      {
        "paragraph": "Once he finished speaking, Nathan’s furious face flashed with an imperceptible smile. At this moment, he\nbehaved as though he was born to be the prime minister. “Gavin, do you think that I’d be bold enough to\nattend this banquet unprepared?”"
      },
      {
        "paragraph": "Gavin was momentarily stunned, but the next moment, he appeared untroubled. “So what? You must not\nknow that the whole of Canberra, except for your security guards, has fallen into my clutches. I’ve even\noccupied the prime minister’s office.”"
      },

      {
        "paragraph": "“Really?” Nathan stared fixedly at Wesley without panicking at all. Instead, he smiled even more broadly."
      },
      {
        "paragraph": "It dawned on the guests that something was not right with Nathan. Consequently, they began to panic."
      },
      {
        "paragraph": "“Don’t worry, everyone. The Snow family can’t possibly make a comeback.” Gavin comforted all the\ninfluential and wealthy guests with his calm voice."
      },
      {
        "paragraph": "Ryan suddenly chuckled. “Dad, just tell them the truth. Now that Gavin has shown the cloven hoof, he’ll\nappear together with his gang this time. We can jump at this opportunity to round them up in one fell\nswoop.”"
      },
      {
        "paragraph": "The living room echoed with his eerie laughter, causing more people to feel uneasy for no reason."
      },
      {
        "paragraph": "“Minister Mead, are you sure you’re infallible?” Finn approached Gavin nervously."
      },
      {
        "paragraph": "Gavin glowered at him. Before he could speak, a commotion suddenly arose behind him."
      },
      {
        "paragraph": "By the time he came to his senses, Shaun had snatched a gun from the security guard beside him and\nquickly pressed it at Hannah’s temple."
      },
      {
        "paragraph": "“What are you doing?!” Hannah screamed with fright."
      },
      {
        "paragraph": "“Shut up.” Shaun dragged her into his arms and jabbed the gun harder at her temple. He bent over and\nlooked down with a threatening smile. “If you rattle on, I’m going to shoot you in your ear.”"
      },
      {
        "paragraph": "“Shaun, what are you doing? Let go of my daughter!”       Gavin flew into a rage. “Are you asking for\ndeath?”"
      },
      {
        "paragraph": "“Minister Mead, calm down. This… could be Prime Minister Snow’s plan.” Wesley gripped Gavin. “But it’s\nfoolish how he’s trying to turn things around by threatening you with your daughter.”"
      },
      {
        "paragraph": "Gavin was momentarily stunned. He then furrowed his brows."
      },
      {
        "paragraph": "Hannah was his only daughter whom he had always pampered. Even so, if he were to choose between\nhis daughter and power, he would choose the latter."
      },
      {
        "paragraph": "After all, even if he lost his daughter, he could still have more children after rising to the top."
      }
    ]
  },
  {
    "title": "Chapter 1758 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Perhaps Gavin could have many sons by then."
      },
      {
        "paragraph": "“ If he’s planning to threaten me with Hannah, he can dream on,” Gavin suddenly said grimly."
      },
      {
        "paragraph": "Madam Mead yelled, “Are you crazy? She’s our biological daughter. You can’t leave her high and dry.”"
      },
      {
        "paragraph": "Hannah was trembling all over. “Dad, please save me. I don’t want to die.”"
      },
      {
        "paragraph": "“Hannah, if I give in today, Nathan will destroy our family later.” Gavin sighed helplessly. “Shaun, I can\ngive you 200 billion dollars as long as you let go of her. I’ll also guarantee that the Hill family can live\nwithout worries from now on.”"
      },
      {
        "paragraph": "“Hah! How funny. Who can be sure that you’ll keep your promise?” Shaun narrowed his eyes and smiled\nat Hannah. “Miss Mead, didn’t you just ask me to be your dog?”"
      },
      {
        "paragraph": "“I… I was kidding. ” Hannah’s legs shook with fear. “As long as you put down the gun, I’m willing to marry\nyou. We can even get married now, and also… let me remind you that your son is still with us.”"
      },
      {
        "paragraph": "“Are you sure my son is still with you guys?” Shaun asked playfully, “Take him out for me to see.”"
      },
      {
        "paragraph": "Madam Mead shouted at the security guards, “ Hurry up and bring him over! ”"
      },
      {
        "paragraph": "After the security guards left, they did not come back again. A shot soon rang out from the courtyard.\nSubsequently, an army squad dressed in khaki uniforms dashed in from the courtyard and subdued\neveryone in the banquet hall at once. A 40- year-old commissioned officer walked out, yelling through the\nwalkie -talkie, “Listen up, everyone. Hurry up and put down your guns. You guys have been besieged.\nThere are snipers everywhere, so don’t act rashly. Otherwise, you’ll be killed.”"
      },

      {
        "paragraph": "All the guests in the hall immediately panicked. Even the security guards whom Finn sent here were at\ntheir wit’s end."
      },
      {
        "paragraph": "Gavin felt anxious as well. How did the army barge in when his people had already surrounded the entire\nmanor? “Don’t panic, everyone…”"
      },
      {
        "paragraph": "“Who are you guys? Stop moving.” Finn clutched Rodney in a state of panic. “Quickly put down your\nguns, or…”"
      },
      {
        "paragraph": "With that, a bullet penetrated Finn’s head. He widened his eyes right before he plopped down to the\nfloor."
      },
      {
        "paragraph": "“Snipers!”  Someone screamed."
      },
      {
        "paragraph": "However, it was too late. All the security guards in the banquet hall had been shot dead within seconds."
      },
      {
        "paragraph": "“As I said, don’t act rashly, ” the commissioned officer said through the walkie -talkie once again. His\ngaze was extremely cold."
      },
      {
        "paragraph": "Petrified, everyone instantly kept their mouths shut. They did not even dare to breathe too loudly."
      },
      {
        "paragraph": "Even Wesley and the Meads were shivering all over. Clearly, the abrupt twist to the situation had caught\nthem off guard."
      },
      {
        "paragraph": "At this point, they still could not figure out what was happening. They had gained control of Canberra,\nhad they not? Why had everything changed all of a sudden?"
      },
      {
        "paragraph": "After the commissioned officer came down from the second floor, he knelt on one knee in front of\nNathan. “Prime Minister Snow, I’ve dealt with everyone outside as per your instructions. Those at the\ngate of the Snow family’s house have been arrested as well. At present, the whole manor is already\nwithin our control.”"
      },
      {
        "paragraph": "“Great job. You may get up.” Nathan slowly nodded, his deep eyes sweeping over everyone in the\nbanquet hall."
      },
      {
        "paragraph": "A lot of them looked ghastly. They had chosen to betray Nathan and even addressed Gavin as the prime\nminister, proving that they were all part of the conspiracy."
      },
      {
        "paragraph": "At this moment, they were frightened and shocked. Some of them were even consumed with regret."
      }
    ]
  },
  {
    "title": "Chapter 1759 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "One of the senators whose last name was Jarman promptly laughed and said, “How wise of you, Prime\nMinister Snow. In fact, I knew from earlier on that you had another plan. Sure enough, you did. No one is\nmore capable than you, Prime Minister Snow."
      },
      {
        "paragraph": "Australia needs you so that it can achieve greater heights. Gavin signed his own death warrant. How i s\nhe even comparable to you?”"
      },
      {
        "paragraph": "Nathan let out a deep laugh. “Senator Jarman, you’re clever at acting based on the situation.\nUnfortunately, I think I overheard you addressing Gavin as Prime Minister Mead. In that case, you should\nremain faithful to him. Take him down…”"
      },
      {
        "paragraph": "He waved his hand. Subsequently, someone dragged Senator Jarman away."
      },
      {
        "paragraph": "“Forgive me, Prime Minister Snow! It was my fault. I’ll never do it again.”"
      },
      {
        "paragraph": "His anguished pleas lingered in the banquet hall, which made everyone numb with terror. However,\nnobody dared to say anything for fear that they would be the next person dragged away."
      },
      {
        "paragraph": "Needless to say, Wesley and the Meads were the ones most frightened now, Hannah as well. Her face,\nwhich had been applied with makeup, was filled with dread. She was even on the brink of a breakdown."
      },
      {
        "paragraph": "Just a few moments ago, she was going to become the prime minister’s daughter, whom Shaun would\nbe forced to subservient to. How did everything change?"
      },
      {
        "paragraph": "“Why did things turn out this way?” she yelled, “ Why, Dad? Didn’t you say your plan would work?”"
      },
      {
        "paragraph": "Gavin fixed his eyes on the commissioned officer dressed in a khaki uniform. “As long as you stay loyal\nto me, I can pay you however much you want. You can name any amount.”"
      },

      {
        "paragraph": "The officer kept his face impassive."
      },
      {
        "paragraph": "Shaun stopped jabbing the gun at Hannah. He shoved her roughly to the floor and said indifferently, “It’s\nno use paying me. What’s more, are you sure you still have so much money?”"
      },
      {
        "paragraph": "“Absolutely.” Gavin nudged Wesley, who was beside him. “He’s the wealthiest person in Australia. He\ncan pay you however much you request…”"
      },
      {
        "paragraph": "“Cool.”"
      },
      {
        "paragraph": "Wesley gritted his teeth. Looking at the current situation, he knew he had to get himself away from this at\nany cost."
      },
      {
        "paragraph": "After pausing for a moment, he smiled at Nathan and said, “Prime Minister Snow,  I was also fooled by\nGavin before this. From now on, I’ll be loyal to  you. I can pay hundreds of billions in taxes to Australia if\nyou’d like. Besides, if you have me backing you in the business industry, you can consolidate your\nposition. Look, I’m a lot more capable than Shaun.”"
      },
      {
        "paragraph": "“Wesley Lyons, how dare you betray me?!” Incredulous, Gavin tried to punch him."
      },
      {
        "paragraph": "Wesley dodged Gavin’s punch and even pushed him to the floor. “Gavin, you have only yourself to blame\nfor being incapable and unlucky. Prime Minister Snow is head and shoulders above you.”"
      },
      {
        "paragraph": "“You b*stard! If it weren’t for me, would a simple man like you have become who you are today?” Gavin\ncriticized as he pointed at the tip of Wesley’s nose."
      },
      {
        "paragraph": "“I became who I am today based on my abilities.” Upon finishing his sentence coldly, Wesley said to\nPrime Minister Snow flatteringly, “Given that I own"
      },
      {
        "paragraph": "Hill Corporation and Golden Corporation, I can solve the country’s unemployment issue by providing tens\nof thousands of job opportunities. What’s more, I was only aware of Minister Mead’s plot to rebel, but I"
      },
      {
        "paragraph": "didn’t take any part in it. In fact, whoever becomes the prime minister of the country doesn’t matter to a\nbusinessman like me.”"
      },
      {
        "paragraph": "Nathan observed him calmly with a smile."
      },
      {
        "paragraph": "Rodney could not bring himself to listen to Wesley. “Wesley, how f*cking shameless you are! Do you take\nthe Snows for fools? Earlier, you told Gavin that he’d dominate the political domain while"
      },
      {
        "paragraph": "you’d dominate the business industry. How brilliant! How dare you say you weren’t involved in the\nconspiracy when both of you intended to take control of Australia?”"
      },
      {
        "paragraph": "Wesley broke into a smile. “Young Master Snow, I really am influential in the business industry now. In\ntruth, as long as the Snow family is willing to let go of the past and accept my help, you guys can rise to\na higher rank.”"
      },
      {
        "paragraph": "“Wesley, even at this point, haven’ t you realized why you lost?”"
      },
      {
        "paragraph": "Shaun suddenly walked up to Wesley and shot him a profound look. “Gavin had the audacity to rebel all\nbecause of you. It was because you could support him with an endless supply of funds. Although you\nspent so much money bribing many people, have you ever thought why the Snows managed to barge\ninto your manor without alarming you guys?”"
      }
    ]
  },
  {
    "title": "Chapter 1760 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Wesley was stunned. By the time he came to his senses, his mind flashed with unease."
      },
      {
        "paragraph": "“It was because those people had already received a piece of news.”"
      },
      {
        "paragraph": "Rodney laughed and said, “Today, the whole world has blacklisted and is boycotting Golden Corporation.\nMoreover, Sheryl from Hill Corporation plans to cancel the transfer of shares to Jeffery, while Wade was\narrested half an hour ago. Oh, by the way, Jeffery and Sheryl are suspected of massive fraud. The police\nare now on their way to arrest them. So what do you have now? Only Golden Corporation that deals with\nthe local market remains.”"
      },
      {
        "paragraph": "Ryan reminded gently, “Rodney, although Gavin owns shares in Golden Corporation, he’s now\nsuspected of rebelling. We suspect that Golden Corporation is involved in some shady dealings. We\nhave the right to halt the company’s operations and shut it down. In other words, there won’t be a\ncompany called Golden Corporation from today onward.”"
      },
      {
        "paragraph": "“I see.” Grinning, Rodney said, “In that case, you’re left with nothing, Wesley. How can you assist the\nSnow family and dominate the business industry now? Pfft. You’re f*cking shameless.”"
      },
      {
        "paragraph": "Wesley’s head buzzed."
      },
      {
        "paragraph": "“This is impossible. It’s impossible.”"
      },
      {
        "paragraph": "With a pale face, he shook his head. He still could not resign himself to this fact. “Sheryl couldn’t possibly\nhave canceled the share transfer."
      },
      {
        "paragraph": "Furthermore, if Sheryl assisted Golden Corporation, she would be able to solve the company’s crisis as\nwell. She wouldn’t dare to reject me. She wouldn’t dare do so.”"
      },

      {
        "paragraph": "He took out his phone and was about to call Jeffery to look for Sheryl."
      },
      {
        "paragraph": "Matthew was still in his clutches. If she chose not to help him, he would kill Matthew."
      },
      {
        "paragraph": "“You don’t have to look for Sheryl.”"
      },
      {
        "paragraph": "Looking at his mad behavior, Shaun interjected nonchalantly. “Sheryl has already learned the truth.”"
      },
      {
        "paragraph": "“Truth?” Wesley began to laugh wildly. “She’s mentally ill. How would she know the truth?”"
      },
      {
        "paragraph": "“I didn’t know that you’ve always taken me for someone who’s mentally ill.”"
      },
      {
        "paragraph": "Suddenly, a female voice rang out."
      },
      {
        "paragraph": "Nathan and the others moved away as Titus walked in holding Sheryl. Sheryl fixed her eyes ferociously a\nt Wesley."
      },
      {
        "paragraph": "Never had she thought that she would one day fall into this young man’s clutches for such a long time."
      },
      {
        "paragraph": "It was because of him that she harmed her biological daughter and son. She nearly ruined her whole\nfamily as well."
      },
      {
        "paragraph": "Following behind her was a young and thin figure. That person was none other than Matthew."
      },
      {
        "paragraph": "Matthew glowered at Wesley resentfully as well."
      },
      {
        "paragraph": "Wesley’s legs turned to jelly. He tottered a few steps backward and hit the chair behind him."
      },
      {
        "paragraph": "Titus’ gaze was cold. “You planned to threaten my wife with Matthew because you thought he was still\nwith you, right?”"
      },
      {
        "paragraph": "“He… How did he escape?!” Wesley roared hysterically."
      },
      {
        "paragraph": "He had asked his confidant to hide Matthew in a place where no one would think of searching. It was the\nmost bustling karaoke place in Melbourne. Who would have thought that he would hide someone in the\nmost bustling place?"
      }
    ]
  },
  {
    "title": "Chapter 1761 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“You have only yourself to blame for being wicked and insane. Even your dear ones hate you.”"
      },
      {
        "paragraph": "Shaun said indifferently, “You sank so low as to kill your biological sister’s son. How could she not take\nrevenge on you? Unfortunately, she knows you too well even though you tried to drive her back to\nMelbourne. She knew from earlier on who you’d assign important tasks to. By getting people to tail you,\nshe found out where your confidants usually headed to. Since Matthew is so important to you, you surely\nwouldn’t let him die. Needless to say, you’d usually ask your confidants to keep an eye on him, so we got\nto know where Matthew was.”"
      },
      {
        "paragraph": "“I see. It’s that b*tch! ”"
      },
      {
        "paragraph": "Knowing that he had already lost his trump card, Wesley roared madly. “If I had known this earlier, I\nwould’ve killed that b*tch so that she’d be reunited with her son.”"
      },
      {
        "paragraph": "“Calling you a scumbag is an understatement.” Rodney sighed and said, “How dare you treat your\nbiological sister so viciously?”"
      },
      {
        "paragraph": "“He’s just inhumane,” Shaun said coldly, “He cares about nothing but power and status. He’ll stop at\nnothing to achieve his goals. He even dared to scheme against people who shouldn’t be offended.\nWesley, you’re clever. But sadly, you utilized your skills in the wrong area.”"
      },
      {
        "paragraph": "“You know nothing.” Wesley looked ferocious like a madman. “Do you think I wish to be so despicable? If\nI were born like Shaun who inherited Hill Corporation, I wouldn’t have needed to go to great lengths to do\nall this. If I had your status, that damned b*tch, Catherine, wouldn’t have betrayed me over and over\nagain.”"
      },
      {
        "paragraph": "“Damn, you’re f*cking  shameless.”  No longer being able to control himself, Rodney criticized him, “\nShaun and Catherine truly love each other, yet you went all out to tear them apart. You became the third"
      },

      {
        "paragraph": "party and kept causing them to break up. What’s more, do you actually like Catherine? You probably just\nwant to take advantage of her.”"
      },
      {
        "paragraph": "“Exactly.” Shaun expressed disdain. “In fact, something’s wrong with your character. Don’t shift the blame\nto Catherine. If you ask me, it’s very unfortunate of Catherine to have met you.”"
      },
      {
        "paragraph": "“Wesley, you took advantage of me and hurt my daughter. I won’t let you get away with it. ” Sheryl\nsuddenly walked up to Wesley and glanced at him grimly. After that, she turned to say to Nathan, “ I want\nto take him away.”"
      },
      {
        "paragraph": "Nathan smiled slightly. “Madam Costner, you’re welcome to do so. Mr. Costner has told me all about it.\nGiven that Wesley, Rebecca, Jeffery, and a few others are suspected of massive fraud, the police plan to\narrest them. Also, Wesley is suspected of being involved in Gavin’s plot to rebel. Even if you hadn’t made\nthat request, he would either be in jail forever or executed.”"
      },
      {
        "paragraph": "“That’s too light of a punishment for him, ” Titus said nonchalantly."
      },
      {
        "paragraph": "“That’s true.” Nathan gave Wesley the death stare. “Congratulations, President Lyons. I believe the\nconsequences you’re going to suffer will be much worse than Gavin’s.”"
      },
      {
        "paragraph": "Wesley’s legs trembled with fear as he fell backward."
      },
      {
        "paragraph": "He had heard about the Costners’ method of dealing with things when he got someone to investigate\nthem in the past."
      },
      {
        "paragraph": "However, he was overly obsessed with benefits at that time…"
      },
      {
        "paragraph": "“No, no…” He shuddered and thundered, “You guys can’t treat me this way! I’m Catherine’s husband,\nand she’s my legal wife. Let me go! If you guys let me go, I’ll divorce her right away even if I’ll be left with\nnothing.”"
      },
      {
        "paragraph": "Sheryl was trembling with anger. She did not expect that he would still threaten her at this point. She\nwished she could take a gun and shoot him to death."
      },
      {
        "paragraph": "Upon noticing that she was about to lose control, Titus promptly pressed her shoulder. “Sherry,"
      },
      {
        "paragraph": "don’t worry. Legally speaking, their marriage will be invalid once he’s dead.”"
      },
      {
        "paragraph": "“That’s right. ” Matthew curled his lips playfully and snickered. “From today onward, Wesley will no longer\nexist in this world. You’re going to be the Costners’ dog that’s locked up in a kennel. I’ll pay you back with\ninterest after how you treated me.”"
      }
    ]
  },
  {
    "title": "Chapter 1762 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Wesley thought about the situation."
      },
      {
        "paragraph": "Feeling anxious, he tried to flee. However, Shaun shot him in the thigh straight away."
      },
      {
        "paragraph": "Wesley fell to the floor. Soon, the Costners’ bodyguards dragged him away."
      },
      {
        "paragraph": "Along the way, his hysterical howls could be heard. Streaks of blood were also left on the floor."
      },
      {
        "paragraph": "At the sight of the scene, everyone was numb with fear."
      },
      {
        "paragraph": "They would never forget how they had just gone to extreme lengths to please Wesley just moments\nearlier."
      },
      {
        "paragraph": "In the blink of an eye, the superior Wesley was now being dragged out of the place like a wretched stray\ndog."
      },
      {
        "paragraph": "Gavin sank to his knees and bowed. “P-Prime Minister Snow, it was my fault. I won’t… do it anymore. I- I\nwasn’t like this back then. It was… all Wesley’s doing. He egged me on. He was the one who egged me\non.”"
      },
      {
        "paragraph": "“Yeah, Prime Minister Snow. My daughter and I didn’t know that they were plotting to rebel.” Dazed,\nMadam Mead pulled Hannah to kneel together. Amid her tears, she screamed, “We’re innocent! Because\nof Gavin, we were dragged into the mess.”"
      },
      {
        "paragraph": "“You… You damn b*tch. What are you saying?” Gavin’s blood boiled. He finally saw why people said\nmarried couples went their separate ways in the face of obstacles."
      },
      {
        "paragraph": "“I’m just stating the facts. Do you want to involve our daughter?” Madam Mead looked at Gavin\npleadingly. She felt the need to maintain the Mead bloodline regardless."
      },

      {
        "paragraph": "Gavin had a lump in his throat. At that moment, he was so dejected that he did not know what to say."
      },
      {
        "paragraph": "Just before this, he had thought of getting a few pretty young women to give birth to a few baby boys for\nhim after he was in power. Little did he expect that he would become a laughing stock within seconds."
      },
      {
        "paragraph": "At this point, he really regretted his actions. If he were given a second chance, he definitely would not\nhave allowed himself to be persuaded by Wesley."
      },
      {
        "paragraph": "Nathan fixed his sharp eyes on Gavin calmly.“"
      },
      {
        "paragraph": "Gavin, if it weren’t for your burning ambition, how could Wesley have been able to trigger the beast\ninside you using just a few words? In fact, I noticed that you started being conceited after I was\nappointed as the prime minister. When you were at the foot of the mountain, you aimed to reach the\npeak. But once you arrived there, you found a higher mountain and wanted to climb higher."
      },
      {
        "paragraph": "However, you forgot that you wouldn’t have been qualified to climb the mountain if it weren’t for me.”"
      },
      {
        "paragraph": "Gavin gloomily plopped down on the floor. All of a sudden, he felt as if he had become ten years older."
      },
      {
        "paragraph": "Shaun walked up to him and stared down at him. “ Minister Mead, I recalled you saying that you wanted\nmy mom to accompany your old friends."
      },
      {
        "paragraph": "You even claimed that she was the most beautiful woman in Canberra back then. Since you couldn’t win\nher heart then, you claimed that you wouldn’t mind fooling around with her now even though she has\naged.”"
      },
      {
        "paragraph": "His voice was flat enough to make the Meads’ blood curdle."
      },
      {
        "paragraph": "“ I- I… was joking.” Gavin shuddered non-stop. He dreaded losing his wife and daughter. He would just\nend up as a toy for these influential figures."
      },
      {
        "paragraph": "Madam Mead and Hannah had expected this."
      }
    ]
  },
  {
    "title": "Chapter 1763 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Hannah hurriedly clutched the bottom of Shaun’s pants and said amid her tears, “Shaun, my dad didn’t\nmean it. Please don’t take his words seriously.”"
      },
      {
        "paragraph": "“Do you guys take me for a fool?” Shaun smirked. He slowly bent over and spoke in a gentle tone, yet\nhis eyes were frosty. “You guys shouldn’t have threatened me with my mom. Minister Mead, since you\nwere the one who suggested it earlier, I’ll… let you part with your wife and daughter.”"
      },
      {
        "paragraph": "“No… No way. ” Madam Mead was so shocked that she burst into tears on the spot, whereas Hannah\ntightened her grip on the bottom of Shaun’s pants. “Don’t do that, Shaun. I can accompany you however\nyou want. Don’t you… have feelings for me during the time we spent together? I know you like me.”"
      },
      {
        "paragraph": "With that, Titus, Matthew, and Sheryl shifted their eyes to Shaun. There was displeasure on their faces."
      },
      {
        "paragraph": "Matthew smiled discreetly. “I couldn’t  tell.” Shaun’s face darkened, and he immediately broke free from\nHannah’s grip. “You’re overthinking it. I felt like puking whenever you touched me back then. Actually, my\nmind was always occupied with another woman. Also, we’ve never done it before.”"
      },
      {
        "paragraph": "Hannah’s face instantly turned ghastly. After she wept, the makeup on her initially exquisite face was\nruined, causing her to look like a ghost."
      },
      {
        "paragraph": "Grinning, Ryan said, “Enough, Shaun. Don’t scare them anymore. Anyway, the Meads have to be\nexecuted since they were involved in the plot to rebel.”"
      },
      {
        "paragraph": "The word ‘execute’ came as a tremendous shock to the Meads."
      },
      {
        "paragraph": "Madam Mead panicked so much that she nearly passed out. Having been leading an aristocratic life,\nHannah could not resign herself to the fact and shrieked. “I can work like a horse for you! I can even\nsleep with you! Don’t kill me. Just don’t kill me. I have nothing to do with the plot.”"
      },

      {
        "paragraph": "“ Same here! ” Madam could not be bothered about other things. “Although I’m old, my skin is still in\ngood condition. Besides, my performance will be to your satisfaction.”"
      },
      {
        "paragraph": "“ .. Shut up, both of you!” Gavin’s eyes reddened with anger."
      },
      {
        "paragraph": "He never thought that his wife and daughter would give up their dignity. By doing so, they had trampled\non his dignity."
      },
      {
        "paragraph": "“This is f*cking disgusting. ” A look of contempt washed over Rodney’s face. “Hurry up and drag them\naway.”"
      },
      {
        "paragraph": "Shortly after, every one of the Meads was arrested. Even the Meads’ relatives were taken away for\ninterrogation."
      },
      {
        "paragraph": "The remaining guests rested their eyes on Nathan with unease."
      },
      {
        "paragraph": "Nathan raised his hand and pointed at the 3o people present. “Since you guys took Gavin’s side earlier,\nall of you must be arrested and locked up. As for the rest, bring them away for interrogation. They can’t\nbe released until they’re cleared of all suspicions.”"
      },
      {
        "paragraph": "Everyone was terror-stricken as they never thought that Nathan would have such a great memory. He\nhad made a mental note of everyone who previously sided with Gavin."
      },
      {
        "paragraph": "At this moment, it dawned on those influential figures that Nathan had long since planned this in secret\nwhen everyone assumed him to be gentle and easy to deal with. He waited for those involved with the\nMeads to show their cloven hoofs, then destroyed them at one go."
      },
      {
        "paragraph": "From now on, Nathan would have the whole of Australia within his grasp."
      },
      {
        "paragraph": "“Sure enough, you had a trick up your sleeve, Prime Minister Snow.” Titus smirked impassively.“"
      },
      {
        "paragraph": "You’re head and shoulders above Gavin.”"
      },
      {
        "paragraph": "When Nathan became the prime minister, he already had the intention of getting rid of Gavin and those\nwho planned to betray him."
      },
      {
        "paragraph": "However, a lot of people refused to obey Nathan back then, which also explained why he had not been\nable to officially take control of Australia."
      },
      {
        "paragraph": "In fact, Nathan had always Pinched and put up with everything with the aim of prompting Gavin’s\nsupporters to slowly surface."
      },
      {
        "paragraph": "Now that all of them had shown their faces, it was time for Nathan to round them up in one fell swoop."
      }
    ]
  },
  {
    "title": "Chapter 1764 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "From today onward, the whole of Canberra would be at ease. Similarly, Nathan would be able to live\nwithout worries."
      },
      {
        "paragraph": "He could even hope to be re -elected four years later."
      },
      {
        "paragraph": "When he stepped down, he could let his son, Ryan, take over his position."
      },
      {
        "paragraph": "Nathan smiled. “Thankfully, we had Shaun this time. If he hadn’t found Matthew and suppressed Wesley\nin time, I wouldn’t have been able to deal with Wesley even if I managed to stop Gavin from rebelling.\nMoreover, considering Wesley’s overweening ambition, I honestly don’t feel like leaving him alive.”"
      },
      {
        "paragraph": "Everyone turned their gazes to Shaun’s tall and sturdy figure."
      },
      {
        "paragraph": "Even Titus and Matthew could not help but admire Shaun."
      },
      {
        "paragraph": "Nathan patted Shaun on the shoulder and continued to praise him. “What’s more, it was Shaun who\nsuggested this plan. He deliberately approached Hannah to make everyone think that he had been left\nwith no choice but to butter her up. Another reason was that the Meads and Wesley had been taking\ndelight in trampling on Shaun. They were under the impression that everything was within their grasp.\nWhen they became negligent, we managed to save Matthew. Shaun, I appreciate your hard work. It\nmust’ve been tough for you.”"
      },
      {
        "paragraph": "“Uncle Nathan, don’t say that. I just got rid of an albatross for myself too,” Shaun said with a frown, “If it\nhadn’t been for Wesley and Gavin, I wouldn’t have ended up in this state.”"
      },
      {
        "paragraph": "Upon hearing what he said, Sheryl felt both embarrassed and upset."
      },
      {
        "paragraph": "She knew that the Hill family would not have ended up in this state if she had not incited things."
      },

      {
        "paragraph": "Her thin lips twitched with difficulty. “Shaun… Hill Corporation is yours. I’ll return it to you.”"
      },
      {
        "paragraph": "“That’s wonderful, Shaun— ” Rodney was cheerful but before he could finish his sentence, Shaun lifted\nhis hand to stop him."
      },
      {
        "paragraph": "Shaun’s calm face gave nothing away. “Hill Corporation has been renamed Jere Corporation, so it’s not\nmine.”"
      },
      {
        "paragraph": "Sheryl’s face turned crimson with shame."
      },
      {
        "paragraph": "The name ‘Jere Corporation’ was simply an object of ridicule now. “I’m sorry. At that time, I didn’t"
      },
      {
        "paragraph": "“The fact is that I lost.”"
      },
      {
        "paragraph": "Shaun cut in, “As the former chairman of Hill Corporation, I failed to secure the company due to my\nincompetence. Although it was a hostile takeover, I’m still a failure. A competent person would’ve been\nable to solve the crisis even in the face of a hostile takeover. Secondly, Rebecca spent a huge amount of\nmoney to buy the shares from the shareholders back then. Even my biological aunt and uncle have\ntaken your money and left. In that case, it doesn’t make sense to return the company to me. The\ncompany is yours, and I’m just a shareholder.”"
      },
      {
        "paragraph": "From his frankness, Titus and Sheryl found him praiseworthy."
      },
      {
        "paragraph": "Sheryl was filled with complicated feelings. Her daughter had really good taste, but sadly…"
      },
      {
        "paragraph": "“So… I’ll let Catherine… take charge of the company “She won’t want it.” Shaun disapproved of her\ndecision. “I’m guessing that she won’t even want  to acknowledge you as her mother.”"
      },
      {
        "paragraph": "Sheryl’s chest was in knots, which made her suffocate."
      },
      {
        "paragraph": "As she was about to speak, she suddenly saw a commissioned officer walking in while holding a boy’s\nhand. The boy was cool and seemed to be around three years old."
      },
      {
        "paragraph": "“Hey, Lucas. Were you terrified?” Grinning, Rodney walked up to Lucas. He stretched out his hand to\npinch Lucas’ face."
      },
      {
        "paragraph": "Lucas immediately blocked his hand and walked straight to Shaun with an indifferent expression."
      }
    ]
  },
  {
    "title": "Chapter 1765 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Shaun’s eyes beamed. He lowered his head and caressed Lucas’ hair. “Good job. When I get back, I’ll\ntell Mommy about it and ask her to praise you.”"
      },
      {
        "paragraph": "“Ahem. Forget it. I don’t want her to worry about me,” Lucas promptly answered."
      },
      {
        "paragraph": "Sheryl stared at Lucas in a state of disbelief."
      },
      {
        "paragraph": "She previously did not know that Catherine was her daughter. Now that she had found out the truth, it hit\nher that this little boy in front of her was her grandson."
      },
      {
        "paragraph": "In addition, Lucas bore a close resemblance to Catherine and herself as well."
      },
      {
        "paragraph": "Sheryl’s eyes reddened as she looked at the boy."
      },
      {
        "paragraph": "The more she reflected on the matter, the more she hated Rebecca and the rest."
      },
      {
        "paragraph": "Due to their interference, Sheryl became so foolish that she failed to recognize her own daughter and\ngrandchildren."
      },
      {
        "paragraph": "She was filled with resentment, yet she dared not step forward."
      },
      {
        "paragraph": "She was afraid that the kid would hate her."
      },
      {
        "paragraph": "Mattew darted a glance at her. Then, he turned and said to Lucas with a smile, “Kiddo, come here. Can\nyou guess who I am? I’m your uncle.”"
      },
      {
        "paragraph": "Lucas’ eyes swept over Matthew, Sheryl, and Titus before he said coolly, “Don’t simply take me for your\nrelative. My mom doesn’t have a brother, so I don’t have an uncle.”"
      },
      {
        "paragraph": "At the sight of his cold expression, Rodney raised his thumb in admiration in spite of himself."
      },

      {
        "paragraph": "This kid was indeed arrogant and offhand. Did he know who the Costners were? They were the kind of\npeople admired by others wherever they went."
      },
      {
        "paragraph": "Matthew was not mad. Instead, he took great interest in Lucas. “Hey, you’re interesting, kiddo.”"
      },
      {
        "paragraph": "He grinned and walked forward to pinch Lucas’ delicate face."
      },
      {
        "paragraph": "Lucas nimbly stretched out a hand to block his hand. “I hate people touching my face.”"
      },
      {
        "paragraph": "At that moment, Mathew broke into laughter, and so did Titus. “Your mom gave birth to such an"
      },
      {
        "paragraph": "interesting pair of fraternal twins. Unfortunately, she’s not my biological daughter.”"
      },
      {
        "paragraph": "After pausing for a moment, Titus cast a disdainful look at Matthew."
      },
      {
        "paragraph": "Matthew was speechless."
      },
      {
        "paragraph": "What was wrong with him? He just did not have a girlfriend and a pair of fraternal twins. What was so\ngreat about those things? When he got married later, he would give birth to triplets."
      },
      {
        "paragraph": "Even Sheryl’s gaze revealed a sense of warmth."
      },
      {
        "paragraph": "Nevertheless, she only fixed her deep gaze on Lucas without moving forward."
      },
      {
        "paragraph": "As much as she wanted to step forward to hug Lucas, she knew that she might lose the only chance of\nsaving her relationship with her daughter if she acted so recklessly again."
      },
      {
        "paragraph": "She fought back her urge, which resulted in her shortness of breath."
      },
      {
        "paragraph": "Titus noticed her condition. “I’m going to bring Sherry to the hospital. Also, Matthew is still injured. We’ll\nleave first.”"
      },
      {
        "paragraph": "“Don’t worry, President Costner. We’ll arrange for the best doctor to treat your wife, ” Nathan said politely."
      },
      {
        "paragraph": "Titus nodded and said to Shaun, “I’ll come and meet you afterward. Thanks for saving my son.”"
      },
      {
        "paragraph": "After he finished speaking, he left with Matthew and Sheryl."
      },
      {
        "paragraph": "Shaun led Lucas, Nathan, and the others to walk out as well."
      },
      {
        "paragraph": "“Shaun, why didn’t you accept Hill Corporation just now?” Rodney thought that it was a waste. “What’s\nmore, the Costners owe you for saving  Matthew. You deserve it.”"
      },
      {
        "paragraph": "“I saved Matthew for my own sake, ” Shaun said simply, “Moreover, I can make a comeback at any time\nas long as I’m still competent.”"
      },
      {
        "paragraph": "“You’re right.” Nathan shot an admiring look at Shaun. “Shaun, are you interested in joining politics?”"
      },
      {
        "paragraph": "“Forget it. I’m more interested in making money.” Shaun shrugged. “In fact, I’m not desperate for money\nnow. I just hope that nobody will come and cause me trouble so that I can live a peaceful life. Plus… I\nhave something more important to deal with.”"
      },
      {
        "paragraph": "“What’s that?” Rodney asked curiously."
      },
      {
        "paragraph": "“Pursuing a woman.” Shaun’s sexy, thin lips curved up. ”I’ve already taken revenge, but I need a\ngirlfriend.”"
      }
    ]
  },
  {
    "title": "Chapter 1766 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Rodney was at a loss for words."
      },
      {
        "paragraph": "He wondered why he previously never realized that Shaun was so flirty."
      },
      {
        "paragraph": "Was this Shaun’s true character after losing his memory?"
      },
      {
        "paragraph": "“Let’s go.”"
      },
      {
        "paragraph": "Shaun held Lucas’ hand and they got in the car."
      },
      {
        "paragraph": "Lucas sat in the back seat nonchalantly and scoffed with mixed feelings. “I can’t deny your well-\nintentioned actions in approaching Hannah before this, but Mommy has completely given up on you. ”"
      },
      {
        "paragraph": "“You don’t know about this kind of stuff, you brat. This is a matter between adults.”"
      },
      {
        "paragraph": "Shaun knocked on the steering wheel gently. “ What’s more, it doesn’t matter even if she doesn’t love me\nanymore. I can make her fall for me again. ”"
      },
      {
        "paragraph": "Lucas frowned. “You’ve lost your memory and forgotten your relationship with Mommy, so why won’t you\nlet her go?”"
      },
      {
        "paragraph": "“Hey, as our son, don’t  you hope that Mommy  and I can make peace with each other and provide you\nwith a complete family?” Shaun reminded lazily, “ After all, I’m your dad.”"
      },
      {
        "paragraph": "“Really? I nearly forgot about it.” Lucas snorted. Shaun did not know what to say."
      },
      {
        "paragraph": "However, he could not blame the kid. It was true that he had not been a competent father."
      },
      {
        "paragraph": "“Lucas, your words have made me reflect on myself. I realize that I’ve been an incompetent father. Now\nthat I’ve dealt with all my enemies, I have nothing much to do. I’ve decided to be a qualified father during"
      },

      {
        "paragraph": "this period.”"
      },
      {
        "paragraph": "Shaun suddenly became serious. “From today onward, I’ll be the one sending you and Suzie to\npreschool.”"
      },
      {
        "paragraph": "“We have a chauffeur. We don’t need you to send us.” Lucas rejected him."
      },
      {
        "paragraph": "“The chauffeur isn’t your dad. There’s no use rejecting me. You’re only three years old. It’s my duty to\nraise you.” Shaun had made up his mind."
      },
      {
        "paragraph": "Lucas knitted his brows deeply."
      },
      {
        "paragraph": "50 minutes later."
      },
      {
        "paragraph": "The car finally entered the Yule family’s villa."
      },
      {
        "paragraph": "Before the car was parked, Catherine rushed out of the villa."
      },
      {
        "paragraph": "One could tell that she had been anxious the whole night as she did not even tidy her hair."
      },
      {
        "paragraph": "The night breeze blew through her hair. Under the streetlights, her bright eyes were filled with anxiety\nuntil she saw Lucas."
      },
      {
        "paragraph": "Only then did she gradually begin to calm down. Her eyes even revealed a look of disbelief."
      },
      {
        "paragraph": "“Mommy… ” Lucas got out of the car. He was still wearing the same black suit, looking cool. He was not\ninjured anywhere. “I’m fine.”"
      },
      {
        "paragraph": "“That’s great.”"
      },
      {
        "paragraph": "Catherine walked up to him and squatted down, then she hugged him tightly."
      },
      {
        "paragraph": "Suzie, who was licking a lollipop, ran out in a daze."
      },
      {
        "paragraph": "As soon as Lucas spotted her, he blurted out, “ Oops.”"
      },
      {
        "paragraph": "“What’s the matter?” Catherine was so nervous that her heart clenched."
      },
      {
        "paragraph": "“There was a lot of tasty food tonight. They were all Suzie’s favorites. I wanted to bring some home but I\nforgot, ” Lucas suddenly said."
      },
      {
        "paragraph": "Catherine was speechless."
      },
      {
        "paragraph": "With a tingling sensation inside her, Suzie frowned slightly. “How tasty was the food?”"
      },
      {
        "paragraph": "After some thought, Lucas replied, “They served the most delicious chocolate cakes in the world and\nsome desserts that were made of the best cream in the world. I found them very yummy. There were\nalso steaks, mud crabs, lobsters, kebabs, and many more kinds of tasty food. The ingredients used were\nsuper fresh. Anyway, I’ve never had such delicious food in my life even though I ate the same thing in\nmany restaurants before.”"
      },
      {
        "paragraph": "With that, Suzie’s mouth watered. She was sulky. “ Was the food that yummy? If I had known earlier, I\nwould’ve tagged along. Why didn’t you guys bring me along? It’s unfair that you had all that food for\nyourself. You guys will be eaten up by the devil.”"
      }
    ]
  },
  {
    "title": "Chapter 1767 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine was speechless. “ Suzie, as I said, it was very dangerous. Have you forgotten that you nearly\nlost your life when you were kidnapped previously?”"
      },
      {
        "paragraph": "Suzie went silent, but she still thought that it was a missed opportunity."
      },
      {
        "paragraph": "Catherine was at a loss for words. “Lucas, it’s fine that you ate the food but why did you have to tell her\nabout it?”"
      },
      {
        "paragraph": "Lucas responded honestly, “ I just wanted to let her know that all the things she ate previously are trash\ncompared to the yummy food tonight.”"
      },
      {
        "paragraph": "His words came as a real blow to Suzie. She was so indignant that she broke into tears."
      },
      {
        "paragraph": "Feeling speechless, Shaun promptly carried her and said, “Don’t cry. The chef who prepared the food\ntonight was hired from overseas. He should still be around. I can ask him to cook for you tomorrow. ”"
      },
      {
        "paragraph": "“Really?” Suzie was extremely touched."
      },
      {
        "paragraph": "“Yes.” Shaun nodded. “But you can’t eat too much.”"
      },
      {
        "paragraph": "“Mm.” Suzie sniffed. “I’ll just try the food. You’re wonderful! ”"
      },
      {
        "paragraph": "Catherine was completely at a loss for words."
      },
      {
        "paragraph": "In truth, she had a lot of questions for Shaun and Lucas who just attended the banquet that was\nsupposed to be a trap. How did Suzie end up in tears because of food?"
      },
      {
        "paragraph": "“Lucas, please take Suzie into the room to rest. I’d like to have a few words with your daddy, ” Catherine\nordered."
      },

      {
        "paragraph": "Little did she realize that the phrase ‘your daddy’ would make Shaun smile so brightly as though his\nheart was doused in honey."
      },
      {
        "paragraph": "“Oh, alright. Mommy, quickly come up, okay?” Lucas dragged Suzie away."
      },
      {
        "paragraph": "Catherine turned around, only to find Shaun’s gentle, dark eyes resting on her under the moonlight. His\neyes were filled with radiance."
      },
      {
        "paragraph": "Her scalp immediately became numb. Somehow, she felt that Shaun had changed into a completely\ndifferent person."
      },
      {
        "paragraph": "“What on earth happened today?” She was extremely curious. “Wesley, Gavin, and the others “They’ve\nbeen arrested.”"
      },
      {
        "paragraph": "Shaun said softly, “From now on, nobody will be able to cause you trouble and harm. Since Wesley has\ndisappeared, your marriage with him is invalid, which means that you’re free from him now.”"
      },
      {
        "paragraph": "Catherine’s pink lips parted a little, and a look of confusion washed over her beautiful face."
      },
      {
        "paragraph": "At times, she had felt that Wesley was impossible to defeat. Whenever she thought that he was in a\nhopeless situation, he somehow managed to overcome it using terrifying means. “Really?”"
      },
      {
        "paragraph": "“Mm. Gavin and Wesley attempted to rebel tonight. As they previously won over quite a number of\npolitical bigwigs, they thought they would surely succeed today. However, they didn’t expect Nathan to\nhave sent the army from Geraldton over…”"
      },
      {
        "paragraph": "“So many people entered the city but Gavin didn’t realize it?” Catherine was puzzled."
      }
    ]
  },
  {
    "title": "Chapter 1768 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "et me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "“ It was because I saved Matthew and told Sheryl the truth. Sheryl canceled the transfer of Hill\nCorporation’s shares in time and halted Golden Corporation’s overseas development. Gavin was\nconfident only because he had invested in Golden Corporation and got endless funds from Wesley."
      },
      {
        "paragraph": "After Wesley lost Golden Corporation and Hill Corporation, he was left with nothing. As such, Gavin no\nlonger had as many funds. Those people in Canberra were swayed because of money. Without money,\nhow could they possibly side with the Mead family?”"
      },
      {
        "paragraph": "Catherine finally understood."
      },
      {
        "paragraph": "She could not help but sigh at how greedy some people in this world were."
      },
      {
        "paragraph": "At the same time, she was taken aback by Shaun’s plans."
      },
      {
        "paragraph": "After all, he had lost his memory, had he not? Before this, he was just like a fool. What a rapid change it\nwas."
      },
      {
        "paragraph": "She stared at him with complicated feelings.“"
      },
      {
        "paragraph": "Wasn’t Wesley aware that Matthew was saved and about the changes that took place in Golden\nCorporation’s overseas development?”"
      },
      {
        "paragraph": "“It was all settled within a day. When we took action, we deliberately ordered our people not to sound the\nalarm, so they didn’t have the faintest idea what was going on. Wesley had been under the impression\nthat he was the wealthiest man in Australia who could do anything as he pleased,” Shaun said scornfully."
      },
      {
        "paragraph": "Catherine instantly figured it out. At the same time, she was filled with mixed feelings. “Did you have this\nplanned from earlier on? You previously approached Hannah…”"
      },
      {
        "paragraph": "et me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "“ I wasn’t the only person who planned this. Prime Minister Snow, Titus, and I planned it together. ”"
      },
      {
        "paragraph": "Shaun said, “Nathan’s inferiority made Gavin lower his guard. After Sheryl kicked me out of Hill\nCorporation, I pretended to pursue Hannah  with the intention of making Wesley and the Meads think\nthat I was in a desperate situation. The whole of Canberra saw me as a laughing stock, which satisfied\nHannah’s vanity and Wesley’s desire to trample on me at the same time. The more Wesley felt that I was\nmiserable, the more conceited he became. Once a person becomes conceited, they’ll easily show their\ncloven hoof and become careless. In fact, if it weren’t for his carelessness, I wouldn’t have been able to\nsave Matthew.”"
      },
      {
        "paragraph": "After pausing for a moment, Shaun could not resist holding Catherine’s hands. “I’m sorry, Cathy."
      },
      {
        "paragraph": "Despite knowing that Wesley was forcing you and even hurt your dad before this, I gave you the cold\nshoulder. I didn’t mean it. I…”"
      },
      {
        "paragraph": "“I understand.” Catherine broke free from his hold. “I was also a pawn in your plan. The more frightened I\nseemed, the more complacent and delighted Wesley would become. He felt as if he was a cat trying to\ncatch a mouse. No doubt, he thought of himself as the winning party, whereas I was the mouse that got\nfooled.”"
      },
      {
        "paragraph": "Her clever words made Shaun feel guilty."
      },
      {
        "paragraph": "“Cathy, I’m sorry. Considering the seriousness of the issue, I promised Prime Minister Nathan not to\nbreathe a word of it. None of the Snows knew about i t either. Ryan and Rodney just discovered the truth\ntoday, and even the prime minister’s wife didn’t learn about it until the last minute.”"
      },
      {
        "paragraph": "Shaun continued with a deep voice, “ It’s because Nathan wanted to make all his betrayers in Canberra\nsurface. He needed to get rid of them completely. In order to prevent the news from spreading, those\ninvolved in this matter had to keep it a secret.”"
      },
      {
        "paragraph": "Catherine remained quiet for a long time."
      },
      {
        "paragraph": "She used to think of Nathan as a gentle person, yet it did not hit her how a gentle person could possibly\nbecome the prime minister."
      },
      {
        "paragraph": "It just showed that he was a manipulative and vicious person."
      },
      {
        "paragraph": "He left his family in a state of panic and fear. Even Freya was totally unaware of it. When others were\nhelpless and frustrated, he took advantage of it to deal with his opponents."
      },
      {
        "paragraph": "“Cathy, I promise you that such an issue won’t happen again.”"
      },
      {
        "paragraph": "Shaun’s eyes were filled with tenderness and guilt.“ I know it was unfair to you, but I was left with no\nchoice. If Gavin had taken control of Australia, Wesley would become more powerful. I wanted to keep\nyou out of trouble, so I had to completely destroy those who mean to harm you. I want you and the kids\nto be able to go out freely so you guys don’t have to keep hiding and think about fleeing Australia. This is\nyour home, after all.”"
      },
      {
        "paragraph": "His eyes appeared calm under the moonlight."
      },
      {
        "paragraph": "“Additionally, I want you to know that I’m no longer the previously useless Shaun who couldn’t even look\nafter his wife and kids. I was so stupid that I was deceived and even lost my memory. Now, I’ve become\nmore brilliant than before.”"
      }
    ]
  },
  {
    "title": "Chapter 1769 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine gazed at Shaun with a complex look as her eyelashes fluttered."
      },
      {
        "paragraph": "The man in front of her was as handsome as ever, but he had become more hostile compared to before."
      },
      {
        "paragraph": "Her mind was in a messy state right now."
      },
      {
        "paragraph": "“Shaun, I remember that you previously told me—”"
      },
      {
        "paragraph": "“You told me that I hadn’t interacted with any women nor did I know about love because I lost my\nmemory. You felt that I was reliant on you.”"
      },
      {
        "paragraph": "Shaun interrupted her, “You’re right, and I did give it a shot. But when Hannah approached me, I just\nfound her disgusting…”"
      },
      {
        "paragraph": "“It was because you approached her with an ulterior motive. Plus, you already knew from the start that\nshe’s evil…”"
      },
      {
        "paragraph": "“But when she touched me, I had no feelings for her at all.” Shaun’s eyes were intent and burning. “ Yet I\nhave feelings for you even when I touch you a little.”"
      },
      {
        "paragraph": "He was too straightforward."
      },
      {
        "paragraph": "Catherine’s face instantly turned crimson."
      },
      {
        "paragraph": "Shaun fixed his gaze on her charming face under the moonlight. Earlier, he had been feigning\nindifference and ignoring her on purpose. At this moment, he finally did not have to pretend anymore."
      },
      {
        "paragraph": "As his eyes rested on her lips, his Adam’s apple bobbed while his eyes blazed."
      },

      {
        "paragraph": "Just as Catherine was about to speak, Joel’s voice suddenly rang out from the door behind. “Cathy, it’s\nalready late. Come back and put the kids to sleep.”"
      },
      {
        "paragraph": "Seated in a wheelchair, Joel stared at Shaun vigilantly from a distance."
      },
      {
        "paragraph": "“Uncle Joel… ” Shaun smiled vaguely. He nodded and greeted Joel politely. “You may return to the office\ntomorrow. Wesley has gotten into deep waters and no one is going to target your company anymore.”"
      },
      {
        "paragraph": "Joel seemed a little surprised. He had heard his daughter mention Shaun’s plan but did not expect it to\nhave worked out."
      },
      {
        "paragraph": "Anyway, it was good to know that they did not need to leave this place."
      },
      {
        "paragraph": "“Thanks.” Joel’s tone was polite yet distant. “From now on, you and Cathy can finally go your separate\nways and lead your own lives.”"
      },
      {
        "paragraph": "In other words, Joel would not allow Shaun to get back together with Catherine even without Wesley’s\npresence."
      },
      {
        "paragraph": "Pretending that he did not grasp Joel’s message, Shaun gave an innocent smile. “Yeah. Now that Titus\nhas taken Wesley away, Wesley has lost his status. He’s like a dead person now and can no longer be\nconsidered Cathy’s husband. It’s true that she can start her life all over again. No one will criticize her\neven if she gets into a relationship.”"
      },
      {
        "paragraph": "At the mention of Titus, Joel zoned out for a while."
      },
      {
        "paragraph": "He had long since found out that his first love had remarried. She had married a man who was more\noutstanding than himself."
      },
      {
        "paragraph": "In the end, he still missed the chance."
      },
      {
        "paragraph": "At the sight of Joel’s expression, Shaun said, “By the way, Sheryl has already found out the truth. I’m\nguessing she’ll come and acknowledge Cathy.”"
      },
      {
        "paragraph": "“I have nothing to do with her.” Catherine finished her sentence with strong resistance. After that, she\nwalked to the back of Joel and pushed his wheelchair. “Dad, it’s chilly here. Let’s go in.”"
      },
      {
        "paragraph": "Joel nodded with complicated feelings. He then turned to say to Shaun, “Young Master Hill, you’re not\nyoung anymore. I hope you get a new girlfriend soon. From now on, you’re just the father to Catherine’s\nkids. I hope you won’t be involved with us in other ways.”"
      }
    ]
  },
  {
    "title": "Chapter 1770 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine froze for an instant. Then, she brought Joel into the house."
      },
      {
        "paragraph": "Shaun stood there nonchalantly for a while before he turned around and left."
      },
      {
        "paragraph": "When Catherine glanced out of the villa’s window, Shaun’s figure was already out of sight."
      },
      {
        "paragraph": "She spaced out momentarily until Joel’s voice sounded in her ears. “To be frank, Shaun is really brilliant.\nI didn’t expect him to be able to turn things around by getting rid of Wesley and Hannah when things\nwere already so dire. Among the youths, he’s probably the only one whom I truly admire."
      },
      {
        "paragraph": "“Although I admire him, it doesn’t mean that I  hope the two of you will get back together, Cathy. You\nwent through so much and faced a lot of suffering before this. As your father, I just hope"
      },
      {
        "paragraph": "that you can live a peaceful life with the kids. Ever since you got together with Shaun, I noticed that\nyou’ve experienced more hardships than joy. I hope that your partner will protect and support you instead\nof assisting you for a short while and leaving you alone after that.”"
      },
      {
        "paragraph": "“I understand. Dad, you should go and take an early rest.”"
      },
      {
        "paragraph": "Catherine nodded. She grasped the meaning of Joel’s words more than anyone else."
      },
      {
        "paragraph": "After sending Joel back to his room, Catherine returned to her bedroom."
      },
      {
        "paragraph": "At this time, the sitter had almost finished bathing the kids."
      },
      {
        "paragraph": "When Catherine was drying Suzie and Lucas’ hair, Freya suddenly called her. She sounded agitated on\nthe phone. “Sh*t! I can’t believe that Wesley and Hannah have been arrested. That damned man,\nNathan, has been hiding it from us. I was so frightened all this while that I thought my life would be\nover… Now, I feel like an idiot.”"
      },

      {
        "paragraph": "Catherine found it amusing. “ I realized that you’re beginning to sound like Rodney now after spending\nquite some time with him.”"
      },
      {
        "paragraph": "“Is it the right time to discuss this? Most importantly, we survived this ordeal! ” Freya was close to tears.\n“During this period, I was so terrified that I wasn’t sleeping well. When I heard the gunshot outside the\nvilla today, I nearly pissed myself.”"
      },
      {
        "paragraph": "“Is your baby okay?” Catherine asked nervously at once."
      },
      {
        "paragraph": "“The baby’s okay. When Rodney came back just now, I gave him a piece of my mind, so I feel much\nbetter now, ” Freya said."
      },
      {
        "paragraph": "Catherine was at a loss for words. “According to what Shaun said, Rodney seemed to only find out about\nthe plan today. Don’t blame him.”"
      },
      {
        "paragraph": "“Do you blame Shaun? Rodney said that he knew it long ago.” Freya suddenly asked, “But he didn’t\ninform you, right?”"
      },
      {
        "paragraph": "Catherine went silent for a moment before she replied, “I don’t blame him. After all, it was the prime\nminister’s plan. If he had informed me, I would’ve also told you if I saw your worried face. A big mouth\nlike you might’ve spread the news to the Snows. Those around us might seem reliable, but once they\nlearn more about the plan, it could leak out. If the plan hadn’t worked out, we would’ve suffered terrible\nconsequences.”"
      },
      {
        "paragraph": "“ .. Enough. You actually called me a big mouth. ” Freya flew into a fury. She gritted her teeth for a while\nbefore she said weakly, “Having said that, if I"
      },
      {
        "paragraph": "had learned the truth, I surely would’ve told you about it. Forget it. What you said makes sense too.”"
      },
      {
        "paragraph": "Catherine laughed.  “Don’t worry. After this incident, your identity as the prime minister’s goddaughter will\nbe consolidated. No one will dare to offend you in the future since they won’t be bold enough to act\nagainst the Snow family.”"
      },
      {
        "paragraph": "“That’s true.” Freya chuckled and said, “Well, people of high ranks like us have to put up with so much\nfear to gain great honor. By the way, we can finally relax now. Let’s go shopping tomorrow."
      },
      {
        "paragraph": "Also, I need to hand Hudson Corporation over to you.” “Mm.”"
      },
      {
        "paragraph": "Catherine nodded. Indeed, it was about time she relaxed."
      },
      {
        "paragraph": "However, after she lay on the bed, she still felt that everything was surreal."
      },
      {
        "paragraph": "Was Wesley’s life really over? What a wonderful feeling it was."
      }
    ]
  },
  {
    "title": "Chapter 1771 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "The feeling was so wonderful that Catherine had trouble falling asleep."
      },
      {
        "paragraph": "She only fell asleep when it was 3:00 a.m."
      },
      {
        "paragraph": "However, she was awoken by the kids the next day."
      },
      {
        "paragraph": "She opened her eyes in a daze, only to find a tall, attractive figure in her room. Dressed in a white T-shirt\nand a pair of blue jeans, the man seemed to be at the peak of his youth, looking like he was still 20 years\nold. One would find it hard to resist his charm and elegance."
      },
      {
        "paragraph": "After staring at him in confusion for a while, she rubbed her eyes, thinking that she might not be awake."
      },
      {
        "paragraph": "Somehow, she still saw the scene of Shaun combing Suzie’s hair in her bedroom."
      },
      {
        "paragraph": "It was very rare to see Suzie seated on the chair so obediently. While holding a comb, Shaun bent over\nand braided her hair carefully."
      },
      {
        "paragraph": "“Not  bad. You can braid better than Mommy.” Suzie looked into the mirror and was satisfied with"
      },
      {
        "paragraph": "the braid. “Please put on a pink hairband for me. ” “Alright, princess.”"
      },
      {
        "paragraph": "Shaun felt as though he had turned into a barber. Suddenly, a shriek sounded from behind. He turned\naround, only to find Catherine staring at him with wide eyes."
      },
      {
        "paragraph": "Although she had just gotten up, her ruffled  hair did not affect her pretty face. She was wearing cotton\npajamas. Her shirt slid to one side, revealing a large part of her shoulder. The picture of her completely\nnaked flashed through Shaun’s mind."
      },

      {
        "paragraph": "After glancing at Catherine, Shaun began to feel his body burning."
      },
      {
        "paragraph": "He quickly took a deep breath and contained his feelings as much as he could."
      },
      {
        "paragraph": "“Why are you here?” Catherine glared at him with disbelief without realizing how amusing she appeared.\n“ Shaun, this is my room. Who allowed you to enter? Where’s my dad?”"
      },
      {
        "paragraph": "“When I came in, Uncle Joel had already gone to work. It was the housekeeper at the gate who let me\nin.” Shaun blinked with an innocent and natural expression. “I want to send the kids to preschool. When I\nentered the room, I noticed that you were snoring loudly in your sleep while the kids were"
      },
      {
        "paragraph": "already awake. Suzie didn’t seem to know how to brush her teeth, so I helped her wash up and braided\nher hair. Right, Suzie?”"
      },
      {
        "paragraph": "He lowered his head to look at his daughter."
      },
      {
        "paragraph": "Suzie nodded, completely unaware that something was not right with the atmosphere in the bedroom.\nShe looked into the mirror and was caught up with her pretty appearance.  “Mommy, do I look beautiful\ntoday?”"
      },
      {
        "paragraph": "Catherine’s mouth twitched."
      },
      {
        "paragraph": "If only her daughter could pay attention to what was happening. At this point, all Suzie cared about was\nher beauty."
      },
      {
        "paragraph": "Shaun’s description of her snoring loudly in her sleep made her embarrassed."
      },
      {
        "paragraph": "As a mother, she was sleeping like a log when her kids were already awake."
      },
      {
        "paragraph": "“Sure you do. ” After replying to Suzie’s question perfunctorily, Catherine said to Shaun furiously, “ Even\nso, you shouldn’t have barged into my room. A distinction should be made between a man and a woman,"
      },
      {
        "paragraph": "alright? We’ve gotten a divorce, so I’m currently a single, unmarried woman."
      },
      {
        "paragraph": "Did he know how hard it was for her to be a single, unmarried woman?"
      },
      {
        "paragraph": "Shaun raised his brows. “I thought that… we’re already very close to each other, so we don’t have to\nmind that. After all, we already have children.”"
      },
      {
        "paragraph": "Catherine responded in a huff, “Just because we have children, it doesn’t mean we shouldn’t keep a\ndistance. Otherwise, people might assume that I’m still in a relationship with you. It’ll be unfavorable for\nme to get a new partner then.”"
      },
      {
        "paragraph": "“You’re planning to get a new partner, huh?” Shaun curled his lips and smiled pensively."
      },
      {
        "paragraph": "For some reason, Catherine found his smile a little creepy. She immediately glowered at him. “It’s none\nof your business.”"
      }
    ]
  },
  {
    "title": "Chapter 1772 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“I’m not meddling in your business. I’m just asking.”"
      },
      {
        "paragraph": "Shaun turned his head and continued braiding Suzie’s hair."
      },
      {
        "paragraph": "Suzie was not stupid. She simply pretended as if she did not hear or see anything. Anyway, no matter\nwho Mom decided to be with, the fact that Shaun was her dad could not be erased."
      },
      {
        "paragraph": "It was better to take the opportunity to enslave this dad of hers."
      },
      {
        "paragraph": "“It looks nice, right? Our Suzie will definitely be the prettiest little princess when you go to preschool\ntoday. ” Shaun flattered Suzie while smiling. That put Suzie in a pleasant mood."
      },
      {
        "paragraph": "After that, Shaun helped Suzie to change her clothes as well."
      },
      {
        "paragraph": "He brought the two children downstairs to have breakfast."
      },
      {
        "paragraph": "It was a rare morning when Catherine did not have to take care of the two children. After staring into\nspace for a moment, she simply lay on the bed and continued sleeping."
      },
      {
        "paragraph": "After all, Shaun was taking care of the kids. Why did she have to work tirelessly every day when she\ncould make use of the children’s biological father? She was not a fool."
      },
      {
        "paragraph": "She still had to rest when it was time to rest. There was no need to carry all the responsibilities herself."
      },
      {
        "paragraph": "After Catherine came to that conclusion, she fell asleep again."
      },
      {
        "paragraph": "When she woke up, the sun was already high up in the sky."
      },
      {
        "paragraph": "She looked at the time. It was 11:00 a.m. She sat up and looked at her phone."
      },

      {
        "paragraph": "As expected, today’s news was all related to Wesley and Hannah. There were even seven or eight\ntrending topics about them. [Golden Corporation’s Medicine is Substandard. 123 Countries Overseas are\nBoycotting the Medicine.]"
      },
      {
        "paragraph": "[Wesley Lyons Suspected of Bribery, Arrested for Investigation], [Wesley Lyons Suspected of Kidnapping\nA Foreigner], [Wesley, Jeffery, Sally, and Rebecca Involved in goo Billion US Dollars Fraud], [Wesley\nLyons Allegedly Killed His Biological Nephew, His Sister Sonya Lyons Already Handed In Related\nEvidence of the Crime], [Wesley and Hannah Suspected of Endangering the Country], [Minister Gavin\nMead and Family Arrested for Allegedly Jeopardizing the Country’s Safety]…"
      },
      {
        "paragraph": "As the news was too sudden, the whole of Australia and even other countries were shocked."
      },
      {
        "paragraph": "The buzz on the internet made history since the last big news tens of years ago."
      },
      {
        "paragraph": "[Oh my gosh, how many crimes did Wesley commit? Kidnap, murder, jeopardizing the country’s safety,\nand fraud. Is he trying to go against the heavens?]"
      },
      {
        "paragraph": "[This person is finally arrested. I’m so happy. I was disgusted ever since I saw the scandalous video of\nhim and his secretary. He even became the wealthiest man in Australia afterward. I could only laugh in\nsarcasm. Even such trash could become the richest man. I understand now. He relied on fraud to\nachieve that. If our country’s economy were to be led by this kind of person, I reckon our economy will be\ndone for in a few years.]"
      },
      {
        "paragraph": "[Wait, he even murdered his biological nephew? Is he still human?]"
      },
      {
        "paragraph": "[Gavin and his family were arrested too. I’ve seen pictures of Gavin and Wesley at a few public events.\nThey looked pretty close. It’s obvious that they were trying to start a revolt and got caught in the end.\nThank God they’ve been arrested.]"
      },
      {
        "paragraph": "[You’re right. Canberra has completely changed. Many people were caught during Gavin’s birthday\nbanquet yesterday. They cornered the prime minister openly. Luckily, the prime minister  had his guard\nup beforehand. Not only that, the identity of the person whom Wesley kidnapped isn’t ordinary. I heard\nthat person is the heir of the world’s wealthiest and most mysterious family."
      },
      {
        "paragraph": "Wesley is past saving indeed. His arrest this time will surely end up in a death sentence. It’s an\nunchangeable fact.]"
      },
      {
        "paragraph": "[Ha, do you know why he refused to divorce Catherine? Because Catherine’s mother is an oil tycoon and\nshe’s rich. Wesley married and wooed Catherine before just because of this. Everything about him is\nfake, including his love.]"
      },
      {
        "paragraph": "[Please don’t scare me. When did Catherine have a mother who’s an oil tycoon?]"
      },
      {
        "paragraph": "[It’s true. It’s just that Catherine didn’t know about it. Wesley took Catherine’s hair and had Rebecca\npretend to be that family’s daughter. That’s why Wesley is being suspected of fraud. Everything has been\nexposed now. The police at the station didn’t sleep for the whole night last night to review Wesley’s case.\nHe committed too many crimes.]"
      }
    ]
  },
  {
    "title": "Chapter 1773 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine was amazed. She had to acknowledge the netizens’ strength in obtaining information."
      },
      {
        "paragraph": "Not many people knew that she was Sheryl’s daughter. It was unknown how that information was leaked."
      },
      {
        "paragraph": "She was even on the trending searches, and there were rumors that she would be one of the top five\nwealthiest people among those born with a silver spoon in their mouths."
      },
      {
        "paragraph": "It was totally ridiculous."
      },
      {
        "paragraph": "Catherine had no intention of acknowledging Sheryl as her mother, not to mention inheriting her assets.\nThose people must be bored out of their minds."
      },
      {
        "paragraph": "She was starting to feel hungry. She got up, changed into casual clothes, and went downstairs. The\nhousekeeper, Aunty Cally, was watering the flowers on the balcony."
      },
      {
        "paragraph": "“Aunty Cally, is there still breakfast? I’m a little hungry.”"
      },
      {
        "paragraph": "Catherine asked while rubbing her eyes."
      },
      {
        "paragraph": "“Breakfast? There is, but it’s all cold and it’s almost time for lunch…” Aunty Cally’s gaze was slightly\nstrange."
      },
      {
        "paragraph": "“ It’s okay. I’ll just have something simple to eat. ”"
      },
      {
        "paragraph": "Catherine did not notice Aunty Cally’s gaze. She was just puzzled. Usually, Aunty Cally would already be\npreparing lunch at this hour. Why was she still watering flowers?"
      },
      {
        "paragraph": "Catherine walked into the kitchen. She was stunned when she saw the towering figure inside that had its\nback toward her."
      },

      {
        "paragraph": "Were her eyes seeing things?"
      },
      {
        "paragraph": "Why was she seeing Shaun in the kitchen of her house, wearing an apron?"
      },
      {
        "paragraph": "When Shaun turned around, revealing the blue- checkered apron on his waist, Catherine’s pretty eyes\nwidened instantly. The look on her face was utterly adorable."
      },
      {
        "paragraph": "Shaun smiled when he saw that. “You must be hungry. I made you a honey sponge cake and blended\nsome fruit juice. You can have these first, but don’t eat until you’re too full. It’ll be lunchtime soon.”"
      },
      {
        "paragraph": "His tone was very natural as if this was his house and she was his wife. Everything just felt very natural."
      },
      {
        "paragraph": "Catherine felt uncomfortable. “Shaun, why are you in my kitchen? Aren’t you supposed to be sending\nSuzie and Lucas to preschool? Why haven’t you left yet?”"
      },
      {
        "paragraph": "“I left and came back again.” Shaun was holding a plate, and there was a slice of honey sponge cake on\nit. In his other hand was a glass of fruit juice. “Do you want me to feed you?”"
      },
      {
        "paragraph": "Catherine looked at the slice of cake in shock. “You made this? Impossible.”"
      },
      {
        "paragraph": "She remembered that Shaun’s cooking was not very good. It was just edible."
      },
      {
        "paragraph": "However, the cake in front of her looked just like those sold in bakeries."
      },
      {
        "paragraph": "“I made it. Your housekeeper can prove it,” Shaun said with a serious tone."
      },
      {
        "paragraph": "Catherine eyed him from head to toe with complicated feelings. “Did you get reincarnated that even your\ncooking skills have improved?”"
      },
      {
        "paragraph": "“Were my cooking skills terrible in the past?” Shaun was puzzled."
      },
      {
        "paragraph": "“It was so-so. Anyway, you couldn’t bake a cake back then. I never wanted a second slice after finishing\nthe first slice, ” Catherine said honestly."
      },
      {
        "paragraph": "Shaun frowned. He felt like blaming the previous Shaun. “Maybe it’s because… the previous me wasn’t\nattentive enough. Actually, these things aren’t hard. There are a lot of tutorials online. It’s easy to learn by\nfollowing those tutorials.”"
      },
      {
        "paragraph": "Catherine went silent upon hearing that."
      },
      {
        "paragraph": "Maybe that really was the reason. Besides, Shaun had to manage a huge company in the past. There\nwere also people like Wesley and Mason preying on him. It was difficult for Shaun and Catherine to have\npeaceful days back then."
      },
      {
        "paragraph": "“Eat first. I’m going to prepare lunch.” Shaun nudged her to go outside before he headed back into the\nkitchen."
      },
      {
        "paragraph": "Catherine stumbled out of the kitchen. She was forced to sit at the dining table."
      }
    ]
  },
  {
    "title": "Chapter 1774 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine’s feelings were complicated. “Shaun, didn’t my dad tell you yesterday? He doesn’t wish for us\nto be together…”"
      },
      {
        "paragraph": "“He did, but it’s not your dad that I want to be with anyway. His words can’t affect me at all. Moreover, he\nhas already gone to the company. The negative news regarding the fire that broke out at the company\nhas affected his company greatly. He has no time to care about me at all. I reckon he has to work extra\nhours until late at night these days.”"
      },
      {
        "paragraph": "Shaun was confident."
      },
      {
        "paragraph": "Catherine touched her forehead. He really did know how to take advantage of the situation. However, it\nwas true that Joel might not have the time to care about Shaun now."
      },
      {
        "paragraph": "“But I already told you last time—”"
      },
      {
        "paragraph": "“You indeed said it clearly enough. It’s precisely because it’s too clear that I’ve come to understand my\nthoughts. ” Shaun bent over and went near her ear. He whispered, “I’ve already approached other\nwomen but I realize that you’re the only one that I want to have s*x with. What is love if this isn’t it?”"
      },
      {
        "paragraph": "Catherine’s face heated up from his flirtatious words."
      },
      {
        "paragraph": "She glared at Shaun. “You’re overthinking. All men want to sleep with pretty women as soon as they see\none.”"
      },
      {
        "paragraph": "“Cathy, not all men are like that. Those who are controlled by their lower body are sex maniacs. I’m not.\nIt’s only because I like you and I love you.” Shaun’s dark eyes were filled with affection. “You can reject\nme, but I have the right to pursue you. I didn’t pursue you before because I thought I didn’t have the right\nto do so. However, I think I’m qualified now.”"
      },

      {
        "paragraph": "“Why do you think so?” Catherine was puzzled."
      },
      {
        "paragraph": "“Firstly, I can protect you. Secondly, I won’t lose my memories again. I won’t let my memories be altered\nby anybody else too. Thirdly, I have ample time now. I can slowly pursue you.”"
      },
      {
        "paragraph": "He held three fingers up and said everything confidently."
      },
      {
        "paragraph": "Catherine was speechless. She could understand the first two reasons, but something was off with the"
      },
      {
        "paragraph": "third one. “ Shaun, you’re still young. You should have a job and a career. I think you should return to Hill\nCorporation. It’s the fruit of your efforts, after all.”"
      },
      {
        "paragraph": "“No, I’m not interested in having a career right now. I just want to be a good husband who does the\nlaundry and cooking at home.”"
      },
      {
        "paragraph": "Shaun gazed at Catherine with his hands in his pockets. “By the way, do you have any clothes that I\nneed to wash?”"
      },
      {
        "paragraph": "“… Thank you, but I’ve already washed them.”"
      },
      {
        "paragraph": "“You can just leave it in the future. Let me wash your clothes for you.” After Shaun spoke, he returned to\nthe kitchen to cook lunch."
      },
      {
        "paragraph": "Catherine had a headache."
      },
      {
        "paragraph": "She called Aunty Cally over. “After this when Shaun sends Suzie and Lucas to preschool, can you get\nthe security not to let him back in?”"
      },
      {
        "paragraph": "After a moment of silence, Aunty Cally said, “Miss, the security guard didn’t let him in. He climbed over\nthe wall himself. After he came in, he kept helping me with various chores. He’s such a huge person that\nI can’t chase him out.”"
      },
      {
        "paragraph": "Catherine really had to hand it to Shaun."
      },
      {
        "paragraph": "The wall of her house that was three meters tall could not even block him out. What other ways could\nthere possibly be?"
      },
      {
        "paragraph": "“Forget it. I’ll just take it as there’s an extra helper in the house who’s providing his services for free. It’s a\nwaste not to use him anyway.” Catherine sighed. She could only think of it that way."
      },
      {
        "paragraph": "After having the cake and fruit juice, Catherine rested for a while. Then, it was already lunchtime."
      },
      {
        "paragraph": "Shaun served the dishes—fish, chicken wings, and vegetable soup."
      },
      {
        "paragraph": "The dishes had bright colors, and the taste was not bad as well."
      },
      {
        "paragraph": "After Catherine had her fill, she went upstairs and changed into a denim maxi skirt, pairing it with an\nalmond -colored knitted sweater. She also put on makeup."
      },
      {
        "paragraph": "She had been in an irritable mood lately, so she had not dressed up in a long time."
      },
      {
        "paragraph": "She even wore a pair of earrings and a necklace that day. Her skin was fair, and her face was plump with\ncollagen. Her features were stunning as well. After dressing up, she was so pretty that her looks could\nsurpass even those celebrities on television."
      }
    ]
  },
  {
    "title": "Chapter 1775 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "When Catherine went downstairs with her handbag, a gleam of amazement flashed through Shaun’s\neyes."
      },
      {
        "paragraph": "He had always known that she was beautiful, but she was as pretty as a fairy after dressing up."
      },
      {
        "paragraph": "He did not know that she would be so pretty with earrings and a necklace. They accentuated her slender\nneck and collarbone, making them look so delicate and seductive."
      },
      {
        "paragraph": "With just a glance, he felt his body burning up."
      },
      {
        "paragraph": "Shaun quickly took a deep breath. He put his hands in his pockets without changing his expression. He\nstepped forward, and there was a hint of hoarseness in his voice. “Where are you going?”"
      },
      {
        "paragraph": "Catherine deliberately gave him an indifferent glance. “It’s none of your business.”"
      },
      {
        "paragraph": "That sentence rendered Shaun speechless."
      },
      {
        "paragraph": "He quickly recalled that she said she was going to look for a new partner that morning."
      },
      {
        "paragraph": "‘She didn’t doll herself up to go on a date with another man, right?’"
      },
      {
        "paragraph": "When that thought flashed across his mind, Shaun was so irritated that he wanted to spit blood."
      },
      {
        "paragraph": "He finally managed to eliminate Wesley with much difficulty. He did not do it just so she could start a new\nrelationship with another man."
      },
      {
        "paragraph": "“I’m not trying to boss you around but where are you going? I’ll drive you there, ” Shaun said gently a s\nhe restrained the jealousy roiling in his heart with all his might."
      },
      {
        "paragraph": "“No need. I can drive myself. Don’t follow me.” Catherine walked toward the garage as she said that."
      },

      {
        "paragraph": "Shaun narrowed his eyes. There was no way she could shake him off and go on a date with another\nman."
      },
      {
        "paragraph": "He followed after her in long strides."
      },
      {
        "paragraph": "Catherine did not notice him. She was thinking about which car she should drive that day."
      },
      {
        "paragraph": "It seemed that she had not been flashy for a long time. Wesley had been arrested, so the weight on her\nchest was gone. She did not have to worry anymore."
      },
      {
        "paragraph": "Therefore, she chose a very €ashy red Lamborghini."
      },
      {
        "paragraph": "However, just as she got in the car, a man got in the passenger seat beside her."
      },
      {
        "paragraph": "Catherine’s face darkened instantly. “Shaun, why are you following me? Get down.”"
      },
      {
        "paragraph": "“Cathy, you’re so pretty today. I’m worried some rascals outside will be attracted by your beauty. I have to\nfollow you and protect you.” Shaun smiled as he took his phone out. “By the way, you might not know\nthis yet, but many people already know that you’re Sheryl’s daughter. Some netizens analyzed that your\nnet worth is at least 6oo billion US dollars.”"
      },
      {
        "paragraph": "600 billion… US dollars."
      },
      {
        "paragraph": "How many zeroes were there behind the number? Catherine had never seen so much money in her\nwhole life."
      },
      {
        "paragraph": "Catherine felt speechless by the netizens’ claims. How bored must these netizens be?"
      },
      {
        "paragraph": "Did they think they would not have to take responsibility after reporting a number?"
      },
      {
        "paragraph": "Shaun continued saying, “Of course, I know that you definitely won’t salvage your mother-daughter\nrelationship with Sheryl. The claims going around on the internet are fake. However, other people aren’t\nclear about this. They only know that your mom is rich. Maybe there’ll be some reckless people who\nwant to kidnap you. Even Matthew was kidnaped before. That’s why it’s too dangerous for you to go out\nalone. You need bodyguards.”"
      },
      {
        "paragraph": "After saying that, he took a pair of sunglasses out of nowhere. He was as handsome as those flirty\nplayboys."
      },
      {
        "paragraph": "Catherine tilted her head and looked at him with a fake smile. “Why do I feel like you’re more dangerous\nthan those kidnappers? At least they’re only aiming for the money. You’ re even sleazier, aiming for my\nbody.”"
      },
      {
        "paragraph": "“Cathy, you’re wrong there.”  Shaun  smiled  and gave an innocent expression. “Only ugly people are\nsleazy. For handsome people like me, it’s called admiration.”"
      },
      {
        "paragraph": "“Shaun, why have you become so talkative?” Catherine rolled her eyes at him."
      },
      {
        "paragraph": "“I can’t help it because I’m pursuing you now. If I were to act cold and distant when I’m pursuing you,\nyou’d surely kick me to the crematorium. ” Shaun told the truth."
      },
      {
        "paragraph": "Catherine thought about it. He was right. If Shaun still showed his cool, bossy president attitude while\npursuing her, she would surely kick him until he died."
      }
    ]
  },
  {
    "title": "Chapter 1776 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "After all, why would you be haughty when pursuing another person?"
      },
      {
        "paragraph": "Shaun had become quite tactful."
      },
      {
        "paragraph": "As Catherine was unable to chase him away, she had no choice but to start the car."
      },
      {
        "paragraph": "After driving for about half an hour, Catherine stopped by the roadside. She bought a bouquet of\ncarnations and a basket of fruits."
      },
      {
        "paragraph": "Shaun immediately understood. He quickly bought a set of the same things as well."
      },
      {
        "paragraph": "Catherine glanced at him. “Why did you buy those things?”"
      },
      {
        "paragraph": "“I’ll do whatever you do,” Shaun said with much experience."
      },
      {
        "paragraph": "Catherine could only let him be."
      },
      {
        "paragraph": "After that, she drove the car to the hospital."
      },
      {
        "paragraph": "When she arrived at the door of the VIP ward, she took a deep breath and pushed the door to enter.\nThere was only Matthew and a caregiver in the ward."
      },
      {
        "paragraph": "He was sitting on the bed, wearing a hospital gown. He was hooked up to an IV."
      },
      {
        "paragraph": "It was Catherine’s first time seeing Matthew again after some time. The man of mixed race who used to\nbe handsome and dazzling was just skin and bones at that moment. His hand was even wrapped in a\nthick layer of gauze."
      },
      {
        "paragraph": "Although Matthew had gone to Gavin’s banquet last night, he was sent to the hospital right after leaving\nthe banquet."
      },

      {
        "paragraph": "It was because Wesley had severely tortured Matthew during that period. He had only endured it for the\nwhole day yesterday. After Gavin was arrested, he could not endure it anymore."
      },
      {
        "paragraph": "“Hi.” Matthew raised his head and showed Catherine a bright smile."
      },
      {
        "paragraph": "Catherine was taken aback. She thought he would be overcome with trauma after being locked up for so\nlong. She did not expect that he was still that bright young man after coming back."
      },
      {
        "paragraph": "However, her heart was in pain seeing Matthew in this state."
      },
      {
        "paragraph": "Maybe it was because he was her biological brother."
      },
      {
        "paragraph": "“Matthew, I’m very happy to see you safe and sound,” Catherine walked to his side and said in a low\nvoice, “But I still have to apologize to you, Matthew. I asked you to go to Melbourne to investigate\nRebecca at that time, yet I forgot how evil humans can be…”"
      },
      {
        "paragraph": "“ It’s not your fault. I was the one who was stupid and got manipulated.”"
      },
      {
        "paragraph": "Matthew grinned and revealed his white teeth. “My dad said this is a lesson for me. As the heir of the\nCostner family, I was so easily taken captive by someone else. This really serves as a lesson to me. I’ve\nbeen too at ease under the protection of my family.”"
      },
      {
        "paragraph": "He had a smile on his face, yet there was deep regret in his eyes."
      },
      {
        "paragraph": "Catherine suddenly felt that he looked like a pitiful little puppy. She could not resist patting his soft, short\nhair."
      },
      {
        "paragraph": "Matthew was stunned. She was the second person to pat his head like this besides Sheryl."
      },
      {
        "paragraph": "He did not hate it. Instead, he felt like he was being pampered."
      },
      {
        "paragraph": "He felt like every one of his organs was healed."
      },
      {
        "paragraph": "At the side, Shaun’s handsome face darkened. He went over in big steps and yanked Catherine’s hand\naway. He said while  smiling,  “Stop patting. He’s not a dog.”"
      },
      {
        "paragraph": "Puppy Matthew, “…”"
      },
      {
        "paragraph": "Did he just get criticized or what?"
      },
      {
        "paragraph": "Catherine gazed at the jealousy swirling in the eyes of the man in front  of her speechlessly.  “It’s none of\nyour business. I can touch whoever I want.”"
      },
      {
        "paragraph": "“Cathy, a man’s head can’t be touched simply,” Shaun said seriously."
      },
      {
        "paragraph": "“Matthew is my brother, ” Catherine snapped. Although she did not acknowledge Sheryl, she still liked\nMatthew. Moreover, Matthew had not harmed her before. Shaun raised his eyebrows. “ Is your brother\nnot a man?”"
      }
    ]
  },
  {
    "title": "Chapter 1777 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine felt like her head was about to explode."
      },
      {
        "paragraph": "She secretly glared at Shaun. Shaun pretended like he did not see it and crossed his arms. “I’m not\nmaking personal attacks. If Cathy treats you as a brother, then you’re my brother-in-law.”"
      },
      {
        "paragraph": "Matthew was taken aback. Thinking about the relationship between Shaun and Catherine, it seemed like\nthat was really the case."
      },
      {
        "paragraph": "He did not know that Shaun and Catherine had broken up again recently."
      },
      {
        "paragraph": "“Who’s your brother-in-law?” Catherine was utterly defeated by Shaun’s shamelessness. “Don’t forget\nthat I’ve already broken up with you.”"
      },
      {
        "paragraph": "“You did that one -sidedly. ” A gloomy expression appeared on Shaun’s handsome face. “Cathy, your\nwords are too much. In order to save your brother, I sacrificed myself to approach that woman Hannah\njust so Wesley would put his guard down. You don’t even know how badly I was humiliated by the Mead\nfamily. You’re just thinking of steering clear of me now. You forgot— ”"
      },
      {
        "paragraph": "“Enough. Shut up.”"
      },
      {
        "paragraph": "Catherine covered Shaun’s mouth."
      },
      {
        "paragraph": "She had a bad feeling that he would not say anything good if she let him continue speaking."
      },
      {
        "paragraph": "Shaun obediently shut his mouth. His pure, dark eyes blinked affectionately as he gazed at her."
      },
      {
        "paragraph": "Catherine suddenly felt that her hand on his face was getting hotter. She quickly pushed him away and\nglared at him with annoyance."
      },

      {
        "paragraph": "Shaun looked at her angry face. He showed a doting smile."
      },
      {
        "paragraph": "Matthew rolled his eyes. “That’s enough. You both came to visit me, so stop having a lovers’ quarrel in\nfront of someone who’s still single.”"
      },
      {
        "paragraph": "“Don’t talk nonsense. How are we having … a lovers ‘ quarrel.” Catherine could not accept this\nstatement."
      },
      {
        "paragraph": "“Haha. ” Matthew grinned. Women often said one thing but meant another. Furthermore, from what he\nknew, Catherine and Shaun were very attached before. He could not even come between them no\nmatter how much he tried. They were definitely just quarreling."
      },
      {
        "paragraph": "Although Matthew was young and had never dated before, he still knew about the things between a man\nand a woman."
      },
      {
        "paragraph": "Shaun’s lips curved. He did not allow Catherine to explain and changed the topic. “Where are your\nparents?”"
      },
      {
        "paragraph": "Matthew’s gaze dimmed. “My dad sent my mom to receive treatment. She’s very sick. She fainted in the\ncar not long after leaving the manor yesterday.”"
      },
      {
        "paragraph": "Catherine went silent upon hearing that. She was not a saint. She could not so easily forgive Sheryl after\nwhat she had done."
      },
      {
        "paragraph": "Matthew raised his head and looked at her indifferent expression. He felt helpless. “I heard about what\nmy mom did from my dad. Please believe me when I say that she wasn’t like that in the past. It’s all my\nfault. I brought Rebecca to Mom with that DNA test report and made her think that she had found her\nbiological daughter."
      },
      {
        "paragraph": "“Actually, when Rebecca just returned to the family, Mom only felt guilty toward her. She didn’t approve of\nsome of Rebecca’s actions as well."
      },
      {
        "paragraph": "However, Rebecca kept saying that she was abducted when she was young. Mom felt that it was her\nresponsibility. If she had taken care of her"
      },
      {
        "paragraph": "daughter properly, Rebecca wouldn’t have gotten kidnapped. She also thought she had failed to educate\nher well. You’re a mother too. You should understand this feeling, right?”"
      },
      {
        "paragraph": "Catherine remained silent."
      },
      {
        "paragraph": "If Suzie had gotten kidnapped when she was young and turned evil after she was found, Catherine\nwould not blame the child but herself."
      },
      {
        "paragraph": "Matthew saw her keeping silent and quickly said, “ I’m to blame as well. After coming to Melbourne, I\ndidn’t investigate the matter thoroughly. That made my family believe in Rebecca’s identity without any\ndoubts. Initially, after returning to Melbourne, my mom was about to recover her memories. That was\nwhen Rebecca drugged Mom and made her emotionally unstable. After that, she often fought with my\ndad at home as well. Perhaps things wouldn’t have turned out as bad if my dad and I had noticed the\nchange earlier."
      },
      {
        "paragraph": "However, everyone thought Rebecca was her biological daughter.  Who knew that Rebecca would harm\nmy “If it weren’t because my mom was under the drug’s influence, she wouldn’t have become like that at\nall. When she escaped from the ward, she thought you were the one who caused the death of her\nbiological daughter, so she went insane. She lost all rationality at that time."
      },
      {
        "paragraph": "She believed in everything other people said. She just didn’t expect her biological brother and sister-in-\nlaw to be that evil.” “Therefore, you’re saying that she’s innocent and was affected by the drug, so I\nshould forgive her?”"
      }
    ]
  },
  {
    "title": "Chapter 1778 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine suddenly spoke."
      },
      {
        "paragraph": "Matthew was stunned. He opened his mouth, and after a moment, he said resignedly,  “After she found\nout that you’re her biological daughter, she felt guilty and regretful. She saw Lucas yesterday and really\nwished to acknowledge him. However, she knows that you despise her, so she didn’t dare to speak.”"
      },
      {
        "paragraph": "“Matthew, I can’t just forget about everything just because she was under the influence of a drug. It’s fine\nif she had only called me a b*tch in the restaurant. That only made me lose all expectations I had for a\nmother. What I can’t forgive is that she allowed Rebecca to harm Suzie. From that moment onward, I\nknew I couldn’t acknowledge her as my mother anymore…”"
      },
      {
        "paragraph": "Bang."
      },
      {
        "paragraph": "The sound of something dropping on the floor came from behind."
      },
      {
        "paragraph": "Catherine was taken aback. After sensing the weird silence in the ward, she turned around and saw"
      },
      {
        "paragraph": "Sheryl and Titus standing at the door. There was a bag of medications on the floor beside Sheryl’s feet."
      },
      {
        "paragraph": "Sheryl looked at Catherine mournfully. There was remorse and bitterness deep in her eyes. Her face was\nas pale as a sheet too."
      },
      {
        "paragraph": "Catherine pressed her lips together."
      },
      {
        "paragraph": "She had not seen Sheryl in a long time. She only saw her for the first time when she was meeting Titus\nin the restaurant. Sheryl was so beautiful at that time. However, after coming to Australia for only two\nmonths, she had suffered so much till she became skinny and frail."
      },
      {
        "paragraph": "Catherine knew that Sheryl was not okay."
      },

      {
        "paragraph": "However, the wound in her heart could not be erased."
      },
      {
        "paragraph": "“Mom…” Matthew was shocked. He did not expect his parents to come."
      },
      {
        "paragraph": "He did not know how much of their conversation his mom had heard. Would it not trigger her illness?"
      },
      {
        "paragraph": "“Matt, I’m okay.”"
      },
      {
        "paragraph": "Sheryl shook her head. Her heart was in pain, so much pain that she was about to faint. She wanted to\nthrow a tantrum and smash things. However, she was conscious of her illness. She could not let the"
      },
      {
        "paragraph": "drug control her anymore. She had made a mistake once, and she could not repeat it."
      },
      {
        "paragraph": "She looked at Catherine, who was in front of her, attentively."
      },
      {
        "paragraph": "As a mother, it was the first time she was looking at her daughter so closely."
      },
      {
        "paragraph": "Catherine really looked like her when she was young—charming and bright."
      },
      {
        "paragraph": "Why was she so blind and muddle-headed back then?"
      },
      {
        "paragraph": "Catherine was her biological daughter, yet she hurt and humiliated her time and again. She even\nsuspected that Catherine was having an affair with her husband."
      },
      {
        "paragraph": "It was utterly ridiculous."
      },
      {
        "paragraph": "It was as if Sheryl was the only crazy one while everyone else was wide awake."
      },
      {
        "paragraph": "“Catherine, I’m sorry… ” After Sheryl said that with much struggle, her eyes reddened. “I did you wrong.\nI’m a failure of a mother. I’m an evil grandmother.”"
      },
      {
        "paragraph": "Catherine looked at Sheryl’s reddened eyes. Her throat felt bitter all of a sudden."
      },
      {
        "paragraph": "She thought she could be indifferent. It turned out that she was not that strong."
      }
    ]
  },
  {
    "title": "Chapter 1779 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "It took her some time to calm her emotions. Sheryl then said with a hoarse throat, “You’re right. I can’t\npush away all the responsibilities just because I was drugged. The things I did were indeed very evil."
      },
      {
        "paragraph": "However, when I agreed to let Rebecca kidnap Suzie, I reminded her not to hurt Suzie and just put on an\nact to threaten you. I didn’t think she would"
      },
      {
        "paragraph": "Sheryl had an expression of deep regret. To be honest, she was really too stupid at that time."
      },
      {
        "paragraph": "Luckily, Titus rescued Suzie. If not, she could only atone for her sins with death."
      },
      {
        "paragraph": "Catherine’s eyebrows twitched, but it was only for a moment. She became indifferent again. “ So what?\nCan the trauma in Suzie’s heart be erased? Do you know that the first time I saw you in the restaurant, I\nhad already guessed that you’re my mother?"
      },
      {
        "paragraph": "However, you didn’t recognize me. The despair I felt was as much as the expectations I had for a\nmother.”"
      },
      {
        "paragraph": "“I’m sorry.” Tears streamed down Sheryl’s face."
      },
      {
        "paragraph": "She really did not want to recall what she had done to her own daughter in the restaurant back then."
      },
      {
        "paragraph": "Catherine let out a long breath. “There’s nothing to be sorry about. If  you hadn’t  mistaken  someone\nelse to be your daughter, you probably would’ve treated me very well. It was all a mistake. A lot of hurt\nhas been caused, so all of you should stop saying that she only did those things because of the drug. I\nused to console myself with that reason as well.”"
      },
      {
        "paragraph": "She started sniffling. She thought she would not feel sad anymore, but her throat still felt bitter when she\nsaid it all out loud."
      },

      {
        "paragraph": "“All of you will never understand how I was driven into a corner by Jeffery and his wife back then. I was\nlocked in a dark house and only fed stale rice. I didn’t have a blanket when it was cold at night, and I\ndidn’t even have water. I almost died. I’ll also never forget how much anger and despair I felt when they\nkilled Granny. I finally managed to send them to jail, yet you all… What did you all do?”"
      },
      {
        "paragraph": "Her fury—filled eyes swept across Sheryl, Matthew, and the others."
      },
      {
        "paragraph": "Although she had let go of some things, they would forever be a lump in her heart."
      },
      {
        "paragraph": "Matthew was utterly ashamed. “I… I’m sorry. I thought they were innocent back then…”"
      },
      {
        "paragraph": "“Innocent?”"
      },
      {
        "paragraph": "Catherine laughed. “Are the judges of Australia fools? If there was no concrete evidence, would they\nhave sent Jeffery and Sally to jail? Yes, all of you were manipulated, but did I ever do anything wrong? I\njust wanted to have a peaceful life. Ever since you showed up, I’ve been treading on thin ice."
      },
      {
        "paragraph": "“Rebecca and her family have become a trauma that I can’t shake off my entire life. It’s as if there’s a\nhuge rock pressing down on me. I didn’t even dare to fall into a deep sleep before this. I was living in fear\nevery moment. I was afraid my children would be harmed by you people. I was so scared that I kept\nthinking about bringing my children and my dad to a new country to start over."
      },
      {
        "paragraph": "“ It’s because Wesley and Rebecca are the scariest demons in my life. They killed my granny and my\nfriend, yet my mom spared no effort to help them. How can I forgive all of this?”"
      },
      {
        "paragraph": "Her hoarse roar resounded in the ward. Everyone went silent."
      },
      {
        "paragraph": "Sheryl closed her eyes and simply let her tears flow."
      },
      {
        "paragraph": "She could not imagine how hard Catherine’s life had been."
      },
      {
        "paragraph": "As a mother, she did not protect Catherine and even kept giving her trouble."
      },
      {
        "paragraph": "After a long time, Sheryl said in a hoarse voice, “ You’re right. I don’t have the right to ask you to forgive\nme, but can you let me make it up to you?”"
      },
      {
        "paragraph": "She looked at Catherine cautiously. “I initially wanted to return Hill Corporation to Shaun, but he doesn’t\nwant it. I want to give it to you. Moreover, Shaun is your boyfriend. You both can manage it together.”"
      },
      {
        "paragraph": "Catherine was taken aback."
      },
      {
        "paragraph": "If it were any other company, she could choose not to consider it at all. However, Hill Corporation was\nShaun’s efforts."
      },
      {
        "paragraph": "She looked toward Shaun. “Why don’t you want it?”"
      }
    ]
  },
  {
    "title": "Chapter 1780 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“She spent money to acquire Hill Corporation. Why should I take it? I haven’t even married you yet. ”\nShaun gazed at Catherine’s reddened eyes dearly."
      },
      {
        "paragraph": "Catherine was speechless. What did he mean by that? Did it mean that he would have taken Hill\nCorporation back if they were married?"
      },
      {
        "paragraph": "However, she was furious as well. “Why didn’t you take it? Hill Corporation is the fruit of your painstaking\nefforts. It’s the hard work of the Hill family too.”"
      },
      {
        "paragraph": "She knew how much effort Shaun had contributed to Hill Corporation."
      },
      {
        "paragraph": "All of his ambition, vision, and dreams were in Hill Corporation."
      },
      {
        "paragraph": "“Cathy, my aunt and uncle sold their shares through legal procedures. The same goes for the other\nshareholders of the company. If I take over Hill Corporation, isn’t it equivalent to Sheryl giving me\nhundreds of billions of US dollars for nothing?"
      },
      {
        "paragraph": "After all, she’s not my mom. However, things will be different if I’m her son-in-law.”"
      },
      {
        "paragraph": "Shaun smiled. “I can manage the company for my wife.”"
      },
      {
        "paragraph": "Catherine could not take it anymore. This guy kept laying out traps for her. He was just saying that she\nshould become his wife."
      },
      {
        "paragraph": "The atmosphere was quite serious at first, but it became very weird because of Shaun."
      },
      {
        "paragraph": "Titus cleared his throat. “You take it then, Cathy. We’re based overseas, and we don’t have time to\nmanage Hill Corporation. Moreover, the Hill family still holds 3o percent of shares. It’ll be nice to have\nShaun as the director.”"
      },

      {
        "paragraph": "“No.” Shaun shook his head. “I’ve already been chased out of Hill Corporation twice. I really don’t want to\ngo back there anymore. Furthermore, I don’t plan to be busy with work for now. I want to build a family\nbefore establishing my career.”"
      },
      {
        "paragraph": "The corners of Titus’ mouth twitched. “Are you sure? I think you won’t be able to settle down in five or six\nyears. Don’t wait until you’re in your middle age to start your career. By that time, the companies outside\nmay not even want you.”"
      },
      {
        "paragraph": "Catherine almost burst into laughter. She had to admit that Titus had a sharp mouth."
      },
      {
        "paragraph": "She raised her head and agreed with Titus. “That’s right. You’re not that young anymore, unlike me. I’m\nstill very young.”"
      },
      {
        "paragraph": "“It’s okay. The person I’m pursuing now is rich. Worse comes to worst, I’ll rely on her to provide for me in\nthe future. ” Shaun smiled ambiguously. “ If she really doesn’t want me, never mind. I still have some\nsavings. I can just keep pursuing her until I get old.”"
      },
      {
        "paragraph": "He looked straight at Catherine. Catherine was initially quite sad, but her face started heating up under\neveryone’s gazes."
      },
      {
        "paragraph": "The atmosphere mellowed all of a sudden. Sheryl had complicated feelings."
      },
      {
        "paragraph": "Titus circled Sheryl’s shoulder lightly and said, “ Cathy, your mom really doesn’t have the time to manage\nthe company. The doctor said she has to focus on recovering from her illness during this period. Why\ndon’t we do it this way? Wasn’t Shaun’s mother the vice president of Hill Corporation before? I think we\ncan let Lea continue managing the company. As for the company’s shares, they’ll be transferred to Lucas\nand Suzie’s names. Regardless of whether you agree or not, it’ll be done this way.”"
      },
      {
        "paragraph": "Sheryl’s eyes lit up."
      },
      {
        "paragraph": "Lucas and Suzie were Shaun and Catherine’s children. That was a great idea."
      },
      {
        "paragraph": "Catherine frowned. She really did not want to accept Sheryl’s things."
      },
      {
        "paragraph": "“You can refuse, but you can’t stop a grandmother from giving her grandchildren assets, ” Titus added."
      },
      {
        "paragraph": "Catherine raised her head and gazed at Titus for a while. She could not help but feel that Sheryl had\nfound a good man in her life. He was intelligent, wise, and big-hearted."
      }
    ]
  },
  {
    "title": "Chapter 1781 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine remained silent for a while. Suddenly,"
      },
      {
        "paragraph": "she stared at Sheryl with a sharp gaze. “I just want to ask you a question. A fire broke out when my dad\nwent for an inspection. Did you arrange for that?”"
      },
      {
        "paragraph": "Sheryl’s eyes widened in astonishment. “When did this happen?”"
      },
      {
        "paragraph": "Catherine observed the expression on Sheryl’s face closely. She tried to find traces of her lying."
      },
      {
        "paragraph": "“Cathy, it wasn’t your mom who did that, ” Titus interrupted her, saying, “It was Wesley.”"
      },
      {
        "paragraph": "“How do you know?” Catherine raised her eyebrows."
      },
      {
        "paragraph": "“Because Wesley is with me now. I’m interrogating him to find out about every evil thing he has done.” A\nhint of iciness flashed across Titus’ eyes. “ I’ve never suffered such a huge loss in the hands of another\nperson. A death sentence is too light of a punishment for him.”"
      },
      {
        "paragraph": "Matthew said with contempt, “Dad, you can’t let him commit suicide. Leave him barely alive. I still haven’t\nreturned the humiliation I went through.”"
      },
      {
        "paragraph": "“Don’t worry, I’ve locked him up in a cage. I’ve broken all his limbs as well. It’s impossible for him to\ncommit suicide even if he wants to, ” Titus said casually."
      },
      {
        "paragraph": "Catherine imagined that scene. It gave her the chills, but it was pretty satisfying too."
      },
      {
        "paragraph": "“Do you want to meet him?” Titus suddenly asked her."
      },
      {
        "paragraph": "Catherine opened her mouth. She initially thought that there was no need to meet Wesley anymore.\nHowever, she nodded after glancing at Shaun. “ Okay. Can we go now?”"
      },

      {
        "paragraph": "“Of course.”"
      },
      {
        "paragraph": "Titus patted Sheryl’s back after he spoke. “You can rest here. I’ll give them a ride.”"
      },
      {
        "paragraph": "“I … ” Sheryl wanted to spend more time with her daughter."
      },
      {
        "paragraph": "“Your body isn’t well. Treat your illness first. Some things don’t have to be rushed.” After Titus reassured\nher, he left with Catherine."
      },
      {
        "paragraph": "Of course, Shaun immediately followed after them. “Can you stop following me?” Catherine rolled her"
      },
      {
        "paragraph": "eyes at him with exhaustion. “I have some things to discuss with Wesley.”"
      },
      {
        "paragraph": "“What things? Can’t I listen in?” Shaun said in a depressed tone, “Moreover, if it weren’t for me, would\nWesley have gotten arrested? Don’t I have the right to see Wesley for one last time?”"
      },
      {
        "paragraph": "Catherine could not retort his two consecutive questions. In the end, she could only let him follow her."
      },
      {
        "paragraph": "In the sedan, Titus sat in the passenger seat. Through the rear-view mirror, he could see that there was a\nproblem between Catherine and Shaun."
      },
      {
        "paragraph": "He recalled that Catherine had even begged him for Shaun’s matters before. At that time, it was obvious\nthat Catherine did have feelings for Shaun."
      },
      {
        "paragraph": "They always moved as a pair as well."
      },
      {
        "paragraph": "Surprisingly, Shaun and Catherine did not break up even when Rebecca cornered them. However, after\nthose people got arrested, problems started to arise between them."
      },
      {
        "paragraph": "Nevertheless, Titus could guess that their relationship would not be having any problems if he and Sheryl\nhad not shown up."
      },
      {
        "paragraph": "He did not know how to make it up to them."
      },
      {
        "paragraph": "As Titus was deep in thought, Shaun suddenly spoke and broke the silence in the car. “Uncle Titus, how\ndid you get to know Aunty Sheryl in the past?”"
      },
      {
        "paragraph": "“I went to Soromon Island for business back then. I t happened to be Sherry who welcomed me. At that\ntime… she was only about 2o years old. She was very pretty, but she was cunning and bold too. She\nwas clearly younger than me, but it was my first time being at a disadvantage in the hands of a woman.”"
      },
      {
        "paragraph": "When mentioning the past, Titus’ handsome face became gentle. “At first, it was just interest and\ncuriosity. When I realized I had fallen in love with her, I suddenly became aware that I couldn’t be without\nher. However, before we got married, she admitted that she didn’t remember her past."
      },
      {
        "paragraph": "Furthermore, she might’ve had a child before because there was a surgical scar on her lower abdomen.\nIt was most probably a scar from a C- section. She told me that even if she married me, she would still\ntry her best to look for her child.”"
      }
    ]
  },
  {
    "title": "Chapter 1782 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine kept looking outside the window as if she did not hear it."
      },
      {
        "paragraph": "Shaun looked at her gently. He asked Titus, “Didn’t you mind?”"
      },
      {
        "paragraph": "“I did. There isn’t a man who wouldn’t mind. I tried to calm myself down, but I realized that I was only\ntorturing myself when I couldn’t see her. What was the point? If she has a child, then so be it. I have\ndated a few girlfriends when I was young too. I wasn’t a virgin either. After I came around, everything\nwas pointless as long as the both of us were together.”"
      },
      {
        "paragraph": "The decisive man’s eyebrows became gentle as he talked about the past. “However, there’ll always be\nregrets. It would be better if only I met her earlier. Both of us would’ve been at our best times.”"
      },
      {
        "paragraph": "Shaun was touched."
      },
      {
        "paragraph": "Titus smiled and said, “Speaking of this, Sheryl and I rarely fought. It’s only this time that we almost got a\ndivorce after coming to Australia. Luckily…"
      },
      {
        "paragraph": "Luckily.”"
      },
      {
        "paragraph": "At that moment, even Catherine’s eyes glinted."
      },
      {
        "paragraph": "Such a loving man like Titus was rare. Even if he was a playboy before his wedding, he could reel in his\nheart as soon as he found the right person and treated his wife wholeheartedly. That was the marriage\nthat every woman wished for."
      },
      {
        "paragraph": "Unfortunately, Catherine already ended her second marriage, and she was not as lucky as Sheryl."
      },
      {
        "paragraph": "As she was thinking about it in disappointment, she suddenly felt Shaun holding her hand lightly."
      },

      {
        "paragraph": "She turned her head and glared at him. Then she pinched his palm hard."
      },
      {
        "paragraph": "Not only did Shaun not let go, he even held her hand tighter."
      },
      {
        "paragraph": "They arrived at Titus’s villa."
      },
      {
        "paragraph": "The car drove into the basement garage."
      },
      {
        "paragraph": "There was a row of towering foreigner bodyguards at the door. They immediately bowed upon seeing\nTitus."
      },
      {
        "paragraph": "Titus waved his hand and pressed the switch for the shutters. The door to the garage opened. Catherine\nsaw Wesley, who was inside."
      },
      {
        "paragraph": "The last time she saw him, he was still haughty and arrogant, looking like a dominator."
      },
      {
        "paragraph": "She did not expect Wesley to be locked in a cage like a dog who had lost its home when they were  to\nmeet again."
      },
      {
        "paragraph": "There were chains on his hands, ankles, and even his neck. He was still wearing the expensive suit he\nwore yesterday, only now it had become dirty and shabby. His face was filled with wounds, and one of\nhis eyes was swollen from being hit."
      },
      {
        "paragraph": "Upon hearing footsteps, Wesley, who was sprawled on the ground, kept murmuring and begging. He\nseemed to be delirious. “Don’t hit me… Don’t hit me… I was wrong… Let me die…”"
      },
      {
        "paragraph": "“Master Costner, he’s useless. He became like that after a short torture, ” a bodyguard said disdainfully."
      },
      {
        "paragraph": "Catherine sighed. Wesley had not experienced such suffering in his whole life. He must have been quite\npampered too. He might be good at scheming, but his physical stamina was awful."
      },
      {
        "paragraph": "Titus hinted at the people by his side with his eyes. Immediately, a bodyguard brought a pail of water and\nsplashed it on Wesley’s face."
      },
      {
        "paragraph": "Wesley shivered. He woke up groggily."
      },
      {
        "paragraph": "He struggled to open his swollen eyes. When he saw Catherine, he crawled toward her like a dog,\nwanting to grab her."
      },
      {
        "paragraph": "Shaun quickly pulled Catherine aside to evade him. Wesley begged for mercy while trembling. “Cathy, I\nwas wrong. I won’t ever dare to set you up again. I beg you. Ask them to send me back to jail or let me\ndie. I don’t want to stay in this place anymore.”"
      }
    ]
  },
  {
    "title": "Chapter 1783 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“ If you can’ t take it after one day, then have you ever thought of Matthew’s feelings when you locked\nhim up before?” There was not even a slight pity in Catherine’s eyes. “You brought all of this upon\nyourself.”"
      },
      {
        "paragraph": "“You b*tch.” Seeing that she refused to help, Wesley roared in contempt, “I shouldn’t have blocked the\nknife for you in the past. I should’ve just let you die.”"
      },
      {
        "paragraph": "“Shut up.” Shaun kicked Wesley to the ground."
      },
      {
        "paragraph": "Catherine sighed. The reason she did not want to come was exactly because of this. He would never\nacknowledge his mistake. “Wesley, I came here today to make one thing clear. That day when Shaun fell\nfrom the stairs and lost his memories, was there Sarah’s doing in it? I want to know where Sarah went."
      },
      {
        "paragraph": "“Also, was it Sarah who provided the drug that was given to Sheryl? When did you two start conspiring\nwith each other?”"
      },
      {
        "paragraph": "“ I don’t know what you’re talking about. ” Wesley laughed creepily. “You want to catch Sarah, right?\nOkay, as long as you let me go, I’ll help you testify against Sarah.”"
      },
      {
        "paragraph": "“You want me to let you go? In your dreams, ” Titus said coldly."
      },
      {
        "paragraph": "“You can at least send me back to the police station, right?” Wesley gritted his teeth. “Let me be\nexempted from the death penalty. Don’t you want to put Sarah in jail?”"
      },
      {
        "paragraph": "“Answer Miss Jones’s question  honestly.”  The leader of the bodyguards went forward and grabbed\nWesley’s collar. “If not, I’ll make you suffer.”"
      },

      {
        "paragraph": "“Haha, I’m already in a living hell. My legs and arms are broken.” Wesley laughed like a lunatic. “If you\ndon’t agree to my conditions, I won’t say a thing.”"
      },
      {
        "paragraph": "Catherine frowned coldly. “Never mind if you refuse to talk. Sarah is indeed evil, but I have ways to lure\nher out slowly. But you, I’ll never let you off the hook.”"
      },
      {
        "paragraph": "“Fine. You’ll regret this, Catherine. You’ll regret it.”"
      },
      {
        "paragraph": "Wesley snickered. That woman, Sarah, was very cunning. She was a lot smarter than Rebecca too."
      },
      {
        "paragraph": "Was Catherine not intending to make him suffer?"
      },
      {
        "paragraph": "Never mind. As long as Sarah was still free, it would be like a ticking time bomb."
      },
      {
        "paragraph": "“Ha, what trouble can Sarah still stir now?”"
      },
      {
        "paragraph": "Catherine sneered, unconvinced. She turned around and left."
      },
      {
        "paragraph": "That was the last time she saw Wesley. It seemed like she would not be able to meet him anymore in the\nfuture."
      },
      {
        "paragraph": "After leaving Titus’s villa, Catherine’s pretty face was dark."
      },
      {
        "paragraph": "Initially, she wanted to obtain some information about Sarah. Her hatred toward Sarah was bone- deep.\nShe did not expect Wesley would refuse to come clean about Sarah."
      },
      {
        "paragraph": "Catherine had a slight headache. After experiencing the incident with Rebecca, she felt like Sarah’s\nexistence was a bomb. Maybe there would be a day when she would return."
      },
      {
        "paragraph": "Moreover, maybe Shaun’s illness could be treated by catching Sarah…"
      },
      {
        "paragraph": "She was annoyed. When she turned around, she saw Shaun smiling at the side. It seemed like he was in\na good mood."
      },
      {
        "paragraph": "“What are you smiling for? Are you happy that we can’ t get something on Sarah?” Catherine asked\nfuriously."
      },
      {
        "paragraph": "Shaun was stunned. “What the hell is Sarah? I’ve never seen her before, and I have no impression of\nher.”"
      },
      {
        "paragraph": "“She’s your first love, ” Catherine snapped. “ She’s the one who made you like this.”"
      },
      {
        "paragraph": "“I know.” Shaun nodded. He gazed at her angry yet attractive face. “ I smiled because I feel that you’re\nconcerned about me. Are you thinking of looking for Sarah to recover my memories?”"
      }
    ]
  },
  {
    "title": "Chapter 1784 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine, whose thoughts were exposed, strangely felt angry from embarrassment. “You overthink. I\nwant to catch Sarah because she harmed my friend and her family.”"
      },
      {
        "paragraph": "“I am not overthinking. ” Shaun suddenly grabbed her hand tightly. “Cathy, you want me to recover my\nmemories, but whether I do recover them, I love you either way.”"
      },
      {
        "paragraph": "“Don’t flatter yourself.” Catherine was defeated by his thick face. “Even if I want you to recover your\nmemories, it’s not because I want to get back together with you, okay?”"
      },
      {
        "paragraph": "“ I know, but we’ve already broken up, yet you still care whether I get my memories back or not. This\nmeans you’re still concerned about me.” Shaun smiled while revealing his rows of white teeth. “ The only\nmemory I have left now is when you took advantage of me repeatedly when I was bathing while I still\nknew nothing back then. You have to be responsible for me.”"
      },
      {
        "paragraph": "“Get lost!”"
      },
      {
        "paragraph": "Catherine’s face flushed because of his shamelessness."
      },
      {
        "paragraph": "“I’m not getting lost.”"
      },
      {
        "paragraph": "Not only did Shaun not let go, he even yanked her into his embrace."
      },
      {
        "paragraph": "He lowered his head and pressed his hot lips onto hers."
      },
      {
        "paragraph": "Only heavens knew that he had restrained himself for too long."
      },
      {
        "paragraph": "Not only that day but also recently, whenever he pushed him away, his heart would be in so much angst\nand pain, but he could only stay silent."
      },

      {
        "paragraph": "Initially, he did not want to be so hasty. However, when Catherine interrogated Wesley just now, he knew\nthat she still had him in her heart."
      },
      {
        "paragraph": "“Shaun… Let go.”"
      },
      {
        "paragraph": "Catherine punched his shoulders hard."
      },
      {
        "paragraph": "However, that man’s lips were still overpowering. They were even sweeping the insides of her mouth\nrampantly."
      },
      {
        "paragraph": "Catherine was so embarrassed that her toes were about to curl."
      },
      {
        "paragraph": "That b*stard. They were still in the sedan. The driver that Titus assigned to drive them was still in front.\nAlthough Titus was not there, but…"
      },
      {
        "paragraph": "“I’m not letting go.” Shaun flipped around and pressed her against the backseat. His lips left hers for a\nwhile, and his fingers were weaving through the hair on the back of her head. “Cathy, I don’t want to let\nyou go my whole life. You said I lost my memories and didn’t know what love was. Let me tell you this. I\ncan’t sleep at night because I think of you, and when Hannah bullied you that day nearby Hill\nCorporation, this part of me…”"
      },
      {
        "paragraph": "Shaun grabbed Catherine’s hand to put it on his chest and continued, “…hurts so much that I was about\nto go insane. I had the urge to kill Hannah then and there. I would think of you when I was watching\nmovies and eating with Hannah. You said you wanted to start a new relationship this morning. This part\nof me was so jealous that I was about to go crazy. I’m terrified that you’ll get to know a new guy and not\nwant me anymore. Now, I feel so smitten grabbing your hand like this. I’m very satisfied and happy\nkissing you like this. What is this if it isn’t love?”"
      },
      {
        "paragraph": "His dark eyes stared at her aggressively. Intense feelings were swirling in his eyes."
      },
      {
        "paragraph": "Looking at his flawless, handsome face, Catherine was at a loss for words all of a sudden."
      },
      {
        "paragraph": "Her heart even started throbbing."
      },
      {
        "paragraph": "Shaun was right. What was it if it was not love? However…"
      },
      {
        "paragraph": "“Don’t be afraid. I guarantee that I’ll never forget you again. I swear that I’ll never let you be alone again,\n” Shaun’s raspy voice spoke again."
      },
      {
        "paragraph": "Catherine’s body stiffened."
      },
      {
        "paragraph": "That was right. Why did she push him away? She was just scared that she would always be the one who\nwas abandoned. They had dated each other for so long, yet she was always the one who remembered\neverything."
      }
    ]
  },
  {
    "title": "Chapter 1785 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Moreover, you’re not the abandoned one. The moment  I opened my eyes after losing my memories, I\nspotted  you and only you in the crowd. I couldn’t resist getting close to you, and I just wanted you to\naccompany me. That was because even though I lost my memories, my heart still remembered that I\nlove you.”"
      },
      {
        "paragraph": "Shaun kissed Catherine deeply again after he spoke. Catherine held her breath that time."
      },
      {
        "paragraph": "Her heart was in a mess."
      },
      {
        "paragraph": "She had to admit that she did not have much resistance whenever she faced this man. If not, she would\nnot have gotten back together with him again and again."
      },
      {
        "paragraph": "Just as her mind was wandering, Shaun took the opportunity and kissed her deeply. He kissed her until\nshe was out of breath."
      },
      {
        "paragraph": "Shaun stopped for a moment when he sensed that her breath paused."
      },
      {
        "paragraph": "When she got better, he kissed her deeply for the second time."
      },
      {
        "paragraph": "They could only hear each others’ breaths amid the silent air."
      },
      {
        "paragraph": "Catherine’s small face was flushed red from being kissed. Her body felt limp and weak."
      },
      {
        "paragraph": "In a daze, she suddenly realized that Shaun was still inexperienced in kissing before. How did he\nbecome so skilled in just a short time?"
      },
      {
        "paragraph": "Could it be…"
      },
      {
        "paragraph": "A flame of fury burned in her heart. She pushed him away abruptly."
      },

      {
        "paragraph": "Shaun was immersed in the kiss. When he was pushed aside all of a sudden, his handsome face was\npuzzled and blushing. His whole being exuded temptation."
      },
      {
        "paragraph": "“Cathy, what’s wrong?” When he spoke, his throat was hoarse."
      },
      {
        "paragraph": "“Go away.” Catherine glared at him with hazy eyes."
      },
      {
        "paragraph": "Shaun’s heart went soft from her glare. He quickly went forward to coax her. “Did I kiss you too hard? I’ll\nbe softer next time…”"
      },
      {
        "paragraph": "Catherine covered her ears. He was about to drive her insane."
      },
      {
        "paragraph": "Could he have some shame in him? They were still in another person’s car."
      },
      {
        "paragraph": "“ Shaun, can you shut up? We can talk after we get out of the car.”"
      },
      {
        "paragraph": "Catherine glared at him. Her flushed, small face was filled with fury and embarrassment."
      },
      {
        "paragraph": "“ …Okay. ” Shaun stared at her lips which were red from the kissing. His heart was utterly soft."
      },
      {
        "paragraph": "The driver was speechless. “ ”"
      },
      {
        "paragraph": "‘Uhh, the young couple behind finally stopped.’"
      },
      {
        "paragraph": "It was the most awkward drive in the ten years of his driving career. He desperately hoped he could turn\ndeaf."
      },
      {
        "paragraph": "The driver was already 40 years old, yet he still had to witness such a public display of affection."
      },
      {
        "paragraph": "Ten minutes later, the driver parked the car in front of a mall. He bit the bullet and said, “Miss Jones,\nwe’ve arrived. Do you need me to wait here and send you back later?”"
      },
      {
        "paragraph": "“No need. You can go back first.” Catherine quickly got out of the car."
      },
      {
        "paragraph": "She swore that she did not want to sit in that driver’s car anymore her whole life. She was too\nembarrassed."
      },
      {
        "paragraph": "When the driver left, she quickly rushed into the mall."
      },
      {
        "paragraph": "However, before she could go inside, Shaun pulled her into his embrace again. He held her petite hands\ntightly and interlocked their fingers. “You said we’d talk after we got out of the car.”"
      },
      {
        "paragraph": "Catherine looked around. They were at the plaza near the entrance of the mall. There were many people\nthere. “Talk about what? What’s there to talk about? Can you not hug me in public?”"
      },
      {
        "paragraph": "“Let’s find somewhere without people to talk slowly then.”"
      },
      {
        "paragraph": "Shaun did not wait for Catherine to agree. He pulled her to the other side of the mall right away. After\nthat, he used one hand and pressed her against the wall. “Now there’s no one here. We can chat slowly.”"
      }
    ]
  },
  {
    "title": "Chapter 1786 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine rolled her pretty eyes. After a moment, she raised her head and said while smiling, “After not\nmeeting you for some time, your kissing skills have improved, huh?”"
      },
      {
        "paragraph": "Shaun was stunned. After realizing something, his thin lips curved. “You’re jealous?”"
      },
      {
        "paragraph": "“No, ” Catherine refused to admit. She showed indifference like it was not her business. “But I’m a little\nobsessed with cleanliness.”"
      },
      {
        "paragraph": "Shaun stared at her for a while. After laughing, he pinched her cheeks lightly. “Don’t worry. I’ve never\nkissed Hannah before.”"
      },
      {
        "paragraph": "“Haha, who are you lying to? ” Catherine did not believe him at all."
      },
      {
        "paragraph": "“Cathy,  I’m  a clean freak too. I only hugged Hannah for a short moment. Usually, she’s the one who\ntakes the initiative. She wanted to kiss me before, but I avoided her. Every time her red lips come near,\nI’d feel disgusted. At most, she only kissed my face. There was once when she was more proactive\nduring a meal. She came over to sit on my thigh and touched me. In order to make her believe that I\nhave feelings for her, I imagined the scene of you bathing me, only then I had a reaction.”"
      },
      {
        "paragraph": "Shaun gazed at Catherine honestly. What he said was the truth."
      },
      {
        "paragraph": "Nevertheless, that truth made Catherine feel slightly awkward."
      },
      {
        "paragraph": "Could he stop mentioning the bathing incident? It made her look like a pervert."
      },
      {
        "paragraph": "However, when Catherine heard that Hannah had touched Shaun, she still felt uncomfortable. “Where\ndid she touch you?”"
      },
      {
        "paragraph": "“ I’ll tell you right now. ” Shaun grabbed her hand all of a sudden."
      },

      {
        "paragraph": "Catherine was so startled that her face flushed red. She kept withdrawing her hand. “I don’t want to\ntouch it. Let go.”"
      },
      {
        "paragraph": "“No, you must.” Shaun exerted more force. “Shaun, how can you be so shameless? You…”"
      },
      {
        "paragraph": "Just as Catherine’s voice rang, she saw him placing her hand on his chest."
      },
      {
        "paragraph": "“This is the spot where Hannah touched. ” Shaun"
      },
      {
        "paragraph": "looked at her intriguingly. “If not, where do you think she touched?”"
      },
      {
        "paragraph": "“How would I know?” Catherine felt as if she was about to combust."
      },
      {
        "paragraph": "Gosh, what was she thinking? She thought…"
      },
      {
        "paragraph": "“Cathy, you’re a little dirty.” Shaun smiled playfully."
      },
      {
        "paragraph": "“You’re the dirty one. Your whole family is dirty.” Catherine had the urge to dig a hole and be buried\ninside it. “Who asked you to talk about it so ambiguously? Anyway, I don’t really believe you. If you\nhadn’t kissed her, how did you become so skilled suddenly?”"
      },
      {
        "paragraph": "“Oh, so you were thinking I was very skilled when I was kissing you just now huh.” Shaun was quite\npleased."
      },
      {
        "paragraph": "“Shaun, don’t keep changing the topic.” Catherine’s teeth bit her lower lip. Her angry expression looked\nlike a pufferfish."
      },
      {
        "paragraph": "“Cathy, I’m a mature man now. Some things come to me naturally. Moreover, this is a bodily instinct.\nLook at my fighting skills and some other sports. They’re all as good as before.”"
      },
      {
        "paragraph": "Shaun pointed at his head. “Even if I lost my memories, some things just stay there like they never went\naway.”"
      },
      {
        "paragraph": "Catherine looked at him, unconvinced."
      },
      {
        "paragraph": "Shaun lowered his head and kissed her forehead. “ Don’t worry. I won’t kiss anybody else except you. ”"
      },
      {
        "paragraph": "“That is none of my business. Move.”"
      },
      {
        "paragraph": "Catherine pushed him hard. She thought she looked embarrassing. Why did she lose all defenses so\nquickly because of his sweet words?"
      },
      {
        "paragraph": "It was only the first day."
      },
      {
        "paragraph": "“I’m not moving.” Shaun hugged Catherine tightly. “Let me hug you for a while.”"
      },
      {
        "paragraph": "She pushed him twice for show. As she could not push him away, she could only bury her face in his\nembrace."
      },
      {
        "paragraph": "Forget it. It seemed like she could not have any defenses against this man."
      },
      {
        "paragraph": "When Shaun felt Catherine stopped moving and was resting in his embrace like a kitten, the corners of\nhis mouth lifted happily. “Cathy, I just realized that when I’m with the person I like, I’ll feel happy even if\nwe do nothing and just hug each other like this.”"
      },
      {
        "paragraph": "Catherine’s eyelashes trembled."
      }
    ]
  },
  {
    "title": "Chapter 1787 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Just then, Catherine’s phone rang."
      },
      {
        "paragraph": "She pressed the answer button, and Freya’s loud voice sounded. “Catherine Jones, are you serious? We\nagreed to meet at 3-3o p.m. What time is it now? You have a lot of nerve to make a pregnant woman like\nme wait for you.”"
      },
      {
        "paragraph": "Catherine looked at the time in shock."
      },
      {
        "paragraph": "It was already more than ten minutes past the appointed time."
      },
      {
        "paragraph": "“Um… I’m downstairs now. I’ll be there soon.”"
      },
      {
        "paragraph": "After hanging up the phone, she quickly and decisively pried the leech on her away. “I’m going shopping\nwith Freya, so you should go pick Lucas and Suzie up. Don’t follow me.”"
      },
      {
        "paragraph": "“…Okay.”"
      },
      {
        "paragraph": "Shaun actually did want to follow her. He was a little chagrined as to why there was already a third wheel\nbetween them. “Then, should we have dinner together?”"
      },
      {
        "paragraph": "“You want to have dinner together and have me serve that little queen Suzie? No, thanks. You can take\ncare of them. Let me relax for a few days.” Then, Catherine turned around and left."
      },
      {
        "paragraph": "That natural and unrestrained aura made Shaun gnash his teeth."
      },
      {
        "paragraph": "This woman was not reluctant to leave him at all."
      },
      {
        "paragraph": "Catherine really was not reluctant to leave him at all. All she wanted to do was shop, shop, shop, and\neat, eat, eat."
      },

      {
        "paragraph": "By the time she ran upstairs, Freya had already been waiting there for a while with a cup of milk tea in\nher hands."
      },
      {
        "paragraph": "When she saw Catherine, she rolled her eyes. “What were you doing? You’re late.”"
      },
      {
        "paragraph": "“I went to see Wesley.”"
      },
      {
        "paragraph": "Freya’s interest was immediately piqued. “I heard that Titus took him away. How was it? Was he tortured\nmiserably? Did he cry for forgiveness and kneel to beg for your mercy when he saw you?”"
      },
      {
        "paragraph": "Seeing her hopeful look, Catherine told her Wesley’s tragic situation. “I still want to weed Sarah out. I’m\nafraid she’ll become the second Rebecca.”"
      },
      {
        "paragraph": "“Psychologists are supposed to cure and save people, but she has used her skills to harm people\ninstead.”"
      },
      {
        "paragraph": "Freya also hated Sarah. “But Wesley also had a pipe dream. Both of them are equally bad, and they\ncan’t be spared.”"
      },
      {
        "paragraph": "“Ever since Shaun lost his memory, Sarah seemed to have disappeared off the face of the earth.”\nCatherine sighed. “But it’s useless even if she appears. Rebecca is dead, and Wesley refuses to say\nanything, so there’s no evidence to convict her.”"
      },
      {
        "paragraph": "“Maybe she won’ t come back because she knows that Wesley is in trouble.”"
      },
      {
        "paragraph": "Freya comforted her. “ Not every woman can find such a terrifying backer like Rebecca’s. Besides,\nRebecca also relied on your identity to get with Sheryl. It’s impossible for Sarah to find someone more\npowerful than Sheryl and Titus to get revenge.”"
      },
      {
        "paragraph": "“That’s true too.” Catherine sighed. “ I just think it’s a pity that Charity’s parents can’t be avenged. ”"
      },
      {
        "paragraph": "“Yeah.”"
      },
      {
        "paragraph": "Bringing up Charity would always make their hearts ache."
      },
      {
        "paragraph": "After all, she was dead and could never come back."
      },
      {
        "paragraph": "“Forget it. Let’s not talk about these unhappy things. Aren’t we finally free? Let’s shop till we drop. ” Freya\ntugged on her hand. “Let’s go. Aren’t you finally divorced? You have to dress up a little more. From now\non, all of the world’s most handsome and richest men are at your disposal."
      },
      {
        "paragraph": "Sigh, I really envy you. When I came out, Rodney’s mother called me to say that she had several\nexcellent and handsome young men she wanted to introduce to you. She asked if you’re interested. ”"
      },
      {
        "paragraph": "Catherine was speechless."
      },
      {
        "paragraph": "She did not expect the matchmaking to come so quickly."
      },
      {
        "paragraph": "“With Rodney’s mother’s identity, the people she knows are all celebrities in the business world."
      },
      {
        "paragraph": "Furthermore, she has a good eye for people, unlike my mom who thinks a man is handsome as long as\nhis facial features are normal.”"
      }
    ]
  },
  {
    "title": "Chapter 1788 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Freya grinned. “Besides, she said she’ll introduce to you men of good character and from influential\nfamilies. Their parents and elders are also loving and harmonious couples.”"
      },
      {
        "paragraph": "Catherine said awkwardly, “Actually… Shaun and I… are almost back together again.”"
      },
      {
        "paragraph": "“Huh?” Freya raised her voice."
      },
      {
        "paragraph": "“Calm down. Don’t scare the child in your belly. ” Catherine quickly appeased her."
      },
      {
        "paragraph": "“No, you told me a few days ago that you broke up with Shaun and that him dating Hannah had nothing\nto do with you. How long ago was that? Yet, you’re getting back together with him again?”"
      },
      {
        "paragraph": "Freya looked at her with disappointment. “I know Shaun wasn’t sincere in pursuing Hannah, but don’t\nyou have a backbone? At the very least, you have to drag on for at least a few more months and torture\nhim thoroughly. Not even a day has passed, and you’re already getting back together with him.”\nCatherine bowed her head in shame, feeling quite useless."
      },
      {
        "paragraph": "She was very determined in the morning, but she surrendered by the afternoon."
      },
      {
        "paragraph": "Shaun’s offensive power was too fierce, and he was good at sweet-talking her."
      },
      {
        "paragraph": "“Forget it. You’ve probably fallen into a pit called ‘ Shaun Hill’ and can’t get out.” Freya shook her head in\nexasperation. “ I’ve thought about it all. I thought I’d introduce to you some good men so that Shaun\nwould feel regretful and annoyed for emotionally abusing his wife.”"
      },
      {
        "paragraph": "“Although I’m starting to be okay with him, that doesn’t stop me from staying cold and indifferent. I’ll\ncontinue pretending.” Catherine tried her best to regain her dignity."
      },

      {
        "paragraph": "“That’s true. At the very least, you have to persevere for three days before allowing him to take you to\nbed.” Freya encouraged her."
      },
      {
        "paragraph": "Catherine was at a loss for words."
      },
      {
        "paragraph": "In Freya’s eyes, she could only persevere for three days?"
      },
      {
        "paragraph": "Forget it. She would not bicker with her."
      },
      {
        "paragraph": "After that, the two women went on a crazy shopping spree. By 6:00 p.m, they had successfully"
      },
      {
        "paragraph": "procured more than ten bags each."
      },
      {
        "paragraph": "“Let’s find a place to eat first. I’m starving. ” Now that Freya was pregnant, she could not go hungry at all."
      },
      {
        "paragraph": "“There’s no need to find a place. I’ve already made a reservation for Tangent Private Kitchen.”"
      },
      {
        "paragraph": "“Not bad for foreseeing it. It’s quite difficult to make a reservation in that restaurant, but I’ve heard that\nthe food there is good.” Freya praised as they took the elevator upstairs."
      },
      {
        "paragraph": "When they arrived at the room, they found someone already waiting there. The person had her back to\nthe door and was flipping through the menu. Her long honey-colored hair draped over her shoulders, and\nshe wore a light tan trench coat with blue jeans. It was a very simple outfit. However, when she turned\naround and revealed her clear but dazzling face, Freya instantly felt this scene could belong as a picture\non the front of magazines or as phone wallpaper."
      },
      {
        "paragraph": "Some people were just born to be stars."
      },
      {
        "paragraph": "“Eliza, you’re back. ” Freya was overjoyed. “Have you recovered?”"
      },
      {
        "paragraph": "“Yeah.” Eliza smiled. “I’ve been busy recently shooting commercials. I’m about to join a film crew.”"
      },
      {
        "paragraph": "“I didn’t expect you to come tonight.” Freya glared at Catherine. “You didn’t even tell me. If I knew, I\nwould’ve asked her to come shopping with us.”"
      },
      {
        "paragraph": "“Forget it. If I accompanied you, we’d be stalked by paparazzi.”"
      },
      {
        "paragraph": "Eliza smiled. “Plus, I was working this afternoon.” “That’s true. Celebrities are very busy.”"
      },
      {
        "paragraph": "Freya sighed. “It’s only been a month since we last met, but it feels like a long time has passed.”"
      },
      {
        "paragraph": "“Yeah.” Catherine felt the same way. Too many things have happened recently. “Eliza, thank you. ”\nAlthough she did not leave in the end, she would not forget how Eliza threw her a lifeline when she was\nhelpless."
      }
    ]
  },
  {
    "title": "Chapter 1789 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“What are you guys talking about?” Freya could not understand them at all. “Are you keeping secrets\nbehind my back?”"
      },
      {
        "paragraph": "“Eliza did me a favor a while ago. ” Catherine did not say anything specific. She thought that it was better\nnot to reveal the person that Eliza knew. “ Let’s order.”"
      },
      {
        "paragraph": "The food here was good and special in its own way."
      },
      {
        "paragraph": "Surprisingly, the three women had endless topics to talk about, from clothes to gossip to hobbies."
      },
      {
        "paragraph": "“By the way, there hasn’t been any news about Cindy recently. Has she been blacklisted? She was\noriginally engaged to Chester, but there hasn’t been news about that either,” Freya suddenly asked."
      },
      {
        "paragraph": "The room fell silent, and Eliza brushed her long hair. “I’m not too sure. I haven’t been to the company\nlately.”"
      },
      {
        "paragraph": "“She probably pissed Chester off after she contacted Rebecca a while ago,” Catherine said. “ I heard\nShaun mentioned that before Rebecca died,"
      },
      {
        "paragraph": "Cindy seemed to have taken the initiative to introduce Titus and Sheryl to Chester’s parents, with\nRebecca acting as the middleman.”"
      },
      {
        "paragraph": "Freya understood. “I got it. She wanted to appear capable before Chester’s parents by acting like she\nknew the Costner family. However, the Costner family was targeting Shaun, who’s Chester’s good friend,\nso she touched Chester’s nerve. She should’ve known better.”"
      },
      {
        "paragraph": "“Yeah.” Catherine smiled. “Eliza, is Chester still pestering you?”"
      },

      {
        "paragraph": "“ I left Canberra a while ago and haven’t seen him since.” A conflicted look flashed in Eliza’s eye at the\nmention of that man."
      },
      {
        "paragraph": "“He has probably lost interest in you.” Freya grinned. “As long as he’s not pestering you anymore, it’s\ngood. If you want to date, I can introduce you to some quality men any time. I can find someone who’s\nboth powerful and handsome for you.”"
      },
      {
        "paragraph": "“You seem very keen to be a matchmaker recently.” Catherine was amused."
      },
      {
        "paragraph": "“Hehe. It’s because I can’t have them for myself, and when I see such excellent men, I can’t bear to let\nthem go to other people either.”"
      },
      {
        "paragraph": "Just as she finished speaking, her phone rang. It was from Rodney."
      },
      {
        "paragraph": "She picked it up lazily. “What?”"
      },
      {
        "paragraph": "“Where are you? I’ll pick you up,” Rodney said."
      },
      {
        "paragraph": "“Dude, do you know what time it is now? It’s only 8 p.m.” Freya complained angrily. “I’m still chatting with\nmy friends.”"
      },
      {
        "paragraph": "“My daughter has to go to bed by 9:30 p.m.”"
      },
      {
        "paragraph": "Freya was speechless. They had not identified the child’s gender, yet he insisted that the child in her\nbelly was a girl. “Heh, your daughter lies in my stomach all day. My belly is her bed. She can sleep\nwhenever she wants.”"
      },
      {
        "paragraph": "“She’ll be more comfortable lying in a bed.” Rodney did not give her the chance to refuse. “"
      },
      {
        "paragraph": "You’re with Catherine, right? If you don’t come back, I’ll call her and tell her to persuade you. In the\nmeantime, I’ll also ask her if it’s true that pregnant women should go to bed early and refrain from staying"
      },
      {
        "paragraph": "up late.”"
      },
      {
        "paragraph": "“You’re nuts.” Freya was furious. After thinking about it, she glanced at the bags on the ground and finally\ntold him the address."
      },
      {
        "paragraph": "“Is Rodney urging you to go home?” Catherine teased."
      },
      {
        "paragraph": "“He’s so annoying, ” Freya grumbled."
      },
      {
        "paragraph": "“Pregnant women should sleep early. ” Catherine looked at the time and agreed. “Eliza will send me\nhome later. You should go back with Rodney.”"
      },
      {
        "paragraph": "“Will you two eat supper together behind my back?” Freya asked painfully."
      },
      {
        "paragraph": "Catherine held back her laughter and exchanged a glance with Eliza before shaking her head. “We\nwon’t.”"
      },
      {
        "paragraph": "“Young Master Snow will be here soon, so we’ll head off now.” Eliza suddenly looked at the time and\nsaid, “If Rodney sees me here, he might tell Chester, and I don’t want to have anything to do with him.”"
      }
    ]
  },
  {
    "title": "Chapter 1790 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Sure.”  Catherine agreed."
      },
      {
        "paragraph": "After sitting for 20 minutes or so, Catherine and Eliza left first."
      },
      {
        "paragraph": "It had yet been ten minutes since they left when Rodney came in wearing a white suit. His skin was very\nfair, and his beautiful eyes and red lips gave him a bewitching presence. Along with his slender legs, he\nlooked just like a noble prince."
      },
      {
        "paragraph": "Although Freya saw this face every day, she still could not help but sigh."
      },
      {
        "paragraph": "He was a man, yet he looked even better than her. Ugh."
      },
      {
        "paragraph": "“Why are you alone? Where’s Catherine?” Rodney looked at the room. It was quite big, and there were\nthree bowls on the table. “You ate with two other people tonight? Who’s the third person? Freya Lynch,\nyou aren’t eating out with another man behind my back, are you?”"
      },
      {
        "paragraph": "Freya rolled her eyes at him. “ I’d love to, but I’m married to you. What man would be willing to have\ndinner with me?”"
      },
      {
        "paragraph": "“What’s that supposed to mean?” Annoyed, Rodney frowned. “Are you that eager to find a second love?”"
      },
      {
        "paragraph": "“All I can say is… the spirit is willing, but the flesh is weak.” Freya touched her bulging belly and\ndeliberately said it mysteriously."
      },
      {
        "paragraph": "Rodney glared at her angrily, wanting nothing more than to eat her up."
      },
      {
        "paragraph": "Freya pretended not to see. Anyway, it was his fault for saying that first thing after coming through the\ndoor. What did he mean by her eating out with another man behind his back? He made it seem as if she\nwas very indecent."
      },

      {
        "paragraph": "Did he forget why they got married in the first place?"
      },
      {
        "paragraph": "Rodney glared at her until his eyes hurt. When she did not respond, he glanced to the side and noticed\nthat the ground was full of bags of new clothes, to which he scoffed. “What? Did you buy so many\nclothes because you want to dress up and look for a man after you’ve given birth to the child?”"
      },
      {
        "paragraph": "Freya let out a snort and said sarcastically, “How do you know me so well?”"
      },
      {
        "paragraph": "Rodney felt like his chest was about to explode with anger. At the thought  of her dressing up and\nwearing sultry clothes to seduce other men, he became furious. “In your dreams, Freya Lynch.”"
      },
      {
        "paragraph": "Then, he picked up the paper bags on the ground."
      },
      {
        "paragraph": "“Rodney, what are you doing?” Freya had a bad feeling."
      },
      {
        "paragraph": "Ignoring her, Rodney picked up the paper bags and walked out with them. A beautiful young waitress just\nso happened to walk over, and he handed all the bags to her. “These are for you.”"
      },
      {
        "paragraph": "The waitress was dumbfounded. She had worked here for so long, so she naturally recognized the\nbrands on the bags, which were the most expensive luxury brands in the mall. She had secretly gone to\nbrowse through them before, but even a short- sleeved blouse cost seven to eight thousand dollars.\nWhat was more, the clothes inside the bag were all from the new autumn series."
      },
      {
        "paragraph": "Besides, this man was very handsome and looked like a celebrity. Could it be…"
      },
      {
        "paragraph": "The waitress’s heart suddenly pounded."
      },
      {
        "paragraph": "“You b*stard. How can you give my clothes away?” Freya was furious and walked over to grab the bags.\n“I spent my own money on these. If you want to please another woman, you can go and buy them\nyourself.”"
      },
      {
        "paragraph": "“Freya, I’m telling you. You’ll have a potbelly even after you’ve given birth, so you won’t be able to fit in\nthese clothes. I’m giving them away for your own good.”"
      },
      {
        "paragraph": "Rodney’s words pierced Freya’s heart like sharp arrows."
      }
    ]
  },
  {
    "title": "Chapter 1791 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Rodney Snow, are you human? You have no conscience at all. You were the one who made me like\nthis.” Freya was pregnant, which happened to be the time she was most easily stimulated. At that\nmoment, her eyes were red with anger, and she lost her rationality."
      },
      {
        "paragraph": "She rushed over and grabbed the paper bags. “You have no right to dispose of things I’ve bought. Get\nout of my sight.”"
      },
      {
        "paragraph": "Then, she suddenly felt a sharp pain in her abdomen, and her face went white. She hurriedly held onto\nthe wall beside her in pain and almost fell down."
      },
      {
        "paragraph": "Rodney, who was shrouded in anger, was also frightened. “W-what’s wrong?”"
      },
      {
        "paragraph": "“Get lost.” Freya forced back the pain and glared at him. Just then, she felt something leaking."
      },
      {
        "paragraph": "Even if she had never given birth before, she had done her research on it. In an instant, she panicked.\n“Oh no. I think my water just broke.”"
      },
      {
        "paragraph": "“That… That can’t be.” Rodney was dumbfounded. The due date was still a month away."
      },
      {
        "paragraph": "“I’m going into labor prematurely because you made me angry.” Freya was in so much pain that she\nwanted to cry. Why was she so unlucky? She really had a bad life. She should not have married a\nb*stard like Rodney."
      },
      {
        "paragraph": "Rodney’s face went white in shock. This time, he did not dare to argue with Freya anymore as he\nhurriedly picked her up and dashed downstairs."
      },
      {
        "paragraph": "Freya’s belly was big and now weighed more than 170 pounds."
      },

      {
        "paragraph": "He ran downstairs in one breath and put her in the back seat, only to find that her skirt was already wet\nwith amniotic fluid."
      },
      {
        "paragraph": "His legs went soft. He was not as nervous even when Gavin rebelled and Wesley pointed a gun at his\nface that night."
      },
      {
        "paragraph": "No. He had to calm down."
      },
      {
        "paragraph": "First, they had to go to the hospital."
      },
      {
        "paragraph": "Hence, Rodney hurriedly got into the driver’s seat, started the car, and rushed to the hospital."
      },
      {
        "paragraph": "Along the way, he called his mother, Wendy.“"
      },
      {
        "paragraph": "Mom, Freya is going into labor. I’m sending her to the hospital now.”"
      },
      {
        "paragraph": "“What? Isn’t she due next month?” Wendy was also shocked. “ I’ll come with your dad right away. You\ntake her to the hospital first. I’ll notify her parents.”"
      },
      {
        "paragraph": "In the backseat, Freya was in so much pain that she teared up. The more it hurt, the more she hated\nRodney. “Rodney Snow… If I die of pain… I’ll come back as a ghost… to haunt you… Argh… It hurts.”"
      },
      {
        "paragraph": "Her nails dug into the leather seat in pain, and her back was wet with sweat. She no longer had the\nstrength to curse him."
      },
      {
        "paragraph": "When they finally reached the hospital, Chester had already gotten the news in advance and had the\nobstetrics and gynecology unit send Freya into the waiting room."
      },
      {
        "paragraph": "On the other side."
      },
      {
        "paragraph": "Catherine and Eliza found a snack bar and were just about to eat some supper."
      },
      {
        "paragraph": "Rodney suddenly called and said nervously with his voice quivering, “Catherine, you… Hurry up and\ncome to the hospital. Freya is in labor.”"
      },
      {
        "paragraph": "Catherine was shocked. “Why is she in labor? There was no sign when we were eating just now.”"
      },
      {
        "paragraph": "“Stop asking questions and come here already. Hurry up. She has asked you to come.” Rodney hung up\nthe phone as soon as he said that."
      },
      {
        "paragraph": "Eliza was also stunned for a moment, but she immediately stood up. “I’ll go with you.”"
      },
      {
        "paragraph": "Catherine nodded. She could not care about anything else at that moment."
      }
    ]
  },
  {
    "title": "Chapter 1792 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Freya’s due date was still a month away, but she was now in labor. Catherine was a little doubtful\nwhether the reason was that she went shopping with Freya earlier."
      },
      {
        "paragraph": "If she had known, she would not have asked Freya out today."
      },
      {
        "paragraph": "Once they rushed to the hospital, they happened to bump into Jason and his wife, as well as Nathan,\nHeidi, and Ryan."
      },
      {
        "paragraph": "Freya had been pushed into the delivery room. Through the door, they heard the pained cries from\ninside."
      },
      {
        "paragraph": "Catherine and Eliza’s hearts ached at the sound. Freya was fine before they left. Who would have\nthought she would be in such pain in the blink of an eye?"
      },
      {
        "paragraph": "Wendy grabbed her son angrily. “Isn’t she supposed to be due next month? Why did it happen early?”"
      },
      {
        "paragraph": "“I… I don’t know.” Rodney mumbled, not daring to meet his mother’s eyes."
      },
      {
        "paragraph": "If she found out that Freya went into premature labor because they quarreled, he might be beaten to\ndeath."
      },
      {
        "paragraph": "Catherine blamed herself. “Aunty, it might be my fault. Maybe it’s because I went shopping with Freya in\nthe afternoon and tired her out.”"
      },
      {
        "paragraph": "“Pregnant women should walk more before giving birth, and shopping is the same as walking. It’s not\nyour fault. ” Wendy could not blame her. “What’s important is that the mother and child are safe.”"
      },
      {
        "paragraph": "Rodney stood by the side without saying a word."
      },

      {
        "paragraph": "Ryan looked at him and suddenly said, “Rodney, Freya was with you when her water broke. Did you\nquarrel with her again and piss her off so much that she went into premature labor?”"
      },
      {
        "paragraph": "Everyone instantly turned their eyes to Rodney."
      },
      {
        "paragraph": "After all, everyone knew that Freya and Rodney were always fighting and arguing."
      },
      {
        "paragraph": "No one knew what was wrong with them. As soon as they met each other, sparks would fly and scatter\neverywhere."
      },
      {
        "paragraph": "Rodney’s expression was stiff. After a moment, he muttered, “I argued with her a little, and… her\nstomach suddenly hurt.”"
      },
      {
        "paragraph": "Wendy’s face instantly became as cold as ice. “You argued with her a little? What did you say to her?\nWhat did you do to cause a pregnant woman to go into premature labor?”"
      },
      {
        "paragraph": "“I… I asked if she was having dinner with another man tonight, and she… She said she was looking for a\nsecond love, so I was angry and said that… she’ll have a potbelly… So, I gave away the clothes she\nbought… and we quarreled for a while. Then, her stomach started to hurt…”"
      },
      {
        "paragraph": "Rodney hung his head low and mumbled about what happened."
      },
      {
        "paragraph": "Catherine was aggravated. “She was having dinner with me tonight.”"
      },
      {
        "paragraph": "“I know you were there, but  there were three sets of cutlery. There was someone else…” Rodney\nmuttered."
      },
      {
        "paragraph": "“That was me.” Eliza’s expression was ice cold. She did not expect Rodney to suspect Freya just\nbecause they left early. “Besides, she’s your wife. Shouldn’t you know what kind of person she is? If you\nask your wife, who’s nine months pregnant, those kinds of questions, you’re questioning her character.\nAny woman would be angry.”"
      },
      {
        "paragraph": "“That’s right. Freya has worked so hard to carry your child, yet you still suspect her. If I were her, I’d die\nof anger.”"
      },
      {
        "paragraph": "Wendy was so angry that she slapped Rodney across the face. “What did I tell you? You’re married and\nshe’s pregnant, so I’ve told you to compromise with her. Yet, what did you do instead? You had the nerve\nto tell her that she’d have a potbelly? How did she end up like this in the first place? It’s because  of you.\nShe wanted to buy beautiful clothes, yet you gave them all away to another person. Are you even a\nman? Why did I even give birth to you?”"
      },
      {
        "paragraph": "“Mom, I’m sorry… I didn’t want to…”"
      },
      {
        "paragraph": "Rodney’s handsome face went pale from the scolding."
      },
      {
        "paragraph": "He did not want that to happen either. Looking back at it now, he could not believe that he did such a\nthing."
      },
      {
        "paragraph": "“You didn’t want to, but you’ve done and said it. ” Heidy furrowed her brows as well. “Rodney, I thought\nthat you’d have become more mature after what happened to your uncle, but…”"
      }
    ]
  },
  {
    "title": "Chapter 1793 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Rodney was too ashamed  to lift his head."
      },
      {
        "paragraph": "He also did not understand why he would always say so many unpleasant words and go too far with his\nactions every time he was with Freya."
      },
      {
        "paragraph": "He did not want it to be like this. Wendy let out a long sigh."
      },
      {
        "paragraph": "Although she gave birth to him, he had been beaten, scolded, and even kicked out of the family before.\nWhy was he still like this?"
      },
      {
        "paragraph": "She really did not know what to do. “What’s the use of apologizing to us? You should apologize to Freya\ninstead. You should apologize to her parents and your child. You’d better pray that the child is born\nsafely, and you should beg for Freya to forgive you. Think about it. You two got together because of the\nchild, but you were only forced to get married to keep the Snow family’s reputation. Now that the child is\nborn, it doesn’t seem like Freya will want to be with you anymore.”"
      },
      {
        "paragraph": "Those words made Rodney inexplicably upset. “"
      },
      {
        "paragraph": "Mom, now that the child is born, how can we get a divorce? It won’t be good for the child.”"
      },
      {
        "paragraph": "“Hah, you might think so, but others might not feel the same.” Wendy sneered mockingly."
      },
      {
        "paragraph": "The ‘others’ she was referring to was naturally Freya."
      },
      {
        "paragraph": "Rodney muttered, “I’ll persuade her.”"
      },
      {
        "paragraph": "To the side, Eliza and Catherine exchanged looks."
      },

      {
        "paragraph": "They were both very angry at Rodney, but the Snow family was there. Moreover, they had already\nbeaten and scolded him, so it was not appropriate for them to interrupt."
      },
      {
        "paragraph": "All they could do now was wait for Freya to give birth to the child."
      },
      {
        "paragraph": "After a long time, the situation in the delivery room finally quieted down."
      },
      {
        "paragraph": "Before long, the nurse came out with a baby in her arms. Knowing that the identity of the people outside\nwas extraordinary, the doctor smiled and said, “Congratulations, Madam. Mrs. Snow gave birth to a little\ngirl. She’s six pounds and very healthy.”"
      },
      {
        "paragraph": "“Thank you so much.” Wendy passed the doctor an envelope and quickly took the swaddled baby."
      },
      {
        "paragraph": "Rodney also looked over excitedly. His little daughter had just come out of Freya’s belly, so she looked\nwrinkled like a little monkey. “This… This is my child? I’m so handsome, but why is she so…”"
      },
      {
        "paragraph": "“Shut up.”"
      },
      {
        "paragraph": "The Snow family warned him in unison."
      },
      {
        "paragraph": "Everyone knew that no good words ever came out of his mouth."
      },
      {
        "paragraph": "Rodney felt aggrieved, and Wendy glared at him. “ Newborn babies are all like this. They’ll grow."
      },
      {
        "paragraph": "Besides, look at those eyes and that little mouth and nose. She’s so pretty. The Snow family has no bad-\nlooking genes.”"
      },
      {
        "paragraph": "“That’s right.” Jason also nodded and asked,  “ How’s the mother? Why hasn’t she come out yet?”"
      },
      {
        "paragraph": "“She has a tear down there, so the doctor is stitching her up.” The nurse smiled and said, “ Please leave\nthe baby to me. I have to give her a bath.”"
      },
      {
        "paragraph": "“I’ll go with you. Rodney, stay here.” Wendy followed the nurse and left."
      },
      {
        "paragraph": "Not long after they left, Chester came over. Dressed in a white coat, he looked graceful and handsome."
      },
      {
        "paragraph": "His dark eyes glanced at all the people present, and his gaze paused for a few seconds on the woman\nbeside Catherine."
      },
      {
        "paragraph": "Eliza frowned and subconsciously hid behind Catherine."
      },
      {
        "paragraph": "Catherine looked up and nodded at Chester with a smile."
      },
      {
        "paragraph": "Chester raised his brows and walked over to Rodney, whom he patted on the shoulder. “\nCongratulations.”"
      },
      {
        "paragraph": "Rodney was still quite overwhelmed. When he heard Chester’s voice, he smiled. “Chester, you’re late.\nYou didn’t see my daughter. She was just born, and the nurse took her to take a bath. I still can’t believe\nthat I’m a father now.”"
      }
    ]
  },
  {
    "title": "Chapter 1794 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Be a good father from now on, ” Chester said in a low voice. “It’s not easy for a woman to give birth.\nTreat her well.”"
      },
      {
        "paragraph": "“I will.” Rodney nodded. “I suddenly feel like a different person. I have responsibilities now.”"
      },
      {
        "paragraph": "After more than ten minutes, Freya was pushed out of the delivery room. Her little face was pale, and her\nforehead was still wet. She looked drowsy and weak."
      },
      {
        "paragraph": "Rodney leaned over, and his heart clenched when he saw her. His thin lips moved, and he said, “Freya,\nare… are you okay?”"
      },
      {
        "paragraph": "Freya’s eyelashes fluttered, but she ignored him."
      },
      {
        "paragraph": "Rodney was upset."
      },
      {
        "paragraph": "The nurse pushed the hospital bed to the VIP ward and said, “Young Master Snow, please carry your\nwife to the bed.”"
      },
      {
        "paragraph": "Rodney bent over and was prepared to carry Freya when she opened her eyes and stared at him in\nhatred. “Don’t touch me.”"
      },
      {
        "paragraph": "Rodney’s body stiffened. With so many people watching, he whispered in embarrassment, “How will you\nget on the bed if I don’t carry you? Freya, don’t be so strong-headed. You’re at your weakest now.”"
      },
      {
        "paragraph": "“Even if I have to crawl over by myself, I won’t let you carry me there.”"
      },
      {
        "paragraph": "Freya forced herself to sit up. She had just gotten stitches down there, so her body trembled with pain as\nshe moved."
      },

      {
        "paragraph": "Since Catherine had been through this before, she quickly held Freya up. “Eliza, let’s carry her together.”"
      },
      {
        "paragraph": "With that, the two women carried Freya to the large bed."
      },
      {
        "paragraph": "Just then, Wendy came in holding the cleaned baby."
      },
      {
        "paragraph": "Freya opened her eyes, and when she looked at the child in front of her, mixed feelings welled up in her\nheart."
      },
      {
        "paragraph": "She definitely liked children."
      },
      {
        "paragraph": "However, she would never forget that this baby was the reason she married a b*stard like Rodney."
      },
      {
        "paragraph": "At that thought about her premature birth, her eyes could not help but redden."
      },
      {
        "paragraph": "She wanted to divorce him, but she did not want to give up this child, whom she had suffered so much to\ngive birth to."
      },
      {
        "paragraph": "However, she felt very tired to continue living a life with Rodney."
      },
      {
        "paragraph": "“Rodney…” Jason gave Rodney a look."
      },
      {
        "paragraph": "Rodney obediently went to the bedside and apologized. “Freya, I’m sorry. It was my fault. I’m a prick. I\nshouldn’t have said those words to aggravate you…”"
      },
      {
        "paragraph": "“You didn’t say anything wrong. I do have a potbelly.” Freya interrupted him coldly."
      },
      {
        "paragraph": "Wendy said, “Freya, I’ve already given him a beating just now. He’s just a b*stard who doesn’t know how\nto watch his words. Now that you’ve given birth, it won’t be the same anymore. There will always be\nfights between a married couple, but you’ll be fine after a while.”"
      },
      {
        "paragraph": "“Rodney, you can’t behave like this anymore. It wasn’t easy for Freya to give birth to your child. From\nnow on, you have to work hard for the children and give them a happy family. You don’t wish for your\nchild to live in an unfortunate single- parent family, right?”"
      },
      {
        "paragraph": "“I will, Mom.” Rodney hurriedly nodded."
      },
      {
        "paragraph": "Catherine secretly sighed. Madam Snow was really good with her words. Not only did she teach Rodney\na lesson, but she also reminded Freya of the disadvantages of a child living in a single -parent family."
      },
      {
        "paragraph": "Freya also felt uncomfortable. However, after a while, she finally said, “We only got married for the sake\nof the child and Godfather’s reputation. Now that the child has been born and Godfather’s  position as\nprime minister is stable, I don’t think we need to go on like this anymore.”"
      },
      {
        "paragraph": "Rodney’s expression changed. “ I told you I didn’t mean it before. If you didn’t say that you were looking\nfor a second love, I wouldn’t have gotten so angry.”"
      }
    ]
  },
  {
    "title": "Chapter 1795 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Did I say I was looking for a second love?” Freya sneered. “It was you who suspected me of going out\nfor dinner with another man behind your back as soon as you entered the door. Rodney, all I did was buy\nsome clothes I liked. I didn’t even spend your money. What gives you the right to give my clothes away to\nanother woman? I’ve had enough with you. I hate you so much.”"
      },
      {
        "paragraph": "Every word she said was like a hammer slamming on his heart."
      },
      {
        "paragraph": "If it were in the past, Rodney would have lost his temper immediately."
      },
      {
        "paragraph": "However, seeing her weak appearance after giving birth, his thin lips pursed in distress."
      },
      {
        "paragraph": "Jason looked at the two and felt his head hurt. “ Freya, you just gave birth. Let’s not talk about this for\nnow. I think the child should be hungry…”"
      },
      {
        "paragraph": "“Yes,  she must be hungry. You’ll have to nurse her.” Wendy hurriedly called in the lactation specialist\nand told everyone to go out, leaving only Catherine and Eliza inside."
      },
      {
        "paragraph": "“Do you really want to get a divorce? ” Catherine looked at Freya in worry. “Don’t be impulsive."
      },
      {
        "paragraph": "Besides… if you get divorced, the Snow family will definitely want custody of the child.”"
      },
      {
        "paragraph": "Freya turned to look at the baby’s soft and lovely face and felt her heart clench painfully."
      },
      {
        "paragraph": "She did not feel it before her daughter was born, but now that she was born, she realized that this was a\nlife that she did not want to give up so easily."
      },
      {
        "paragraph": "Upon thinking that she could not see her daughter in the future, she felt heartbroken."
      },

      {
        "paragraph": "“But I can’t stand that man anymore.” Having just given birth, Freya felt so aggrieved that her tears rolled\ndown her cheeks. “He’s such an *sshole. If he didn’t piss me off today, I wouldn’t have gone into\npremature labor. I don’t care. When my parents come, I want to divorce him.”"
      },
      {
        "paragraph": "Outside the ward. Rodney looked dejected."
      },
      {
        "paragraph": "He did not expect Freya to divorce him as soon as she gave birth."
      },
      {
        "paragraph": "“What were you thinking?” Jason looked at him coldly."
      },
      {
        "paragraph": "Wendy said anxiously, “Of course, they can’t get a divorce. The child will suffer.”"
      },
      {
        "paragraph": "“What if she’s determined to get one?” Jason snapped. “What Freya said was not wrong. We all know\nwhy they got married back then. They have no feelings for each other.”"
      },
      {
        "paragraph": "Everyone fell silent."
      },
      {
        "paragraph": "Rodney suddenly panicked. “What… do you guys mean? You won’t support her in getting a divorce,\nright?”"
      },
      {
        "paragraph": "This time, even Heidi could not hold back anymore. “If you don’t want a divorce, then make her change\nher mind. We have no reason to stop you two from divorcing each other and insist on you staying\ntogether.”"
      },
      {
        "paragraph": "“When Freya’s parents arrive later, I don’t have the face to tell them that it was you who caused her\npremature birth. ” Wendy accused in annoyance. “ She just bought a few clothes, and you made such\nthoughtless remarks. If I were her, I’d be fed up with you too. It’s one thing to refuse to spend money on\nher, but another to push her to the edge all day. If I hadn’t given birth to you, I’d be too ashamed to admit\nthat you’re my son. You’re a disgrace.”"
      },
      {
        "paragraph": "Rodney was speechless. Was he that bad?"
      },
      {
        "paragraph": "He thought that Freya dressed up because she wanted to look for a second love."
      },
      {
        "paragraph": "Also, it was not that he refused to spend money on her. It was her who did not want to spend his money.\nWhy was he called the stingy one instead?"
      },
      {
        "paragraph": "Rodney was aggrieved, very aggrieved."
      },
      {
        "paragraph": "About half an hour later, the door of the ward opened again."
      }
    ]
  },
  {
    "title": "Chapter 1796 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine and Eliza came out together."
      },
      {
        "paragraph": "Rodney bit the bullet and looked at them. “How is she?”"
      },
      {
        "paragraph": "“ She’s nursing the baby, ” Catherine said and then turned to Eliza. “You should head back first. I’ll stay\nhere with Freya tonight.”"
      },
      {
        "paragraph": "Eliza nodded at her and the Snow family before leaving."
      },
      {
        "paragraph": "Chester, who had been leaning against the wall, followed her with his long legs. His eyes flashed with a\ncold glint."
      },
      {
        "paragraph": "Rodney smiled carefully at Catherine. “You don’t have to stay. You can head back too. I’m her husband,\nso I’ll stay back to accompany her.”"
      },
      {
        "paragraph": "Catherine folded her arms across her chest and looked at him. “Young Master Snow, I also want to give\nyou that opportunity, but Freya has just given birth. She gets angry at the sight of you, and you don’t\nknow how to keep your mouth shut either, so I’m worried that you’ll piss her off again. It’d be fine if it\nwere any other time. However, I’m afraid that she’ll faint from anger today.”"
      },
      {
        "paragraph": "“I’m not that ignorant, ” Rodney muttered in embarrassment. “I know it was hard for her to give birth to\nthe baby.”"
      },
      {
        "paragraph": "“Is that what you think?” Catherine frowned. “ Actually, you can still raise the child together after the\ndivorce.”"
      },
      {
        "paragraph": "A complex look flashed in Rodney’s eyes as he opened his mouth to speak. “Ever since I married her, I\nnever once thought about divorcing her."
      },

      {
        "paragraph": "Besides, now that the child is born, we definitely have to take care of the child together.”"
      },
      {
        "paragraph": "“Then, you have to apologize,” Catherine said. Rodney was stunned. “I did, but she didn’t listen to me at\nall.”"
      },
      {
        "paragraph": "Catherine rolled her eyes at him. “I finally understand why you were reduced to Sarah’s fallback guy.”"
      },
      {
        "paragraph": "Rodney’s expression instantly darkened. “Enough. You don’t have to resort to personal attacks. I was her\nfallback guy not because I wasn’t good enough but because Shaun was too good. I can’t compare to\nhim.”"
      },
      {
        "paragraph": "“Forget it. He’s the same,” Catherine said. “Your emotional intelligence is too low. Is there a rule that\nstates that if a woman is angry or sad, she has to forgive the man just because he apologized? If\napologies were useful, then what’s the use of the police?”"
      },
      {
        "paragraph": "Rodney was speechless."
      },
      {
        "paragraph": "“ If you really want her to forgive you and salvage this marriage, go and buy a washboard,” Catherine\nsaid coldly. “Kneel down and apologize to her. Oh, right. You’ve also thrown away all her clothes, so you\nshould buy ten times the amount of beautiful clothes for her. Give her your bank card, so she can buy\nwhatever she wants in the future. Serve her tea, wash her clothes, cook for her. When she nurses the\nchild, you have to accompany her too. If the child cries at night, you’ll coax the child while she sleeps.”"
      },
      {
        "paragraph": "Rodney’s beautiful eyes widened in shock. “Are you kidding me? In all my life, I’ve only knelt to my\ngrandfather before. Now, you want me to kneel to a woman…”"
      },
      {
        "paragraph": "“That woman just went into premature labor because of you, but you don’t want to give anything other\nthan an apology?” Catherine sneered. “If that’s your way of apologizing, then I advise you to divorce her.\nI don’t see any sincerity from you.” Rodney suddenly stopped talking."
      },
      {
        "paragraph": "“But that’s just my advice to you. Whether or not you’re willing to is your decision. No one is forcing you.”\nWith that, Catherine turned and went back into the ward."
      },
      {
        "paragraph": "“Wait.” Rodney felt like his head was about to explode. “If I do all that, will she forgive me?”"
      },
      {
        "paragraph": "“All I know is that if you don’t do anything, you’ll have no chance at all.” Catherine looked at him solemnly\nand went inside."
      },
      {
        "paragraph": "Rodney stood outside the door with a sullen face, feeling helpless."
      },
      {
        "paragraph": "He wanted to consult Chester, but where did that *sshole go?"
      },
      {
        "paragraph": "That *sshole, Chester was on the first floor."
      },
      {
        "paragraph": "Eliza wore a mask, but not many people were on the first floor at night."
      },
      {
        "paragraph": "When she walked to the door, Chester also came up to her side, his tall body much larger than hers."
      }
    ]
  },
  {
    "title": "Chapter 1797 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“When did you get back?” Chester pushed up the glasses on the bridge of his nose. “Other women are\nbusy looking for financial backers, but you’re much more thoughtful. You’ve found a woman instead and\neven played up to the prime minister’s goddaughter. You’re quite capable.”"
      },
      {
        "paragraph": "“Thanks,” Eliza replied calmly."
      },
      {
        "paragraph": "It was as if she could not hear the sarcasm at all."
      },
      {
        "paragraph": "Chester chuckled and suddenly bent down to whisper in her ear, “Welcome back, Eliza. It just so\nhappens that I’ve been quite bored lately, so I don’t mind playing with you.”"
      },
      {
        "paragraph": "Eliza glanced at him indifferently. “Unfortunately, I’m not interested in you.”"
      },
      {
        "paragraph": "Then, she walked away."
      },
      {
        "paragraph": "Chester looked at her silhouette under the street light. She wore a wide trench coat that only vaguely\nrevealed her two tightly wrapped straight and slender calves. Below, she wore a pair of white canvas\nshoes, showing her delicate ankles. Her long hair blew in the evening breeze, accentuating her excellent\ntemperament."
      },
      {
        "paragraph": "Chester’s eyes flashed with a dark glint."
      },
      {
        "paragraph": "He smiled gloomily, and his phone suddenly rang."
      },
      {
        "paragraph": "It was Rodney calling. “Where are you? I’m going out of my mind. Catherine told me to buy a\nwashboard…”"
      },
      {
        "paragraph": "“Then buy one,” Chester said casually. “What the f*ck. Even you—”"
      },

      {
        "paragraph": "“No matter how much of a scumbag I am, I won’t give away clothes that a woman bought for herself.”\nChester interrupted him."
      },
      {
        "paragraph": "Rodney choked. Just as he was about to say something, Chester had already hung up."
      },
      {
        "paragraph": "He was furious. ‘What was that all about? It’s because you’ve never gotten jealous before. When you get\njealous, you’ll behave even worse than I did."
      },
      {
        "paragraph": "Rodney harrumphed in anger, but… wait. Jealous? What was he jealous of?"
      },
      {
        "paragraph": "Rodney felt like he was going crazy."
      },
      {
        "paragraph": "After the Snow family left, only Catherine and a caretaker were left in the ward. However, the anesthetic\nwas wearing off, and Freya could not sleep well from the pain."
      },
      {
        "paragraph": "In the wee hours, Freya’s parents and Forrest arrived from Melbourne."
      },
      {
        "paragraph": "As soon as Freya saw her parents,  she could not help but hug her mother and start to cry. “Mom, I miss\nyou so much. I thought I’d  never see you again.”"
      },
      {
        "paragraph": "“What are you talking about? You were only giving birth. It wouldn’t have killed you. But didn’t you say\nyou were due next month? Why did you suddenly go into labor?” Mrs. Lynch was heartbroken. It was\nsaid that a woman was on the edge of life and death when she gave birth, but Mrs. Lynch was not there\nto accompany her daughter."
      },
      {
        "paragraph": "Freya did not say anything, and instead, she cried harder."
      },
      {
        "paragraph": "“What happened?” Mr. Lynch’s face sunk. “Did Rodney bully you?”"
      },
      {
        "paragraph": "Freya sniffled and said hoarsely, “Mom, Dad, I want a divorce.”"
      },
      {
        "paragraph": "Although she did not admit it, proposing a divorce was tantamount to indirectly admitting that Rodney\nhad bullied her."
      },
      {
        "paragraph": "Forrest’s expression went cold, and he walked out without saying a word."
      },
      {
        "paragraph": "At that moment, Rodney steeled his nerves and walked in."
      }
    ]
  },
  {
    "title": "Chapter 1798 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“You’re here just in time. What the hell did you do to Freya?” Forrest punched Rodney as he asked."
      },
      {
        "paragraph": "Rodney stumbled back a few steps and hit the door threshold. He was stunned. As Young Master Snow,\nhe was rarely beaten like this. After his uncle became the prime minister, he was looked up to no matter\nwhere he went."
      },
      {
        "paragraph": "Deep down, he was angry. However, when faced with the accusing eyes of the Lynch family, that anger\nwas seemingly stifled and could not be released."
      },
      {
        "paragraph": "“That’s… Forrest, calm down.” Rodney raised his hand and hurriedly looked at Catherine, the only calm\nperson in the ward, for help."
      },
      {
        "paragraph": "Catherine looked at the washboard in his hand and sighed as she walked up. “Uncle, Aunty, listen to\nwhat he has to say.”"
      },
      {
        "paragraph": "“Let him speak.”"
      },
      {
        "paragraph": "Mr. Lynch said in a cold voice, “Rodney Snow, I know your status is extraordinary, but you should know\nvery well why you got married. Although our Lynch family is small, Freya has come this far because your\nfamily forced her to. Yes, you guys made her the prime minister’s goddaughter, but do you think my\nfamily cares about building a relationship with the prime minister? She  has  to face the same amount of\ndanger as the amount of glory she has. Just take the incident with Gavin Mead. If she hadn’t gotten\ninvolved with the Snow family, would she have had to live in fear every day?”"
      },
      {
        "paragraph": "“That’s right. It’s not as if our family has no money.” Mrs. Lynch also agreed. “During the engagement,\nyou looked down on my daughter and wanted to hook up with another woman. You even made Freya get\nan abortion. After that woman didn’t want you, you came back to Freya again. I’ve always wanted to ask"
      },

      {
        "paragraph": "you this. Who do you think you are? What’s wrong with my daughter? Why should she be your backup?\nAre you worthy of her?”"
      },
      {
        "paragraph": "Rodney went ashen from their accusations."
      },
      {
        "paragraph": "After a few moments, he gnashed his teeth and put the washing board on the ground to kneel on it."
      },
      {
        "paragraph": "It hurt. It really f*cking hurt."
      },
      {
        "paragraph": "The people in the ward were all stunned. Even Freya was shocked."
      },
      {
        "paragraph": "“I’m sorry. It was my fault. It was because I quarreled with Freya that she went into premature labor.”"
      },
      {
        "paragraph": "Rodney took out a black card from his pocket. His handsome eyes looked at Freya pitifully. “You were\nright to scold me. As a man, not only did I not give you money, but I even gave away the clothes that you\nbought. I’m not human. From now on, you can keep this card and spend it on whatever you want to. I’ve\nalso bought the mall that you shopped at earlier. It’s under your name now, so you can go shopping\nwithout spending any money."
      },
      {
        "paragraph": "“Later, the mall will send over new magazines for this season. No matter if it’s shoes or clothes, whatever\nyou like can be sent over.”"
      },
      {
        "paragraph": "Freya’s pale lips opened in slight surprise. He had bought the entire mall for her?"
      },
      {
        "paragraph": "That mall was one of the few megamalls in the capital. It should cost a lot of money, right?"
      },
      {
        "paragraph": "Furthermore, a stubborn man like Rodney was actually kneeling on a washboard for her in front of other\npeople."
      },
      {
        "paragraph": "Freya thought her eyes and ears were playing tricks on her. Was she hallucinating?"
      },
      {
        "paragraph": "Not to mention Freya, even Catherine admired Rodney’s actions."
      },
      {
        "paragraph": "She only told Rodney to compensate Freya with clothes, but he went all out and bought the entire mall."
      },
      {
        "paragraph": "Forrest frowned coldly. “Rodney Snow, I admit that you’re very generous with materialistic things, but\nwhat a woman needs is emotional satisfaction. You don’t even know how to be patient with your\npregnant wife and aggravated her so much that she went into premature labor. What makes you qualified\nto be her husband?”"
      },
      {
        "paragraph": "“I’ll change in the future, Brother.”"
      },
      {
        "paragraph": "Rodney looked at the child in the cradle pitifully. “ Besides, it’s her confinement period now, and I need to\nhelp take care of the child. Otherwise, Freya will have a hard time. I swear that I can do all the dirty work.\nFreya only needs to make sure that she’s comfortable during her confinement period. If you guys are still\nworried, you can personally stay to supervise, Mother-in-law. Think about it. The baby is so young. She’ll\nbe miserable without a father.”"
      },
      {
        "paragraph": "He admitted his mistake with a good attitude and used the child to poke their weak spot."
      },
      {
        "paragraph": "For a moment, Mr. and Mrs. Lynch did not know what to say."
      },
      {
        "paragraph": "In any case, divorce was not good for the child, and Freya was also in her confinement period."
      }
    ]
  },
  {
    "title": "Chapter 1799 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "After a long time, Mr. Lynch spoke up as the head of the family. “We’ll talk about it after her confinement\nperiod ends in a month. We’ll see how you perform.”"
      },
      {
        "paragraph": "“Dad…” Freya pursed her lips."
      },
      {
        "paragraph": "Although Rodney’s attitude of admitting his mistakes was very good, his act of buying the mall surprised\nher. Seeing him kneeling on the washboard was very satisfying, but she still could not forget how much\nshe suffered when he made her angry."
      },
      {
        "paragraph": "Mrs. Lynch sighed. “What? If you get a divorce now, he can be completely indifferent to the child’s affairs.\nYou’ll have to stay up all night to nurse the baby while he sleeps comfortably at home. Are you willing?”"
      },
      {
        "paragraph": "Freya was speechless. No, she was not. “Knock knock…”"
      },
      {
        "paragraph": "A series of knocks suddenly sounded from the door."
      },
      {
        "paragraph": "Everyone turned around only to see Shaun standing at the door with his prominent features, and a thin\nsmile hung on the corners of his mouth."
      },
      {
        "paragraph": "“Shaun, why are you here?” Rodney was so shocked that he tried to get up from the washing board."
      },
      {
        "paragraph": "However, as soon as he moved, he felt a sharp pain in his knee and fell down miserably again."
      },
      {
        "paragraph": "Shaun looked at Rodney, and his smile twitched. Then, he averted his gaze and looked at Catherine\ninstead. “I’m here to pick you up.”"
      },
      {
        "paragraph": "He looked straight at her, and Catherine felt her cheeks heat up inexplicably."
      },
      {
        "paragraph": "Mrs. Lynch smiled. “Go back, Catherine. We’re here, so I’ll keep watch tonight. Besides…”"
      },

      {
        "paragraph": "After a pause, she glanced at Rodney. “Since a certain someone said that he wants to take care of the\nmother and child at night, I have to let him perform well.”"
      },
      {
        "paragraph": "“Mother-in-law is right. Hurry up and leave with Shaun.”"
      },
      {
        "paragraph": "Rodney gestured with his hand."
      },
      {
        "paragraph": "“Alright.” Catherine smiled and said goodbye to Freya before preparing to leave with Shaun."
      },
      {
        "paragraph": "“Hold on.” Shaun took out a gift and put it beside the baby."
      },
      {
        "paragraph": "Rodney glanced at it and said, “Dude, your gift is too expensive. I didn’t expect you to be so generous.”"
      },
      {
        "paragraph": "Shaun glanced at him and smirked. “She’s Cathy’s best friend’s daughter. It’s only natural that I buy\nsomething expensive.”"
      },
      {
        "paragraph": "Rodney was speechless."
      },
      {
        "paragraph": "It implied that this gift from his brother had nothing to do with him."
      },
      {
        "paragraph": "“Pfft.”"
      },
      {
        "paragraph": "Freya looked at Rodney’s defeated expression and could not help but laugh. This was what it looked like\nwhen one flattered himself too much."
      },
      {
        "paragraph": "When Rodney saw her laugh, he relaxed."
      },
      {
        "paragraph": "Thank God. She finally smiled."
      },
      {
        "paragraph": "If he had known earlier, he would tell Shaun to humiliate him more."
      },
      {
        "paragraph": "“Let’s go.” Shaun wrapped a hand around Catherine’s shoulder, and they both left."
      },
      {
        "paragraph": "In the quiet corridor, Catherine asked, “Why are you here? Where’s Suzie and Lucas?”"
      },
      {
        "paragraph": "“They’re asleep, ” Shaun said. “Don’t worry. They sleep like little piggies. They won’t wake up at all. I\ncame here after Chester told me that you’re here accompanying Freya.”"
      },
      {
        "paragraph": "“Since you know I want to accompany her, why did you come and get me?” Catherine snapped at him."
      },
      {
        "paragraph": "Shaun caressed her hair with his gentle eyes. “Since you’ve helped Rodney, it means that you don’t want\nthem to get a divorce. In that case, why stay here and be the third wheel? You should give Rodney a\nchance to perform.”"
      },
      {
        "paragraph": "Catherine thought about it and found some sense in his words. She was initially planning on leaving after\nthe Lynch family arrived anyway."
      },
      {
        "paragraph": "After getting into the car, she suddenly smelled a fragrance."
      }
    ]
  }
]