[

  {
    "title": "Chapter 1800 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "“I was afraid that you’d be hungry, so I bought you a pizza and some calamari. ” Shaun took the things\nfrom the back seat and put them into her hands."
      },
      {
        "paragraph": "Catherine did not feel hungry at first, but after smelling the fragrance, she became ravenous."
      },
      {
        "paragraph": "Shaun’s action made her smile."
      },
      {
        "paragraph": "Come to think of it, she felt that women were too easily satisfied sometimes."
      },
      {
        "paragraph": "“But… I’m afraid eating these in the middle of the night will affect my figure. ” Catherine pouted her pink\nlips and rubbed her stomach."
      },
      {
        "paragraph": "Shaun leaned over and kissed her on the lips. “Even if you grow fat, I’ll still like you.”"
      },
      {
        "paragraph": "“Who knows? You men are only ever good at paying lip service. ” Catherine was very satisfied, but she\nstill rolled her eyes arrogantly."
      },
      {
        "paragraph": "“If I cared about that, I wouldn’t have bought it for you, ” Shaun said innocently. “ Besides… you gave\nbirth to two children for me. You’ve done such a great thing. You deserve to be treated well for the rest of\nyour life."
      },
      {
        "paragraph": "“Where did that come from?” Catherine was surprised. She had never heard him mention this before."
      },
      {
        "paragraph": "“When I went in and saw Freya after labor earlier, I saw how pale and haggard she was. I thought to\nmyself, if she looks like that after  giving  birth  to one child, then you must have been in more pain when\nyou gave birth to the twins.” Shaun held her hand tightly, his warm  eyes  revealing  his heartache. “That\nis why I have  to treat  you well even more in the future.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "“It… did hurt quite a lot at that time.” Catherine nodded sourly. “It wasn’t easy giving birth to fraternal\ntwins. At that time, I could only get a C- section, and my stomach hurt for several months after that. Back\nthen… you were still with Sarah.”"
      },
      {
        "paragraph": "“I’m sorry. I’m sorry. I was a scumbag before.” Shaun hugged her gently, blaming himself from the bottom\nof his heart. “I’ll go buy a washboard too. If I do something wrong, make me kneel on it, okay?”"
      },
      {
        "paragraph": "“Hmph. ” Catherine pushed him away and lowered her head to eat the calamari."
      },
      {
        "paragraph": "Although she was unhappy when the past was brought up, she was not the kind of person who could not\nlet go."
      },
      {
        "paragraph": "Shaun looked at her silently and secretly whipped his old self in his heart again."
      },
      {
        "paragraph": "The more he knew, the more he just wanted to take her into his arms and care for her."
      },
      {
        "paragraph": "“What are you looking at me for? Drive, ” Catherine said."
      },
      {
        "paragraph": "“You can rest for a while.” Shaun started the car."
      },
      {
        "paragraph": "After Catherine finished the calamari, she still had half of the pizza left that she could not finish."
      },
      {
        "paragraph": "Feeling that it was a pity to waste it, she stuffed it into Shaun’s mouth."
      },
      {
        "paragraph": "Shaun drove while she fed him."
      },
      {
        "paragraph": "After the pizza was finished, Catherine felt slightly drowsy in the car. She was only going to take a nap,\nbut she accidentally fell asleep in the end."
      },
      {
        "paragraph": "When she woke up again, she found herself lying on the big white bed with a crystal clear lamp hanging\nabove her head."
      },
      {
        "paragraph": "She sat up straight away and looked around. This place was clearly a hotel."
      },
      {
        "paragraph": "“Cathy, you’re awake.” Shaun was helping her take off her shoes at the foot of the bed. “ I saw you were\nasleep, so I didn’t take you back to the Yule residence. Since you’d definitely refuse  to go back to Hill\nManor, I just took you to a hotel.”"
      },
      {
        "paragraph": "The man spoke with clear and pure eyes."
      },
      {
        "paragraph": "However, Catherine did not believe him. She sat up, feeling like she was abducted into a wolf’s den by a\nn ill-intentioned wolf. “You could’ve woken me up when we reached the Yule residence.”"
      },
      {
        "paragraph": "“You were sleeping so soundly. I couldn’t bear to wake you up.”"
      },
      {
        "paragraph": "Shaun’s gaze was dark."
      },
      {
        "paragraph": "“I want to go back.” Catherine scoffed and sat straight up."
      },
      {
        "paragraph": "“Babe, do you know what time it is?” Shaun tapped his watch. “It’s 3:00 a.m. in the morning. Go to sleep.\nIt’ll be 4:00 p.m. by the time we reach the Yule residence. Aren’t you tired? Besides, I won’t do anything\nto you. I still have to get up early and send the children to preschool.”"
      },
      {
        "paragraph": "Catherine looked chagrined. It was indeed quite late, and she really was exhausted."
      },
      {
        "paragraph": "“Go to sleep. You haven’t showered, and you stink. How would I still be interested in you?” Shaun teased\nplayfully."
      },
      {
        "paragraph": "”What does that mean? Which part of me stinks? How dare you say that to me?” Catherine punched his\nchest in annoyance."
      }
    ]
  },
  {
    "title": "Chapter 1801 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Her hand was soft."
      },
      {
        "paragraph": "It did not hurt. Instead, it felt like she was acting like a spoiled child."
      },
      {
        "paragraph": "Shaun’s throat bobbed as he grabbed her wrist. “Be good. It’s late. Don’t tease me.”"
      },
      {
        "paragraph": "How did she tease him?"
      },
      {
        "paragraph": "Catherine looked up and met his burning eyes, and her face blushed. She pushed him away hard. “\nPervert.”"
      },
      {
        "paragraph": "Then, she pulled the quilt and lay down."
      },
      {
        "paragraph": "Shaun also lay down next to her and reached out through the quilt to wrap his arms around her waist."
      },
      {
        "paragraph": "“Go away. You can sleep on the couch.” Catherine pushed him away."
      },
      {
        "paragraph": "They had just gotten back together, so it would make her seem too soft if she let him sleep with her on\nthe first day. She had to persist for a week at least, or Freya would look down on her."
      },
      {
        "paragraph": "“No. The couch is too short. I won’t be able to sleep well…” Shaun held on and refused to let go."
      },
      {
        "paragraph": "Catherine’s beautiful face became cold, and she pretended to get up. “Then I’ll sleep on the couch\ninstead.”"
      },
      {
        "paragraph": "“No.” Shaun hurriedly stopped her, his tired eyes looking helpless. “I’ll go.”"
      },
      {
        "paragraph": "Then, he obediently went to the couch."
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "The couch was indeed short. When his tall body curled up on it, half of his legs hung off the edge, and\nthere was no quilt either. Hence, he could only cover his stomach with a pillow."
      },
      {
        "paragraph": "Catherine suddenly felt like he was quite pitiful, and her heart softened. “Are there no more quilts in the\nroom?”"
      },
      {
        "paragraph": "Shaun shook his head and yawned. “Go to sleep.” After that, he fell asleep very quickly."
      },
      {
        "paragraph": "Catherine rubbed her messy hair. Everyone was tired at this hour, but because she was afraid that he\nwould take advantage of her, she deliberately made him sleep on the couch. In fact he was already tired\nand confused, yet she made it seem like he was full of schemes."
      },
      {
        "paragraph": "Would he catch a cold in this weather?"
      },
      {
        "paragraph": "However, she was too embarrassed to call him over now."
      },
      {
        "paragraph": "After thinking about it, she silently turned up the air conditioner and then went to sleep."
      },
      {
        "paragraph": "She did not know how long she had slept for."
      },
      {
        "paragraph": "In a daze, she felt a burst of heat coming from her body."
      },
      {
        "paragraph": "She even seemed a little out of breath. Catherine had a dream."
      },
      {
        "paragraph": "In the dream, she was still in love with Shaun, and they were in their honeymoon phase…"
      },
      {
        "paragraph": "A desire suddenly overwhelmed her, and she could not control gasping for breaths a few times."
      },
      {
        "paragraph": "She reached out in confusion and seemed to have embraced a familiar body."
      },
      {
        "paragraph": "The throbbing in her body seemed to intensify. It was up until there was a pain on her thin lips. She\nopened her eyes in confusion."
      },
      {
        "paragraph": "The first thing she saw was a man’s long and thick eyelashes. Shaun was kissing her tenderly and\npassionately, and her exposed skin was flushed with a hint of pink."
      },
      {
        "paragraph": "What she could not believe was that her arms were around his neck."
      },
      {
        "paragraph": "Catherine was dumbfounded."
      },
      {
        "paragraph": "Then, her brain sluggishly came to its senses. This was not a dream."
      },
      {
        "paragraph": "This b*stard was actually taking advantage of her sleeping…"
      },
      {
        "paragraph": "“ Shaun Hill, you b*stard.” Catherine reacted and raised her head in chagrin to bite him hard."
      },
      {
        "paragraph": "“Be good, Cathy. I just wanted to kiss you. You looked so cute when you were asleep just now.”"
      },
      {
        "paragraph": "Shaun ignored the pain and kissed her again, pestering her endlessly."
      },
      {
        "paragraph": "Catherine’s long eyelashes trembled."
      },
      {
        "paragraph": "The two of them were in the same large bed with almost no clothes on their bodies. It was not only a test\nfor Shaun but for herself as well."
      }
    ]
  },
  {
    "title": "Chapter 1802 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Catherine had never thought she would have such needs before. Yet every time she faced Shaun, she\nseemed easily ignited."
      },
      {
        "paragraph": "“Shaun Hill, go away…”"
      },
      {
        "paragraph": "She pushed and refused him."
      },
      {
        "paragraph": "“Kiss me, Cathy. You smell so good. I like you so much…”"
      },
      {
        "paragraph": "Shaun’s husky voice echoed in her ears, putting her into a daze each time."
      },
      {
        "paragraph": "She knew that the man’s words could not be trusted, but his voice always had such magical power."
      },
      {
        "paragraph": "By the time she realized that she had fallen into a trap, it was already too late."
      },
      {
        "paragraph": "It was already 1o:oo a.m. when it was quiet again."
      },
      {
        "paragraph": "As soon as Catherine came back to her senses, she almost broke down."
      },
      {
        "paragraph": "She wanted to persist for a week."
      },
      {
        "paragraph": "It had only been a day… and she had lost that persistence."
      },
      {
        "paragraph": "She wanted to cry as she looked at the man beside her."
      },
      {
        "paragraph": "“You lied to me. I hate you. ” She was so angry that she bit him on the shoulder."
      },
      {
        "paragraph": "Shaun did not move and allowed her to bite him. Even when she drew blood, he just caressed her head.\n“Good girl. As long as you can relieve your anger, you can bite me for as long as you want.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Catherine then smelt the scent of blood, and she really wanted nothing more than to rip his flesh off.\nHowever, she could not bring herself to do so."
      },
      {
        "paragraph": "Seeing her lying motionlessly, Shaun chuckled and picked her up. “I’ll take you to the bath.”"
      },
      {
        "paragraph": "“No. I can go by myself.” Catherine blushed and hurriedly struggled."
      },
      {
        "paragraph": "“Are you sure you can walk?” Shaun raised his eyebrows."
      },
      {
        "paragraph": "Catherine was speechless."
      },
      {
        "paragraph": "Her face burned red. She felt like she was being looked down upon. “Who said I can’t walk?”"
      },
      {
        "paragraph": "“You’re welcome to try.” Shaun put her on the carpet."
      },
      {
        "paragraph": "Catherine tried to move, but her weak legs unwillingly softened, and she fell to the ground."
      },
      {
        "paragraph": "Fortunately, Shaun was prepared, so he quickly picked her up. His chuckle echoed in her ears."
      },
      {
        "paragraph": "Catherine was ashamed of herself. Shaun carried her into the bathroom."
      },
      {
        "paragraph": "The bath that should have lasted 20 minutes went on for an hour."
      },
      {
        "paragraph": "After that, Catherine was carried out again. When she was put down on the bed, she quickly fell asleep\nfrom exhaustion."
      },
      {
        "paragraph": "When she woke up again, it was already 2:00 p.m."
      },
      {
        "paragraph": "She stared at the ceiling, absolutely sure that Shaun’s illness had been cured. Moreover, he was even\nhealthier than before."
      },
      {
        "paragraph": "“Cathy, are you hungry? I’ve prepared some pasta for you. ” Shaun came over with food. “The pasta in\nthis hotel is delicious.”"
      },
      {
        "paragraph": "Catherine strained herself to sit up and looked at the well-dressed man in front of her expressionlessly."
      },
      {
        "paragraph": "Unlike her disheveled appearance, Shaun was already dressed in black trousers and a white button-up\nshirt with a khaki coat over it. His hair was styled, revealing his bright forehead and sharp eyebrows,\nwhich made him look infuriatingly handsome."
      },
      {
        "paragraph": "“What’s wrong?” Shaun looked at her cold eyes and felt his heart hammer. “Do you not like pasta?”"
      },
      {
        "paragraph": "“Or… are you not satisfied with my performance before this?” Shaun asked nervously."
      },
      {
        "paragraph": "After all, in his memory, that was their first time sleeping with each other. Hence, he was afraid that he\nhad performed badly."
      },
      {
        "paragraph": "“…Get out.” Catherine was ashamed."
      },
      {
        "paragraph": "She seriously felt that he was doing this on purpose. It was as if he was deliberately making fun of her."
      },
      {
        "paragraph": "“Did I do something wrong?” Shaun looked innocent."
      },
      {
        "paragraph": "“You have a lot of nerve to ask me that question. ” Catherine glared at him angrily. “You’re so shameless.\nYou took advantage of me while I was asleep and… You really disappoint me. To think that I trusted you\nso much. Shaun, you’re just a pervert.”"
      },
      {
        "paragraph": "Shaun blinked his clear eyes. “Cathy, I admit that I was too reckless, but I didn’t want to as well. You are\njust too charming, and I’m a normal man. When I saw you asleep in the morning, you were so cute. I\ncouldn’t resist kissing you. Then, you took the initiative to hug me and began to respond to me, so I…”"
      }
    ]
  },
  {
    "title": "Chapter 1803 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "“That’s impossible.” Catherine instantly blew up like a barrel of dynamite. Her face was flushed."
      },
      {
        "paragraph": "How could she have done something so ridiculous? There was no way."
      },
      {
        "paragraph": "She was not that hungry for it. Although she used to be a little unsatisfied because of his previous\ncondition…"
      },
      {
        "paragraph": "However, she could not be that devoid of self- control."
      },
      {
        "paragraph": "“If you don’t believe me, I can swear…” Shaun raised his hand."
      },
      {
        "paragraph": "“Enough.” Catherine interrupted him and suppressed her anger. “Even if I didn’t push you away, it was\nbecause I was sleeping. I wasn’t aware of my actions at all. When I woke up, I told you to go away, but\nyou still refused.”"
      },
      {
        "paragraph": "Shaun pursed his delicate lips and looked at her deep in the eyes. “By then, I couldn’t control myself\nanymore. Cathy, you’ re so attractive. I’m just a normal man…”"
      },
      {
        "paragraph": "Catherine gritted her teeth. Although she was very dejected, she did feel a little pleased. But…"
      },
      {
        "paragraph": "She suddenly thought of something, and her beautiful face turned cold. “Shaun, has your memory\nrecovered?”"
      },
      {
        "paragraph": "“No.”"
      },
      {
        "paragraph": "“Then did you sleep with Hannah?” Catherine suddenly became furious. Her chest felt like it was about\nto explode with anger. “Don’t try to lie to me. You’re too experienced. Don’t tell me that it was inborn.\nYou… have more moves than before.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "So much that she was completely overwhelmed."
      },
      {
        "paragraph": "She remembered that Shaun was still ignorant and inexperienced not long ago."
      },
      {
        "paragraph": "For him to become so good so suddenly, Catherine could only think that Hannah was the one who taught\nhim."
      },
      {
        "paragraph": "As soon as she thought about him having a relationship with Hannah, she became heartbroken and\nangry. She felt disgusted as if she had just eaten rancid food."
      },
      {
        "paragraph": "“I didn’t…” Shaun was uncomfortable with her questioning."
      },
      {
        "paragraph": "He did not expect her to be so distrustful of him. “I told you before. The furthest I’ve ever gone with\nHannah was her kissing my face. We didn’t even kiss on the mouth.”"
      },
      {
        "paragraph": "Catherine sneered. “Then tell me where you learned these? Shaun Hill, if you don’t tell me, we’re over.”"
      },
      {
        "paragraph": "Shaun frowned frustratingly. After a long time, he muttered, “I learned it from the computer.”"
      },
      {
        "paragraph": "“What?”"
      },
      {
        "paragraph": "Catherine could not believe it."
      },
      {
        "paragraph": "“Didn’t Rodney come to Hill Manor to visit me some time ago? He gave me a USB flash drive full of it.”\nShaun secretly glanced at her. “After losing my memory, I knew nothing, but I understood once I watched\nit. Cathy, you’ve been taking advantage of me.”"
      },
      {
        "paragraph": "Catherine was embarrassed. She really had the urge to drop a rock on her own feet."
      },
      {
        "paragraph": "She did not expect that b*stard Rodney to show Shaun something like that."
      },
      {
        "paragraph": "At that time, Shaun was still as simple as a blank canvas, but Rodney ruined it all."
      },
      {
        "paragraph": "“You’re not allowed to watch anymore.” She deliberately put on a grim face and ignored his sentence of \n‘you took advantage of me’. “Shaun Hill, don’t you feel disgusted when looking at other women?”"
      },
      {
        "paragraph": "“I was… trying to understand and learn from experience. ” Shaun smiled and squeezed her small hand.\n“I won’t do it again. Don’t be angry, Cathy.”"
      },
      {
        "paragraph": "Not knowing what to say, Catherine scoffed and looked away."
      },
      {
        "paragraph": "Shaun put down the bowl and hugged her from behind. He could only say in a low voice, “Cathy, tell\nme… Was the older me better or the current me?”"
      }
    ]
  },
  {
    "title": "Chapter 1804 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Catherine’s scalp tingled. She should not have pursued it. “Uh… I’m hungry. Hurry up and pass me the\npasta. I’m starving.”"
      },
      {
        "paragraph": "She quickly took the bowl."
      },
      {
        "paragraph": "“Cathy…” Shaun refused to let her go and clasped her in his arms tightly. “Answer me.”"
      },
      {
        "paragraph": "“ Shaun, don’t go too far. ” Catherine’s face turned red."
      },
      {
        "paragraph": "“Answer me, or I’ll have to practice on you again. ” Shaun turned her little face over to face him."
      },
      {
        "paragraph": "Catherine was so embarrassed that she quickly dodged his eyes. “Jeez, alright. You used to be sick, so\nwhat’s there to compare?”"
      },
      {
        "paragraph": "“Then where did Suzie and Lucas come from? I can’t have been sick all the time, right?” Shaun raised\nhis brows. He looked like he would not give up until he got an answer."
      },
      {
        "paragraph": "Catherine was speechless. Whether it was the old or current him, it was still him. What was there to\ncompare? Moreover, was she shameless?"
      },
      {
        "paragraph": "“Fine. You’re better now.”"
      },
      {
        "paragraph": "In the end, she really was shameless."
      },
      {
        "paragraph": "After that, she flung his hand away and picked up the bowl before she started to eat the pasta."
      },
      {
        "paragraph": "Shaun looked at her with a smile. “Eat slowly, Cathy. Don’t choke.”"
      },
      {
        "paragraph": "He poured a cup of water and put it in front of her."
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Catherine was quite full after eating a bowl of pasta. “By the way, who sent Suzie and Lucas to preschool\ntoday?”"
      },
      {
        "paragraph": "“Me. I woke up at 6:00 a.m. and rushed to the manor. I came back after sending them off.”"
      },
      {
        "paragraph": "He said lazily while playing with a long lock of hair on her shoulder."
      },
      {
        "paragraph": "Catherine was stunned. Considering that he went to bed very late last night, slept on the sofa, and even\ngot up early in the morning to exercise, his physical strength really was extraordinary. However…"
      },
      {
        "paragraph": "“Why don’t you take a nap?” Catherine hesitated before saying, “After all, you’re not a young man\nanymore…”"
      },
      {
        "paragraph": "“What are you trying to say?” Shaun raised his brows and asked pensively."
      },
      {
        "paragraph": "“Ahem. What I mean is… You’re in your thirties,  and your physical fitness is declining, so you should\ntake care of yourself— Ah!”"
      },
      {
        "paragraph": "Before she could finish her sentence, he took her into his arms and spanked her a few times."
      },
      {
        "paragraph": "“I’m in perfectly good health. ” Shaun gnashed his teeth and said in her ear, “You don’t have to remind\nme of my age constantly, or I’ll prove it to you.”"
      },
      {
        "paragraph": "“Don’t…”"
      },
      {
        "paragraph": "Frightened, Catherine hurriedly cupped his handsome face. “I’m just concerned about you.”"
      },
      {
        "paragraph": "“Thanks for your concern, ” Shaun smirked. “ But don’t worry. I definitely won’t die before you. I won’t\nleave you alone in this world. Even if I’m not well, I’ll hold on until you leave before I leave too. ”"
      },
      {
        "paragraph": "In fact, once people grew old, the ones left behind were the ones who suffered the most."
      },
      {
        "paragraph": "Upon hearing that, Catherine’s heart warmed up. She hugged him tightly without saying a word."
      },
      {
        "paragraph": "“Cathy, let’s go on a family trip,” Shaun suddenly said. “I told Lucas and Suzie this morning that we\nhadn’t gone on a holiday yet. They were very happy.”"
      },
      {
        "paragraph": "“Can we wait until Freya’s confinement period ends?” Catherine frowned. She, too, wanted to  go out\nand have fun as a family of four, but she was worried about Freya’s state."
      },
      {
        "paragraph": "“You want to be the third wheel while she’s in her confinement?” Shaun disagreed. “Since you’ve helped\nRodney, that means you want them to reconcile. The confinement month is the most vulnerable time for\nwomen, and it’s also the most suitable time for them to cultivate their  feelings. It’s not appropriate for you\nto keep running over.” Catherine paused. It seemed like he was right. “ Then… When are we going?”"
      }
    ]
  },
  {
    "title": "Chapter 1805 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "“Tomorrow? ” Shaun raised his eyebrows. “First, we’ll take my dad’s private jet to visit Country Y. By the\nway, my dad has also asked me to take Suzie"
      },
      {
        "paragraph": "and Lucas to visit his company. After all, those two little ones will take over the company in the future.”"
      },
      {
        "paragraph": "Catherine was at a loss for words."
      },
      {
        "paragraph": "All of a sudden, her heart ached a little for Suzie and Lucas. They were so young, yet so many people\nwanted to give them such huge assets."
      },
      {
        "paragraph": "First, it was Hill Corporation, and now it was Garson Corporation. They were multinational corporations\nwith assets worth hundreds of billions. How tired would they be in the future?"
      },
      {
        "paragraph": "“We can also live in my dad’s castle. It’s next to the sea, which is apparently a half an hour’s drive away.”\nShaun held her hand and said, “We can also go to his winery for some wine tasting.”"
      },
      {
        "paragraph": "Catherine took a deep breath. “Okay, let’s go tomorrow.”"
      },
      {
        "paragraph": "“You’re not going to accompany Freya anymore?” Shaun raised his eyebrows."
      },
      {
        "paragraph": "Catherine coughed and said nonchalantly, “I think that what you said was right. The confinement period\nis the best time for them to bond with each other. I can’t be their third wheel.”"
      },
      {
        "paragraph": "Come on. They were going to live in a castle, relax at the beach, and even sip wine at a winery. Coupled\nwith the wonderland-like scenery of Country Y, who would not want to go there to relax and unwind?"
      },
      {
        "paragraph": "She wanted nothing more than to take the private jet there now."
      },
      {
        "paragraph": "That evening, Catherine took Suzie and Lucas with her to visit Freya."
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "They just so happened to see Rodney clumsily changing the baby’s diaper."
      },
      {
        "paragraph": "“Wow, Mommy, the baby is so cute.” Suzie leaned over and poked the baby’s cute little face with her\nfingers."
      },
      {
        "paragraph": "Rodney grinned. “If you like them,  tell your mom to give you another one.”"
      },
      {
        "paragraph": "Catherin was speechless. She would go crazy if she gave birth to a pair of twins again."
      },
      {
        "paragraph": "“No need. Mommy already has us.” Lucas said coolly, “Besides, one younger sister is bad enough.  I\ndon’t want my life to be even more annoying.”"
      },
      {
        "paragraph": "“Who are you calling annoying, huh? I haven’t even complained about that stinky face of yours,” Suzie\nretorted with a huff."
      },
      {
        "paragraph": "The little baby frowned because of their quarrel."
      },
      {
        "paragraph": "Catherine quickly said, “Don’ t disturb the baby’s sleep. By the way, have you given her a name yet?”"
      },
      {
        "paragraph": "“My grandfather has named her Danielle, short for Dani, ” Rodney said."
      },
      {
        "paragraph": "“That sounds nice.”"
      },
      {
        "paragraph": "Catherine nodded and allowed the children to accompany Dani. Then, she went to chat with Freya. “Are\nyou feeling better?”"
      },
      {
        "paragraph": "“Nope, it hurts, ” Freya said weakly. “I have to face Rodney all day too. I feel like I can’t breathe.”"
      },
      {
        "paragraph": "“ If you don’ t face him, do you want him to leave you alone?” Freya laughed. “You carried a baby for ten\nmonths and worked so hard to give birth. Are you willing to let him be a father comfortably without\ncontributing to anything?”"
      }
    ]
  },
  {
    "title": "Chapter 1806 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "“Why are you saying the same thing as my mom?” Freya pouted. “My mom told me to abuse and torture\nhim.”"
      },
      {
        "paragraph": "“Your mom is right.”"
      },
      {
        "paragraph": "Catherine agreed. “During your confinement period, you don’t have to worry about anything. Take care of\nyourself, eat, drink and have a good rest. The best is if you don’t even have to get out of bed. Let him\ndeliver the food right up to your mouth. If you hate someone, you have to torture him constantly. You’ll\nonly let him off easy if you divorce him now. At the very least, you have to torture him thoroughly before\nletting him go. Just thinking about it infuriates me. How could he give away the clothes you bought?\nDoes he think that giving you a mall can make up for it? Some hurt can’t be compensated with money.”"
      },
      {
        "paragraph": "“That’s right. My thoughts exactly.”"
      },
      {
        "paragraph": "Freya seemed to have finally found someone who agreed with and supported her. She nodded her head."
      },
      {
        "paragraph": "“Remember.  If he makes you suffer, you must make him pay back a thousand times. ” Catherine stared\nat her very seriously."
      },
      {
        "paragraph": "Freya was creeped out by the grave look in her eyes. “Um… Actually, there’s no need to go that far.”"
      },
      {
        "paragraph": "“In any case, if he doesn’t listen to you, just call the Snow family and complain to them, ” Catherine told\nher solemnly. “By the way, I’m here  today  to  tell you that tomorrow… I plan to take the two children to\nCountry Y for a holiday. I might be there for half a month.”"
      },
      {
        "paragraph": "Freya froze. When she came back to her senses, she was overwhelmed with jealousy. “Catherine Jones,\nyou’re too much. I have to sit at home for confinement, yet you’re going traveling behind my back? Wait.\nAre you going with Suzie and Lucas alone? That can’t be.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Her gaze suddenly turned suspicious. Although it was said that a pregnant woman would become a fool\nfor three years, she was not that dumb."
      },
      {
        "paragraph": "Catherine felt embarrassed and guilty. “I can’t afford to take the two children by myself. Shaun will go\nwith us. His father will accompany us back to the UK. The main reason is that his father wants"
      },
      {
        "paragraph": "Suzie and Lucas to familiarize themselves with his company so that they can take over the company in\nthe future.”"
      },
      {
        "paragraph": "“What the f*ck. How old are they? He wants them to familiarize themselves with the company?” Freya\nwas jealous. “ Suzie and Lucas’s lives are too good. How about… we set an engagement between our\nchildren? Although my Dani is very young now and Rodney’s IQ is low, with my exceptionally beautiful\nand smart genes, she won’t turn out too bad in the future.”"
      },
      {
        "paragraph": "“Doesn’t your conscience hurt when you boast so much?” The corners of Catherine’s lips twitched."
      },
      {
        "paragraph": "“Hehe. If I weren’t exceptional, could I become the world’s youngest cosmetic chemist? As for my beauty,\ndo you actually doubt it?” Freya narrowed her eyes. “I’m just unlucky for always meeting scumbags.”"
      },
      {
        "paragraph": "“Alright. I wouldn’t dare to engage Lucas with anyone. However, when they grow up, we can match make\nthem.”"
      },
      {
        "paragraph": "Catherine said, “ I’ll bring you a gift when I’m back. I hope you’ll stay at home and take care of your\nbody.”"
      },
      {
        "paragraph": "Freya sighed gloomily. “I’m so jealous that you’re going on holiday.”"
      },
      {
        "paragraph": "After a pause, she quickly lowered her voice and said, “I’m warning you. Don’t be so quick to let Shaun\nhave his way.”"
      },
      {
        "paragraph": "Catherine was speechless."
      },
      {
        "paragraph": "She did not have the face to admit that he had already succeeded."
      },
      {
        "paragraph": "She coughed again in embarrassment. “By the way,"
      },
      {
        "paragraph": "I heard from Shaun that the b*stard Rodney showed Shaun many films when he visited the manor awhile\nago. I didn’t expect him to be so vulgar. Please teach him a lesson on my behalf.”"
      },
      {
        "paragraph": "“Are you talking about that kind of film?” Freya was exasperated. It was no wonder Rodney said he\nwanted to bring Shaun a gift when they went to the manor the last time. How dare he give Shaun that\nkind of gift."
      },
      {
        "paragraph": "She did not expect that a usually clean-looking man like him was so…"
      },
      {
        "paragraph": "“Ahem. So, did Shaun try to practice what he saw on you?” Freya’s eyes lit up when she suddenly\nrealized something."
      },
      {
        "paragraph": "“…Don’t worry. I won’t let him succeed so easily. ” Catherine’s scalp tingled. “Well… It’s getting late. I\nhave to go back and pack my bags. We’ll leave now.”"
      }
    ]
  },
  {
    "title": "Chapter 1807 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "“Sure enough…”"
      },
      {
        "paragraph": "Freya’s expression clearly showed that she had grasped the point."
      },
      {
        "paragraph": "Blushing, Catherine swiftly made an excuse to leave with her two kids."
      },
      {
        "paragraph": "Knowing that her best friend would be going on a vacation with her family, Freya gazed at the ceiling with\njealousy and sighed."
      },
      {
        "paragraph": "“What’s wrong… with you? Are you hungry?” Rodney asked as he approached her cautiously while\ncarrying the baby."
      },
      {
        "paragraph": "Freya shot a stony look at him. “Cathy will be traveling to Country Y with her family, yet all I can do is lay\nhere. I’m jealous. It’s been ages since I last went on a vacation, especially after I got pregnant. ”"
      },
      {
        "paragraph": "“We can go on a vacation after your confinement period is over. ” After Rodney casually finished his\nsentence, it dawned on him that he had never traveled anywhere with Freya despite having married her\nfor a long time. They had never even spent the night in other places."
      },
      {
        "paragraph": "In fact, traveling was rather a good idea."
      },
      {
        "paragraph": "As soon as this idea flashed across his mind, Rodney came up with a suggestion. “We can go to the\nbeach and bring a few sitters along.”"
      },
      {
        "paragraph": "“I don’t want to travel with you, ” Freya said coldly."
      },
      {
        "paragraph": "Rodney breathed in and thought that he should not get angry at her."
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Freya threw a glance at him. “I heard you sent quite a number of videos to Shaun. You must’ve watched\nthem a lot, right? I didn’t know you were such a pervert. It’s already bad enough that you do it alone, but\nwhy did you have to influence Shaun?”"
      },
      {
        "paragraph": "His cover was blown out of the blue."
      },
      {
        "paragraph": "Rodney’s mind turned blank for a moment before his strikingly exquisite face flushed."
      },
      {
        "paragraph": "His head buzzed as he never expected Catherine to find out about it and even inform Freya. However,\nShaun had gone too far. Rodney shared his secret with Shaun, yet Shaun gave it away. How despicable."
      },
      {
        "paragraph": "“ I … I downloaded those videos for Shaun’s sake."
      },
      {
        "paragraph": "When he lost his memory previously, he was like a blank slate. I just wanted him to understand the things\nthat happen between a man and a woman so that he can protect himself. You just don’t understand my\nintention at all.”"
      },
      {
        "paragraph": "Rodney kept denying it."
      },
      {
        "paragraph": "Even so, Freya did not believe him at all.  “People say that a woman tends to become stupid after they\ngive birth, but I didn’t turn into a fool. Do you think I’ll buy it? It’s a fact that you did it. If you had just\nadmitted it, I would’ve considered you a brave man. I didn’t expect that you’d be so afraid of admitting it.\nShame on you, Rodney Snow.”"
      },
      {
        "paragraph": "Her contempt for him made his blood boil. “Drop it, Freya.”"
      },
      {
        "paragraph": "“I really wonder why you watched so much of it when you can’t even do it with any woman, ” Freya\nteased him."
      },
      {
        "paragraph": "“You…” Rodney felt deeply humiliated. Rage welled up inside him."
      },
      {
        "paragraph": "Even the newborn baby appeared to be aware of it. She immediately pouted and bawled."
      },
      {
        "paragraph": "Rodney was so shocked that he promptly calmed the baby and said, “Don’t cry, Dani. I didn’t mean it…\nPlease don’t cry…. My darling… Don’t cry…”"
      },
      {
        "paragraph": "No matter how he tried to calm Dani, she did not seem to be bothered about her father."
      },
      {
        "paragraph": "Freya was speechless. She felt that Rodney was really awful at soothing others."
      },
      {
        "paragraph": "“Pass her to me.” She stretched out her arms as she could not bear to see her baby cry."
      },
      {
        "paragraph": "Once she carried her baby, she started comforting her softly. Shortly after, Dani stopped crying."
      },
      {
        "paragraph": "Rodney looked at her gentle gaze when she was soothing Dani. Then, he turned his eyes to Dani and\nsaw her smiling. Deep down, he found it miraculous. “I  didn’t know that… you’re pretty good at soothing\npeople.”"
      },
      {
        "paragraph": "“I used to take care of Cathy’s kids overseas, so I have some experience, ” Freya said, “You need to be\npatient when it comes to soothing kids.”"
      },
      {
        "paragraph": "“Oh.”"
      },
      {
        "paragraph": "It was rare to see Rodney listen to Freya obediently. He gazed intently  at her movements and pretty\neyes."
      }
    ]
  },
  {
    "title": "Chapter 1808 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Freya had always given Rodney the cold shoulder and treated him with resentment. However, when she\nfaced the baby, an indulgent and gentle smile spread across her face as though she had turned into a\ndifferent person."
      },
      {
        "paragraph": "Despite her slightly pale face, her features were still pretty and attractive. It seemed as though her smile\ncould melt the snow."
      },
      {
        "paragraph": "At the sight of her unusually quiet and gentle face, Rodney could not bring himself to interrupt her. He\npursed his thin lips and quieted down."
      },
      {
        "paragraph": "Only when Freya lifted her head once again did she notice that Rodney was obediently sitting beside her\nin silence."
      },
      {
        "paragraph": "The scene was a little weird."
      },
      {
        "paragraph": "“Why are you sitting here? Go away. I’m going to breastfeed.” Freya glowered at him."
      },
      {
        "paragraph": "Rodney blinked. “Go ahead. I’m not stopping you.”"
      },
      {
        "paragraph": "Freya was at a loss for words."
      },
      {
        "paragraph": "She wondered if he was trying to stay here on purpose."
      },
      {
        "paragraph": "Although he was not stopping her, she… felt embarrassed."
      },
      {
        "paragraph": "Rodney remained motionless. Then, he sensed her fiery gaze and grasped the point. “Are you too\nembarrassed to do it?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "“Am I not supposed to feel embarrassed?” Freya gritted her teeth, wondering what Rodney’s brain was\nmade of."
      },
      {
        "paragraph": "Rodney let out a laugh. “There are women breastfeeding in public, so this is considered normal.”"
      },
      {
        "paragraph": "“Haven’t you noticed that there are baby care rooms in malls?” Freya was so annoyed that her pale face\nflushed."
      },
      {
        "paragraph": "“But I’m your husband…”"
      },
      {
        "paragraph": "“Please bear in mind that you’re just my temporary husband. You’ll be stripped of your identity soon,”\nFreya could not help but remind him, “What’s more, I don’t want a pervert like you to watch me\nbreastfeed.”"
      },
      {
        "paragraph": "Rodney’s handsome face slowly darkened. “Freya Lynch, you need to get this straight. Ever since I\nmarried you, I’ve never once touched you. Don’t accuse me for no reason.”"
      },
      {
        "paragraph": "“You’ve been collecting those videos and even circulating them. Aren’t you a pervert?” Freya teased, “Or\nare you a creep?”"
      },
      {
        "paragraph": "“… Fine, you win.”"
      },
      {
        "paragraph": "Rodney failed to convince her. He had no choice but to turn around and head to the room next door in a\nhuff."
      },
      {
        "paragraph": "Dani fell asleep shortly after she drank enough milk."
      },
      {
        "paragraph": "Freya barely had anything to eat. At 10:00 p.m, a nurse came to check on her and said, “You can try\nusing a breast pump.”"
      },
      {
        "paragraph": "“I did. Even after pumping for a long time, I barely got any milk.” Freya felt uncomfortable. “My hands are\nsore.”"
      },
      {
        "paragraph": "The nurse smiled and glanced at Rodney, who was drinking some water. “Well, you can ask your\nhusband to help.”"
      },
      {
        "paragraph": "“Pfft…” Shocked, Rodney spurted out the water from his mouth at once. “Ahem.”"
      },
      {
        "paragraph": "He patted his chest after choking."
      },
      {
        "paragraph": "Did the nurse mean what he thought she meant?"
      },
      {
        "paragraph": "The nurse looked at the blushing faces of both Rodney and Freya, who had just become parents. She\ncould not help but say, “Both of you are already married. There’s nothing to be embarrassed about.”"
      },
      {
        "paragraph": "Freya was so ashamed that she wished the ground would swallow her up."
      },
      {
        "paragraph": "As soon as the nurse left, an eerie hush fell over the ward."
      },
      {
        "paragraph": "Rodney touched his nose and approached Freya quietly. After throwing a strange look at her chest, he\nsomehow felt uneasy and started feeling hot. “ Ahem, I actually don’t mind helping you out…”"
      },
      {
        "paragraph": "“ I do.” Freya glared at him with her flushed face."
      },
      {
        "paragraph": "”Freya, don’t strain yourself.” Rodney’s expression showed that he just wanted to help Freya for her own\ngood.  “Just keep  your mind pure and  simple.”"
      }
    ]
  },
  {
    "title": "Chapter 1809 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Freya felt an atomic bomb going off in her head. What did Rodney mean?"
      },
      {
        "paragraph": "It was as if she was impure and had complex thoughts."
      },
      {
        "paragraph": "“ I don’ t need your help no matter how badly I’m suffering.” Freya showed a look of absolute contempt\nfor him."
      },
      {
        "paragraph": "Rodney pouted and did not bother to argue with her further."
      },
      {
        "paragraph": "Dani woke up in the wee hours to have some breast milk again. However, a newborn like her had a\nrather poor appetite."
      },
      {
        "paragraph": "There were a few times when Freya fell asleep while feeding the baby due to fatigue."
      },
      {
        "paragraph": "While she was still muddle-headed, she sensed that someone had come and carried Dani away from\nher. The person then helped tidy her shirt."
      },
      {
        "paragraph": "As much as she wanted to open her eyes, she was unable to do it."
      },
      {
        "paragraph": "When she woke up the next day, she felt her face burning as she recalled what had happened in the wee\nhours."
      },
      {
        "paragraph": "She glanced around the ward, only to see the caregiver alone. Only then did she heave a sigh of relief.\nRodney must have slept like a log last night. He could not have been the one who did those things."
      },
      {
        "paragraph": "“Aunty Holly, I fell asleep while breastfeeding last night. You were the one who tidied my shirt, right?”\nFreya was appreciative of the caregiver’s help."
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "The caregiver was stunned for a moment before replying with a smile, “No. Young Master Snow asked\nme to return early last night. He was the one who was here the entirety of last night. He said he wanted\nto look after you and the baby on his own.”"
      },
      {
        "paragraph": "Freya froze. In that case, was it Rodney who tidied her shirt?"
      },
      {
        "paragraph": "Her face turned crimson in spite of herself."
      },
      {
        "paragraph": "Aunty Holly laughed and said, “Young Master Snow is quite concerned about you and the baby. I’ve\ntaken care of many rich pregnant women. Although they seem to have married well, their husbands\nseldom carry the babies. It’s rare to find a man like Young Master Snow who personally accompanies\nyou and looks after the baby. He previously knew nothing, but he quickly got the hang of it in these two\ndays. He has already learned how to change the baby’s diapers and clothes. He even brought the baby\nupstairs for a swim just now.”"
      },
      {
        "paragraph": "Freya muttered, “As the baby’s father, he’s supposed to do all these things.”"
      },
      {
        "paragraph": "“You don’t know that many wealthy men will choose to settle everything with money. They certainly won’t\ndo it on their own. They expect the caregivers and sitters to deal with everything."
      },
      {
        "paragraph": "Admittedly, it’s our responsibility to take care of these things, but babies need parental love as well.”\nAunty Holly darted a glance at Freya’s chest. “I see that you’re suffering. Don’t you want to ask Young\nMaster Snow for help?”"
      },
      {
        "paragraph": "The caregiver changed the topic so swiftly that Freya had no idea how to respond to her question at that\nmoment."
      },
      {
        "paragraph": "She just wanted  to be  an invisible  person right now."
      },
      {
        "paragraph": "During breakfast, Mr. Lynch, Mrs. Lynch,  and Wendy came over. Wendy even brought along a five-star\nchef from the Snow family to prepare breakfast."
      },
      {
        "paragraph": "Freya had been eating very well during her confinement period."
      },
      {
        "paragraph": "When Rodney returned with Dani, who had just finished swimming, Mrs. Lynch observed the way he\ncarried the baby. She realized that he seemed experienced. Based on her experience, she was certain\nthat it was not an act."
      },
      {
        "paragraph": "The moment Dani cried, Rodney knew that she might want to urinate. He immediately began to skillfully\nchange her diaper."
      },
      {
        "paragraph": "Mrs. Lynch said to him in an unusually affable manner, “She has only peed in the diaper once. You can\nleave it.”"
      },
      {
        "paragraph": "“No way. I can’t let my princess experience any discomfort.” Rodney was very patient with his princess.\n“By the way, Mom, please prepare a bigger bag for me so that I can put some diapers and bottles in it.”"
      },
      {
        "paragraph": "“… Not bad. You’ve improved.”"
      },
      {
        "paragraph": "Wendy shot an unusually admiring look at him. “ Keep it up. Not only must you be a good father but you\nmust also be a good husband.”"
      },
      {
        "paragraph": "After pausing for a moment, Wendy held Mrs. Lynch’s hands enthusiastically. “Mrs. Lynch, you can leave\neverything here to Rodney. Let’s go shopping. Coincidentally, Rodney has bought a mall for Freya. We\ncan shop there. Don’t worry, if Rodney dares to treat Freya badly, I promise that I’ll deal with him.”"
      }
    ]
  },
  {
    "title": "Chapter 1810 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Mrs. Lynch, who arrived not long ago, was taken away by Wendy just like that."
      },
      {
        "paragraph": "Freya felt helpless as she had planned to ask her mother to help her with the breast pump. She was\nmentally exhausted."
      },
      {
        "paragraph": "At the sight of her frustrated expression, Rodney’s thin lips twitched. However, he held his tongue in the\nend."
      },
      {
        "paragraph": "After lunch, Freya lay on the bed and was playing a game on her phone. Suddenly, a hand grabbed her\nphone."
      },
      {
        "paragraph": "“The doctor said that you should spend less time on your phone during your confinement period. Too\nmuch screen time will harm your eyes. Do you want to go blind?” Rodney tossed her phone onto the\ncouch. “Let me remind you that you’ve spent long enough on your phone this morning.”"
      },
      {
        "paragraph": "Freya was already grumpy having to lie on the bed. She was aware that spending too much time on her\nphone was bad for her. Even so, she was ruffled by how Rodney was restricting her. “Stop restricting me.\nEven if I go blind, it’ll be your fault. You got me pregnant and made me give birth to the baby.”"
      },
      {
        "paragraph": "Rodney snorted. “I’m stopping you from playing with your phone precisely because I’m worried that you’ll\nput the blame on me. When you go blind, you might make me…”"
      },
      {
        "paragraph": "He suddenly paused toward the end of the sentence. Looking a little nervous, he did not continue."
      },
      {
        "paragraph": "Freya gave a cold laugh. “Make you what? Make you take responsibility for it? Don’t worry, I definitely\nwon’t make you take responsibility for it.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "“Forget it. Since you’ve given birth to my child, I can’t avoid taking responsibility for you.” Rodney\nscoffed. “Take a nap and don’t strain your eyes. If you think what I said isn’t right, you can call your\nparents and ask them whether it makes sense to restrict you.”"
      },
      {
        "paragraph": "“Fine, you win. You even know how to snitch on me now.”"
      },
      {
        "paragraph": "Stung by his words, Freya started becoming glum."
      },
      {
        "paragraph": "She snorted with rage and lay down with her back facing him. Clearly, she could not be bothered about\nhim."
      },
      {
        "paragraph": "However, her chest hurt really badly. Amid the pain, she fell asleep. All of a sudden, she felt something\nunusual. It was as if a weight had been lifted off her chest."
      },
      {
        "paragraph": "She opened her bleary eyes, only to see Rodney tidying her shirt."
      },
      {
        "paragraph": "Words failed her for a moment. By the time she regained her senses, she instantly screamed in terror.\n“Rodney Snow, you pervert— ”"
      },
      {
        "paragraph": "“Stop screaming. ” Rodney promptly covered her mouth. When he looked up, he saw a fiery glint in her\neyes."
      },
      {
        "paragraph": "From Freya’s flushed face, he was not sure whether she was exasperated or embarrassed. There were\neven angry tears in her pretty eyes."
      },
      {
        "paragraph": "How she wished everything was just a dream. She wished that it was not true."
      },
      {
        "paragraph": "Indeed, she had given birth to Rodney’s child. Nevertheless, they had only done it once. What was more,\nshe was drunk then, so she only had hazy recollections of it."
      },
      {
        "paragraph": "Deep down, she still felt that she was a pure young woman."
      },
      {
        "paragraph": "“It’s because you seemed miserable during your sleep. You kept tossing and turning. ” Rodney felt\nawkward, and his face was burning."
      },
      {
        "paragraph": "He already had a child. Furthermore, he had sent Shaun quite a lot of those videos."
      },
      {
        "paragraph": "Having said that, Rodney hardly had any experience in this area. Although he previously had a crush on\nSarah for a long time, he had never even touched her hands."
      },
      {
        "paragraph": "Calling him a pure young man would not be stretching it."
      },
      {
        "paragraph": "“Please, you’re the one who’s miserable.” Freya gave him a death stare as her face reddened."
      },
      {
        "paragraph": "Rodney blinked. “ I’ve recorded a video. Here’s the proof.”"
      },
      {
        "paragraph": "Once he finished speaking, he took out his phone and tapped open the latest video he had recorded."
      },
      {
        "paragraph": "The video showed that she was asleep, but her sleeping posture looked very off. She had placed her\nhands on an inappropriate spot as well."
      }
    ]
  },
  {
    "title": "Chapter 1811 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Freya was embarrassed."
      },
      {
        "paragraph": "She could not believe that she was… so open while sleeping."
      },
      {
        "paragraph": "After Rodney spotted her deeply embarrassed expression, the corners of his mouth curved up. “I really\nhad no choice but to help you out after seeing how miserable you were. You don’t have to thank me as\nthis is my duty as a husband. I just want to tell you that I appreciate everything you do, wifey.”"
      },
      {
        "paragraph": "Freya was seething with fury. He had won this round."
      },
      {
        "paragraph": "Putting aside the fact that she had been taken advantage of, she even had to thank him."
      },
      {
        "paragraph": "Indeed, he was the archetype of a *sshole."
      },
      {
        "paragraph": "“Do you feel better now?” Rodney looked at her with a grin. “ If you’re still not well, I’m more than ready\nto assist you.”"
      },
      {
        "paragraph": "“Thanks. I feel much better.”"
      },
      {
        "paragraph": "With a face full of shame, Freya immediately covered her face with the blanket."
      },
      {
        "paragraph": "“Is it because you’re embarrassed? I didn’t know that a shameless person like you would easily…”"
      },
      {
        "paragraph": "Rodney continued to make despicable comments about her. Freya, who was at the end of her rope,\nshouted beneath the blanket, “Get lost.”"
      },
      {
        "paragraph": "“Fine. I’m going to play with Dani.”"
      },
      {
        "paragraph": "Rodney headed to the other side."
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Only after hearing his footsteps did she let out a long sigh. As much as she wanted to deal with Rodney,\nit was undeniable that she felt much better now."
      },
      {
        "paragraph": "In fact, she saw no point in going against her own will."
      },
      {
        "paragraph": "It was just a bite, was it not? However, the spot that was bitten…"
      },
      {
        "paragraph": "While enduring her embarrassment, Freya thought to herself, ‘I should just… pretend to be asleep next\ntime. That way, I won’t feel embarrassed when I wake up. Ahem, of course, I’ll lose my dignity. But it’s\nprobably better than enduring the pain.’"
      },
      {
        "paragraph": "It hit her that she had demeaned herself."
      },
      {
        "paragraph": "Similarly, Rodney realized that he had demeaned himself too."
      },
      {
        "paragraph": "Whenever she was asleep, he would relieve her burden by settling most of Dani’s food."
      },
      {
        "paragraph": "After that, Freya would pretend to be unaware of it and not mention it. On the other hand, Rodney would\npretend that he had not done anything to her."
      },
      {
        "paragraph": "Little by little, they started to have a tacit understanding between them."
      },
      {
        "paragraph": "When Chester came to visit Freya, he glanced at Rodney with an odd look."
      },
      {
        "paragraph": "“Why are you giving me that look?” Rodney felt awkward."
      },
      {
        "paragraph": "“You seem to be in a good mood, ” Chester said with a mirthless smile, “ I thought you would’ve gone\nmad since you’ve been staying in the hospital looking after the baby and your wife every day."
      },
      {
        "paragraph": "Surprisingly, you look quite content.”"
      },
      {
        "paragraph": "“Hehe. My daughter is my everything. You’ll understand when you have a child in the future. ” Rodney\nkept a straight face while bluffing."
      },
      {
        "paragraph": "It was true that he had felt tired at first. Nevertheless, after having a tacit understanding with Freya, he\nwished he could stay in the ward all the time now."
      },
      {
        "paragraph": "Child: …?"
      },
      {
        "paragraph": "Chester muttered under his breath and darted a look at Dani in his arms. He had to admit that the child\nwas rather cute."
      },
      {
        "paragraph": "His two friends had become fathers before he knew it."
      },
      {
        "paragraph": "He was not interested in starting a family. Nevertheless, he seemed to be at the perfect age to have a\nchild."
      },
      {
        "paragraph": "Having said that, who was qualified to give birth to his child?"
      },
      {
        "paragraph": "“By the way, are you still going to marry Cindy?” Rodney asked curiously. “No.” Chester looked\nindifferent. “Freya can be discharged from the hospital tomorrow. Remember to complete the discharge\nprocedure in the morning.”"
      }
    ]
  },
  {
    "title": "Chapter 1812 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "With that, Chester turned around and walked out of the ward."
      },
      {
        "paragraph": "He just happened to walk past Freya’s ward. He had a lot on his plate recently."
      },
      {
        "paragraph": "Struck by a thought, Rodney promptly went after him. A blush of shame crept up his handsome face. “\nChester, I have something to ask you…”"
      },
      {
        "paragraph": "“Are you trying to ask when you can sleep with Freya?” Chester broke in."
      },
      {
        "paragraph": "“Uh… How did you know?” Rodney touched his nose in embarrassment."
      },
      {
        "paragraph": "“It’s so obvious.” Chester smirked frivolously. “But I think you’re overthinking things at this moment. Are\nyou sure she won’t divorce you?”"
      },
      {
        "paragraph": "“We already have a child together. Why would she do that? I won’t get a divorce.” Rodney bit his tongue\nand shot a look at Chester. “Answer me.”"
      },
      {
        "paragraph": "“Probably two months later.”"
      },
      {
        "paragraph": "“That’s so long.” A look of disappointment washed over Rodney’s face."
      },
      {
        "paragraph": "Chester was at a loss for words. “Is it? I’m guessing you may not even get into bed with her after half a\nyear.”"
      },
      {
        "paragraph": "After shattering his hopes, Chester left mercilessly."
      },
      {
        "paragraph": "Rodney started sulking. He had never thought about such a thing back then, but now that it crossed his\nmind, he felt a strong tingling sensation."
      },
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Freya was discharged from the hospital."
      },
      {
        "paragraph": "To make it easy for her mother to look after her, Freya did not move to the Snow family’s residence.\nRather, she went to the villa where she stayed with Rodney."
      },
      {
        "paragraph": "Mrs. Lynch planned to return to Melbourne after Freya’s confinement period ended."
      },
      {
        "paragraph": "When Freya arrived at the villa, she noticed many new items in her room. Beside her bed was a brand\nnew cradle."
      },
      {
        "paragraph": "She opened the wardrobe to put away her clothes but was dumbstruck to see beautiful haute-couture\nclothes from the latest season."
      },
      {
        "paragraph": "She wondered why her wardrobe was filled with so many beautiful clothes. She randomly took out one of\nthem and looked at the tag, only to discover that it cost over tens of thousands of dollars. What was\nmore, not everyone who was rich could buy these clothes. A lot of the pajamas and undergarments were\nalso from the most recent and expensive collections."
      },
      {
        "paragraph": "Also… they were a bit too sexy. Who picked those?"
      },
      {
        "paragraph": "“Do they look good?” Dressed in a showy pink shirt, Rodney suddenly appeared behind her with\nseductive eyes."
      },
      {
        "paragraph": "Freya was stunned for a moment. Then, her heart palpitated. “You bought… these?”"
      },
      {
        "paragraph": "“Duh.” Rodney casually took one of the clothes. “ They’re much more beautiful and expensive than the\nones you bought in the mall, aren’t they?"
      },
      {
        "paragraph": "Moreover, these designs aren’t available in Australia. You’re the only person in the whole of Australia\nwho has these clothes in your  wardrobe.”"
      },
      {
        "paragraph": "While  talking, his eyes were filled with  smugness."
      },
      {
        "paragraph": "Freya was truly moved. Needless to say, a well— known young lady would love beautiful clothes."
      },
      {
        "paragraph": "Additionally, these clothes were unique."
      },
      {
        "paragraph": "Even so… She did not want Rodney to feel smug. “ Hah. I’m okay with any clothes as long as they look\ngood. Do you think that I’m a materialistic woman who pursues luxurious things? What’s more, why did\nyou buy me such large sizes? You’re looking down on me, huh? Do you think I’ll be this fat forever?”"
      },
      {
        "paragraph": "As she spoke, she grew emotional. She planned to just cause him trouble at first, but later, she became\nconvinced of her own words. She began to glower at Rodney furiously."
      },
      {
        "paragraph": "Rodney was speechless. It finally dawned on him that it was hard to handle women."
      },
      {
        "paragraph": "Really… She was unreasonable."
      },
      {
        "paragraph": "Nevertheless, Rodney certainly would not dare to go head-to-head with her during her confinement\nperiod."
      },
      {
        "paragraph": "“You’re… not fat, ” he said dryly as he retreated, “I think you look quite charismatic and your bosoms\nappear full…”"
      },
      {
        "paragraph": "“Go to hell.” A dirty thought entered her head in spite of herself."
      },
      {
        "paragraph": "Feeling as though she was boiling, she subconsciously turned around and ran away. She did not wish to\nstay with him any longer."
      }
    ]
  },
  {
    "title": "Chapter 1813 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Rodney was sulking."
      },
      {
        "paragraph": "He had praised Freya’s wonderful figure, so she was supposed to be glad about it."
      },
      {
        "paragraph": "Why was she so mad?"
      },
      {
        "paragraph": "It was just too difficult to grasp a woman’s thoughts."
      },
      {
        "paragraph": "Freya gave him attitude the entire afternoon."
      },
      {
        "paragraph": "She was barely nice to him anyway. Feeling used to it, Rodney did not take it to heart. It was only after\nMrs. Lynch started staying with Freya to look after her and their baby did he gradually understand how\nFreya and her mother got along with each other. He could not help but sigh internally."
      },
      {
        "paragraph": "After dinner, Mrs. Lynch took a bowl of chicken soup upstairs for her daughter."
      },
      {
        "paragraph": "When Freya finished the bowl of chicken soup, Mrs. Lynch glanced around the bedroom before she sat\nbeside her. “Have you and Rodney been sleeping in separate rooms?”"
      },
      {
        "paragraph": "“Mom, you know why I got married to Rodney in the first place, don’t you?” Freya frowned. “Before this, I\nplanned on divorcing him right after giving birth.”"
      },
      {
        "paragraph": "“ Is this a mutual decision or your own decision?” Mrs. Lynch asked gently as she fixed her eyes on\nFreya."
      },
      {
        "paragraph": "“Of course, it’s…” Freya suddenly paused. She had said that she wanted to get a divorce, but apparently,\nRodney did not."
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Mrs. Lynch let out a long sigh and said pensively, “ Actually, I always thought that Rodney wasn’t good\nenough before this. He was inconsiderate and irresponsible. He did not know how to take care of his\nwife. Because of him, the baby was born prematurely and I still can’t get past it. Having said that, after\nobserving how both of you are getting along with each other, I think that Rodney isn’t the only one at fault\nfor the way things ended. You’re responsible for this too.”"
      },
      {
        "paragraph": "“Me?” Freya asked in disbelief and felt bitter. “ Mom, you can’t take him for a good man just because of\nhis good performance these few days. He–“"
      },
      {
        "paragraph": "I didn’t judge him based solely on his recent performance. It’s easy to put on an act, isn’t it? I’m not that\nstupid, ” Mrs. Lynch interrupted her. “After observing how you’ve been getting along with Rodney, I\nrealize that you’re mean to him. You only say harsh things to him. Let’s not talk about what has\nhappened recently. Was this also how you both got along with each other before the baby was born?”"
      },
      {
        "paragraph": "Freya froze for a moment. “I don’t even like him. How amiably do you expect me to treat him? He even\nwanted me to abort the baby for the sake of another woman. Also, he has such poor taste that he fell for\na woman  like Sarah. What  a blind man he is?”"
      },
      {
        "paragraph": "“Fine. He’s blind. But as if you’re not.” Mrs. Lynch shook her head. “You liked Patrick before this, but\nwhat did he take you for? He even stood us up when we planned to discuss your marriage at that time.\nYou treated him so well that you even gave up a great job for him after graduating, yet he ended up\ngetting together with his childhood sweetheart and dumping you. What was worse, he claimed that you\nwere narrow-minded and not understanding enough. He also beat you up.”"
      },
      {
        "paragraph": "“Mom, why do you always have to bring up the same old boring issue?” Freya bit her lip. It was her most\nshameful past. Even the mere mention of it made her embarrassed."
      },
      {
        "paragraph": "Mrs. Lynch shook her head. “You think that Rodney is blind, and you look down on him for having loved a\nwoman like Sarah. But what about you? You were blind as well. You wasted your youth because of that"
      },
      {
        "paragraph": "sc*mbag. What gives you the right to hold him in contempt when you’re the same?”"
      }
    ]
  },
  {
    "title": "Chapter 1814 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "“Mom, who on earth is your child? Did Rodney bribe you or something?” Mrs. Lynch’s words caused\nFreya’s face to turn ghastly."
      },
      {
        "paragraph": "“I’m just telling the truth. Don’t you think my words make sense?” Mrs. Lynch asked."
      },
      {
        "paragraph": "“… They do.” Freya had no choice but to agree reluctantly."
      },
      {
        "paragraph": "Mrs. Lynch sighed. “It’s common for young people like you to come across scummy people. You might\nnot know some people well even after knowing them for a long time, so there’s no need to cling to them.\nYou should stop thinking that you’re so  smart and you can look down on him.”"
      },
      {
        "paragraph": "“Mom, I’m not looking down on him. Given that he’s the eldest young master of the Snow family, why\nwould I look down on him? Rather, I’m jealous of him being born under a lucky star.”"
      },
      {
        "paragraph": "“If you don’t look down on him, why are you always so sarcastic when speaking to him?” Mrs. Lynch’s\neyes were sharp. “When both of you quarreled on the day of your delivery, it was indeed his fault for not\nputting up with you during your pregnancy. But come to think of it, it takes two to tango. I reckon it was\nyour harsh words that sparked the conflict.”"
      },
      {
        "paragraph": "“Mom, what do you mean?” Freya felt aggrieved. “ He made me so angry and caused me to give birth to\na premature baby, yet you’re speaking up for him.”"
      },
      {
        "paragraph": "“I’m just commenting on the way you both get along with each other.”"
      },
      {
        "paragraph": "Mrs. Lynch stroked Freya’s long hair. “Having been married for over ten years, I understand your\nsituation, Freya. It’s excusable that you felt oppressed and lost your temper during your pregnancy and\nafter your delivery, but you can’t always be prejudiced against Rodney. Perhaps he was full of\nshortcomings before this, but it’s a fact that he’s the child’s dad. The child will need his protection in the"
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "future. As the child grows, more sacrifices are needed. You can’t be doing everything single -handedly as\nit’ll be too hard for you. Even if you were to divorce in the future, he would have to take responsibility for\nthe child. Whether it’s in the short run or long run, there’s no need for both of you to cut each other’s\nthroats. As a woman, you should have a high EQ.”"
      },
      {
        "paragraph": "Mrs. Lynch looked at Freya helplessly. “Do you"
      },
      {
        "paragraph": "have a high EQ? If you did, you, as the daughter of the Lynch family, wouldn’t have been bullied so\nterribly by Linda back then. You’ re my daughter, but why isn’t your EQ half as high as mine? Look at all\nthe wealthy families in Melbourne. Is any one of them as warm and peaceful as the Lynches?”"
      },
      {
        "paragraph": "Freya rolled her eyes. “Mom, you were just lucky enough to meet a good man like Dad.”"
      },
      {
        "paragraph": "“There’s hardly any man in the world who’s considerate, gentle, family-centered, responsible, handsome,\nand good at making money. When your dad was younger, he rarely returned home and was very willful\ntoo. Similar to other married couples living together, we gradually changed to complement each other. If I\nhad kept making sarcastic comments like you, I might’ve gotten divorced countless times.”"
      },
      {
        "paragraph": "Freya rarely heard her parents mention things that happened to them when they were younger. She had\nalways been keen on having a marriage like her parents’."
      },
      {
        "paragraph": "“Freya, perhaps the way you get along with Rodney has been wrong right from the beginning. From the\nmoment you met him, you guys have had a bias against each other. Whether you guys will just be\nfriends or remain a married couple in the future, you should have a peaceful talk with each other. Let’s\nput marriage aside. Smart people will hide their aggression regardless of whether they’re at work or\nsocial functions. It’s not necessary to show it to others all the time.”"
      },
      {
        "paragraph": "Mrs. Lynch pointed to Freya’s heart. Freya shuddered slightly."
      },
      {
        "paragraph": "Mrs. Lynch was a smart woman. Freya was under no illusions that her mother was so good at carrying\nherself during social functions in Melbourne that no one could find fault with her. It was because of her\nmother’s guidance that she became so brilliant."
      },
      {
        "paragraph": "Now that her mother had stepped into a large circle in Canberra, she could still mingle with people like\nWendy and the prime minister’s wife superbly."
      }
    ]
  },
  {
    "title": "Chapter 1815 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "All of a sudden, Freya came to realize her flaws."
      },
      {
        "paragraph": "Indeed, she had an average EQ. She was nowhere near as good as Catherine either."
      },
      {
        "paragraph": "After Mrs. Lynch left, she had a video call with Catherine amid her distress."
      },
      {
        "paragraph": "It was still daytime over there. Dressed in a red maxi dress, Catherine was sitting on the grass, enjoying\nsome red wine and breakfast. Behind her was a huge green winery and chateau."
      },
      {
        "paragraph": "Freya was dumbfounded. “Damn, where is that place? Why do I feel that we’re not on the same planet?\nYou look just like… a rich woman in the Middle Ages. The only thing you lack is a kept man.”"
      },
      {
        "paragraph": "“Ahem…” Her words nearly made Catherine choke. “What an exaggeration.”"
      },
      {
        "paragraph": "“It’s true. ” Freya admired her life. She should not have given Catherine a video call because comparing\nher situation to Catherine’s would only drive her to despair."
      },
      {
        "paragraph": "“I’m at the winery that belongs to Shaun’s dad.”"
      },
      {
        "paragraph": "Catherine adjusted the angle of her phone camera to focus on Shaun and the two kids playing on the\ngrass. “Suzie and Lucas like this place. They’re having lots of fun here.”"
      },
      {
        "paragraph": "“It suddenly hit me that it was really wise of you to make peace with Shaun. Not only is he helping you to\nlook after the kids but you can also stay in a chateau that has a winery. What a carefree life you’re\nleading.” Freya sighed."
      },
      {
        "paragraph": "“Mm.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Catherine nodded and smiled sweetly. “ I can now enslave Shaun all I want without feeling any sense of\nburden nor guilt.”"
      },
      {
        "paragraph": "“Cathy, I realized that you have a very high EQ. My EQ is low.”"
      },
      {
        "paragraph": "Freya told Catherine what her mother had said to her."
      },
      {
        "paragraph": "What Freya said did not catch Catherine by surprise. In fact, Lynch Corporation was insignificant in\nMelbourne ten years ago. It was after Freya’s father married her mother that the company slowly rose to\nprominence. Of course, her father’s competence was unquestionable, but there must be a successful\nwoman behind every successful man."
      },
      {
        "paragraph": "“Freya, I think your mom is absolutely right. Now that you and Rodney have a child together, it’s illogical\nto have a sour relationship with him."
      },
      {
        "paragraph": "What’s more, you can’t possibly stay home forever without a job. Didn’t you say that you want to set up a\nbusiness in the future? Making connections is very crucial at this point.”"
      },
      {
        "paragraph": "With a smile, Catherine continued, “Actually, you and Rodney share a common aspect, which is that both\nof you speak harshly. It’s exactly why both of you always quarrel. Sometimes, the person you get along\nwith is just like the reflection you see in the mirror. The person will treat you in the same way as you treat\nyour reflection.”"
      },
      {
        "paragraph": "Freya grasped her point. Sure enough, Catherine was right."
      },
      {
        "paragraph": "Rodney was basically Freya’s reflection, was he not? After hanging up, Freya sank into contemplation."
      },
      {
        "paragraph": "It suddenly struck her that she did not seem to have learned from her mistakes despite having gone\nthrough so much."
      },
      {
        "paragraph": "Amid her messy thoughts, the door to her room was pushed open out of the blue."
      },
      {
        "paragraph": "Rodney came in hugging his pillow."
      },
      {
        "paragraph": "As soon as Freya recalled her mother’s reminder, she told herself to be more emotionally intelligent.\nHowever, the minute Rodney placed his pillow on her bed, she could not help but ask, “What are you\nplanning to do?”"
      },
      {
        "paragraph": "“Of course, I’m going to sleep here.” Rodney placed his pillow beside hers. “I have to look after you and\nmy child at night. Since this is the only bed in the room, I have no choice but to squeeze in with you.”"
      },
      {
        "paragraph": "No choice…"
      },
      {
        "paragraph": "Freya took a deep breath."
      },
      {
        "paragraph": "Rodney, this b*stard, had always behaved this way. As a result, it was inevitable that she ended up in\nthis state."
      },
      {
        "paragraph": "Nevertheless, she could not behave as she did back then."
      },
      {
        "paragraph": "She could not get hysterical."
      },
      {
        "paragraph": "She wanted to be a woman with a high EQ."
      },
      {
        "paragraph": "After waiting for some time, Rodney thought that Freya would lose her temper and hit him with the pillow.\nTherefore, he had mentally prepared himself to be hit. Surprisingly, Freya only fixed her eyes on him\nimpassively and spoke coldly, “You don’t have to push yourself so hard. I can have Aunty Marie help me\nout at night.”"
      },
      {
        "paragraph": "”No way. I have to take care of my child on my own. I can’t miss any moment spent with Dani, ” Rodney\nresponded shamelessly."
      }
    ]
  },
  {
    "title": "Chapter 1816 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "A discreet smile spread across Freya’s face. “Well, it’s not good to strain yourself.”"
      },
      {
        "paragraph": "“I don’t mind, ” Rodney answered with a grin."
      },
      {
        "paragraph": "“But I don’t want to strain myself, ” Freya said indifferently, “ I don’t have the habit of sharing the same\nbed with another man. You can take Dani with you over there. When she’s hungry, you can come and\nlook for me again.”"
      },
      {
        "paragraph": "“No way. Dani won’t be at ease unless she’s by your side because of your motherly scent.” Rodney was\ndead set against leaving the bedroom. This was a chance for him to sleep with Freya more often in the\nfuture. Only a fool would let go of such a chance."
      },
      {
        "paragraph": "Upon noticing her resistance, Rodney raised his brows. “Don’t worry, I won’t touch you considering your\ncondition now. I’m not a beast anyway. What’s more, the doctor said that Dani is extremely insecure as\nshe was just born. The environment here is also new to her, so it’ll be better for us to accompany her\ntonight. As her mother, you won’t be so heartless, right?”"
      },
      {
        "paragraph": "With that, he stared fixedly at her as though she would be considered a heartless mother if she spoke\nany further."
      },
      {
        "paragraph": "Freya was at a loss for words."
      },
      {
        "paragraph": "What else could she say? She would go mad sooner or later."
      },
      {
        "paragraph": "“I’m going to bathe. ” Upon realizing that she was keeping silent, Rodney headed to her bathroom\nsmugly."
      },
      {
        "paragraph": "Freya flew into a rage. “You can bathe in your own bathroom.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "“I’m too lazy to go there. ” After Rodney finished speaking, he swaggered into her bathroom."
      },
      {
        "paragraph": "It angered Freya to hear the splashing sounds in her bathroom."
      },
      {
        "paragraph": "Shortly after, the sitter placed a set of clothes and a towel at the door before walking out."
      },
      {
        "paragraph": "Freya’s mouth parted as she was about to say something. Nevertheless, Dani should be hungry at this\nmoment."
      },
      {
        "paragraph": "She was not bothered about him."
      },
      {
        "paragraph": "A few minutes later, the door of the bathroom was opened."
      },
      {
        "paragraph": "She looked up, only to see Rodney walking out naked. He nonchalantly took the pajamas and towel at\nthe door before he entered the bathroom again."
      },
      {
        "paragraph": "Freya blinked, feeling dumbfounded. Just then, something crossed her mind."
      },
      {
        "paragraph": "There was nothing else except the image of Rodney naked just now."
      },
      {
        "paragraph": "Freya felt a sense of incredulity."
      },
      {
        "paragraph": "Before she could come back to her senses, Rodney walked out in his black underwear after wiping his\nbody. His hair was wet, and water droplets were trickling down his chest. Below his chest were his\ndefined abs."
      },
      {
        "paragraph": "She did not expect this flashy man to have abs."
      },
      {
        "paragraph": "Furthermore, now that he had bathed, he looked extremely seductive."
      },
      {
        "paragraph": "Despite his disheveled hair, he was even more good- looking than her. It was really… Unreasonable."
      },
      {
        "paragraph": "“What? I have a great physique, don’t I?” Rodney walked up to her with a grin."
      },
      {
        "paragraph": "Freya lost her temper. “Are you out of your mind? Why aren’t you wearing your clothes?”"
      },
      {
        "paragraph": "“I’m going to wear my clothes out here. It was sweltering in the bathroom.” As Rodney spoke, he put on\nhis pajamas."
      },
      {
        "paragraph": "Soon, he appeared more decent."
      },
      {
        "paragraph": "Freya took a deep breath. “Can you stop using my bathroom? Even if you bathe here, can you wear your\nclothes before coming out?”"
      },
      {
        "paragraph": "“Why?” Rodney shrugged. “Why do I have to care so much at home? Your mom won’t come in anyway.”"
      }
    ]
  },
  {
    "title": "Chapter 1817 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "“But you’re such an eyesore to me.” Freya’s chest heaved."
      },
      {
        "paragraph": "If Rodney planned on seducing her with his wonderful physique, he could dream on. In the face of a\nb*stard like him, she surely would not be sexually aroused."
      },
      {
        "paragraph": "“Do I have a bad physique? Why am I an eyesore?” Rodney felt humiliated."
      },
      {
        "paragraph": "After all, he used to work out and swim every day. He had always been confident in his physique."
      },
      {
        "paragraph": "“You look unsightly from head to toe.” The words escaped Freya’s mouth."
      },
      {
        "paragraph": "As soon as she finished speaking, silence befell the bedroom. The atmosphere became tense."
      },
      {
        "paragraph": "Rodney’s face darkened. He admitted that he had initially planned on seducing her with his good looks.\nHowever, not only did he fail but he also felt utterly humiliated."
      },
      {
        "paragraph": "He was really infuriated."
      },
      {
        "paragraph": "As a man, was he that lousy? He conceded that he had wronged her back then, but he had been striving\nto change his ways."
      },
      {
        "paragraph": "He wanted to be a good husband and father. Nevertheless, his efforts seemed futile  regardless. It did\nnot work on Sarah previously nor on Freya at this point."
      },
      {
        "paragraph": "Frustration began to surge inside Rodney. Seemingly, his life was a failure."
      },
      {
        "paragraph": "Keeping an ashen face, he stayed quiet."
      },
      {
        "paragraph": "Once Freya was done speaking, her heart did a flip."
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Earlier, she had even contemplated improving her relationship with Rodney and being more emotionally\nintelligent. Little did she expect that their relationship would sour so soon."
      },
      {
        "paragraph": "It seemed… that she had gone a bit too far with… her words just now?"
      },
      {
        "paragraph": "“Fine. I’ll take note of it and make sure I won’t be an eyesore to you.”"
      },
      {
        "paragraph": "With that, Rodney took his clothes and strode away."
      },
      {
        "paragraph": "Freya’s lips parted. A while later, she patted her forehead."
      },
      {
        "paragraph": "Oh well, her EQ was probably so low that it could not be helped."
      },
      {
        "paragraph": "Not only did she bring shame on her mother but also on Catherine."
      },
      {
        "paragraph": "After going downstairs, Rodney drank a big glass of cold water. He had a strong urge to ask Chester out\nfor a drink, but he suppressed it. Given that things were different now, he could not behave like how he\npreviously did for his child’s sake."
      },
      {
        "paragraph": "After some time, he heard Dani bawling from upstairs. He reluctantly went to the bedroom."
      },
      {
        "paragraph": "Dani had pooped again."
      },
      {
        "paragraph": "After carrying her out of the cradle, Rodney"
      },
      {
        "paragraph": "skillfully cleaned her bottom with the sitter. Then, he gently put her to sleep before transferring her to the\nmiddle of the bed."
      },
      {
        "paragraph": "Rodney and Freya slept on opposite sides of the bed without touching each other."
      },
      {
        "paragraph": "Thinking that she had gone a bit too far just now, Freya did not hurl insults at him nor chase him away."
      },
      {
        "paragraph": "Amid her sleep, she heard Dani crying in the middle of the night. She had no choice but to carry Dani\nand breastfeed her."
      }
    ]
  },
  {
    "title": "Chapter 1818 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "When Freya was feeding Dani, Rodney lay on his side."
      },
      {
        "paragraph": "After breastfeeding, Dani was still awake and she refused to lie on the bed. Therefore, Rodney carried\nher and paced up and down the bedroom."
      },
      {
        "paragraph": "At first, Freya planned to go to bed only after Dani was asleep. However, she could not resist her fatigue\nand fell asleep first."
      },
      {
        "paragraph": "When she woke up the next day, it was already 7:00 a.m."
      },
      {
        "paragraph": "She glanced at Rodney, who was sleeping with Dani in his embrace, on the other side of the bed. The\ntwo of them were sleeping soundly. Rodney was even flashing a sweet smile, revealing his two dimples.\nIt made Freya wonder what he was dreaming about."
      },
      {
        "paragraph": "Her heart instantly melted."
      },
      {
        "paragraph": "Then, she dragged herself down the stairs without bothering them."
      },
      {
        "paragraph": "The sitter had prepared a delicious confinement meal for her. Not only was the meal nutritious but there\nwere also a variety of dishes."
      },
      {
        "paragraph": "Mrs. Lynch walked out and asked, “Where’s Dani and Rodney? Are they still sleeping?”"
      },
      {
        "paragraph": "Before Freya could answer, the sitter sighed and said, “Little Miss only fell asleep at six in the morning.\nWhen I was about to go out to buy groceries, I saw Young Master Snow carrying her while pacing up and\ndown the living room.”"
      },
      {
        "paragraph": "Freya was stunned. She remembered that it was 3:00 a.m. when she woke up last night. Did it mean that\nDani did not fall asleep soon after that?"
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "“What a night owl Dani is. It’ll be troublesome if she sleeps this late every day.” Mrs. Lynch sighed. “ Let’s\nnot disturb the two of them. You can set aside some food for Rodney later.”"
      },
      {
        "paragraph": "Freya said, “Dani wasn’t like this in the hospital two days ago. She slept quite well.”"
      },
      {
        "paragraph": "“Babies usually sleep more the first few days after they’re born. After getting adapted to the environment\nbit by bit, they’ll start making a fuss. They say babies love to sleep during their mothers’ confinement\nperiod. But from what I’ve observed, most babies don’t really sleep at night.”"
      },
      {
        "paragraph": "After Mrs. Lynch finished speaking, she stared at Freya with a long face. “I reckon it’s because you"
      },
      {
        "paragraph": "slept late when you were pregnant. Dani’s biological clock is probably all messed up.”"
      },
      {
        "paragraph": "Freya was ashamed. It was true that she did sleep quite late at times. Although Rodney was strict with\nher and always urged her to go to bed before 9:30 p.m., she would not listen to him. After returning to\nher room, she would lock the door and secretly play games on her phone. Rodney would sometimes go\nto the office during the day. No matter how busy he was at work, he would get off work at 5:30 p.m. sharp\nto accompany his child at home."
      },
      {
        "paragraph": "Nevertheless, Dani had ultimately become a night owl. She always woke up around 2:00 or 3:00 a.m.\nand played until 5:00 or 6:00 a.m. Only then was she willing to sleep."
      },
      {
        "paragraph": "After feeding Dani, Freya sometimes watched Rodney play with Dani in the middle of the night. No\nmatter how hard-hearted she was, she could not help but say, “Why don’t… you take a nap? I’ll carry\nher.”"
      },
      {
        "paragraph": "“No need. My mom said you’re weak after giving birth to Dani. Carrying her will hurt your arm. You can\njust rest and sleep.”"
      },
      {
        "paragraph": "Once Rodney was done speaking nonchalantly, he carried Dani downstairs to avoid disturbing Freya."
      },
      {
        "paragraph": "Lying on the bed alone, Freya had difficulty falling asleep."
      },
      {
        "paragraph": "After all, she was not that cold-hearted. Given that Rodney had to work during the day and take care of\nDani during the night, she was aware of how taxing it was for him. In fact, she also knew that Rodney\ncould have asked the sitter to do certain tasks."
      },
      {
        "paragraph": "However, he would settle the child’s matters on his own whenever he was at home."
      },
      {
        "paragraph": "Freya could not help but text Catherine on WhatsApp. It was still daytime in Country Y."
      },
      {
        "paragraph": "Catherine replied: [I admire you so much. My confinement period wasn’t as great as yours. I had to do\neverything myself. I hardly got to rest at night.]"
      },
      {
        "paragraph": "Freya: [Enough, you rich woman. You’re currently living in a chateau. I’ve never even lived in a chateau\nmy whole life.]"
      },
      {
        "paragraph": "Catherine: [Haha. You should be content. You know how much I suffered when I gave birth to the twins,\ndon’t you? Although I live well now, you’re aware of the tough times I went through back then. If it weren’t\nfor your help, I might’ve gone mad.]"
      },
      {
        "paragraph": "Freya recalled those days in spite of herself. As an onlooker, she had taken great pity on Catherine"
      },
      {
        "paragraph": "who was suffering so much at that time."
      },
      {
        "paragraph": "At the thought of it, Freya felt that she was indeed a lot luckier than Catherine during her confinement\nperiod."
      },
      {
        "paragraph": "In the blink of an eye, Dani was one month old. The Snow family held a grand celebration for her."
      },
      {
        "paragraph": "Dani might be young, but Jason was so generous and reserved the top floor of Zenith Hotel to hold a\ngrand banquet for his granddaughter."
      },
      {
        "paragraph": "Freya, the mother of the main character that night, was finally done with confinement. She wanted to be\ndressed to the nines for the occasion. Sadly, the moment she opened her wardrobe, it hit her that she\nhad eaten so well during her confinement period in the past one month that she… was fatter now."
      }
    ]
  },
  {
    "title": "Chapter 1819 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "In the end, Freya chose to wear a branded black maxi dress for the occasion."
      },
      {
        "paragraph": "Of course, the dress was unable to highlight the S- shaped curves she used to have, but it could at least\nhide her rolls of fat."
      },
      {
        "paragraph": "That night, Freya and Rodney attended the banquet together while carrying Dani."
      },
      {
        "paragraph": "Rodney wore an apricot-colored suit with a shirt, vest, tie, and coat. Coupled with his handsome face, he\nlooked like a star walking on the red carpet."
      },
      {
        "paragraph": "Freya felt sad for herself. She was probably the first woman who paled into insignificance when\ncompared to her other half."
      },
      {
        "paragraph": "The minute they walked in, she saw many young women fixing their sparkling eyes on Rodney."
      },
      {
        "paragraph": "Those women then glanced at Freya, their eyes carrying an inexpressible feeling…"
      },
      {
        "paragraph": "Freya was at a loss for words."
      },
      {
        "paragraph": "Why did they have to go so far? After all, she used to be a ravishingly beautiful woman as well."
      },
      {
        "paragraph": "She swore that she had to start going on a diet from tomorrow onward. She must  strive to get her\nperfect body back within the next three months."
      },
      {
        "paragraph": "“Freya…”"
      },
      {
        "paragraph": "Catherine elegantly walked up to her in a champagne -colored gown. After not seeing her for a month,\nshe realized that Freya had become prettier. With the lights shining on her shoulders and collarbone,\nFreya looked pretty and stunning like a vixen."
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Following closely beside her was Shaun. He was dressed in a dark suit, and the gorgeous lights shone\non his flawless features. There were a pair of fraternal twins by their side. Suzie was wearing a princess\ndress while Lucas was wearing a suit. The four of them were more striking than anyone else."
      },
      {
        "paragraph": "Gazing at them, the guests began to whisper."
      },
      {
        "paragraph": "“ Shaun and Catherine’s children are really good- looking. They make me feel like giving birth.”"
      },
      {
        "paragraph": "“Forget it. Do you think you can give birth to fraternal twins as you please? What’s more, our looks can’t\ncompare to Catherine and Shaun’s.”"
      },
      {
        "paragraph": "“By the way, the two of them remarried, didn’t they? I heard Wesley has been left high and dry.”"
      },
      {
        "paragraph": "“I’m not sure, but it seems that the two of them no longer work. They always hang out together.”"
      },
      {
        "paragraph": "“Hey, Catherine’s mom is an oil magnate. I heard that Shaun’s dad, Brennan Lowe, is the chairman of\nGarson Corporation, which is one of the top loo transnational companies in the world. Even if Catherine\nand Shaun don’t work, they have money to burn.”"
      },
      {
        "paragraph": "“Oh, how lucky of them. Rumor has it that their combined wealth can impact a country. Not only do they\nhave a chateau, yacht, private jet, and a private island, but they also have a private winery."
      },
      {
        "paragraph": "Compared to them, we’re insignificant.”"
      },
      {
        "paragraph": "Those words left Catherine speechless."
      },
      {
        "paragraph": "What did Sheryl’s wealth have to do with her? In truth, she was not that wealthy."
      },
      {
        "paragraph": "The yacht and chateau were not hers as they belonged to Shaun’s dad."
      },
      {
        "paragraph": "As for the private island, it was Matthew, that b*stard, who insisted on giving it to her. He had many\nprivate islands under his name but did not manage to visit each of them."
      },
      {
        "paragraph": "Of course, Catherine rejected his offer. Hence,"
      },
      {
        "paragraph": "Matthew got Minister Mead to transfer the ownership of the private island to Suzie and Lucas instead. As\na result, the news was exposed."
      },
      {
        "paragraph": "“Cathy, you didn’t even tell me that you own a private island now. Tsk. Take me there someday. ” Freya\nwalked toward her and winked with a grin."
      },
      {
        "paragraph": "“Forget it. It was an offer from Matthew, but I’m not going to accept it. I’m trying to avoid being involved\nwith Sheryl as much as possible, ” Catherine replied coldly."
      },
      {
        "paragraph": "“But Sheryl has publicly acknowledged you as her daughter. Also, when Titus was interviewed by\nreporters from all over the world, he said that he would treat you like his own daughter and he thinks\nhighly of you.”"
      },
      {
        "paragraph": "Freya smiled as she darted a look at Shaun beside her. “Young Master Hill, there are quite many rich\nyoung men visiting the Snows lately. They’ve been asking me to introduce Cathy to them. With Cathy’s\ncurrent status, I suppose it’s a good idea to make them her kept men even if they don’t deserve to marry\nher.”"
      },
      {
        "paragraph": "Shaun’s face darkened. “She has me, and that’s more than enough for her. If she has a few more kept\nmen, she’ll drop dead.”"
      }
    ]
  },
  {
    "title": "Chapter 1820 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "The sudden flirting left Catherine feeling dazed. By the time she came to her senses, she wished the\nground would swallow her up."
      },
      {
        "paragraph": "“Great job, Shaun.” Rodney threw an admiring look at Shaun."
      },
      {
        "paragraph": "“What are you guys talking about?” Lucas and Suzie looked confused."
      },
      {
        "paragraph": "Catherine’s pretty face instantly flushed. “Nothing much. Go and eat your food.”"
      },
      {
        "paragraph": "Upon hearing her words, Suzie ran off while Lucas shook his head helplessly. He had no choice but to\nfollow Suzie to look after her."
      },
      {
        "paragraph": "“Cathy, I noticed that you and Shaun have become fairer after you guys spent one month in Country Y.\nYour fair skin is glowing.” Freya sighed."
      },
      {
        "paragraph": "“ It’s probably because I was drinking milk every day there,” Catherine said with a smile, “Let’s chat over\nthere.”"
      },
      {
        "paragraph": "After the two women walked away, Rodney hit Shaun’s chest in admiration. “Shaun, tell me how you did\nit.”"
      },
      {
        "paragraph": "“… What are you saying?” Shaun was baffled."
      },
      {
        "paragraph": "Rodney approached him. “Didn’t you break up with Catherine before this? Yet you got her into bed so\nsoon. I didn’t expect you to be so clever after the break-up.”"
      },
      {
        "paragraph": "Shaun was speechless. In fact, he had already got Catherine into bed with him one month ago."
      },
      {
        "paragraph": "If he revealed it, Rodney would be even more jealous of him."
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "However, he did not feel like exposing the matter since it was between Catherine and him. “Judging from\nyour admiration for me, I wonder how long it’s been since you last got your wife into bed?”"
      },
      {
        "paragraph": "“ It’s not a matter of time. Actually, he has never gotten into bed with Freya.”"
      },
      {
        "paragraph": "Chester’s voice sounded out of the blue as he walked over."
      },
      {
        "paragraph": "Chester, who was wearing an elegant black suit, walked up to Shaun and Rodney."
      },
      {
        "paragraph": "“Shaun, you lost your memory. You might not remember that he has only done it once, and that was\nwhen he got Freya pregnant.”"
      },
      {
        "paragraph": "Rodney’s face darkened. “Chester, you’re going a bit too far.”"
      },
      {
        "paragraph": "Chester patted Rodney gently on the shoulder. “To be honest, you’re really not capable of dealing with\nwomen, Rodney.”"
      },
      {
        "paragraph": "“Do you think that I wish for this?” Rodney gritted his teeth and said in a deep voice, “The other day, I did\nwhat you told me by deliberately exposing my body to her after bathing. In the end, she claimed that my\nbody was an eyesore. It hurt my dignity. ”"
      },
      {
        "paragraph": "“Hah. Don’t you know that women always say things they don’t actually mean?” Chester looked\nsideways at Rodney. “What’s more, I’m sure Freya always says things that are different from how she\nactually feels, judging from her temper.”"
      },
      {
        "paragraph": "Rodney froze. Was it really so?"
      },
      {
        "paragraph": "“It’s true that women love saying things they don’t actually mean.”"
      },
      {
        "paragraph": "Shaun curled his lips. He was most experienced in this area."
      },
      {
        "paragraph": "It was similar to whenever Catherine said no. As long as he remained shameless, she would ultimately\nbe passionate."
      },
      {
        "paragraph": "Not far away, Freya shot a look at those men and asked, “Cathy, when are you planning to remarry\nShaun?”"
      },
      {
        "paragraph": "Catherine was stunned before she smiled faintly. “ I’ve never planned on remarrying. I think everything is\ngood as it is now.”"
      },
      {
        "paragraph": "“But will Shaun agree to maintain such a relationship with you for long?” Freya was surprised. Catherine\nfrowned.“ I’m not sure. Given that my previous two marriages have failed, I’m terrified of getting married\nnow.”"
      }
    ]
  },
  {
    "title": "Chapter 1821 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "“Hehe. Are you sure Shaun is willing to stay with you without a proper title?” Freya asked gloatingly."
      },
      {
        "paragraph": "Catherine sighed. “Furthermore,  I think this kind o f life makes me feel more at ease. What about you?\nHow has Rodney been doing this month? I noticed that he has dark circles and has also slimmed  down\n“Really?” Freya was startled."
      },
      {
        "paragraph": "“Can’t you tell the changes? They’re so obvious.” Catherine threw a strange glance at her. “Forget it.\nYou’ve been living with him every day, so you’re used to seeing him. That’s probably why you can’t tell.”"
      },
      {
        "paragraph": "Freya was speechless. A complicated feeling crept into her heart."
      },
      {
        "paragraph": "Indeed, Rodney had slimmed down. It seemed he had not been able to sleep well this month."
      },
      {
        "paragraph": "“Having said that, you’ve done quite a great job at torturing him,” Catherine said with a grin, “If you"
      },
      {
        "paragraph": "hadn’t made him look after the child, he wouldn’t have known how tough it is to raise a child.”"
      },
      {
        "paragraph": "After hearing those words, Freya suppressed the twinge of guilt that she felt."
      },
      {
        "paragraph": "As a woman, she had to be hard-hearted. Otherwise, no man would sympathize with her."
      },
      {
        "paragraph": "The celebration of Dani’s first month since birth officially began at 12:00 p.m."
      },
      {
        "paragraph": "As the main characters of the occasion, Rodney brought Freya and Dani to the stage and gave a\nspeech."
      },
      {
        "paragraph": "Someone snapped a photo of them and shared it online. Of course, the child’s face had been pixelated."
      },
      {
        "paragraph": "A mass of netizens had seen the photo."
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "[What a blessed family. The baby is so adorable.]"
      },
      {
        "paragraph": "[Why do I think that the prime minister’s goddaughter and Young Master Snow appear close on the\noutside but actually aren’t? Look at how they keep a distance from each other when they stand. They\nlook distant.]"
      },
      {
        "paragraph": "[Some people guess that the two of them had a shotgun marriage. Besides, Young Master Snow hung\nout with another woman a lot during their engagement.]"
      },
      {
        "paragraph": "[What the previous commenter said rang a bell with me. That woman was Sarah Neeson, and she’s\nShaun’s ex-lover. I think Young Master Snow had a crush on her for a long time. He proposed to her\nearlier, didn’t he? But they broke up after that. I reckon it was because the Snow family rejected Sarah.]"
      },
      {
        "paragraph": "[What a complicated romance story of a wealthy family. But now that he’s married, he should treat his\nwife and child well.]"
      },
      {
        "paragraph": "In a distant four-star hotel…"
      },
      {
        "paragraph": "Sarah turned on her laptop and stared at Rodney’s family photo."
      },
      {
        "paragraph": "Her eyes flashed with intense jealousy."
      },
      {
        "paragraph": "Currently, the Snow family was the top political family in Australia. Now that Nathan’s position had been\nconsolidated, Snow Corporation was also doing well. Rodney’s status was different from before too."
      },
      {
        "paragraph": "Initially, everything was supposed to belong to Sarah."
      },
      {
        "paragraph": "She should be the one enjoying this honor."
      },
      {
        "paragraph": "Nevertheless, Freya, that b*tch, gained it effortlessly."
      },
      {
        "paragraph": "Even so, it proved that Sarah had made the right decision by asking Rodney to return to the Snow\nfamily’s house when she left him back then."
      },
      {
        "paragraph": "She had lost Wesley’s backing and could not afford to stay in a five-star hotel. The only means for her to\nmake a comeback was to hold on to Rodney."
      },
      {
        "paragraph": "Although she was a well-known psychologist, Shaun’s people had been looking for her everywhere. She\nwas too afraid to go around treating patients. Now that she barely had any money left, all she could do\nwas to hide like a rat. She did not want to lead such a life anymore."
      },
      {
        "paragraph": "Sarah’s avaricious gaze was fixed on Rodney’s face."
      }
    ]
  },
  {
    "title": "Chapter 1822 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Melbourne."
      },
      {
        "paragraph": "Zenith Hotel."
      },
      {
        "paragraph": "Freya was halfway through her meal when Dani got hungry. The baby would not say anything even when\nshe was hungry. She only knew how to cry."
      },
      {
        "paragraph": "Freya could only carry Dani to a private room to feed her."
      },
      {
        "paragraph": "After feeding Dani, she heard a few elite ladies discussing just as she came out. They were standing in\nfront of the floor-to-ceiling windows ahead of her."
      },
      {
        "paragraph": "“Did you guys see the picture on the internet?”"
      },
      {
        "paragraph": "“Are you talking about the picture of Young Master Snow’s family? I saw it too. The netizens are saying\nthat Freya has gotten fatter.”"
      },
      {
        "paragraph": "“She really did get fatter. Look at the black dress she’s wearing today. Does she think we can’t see that\nshe has become fat if she wore a loose dress?"
      },
      {
        "paragraph": "Moreover, black doesn’t suit her at all. It looks old- fashioned.”"
      },
      {
        "paragraph": "“There’s no helping it. Even though the prime minister has acknowledged her as his goddaughter, it can’t\nchange  the fact that she’s from a small place.”"
      },
      {
        "paragraph": "“Ah, who doesn’t know that  the Snow family had no choice but to have the prime minister acknowledge\nher as his goddaughter because she got pregnant back then and Rodney didn’t want to marry her?”"
      },
      {
        "paragraph": "Freya’s hands that were carrying Dani stiffened."
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "When she headed out that morning, she really minded her figure a lot. She did not expect that it would\nbe discussed among others when she was outside."
      },
      {
        "paragraph": "During the celebration earlier, those elite ladies were flattering her while surrounding her."
      },
      {
        "paragraph": "However, they were gossiping about her like that behind her back. Those elite ladies looked down on\nher."
      },
      {
        "paragraph": "Freya’s lips lifted into a sarcastic smile."
      },
      {
        "paragraph": "Right, what those people said was the truth. Even though she was being buttered up and flattered, it\ncould not change the fact that she came from a small place."
      },
      {
        "paragraph": "She felt sour."
      },
      {
        "paragraph": "At that time, she suddenly saw Rodney walking over from the other side of the corridor. His handsome\nface was filled with iciness. “Enough. Although my wife is from a small place, she’s way better than you\nall, the wealthy elite ladies from Canberra. At least she doesn’t have bad manners like you guys,"
      },
      {
        "paragraph": "gossiping about other people behind their backs. ”"
      },
      {
        "paragraph": "Rodney had unexpectedly shown up."
      },
      {
        "paragraph": "The faces of those elite ladies were flushed red from being told off. They could not accept it."
      },
      {
        "paragraph": "One of the elite ladies retorted, “Why? She’s one of the main characters tonight. Can’t we even talk\nabout her? Besides, I didn’t say anything bad about her. All that we said were facts.”"
      },
      {
        "paragraph": "“That’s right, Young Master Snow. Even if your identity is special, you can’t be unreasonable.”"
      },
      {
        "paragraph": "Rodney’s gaze swept across the elite ladies’ faces. They were from wealthy families that Wendy had\npraised before. However, these elite ladies were so pretentious. He even thought they could not even\ncompare to Freya."
      },
      {
        "paragraph": "That was right. Although Freya’s words were unpleasant to hear sometimes, she was not pretentious.\nShe was straightforward with her words."
      },
      {
        "paragraph": "“Is this the manners that you all, the elite ladies of Canberra, have?”"
      },
      {
        "paragraph": "Rodney sneered. “You’re embarrassing the people of Canberra. I heard that you all previously studied\nabroad. However, you don’t even have the most basic manners. Let me remind you of this. You’re all\nwomen too. You’ll get married, have children, and become fatter due to pregnancy. As women, shouldn’t\nyou all think about  things from a woman’s perspective? Don’t you know that many women are urging\nothers not to body shame a pregnant woman and be respectful of mothers?”"
      },
      {
        "paragraph": "Those elite ladies’ faces were burning hot from being told off."
      },
      {
        "paragraph": "Nevertheless, one of them was still unwilling to back down. She said, “Even if we get pregnant, we’ll take\ncare of our figure.”"
      },
      {
        "paragraph": "“Ha.”"
      },
      {
        "paragraph": "There was a mocking expression on Rodney’s face. “ If you’re preparing to get married in the future, I’ll\nrelay this sentence to your future in-laws and husbands. I can guarantee that no men will want to accept\nyou. Is pregnancy the time for you to take care of your figure? That’s stupid. Are you an idiot that you’ll\njeopardize the child in your belly for your figure?”"
      }
    ]
  },
  {
    "title": "Chapter 1823 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "“You…”"
      },
      {
        "paragraph": "That elite lady was exasperated. The remaining few elite ladies felt the anger radiating from Rodney.\nThey did not dare to say a word."
      },
      {
        "paragraph": "After a while, an elite lady in a pink dress said,“ Young Master Snow, we mean no harm. We were just\nchatting. Look, we often used to hang out with each other in the past. Give us a way out, okay?”"
      },
      {
        "paragraph": "“You’re asking me to let you off, but did you show me any respect when you were gossiping about my\nwife behind her back?”"
      },
      {
        "paragraph": "Rodney let out a cold hmph. “Besides, I didn’t hang out with you guys all that often. We just met a few\ntimes during banquets, chatted a little, and played a few rounds of games. That was many years ago.”"
      },
      {
        "paragraph": "“Young Master Rodney, don’t be too much.”"
      },
      {
        "paragraph": "It was as if the elite lady in pink was hit in the face by her own words. It was very awkward."
      },
      {
        "paragraph": "“So what if I’m too much? Who do you think you guys are? However, since you think it’s too much,"
      },
      {
        "paragraph": "none of you here have to attend any banquets held by the Snow family in the future.”"
      },
      {
        "paragraph": "Rodney left in long strides after he spoke. Those elite ladies were dumbfounded."
      },
      {
        "paragraph": "Countless wealthy families in Australia were fighting to attend banquets held by the Snow family. Who\nknew that they would get themselves blacklisted just because they had gossiped about Freya?"
      },
      {
        "paragraph": "They regretted it so much that they wanted to spit out blood."
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Did people not say that Rodney and Freya had no feelings for each other at all? Why was he so\nprotective of her? It was strange."
      },
      {
        "paragraph": "Rodney was heading toward Freya’s direction in big steps."
      },
      {
        "paragraph": "Freya instinctively hid inside a lounge at the side. Rodney did not notice her. He walked toward the\nprivate room where she was breastfeeding just now."
      },
      {
        "paragraph": "Freya leaned on the wall while carrying Dani in her arms."
      },
      {
        "paragraph": "Her heart was beating wildly."
      },
      {
        "paragraph": "She never thought that Rodney would take her side and even scold those elite ladies for her."
      },
      {
        "paragraph": "Did he not say that her waist had looked like a pail? Why did he suddenly know to respect pregnant\nwomen and mothers?"
      },
      {
        "paragraph": "Did he have a realization all of a sudden? Had he been like this all along?"
      },
      {
        "paragraph": "Freya realized that she might not have truly understood Rodney in the past."
      },
      {
        "paragraph": "Actually, Rodney was not that awful. His words were unpleasant to listen to but maybe it was just like\nwhat Mrs. Lynch said. It was her harsh words that made Rodney go against her."
      },
      {
        "paragraph": "There would be a person in the mirror with the same character as hers staring back at her."
      },
      {
        "paragraph": "Thinking about it closely, Rodney had his good points too."
      },
      {
        "paragraph": "Rodney prepared three meals a day for her after they started living together during her pregnancy, and\nevery meal was packed with nutrition."
      },
      {
        "paragraph": "Freya had been spoiled since young, so she was lazy and always lost things. She did not like to clean up\nthe house either."
      },
      {
        "paragraph": "Whenever Patrick came to her house back then, he would complain that she was too lazy and messy. He\nwould always say that Linda was so clean and tidy, asking her to learn from Linda."
      },
      {
        "paragraph": "At that time, she would retort like it was a matter of course, “I’m lazy, but I can hire a housekeeper."
      },
      {
        "paragraph": "Aren’t you willing to hire a housekeeper after we get married in the future even though you’re earning so\nmuch money?”"
      },
      {
        "paragraph": "Patrick would only say, “I’ll hire a housekeeper, but you can’t be too lazy as a woman.”"
      },
      {
        "paragraph": "Therefore, Freya slowly began to change herself."
      },
      {
        "paragraph": "However, after living with Rodney, aside from telling her off a little in the start, he did not mention those\nthings anymore afterward. He would just let the housekeeper clean the villa. He did not let her do any\ndirty or tiring work."
      },
      {
        "paragraph": "Even the fruits she ate were washed clean before they reached her hands."
      },
      {
        "paragraph": "Maybe because that person was Rodney, so Freya overlooked a lot of details."
      },
      {
        "paragraph": "That might be the reason why her mother had suddenly said that she was also at fault for her and\nRodney’s quarrels."
      },
      {
        "paragraph": "That was right. If only Freya had explained properly that she was having a meal with the girls and not"
      },
      {
        "paragraph": "mocked Rodney sarcastically when he was suspicious on the day she gave birth, they would not have\nended up fighting."
      },
      {
        "paragraph": "After calming  down and thinking about  many things, Freya realized that she was problematic in many\naspects too."
      },
      {
        "paragraph": "At that moment, her phone suddenly rang. It was Rodney who was calling."
      }
    ]
  },
  {
    "title": "Chapter 1824 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Freya’s heart skipped a beat. She quickly picked up the call."
      },
      {
        "paragraph": "“Where did you bring Dani to? You’re not in the private room. I didn’t see you in the banquet hall either.”"
      },
      {
        "paragraph": "“I got lost. I’ll head to the banquet hall immediately.”"
      },
      {
        "paragraph": "Freya calmed down and spoke with complicated feelings."
      },
      {
        "paragraph": "Rodney unconsciously blurted, “You stu—”"
      },
      {
        "paragraph": "He held himself back just as the words were about to spill from his mouth."
      },
      {
        "paragraph": "No. He had to control himself so that they would not end up getting a divorce."
      },
      {
        "paragraph": "“What were you going to say?” Freya asked. If it were before, she would definitely become furious.\nHowever, thinking back to the scene of him helping her just now, she did not let herself get angry. “ Were\nyou going to say that I’m stupid?”"
      },
      {
        "paragraph": "“No, ” Rodney said with difficulty. “It’s normal to lose your way. I almost got lost too. Do you need me to\ngo get you?”"
      },
      {
        "paragraph": "“No need.”"
      },
      {
        "paragraph": "After Freya hung up, she strangely felt like laughing."
      },
      {
        "paragraph": "Rodney did not lose his way at all just now. He was so familiar with this place it was as if it was his own\nhome."
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Forget it. Since Rodney was restraining his temper, she did not have to be so aggressive either."
      },
      {
        "paragraph": "Actually, Freya did not feel happy whenever she made herself angry."
      },
      {
        "paragraph": "When she returned to the banquet hall, Rodney had already prepared himself to be given the cold\nshoulder by Freya. Surprisingly, she did not throw a tantrum after seeing him. She only asked, “Have you\nfinished eating?”"
      },
      {
        "paragraph": "“Yes.”"
      },
      {
        "paragraph": "Rodney’s heart was beating like a drum. Could it be that Freya did not notice he was about to call her\nstupid just now?"
      },
      {
        "paragraph": "“Since you’re done eating, carry the baby. ” Freya passed Dani over."
      },
      {
        "paragraph": "Rodney was stunned as he carried the baby."
      },
      {
        "paragraph": "After sitting down, Freya realized that everyone had finished eating. There were two plates in front of her\nthat were filled with the foods she liked to eat. There was a lot of seafood too."
      },
      {
        "paragraph": "“Mom, did you save these plates of food for me? Thank you. You’re the best.” Freya smiled sweetly at\nMrs. Lynch."
      },
      {
        "paragraph": "Mrs. Lynch had a weird expression. Wendy covered her mouth and laughed. “It was Rodney who saved\nthe food for you.”"
      },
      {
        "paragraph": "Freya was dumbfounded and became stiff."
      },
      {
        "paragraph": "Maybe it was because she did not expect Rodney to know her preferences so well."
      },
      {
        "paragraph": "“You can tell Rodney that.” Mrs. Lynch smiled."
      },
      {
        "paragraph": "Everyone looked over with ambiguous gazes. Freya was embarrassed. She desperately wanted to hide\nunder the table."
      },
      {
        "paragraph": "Rodney looked at her blushing face. His lips curved slightly. He initially wanted  to tease her, but… never\nmind."
      },
      {
        "paragraph": "“Quickly eat. The food won’t taste as good when it turns cold.”"
      },
      {
        "paragraph": "Rodney reminded Freya. Just as Chester told him just now, people like him should talk less and do more."
      },
      {
        "paragraph": "“Not bad. You’ve changed after becoming a father.” Old Master Snow nodded in satisfaction. “You even\nknow how to take care of others now.”"
      },
      {
        "paragraph": "“Ahem.” Freya almost choked."
      },
      {
        "paragraph": "She did not raise her head at all as she had her meal."
      },
      {
        "paragraph": "After eating, Freya and a few elders of the Snow family went down in an elevator."
      },
      {
        "paragraph": "As she exited the elevator, she spotted the elite ladies she saw before waiting for them with their parents."
      },
      {
        "paragraph": "Freya frowned. She guessed that those elite ladies were being forced by their parents to apologize."
      },
      {
        "paragraph": "After all, no one in the Snow family could be offended."
      }
    ]
  },
  {
    "title": "Chapter 1825 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "After Freya waited in the car for a few minutes, Rodney opened the door to the back seat and got in."
      },
      {
        "paragraph": "“Why were they looking for you just now?” Freya asked, pretending not to know anything after hesitating\nfor a moment."
      },
      {
        "paragraph": "“Nothing, they just wanted some help from me but I refused. I’m not close to them, ” Rodney said as he\nnaturally carried Dani over from Freya’s arms."
      },
      {
        "paragraph": "Actually, those elite ladies were forced by their parents to apologize to him and Freya."
      },
      {
        "paragraph": "However, he did not let them meet Freya. He also warned them, saying that he did not intend to forgive\nthem and they should not even think about looking for Freya to beg for mercy. If Freya knew the truth, the\nelite ladies would only end up in a worse situation."
      },
      {
        "paragraph": "He believed that after his warning, those people would not dare to pester Freya,"
      },
      {
        "paragraph": "As for the truth, there was no need for Freya to know about it. Even if she did, it would only fuel her\nanger."
      },
      {
        "paragraph": "After all, that woman cared about her figure more than anybody else."
      },
      {
        "paragraph": "However, he did not know that a hint of astonishment had flashed across Freya’s eyes upon hearing his\nwords."
      },
      {
        "paragraph": "She did not understand why Rodney was not telling her the truth."
      },
      {
        "paragraph": "Could it be that… he was afraid she would receive a blow and feel uncomfortable?"
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "After that thought flashed across her mind, Freya’s heart became messier."
      },
      {
        "paragraph": "The car drove toward the Snow family’s villa. They would be having dinner there as well."
      },
      {
        "paragraph": "On the way, Rodney kept coaxing Dani to talk."
      },
      {
        "paragraph": "Freya lowered her head and looked at her phone for a while. She suddenly said, “When we went on\nstage to speak, someone took a picture and posted it on the internet. The netizens are saying that… I’m\nquite fat… Ask the nanny to cook less food in the future. I want to lose weight.”"
      },
      {
        "paragraph": "Rodney’s handsome face darkened. “Why should you lose weight? You’re eating food for two people\nnow. What if you run out of milk after losing"
      },
      {
        "paragraph": "weight? Who’ll take responsibility if Dani’s not getting enough nutrition?”"
      },
      {
        "paragraph": "Initially, Freya was calm. When she heard his words though, she felt as though she was being pricked by\nneedles. “Was I born to be a milk machine?  If Dani’s nutrients are insufficient, are you going to send me\nto jail for not feeding your daughter properly?”"
      },
      {
        "paragraph": "She was exasperated because of him. She initially had some fondness for him, but it was all gone\nbecause of those few sentences."
      },
      {
        "paragraph": "“That’s not what I meant.”"
      },
      {
        "paragraph": "Rodney realized that it seemed he had angered Freya again."
      },
      {
        "paragraph": "Even the driver in front was worried about Rodney’s emotional quotient."
      },
      {
        "paragraph": "The driver said hastily, “Young Madam, you’ve misunderstood Young Master Snow. He means to say that\nyou’re not fat. There’s no need to take the netizens’ comments to heart. Besides, there’s no need to lose\nweight so hastily too. Although you’re past your postpartum period, your body hasn’t recovered fully yet.\nYou can still take it slow.”"
      },
      {
        "paragraph": "“Yes, that’s what I meant, ” Rodney said quickly."
      },
      {
        "paragraph": "Freya let out a hmph and glanced at him. “Do you think I’ll believe that? Rodney Snow, let me tell you\nthis. I’m the child’s mother too. I have my plans for feeding the child. I don’t need you to judge me.”"
      },
      {
        "paragraph": "“What I said is true. You’re not fat…” Rodney muttered in a low voice, “Although you’re a little plump,\nbeing a bit chubby is quite cute too…”"
      },
      {
        "paragraph": "‘Of course, there’s a part that’s particularly nice to touch.’"
      },
      {
        "paragraph": "Rodney added mentally. He did not dare to say it out loud."
      },
      {
        "paragraph": "Chubby… Quite cute…"
      },
      {
        "paragraph": "Freya did not think those words would come out of Rodney’s mouth. Her face heated up."
      },
      {
        "paragraph": "She quickly looked outside the window."
      },
      {
        "paragraph": "No, she could not be swayed by those sugar-coated words."
      }
    ]
  },
  {
    "title": "Chapter 1826 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "“You even said that my waist resembles a pail before this…” Freya pouted."
      },
      {
        "paragraph": "“I don’t dislike your figure. I said those words out of anger that time,” Rodney said, “Besides, I’m not that\nsc*mmy. You gained weight because you gave birth to my child. I know that clearly. Don’t take the\nnetizens’ comments to heart. Those people are just jealous of you. Think about it. You gave birth to a\npretty, adorable little princess who’s the center of all attention. How can they not be envious? Even many\nfemale guests were envious of you today."
      },
      {
        "paragraph": "Some people are just sour because they don’t have your life.”"
      },
      {
        "paragraph": "After he spoke, the car went silent for a while."
      },
      {
        "paragraph": "Freya gazed at him deeply. She did not expect that there would be a day when such pleasant words\nwould come out of Rodney’s mouth."
      },
      {
        "paragraph": "She had to admit that his words lightened up her mood."
      },
      {
        "paragraph": "“Why are you… looking at me like that? I didn’t say anything wrong, right?” Rodney asked nervously."
      },
      {
        "paragraph": "“No, I think you said it quite well.” Freya nodded. Rodney’s eyes widened."
      },
      {
        "paragraph": "Maybe it was because he never expected that Freya would praise him for speaking well."
      },
      {
        "paragraph": "The sentence that both of them said the most in the past was, “Can you shut your mouth if you don’\ntknow how to talk? I won’t think of you as a mute.”"
      },
      {
        "paragraph": "Rodney suddenly realized that not making Freya angry was quite an easy task."
      },
      {
        "paragraph": "Upon arriving at the Snow family’s villa, Freya went upstairs and took a nap."
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "When she went downstairs, she was about to look for Dani when she suddenly saw two people talking in\nthe courtyard. One of them had a buff and towering figure. It was her brother, Forrest Lynch. The person\nstanding opposite him was the Snow family’s eldest young lady, Jessica Snow. Jessica wore an orange\ncoat with a ribbon tied in the middle of her waist. She was in high heels that revealed her delicate feet.\nShe exuded the aura of a powerful woman."
      },
      {
        "paragraph": "However… Why were they both standing together? Was it because of Freya?"
      },
      {
        "paragraph": "What were they talking about? The atmosphere around them was cold. They looked like they were\nfighting."
      },
      {
        "paragraph": "Freya secretly went near them. Were they quarreling because of her?"
      },
      {
        "paragraph": "She cautiously hid, using the rocks to cover herself. When she got near, she heard Forrest’s icy voice."
      },
      {
        "paragraph": "“I don’t need that land. The Lynch family has no development plans in Canberra. We won’t take\nadvantage of the Snow family either.”"
      },
      {
        "paragraph": "Jessica’s voice was cold too. “Forrest, can you not be so naive? The Snow family and the Lynch family\nare already joined by marriage. I admit that you’re a capable person, but sometimes, taking appropriate\nshortcuts can bring you further.”"
      },
      {
        "paragraph": "“Enough. Not everyone is as despicable as you, using shortcuts to achieve success.”"
      },
      {
        "paragraph": "Forrest mocked coldly, “Besides, if it weren’t  for you forcing my sister to keep the child by all means\nnecessary, her life wouldn’t have become like this. Of all the women I’ve f*cking met, you’re the most\nruthless one. If it weren’t for you, Freya wouldn’t have gotten pregnant with the child.”"
      },
      {
        "paragraph": "“… I’m sorry.” Jessica clenched her fists. She spoke in a low voice without an expression on her face."
      },
      {
        "paragraph": "“You don’t have to apologize to me. You only care about status and money. The thing I regret the most in\nmy whole life is saving you back then. I should’ve just let you die.” After Forrest spoke, he left with a grim\nexpression."
      },
      {
        "paragraph": "Freya leaned against the rocks. She was astonished. When did her brother save Jessica?"
      },
      {
        "paragraph": "Did they know each other earlier on?"
      },
      {
        "paragraph": "That was impossible. One of them was the elite lady of the Snow family, while the other was a young\nmaster of a wealthy family from a small place in Melbourne. How could they have gotten involved with\neach other in the past? Moreover, Jessica was a ruthless woman, yet her brother dared to speak to\nJessica in that tone."
      }
    ]
  },
  {
    "title": "Chapter 1827 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Freya secretly glanced at Jessica. She saw that her back was trembling slightly."
      },
      {
        "paragraph": "After standing there for a while, Jessica left in her high heels, looking elegant and restrained."
      },
      {
        "paragraph": "It was as if the sight of her trembling just now was Freya’s imagination."
      },
      {
        "paragraph": "Freya stood there in a daze for some time until someone knocked on her head."
      },
      {
        "paragraph": "Ryan’s tall and upright figure was standing in front of her. He smiled and asked, “Why are you standing\nhere in a daze?”"
      },
      {
        "paragraph": "“ I’m meditating. ” Freya was stunned. She quickly leaned against the rocks and looked up at the sky."
      },
      {
        "paragraph": "The corners of Ryan’s mouth twitched. “Do you think I’m stupid? Never mind. Many of the Snow family’s\nrelatives are here today, and you don’t recognize most of them. Staying here will be quieter.”"
      },
      {
        "paragraph": "“That’s right. Even if they seem to be warm to me, I’m still a person who came from a small place in\nthose wealthy people’s eyes. I’m too lazy to socialize with them.” Freya shrugged her shoulders."
      },
      {
        "paragraph": "“This place is quite boring. I’ll bring you to play pool. Do you know how to play?”"
      },
      {
        "paragraph": "“I do. I’m pretty good at it.”"
      },
      {
        "paragraph": "Freya wanted to ask about Jessica’s matters, so she followed Ryan."
      },
      {
        "paragraph": "However, after playing for three minutes, Ryan was speechless. “Is this what you mean by ‘pretty good"
      },
      {
        "paragraph": "Freya felt awkward. She was indeed quite good at playing pool before. “I haven’t played for two to three\nyears. I used to be good at it. Haha.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "“Forget it. I’ll teach you. Your hands shouldn’t tremble.”"
      },
      {
        "paragraph": "Ryan leaned over from behind and grabbed her wrist."
      },
      {
        "paragraph": "Due to the close distance, he could smell a faint milky scent on Freya."
      },
      {
        "paragraph": "Ryan could not help but lower his head to glance at her. Maybe it was because she had been eating very\nwell during her postpartum period, her face was as"
      },
      {
        "paragraph": "fair as milk and slightly chubby. He knew that she looked pretty before, but her charm only grew after she\ngave birth."
      },
      {
        "paragraph": "He calmed his nerves and tried to ignore the unusual feeling he felt. He grabbed Freya’s hand and hit\nhard. The ball was pocketed."
      },
      {
        "paragraph": "“Wow, you’re so great.” Freya glanced at him with sparkling eyes."
      },
      {
        "paragraph": "Ryan’s heart skipped a beat. He lifted his lips in a smile. “You just have to find the correct angle.”"
      },
      {
        "paragraph": "Freya nodded. Actually, she was not concentrating on the game. “By the way, why is Jessica… not\nmarried yet?”"
      },
      {
        "paragraph": "Ryan looked at Freya strangely. “Don’t you know? She already got married long ago.”"
      },
      {
        "paragraph": "“Huh?”"
      },
      {
        "paragraph": "Freya was shocked. “But I’ve never seen my brother-in-law.”"
      },
      {
        "paragraph": "Ryan’s gaze dimmed. He sighed. “He passed away. He’s been gone for four years. Jessica got married\nquite early. She got married not long after she came back from studying abroad. However, our brother-in-\nlaw has had a weak body since he was young.”"
      },
      {
        "paragraph": "“Why did Jessica still marry him?” Freya was puzzled."
      },
      {
        "paragraph": "Ryan gazed at her intensely. “Because of politics and benefits. Although we’re the prime minister’s family\nnow, we used to be in a bad situation. In Canberra, which is like a whirlpool, Uncle Jason sought\nreputation and profits in the business world while my dad was trying to gain ground in the political world."
      },
      {
        "paragraph": "“How could they do that without any aid? For a family, political marriage is the best choice."
      },
      {
        "paragraph": "Therefore, Jessica got engaged when she was 18. Her marriage is the foundation the Snow family is\nstanding on to achieve what we have today. That’s also why she became the president of Snow\nCorporation and joined the board of directors despite being a woman. She has even more shares than\nRodney and Carson.”"
      }
    ]
  },
  {
    "title": "Chapter 1828 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "“I see…”"
      },
      {
        "paragraph": "Freya felt a little stifled. “Giving up love and sacrificing marriage to gain benefits. Actually, being born in\nwealthy families like yours is quite miserable… Never mind. Maybe Jessica doesn’t find it miserable. For\nsome people, the benefits of the family are greater than anything else.”"
      },
      {
        "paragraph": "She was not fond of Jessica at all."
      },
      {
        "paragraph": "It was because Jessica had swapped her contraceptives that she became pregnant."
      },
      {
        "paragraph": "“Don’t put it that way. Some people don’t have a choice.”"
      },
      {
        "paragraph": "Ryan sighed and said, “Jessica is our eldest sister. The family placed a lot of responsibilities on her.\nWhen we were young, Rodney, Carson, and I were pretty mischievous. The Snow family is very strict\nwith the younger ones, but we only wanted to play. We had to learn Chinese when we were two years\nold, French at three, and German at four. Which child would like to study those things at such a young\nage? That’s why we skipped classes, threw tantrums, and didn’t want to study. My grandpa was very\nstrict at that time. He often caned us."
      },
      {
        "paragraph": "Jessica was the one who stood up and begged for us back then."
      },
      {
        "paragraph": "“Grandpa said he hopes that we, the younger generation, can support the future of the Snow family. At\nthat time, Jessica said we were still young and asked Grandpa not to force us. She would work hard and\ncreate a future for the Snow family."
      },
      {
        "paragraph": "Grandpa told her to not regret her choices, and she said she wouldn’t. It was because of her that we\ncould have unrestrained childhoods. When we were having fun every day, she would have to attend"
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "training courses endlessly. When we were exhausted and sleeping, she stayed up all night to memorize\ninformation."
      },
      {
        "paragraph": "“Outsiders say that Jessica is cold and heartless, calling her a she-devil. Ha, that’s because she took\nevery dishonorable matter of the Snow family into her hands. Because of her, the rest of our reputations\nare clean.”"
      },
      {
        "paragraph": "Freya’s expression was filled with astonishment."
      },
      {
        "paragraph": "Maybe it was because Old Master Snow treated her too well that she thought he treated everyone else\nthe same way."
      },
      {
        "paragraph": "However, thinking about it, if Old Master Snow were such a gentle person, the Snow family would not be\nwhat it was today."
      },
      {
        "paragraph": "Freya could not imagine how miserable she would be if she were born into the Snow family."
      },
      {
        "paragraph": "Ryan looked at Freya. He smiled and said, “It’s just as my grandpa said. Since we’re enjoying the honor\nand money that the Snow family has brought us, we have to contribute to the Snow family as well. We\ncan’t just simply take things and not return the favor.”"
      },
      {
        "paragraph": "After pausing for a while, Ryan added with mixed feelings, “Swapping the contraceptives back then was\nGrandpa’s arrangement to force you to give birth to the child. Even if Jessica hadn’t taken part, there\nwould still be others making a move against you. She only played the role of a bad person because\neveryone wanted to be a good person. Who would want to play the role of a villain? Even her parents are\nno exception.”"
      },
      {
        "paragraph": "Freya went silent."
      },
      {
        "paragraph": "After understanding the truth, she suddenly pitied Jessica."
      },
      {
        "paragraph": "How strong and determined did her mentality have to be to carry such big responsibilities for others?"
      },
      {
        "paragraph": "“By the way, where did she study when she went abroad?”"
      },
      {
        "paragraph": "“The United States, ” Ryan said, “California Institute of Technology.”"
      },
      {
        "paragraph": "Freya was taken aback. Her brother had studied there too."
      },
      {
        "paragraph": "Did that mean they were alumni? Their ages were similar too."
      },
      {
        "paragraph": "Freya had heard from her mom that Forrest had a girlfriend when he was in university. They broke up\nafterward. That person could not possibly be  Jessica, right?"
      },
      {
        "paragraph": "Freya broke out in a cold sweat. Her brain was overwhelmed."
      },
      {
        "paragraph": "“What are you thinking about?” Ryan ruffled her fringe. “Let’s not talk about these things. I’ll teach you\nhow to play pool.”"
      },
      {
        "paragraph": "He grabbed her elbows again. “What are you guys doing?!”"
      },
      {
        "paragraph": "Suddenly, there was a shout from the door."
      }
    ]
  },
  {
    "title": "Chapter 1829 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Rodney entered with an awful expression."
      },
      {
        "paragraph": "From Rodney’s angle of view, it looked like Ryan was hugging Freya from behind. His chin was almost\nresting on her shoulders. His hands were also holding her arms, and they were in an intimate position."
      },
      {
        "paragraph": "A wave of fury burned in Rodney’s chest, rushing to his brain."
      },
      {
        "paragraph": "He knew that Ryan treated Freya well, but he did not think they were doing that behind his back…"
      },
      {
        "paragraph": "“I’m teaching her how to play pool.” Ryan straightened his body calmly."
      },
      {
        "paragraph": "“Move aside.” Rodney went over in large strides and shoved him away. “I can teach her how to play pool\ntoo. There’s no need for you to do it.”"
      },
      {
        "paragraph": "“Rodney, your words are too much.” Freya was dissatisfied seeing Rodney’s hostile attitude toward\nRyan."
      },
      {
        "paragraph": "“I’m too much?” After Rodney was accused, his handsome face was grim with anger. “You— ”"
      },
      {
        "paragraph": "“It’s alright, Freya. Rodney is just jealous seeing me teaching you pool and standing so close to you.”\nRyan was afraid that Rodney would say unpleasant words and start a quarrel. He cut Rodney off while\nsmiling."
      },
      {
        "paragraph": "With Ryan’s words, it felt as though a basin of cold water had doused the atmosphere which was about\nto burn."
      },
      {
        "paragraph": "The fire went out in a sizzle, but there was dense smoke that seemed to choke everyone."
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Rodney forgot about getting angry all of a sudden. He widened his eyes and felt an indescribable sense\nof embarrassment and shame. “ I’ m jealous? Ha, is this a joke?”"
      },
      {
        "paragraph": "Freya was stunned too. She had a moment of doubt, but after seeing Rodney’s attitude, she thought she\nwas overthinking it. “Ryan, don’ t talk nonsense. How could he possibly be jealous? Maybe he was just\nthinking dirty things in his head and thought I’m having an affair with you. Although he doesn’t like me,\nhe’s very particular about his pride. To him, I’m like a piece of chicken rib, tasteless to eat but a pity to\nthrow away. However, I’m still his legal wife, so he can’t allow other people to taint me.”"
      },
      {
        "paragraph": "“That’s right.” It was as if Rodney had found a reason that could save his pride. He immediately nodded."
      },
      {
        "paragraph": "Freya laughed mockingly. It was just as she thought."
      },
      {
        "paragraph": "Faced with Rodney’s low EQ Ryan was utterly speechless."
      },
      {
        "paragraph": "If Freya had not gotten pregnant back then, a person like Rodney could only remain single for the rest of\nhis life."
      },
      {
        "paragraph": "Freya was ashamed as well. Although she was the one who said that, Rodney had given his reply way\ntoo fast. That made her very embarrassed."
      },
      {
        "paragraph": "She was a woman, after all. Was she really so unattractive?"
      },
      {
        "paragraph": "“Move. I’ll teach you how to play pool.” Rodney did not realize how hard of a blow that was for a woman.\nHe simply grabbed Freya’s arm and pulled her into his embrace."
      },
      {
        "paragraph": "He had not hugged her this way in a long time."
      },
      {
        "paragraph": "Freya’s body was soft like cotton. A milky scent wafted over, which made him tempted to sniff more of it."
      },
      {
        "paragraph": "There was a ripple in Rodney’s heart. However, before that ripple could fully spread, Freya pushed him\naway."
      },
      {
        "paragraph": "“Thank you, but I don’t need you to teach me. Play by yourself. I’m leaving.”"
      },
      {
        "paragraph": "Freya turned around and left."
      },
      {
        "paragraph": "Rodney was furious. “Freya Lynch, what do you mean? You’re leaving as soon as I arrive. If I hadn’t\ncome, you’d be playing with Ryan. Do you like playing pool with him that much?”"
      },
      {
        "paragraph": "“He’s different from you. You always make me angry.”"
      }
    ]
  },
  {
    "title": "Chapter 1830 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "After gritting her teeth and glaring at Rodney, Freya left."
      },
      {
        "paragraph": "She initially had some good feelings about him that day, but they were all destroyed now."
      },
      {
        "paragraph": "Rodney, who had nowhere to lash out his anger, could only glare at Ryan. “Don’t you know that it’s\ninappropriate for a man and woman to be too close to each other? Ryan, keep a distance from your\nsister-in-law in the future.”"
      },
      {
        "paragraph": "“If you still don’t know how to treasure her, I don’t mind closing in the distance between Freya and me.”\nRyan raised his gentle eyebrows."
      },
      {
        "paragraph": "“What do you mean by that?” Rodney’s heart sank. He grabbed Ryan’s collar. “Don’t forget that Freya is\nyour father’s goddaughter. She’s nominally your sister.”"
      },
      {
        "paragraph": "“Yes, it’s quite unfortunate. Why did such a good woman become my sister? However, the title of a\ngoddaughter can be revoked.” Ryan smiled patiently. “As long as someone has power and influence,\nanything can be done.”"
      },
      {
        "paragraph": "Rodney felt a wave of chills in his heart."
      },
      {
        "paragraph": "He knew his cousin well. Although Ryan might look gentlemanly, deep in his bones, he was similar to his\nfather. Both of them were like tigers wearing a mask. If not, they would not have had a smooth path in\nthe political world."
      },
      {
        "paragraph": "“Don’t you dare.” A hint of hostility flashed across Rodney’s eyes."
      },
      {
        "paragraph": "“Why are you so agitated? Didn’t you say it yourself just now? You don’t like her anyway. Sometimes,\nthere’s no need to force yourself just for your pride.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Ryan smiled and said, “Don’t worry. If it’s because of the child, Freya is still part of the Snow family if she\nmarries me. She’ll still take care of Dani.”"
      },
      {
        "paragraph": "Rodney’s temples throbbed."
      },
      {
        "paragraph": "Why did he not think Ryan was such an eyesore before? He had the urge to rip Ryan’s mouth off. “In\nyour dreams. Freya is the mother of my child.”"
      },
      {
        "paragraph": "“Of course she is, but it’s not certain that she’ll be your only wife in this lifetime.” Ryan removed Rodney’s\nhand. “In your eyes, Freya might be a terrible woman. However, when she interacts with me, I think her\npersonality is very nice. She’s vibrant and pretty. Sometimes, she might be a little silly, but it’s very cute.\nShe acts the same way when interacting with other people. A woman who’s pretty with a nice personality\nwill naturally have pursuers. You have to get used to that.”"
      },
      {
        "paragraph": "“Something must be wrong with your brain. How is Freya’s personality nice?” Rodney said angrily."
      },
      {
        "paragraph": "“Really? Maybe her personality is bad only when she’s with you. After all, I treat her very nicely. I respect\nher and have trust in her.”"
      },
      {
        "paragraph": "Ryan tidied his shirt. “Rodney, I’ll give you half a year. If you’re still behaving like this after half a year,\nthen I’ll pursue Freya. By that time, don’t blame me for disregarding our brotherhood.”"
      },
      {
        "paragraph": "“You even dare to desire your sister-in-law. B*stard! ” Rodney scolded while gritting his teeth."
      },
      {
        "paragraph": "“Hmph, who doesn’t know that you and Freya are married in name only? After being married for so long,\nI’m  guessing that you haven’t even kissed her. Actually, you really don’t have to keep hanging on to\nFreya just for your so-called pride. Moreover, many married couples are divorced nowadays, but aren’t\nthere still some children who are happy?” Ryan left confidently after he spoke. After he exited the pool\nroom, his lips curved resignedly."
      },
      {
        "paragraph": "He could only do so much. He hoped that this stupid cousin of his would quickly realize his feelings for\nFreya. If not, he would not let Freya keep wasting her time with Rodney."
      },
      {
        "paragraph": "In the room, Rodney kicked over the chair in front of him."
      },
      {
        "paragraph": "‘Damn that Ryan! How dare he desire my wife? In his dreams.’"
      },
      {
        "paragraph": "Ah, Rodney was exasperated."
      },
      {
        "paragraph": "No, he had to let Freya know Ryan’s true colors."
      },
      {
        "paragraph": "He did not believe that Freya would not stay away from Ryan, that disgusting guy, after she found out."
      },
      {
        "paragraph": "After figuring things out, Rodney went out to look for Freya."
      },
      {
        "paragraph": "He found her in the poker room after searching for her for a long time. She was playing poker with a few\nelders of the family."
      },
      {
        "paragraph": "Upon seeing Rodney, his maternal second aunt, Aunt Millie, called out to him, “Rodney, are you looking\nfor your wife? You came at the right time. Freya lost the game just now. You’re her husband, so pay up.”"
      }
    ]
  },


  {
    "title": "Chapter 1831 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "When Freya saw Rodney, she recalled that he had admitted she was tasteless like chicken ribs. Her\nexpression became indifferent. She smiled and said, “No need. I can pay myself…”"
      },
      {
        "paragraph": "“Why? It’s natural for a husband to pay when his wife loses money,” Rodney’s maternal cousin spoke up\ntoo."
      },
      {
        "paragraph": "“Alright, I’ll pay. ” Rodney took out his phone to make the payment."
      },
      {
        "paragraph": "Freya did not say anything when she saw that. It was just a small amount of cash to Rodney anyway."
      },
      {
        "paragraph": "After making the payment, Rodney turned his head and spoke to Freya, “Come out for a while. I have\nsomething to tell you.”"
      },
      {
        "paragraph": "“Ooh, what secret are you guys going to talk about?” Aunt Millie teased them. “You can just say it here.\nLet us listen too. If you don’t want to do that, wait till we’re done playing poker. I barely had the chance to\nplay poker with Freya.”"
      },
      {
        "paragraph": "“That’s right. ” The other aunts at the side agreed while smiling."
      },
      {
        "paragraph": "“I’m busy. I don’t have time.” Freya did not even look at the man beside her."
      },
      {
        "paragraph": "Hmph, why did she have to go out just because he told her to?"
      },
      {
        "paragraph": "Besides, what was there to do after going out? Was it to listen to him saying that she was like chicken\nribs, tasteless but a pity to throw away?"
      },
      {
        "paragraph": "As she thought about it, she felt increasingly aggrieved and annoyed."
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "After all, she used to be the belle of Melbourne. Her educational background and accolades were not\nlacking either."
      },
      {
        "paragraph": "Rodney was embarrassed after getting rejected. It would be inappropriate of him to yank Freya out\nforcefully. He could only sit at the side and watch her play poker."
      },
      {
        "paragraph": "Although he was dense in emotional matters, his brain still worked pretty quickly on other stuff. He knew\nhow to count the cards."
      },
      {
        "paragraph": "After looking for a while, he became anxious. “Ah, don’t play the Ace card. It’s better to put out the Jack.”"
      },
      {
        "paragraph": "Freya would purposely do the opposite of his words."
      },
      {
        "paragraph": "He told her not to play that card, but she did it anyway."
      },
      {
        "paragraph": "“Yes! ” Rodney’s cousin chuckled. “I’m left with the last card.”"
      },
      {
        "paragraph": "“See? I told you not to play that card, but you did anyway,” Rodney nagged."
      },
      {
        "paragraph": "After a while, he started nagging again. “Don’t play that card… See? You helped her win… It was so\nobvious that she was about to win when she played the King card. This is so easy… Why can’t you see it"
      },
      {
        "paragraph": "… You lost money again… You played it wrongly again. Don’t put this card out… Ah, why are you so\nstupid?”"
      },
      {
        "paragraph": "Freya got more and more embarrassed because of Rodney’s words. Her expression became darker."
      },
      {
        "paragraph": "If there were no people present, she really wanted to throw the cards on Rodney’s face."
      },
      {
        "paragraph": "F*ck. He was all high and mighty just because he knew how to play poker, huh?"
      },
      {
        "paragraph": "Was there anything wrong if she did not know how to play or if she simply did not want to use her brain?"
      },
      {
        "paragraph": "Everyone sensed that the atmosphere was weird. However, a certain someone just could not sense  it."
      },
      {
        "paragraph": "Aunt Millie cleared her throat. “Rodney, can you shut up? You’re too noisy. Can you just go out? Don’t\ndisturb us here.”"
      },
      {
        "paragraph": "“Why should I go out? Should I just watch as you all bully Freya? She hasn’t even won once. ” Rodney\nlooked at Freya. “Listen to my instructions during the next round. I’ll surely make you win.”"
      },
      {
        "paragraph": "“No need. Dani may be hungry. I’ll check on her. You can sit here and play. ” Freya tried to squeeze a\nsmile out. She stood up and left."
      },
      {
        "paragraph": "“Ah, I’ll follow you.”"
      },
      {
        "paragraph": "Rodney quickly went after her."
      },
      {
        "paragraph": "Aunt Millie sighed. “Rodney looks quite sharp when he’s doing business, but why is he so stupid in\nprivate?”"
      },
      {
        "paragraph": "“That’s right. I saw Freya almost cry out of frustration.”"
      },
      {
        "paragraph": "“ If it were my man, I’d definitely give him a hard slap across his face. Playing poker is just a form of\nentertainment. Why did he keep nagging?”"
      },
      {
        "paragraph": "“No, I have to talk about this with Wendy. If that kid keeps this up, they’ll definitely end up divorcing.”"
      },
      {
        "paragraph": "However, the person involved was still oblivious about it."
      },
      {
        "paragraph": "Rodney kept chasing after Freya, but she was walking too fast."
      },
      {
        "paragraph": "He had no choice but to grab her. “Stop, I have something to tell you…”"
      },
      {
        "paragraph": "Freya withdrew her arm with all her strength. She did not want to talk to him at all."
      },
      {
        "paragraph": "“Don’t go. ” Rodney  pulled her  to his front. When  he saw Freya’s red eyes, he was stunned."
      }
    ]
  },
  {
    "title": "Chapter 1832 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "“Why are you crying?” Rodney feared it most when women cry. He was utterly flustered."
      },
      {
        "paragraph": "He was not even that flustered when Sarah cried in the past. After all, he knew that Freya rarely cried in\nfront of him. The time she cried the hardest was on the day she gave birth."
      },
      {
        "paragraph": "“Get lost,” Freya said with a hoarse voice. At the same time, she looked toward him with a calm and cold\ngaze."
      },
      {
        "paragraph": "“You… What’s wrong with you?” Rodney was at a loss. He would rather Freya throw a tantrum than\nbeing in that state. It was like the calm before a storm. “Is it because you lost some money just now? It’s\nokay. It’s just a small amount of money. ”"
      },
      {
        "paragraph": "Freya laughed in anger."
      },
      {
        "paragraph": "Did he not have a f*cking clue as to why she was crying?"
      },
      {
        "paragraph": "Of course, the most saddening thing was that he did not have a f*cking clue at all."
      },
      {
        "paragraph": "“Rodney, let go. I don’t want to see you.” Freya was terrified she could not resist charging over to bite\nhim if she saw him again."
      },
      {
        "paragraph": "“Don’t lash out your anger on me. If you had played according to what I said, you wouldn’t have…”"
      },
      {
        "paragraph": "Freya did not want  to continue  listening at all."
      },
      {
        "paragraph": "It felt as if the string that was pulled taut in her head had finally snapped."
      },
      {
        "paragraph": "She could not tolerate it anymore. She went forward and pushed him hard. “Can you just stay away from\nme? Don’t keep nagging in front of me all day. Do you know that you’re really hateful?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Rodney was caught off guard. His tall figure was pushed to the ground."
      },
      {
        "paragraph": "He gazed at her with widened eyes and his breath quickened."
      },
      {
        "paragraph": "What did she say?"
      },
      {
        "paragraph": "She told him to stay away from her."
      },
      {
        "paragraph": "She also said that he was really hateful?"
      },
      {
        "paragraph": "Rodney felt as if a flame had been lit up in his chest. Sarah used to say those words."
      },
      {
        "paragraph": "Right then, Freya said it too."
      },
      {
        "paragraph": "As a man, was he that hateful and a failure?"
      },
      {
        "paragraph": "Was it destined that no woman would like someone like him?"
      },
      {
        "paragraph": "“Enough, Freya.”"
      },
      {
        "paragraph": "He stood up with a cold expression on his handsome face. His tone was harsh. “Do you think you’re that\nlikable? You’re so hateful that it makes"
      },
      {
        "paragraph": "me puke too. With your character, if it weren’t for me, no one would marry you in your whole life.”"
      },
      {
        "paragraph": "“Haha, that’s great. It takes one to know another.” Freya took a step back. Big teardrops fell from her\neyes."
      },
      {
        "paragraph": "She turned around and ran away quickly. Her tears fell on the ground."
      },
      {
        "paragraph": "Rodney’s head buzzed. He suddenly realized how offensive his words were."
      },
      {
        "paragraph": "However, it was as if his legs were filled with lead."
      },
      {
        "paragraph": "Why should he chase after Freya? She did not like him anyway."
      },
      {
        "paragraph": "She hated it when she saw him."
      },
      {
        "paragraph": "If he went over, it would only make her despise him more."
      },
      {
        "paragraph": "He stood there in a daze for some time."
      },
      {
        "paragraph": "Not long after, Wendy rushed over furiously with those aunties who were playing poker just now."
      },
      {
        "paragraph": "“Rodney Snow, why did I give birth to such a stupid son like you?” Wendy slapped him across his face\nright away."
      },
      {
        "paragraph": "“Mom, what are you doing?” Rodney was stunned from being slapped."
      },
      {
        "paragraph": "“Let me ask you. What did you say to Freya? She was so angry that she took the child and left. The\npeople of the Lynch family went after her just now.”"
      }
    ]
  },
  {
    "title": "Chapter 1833 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Wendy’s body trembled in fury. “Today is the baby’s one-month celebration. As parents, can you two be\nmore sensible? Why did you have to upset your wife on this day?”"
      },
      {
        "paragraph": "Rodney was stunned. He never thought that Freya would have such a big reaction. “I did not. She was\nthe one who angered me.”"
      },
      {
        "paragraph": "Aunt Millie snapped, “Who’s making who unhappy now? We were there playing poker properly, yet you,\na man, kept ordering Freya what to do. Your tone was filled with disdain toward her, and you even said\nshe was stupid in front of so many people. Freya was being extra nice to you by tolerating it and not\ntelling you off.”"
      },
      {
        "paragraph": "“That’s right, Rodney. You didn’t care about Freya’s image when you spoke just now. Everyone just\nwanted to have fun playing poker. If we lost, so be it. Besides, we women don’t know how to count the\ncards as you men do, and you kept nagging. If it were your sister-in- law, I would’ve asked her to get lost.\nFreya truly has a good temper.”"
      },
      {
        "paragraph": "“Moreover, she just gave birth. It might be the post-pregnancy brain, so having slower reactions is\nnormal. Besides, it’s okay even if she loses. You can just pay up willingly. Why did you do that?”"
      },
      {
        "paragraph": "“I used to think it was Freya’s honor to be able to marry you but it seems like I overthought it. If you’re\nacting this way in front of everyone, it’s obvious that you’re not romantic at all in private either.”"
      },
      {
        "paragraph": "Rodney’s brain was in a mess. His head was buzzing."
      },
      {
        "paragraph": "Why was everyone lecturing him? What were they trying to imply?"
      },
      {
        "paragraph": "Did Freya not cry earlier because of her loss but rather it was because he kept nagging by her side?"
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "“I… I didn’t mean she’s stupid, I…” He muttered to explain."
      },
      {
        "paragraph": "Wendy said with a headache, “Put yourself in another person’s shoes. If Freya keeps telling you what to\ndo when you’re playing poker and even says you’re stupid as if every move you make is wrong, do you\nthink you’ll feel happy? Today, those players here were from the Snow family. Freya"
      },
      {
        "paragraph": "would care more about her image. But I believe she’s not a reckless person. She wouldn’t leave just\nbecause of your words at the poker table. You must’ve said something else afterward that hurt her,\nright?”"
      },
      {
        "paragraph": "Rodney did not have the strength to retort. He even felt embarrassed to raise his head."
      },
      {
        "paragraph": "He had the urge to bang his head on the wall. He was indeed stupid."
      },
      {
        "paragraph": "He could not guess why Freya had cried."
      },
      {
        "paragraph": "When Freya kept shedding tears, she must have been crying out of frustration because of him."
      },
      {
        "paragraph": "However, he thought she was crying because she was upset about losing the poker game."
      },
      {
        "paragraph": "“Forget it. I don’t want to scold you any more,” Wendy sighed. “Do whatever you want. If you can’t stand\nthis marriage, just end it. Marriage involves the lives of two individuals. I can’t possibly tie the both of you\ntogether by force.”"
      },
      {
        "paragraph": "To be honest, as a mother, Wendy never thought her son’s emotional intelligence would be so low. It\nmust have been tough on Freya."
      },
      {
        "paragraph": "In the end, Rodney did not even know how he walked out of the Snow family villa."
      },
      {
        "paragraph": "He drove back to his villa. After asking the housekeeper, he found out Freya had packed some stuff and\nleft with Dani. Even Mrs. Lynch left with her too. Upon leaving, Mrs. Lynch notified the housekeeper that"
      },
      {
        "paragraph": "they were returning to Melbourne for some time."
      },
      {
        "paragraph": "Freya had gone back to Melbourne…"
      },
      {
        "paragraph": "Rodney sat in the living room in a daze. He did not feel anything in the past as he was used to it, but he\nsuddenly felt that the place was cold and empty."
      },
      {
        "paragraph": "It was as if a part of his heart was empty too."
      },
      {
        "paragraph": "It was so bare that he did not want to spend another minute in that place."
      }
    ]
  },
  {
    "title": "Chapter 1834 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "He was exasperated. He called Chester and Shaun out for drinks at a club."
      },
      {
        "paragraph": "They arrived late at 7:00 p.m."
      },
      {
        "paragraph": "“You guys are too much. I called you guys at 5:oo p.m., yet you only arrived now.” Rodney was upset and\nthrew a tantrum. There was no sign of his high spirits from the baby’s one-month celebration during the\nday."
      },
      {
        "paragraph": "“I only came out after having a meal with Cathy and the kids, ” Shaun said indifferently. He was puzzled.\nWas taking care of the children and accompanying his wife at home bad? Why did he have to be with\ntwo guys here? It was utterly boring."
      },
      {
        "paragraph": "Rodney was depressed. “Are your wife and children more important than your brother?”"
      },
      {
        "paragraph": "“What else?” Shaun raised his eyebrows as if Rodney had asked a stupid question."
      },
      {
        "paragraph": "Rodney’s wounded heart was scattered with salt. He turned around to look at Chester. “What about you?\nI remember you don’t have a wife or children.”"
      },
      {
        "paragraph": "“I was delayed because of a patient. ” Chester sat on a tall chair and poured a glass of red wine. “You\nhave a wife and a child, but why aren’t you with them at home?”"
      },
      {
        "paragraph": "Speaking of that, Rodney felt remorseful. “They went home to their maternal family.”"
      },
      {
        "paragraph": "Maternal family? Melbourne?"
      },
      {
        "paragraph": "Chester and Shaun looked at Rodney simultaneously. “What did you do again?”"
      },
      {
        "paragraph": "What did they mean by “again”? Was he such a terrible person?"
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Fine! Rodney admitted that he was a little stupid… Rodney explained to them what had happened."
      },
      {
        "paragraph": "Chester and Shaun exchanged glances after listening to Rodney. They went silent after that."
      },
      {
        "paragraph": "After some time, Shaun said while feeling bizarre, “ Are you really my brother? You can’t possibly be a\nfake, right? I don’t think I would’ve become brothers with you. I’m quite picky.”"
      },
      {
        "paragraph": "“Get lost.” Rodney glared at Shaun angrily. “Shaun, I have a lot of photos of us together. Don’t even think\nof shaking me off.”"
      },
      {
        "paragraph": "Chester shrugged. “Why don’t you get a divorce? Although I shouldn’t separate you guys,  I think Freya\nmay not be suitable for you. You’re more suited to be with those conservative women who’re meek,\nobedient, gentle, and tolerant.”"
      },
      {
        "paragraph": "“I agree.” Shaun nodded. “Actually, with your conditions,  it’s quite easy  to find that kind of woman. They\ndon’t need love. They only need you  to bring honor, reputation, and benefit to their families.”"
      },
      {
        "paragraph": "“Or rather, I suppose there are a lot of women like that out there…”"
      },
      {
        "paragraph": "“Enough.”"
      },
      {
        "paragraph": "Rodney cut  them off with a dark expression.  “I didn’t call you guys out to listen to you  telling  me  to\nchange my wife. If I did, what would happen to Dani?”"
      },
      {
        "paragraph": "“If the relationship between you and Freya isn’t good, Dani will be caught in between you two. She’ll\nhave to listen to both of you quarreling every day. In the long run, it’s not good for the child either. ” After\nall, Shaun was a father. He had some experience in this aspect."
      },
      {
        "paragraph": "“There’s a lot of illegitimate children and divorced couples in wealthy families, so there’s no need to make\na big deal out of it, ” Chester said indifferently."
      },
      {
        "paragraph": "Rodney was utterly speechless from their words."
      },
      {
        "paragraph": "He spoke again after a while, “No, you guys don’t understand. Ryan likes Freya. If I get a divorce, she\nmight become my sister-in-law in the future."
      },
      {
        "paragraph": "Won’t that be messed up?”"
      },
      {
        "paragraph": "“Ryan?” A hint of astonishment flashed across Shaun’s eyes. “He’s Prime Minister Snow’s son, right? We\ninteracted once previously. He keeps his tricks well-hidden, and he has his father’s style. It seems like\nhis ambitions aren’t small either. He’s young, yet he’s already holding an important position in Australia’s\ngovernment. He may even become Australia’s prime minister one day. If Cathy finds out that her best\nfriend can become the prime minister’s wife, she’ll be pleased.”"
      }
    ]
  },
  {
    "title": "Chapter 1835 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "Chester said, “Isn’t that quite good? Ryan is a member of the Snow family too. Freya can still take care\nof Dani. Moreover, if Dani has a prime minister’s wife as a mother, she’ll have Australia in the palm of her\nhands.”"
      },
      {
        "paragraph": "“Why would my daughter want Australia in the palm of her hands? She’s only a month old! ”"
      },
      {
        "paragraph": "Rodney almost died from anger because of them. “ Are you guys still my brothers? Are your words even\nhuman language?”"
      },
      {
        "paragraph": "“We’re just stating the truth.”"
      },
      {
        "paragraph": "Chester took a sip of red wine and put down the wine glass. There was confusion in his gaze. “What\nabout you? You kept saying you didn’t want a divorce. You said it’s for Dani’s sake, but after we helped\nyou analyze it, either a divorce or not will still impact Dani. So what are you struggling with? Is it really for\nthe sake of the child or a woman?”"
      },
      {
        "paragraph": "Chester got straight to the point."
      },
      {
        "paragraph": "Rodney was taken aback. He was at a loss."
      },
      {
        "paragraph": "Shaun snorted. “You can’ t even feel whether you like a woman or not?”"
      },
      {
        "paragraph": "Like?"
      },
      {
        "paragraph": "Did he like Freya?"
      },
      {
        "paragraph": "Rodney was confused."
      },
      {
        "paragraph": "Let me go, Mr. Hill By Shallow South"
      },
      {
        "paragraph": "He recalled when he liked Sarah back then. He wanted to obey her every single moment. He would\nsatisfy everything Sarah wanted, even if it meant becoming a person he hated."
      },
      {
        "paragraph": "However, to Freya…"
      },
      {
        "paragraph": "Shaun swirled the wine glass. “Liking someone means you want to be with her every single moment.\nYou’ll feel like getting intimate  and having sex with her. Even if you guys quarreled, you’d still want to\ntalk to her. As long as she smiles for you, you’ll feel happy for no reason. Also, you’ll be uncomfortable\nand jealous when she’s with another person.”"
      },
      {
        "paragraph": "After pausing for a moment, Shaun suddenly chuckled. “Just like right now, I’m with you two, yet I miss\nCathy a lot.”"
      },
      {
        "paragraph": "After speaking, he used his phone and took a picture of the wine glass in front of him. Then, he sent it to\nCathy. [I miss you.]"
      },
      {
        "paragraph": "Catherine replied to him with a kissing emoji almost immediately."
      },
      {
        "paragraph": "Rodney and Chester were speechless."
      },
      {
        "paragraph": "Did Shaun have to show off his relationship like that?"
      },
      {
        "paragraph": "Chester was okay with it, but Rodney strangely felt bitter and envious."
      },
      {
        "paragraph": "He wanted to be like that with Freya too…"
      },
      {
        "paragraph": "Wait, why would he think of sending “I miss you” to Freya… With a kissing emoji."
      },
      {
        "paragraph": "Did he really fall in love with Freya?"
      },
      {
        "paragraph": "Thinking carefully, although Rodney and Freya often quarreled, he still liked to be with her. Even if they\nwere bickering,  he always found it interesting."
      },
      {
        "paragraph": "He would always want to get intimate with her. Sometimes, he would want to kiss her little mouth."
      },
      {
        "paragraph": "Chester swirled the liquid in the wine glass. “I don’t know love as much as Shaun but I do know that in\nthe morning or at midnight… When that part of yours is aching for a release, who is the woman you’ll\nvisualize in your head… Is Sarah the person you’d think of?”"
      },
      {
        "paragraph": "“Of course not.”"
      },
      {
        "paragraph": "Rodney denied it immediately. His heart skipped a beat."
      },
      {
        "paragraph": "His mind would be filled with Freya during those times…"
      },
      {
        "paragraph": "Thinking about that, Rodney’s face blushed in embarrassment."
      },
      {
        "paragraph": "“You should already understand now by whom you think of at those times.” Chester smiled seductively."
      },
      {
        "paragraph": "Shaun gave Chester a profound glance. “ It seems like you’re quite experienced in this area. Who’s the\nwoman that you’ll think of?”"
      },
      {
        "paragraph": "Chester’s body stiffened."
      },
      {
        "paragraph": "He would think of Charity in the past."
      },
      {
        "paragraph": "Whenever he was aching, he would unconsciously think of Charity’s face. Although he would think  she\nwas dirty before, he could not control his mind whenever the moment of release came. However, the\nwoman who appeared lately was Eliza."
      },
      {
        "paragraph": "He had countless women before, but  the ones that he would think of at night were those two."
      },
      {
        "paragraph": "“Do I even have to think of a woman? I’m never short of women by my side, ” Chester said indifferently."
      }
    ]
  },
  {
    "title": "Chapter 1836 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Sc*mbag. ” After Rodney complained, he gulped down the wine."
      },
      {
        "paragraph": "“I have to leave.” Shaun stood up. “I want to go back home to be with Cathy.”"
      },
      {
        "paragraph": "Rodney was dumbfounded. He was angry too. “Do you have to do this? You guys were with each other\nall the time overseas. We only met this one time in a month.”"
      },
      {
        "paragraph": "“ If it weren’t for you bawling in the group chat, I wouldn’t even have come over. ” Shaun glanced at\nRodney indifferently. “Do you really want to stay here? If you didn’t fight with Freya, you wouldn’t have\nthought of us, right?”"
      },
      {
        "paragraph": "Rodney was rendered speechless."
      },
      {
        "paragraph": "In the past, he liked to have fun with his brothers. At that moment… He suddenly wanted to return\nhome to take care of his child… Then cook something for Freya to replenish her body."
      },
      {
        "paragraph": "Why did he become like this? He was shocked."
      },
      {
        "paragraph": "Had he become a househusband?"
      },
      {
        "paragraph": "“Err… I just recalled I have something to do. I’ll be leaving first.”"
      },
      {
        "paragraph": "Rodney stumbled as he stood up. He walked even faster than Shaun."
      },
      {
        "paragraph": "What on earth did Rodney remember?"
      },
      {
        "paragraph": "“I’m leaving too. You pay the bill.” Shaun patted Chester’s shoulder."
      },
      {
        "paragraph": "The corners of Chester’s mouth twitched."
      },
      {
        "paragraph": "What did he do wrong? He was kind enough to come over to accompany his brother, yet it ended up\nwith him being the one left behind."
      },
      {
        "paragraph": "Chester chuckled. He gazed at the red wine in the glass."
      },
      {
        "paragraph": "During such a night, he suddenly thought of a woman."
      },
      {
        "paragraph": "Too bad… She was busy filming in another place lately."
      },
      {
        "paragraph": "After giving it some thought, Chester gave Shedrick a call. “When Eliza is done filming Director\nCheever’s movie, make it so that her schedules"
      },
      {
        "paragraph": "aren’t too far from Canberra afterward.”"
      },
      {
        "paragraph": "Shedrick was speechless. “Eliza is a goose that lays golden eggs. Can you not hinder the company\nfrom gaining profits?”"
      },
      {
        "paragraph": "“No, I’m not short of money. I lack a woman.” Chester hung up after he spoke."
      },
      {
        "paragraph": "Rodney bought an air ticket to Melbourne that night."
      },
      {
        "paragraph": "When he arrived at the door of the Lynch family’s villa, it was already 11:00 p.m."
      },
      {
        "paragraph": "He took a deep breath and pressed the doorbell."
      },
      {
        "paragraph": "After roughly ten minutes, Mrs. Lynch walked out tiredly in her pajamas."
      },
      {
        "paragraph": "“Mrs. Lynch, I’m sorry to have disturbed your sleep at such a late hour.”"
      },
      {
        "paragraph": "With an automatic gate between them, Rodney quickly apologized with a flushed face. “I want to g o in\nand have a look at Dani and Freya…”"
      },
      {
        "paragraph": "Mrs. Lynch frowned and gazed at Rodney for a while. She sighed. “Freya isn’t  in a good mood. She’s\nstill angry. Sleep at a hotel tonight and come over again tomorrow. However, I guess she’ll want to\ndivorce you if you come over tomorrow.”"
      },
      {
        "paragraph": "“ I don’t want to get a divorce.” Rodney clenched his fists in regret. “ I know I was in the wrong this\nevening. I’m here to apologize to her.”"
      },
      {
        "paragraph": "“I don’t understand why you young people have to fight as such during the baby’s one-month\ncelebration. However, Freya cried. You must’ve hurt her. I know my daughter well. She’s not one to\nshed tears easily. Her dad and brother are furious. You should figure it out yourself.”"
      },
      {
        "paragraph": "Mrs. Lynch returned to the villa after saying her piece."
      },
      {
        "paragraph": "Mr. Lynch and Forrest were in the living room. The security guard had informed them when Rodney\nappeared but they refused to talk to Rodney. It was Mrs. Lynch who was soft-hearted."
      },
      {
        "paragraph": "“Why did he come? How does he still have the audacity to come?” Mr. Lynch said angrily, “He angered\nFreya on the first day after postpartum confinement.”"
      },
      {
        "paragraph": "Mrs. Lynch wanted to say something, but the sound of the baby crying came from upstairs. “I don’t\nwant him to come in, but Dani is used to having Rodney by her side every night. Look, she’s crying\nharder as Rodney isn’t here tonight.”"
      },
      {
        "paragraph": "She went upstairs when she finished speaking."
      }
    ]
  },
  {
    "title": "Chapter 1837 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Mrs. Lynch said,  “It’s because  she’s not accustomed to the change in environment. Rodney spends\nthe most time with her, so she probably wants her father to hold her…”"
      },
      {
        "paragraph": "“Mom, don’t say his name.”"
      },
      {
        "paragraph": "Hearing his name now made Freya angry. Even when she looked at the little bundle in her arms, she\nfelt a little resentful. “Do you really want that *sshole Rodney? Let me tell you. He only took care of you\nfor a while. I was the one who worked so hard t o give birth to you. You’re so heartless.”"
      },
      {
        "paragraph": "As if she understood that her Mommy was accusing her, Little Dani cried even harder."
      },
      {
        "paragraph": "“Why are you blaming her? She’s still so young. What would she know? She’ll hurt her throat crying.”"
      },
      {
        "paragraph": "Mrs. Lynch quickly carried Dani and coaxed her."
      },
      {
        "paragraph": "Freya sat on the bed, looking exhausted and bewildered."
      },
      {
        "paragraph": "She really did not know how her life ended up like this."
      },
      {
        "paragraph": "Under Mrs. Lynch’s patient coaxing, Dani finally fell asleep."
      },
      {
        "paragraph": "After placing Dani in the cot, Mrs. Lynch said, “ Rodney is at the door…”"
      },
      {
        "paragraph": "“Don’t let him in.” Like a firecracker that had been lit on fire, Freya immediately exploded. “I don’t want\nto see him ever again. What is he here for?"
      },
      {
        "paragraph": "Does he want to take Dani away? Dream on. I gave birth to Dani, so I’ll raise her.”"
      },
      {
        "paragraph": "“He didn’t say he wanted to take Dani away, but… If he really tries to take her away from you, will you\nbe able to stop him?” Mrs. Lynch sighed. “The whole Snow family is behind him. Yes, you’re the prime\nminister’s goddaughter, but why did he acknowledge you as his goddaughter in the first place? It was\nbecause of Rodney.”"
      },
      {
        "paragraph": "Freya looked at the sleeping Dani. Her heart ached."
      },
      {
        "paragraph": "She did not understand the pain of losing a child before she became a mother. Yet now, the thought of\na divorce and the child going with Rodney made her feel like her heart was being torn apart."
      },
      {
        "paragraph": "“Mom, you should rest,” Freya said in a low voice."
      },
      {
        "paragraph": "She wanted to be left alone to calm down. After Mrs. Lynch left, Freya did not sleep. She missed the\npast."
      },
      {
        "paragraph": "She missed the ignorant but passionate Freya Lynch in her adolescence."
      },
      {
        "paragraph": "These years, she had gone through so much that she suddenly found herself exhausted."
      },
      {
        "paragraph": "It was especially so when Dani began to cry again in the middle of the night."
      },
      {
        "paragraph": "The nanny and she were unable to coax her no matter how hard they tried."
      },
      {
        "paragraph": "With the child’s hysterical crying ringing in her ears, Freya broke down and hugged her head in her\nhands."
      },
      {
        "paragraph": "The nanny said softly, “Why don’t you call her father in? I heard the guard say that he’s still outside. He\ndidn’t leave.”"
      },
      {
        "paragraph": "Freya froze."
      },
      {
        "paragraph": "After two seconds of silence, she went out with the baby in her arms."
      },
      {
        "paragraph": "Rodney was leaning against the wall. Just as he was fighting to keep his eyelids open, the electric gate\nbehind him suddenly opened."
      },
      {
        "paragraph": "He turned around, only to see Freya come out in pearl-colored silk pajamas that outlined her charmful\nfigure in the night breeze. Dani was laying in her arms, crying and wailing so hard that her voice\nseemed a little hoarse."
      },
      {
        "paragraph": "“What happened to Dani?” He hurriedly and eagerly went over to hold the child."
      },
      {
        "paragraph": "Miraculously, Dani stopped crying the moment she got into his arms and even broke into a smile."
      },
      {
        "paragraph": "At that moment, Freya’s heart seemed to be doused in iced water."
      },
      {
        "paragraph": "Perhaps it was because she did not hold Dani much during her confinement period, so Dani became\nvery dependent on Rodney."
      },
      {
        "paragraph": "Hah."
      },
      {
        "paragraph": "Rodney had once asked her to have an abortion, and he even hated the child before."
      },
      {
        "paragraph": "However, the child did not know. She was like a blank canvas."
      },
      {
        "paragraph": "All she could remember was who treated her well after she was born."
      },
      {
        "paragraph": "The nanny lamented, “It was because her father wasn’t around.”"
      },
      {
        "paragraph": "Rodney bowed his head and kissed Dani’s little face. His heart almost melted."
      },
      {
        "paragraph": "He was too proud of his little darling."
      },
      {
        "paragraph": "“Look, the child needs me.” Rodney raised his eyebrows and said."
      },
      {
        "paragraph": "Seeing his delighted expression, Freya blurted out in a fit of fury, “Since she likes you so much,  then\njust take her with you.”"
      }
    ]
  },
  {
    "title": "Chapter 1838 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Then, Freya turned around and walked into the villa."
      },
      {
        "paragraph": "She was just a tool to give birth and breastfeed anyway."
      },
      {
        "paragraph": "How much affection would the child have for her?"
      },
      {
        "paragraph": "Stunned, Rodney quickly chased after her. “Freya, what do you mean? Don’t involve the child in our\nquarrels. She’s innocent. How can a child leave her mother? If she leaves you today, she’ll definitely\ncry even harder.”"
      },
      {
        "paragraph": "He did not know which word triggered Freya, but she suddenly broke down and cried."
      },
      {
        "paragraph": "She turned around and screamed with eyes full of tears. “Do you think I want to leave her? She’s my\nflesh and blood. But what can I do? Do you want me to suffer with you for the sake of the child? I’ve\nhad enough. I can’t give her a complete home. Your family is so powerful, so I can’t fight  you either,\nand I don’t want to continue this marriage anymore. I’m so tired.”"
      },
      {
        "paragraph": "Rodney looked at her red eyes, at a loss."
      },
      {
        "paragraph": "She cried again."
      },
      {
        "paragraph": "She just wanted to divorce him. She was even willing to give up the child."
      },
      {
        "paragraph": "His heart clenched painfully."
      },
      {
        "paragraph": "He did not know if he was hurt by her decision or upset by her crying."
      },
      {
        "paragraph": "He just felt very miserable."
      },
      {
        "paragraph": "He wanted to slap himself to death."
      },
      {
        "paragraph": "As if she could sense her parents quarreling, Dani cried again."
      },
      {
        "paragraph": "The nanny said, “Don’t fight in front of  the child. It’s bad for her. Let’s talk about it in the morning. ”"
      },
      {
        "paragraph": "Freya felt her heart ache for Dani. “Let the child and him sleep in the guest room, Aunty Lynn. Bring all\nthe child’s stuff over to him.”"
      },
      {
        "paragraph": "She said hoarsely before turning and leaving."
      },
      {
        "paragraph": "Rodney watched her figure disappear and only then did he slowly follow behind her."
      },
      {
        "paragraph": "Dani soon fell asleep in his arms."
      },
      {
        "paragraph": "He looked at the baby’s sweet sleeping face, but he could not sleep."
      },
      {
        "paragraph": "After a long time, he took a picture of Dani and sent it to Freya. [Look how cute she is when she’s\nsleeping. Don’t you want to see her sleeping like this at all? I was wrong today and let my mouth run. I\nshouldn’t have admonished you in front of so many people at the poker table. Don’t be angry, okay?\nEven if it’s just for Dani, let’s give her a complete home. I promise that I’ll change.]"
      },
      {
        "paragraph": "However, there was no reply even a long time after the message was sent."
      },
      {
        "paragraph": "Upstairs, Freya saw the message and saved Dani’s picture. Then, she deleted the message directly."
      },
      {
        "paragraph": "He said he would change?"
      },
      {
        "paragraph": "He had said that too when she went into premature labor. Who would believe him?"
      },
      {
        "paragraph": "Actually, there were no huge conflicts between Rodney and her."
      },
      {
        "paragraph": "Now that Sarah was gone, her private life was quite good."
      },
      {
        "paragraph": "Nevertheless, she just felt that this marriage was very tiring."
      },
      {
        "paragraph": "In fact, she really envied Cathy, even though she had gone through so much with Shaun."
      },
      {
        "paragraph": "At least they still loved each other."
      },
      {
        "paragraph": "However, there was no such thing between Rodney and her."
      },
      {
        "paragraph": "She took out the picture of Dani sleeping, and her eyes watered again."
      },
      {
        "paragraph": "It seemed like she cried more easily after giving birth to a child."
      },
      {
        "paragraph": "How depressing."
      },
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "She did not come out of the bedroom until 10:00 a.m."
      },
      {
        "paragraph": "As soon as she opened the door, she heard the sound of a child’s laughter."
      },
      {
        "paragraph": "She forced herself not to look or listen and went straight to the dining hall to have breakfast."
      },
      {
        "paragraph": "All the food that entered her mouth was tasteless."
      }
    ]
  },
  {
    "title": "Chapter 1839 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Before long, Rodney walked over."
      },
      {
        "paragraph": "He had changed into one of Forrest’s black shirts. It was the first time she saw him wearing such a dark\ncolor. However, coupled with his beautiful eyes, it changed his temperament completely. He seemed a\nlittle duller and more mature now."
      },
      {
        "paragraph": "“I’m sorry…” He walked up to her and said in a low voice, “ I spoke in a fit of anger yesterday. I didn’t\nmean it— ”"
      },
      {
        "paragraph": "“When are you going to divorce me?” Freya interrupted him."
      },
      {
        "paragraph": "Rodney froze and said after a moment, “I won’t divorce you. You saw how Dani was last night."
      },
      {
        "paragraph": "Whether she leaves you or me, she won’t be able to sleep through the night. She’ll cry easily too."
      },
      {
        "paragraph": "Although she slept with me last night, she still got up and cried twice.”"
      },
      {
        "paragraph": "Freya sneered. “She only cried because she wanted my milk.”"
      },
      {
        "paragraph": "Rodney frowned. “Freya, why do we have to drag Dani into our quarrels? She’s just a child who doesn’t\nknow anything.”"
      },
      {
        "paragraph": "Freya felt like she was stabbed in the heart. “Do you think I want  to do this? I hate  seeing myself  like\nthis, but you forced my hand. Rodney Snow, did you forget how you apologized and admitted your\nmistakes the day I gave birth to Dani? Yet, what did you do yesterday? I can’t trust your words at all.”"
      },
      {
        "paragraph": "It was true. Yesterday at noon, Rodney helped her teach those young ladies a lesson."
      },
      {
        "paragraph": "She really wanted to get along with him at first, but then he said those words in the afternoon. Was he\nstill a man?"
      },
      {
        "paragraph": "“I… I was stupid.”"
      },
      {
        "paragraph": "Rodney blushed and said those shocking words. As matters stood, he could only steel himself and say,\n“ I… I didn’t realize that what I said when you were playing yesterday embarrassed you. When I saw\nyou storm out, I thought you were unhappy because"
      },
      {
        "paragraph": "you lost. Then, you said that I was annoying, and those words hurt me too…”"
      },
      {
        "paragraph": "Freya did not know what to say. She was speechless."
      },
      {
        "paragraph": "He actually realized that he was stupid. “That’s because— ”"
      },
      {
        "paragraph": "“Hear me out.”"
      },
      {
        "paragraph": "Rodney suddenly interrupted her. A dim light flashed in his eyes. “Yes, I know I am very annoying.\nWhen Sarah broke up with me and wanted to get rid of me, she also said I was annoying.  I can’t\ncompare  to Shaun and Chester."
      },
      {
        "paragraph": "If it weren’t for the fact that Chester didn’t like her, I wouldn’t even have had  the chance  to be her\nfallback guy. I also know that my EQ isn’t as high as Shaun’s or Chester’s, and I’m not as romantic as\nthem. As someone’s fallback guy for more than ten years, I can’t take it when people say I’m annoying.\nIt’s because… those words of yours dug up the most embarrassing part of me."
      },
      {
        "paragraph": "“ I couldn’t control myself and said a lot of harsh words. I’m really sorry.”"
      },
      {
        "paragraph": "His beautiful eyes revealed how vexed and regretful he was. “You don’t have to take those words\nseriously. You’re actually… really beautiful. If you weren’t pregnant with my child, I think many men\nwould pursue you for your looks and skills. On the contrary, I may be noble in status, but my business\nskills aren’t as good as Shaun’s, my EQ isn’t as good as Chester’s, and my political skills aren’t as\ngood as Ryan’s. My mom also said that with my personality, I wouldn’t have been able to find a wife in\nmy life if you didn’t marry me."
      },
      {
        "paragraph": "“In fact, I already knew since a long time ago that deep down, you look down on me. I was stupid\nenough to be the fallback guy of a woman like Sarah and stupid enough for her to play me like a fiddle.\nYou must be very unwilling to be with me because I’m a man who even Sarah looked down upon, and\nSarah is the person you hate the most. Maybe you wonder why you should accept a man who Sarah\nlooked down on. After all, you are much better than Sarah in every way…”"
      },
      {
        "paragraph": "Rodney eventually fell silent at the end of his sentence."
      },
      {
        "paragraph": "He was embarrassed."
      },
      {
        "paragraph": "There was even a hint of self-deprecation hung at the corners of his mouth."
      },
      {
        "paragraph": "For a moment, Freya forgot that she was angry. Instead, she was shocked, and her face grew a little\nhot at the second half of his speech."
      },
      {
        "paragraph": "She did not expect Rodney to know what she was thinking."
      },
      {
        "paragraph": "Yes, the most she used to complain to Cathy about was why she had to pick up trash that Sarah did\nnot want."
      },
      {
        "paragraph": "However, it was quite rude to have such thoughts."
      },
      {
        "paragraph": "Sarah’s personality was problematic, so how could they be sure that what she did not want was\nautomatically trash?"
      },
      {
        "paragraph": "Besides, what right did she have to laugh at Rodney? She was also abandoned by Patrick."
      },
      {
        "paragraph": "Rodney was just like her. They fell in love with the wrong person in their youth and thought their\nunconditional love would bear fruit."
      }
    ]
  },
  {
    "title": "Chapter 1840 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rodney’s beautiful face in front of her suddenly sank in sadness."
      },
      {
        "paragraph": "Freya’s heart softened at such a good-looking face. She could not bear to see him like this."
      },
      {
        "paragraph": "“Actually, you aren’t that bad. You just fell in love with a love rat when you were young. Wasn’t I the\nsame? Besides, the one who was hurt the most wasn’t you but Shaun. He got divorced and almost lost\nhis money, as well as any chance of a future with Cathy and his children. Sarah spent his money for\nmore than ten years. To be honest, if Cathy didn’t save him, he would probably still be cheated by\nSarah now.”"
      },
      {
        "paragraph": "Rodney froze."
      },
      {
        "paragraph": "What she said seemed true."
      },
      {
        "paragraph": "When it came to being cheated by Sarah, did he have it as bad as Shaun?"
      },
      {
        "paragraph": "He suddenly felt like praising Shaun. That man was also an idiot."
      },
      {
        "paragraph": "Freya continued, “Besides, don’t think Chester has high EQ either. Hah. Wasn’t he deceived by Sarah\ntoo? Back then, when the three of you targeted Cathy, he was also on your side. In the end, Sarah’s\nschemes were just too good.”"
      },
      {
        "paragraph": "Rodney looked at the woman in front of him complicatedly. “Freya, are you comforting me?”"
      },
      {
        "paragraph": "Freye’s face began to hurt."
      },
      {
        "paragraph": "No, she was supposed to be fighting with him. Why was she comforting him instead?"
      },
      {
        "paragraph": "“You think too much.” She became annoyed."
      },
      {
        "paragraph": "However, Rodney grinned with his eyes. “My mom was right. You’re really a nice girl. I was blind in the\npast and couldn’t tell how good you were.”"
      },
      {
        "paragraph": "“You really are blind. No, you also have low EQ. And you’re stupid.” Freya snorted."
      },
      {
        "paragraph": "“Yes, I’m the stupidest person alive.” Rodney looked at her intently and said in a low tone, “ You’re so\ngood, yet I didn’t know how to cherish you.”"
      },
      {
        "paragraph": "Freya was speechless."
      },
      {
        "paragraph": "Why did she feel like something was off with Rodney?"
      },
      {
        "paragraph": "Did he wake up from the wrong side of the bed? His gaze was also strange."
      },
      {
        "paragraph": "His already beautiful eyes now seemed like there were sparks in them."
      },
      {
        "paragraph": "It made her feel very uncomfortable."
      },
      {
        "paragraph": "“Freya, let’s live a good life together, okay?”"
      },
      {
        "paragraph": "Rodney suddenly grabbed her hand and took a deep breath. His ears heated up as he said a little\nshyly, “ I actually… have some feelings for you…”"
      },
      {
        "paragraph": "“Clatter.”"
      },
      {
        "paragraph": "The spoon in Freya’s hand fell into the bowl. She felt like lightning had struck her brain."
      },
      {
        "paragraph": "What did he say?"
      }
    ]
  },
  {
    "title": "Chapter 1841 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "What did Rodney say? He must have gone mad."
      },
      {
        "paragraph": "Freya stood up in a panic. However, she did not notice that her feet were hooked to the stool, so she\nfell backward onto the ground with the chair."
      },
      {
        "paragraph": "Pain shot up her body. She wanted to cry."
      },
      {
        "paragraph": "Sure enough, Rodney and she were not compatible at all."
      },
      {
        "paragraph": "“Are you okay? Get up.” Rodney quickly reached out to pick her and the chair up. “Did you hurt\nyourself?”"
      },
      {
        "paragraph": "He reached out to touch the back of her head and even rubbed it gently."
      },
      {
        "paragraph": "Freya avoided him in fright. “Rodney Snow, are you possessed?”"
      },
      {
        "paragraph": "Rodney’s handsome face darkened. It was not easy for him to muster the courage to reveal his\nfeelings, but he did not expect Freya to think of him like this."
      },
      {
        "paragraph": "“I’m very clear-headed now.”"
      },
      {
        "paragraph": "He gritted his teeth and said stiffly, “Is it so strange that I like you?”"
      },
      {
        "paragraph": "“Of course it is. The two of us have done nothing but fight and quarrel ever since we met.” Freya\npursed her lips with mixed feelings. “And you’ve done so many things to hurt me…”"
      },
      {
        "paragraph": "“That was in the past,” Rodney said in chagrin. “ I was blind before. If I could go back, I would never do\nthose things to you. Freya, we’re married and"
      },
      {
        "paragraph": "have a child together now. I really do like you and want to live a happy life with you. I won’t repeat what\nI did yesterday ever again. If I do anything that makes you unhappy, you can just tell me. I’ll change.”"
      },
      {
        "paragraph": "“Enough. Stop talking.”"
      },
      {
        "paragraph": "Freya felt like she was going crazy. She covered her ears. “I need to calm down.”"
      },
      {
        "paragraph": "She rushed upstairs without wanting to eat her breakfast anymore."
      },
      {
        "paragraph": "Rodney was dejected. Was it so strange for him to like her?"
      },
      {
        "paragraph": "“Do you really like my sister?”"
      },
      {
        "paragraph": "A cold voice suddenly sounded behind him."
      },
      {
        "paragraph": "Rodney turned around, only to see Forrest’s cold and handsome face. He was startled. “Forrest…”"
      },
      {
        "paragraph": "“Do you really like her, or are you just saying that because you don’t want a divorce for the sake of the\nchild?” Forrest stared at him indifferently, his eyes filled with scrutiny."
      },
      {
        "paragraph": "“O-of course. I really like her, ” Rodney quickly said."
      },
      {
        "paragraph": "“Then what do you like about her?” Forrest raised his  eyebrows.  “ I recall you both fight constantly. ”"
      },
      {
        "paragraph": "“Can’t I like her even if we fight?” Rodney scratched his neck. “Every time I quarrel with her and see\nher puff up in anger, I find her very cute. Some people develop feelings by fighting with each other.”"
      },
      {
        "paragraph": "Forrest’s thin lips said coldly, “But I don’t see my sister developing feelings for you after all that fighting.\nAll I see is that she’s always so angry with you that she wants a divorce.”"
      },
      {
        "paragraph": "Rodney was speechless."
      },
      {
        "paragraph": "Well… Although that was the truth, it was still a little uncomfortable to be told the truth."
      },
      {
        "paragraph": "“ I heard you used to have a crush on a woman for more than ten years.” Forrest suddenly changed the\ntopic, but this topic made Rodney even more embarrassed."
      },
      {
        "paragraph": "“That was a long time ago…”"
      },
      {
        "paragraph": "“How good were you to that woman? You say you like Freya, but do you treat Freya a tenth as well as\nyou treated that woman?” Forrest asked again."
      },
      {
        "paragraph": "Rodney’s handsome face suddenly paled."
      },
      {
        "paragraph": "He really did treat Sarah differently. Back then, he regarded Sarah as his goddess."
      },
      {
        "paragraph": "He followed whatever she said and could not bear to say anything that hurt her. As long as she called,\nhe would rush to her right away no matter even if he was abroad."
      },
      {
        "paragraph": "If anyone said anything bad about Sarah, he would instantly get furious."
      },
      {
        "paragraph": "“Since you don’t even treat Freya a fraction as well as you did that woman, what right do you have to\nsay that you like Freya? Is my sister inferior to that woman?” Forrest snorted coldly before turning to\nleave."
      }
    ]
  },
  {
    "title": "Chapter 1842 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rodney stood rooted to the ground in a daze for a long time."
      },
      {
        "paragraph": "The conversation with Forrest suddenly enlightened him."
      },
      {
        "paragraph": "Would it be fine as long as he treated Freya the same way he did Sarah from now on?"
      },
      {
        "paragraph": "Upstairs."
      },
      {
        "paragraph": "Freya lay in bed with her thoughts flashing in her mind at a thousand miles an hour."
      },
      {
        "paragraph": "That *sshole Rodney actually said he liked her. He liked her?"
      },
      {
        "paragraph": "What the f*ck. What did he like about her? She could not tell at all."
      },
      {
        "paragraph": "Was he just saying that so she would stay as a free milk-giver?"
      },
      {
        "paragraph": "She suddenly sat up and called Catherine. However… no one answered."
      },
      {
        "paragraph": "She was depressed. She could only talk about such matters of the heart with Catherine."
      },
      {
        "paragraph": "Since Catherine did not answer, she would try harder."
      },
      {
        "paragraph": "After five or six calls, Catherine’s voice suddenly sounded. However, her voice sounded indescribably\nflirtatious."
      },
      {
        "paragraph": "Next to her was Shaun’s annoyed and husky voice. “ Who is it? They must be insane for calling so\nmany times.”"
      },
      {
        "paragraph": "“Shut up and get lost, ” Catherine scolded him. “Cathy…”"
      },
      {
        "paragraph": "“ It’s Freya. It might be something important. Get out already.” Catherine had to beg him."
      },
      {
        "paragraph": "“Then, I’ ll come in later,” Shaun said reluctantly and finally left."
      },
      {
        "paragraph": "Freya looked at the time and felt like she was struck by lighting. “What the f*ck. Did I interrupt you two\ndoing… that?”"
      },
      {
        "paragraph": "“No, it’s almost 11 a.m. now, and you’re still in bed?” Freya was shocked. “Are you guys that hungry for\neach other? Don’t you get tired?”"
      },
      {
        "paragraph": "“Shut up.” Catherine’s face flushed red. “You don’t understand. We have children, so… some things\ncan only be done in the day.”"
      },
      {
        "paragraph": "“Tsk tsk. You’ve changed, Cathy. You’ve fallen. Shaun has led you astray. You—”"
      },
      {
        "paragraph": "“Why did you call me so many times?” Catherine interrupted her and forcibly changed the subject. “ Are\nyou going to tell me you actually got divorced?”"
      },
      {
        "paragraph": "“No.” Freya immediately remembered the real purpose, and a complicated feeling welled up in her\nagain. “But it’s quite shocking. Rodney actually confessed to me. He said he likes me, but what do you\nthink he means? Does he think that if he says he likes me, I will be willing to stay as a mother, provide\nmilk, and give his child a complete family all for free? Is he toying with me? How could he possibly like\nme?”"
      },
      {
        "paragraph": "“Why is it impossible?”"
      },
      {
        "paragraph": "“Is what he did to me proof of how he likes me? Look at how he treated Sarah in the past. He treated\nher like his goddess, but he has never treated me well before. All he knows how to do is make me"
      },
      {
        "paragraph": "angry. He called me an idiot and said that he gets sick when he sees me, that no other man in the\nworld would marry me if he didn’t marry me. Do you think he would have dared to say such words to\nSarah?”"
      },
      {
        "paragraph": "Catherine was almost shaken by what she said."
      },
      {
        "paragraph": "However, she suddenly remembered that Shaun and Rodney went drinking last night."
      },
      {
        "paragraph": "“I think you think too highly of Rodney, ” Catherine said. “With his EQ he’s not smart enough to say that\nhe likes you just to trick you into giving the child a complete home. He’s not a despicable person by\nnature. The things he did before were because someone tricked him.”"
      },
      {
        "paragraph": "“That’s true…” Catherine smiled. “Why can’t Rodney like you? We were the two most beautiful girls\nback in Melbourne. When we were students, you received as many love letters as I did. When we went\nout, we were the focus of attention no matter where we went. Besides, if he could like a woman like\nSarah, isn’t it normal that he would like you?”"
      }
    ]
  },
  {
    "title": "Chapter 1843 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Compared to Sarah, you’re much more beautiful, capable, smarter, genuine, and kinder. Moreover,\nyou have a better family background and a hotter figure. You beat her in all aspects. It’s normal for him\nto develop feelings after being with such an excellent person every day.”"
      },
      {
        "paragraph": "“What you said… seems quite reasonable.”"
      },
      {
        "paragraph": "Freya was overwhelmed by Catherine’s words. “ I really am quite an excellent person. I almost forgot\nhow exceptional I am.”"
      },
      {
        "paragraph": "“That’s because you’ve been at home taking care of your child for a long time. Also, what happened\nwith Patrick and Thomas caused you to lose confidence.”"
      },
      {
        "paragraph": "Freya was silent for a moment."
      },
      {
        "paragraph": "Yes, the incident with Thomas dealt her a huge blow."
      },
      {
        "paragraph": "“Freya, that was in the past. We have no idea where Thomas ran off to, but he’s nothing now. Besides,\nhe didn’t succeed back then either. Believe in"
      },
      {
        "paragraph": "yourself. You’re the best there is. Since your confinement period is over and there’s someone to take\ncare of the child, you should go back to Canberra and start working as soon as possible."
      },
      {
        "paragraph": "Didn’t you say you wanted to set up a cosmetics company and go international? My money is waiting in\nmy pocket, ready to support you at any time.”"
      },
      {
        "paragraph": "“ I love you so much for reminding me, Cathy. Just wait. I, Freya The -Chosen- One Lynch, will carve\nout a new niche in the world cosmetic industry.”"
      },
      {
        "paragraph": "Freya was moved to tears. “I’ve come to my senses. You can continue with Shaun now. Bye-bye.”"
      },
      {
        "paragraph": "On the other side of the phone, Catherine was speechless."
      },
      {
        "paragraph": "How did Freya become the chosen one so suddenly? Women."
      },
      {
        "paragraph": "“Cathy…”"
      },
      {
        "paragraph": "Shaun popped up out of nowhere and held Catherine, kissing her hard."
      },
      {
        "paragraph": "“Stop messing around. You made Freya laugh at me.” Catherine pushed him away."
      },
      {
        "paragraph": "“What’s there to laugh at? What we’re doing is natural for a man and woman who love each other.”"
      },
      {
        "paragraph": "Shaun gave her a hot kiss before asking vaguely, “ Are you really going to start a business with Freya?”"
      },
      {
        "paragraph": "“What’s wrong with starting a business? It’s depraved and boring to live such a senseless life with you\nevery day.” Catherine sighed."
      },
      {
        "paragraph": "Shaun felt attacked."
      },
      {
        "paragraph": "She said it was boring living such a fantastical life."
      },
      {
        "paragraph": "“Babe, I promise that you will never feel bored with me.”"
      },
      {
        "paragraph": "Shaun then pounced on her like a large dog."
      },
      {
        "paragraph": "Melbourne."
      },
      {
        "paragraph": "Freya went downstairs after putting on a face of beautiful and delicate makeup."
      },
      {
        "paragraph": "Rodney looked up after hearing the sound of footsteps."
      },
      {
        "paragraph": "His breath was taken away."
      },
      {
        "paragraph": "Freya had deep—set facial features like a mixed—race person, so coupled with a little dressing up, she\nexuded a completely different temperament. In an orange floral dress layered with a dark orange\nknitted outerwear, enchanting earrings hanging under her earlobe, and a small luxury bag in her"
      },
      {
        "paragraph": "hand, she looked dazzlingly beautiful. Sometimes, humans were strange."
      },
      {
        "paragraph": "When he did not like her, he only thought that she looked beautiful. However, now that he discovered\nthat he liked her, he suddenly felt like everything she wore was stunning."
      },
      {
        "paragraph": "“Where are you going dressed up so beautifully?” Rodney suddenly became alarmed."
      },
      {
        "paragraph": "“None of your business. ” Freya did not even bat an eye at him."
      },
      {
        "paragraph": "“Of course, it’s my business. You’re my wife.”"
      },
      {
        "paragraph": "Freya thought about it and turned back, looking at him like a haughty peacock. “ I’ve thought about it.\nI’m so beautiful and kind, and I have a good family background and higher education. So what if you\nlike me? I feel like you don’t deserve me.”"
      },
      {
        "paragraph": "Rodney’s eyes widened, suddenly shocked by her flamboyant and domineering aura. “I… don’t\ndeserve you?”"
      },
      {
        "paragraph": "“Duh. You’re the prime minister’s nephew, but I’m his goddaughter.”"
      },
      {
        "paragraph": "Then, she changed into a pair of low heels and walked out."
      }
    ]
  },
  {
    "title": "Chapter 1844 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rodney looked at her enchanting little back. Part of him was exasperated, yet another part of him\nwanted her like crazy."
      },
      {
        "paragraph": "Finally, he quickly followed her."
      },
      {
        "paragraph": "When Freya opened the car door, he rushed over to take the car keys from her. “Freya, I think what you\nsaid is very reasonable. I really don’t deserve you. That’s why people like me should be your driver\nwhen you go out. You sit in the back. Where are you going? I’ll send you there.”"
      },
      {
        "paragraph": "He opened the back door for her, looking so eager that Freya felt like she just saw a ghost."
      },
      {
        "paragraph": "“I’m going to look at hunks. Are you sure you want to send me there?” She raised her brows and said\ndeliberately."
      },
      {
        "paragraph": "Rodney’s handsome face immediately stiffened. “ Sure. I can stand by the side and learn what your\ntype is. Then, I’ll wait on you when we get home. ”"
      },
      {
        "paragraph": "“Did you get possessed by a dog?” Freya felt that all this was very weird."
      },
      {
        "paragraph": "“Yes, love turned me into a stray dog.” Rodney smiled. He had finally figured it out."
      },
      {
        "paragraph": "Since he liked Freya, he would spoil her just like he did to Sarah."
      },
      {
        "paragraph": "No, he would spoil her even more because she was much, much better than Sarah."
      },
      {
        "paragraph": "Freya did not know what to say. She was defeated."
      },
      {
        "paragraph": "“I’m going shopping with my former classmates.”"
      },
      {
        "paragraph": "Rodney immediately praised her. “My wife is really beautiful and kind-hearted, so of course she has\nmany friends.”"
      },
      {
        "paragraph": "To be honest, he thought Freya only had two friends, Catherine and Eliza."
      },
      {
        "paragraph": "“Of course I do. I grew up in Melbourne, so I naturally have many friends here. It’s just none of them\ncan compare to my relationship with Cathy.”"
      },
      {
        "paragraph": "Freya snorted and got into the backseat."
      },
      {
        "paragraph": "However, she deliberately made things difficult for Rodney, wanting him to head back as soon as\npossible. Hence, along the way, she kept saying, “ Rodney Snow… why are you driving so fast? Do\nyou want me to get into the accident so you can take the child? Why are you driving so slow? Are you\ntrying to race with a snail? Do you want me to be late?”"
      },
      {
        "paragraph": "Rodney sincerely realized the hard work of being a driver."
      },
      {
        "paragraph": "However, for love, it was all worth it. He did not say a word."
      },
      {
        "paragraph": "Once they were at the destination, Freya said, “Go and buy me a bottle of mineral water. My throat is\ndry because your driving skills are so poor.”"
      },
      {
        "paragraph": "“…Freya, my driving skills might not be very good, but my driving skills in the other aspect are quite\nacceptable.” Rodney blinked his beautiful eyes at her."
      },
      {
        "paragraph": "Freya was stunned. By the time she came to her senses, her whole face had turned red. “You call\nthose skills? How shameless can you be? I don’t agree.”"
      },
      {
        "paragraph": "“Really?” Rodney pouted. He did not believe her. “ But I managed to get you pregnant in just one try.\nIsn’t that amazing?”"
      },
      {
        "paragraph": "“Are you going to get the water or not?” Freya gnashed her teeth, not wanting to discuss this shameful\nmatter here."
      },
      {
        "paragraph": "“Okay, I’ll go,” Rodney said with a wide smile, revealing two of his small dimples. Dani had also\ninherited his dimples. Freya’s heart skipped a beat."
      },
      {
        "paragraph": "Did he have to smile so widely?"
      },
      {
        "paragraph": "Although she called him annoying, she was no match for that beautiful face."
      },
      {
        "paragraph": "However, she did not wait for Rodney and went straight into the mall."
      },
      {
        "paragraph": "Inside, she soon saw a lovely woman standing there with a three or four-year-old boy. The woman was\nHarley Sherman, her high school classmate and a friend who she used to play with in Melbourne."
      },
      {
        "paragraph": "“Freya, it’s been so long.” Harley  greeted her with a smile and teased,  “You’re the princess of\nAustralia now. I never thought you’d still go out shopping with an old classmate. If the other of our\nclassmates knew, they would die of envy.”"
      }
    ]
  },
  {
    "title": "Chapter 1845 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya sighed. “ I’m finally back in Melbourne and just want to have some peace and quiet. I don’t want\nto have any classmates gathering. Oh, is this kid yours? He looks just like you.”"
      },
      {
        "paragraph": "“Honey, greet Aunty Freya.” Harley said, “He’s my son, Sammy. I didn’t want to take  him  out  today,\nbut it just so happened that no one is at home.”"
      },
      {
        "paragraph": "“Hello, Aunty.” The little boy looked up and smiled, but he seemed slightly antsy. He was not running\naround only because Harley was holding onto him."
      },
      {
        "paragraph": "Freya was a little annoyed. It was not as fun to shop and chat with a child around."
      },
      {
        "paragraph": "Just then, Harley suddenly looked behind her with her eyes lit up. “There’s a man behind you. He’s so\nhandsome and beautiful. He’s even more good- looking than celebrities.”"
      },
      {
        "paragraph": "Freya paused and turned around, only to see Rodney-Flashy-Snow walking up to her with a bottle of\nmineral water."
      },
      {
        "paragraph": "“Dear, I got the water you wanted.”"
      },
      {
        "paragraph": "He even unscrewed the bottle cap for her."
      },
      {
        "paragraph": "Harley’s eyes widened as she blurted out, “Are you keeping a little lover behind Young Master Snow’s\nback?”"
      },
      {
        "paragraph": "Freya was shocked by her comment."
      },
      {
        "paragraph": "At the same time, Rodney’s delicate thin lips twitched."
      },
      {
        "paragraph": "Upon realizing that she had spoken too impulsively, Harley hurriedly said, “I can"
      },
      {
        "paragraph": "understand. He’s so handsome. Even if it were me, I might not be able to resist.”"
      },
      {
        "paragraph": "Rodney glanced at Freya and said, “Let me introduce myself. I’m her husband, Rodney Snow.”"
      },
      {
        "paragraph": "Harley was once again dumbfounded. He was Rodney Snow?"
      },
      {
        "paragraph": "She had seen photos of Rodney before, but they were all photos on the internet taken by paparazzi.\nHence, they were not very clear. Now, he was wearing a black shirt, jeans, white shoes, and even had\na head of curly chestnut-colored hair. At first glance, he looked like a big star in the entertainment\ncircle, cold and noble. A shot from any angle would be enough to make the cover of a magazine."
      },
      {
        "paragraph": "This was the prime minister’s nephew?"
      },
      {
        "paragraph": "He did not fit the image of those overbearing presidents from the novels."
      },
      {
        "paragraph": "Did overbearing presidents dye and curl their hair?"
      },
      {
        "paragraph": "Even so, he looked too good. He even made her, a woman, feel ashamed."
      },
      {
        "paragraph": "Freya was ashamed too, but she could understand Harley’s thoughts. After all, Rodney  really  looked\ntoo flamboyant.  Even if he was wearing  her brother’s black shirt today, he left the first few buttons\nundone, giving  him  a bewitching  and unruly aura. In short, it was impossible to tell that he was over\n30 years old."
      },
      {
        "paragraph": "Sigh, she did not understand. Rodney got along so well with Shaun and Chester, and those two were\nalways meticulously dressed. Why was he so… expressive?"
      },
      {
        "paragraph": "“Oh… You’re Young Master Snow. Hello, hello. I’ve heard a lot about you.”"
      },
      {
        "paragraph": "Harley smiled in embarrassment, feeling uncomfortable. She felt like she had just met Alexander the\nGreat whereas she was just an ordinary person who wanted to go shopping with her old friend. “Freya,"
      },
      {
        "paragraph": "why didn’t you tell me you were bringing Young Master Snow along?”"
      },
      {
        "paragraph": "“It’s fine. Just let him babysit for you. Let’s go shopping. ” Freya took Harley’s hand and glanced faintly\nat Rodney."
      },
      {
        "paragraph": "Rodney looked at the little boy beside him, and the boy also blinked at him. The latter felt that this big\nbrother looked pretty handsome and should be good at playing."
      },
      {
        "paragraph": "“Okay, I’ll look after him. You ladies go shopping. I’ll practice how to take care of a bigger child.”"
      },
      {
        "paragraph": "Rodney was not willing at all, but he had no choice. As such, he walked with Sammy at the back."
      },
      {
        "paragraph": "Meanwhile, Freya and Harley chatted as they walked in front."
      },
      {
        "paragraph": "Harley peeked back from time to time. She was uneasy about her son at first. However, she did not\nexpect to see Rodney holding Sammy in his arms, chatting while following them."
      },
      {
        "paragraph": "“ Is that… really Young Master Snow?” Harley was in disbelief."
      },
      {
        "paragraph": "“Yeah. ” Freya shrugged helplessly. “Do I look like the kind of woman who would  find a lover before\ngetting a divorce?”"
      }
    ]
  },
  {
    "title": "Chapter 1846 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“You didn’t say anything about bringing Young Master Snow, so how would I know? I’ve never seen him\nbefore.” Harley whispered,  “Besides, he’s really handsome. He’s like a hunk. I remember you said that\nYoung Master Snow was an old man in his thirties…”"
      },
      {
        "paragraph": "“Uh… Isn’t someone in their thirties old? I’m  only in my twenties.” Freya said brazenly. “He only looks\nyounger than his age.”"
      },
      {
        "paragraph": "“Forget it. My husband is the same age as me, but he looks like he’s in his thirties and forties. He has\nalso gained some weight in recent years.” Harley sighed. “If I had known, I wouldn’t have gotten\nmarried right after graduating from college. Your husband is much more handsome.”"
      },
      {
        "paragraph": "“Forget it. Will being handsome feed me? ” Freya retorted."
      },
      {
        "paragraph": "Harley blinked. “Of course it can. Otherwise, how would you have taken a fancy to Patrick? But Patrick\nis not as good-looking as Young Master Snow.”"
      },
      {
        "paragraph": "Freya was speechless."
      },
      {
        "paragraph": "Fine, she does judge people by their faces, but even she has her standards."
      },
      {
        "paragraph": "“I’m envious of you,” Harley said."
      },
      {
        "paragraph": "Well, Freya had to admit that Rodney made her look good in front of her old classmate."
      },
      {
        "paragraph": "After all, everyone had vanity, and an outstanding person like her was no different."
      },
      {
        "paragraph": "“Let’s go and visit that store.” Freya pulled Harley in."
      },
      {
        "paragraph": "In the store, Rodney witnessed women’s ability to shop. They tried almost half of the clothes available\nat the store."
      },
      {
        "paragraph": "Sammy was also very wild, jumping and crawling here and there."
      },
      {
        "paragraph": "Rodney suddenly missed his crying little girl very much."
      },
      {
        "paragraph": "It was better to have a daughter. Sons were too annoying."
      },
      {
        "paragraph": "However, he did not dare to show it for fear that Freya would be unhappy."
      },
      {
        "paragraph": "When Freya finished trying on the clothes and was conflicted on which one looked better,  the shop\nclerk said, “You don’t have to decide. Your husband has already paid for all the clothes you tried on\nearlier.”"
      },
      {
        "paragraph": "Freya was stunned and could not help but look at Rodney, who was playing with the child on the sofa."
      },
      {
        "paragraph": "Harley covered her mouth and chuckled quietly. “ Freya, your husband is so good.”"
      },
      {
        "paragraph": "The shop clerk smiled. “Your husband also paid for your friend’s clothes, saying that it’s to thank her for\ngoing shopping with you.”"
      },
      {
        "paragraph": "Shocked, Harley quickly said, “That’s… No. I’ll pay for it myself.”"
      },
      {
        "paragraph": "Freya did not expect Rodney to give her so much face, but she had to admit that he completely\nsatisfied her vanity. “ It’s fine. Just let him pay for it. We haven’t seen each other for a long time\nanyway, and I have never come back to Melbourne for your birthday before. Think of it as a belated\nbirthday present.”"
      },
      {
        "paragraph": "“Fine, but you have to make it clear to your husband that he shouldn’t pay for my stuff the next round. ”\nHarley said, “I’ve already benefited more than enough from you today.”"
      },
      {
        "paragraph": "“Come on. We’re friends. Don’t worry about it.”"
      },
      {
        "paragraph": "Since there were too many clothes, Freya filled in their addresses and asked the clothing store to get\nthem delivered."
      },
      {
        "paragraph": "Later, no matter what Freya took a fancy to, Rodney paid the bill immediately as soon as she changed\ninto it."
      },
      {
        "paragraph": "She even took a fancy to a ring worth 400 thousand dollars. After she put it on, Harley said that it\nlooked good on her, and Rodney immediately paid for it."
      },
      {
        "paragraph": "All the salespeople on the first floor were in an uproar."
      },
      {
        "paragraph": "“Wow, you’re so lucky. You don’t have to open a tab this week.”"
      },
      {
        "paragraph": "“Yeah, I’ve never met such a chivalrous person. He’s her husband, right? He’s so handsome, rich, and\ngenerous too.”"
      }
    ]
  },
  {
    "title": "Chapter 1847 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“He even knows how to take care of children. Look how patient he is with that boy.”"
      },
      {
        "paragraph": "“I want a dozen men like this.”"
      },
      {
        "paragraph": "From the side, Freya enjoyed becoming the focus of envy."
      },
      {
        "paragraph": "Tsk tsk. She had to say that this feeling was quite good."
      },
      {
        "paragraph": "In the past, only Catherine could experience being a handsome and domineering president’s wife."
      },
      {
        "paragraph": "However, Freya finally experienced it for herself now."
      },
      {
        "paragraph": "The ring on her hand was really beautiful."
      },
      {
        "paragraph": "Also… for the first time, she did not find Rodney’s face as revolting and annoying."
      },
      {
        "paragraph": "At noon."
      },
      {
        "paragraph": "The four of them ate outside."
      },
      {
        "paragraph": "Rodney took the child to wash his hands."
      },
      {
        "paragraph": "Harley looked Freya deep in the eye. “Are you deliberately trying to aggravate me by asking me out\ntoday? I want to change my husband now.”"
      },
      {
        "paragraph": "“I didn’t. He wasn’t like this before, ” Freya said stiffly. “Maybe it’s because we quarreled yesterday and\nbrought up divorce, so he’s deliberately trying to please me.”"
      },
      {
        "paragraph": "Harley let out a long sigh. “If such a good thing happens after quarreling to the point of wanting a\ndivorce, then I will quarrel way more often. That can happen every day.”"
      },
      {
        "paragraph": "Freya was speechless."
      },
      {
        "paragraph": "It seemed like… that logic was valid too."
      },
      {
        "paragraph": "“You used to comment on how bad Young Master Snow was. But from what I saw today, he’s\nhandsome, generous, patient with children, and even rich. Those are all the qualities a man needs,”\nHarley said."
      },
      {
        "paragraph": "“You don’t understand. Your husband is gentle and considerate…”"
      },
      {
        "paragraph": "“Forget it. Can I live off someone gentle and considerate? Can that put a diamond ring worth\n400 hundred thousand dollars in my hand? Can that"
      },
      {
        "paragraph": "allow me to go out and buy clothes without having to pick? Can that let me shop till I drop?” Harley\ninterrupted her."
      },
      {
        "paragraph": "Freya did not know what to say for a moment."
      },
      {
        "paragraph": "After thinking about it carefully, it seemed like no one had a perfect marriage."
      },
      {
        "paragraph": "For example, Cathy was very happy now, but how many twists and turns had she experienced with\nShaun over the years? To be honest, if Cathy was not as open-minded, she might not have gotten back\ntogether with Shaun."
      },
      {
        "paragraph": "“By the way, do you still remember Linda Shelby?” Harley suddenly asked."
      },
      {
        "paragraph": "Stunned by Harley’s question, Freya frowned. Of course, she remembered Linda. When Rebecca\ncame back in a high -profile way some time ago, Linda had thrown in her lot with Rebecca."
      },
      {
        "paragraph": "However, everyone was busy dealing with Rebecca back then. After she died, Linda and Patrick also\ndisappeared from Canberra."
      },
      {
        "paragraph": "“ She is back in Melbourne. ” Harley said, “But the Shelby family isn’t like what they used to be. I heard\nthat they’re going bankrupt, and they’ve sold the family’s villa and luxury cars. The Jackson family is\nthe same. Jackson Corporation’s profits are getting worse and worse. They can’t compare to your\nLynch family anymore.”"
      },
      {
        "paragraph": "“Oh, they should be getting married.” It had been a long time since Freya heard about those two\npeople."
      },
      {
        "paragraph": "After getting Patrick to help her last time, she never saw him again."
      },
      {
        "paragraph": "Harley said mockingly, “ I heard that Linda really wants to get married, but the Jackson family\ndisapproves and keeps delaying it. The Jackson family wants Patrick to find a lady with better\nconditions who can support the family. Linda really doesn’t have many skills. Although she studied\nabroad, she had only done odd jobs under Patrick. Back then, Patrick was in a good place and spoiled\nher rotten. But now that the Jackson family is in trouble, Linda’s abilities are utterly useless. The Shelby\nfamily behind her is just dead weight.”"
      },
      {
        "paragraph": "“If there’s anything Linda is good at, it’s acting like a pure and innocent person.” Freya also mocked."
      }
    ]
  },
  {
    "title": "Chapter 1848 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya knew better than anyone how capable Linda was. When Linda was Patrick’s secretary, there\nwere many things that she could not do well."
      },
      {
        "paragraph": "However, all she did was act like a spoiled child, and with the help of several secretaries behind her,\nshe pretended to be capable and innocent in front of Patrick."
      },
      {
        "paragraph": "Harley agreed. “Patrick is also an idiot. With your brother’s ability, the Lynch family is prospering more\nthan ever. If he had stayed with you back then, the Jackson family wouldn’t end up a joke in Melbourne\nlike they are now.”"
      },
      {
        "paragraph": "Freya took a sip of milk tea and was about to say something when her eyes suddenly froze. She\nquickly lowered her head. “We really can’t talk about people behind their backs. Speak of the devil, and\nhe shall appear.”"
      },
      {
        "paragraph": "Harley froze and hurriedly looked over, only to see Patrick on the other side of the aisle. However, there\nwere partitions in the middle, so he did not"
      },
      {
        "paragraph": "see them. Instead, he went straight to the second- last table at the back. Opposite him sat a young\nwoman in her twenties wearing purple -red short overalls. Her little round face was not extremely good\nlooking, but she looked like a pretty daughter from a humble family."
      },
      {
        "paragraph": "Harley stared with wide eyes. “ Did we bump into him on a blind date?”"
      },
      {
        "paragraph": "“Okay. Let’s pretend we didn’t see anything.” Freya covered her face. If she had known earlier, she\nwould not have chosen this restaurant."
      },
      {
        "paragraph": "At that moment, Rodney came back from the washroom with Sammy in his arms."
      },
      {
        "paragraph": "Sammy was very wild and would not eat properly, wanting to run all over the place."
      },
      {
        "paragraph": "Freya glanced at Rodney. “Take his bowl and feed him outside.”"
      },
      {
        "paragraph": "Rodney was at a loss for words."
      },
      {
        "paragraph": "That was too much. He was hungry too, okay?"
      },
      {
        "paragraph": "Harley quickly said, “No need for that. Young Master Snow, you can just watch some cartoons with him\nfor a while.”"
      },
      {
        "paragraph": "Then, she took out her phone to play Sammy some cartoons, and the child went quiet in an instant."
      },
      {
        "paragraph": "However, Rodney felt that the atmosphere was very strange. Both women had buried themselves in the\nfood."
      },
      {
        "paragraph": "Was the food that delicious?"
      },
      {
        "paragraph": "Although it did taste good, there was no need to be in such a hurry."
      },
      {
        "paragraph": "Just as he was wondering, Harley suddenly got so worked up that she kicked Freya under the table."
      },
      {
        "paragraph": "Freya looked over as well and saw Linda appear."
      },
      {
        "paragraph": "She went straight to Patrick and even started to cry. “Patrick Jackson, you’re too much. You’ve been\nwith me for several years. How dare you go on a blind date with another woman behind my back? How\ncan you do this to me?”"
      },
      {
        "paragraph": "The restaurant was suddenly abuzz."
      },
      {
        "paragraph": "Rodney also looked over and instantly froze. “Is that Patrick Jackson and his mistress?”"
      },
      {
        "paragraph": "“Pfft.” Harley almost spat out her food. She gave a thumbs up. “Young Master Snow has good eyes."
      },
      {
        "paragraph": "That’s his Mistress 1 and Mistress 2.” Freya was speechless."
      },
      {
        "paragraph": "Patrick’s expression was unpleasant, and his blind date endured the people’s burning eyes on her and\nstood up at a loss. “Your parents told me that you’re currently single.”"
      },
      {
        "paragraph": "“He’s my boyfriend. We’ve been dating for several years. ” Linda grabbed Patrick agitatedly. “We’ve\neven discussed marriage.”"
      },
      {
        "paragraph": "“Is that true?” The woman looked at Patrick coldly."
      },
      {
        "paragraph": "Patrick’s handsome face was expressionless as he remained silent."
      },
      {
        "paragraph": "“*sshole.”"
      },
      {
        "paragraph": "The woman splashed a glass of water on Patrick’s face and stormed off in anger."
      },
      {
        "paragraph": "“Patrick, let’s head back.” Only after seeing the girl leave did Linda soften her tone. “I know your\nparents don’t like me that much, but I’ll think of a way for them to accept me eventually.”"
      },
      {
        "paragraph": "Patrick looked at her silently. The woman in front of him changed her face so quickly that he found her\nunfamiliar. In fact, perhaps he had never understood Linda before."
      }
    ]
  },
  {
    "title": "Chapter 1849 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Linda, I already told you. We’re over.” Patrick tiredly drew his hand back."
      },
      {
        "paragraph": "Linda immediately exploded. “ I don’t agree. I love you. I love you so much. I would die without you.\nPatrick, did you forget what you said to me? You said that you wouldn’t let me down and that you would\nmarry me. How can you do this to me?”"
      },
      {
        "paragraph": "If it were in the past, Patrick might be soft-hearted. However, after experiencing so many things in\nCanberra and personally seeing how close she was to someone like Rebecca Jones…"
      },
      {
        "paragraph": "Patrick felt like his head was about to explode."
      },
      {
        "paragraph": "Ever since he returned to Melbourne, he felt something trapped in his chest. He held it back, but it felt\nlike it would explode at any moment."
      },
      {
        "paragraph": "“You love me?” He let out a sorrowful chuckle. “ When did you fall in love with me? Was it three years\nago, or was it before that? That was why… Freya and I broke up, right?”"
      },
      {
        "paragraph": "Linda shuddered, but she refused to admit it."
      },
      {
        "paragraph": "Instead, she cried softly, “In fact, you wanted to break up with me because you saw Freya in Canberra,\nright? The Lynch family is at its peak, while the Shelby family is poor. But don’t you forget who made\nour families like this…”"
      },
      {
        "paragraph": "“It was you who put yourself in this situation.”"
      },
      {
        "paragraph": "A man’s mocking voice suddenly came from behind."
      },
      {
        "paragraph": "Linda’s voice choked. As soon as she turned around, she saw a man in a black shirt and a slender\nfigure walking towards them. The man had his hands in his pockets, and his beautiful features were\ndelicate and handsome. However, his eyes were slightly raised, making it seem like he was looking\ndown on them from high above."
      },
      {
        "paragraph": "Her brain exploded with a bang."
      },
      {
        "paragraph": "She recognized him. She had seen Rodney once before at the entrance of Freya’s neighborhood."
      },
      {
        "paragraph": "It was that face that appeared and beat Patrick up."
      },
      {
        "paragraph": "At that time, she hated this person to her core and tried to overturn the power of the Snow family."
      },
      {
        "paragraph": "However, with Rebecca’s death, she finally realized that she was simply throwing eggs at a boulder."
      },
      {
        "paragraph": "Now, to her, the Snow family was a monster that could not be provoked."
      },
      {
        "paragraph": "Linda’s face suddenly turned white."
      },
      {
        "paragraph": "Patrick also froze, but he calmed down and looked behind Rodney to find Freya and her friend sitting\nnot far away."
      },
      {
        "paragraph": "So… she was here too."
      },
      {
        "paragraph": "In other words, she had seen the embarrassing scene earlier."
      },
      {
        "paragraph": "Freya wanted nothing more than to stab Rodney’s back with her eyes."
      },
      {
        "paragraph": "What was he doing? Why was he butting in in other people’s fights? Did he want the matter to blow up?"
      },
      {
        "paragraph": "“Uh… Should we go over?” Harley was quite interested in the drama. “ Don’t you want to slap Linda?”"
      },
      {
        "paragraph": "“ It’s all in the past.” Freya had really let it go. She was not concerned about people like Linda at all."
      },
      {
        "paragraph": "Even Patrick… She glanced at him for a moment and then looked away."
      },
      {
        "paragraph": "She had already made herself clear with Patrick, so there was nothing to talk about."
      },
      {
        "paragraph": "When Patrick saw her turn her head indifferently, he felt extremely sad."
      },
      {
        "paragraph": "In the end, two people who were once in love with each other were strangers again."
      }
    ]
  }
]