[


  {
    "title": "Chapter 1300 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Huh? You guys got back together?” Rodney was shocked."
      },
      {
        "paragraph": "“Yeah.” Shaun narrowed his eyes. “I hope that you’ll be more polite to Cathy. She doesn’t owe you\nanything, nor does she owe Sarah anything. I don’t have to be responsible for Sarah either. In the past, I\nnever helped Cathy when you targeted her, which caused the distance between us to grow. That was m\ny greatest mistake. If there’s a next time, I’ll beat you up directly.”"
      },
      {
        "paragraph": "Rodney almost spat out blood. “Are you here to visit a patient or threaten me? Who’s the one who has\nknown you longer? Haven’t you heard the saying ‘bros before h*es’?”"
      },
      {
        "paragraph": "“I used to choose my friends in the past. As a result, my children lived their lives without a father. I almost\nlost two lovely children and a perfect family. I won’t let that happen in the future.”"
      },
      {
        "paragraph": "Shaun paused and changed the topic. “Also… Cathy is super smart, calm, and wise. She knows how to\nidentify b*tches. She noticed many things before us"
      },
      {
        "paragraph": "and has been working in the business world for many years. Of course, I should listen to her words.\nFacts have proved that I was previously deceived by others because I didn’t listen to my wife’s words.”"
      },
      {
        "paragraph": "Rodney and Chester immediately felt exasperated."
      },
      {
        "paragraph": "“Shaun, are you deliberately showing off your woman?”"
      },
      {
        "paragraph": "This time, Chester also could not hold back and spoke."
      },
      {
        "paragraph": "“Did I say anything wrong?” Shaun asked sharply. “ If both of you had been calm and wise enough, why\ndid you say Sarah was good? In the end, you made me treat a piece of trash like she was a treasure."
      },
      {
        "paragraph": "Sometimes, it’s good to have a sensible person around me to pull me back to reality."
      },

      {
        "paragraph": "“As for you, Chester, I’ve wanted to say this for a long time. How could you choose to marry Cindy? Are\nyou mad? She’s a two-faced woman. Have you forgotten what Chase said about her?”"
      },
      {
        "paragraph": "Chester rubbed his forehead. “You’ve never cared about Cindy and me before. Did you take the wrong\nmeds today?”"
      },
      {
        "paragraph": "Shaun suddenly said, “It’s because Cathy said that Cindy had thrown rocks at her while she was down. I\ndidn’t believe her before, but I believe everything she says now. A woman like Cindy isn’t worthy of you.”"
      },
      {
        "paragraph": "A touch of darkness flashed across Chester’s handsome face. After a moment, he let out a low chuckle.\n“You’re right. Cindy isn’t worthy of me. So what kind of woman is?”"
      },
      {
        "paragraph": "Shaun frowned. “ In marriage and love, status and identity are secondary. What’s most important is if\nthere’s love and affection…”"
      },
      {
        "paragraph": "Chester shook his head and smiled. “I’m not interested in love, nor do I want to learn about love.\nHowever, people of our status will have to get married sooner or later. We need to have children to carry\non the family line. Frankly speaking, it doesn’t matter if Cindy is a good woman or not."
      },
      {
        "paragraph": "Besides, even without Cindy, there’ll always be another Cindy Turner down the line. Since I was young,\nwhich woman hasn’t approached me with ulterior motives?”"
      },
      {
        "paragraph": "Shaun fell silent."
      },
      {
        "paragraph": "Rodney could not help but mutter, “People not in the know would think that you suffered some emotional\ntrauma, Chester. It’s like you were hurt as much as I was this time.”"
      },
      {
        "paragraph": "“You think too much. ” Chester snorted. “I don’t know how to love and have never fallen in love with\nanyone before.”"
      },
      {
        "paragraph": "“Is that so?” Shaun tugged on his lips and said thoughtfully, “Loving someone is an instinct. No one\nwould lose this instinct without a reason.”"
      },
      {
        "paragraph": "Rodney was startled. “Chester, did you get hurt before?”"
      },
      {
        "paragraph": "“You think too much.” Chester looked at them coldly. “ I’ve talked to you guys long enough. I’m going\nback to work.”"
      },
      {
        "paragraph": "“I have to go find Cathy.” Shaun looked at the time and smiled affectionately. “ If I make her wait too long,\nmaybe she’ll lose her temper with me again.” Rodney was depressed. “Will you die if you don’t act all\nloving?”"
      }
    ]
  },
  {
    "title": "Chapter 1301 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Remember what I said today and be polite to your sister-in-law in the future.”"
      },
      {
        "paragraph": "Shaun smiled and left."
      },
      {
        "paragraph": "Rodney wanted to cry. He was a patient but he was being threatened by someone else. That was too\nmuch."
      },
      {
        "paragraph": "Shaun quickly drove to Hudson Corporation. Catherine had been waiting downstairs for a while."
      },
      {
        "paragraph": "When she got into the car, her little face looked cold and it was clear she was in a bad mood. “Shaun Hill,\nyou kept me waiting for more than five minutes. ”"
      },
      {
        "paragraph": "Actually, she had the patience to wait. However, they had just gotten back together yet Shaun was\nalready making her wait. It made her feel like he no longer cherished her the moment she agreed to get\nback together with him."
      },
      {
        "paragraph": "“Cathy, don’t be angry. It’s my fault.” Shaun hurriedly apologized. “ I just came from the Jewell family’s\nhospital. There’s always a traffic jam near that hospital.”"
      },
      {
        "paragraph": "“Why did you go to the hospital?” Catherine’s expression changed slightly."
      },
      {
        "paragraph": "Shaun rubbed his nose unnaturally. “I… went to the andrology department.”"
      },
      {
        "paragraph": "Catherine was slightly speechless. He went to the andrology department the first day they got back\ntogether. His intentions were clear as day."
      },
      {
        "paragraph": "“So… you’re fine now?”"
      },

      {
        "paragraph": "“Ahem, the doctor said… it’ll take some time.” Shaun was depressed and looked at her nervously. “\nCathy, you won’t mind, right?”"
      },
      {
        "paragraph": "“I’m not as hungry as you, okay?” Catherine spat out in exasperation."
      },
      {
        "paragraph": "Shaun whispered awkwardly, “ I heard people say that women who have given birth are like wolves… ”"
      },
      {
        "paragraph": "“Who said that?” Catherine’s face flushed red."
      },
      {
        "paragraph": "“I heard some old men talk about it in a party I went to in the past, ” Shaun muttered."
      },
      {
        "paragraph": "“Do you think I’m the same as you men and have nothing better to do? If you have time to be idle,"
      },
      {
        "paragraph": "you might as well work hard.” Catherine was speechless. She was worrying about her divorce from\nWesley, but he had the mood to think about such things."
      },
      {
        "paragraph": "“Yes, yes, I was wrong. I actually went to the hospital to see Rodney as well.”"
      },
      {
        "paragraph": "Shaun hurriedly admitted his mistake. “I went there to warn him that if he dares to be rude to you again in\nthe future, I’ll beat him up. In the future, I’ll listen to no one else but you. You’re my heart, but brothers\nare like clothes. I can change them any time.”"
      },
      {
        "paragraph": "Catherine blinked and suddenly pretended to be angry. “Haven’t you already cut ties with him?”"
      },
      {
        "paragraph": "Seeing her suddenly get angry, Shaun instantly panicked. “Cathy, don’t misunderstand. I haven’t seen\nRodney for a long time. We aren’t close now.”"
      },
      {
        "paragraph": "Catherine looked at him for a while and could not help but say, “Tsk, if it were in the past, you’d have\nfought with me if I said anything bad about Rodney or Chester.”"
      },
      {
        "paragraph": "“I was young and naive back then. Now, I understand that my wife’s words are the truth. I’ll be happy if I\nlisten to my wife. If I don’t listen to my"
      },
      {
        "paragraph": "wife, I’ll be forever alone.” Catherine,“ ”"
      },
      {
        "paragraph": "He was so self-aware now that she did not know what to say."
      },
      {
        "paragraph": "After a moment, she said, “It’s good that you have that awareness, but frankly, I don’t like Rodney at all—\nespecially since he dragged Freya to undergo an abortion. I want him to die. Although he has a good\nface, his brain is full of sh*t and he has no sense of responsibility. I won’t support him getting together\nwith Freya.”"
      }
    ]
  },
  {
    "title": "Chapter 1302 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“But… the baby still needs a father, ” Shaun mustered up the courage and said cautiously."
      },
      {
        "paragraph": "“That depends on what kind of father it is. If it’s a father with a head full of sh*t, it’s not necessarily good\nfor the child to be raised by a father like him. It’ll only harm the child. ” Catherine disapproved."
      },
      {
        "paragraph": "Shaun fell silent."
      },
      {
        "paragraph": "He felt that Rodney would not be able to return to the Snow family anytime soon."
      },
      {
        "paragraph": "The car drove for a while."
      },
      {
        "paragraph": "Catherine suddenly realized that Shaun was deliberately driving around the city. After a while, he\naccelerated and drove quickly toward the esplanade."
      },
      {
        "paragraph": "“Who are you taking me to see? You’re being so mysterious, and you’re also afraid of being followed.”"
      },
      {
        "paragraph": "“You’re so smart, Cathy, ” Shaun praised. “You’ll know later. I won’t tell you now.”"
      },
      {
        "paragraph": "Catherine looked at how mysterious he was being and did not ask any more questions."
      },
      {
        "paragraph": "5o minutes later, they drove into a villa. Although the villa was not next to the sea, it was possible to see\nthe sea below the mountain if one stood in the yard."
      },
      {
        "paragraph": "“Is this a new house you bought?” Catherine was puzzled. When Shaun drove the car in, the doorman\nwas respectful to him as though he was an old acquaintance."
      },
      {
        "paragraph": "“No.” Shaun opened the passenger door for her and led her out of the car."
      },
      {
        "paragraph": "The air here was very good. Catherine guessed that the villa was definitely worth a lot of money."
      },

      {
        "paragraph": "She followed Shaun toward the villa and soon saw a tall sturdy man sitting at the large dining table. The\nman looked to be around 4o years old. His nose was very straight, and he gave off the aura of a mature\nman. Unfortunately, there was a deep scar on his face. However, looking at his nose and his distinct\nfeatures, she could tell that this man must have been very handsome when he was young."
      },
      {
        "paragraph": "Handsome… He even seemed a little similar to the man beside her."
      },
      {
        "paragraph": "“You’re here.” Brennan looked at their linked hands and smiled."
      },
      {
        "paragraph": "“Come, Cathy. Let me introduce you. This is my dad.” Shaun led Catherine over and introduced her.\n“He’s also the chairman of Garson Corporation.”"
      },
      {
        "paragraph": "Catherine was astonished."
      },
      {
        "paragraph": "This was… Shaun’s father, Brennan Lowe?”"
      },
      {
        "paragraph": "She had heard that his father used to live off a woman in the past and later left his son and the country\nwithout a word. Now, he was the chairman of Garson Corporation?"
      },
      {
        "paragraph": "She had heard of Garson Corporation before. It was said to be a large foreign electronic and electrical\nenterprise. Its advanced technologies included energy, medical care, and science and technology. Many\ncompanies in the country wanted to cooperate with Garson, but Garson was rarely willing to cooperate\nwith them. However, a few days ago, Campos Corporation announced that they had started working\nclosely together with Garson Corporation."
      },
      {
        "paragraph": "However, Brennan was Shaun’s father. Mason probably did not know the true identity of the chairman of\nGarson Corporation."
      },
      {
        "paragraph": "“Are you surprised?” Shaun smiled and pressed her into a chair to sit down. “My dad gave me all the\nimportant advanced technologies of Garson Corporation. What Campos Corporation has is only"
      },
      {
        "paragraph": "superficial, but they’ve already invested a large amount of money into the project. Soon, Hill Corporation\nwill launch a series of products. The day we’ll rise again is just around the corner.”"
      },
      {
        "paragraph": "Catherine was stunned. Recently, Shaun would always come looking for her in his free time, making her\nthink that he had lost his ambition. However, it turned out he had already made preparations in the dark."
      },
      {
        "paragraph": "This was Brennan’s first time seeing Catherine in person. His gaze was a little strange."
      },
      {
        "paragraph": "“Hello, Uncle,” Catherine nodded politely and greeted him."
      },
      {
        "paragraph": "Brennan smiled and said seriously, “ I hope you can keep my identity a secret for now. It’s not time to\nreveal it yet.”"
      },
      {
        "paragraph": "“Don’t worry, I will. I hate the Campos family too, ” Catherine told the truth."
      }
    ]
  },
  {
    "title": "Chapter 1303 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“You’re a very smart woman.” Brennan looked at her and suddenly said, “You’re smarter than I was back\nthen. Shaun and you ended up better than me.”"
      },
      {
        "paragraph": "He was persecuted by Mason in the past and could only come back after more than 20 years."
      },
      {
        "paragraph": "Mason had also misled him into thinking that Liam was not his son."
      },
      {
        "paragraph": "That caused the biological brothers, Liam and Shaun, to hate each other for decades. Now… Liam was\ngone."
      },
      {
        "paragraph": "Catherine knew he might be thinking about Liam and thus, was upset. “Uncle, don’t blame yourself. It\nwasn’t your fault.”"
      },
      {
        "paragraph": "“Yes.” Brennan nodded bitterly. “You’re smarter than me and made Shaun open his eyes to the truth. You\nwere right to make up with him. Children need their parents.”"
      },
      {
        "paragraph": "“Yes, yes, yes, Cathy and I are luckier than you. Stop thinking about unpleasant things. Let’s eat.” Shaun\nserved the food."
      },
      {
        "paragraph": "Catherine talked with Brennan about business. Brennan was worthy of being an international business\ntycoon. He would casually point out a few things that would benefit Catherine greatly."
      },
      {
        "paragraph": "“It’s the right idea to develop the tourism industry. Real estate developed very well in the beginning but it\nhas slowly stagnated in recent years and will gradually go downhill. I know a few big names in the\ntourism industry in Country Y. You can cooperate with them to expand overseas.”"
      },
      {
        "paragraph": "Brennan introduced several foreign tycoons to her on the spot."
      },

      {
        "paragraph": "Catherine was overjoyed. “Thank you, Uncle. You’re very knowledgeable and have broadened my\nhorizons.”"
      },
      {
        "paragraph": "“I’m also very knowledgeable.” Shaun saw Catherine smile happily at Brennan and felt his heart turning\nsour. “ I know a few friends who run travel companies too.”"
      },
      {
        "paragraph": "“Forget it. How old are you compared to your father? He’s much more experienced than you.” Catherine\nrolled her eyes. “Besides, one of the friends Uncle introduced has opened thousands of five -star hotels\naround the world. When the time comes, I can work closely with them.”"
      },
      {
        "paragraph": "Brennan said meaningfully, “ Don’t be in a hurry. Buy a few pots of land in the country and make a large-\nscale paradise resort first. Then, you can build a resort brand and go international. I can help you with\nthe technology and introduce companies to you.”"
      },
      {
        "paragraph": "“Uncle, you’re amazing.” Catherine was full of admiration."
      },
      {
        "paragraph": "She spent the next hour discussing the plans for the resort with Brennan."
      },
      {
        "paragraph": "Shaun sat at the side in boredom, dryly watching their exchange while unable to join in."
      },
      {
        "paragraph": "Brennan had completely stolen his thunder."
      },
      {
        "paragraph": "He was very depressed. He used to be the richest man in the country, but now, it was like he was an\nuneducated lad."
      },
      {
        "paragraph": "After talking until 8:30 p.m. Brennan noticed Shaun’s bitter eyes and smiled. “ If we continue to ignore a\ncertain someone, he might not bring you here next time.”"
      },
      {
        "paragraph": "Only then did Catherine notice Shaun’s unhappy and handsome face."
      },
      {
        "paragraph": "She smiled awkwardly. “Your father is amazing. ”"
      },
      {
        "paragraph": "“… Heh. Cathy, how many times have you praised my dad tonight?” Shaun was upset. “At least seven or\neight times by now.”"
      },
      {
        "paragraph": "“Don’t be ridiculous. Are you jealous of your dad?” Catherine was amused. “Isn’t praising your dad the\nsame as praising you? You’re very lucky to have a dad like him.”"
      },
      {
        "paragraph": "“What should I be thankful for? My luck has never had anything to do with my parents.” Shaun’s eyes\nwere complicated. “ I know how to do everything that my dad said just now, but you never talk about your\nideas to me. Cathy, do you look down on me now?”"
      },
      {
        "paragraph": "Catherine’s sweat dripped. She had just talked a little with his dad, but he made it seem like a serious\nproblem and as if she was looking down on him. “How would I know if you know stuff like that?”"
      },
      {
        "paragraph": "“If you don’t communicate with me, how would you know if I know or not?” Shaun disputed."
      },
      {
        "paragraph": "“Why should I communicate with you? Have you forgotten how you used to lose your temper with me? I\nwon’t even want to talk to you. Also, we just got back together today!”"
      }
    ]
  },
  {
    "title": "Chapter 1304 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“No, strictly speaking, it was 11:28 p.m. last night, ” Shaun corrected."
      },
      {
        "paragraph": "Catherine was exasperated."
      },
      {
        "paragraph": "Brennan looked at them bicker childishly as a complex smile flashed in his eyes."
      },
      {
        "paragraph": "Once upon a time, Lea and he were like that too. However, they were young back then and did not know\nhow to cherish each other."
      },
      {
        "paragraph": "After living half their lives, they were still alone. “Wait here.”"
      },
      {
        "paragraph": "Brennan suddenly got up and went upstairs."
      },
      {
        "paragraph": "Three minutes later, he came back downstairs with an envelope and handed it to Catherine."
      },
      {
        "paragraph": "Catherine took it and saw that it was the title deed and real estate certificate to Hill Manor, as well as a\nbunch of keys."
      },
      {
        "paragraph": "She was taken aback. “So it turns out that the mysterious buyer of Hill Manor was you.”"
      },
      {
        "paragraph": "“This is the first time we’re meeting, so I’ll give you this manor. ” Brennan smiled. “Think of it as a\nbirthday present for my grandchildren.”"
      },
      {
        "paragraph": "Catherine was shocked. “That’s too much. I can’t accept this.”"
      },
      {
        "paragraph": "“ I’m giving it to Suzie and Lucas.” Brennan waved his hand. “Take it. I bought it back then to help the Hill\nfamily tide over their difficulties, not because I wanted to live in it. To be honest, I don’t have any good\nmemories there, but it’s different for the Hill family—especially the two elders who have lived there for\ndecades.”"
      },

      {
        "paragraph": "Shaun instantly understood. “Dad, you mean…”"
      },
      {
        "paragraph": "“Hill Manor is a good place. There’s an orchard and a horse racing track. It’s very suitable for children to\nlive in. I believe the children will like it very"
      },
      {
        "paragraph": "much, ” Brennan said, “It’ll be a waste for me to keep the manor but leave it empty.”"
      },
      {
        "paragraph": "“But…”"
      },
      {
        "paragraph": "“Take it, Cathy,” Shaun said, “This is a present from my dad to the kids. He didn’t raise me when I was\nyoung, so it’s appropriate for him to show some responsibility for my children.”"
      },
      {
        "paragraph": "“That’s right.” Brennan agreed."
      },
      {
        "paragraph": "“Then… I’ll thank you on behalf of the children. ” Catherine did argue anymore."
      },
      {
        "paragraph": "At 9:00 p.m., the two of them left the villa."
      },
      {
        "paragraph": "Behind them, Brennan stood alone in the courtyard with his hands in his pockets."
      },
      {
        "paragraph": "Catherine could not help but ask, “Your dad didn’t remarry?”"
      },
      {
        "paragraph": "“No.” Shaun shook his head."
      },
      {
        "paragraph": "“I feel that he’s quite lonely all by himself. Is it because he can’t forget your mom? They’re both single\nright now…”"
      },
      {
        "paragraph": "“Forget it. It’s different. My dad hates my mom. ” Shaun sighed. “The misunderstanding between them\nisn’t like ours. It also involves my grandmother. My grandmother was killed by Mason. If Dad hadn’t\ngotten entangled with my mom and Mason, all this wouldn’t have happened. ”"
      },
      {
        "paragraph": "Catherine was slightly surprised. “ I didn’t expect that…”"
      },
      {
        "paragraph": "“My mom already knows that my dad is back but she hasn’t gone to see him. She just doesn’t have the\nguts to see him, ” Shaun said. “My mom really"
      },
      {
        "paragraph": "made too many mistakes back then.”"
      }
    ]
  },
  {
    "title": "Chapter 1305 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine sighed."
      },
      {
        "paragraph": "It was true that Lea had made a lot of mistakes."
      },
      {
        "paragraph": "Since she was married back then, she should have kept her distance from Mason. That way, she would\nnot have misunderstood Brennan time and again."
      },
      {
        "paragraph": "Between couples, the more they cared about each other, the more fragile the trust between them was."
      },
      {
        "paragraph": "She and Shaun used to be like that."
      },
      {
        "paragraph": "However, unlike Lea and Brennan’s marriage, Shaun had never slept with Sarah nor did they have\nchildren together—let alone get married."
      },
      {
        "paragraph": "Otherwise, she would not have gotten back together with him at all."
      },
      {
        "paragraph": "“Does your mom know that Liam is Brennan’s son?” Catherine asked."
      },
      {
        "paragraph": "Shaun shook his head. “I didn’t tell her. I’m afraid she won’t be able to stand the shock.”"
      },
      {
        "paragraph": "In addition to marrying a scumbag like Mason, if she also found out that the child from that year was"
      },
      {
        "paragraph": "not Mason’s at all, Lea might break down."
      },
      {
        "paragraph": "“Yes. Liam is already gone. If you tell her that… she might not be able to take it.” Catherine thought\nabout it from a woman’s point of view. “ If it were me, I might get the idea of taking Mason with me to m y\ngrave. She gave so much for Mason, but she was treated as a joke in the end.”"
      },
      {
        "paragraph": "“So let’s keep this matter a secret. ” Shaun gently held her hand. “Cathy, I actually think that I’m much\nluckier than my mom. My dad is right. You’re smart and prevented me from getting married. If I only"
      },

      {
        "paragraph": "found out the truth in my 5os or 6os, I would also break down.”"
      },
      {
        "paragraph": "“Don’t misunderstand. I didn’t want to stop you, I just didn’t want Sarah to succeed. ” Catherine gave him\na scornful look. “I also wanted you to see how good you looked while getting cuckolded.”"
      },
      {
        "paragraph": "“You little scoundrel…”"
      },
      {
        "paragraph": "Shaun pinched her palm in chagrin as his handsome face appeared slightly lonely. “Weren’t you jealous\nat all at that time?”"
      },
      {
        "paragraph": "“I wasn’t jealous,” Catherine said decisively, “You treated me so badly, but you wanted me to be jealous\nback then? Are you still dreaming? Or are you overestimating your charm? Do you want me to bring up\nthe past?”"
      },
      {
        "paragraph": "Shaun panicked at the last sentence. “Don’t, babe, I was wrong. I didn’t know better. You’re already\ntolerating me a lot for giving me a chance. I should know how to differentiate chalk from cheese.”"
      },
      {
        "paragraph": "Catherine was not angry, but she deliberately snorted coldly."
      },
      {
        "paragraph": "“Cathy, we should cherish the present.” Shaun stroked her little hand gently."
      },
      {
        "paragraph": "“Yes, indeed.” Catherine nodded in agreement. “At least, it’s my greatest happiness that my children are\nstill safe and sound by my side.”"
      },
      {
        "paragraph": "Shaun asked quietly, “Do you only have eyes for the children? What about me?”"
      },
      {
        "paragraph": "“You?” Catherine raised her brows and looked at him with a vague smile. “You’re a buy-two-get-one-free\npackage. I don’t need you, but I can take you if I have to.”"
      },
      {
        "paragraph": "Shaun was deeply hurt. He was a giveaway?"
      },
      {
        "paragraph": "Should the gifts not be Lucas and Suzie instead? However, he did not dare to say it out loud. He was\nafraid that a giveaway prize like him would be thrown away."
      },
      {
        "paragraph": "“Yes, I’m a giveaway prize, like those free gifts you see on the streets. In that case, I’ll accompany you\nfor life.” Shaun smiled and comforted himself."
      }
    ]
  },
  {
    "title": "Chapter 1306 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine looked at his forced smile and could not bear to hit him."
      },
      {
        "paragraph": "“Cathy, we should cherish the present, so come back with me to the Hills’ residence tonight…”"
      },
      {
        "paragraph": "“Send me back to the Yules’ residence,” Catherine interrupted him. “I’m not divorced yet, so it’s not\nappropriate for me to stay in the Hills’ residence every day. Besides, I’m not married to you.”"
      },
      {
        "paragraph": "Shaun was silent for a while. “Then I’ll go back to the Yules’ residence with you.”"
      },
      {
        "paragraph": "“Do you want your leg to be broken by my dad? ” Catherine did not doubt that Joel would do it. “\nAlthough my dad doesn’t like Wesley, he has disliked you for a long time.”"
      },
      {
        "paragraph": "“Then… when can I sleep with you at night?” Shaun was depressed. His tone made him sound like a\ncomplaining woman."
      },
      {
        "paragraph": "Catherine blushed at his straightforward words. “Do you want to be told off? We just made up last night\nand you want to sleep with me tonight? Sorry, but I’m afraid this pace isn’t suitable for me. Why don’t you\nfind a different target— ”"
      },
      {
        "paragraph": "“ I was wrong, Cathy. I won’t dare to talk nonsense again.” Shaun hurriedly hit his mouth. “I just don’t\nwant to be separated from you. As long as I’m away from you, I’ll miss you like crazy.”"
      },
      {
        "paragraph": "There were only two of them in the car, and his professions came wave after wave."
      },
      {
        "paragraph": "No matter how calm Catherine was, she still felt heat spreading across her face."
      },
      {
        "paragraph": "To divert attention, she turned on the radio which was reporting on entertainment news."
      },

      {
        "paragraph": "“Next, let’s focus on the famous director, Andy Cheever, who will be getting ready for the film, The Belle.\nWe don’t need to talk about Director Cheever’s movies. His previous films broke several box office\nrecords in the country and several actresses who worked with him even won Best Actress awards."
      },
      {
        "paragraph": "“Therefore, many artists have been competing for the lead female role in this film. But as far as I know,\nthe candidates for the lead female role of The Belle are likely to be Cindy Turner or Eliza Robbins, a\nrising theater star.”"
      },
      {
        "paragraph": "Catherine immediately snapped to attention at Cindy’s name."
      },
      {
        "paragraph": "She never expected that Cindy, who had disappeared from the acting circle after being slapped in the\nface, would be planning to make a comeback."
      },
      {
        "paragraph": "That two-faced woman was simply a cockroach that would not die."
      },
      {
        "paragraph": "The host on the radio continued, “Speaking of Cindy Turner, she does have some acting experience. She\nmade her debut as a singer and won a movie award last year. It’s reported that she’ll be marrying the\nheir of the Jewell family, Chester Jewell. The Jewell family also plays an important role in the\nentertainment circle. With the Jewell family as her backer, I’m guessing Cindy has a good chance to win\nthe role."
      },
      {
        "paragraph": "“However, a majority of netizens believe that Eliza Robbins is more suitable for the female lead role in\nThe Belle. Although many people said that Eliza’s acting was too over-the – top three years ago, her\nacting skills had become unbelievably good two years ago. She has also become a lot more stable, and\nher popularity rose sharply in the past two years. She’s been called a rising star in theater."
      },
      {
        "paragraph": "“In any case, no matter who stars in The Belle, we sincerely hope that Director Cheever will make\nanother masterpiece.”"
      },
      {
        "paragraph": "The entertainment news report ended."
      },
      {
        "paragraph": "Catherine did not feel like listening anymore and took out her phone to search for Eliza Robbin’s name."
      },
      {
        "paragraph": "Most of Eliza’s photos were taken from blockbusters. Her beauty was dazzling and captivating, especially\nher eyes which gave off a very cold and stern feeling. It made people feel like they would be sucked into\nher gaze when they looked at her."
      },
      {
        "paragraph": "Such a person was born to be a star."
      },
      {
        "paragraph": "However, those eyes gave her a familiar feeling. It was as if she had seen them somewhere before."
      },
      {
        "paragraph": "She looked at Eliza’s past photos and was a little surprised. Eliza had long black hair then as well, but\nshe appeared sweet and liked to laugh. Her smile was full of sweetness and vitality."
      },
      {
        "paragraph": "It was the same face, but she felt like two different people."
      }
    ]
  },
  {
    "title": "Chapter 1307 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Shaun glanced at her while driving and could not help but get nervous when he saw her staring at a\npicture of a woman. “You’re not… getting obsessed with female celebrities again, right?”"
      },
      {
        "paragraph": "Then, he comforted himself. Forget it. Her being obsessed with female idols was better than her being\nobsessed with male idols."
      },
      {
        "paragraph": "“It’s the rising theater star, Eliza Robbins.”"
      },
      {
        "paragraph": "Catherine said, “I wanted to see if she could compete against Cindy.”"
      },
      {
        "paragraph": "Shaun gave her a complicated look and told her the truth, “You’re talking about the female lead role? She\ndefinitely has no chance.”"
      },
      {
        "paragraph": "Catherine looked at him gloomily. “Don’t look at me like that.”"
      },
      {
        "paragraph": "Shaun felt aggrieved. “You might not know the Jewell family’s power in the entertainment industry.\nChester is a major shareholder in the three largest media and film companies. As long as he says the\nword, not even the most arrogant director will dare to offend him. If they offend him, it’ll be the same as\ncutting off their livelihood in the entertainment industry.”"
      },
      {
        "paragraph": "“Heh, that makes sense, ” Catherine sneered, “ Cindy’s bad acting skills won her the award for Best\nActress last year. She could even make a comeback despite being suspected of plagiarizing my songs.\nAlthough Chester helped me last time, I still want to ask which part of Cindy is he fascinated with? Her\nhypocrisy? Her vanity? Or how despicable and shameless she is?”"
      },
      {
        "paragraph": "Shaun rubbed his nose awkwardly. “Although we’re friends, I can’t determine who he marries.”"
      },
      {
        "paragraph": "Catherine thought about it and agreed."
      },

      {
        "paragraph": "Chester and Rodney were different. Chester was very shrewd. Not just anyone could figure him out."
      },
      {
        "paragraph": "Initially, she wanted to ask Shaun to persuade Chester to stop holding onto Cindy."
      },
      {
        "paragraph": "However, on second thought, the one getting married to Chester was Cindy. Cindy would try to drive a\nwedge between Shaun and Chester and make bogus accusations, causing their brotherhood to crumble."
      },
      {
        "paragraph": "It was better to leave the matter be."
      },
      {
        "paragraph": "Of course, Cindy had best not appear in front of her again. Otherwise, even if Chester was protecting\nher, Catherine would not be courteous to her."
      },
      {
        "paragraph": "In the Bluebay Century City penthouse."
      },
      {
        "paragraph": "9:00 p.m."
      },
      {
        "paragraph": "Chester had just finished a three-hour surgery and immediately smelled a peach fragrance when he\nstepped foot into his house."
      },
      {
        "paragraph": "“Chester… ” Cindy was wearing a blue gown with a low V neckline. She wrapped herself around his arm\nseductively."
      },
      {
        "paragraph": "“What are you doing here?” Chester’s low voice was full of tiredness, but with his handsome face, it only\nmade him seem sexier."
      },
      {
        "paragraph": "Cindy was so charmed she was stunned."
      },
      {
        "paragraph": "The man was like a poppy. She knew that he was poisonous and addictive, but she could not help but\nwant to get closer to him, ultimately making him become hers."
      },
      {
        "paragraph": "“Chester, I miss you.” Cindy burrowed into his arms."
      },
      {
        "paragraph": "However, she was mercilessly pushed away by Chester."
      },
      {
        "paragraph": "“Cindy, I’m very tired today. I don’t have time to play with you.” Chester went straight into the bathroom."
      },
      {
        "paragraph": "The man had casually thrown his shirt on the sofa, revealing his fine and exquisite body."
      }
    ]
  },
  {
    "title": "Chapter 1308 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Chester usually seemed scrawny while holding the scalpel during the day, but who knew his body would\nbe so perfectly toned once his clothes were"
      },
      {
        "paragraph": "A sense of infatuation flashed across Cindy’s eyes. She went after him and said, “Chester, I can help you\nbathe. I know you’re tired, so let me serve you.”"
      },
      {
        "paragraph": "Upon hearing it, Chester stopped in his steps and turned his head around to glance at her mockingly.\n“Cindy, I think you’re… overthinking things.”"
      },
      {
        "paragraph": "Cindy’s expression froze."
      },
      {
        "paragraph": "Chester turned around and walked closer to her. Then, he pinched her chin. “When you asked me to\nmarry you, I fulfilled your request. Soon, you’ll become the Young Madam Jewell that everyone admires,\nbut you don’t seem to be content. You even want to win my heart, huh?”"
      },
      {
        "paragraph": "Cindy gazed at his god-like, handsome face. She was so infatuated that she could not resist saying, “\nChester, I’m really in love with you. I can sacrifice everything for you…”"
      },
      {
        "paragraph": "“Really? Why do I feel like I’ve been paving the way for you?” Chester gave a wry smile. “ If it weren’t for\nme, you would still be a cheap singer who stole someone else’s music. After I made you a well- known\nsinger, you even got a movie award despite your poor acting skills. However, instead of being happy with\nwhat you have now, you still expect me to love you?”"
      },
      {
        "paragraph": "Stung by his criticism, Cindy’s face paled. “Yes. I admit that I am who I am today all because of you. But\nfrom now on, I’ll love you with all my heart. I can satisfy your physical needs, and I’ll do whatever you\nwant in bed. I can even be pregnant with your child— ”"
      },
      {
        "paragraph": "“Ha.”"
      },

      {
        "paragraph": "Chester laughed before she could finish speaking."
      },
      {
        "paragraph": "The depths of the man’s eyes were icy. “You truly are greedy.”"
      },
      {
        "paragraph": "“After everything I’ve said, you still don’t get it?”"
      },
      {
        "paragraph": "Chester loosened his grip on her chin, and Cindy looked at him, not knowing what to do. Her pretty eyes\nrevealed a heart-wrenching vulnerability and hurt."
      },
      {
        "paragraph": "Having seen women like her a lot, Chester remained unmoved. “Cindy, you’re not the only one who has\nsaid that to me. Too many women have said that to me. Among them, there are women who are much\nprettier, better in bed, and better at giving birth compared to you. Tell me why I should fall for you and not\nthem.”"
      },
      {
        "paragraph": "“Chester… ” Cindy was hit by his remark, and tears started pouring down her face."
      },
      {
        "paragraph": "Even so, Chester was, in no sense, moved by her expression. “Save your tears. Women look ugliest\nwhen they cry. It’s such an eyesore to me.”"
      },
      {
        "paragraph": "Cindy froze. As much as she wanted to weep, she dared not do it."
      },
      {
        "paragraph": "In others’ eyes, she was an arrogant celebrity. Yet, in front of him, she was like an ant."
      },
      {
        "paragraph": "“Chester, regardless of what you say, your mom can’t bear to leave me.”"
      },
      {
        "paragraph": "“Are you threatening me?” Chester’s eyes were frosty."
      },
      {
        "paragraph": "“No.” Cindy panicked and quickly shook her head. “ I know I’m not excellent, but I just want you to look at\nme again.”"
      },
      {
        "paragraph": "With that, she slowly took off her dress and stared at him bashfully."
      },
      {
        "paragraph": "Instead of stopping her, Chester just looked at her silently. His eyes were as still as a lake."
      },
      {
        "paragraph": "Only until she stripped completely did his eyes size her up. “Are you planning to seduce me with this\nbody?”"
      },
      {
        "paragraph": "Cindy bit her lip. Then, she stretched out her hands to touch him."
      },
      {
        "paragraph": "Before she could approach him, Chester grabbed her wrist and narrowed his eyes. “Cindy, you still don’t\nunderstand after all I’ve explained, huh? If m y mom didn’t have to count on you, a woman like you\nwouldn’t have been eligible to stand in front of me. I may not have understood your character in the past,\nbut I’ve seen through you now. Stay away from me, or I don’ t mind taking back everything you’ve gotten,\nbit by bit.”"
      },
      {
        "paragraph": "Once he finished speaking, he pushed her mercilessly to the floor."
      },
      {
        "paragraph": "“Even if I do have needs, there’ll be women satisfying them. You’ll be the last person I need. Get out of\nthis house now, and don’t ever show up here anymore without my permission.”"
      },
      {
        "paragraph": "Chester ordered her out condescendingly."
      }
    ]
  },
  {
    "title": "Chapter 1309 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Cindy broke down. She had cast her dignity aside and tried to fawn on Chester, yet he still despised her\nso much."
      },
      {
        "paragraph": "It was all Catherine’s doing. As much as Chester disliked Cindy before this, he would never be so\noffhand with her."
      },
      {
        "paragraph": "Chester only became nastier to her ever since Catherine publicly exposed that Cindy stole her music."
      },
      {
        "paragraph": "Nevertheless, what mattered most right now was making her comeback in the entertainment industry."
      },
      {
        "paragraph": "She was going to marry Chester very soon anyway, and she could ask for his family’s help to deal with\nhim by then."
      },
      {
        "paragraph": "After seeing the light, Cindy said glumly, “Fine. I’ll leave, but Chester, can you… do me a favor?”"
      },
      {
        "paragraph": "As Chester looked at her more cynically, she felt increasingly embarrassed. However, she summoned\nher courage and said, “I’ve seen the script of Director Cheever’s The Belle, and I like it a lot. I want to be\nthe female lead.”"
      },
      {
        "paragraph": "“It’s not because you like the script, but because you know Director Cheever is capable of making\nmovies. You simply wish to make a comeback through this movie and win a prestigious award.” Chester\nexposed her brutally."
      },
      {
        "paragraph": "Cindy said with her face burning, “As a woman, I must have my own career. I don’t want to depend on\nyou all the time. What’s more, I’m going to marry you soon. I want to gain a foothold in the entertainment\nindustry so that the Jewell family will take pride in me.”"
      },

      {
        "paragraph": "When Chester bit his thin lip, Cindy swiftly said, “ I’ve learned my lesson from the music incident. I feel\nvery guilty. I was too desperate for money and fame at that time. As you know, my family used to be very\npoor…”"
      },
      {
        "paragraph": "“Enough.”"
      },
      {
        "paragraph": "Chester interrupted her abruptly. “I know full well what your ulterior motive is. You don’t have to pretend\nin front of me. Get lost. I’ll call Felix Media in a moment and ask them to contact Director Cheever.”"
      },
      {
        "paragraph": "“Thank you. ” Cindy was elated. “I… l’ll leave right away. You can go on with your bath now.”"
      },
      {
        "paragraph": "She trembled as she put on her clothes."
      },
      {
        "paragraph": "The more Chester looked at her, the more he saw her as an eyesore. As such, he walked into the\nbathroom with long strides before swinging the door shut."
      },
      {
        "paragraph": "The thought of marrying this woman in the future made him feel like he was signing himself up for a living\nhell."
      },
      {
        "paragraph": "In fact, he was not so disgusted with her when he first met her. He eventually tolerated her pretense,\nconsidering that all women put on a façade."
      },
      {
        "paragraph": "However, he began to look down on her after Catherine exposed Cindy’s true colors."
      },
      {
        "paragraph": "The main reason was that Cindy was too hypocritical and greedy."
      },
      {
        "paragraph": "Not only did she want to marry him, but she also wanted his love, his body, and his power to support her\ncareer and pull the strings for her."
      },
      {
        "paragraph": "This was precisely why he was averse to relationships."
      },
      {
        "paragraph": "Even a woman like her was in a relationship. What a humiliation."
      },
      {
        "paragraph": "By the time he was done with his bath, Cindy had already left."
      },
      {
        "paragraph": "The next day, Chester woke up from a cozy sleep, and his assistant came reporting about the company’s\naffairs to him."
      },
      {
        "paragraph": "Over the years, Chester had invested in many companies, including private hospitals and film production\ncompanies."
      },
      {
        "paragraph": "After his assistant was done reporting, he suddenly asked, “Young Master Jewell, you asked me to\ninvestigate where Boris and his wife’s ashes have been moved to. After some investigation, I finally\nfound someone suspicious.”"
      },
      {
        "paragraph": "Chester sipped his coffee and recalled the incident. “ You spent a really long time investigating it.”"
      },
      {
        "paragraph": "“It’s because there are hardly any surveillance cameras around the cemetery. I only managed to find out\nafter checking the nearby traffic,” the assistant explained."
      },
      {
        "paragraph": "“Who was it?” Chester asked nonchalantly. “Eliza Robbins,” the assistant answered."
      },
      {
        "paragraph": "Chester raised his brows. “Who’s she?”"
      },
      {
        "paragraph": "“An emerging celebrity.” The assistant clicked open Eliza’s photo and passed the phone to him."
      },
      {
        "paragraph": "Chester took it and saw the woman’s beautiful face. The corners of her pretty lips were curled into a\ncharming smile, yet her eyes were so cold that they could put one in a daze."
      },
      {
        "paragraph": "In his memory, he knew someone who had a gaze like this as well."
      }
    ]
  },
  {
    "title": "Chapter 1310 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Cold and indifferent."
      },
      {
        "paragraph": "Other than seeing her lose control that year they broke up, he had barely seen her like that since then."
      },
      {
        "paragraph": "“Young Master Jewell…” his assistant called."
      },
      {
        "paragraph": "“Yes, so does she have to do with the Neeson family?” Chester asked."
      },
      {
        "paragraph": "“Yup, she actually does.” His assistant continued,“ I found out that before Jennifer married Borris, when\nshe and Charity stayed at Geraldton, Eliza was Charity’s only childhood playmate. But after Bories took\nCharity back to the Neeson family, Charity and Eliza began writing letters to each other. It was when\nEliza’s parents got a divorce and her mother took her away that she lost touch with Charity.”"
      },
      {
        "paragraph": "Chester lit up a cigarette silently."
      },
      {
        "paragraph": "Deep down, he found it strange. In that case, did Eliza dig up Jennifer and Boris’s ashes and move them\naway solely because of her childhood friendship with Charity?"
      },
      {
        "paragraph": "“When Charity was in jail, did Eliza visit her?” “No.” The assistant shook his head."
      },
      {
        "paragraph": "Chester rubbed his brows."
      },
      {
        "paragraph": "“By the way,” the assistant added, “Eliza has been vying with Cindy for the female lead in The Belle.\nFrom what I’ve heard, the readers of the original work and Director Cheever think that Eliza is a better fit.\nBut… you contacted the company to ask Director Cheever to make Cindy the female lead. ”"
      },
      {
        "paragraph": "Chester raised his brows, and his thin lips curled in surprise. “Since Director Cheever has decided on\nher, it means that her acting skills are fine.”"
      },

      {
        "paragraph": "“Yeah, she acts well.” The assistant said with a little excitement, “You don’ t know how dramatic and\nsensational she was when she played the female murderer in her previous movie…”"
      },
      {
        "paragraph": "After describing for a while, the assistant probably became conscious of his demeanor as he said in\nembarrassment, “Actually, her acting skills were awful back then. However, she has suddenly improved\nover the past two years.”"
      },
      {
        "paragraph": "“The past two years?”"
      },
      {
        "paragraph": "Chester’s brows twitched pensively."
      },
      {
        "paragraph": "He recalled it was two years ago that Charity jumped into the sea."
      },
      {
        "paragraph": "“Send me Eliza’s schedule. I want to meet her, ” Chester said impassively after some time."
      },
      {
        "paragraph": "“I can bring her here straight away,” the assistant responded."
      },
      {
        "paragraph": "“No need.” Chester continued to stare at the photo on the phone."
      },
      {
        "paragraph": "“I guess Eliza will look for President Daley directly.” The assistant said, “In case you don’t know, Eliza is\nalso an artist under Felix Media.”"
      },
      {
        "paragraph": "Chester was slightly taken aback. “Why didn’t I see her at the past year-end parties?”"
      },
      {
        "paragraph": "“She has never attended any of them,” the assistant replied. “Last year, she was sick, and the year\nbefore, she was filming a movie.”"
      },
      {
        "paragraph": "“Interesting.” Chester’s thin lips curled."
      },
      {
        "paragraph": "He had a feeling that Eliza might know something about the matter."
      },
      {
        "paragraph": "11:00 a.m."
      },
      {
        "paragraph": "Chester showed up at Felix Media."
      },
      {
        "paragraph": "The CEO of the company, Shedrick Daley, was astonished at his arrival. He laughed and said, “I’ve\ncontacted Director Cheever, and he has already agreed to let Cindy play the lead. Yet, here you are. Are\nyou afraid that I’ll give the soon-to-be Young Madam Jewell a hard time?”"
      },
      {
        "paragraph": "Chester smirked. “I pity you for having to support her as the female lead despite her lousy acting.”"
      },
      {
        "paragraph": "“Ahem. That’s very direct of you.” Shedrick coughed. “ Since we demanded to make Cindy the female\nlead, Director Cheever will have no choice but to spend more time guiding her. Hopefully, she won’t\nbehave snobbishly.”"
      },
      {
        "paragraph": "“ If she does, just ask Director Cheever to change the female lead,” Chester replied coldly."
      },
      {
        "paragraph": "Shedrick glanced at him in astonishment. Just as he was about to speak, his secretary suddenly came in\nand said, “President Daley, Eliza is here.”"
      },
      {
        "paragraph": "Awkwardness washed over Shedrick, and he glanced at Chester before saying to his secretary, “Tell her\nthat I’m not around. Ask her…” “Ask her to come in,” Chester said out of the blue."
      }
    ]
  },

  {
    "title": "Chapter 1311 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Shedrick glimpsed at Chester in surprise."
      },
      {
        "paragraph": "However, all he saw was Chester taking out a cigarette from the cigarette packet and lighting it. From his\ncold, exquisite brows, it was hard to tell what was on his mind."
      },
      {
        "paragraph": "“Okay.” Shedrick nodded."
      },
      {
        "paragraph": "Shortly after, a tall and slender figure walked in. She was wearing a pair of light blue wide -leg pants,"
      },
      {
        "paragraph": "black canvas shoes, and a black T-shirt, which was so short that a large part of her slim and fair waist\nwas exposed. The curves from her waist to her hips could give any man the desire to take control of her."
      },
      {
        "paragraph": "On her head, she had milky brown hair and a white baseball cap over it. Beneath the cap was her pretty,\ndelicate bare face. She looked like she was born to live under the spotlight. She also had very fair skin\nand a tall nose."
      },
      {
        "paragraph": "Her eyes, in particular, were dark, clear, and sharp. Upon a closer look, they exuded a hazy feeling that\nmade it hard for others to see through."
      },
      {
        "paragraph": "Her eyes first settled on Shedrick before they swept across to Chester. A calm look flashed across the\ndepths of her eyes."
      },
      {
        "paragraph": "However, just as Chester wanted to take a good look at her, he felt that it could be an illusion."
      },
      {
        "paragraph": "He took a lazy drag on his cigarette as he leaned on the couch. His gaze flashed with a hint of interest."
      },
      {
        "paragraph": "What an interesting woman!"
      },
      {
        "paragraph": "It was very rare for a woman to remain calm upon seeing him."
      },

      {
        "paragraph": "If this was not her basic character, she must be putting on a front to attract his attention."
      },
      {
        "paragraph": "“Eliza, let me introduce you to him. This is Young Master Jewell…”"
      },
      {
        "paragraph": "Shedrick raised his finger and pointed to Chester while speaking in a gentle tone."
      },
      {
        "paragraph": "He considered Eliza to be a promising artist."
      },
      {
        "paragraph": "Eliza stared intently at Chester with her dark eyes. There was barely any expression visible on her pretty\nface. “Hi, Young Master Jewell.”"
      },
      {
        "paragraph": "Chester raised his brows without uttering a word, as if he was absent-minded."
      },
      {
        "paragraph": "Upon noticing his silence, Eliza promptly averted her eyes and looked directly at Shedrick. “I heard Cindy\nhas been confirmed as the female lead of The Belle.”"
      },
      {
        "paragraph": "Shedrick knew that she came here with a purpose, but he did not expect her to have the audacity to ask\nabout it in front of Chester. Hence, he nodded in astonishment. “Yes, it was Director Cheever’s decision.”"
      },
      {
        "paragraph": "Eliza’s clear eyes were grim. “Really? I thought Miss Turner got the role because Chester pulled some\nstrings for her again. After all, Director"
      },
      {
        "paragraph": "Cheever was more fond of me before. I also think my acting skills are much better than Cindy’s.”"
      },
      {
        "paragraph": "Feeling awkward, Shedrick glanced nervously at Chester."
      },
      {
        "paragraph": "Although the man’s expression remained unchanged, the atmosphere seemed a little colder."
      },
      {
        "paragraph": "“Eliza, are you aware of what you just said in front of Young Master Jewell?” Shedrick reminded her."
      },
      {
        "paragraph": "Eliza simply glanced at Chester before asking with a hint of confusion in her dark eyes, “I was referring to\nChester, not Young Master Jewell. There are many other people with the last name Jewell anyway.”"
      },
      {
        "paragraph": "Shedrick was speechless."
      },
      {
        "paragraph": "He was certain that Eliza did that on purpose."
      }
    ]
  },
  {
    "title": "Chapter 1312 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "What a bold woman. “Eliza, stop fooling around. Didn’t I make myself clear enough? This is Chester\nJewell.”"
      },
      {
        "paragraph": "“Oh, really?” Eliza’s brows relaxed. “I assumed the man who fell for Cindy to be ugly and have poor\ntaste. When I saw this elegant and strikingly handsome gentleman, I didn’t dare take him as the rumored\nYoung Master Jewell.”"
      },
      {
        "paragraph": "“Eliza…” Shedrick’s face went red with rage."
      },
      {
        "paragraph": "“Did I say something wrong? I just praised Young Master Jewell for his strikingly handsome looks. ” Eliza\nshrugged, looking baffled. “I had never seen Chester before, so I could only imagine his appearance.\nSince I hate Cindy, I don’t have a good impression of her man either.”"
      },
      {
        "paragraph": "Her words left Shedrick exasperated. All he could do was look at Chester fearfully. “I’m sorry, Young\nMater Jewell. Eliza… She may be good at acting, but there’s something wrong with her brain.”"
      },
      {
        "paragraph": "Anyhow, he wanted to keep Eliza, considering that she was the company’s milch cow."
      },
      {
        "paragraph": "Chester put out the cigarette in the ashtray. When he lifted his head, his exquisite thin lips curled into a n\nenigmatic smile. “From the way you beat around the bush to criticize me, I can see that you have a\nproblem with me.”"
      },
      {
        "paragraph": "“Do you want me to be honest? Yes, I have a problem with you.”"
      },
      {
        "paragraph": "Eliza nodded calmly. She stared into Chester’s dark eyes and said indifferently, “You can pamper Cindy\nhowever you want since she’s your girlfriend. It’s fine if you privately invest in her by helping her secure a\nrole in movies and release albums, but you can’t possibly feed the audience with sh*t. The most"
      },

      {
        "paragraph": "ridiculous thing is Cindy winning the award for being the most well-liked actress last year with that kind of\nacting. Ha…”"
      },
      {
        "paragraph": "“Eliza, don’t overstep in line.” Shedrick panicked. He knew Chester very well, and Chester could be\nterrifying when he flew into a rage."
      },
      {
        "paragraph": "Nevertheless, Eliza continued to say calmly, as if she did not hear what Shedrick said. “So are you going\nto fork out some money to buy her the best actress award at the end of the year, Young Master Jewell?”"
      },
      {
        "paragraph": "“That’s my business. How I spend my money has nothing to do with you.”"
      },
      {
        "paragraph": "Chester slowly rose to his feet, and his tall figure made the atmosphere of the office much duller. “ You’re\nshouting at me simply because you think it’s unfair, huh? Well, life is unfair. If you’re capable… You can\nbe my woman too, and perhaps… you’ll receive the same treatment as Cindy.”"
      },
      {
        "paragraph": "As soon as he finished speaking, he reached out to her chin."
      },
      {
        "paragraph": "Eliza’s expression slightly shifted, and she smacked his hand away."
      },
      {
        "paragraph": "Beneath her cap were a pair of eyes that briefly flashed with astonishment and hatred."
      },
      {
        "paragraph": "A dumbfounded look had already washed over the face of Shedrick, who was standing aside. Chester\nwas no doubt the so-called Young Master Jewell. He even had the mood to hit on a woman at this point\nin time."
      },
      {
        "paragraph": "However, his behavior was understandable. The entertainment industry was filled with beautiful women,\nbut a woman like Eliza, who had character and looks, was rare."
      },
      {
        "paragraph": "“I’m sorry. If I had that intention, I would’ve become someone else’s woman long ago. It would never be\nyour turn, Young Master Jewell.”"
      },
      {
        "paragraph": "Eliza argued with an indifferent look on her face."
      },
      {
        "paragraph": "A faint smile was still visible on the corners of Chester’s mouth, but his eyes had darkened. “So what’s\nthe point of you coming here and kicking up a fuss? To our company, you’re merely a money- making\ntool. Cindy was chosen to be the female"
      },
      {
        "paragraph": "lead based on her ability. Regardless of whether it was based on her physical ability or something else, it\nwas her capability.”"
      },
      {
        "paragraph": "“You’re right.”"
      },
      {
        "paragraph": "Eliza nodded. “Having said that, when your company signed me on, it said in black and white that it’d\nsupport me and offer me openings. What has your company offered me these few years? The\nadvertisements and endorsements I’ve been involved in these two years are all my own earnings. As for\nthe movies and TV programs, I attended each of the auditions before securing the roles. I don’t get any\ntraining despite having signed the contract, but when it comes to commission, you waste no time in\ntaking it.”"
      },
      {
        "paragraph": "Shedrick said, “When our company signed the contract with you four years ago, we did provide you with\nopenings. But your acting skills were lousy, and you didn’t make an effort to improve yourself either.\nWhat could we do?”"
      },
      {
        "paragraph": "“Now that I’ve worked hard and become famous, have you given me any openings?”"
      },
      {
        "paragraph": "Eliza asked, “Not only did you not give me any openings, but you also helped other artists under your\ncompany to snatch my openings with devious tactics. I’ve canceled all my recent movie appointments\njust for the sake of Director Cheever’s movie, only to find that Cindy is making her comeback. She has\nsnatched my role away just like that. Don’t I have the right to demand an explanation for it?”"
      }
    ]
  },
  {
    "title": "Chapter 1313 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Shedrick looked abashed. “Our company can arrange another movie for you—”"
      },
      {
        "paragraph": "“If you’re not satisfied with this company, you can switch to another one.” Chester interrupted Shedrick\nand glanced at Eliza sideways with a hint of playfulness. “You want it to be fair, but tell me. Which\ncompany in the entertainment industry is perfectly fair? If you’re unhappy with it, feel free to get lost as\nlong as you can afford the compensation for breaching the contract.”"
      },
      {
        "paragraph": "Eliza fixed her eyes on his indifferent and cruel face, but she was not put out by his nasty remark."
      },
      {
        "paragraph": "Instead, she nodded after looking into his calm eyes for a moment. “Okay, I’ll pay the fees. I won’t\ninterrupt both of you further.”"
      },
      {
        "paragraph": "“Sure.” Chester smiled wanly. “But as you know, the Jewell family occupies half of the entertainment\nindustry. I can easily blacklist you.”"
      },
      {
        "paragraph": "Eliza’s body stiffened, and she glared at him. This man in front of her made absolutely no pretense of\nhiding the hostility in his eyes."
      },
      {
        "paragraph": "Just like that, the atmosphere became awkward."
      },
      {
        "paragraph": "The situation made Shedrick feel uneasy. “ Eliza, you can leave first. Just forget about what happened\ntoday.”"
      },
      {
        "paragraph": "“What a brilliant capitalist.”"
      },
      {
        "paragraph": "Eliza snorted before she turned around to leave."
      },
      {
        "paragraph": "“Wait a minute.” Chester suddenly shouted to stop her. Then, he turned around and said to Shedrick, “\nYou can head out first.”"
      },

      {
        "paragraph": "Shedrick was dumbfounded at how Chester was asking him to go out when this was his office."
      },
      {
        "paragraph": "However, upon looking at Chester’s threatening gaze, he had no choice but to leave with a bitter smile."
      },
      {
        "paragraph": "Deep down, he wondered. Chester had never been the petty sort, but he seemed to be targeting Eliza on\npurpose this time. Could he be interested in Eliza and so want to force her to be his secret lover?"
      },
      {
        "paragraph": "At this thought, Shedrick closed the door cautiously when he left."
      },
      {
        "paragraph": "As soon as Eliza heard the door closed, her eyes darkened, but she did not say anything."
      },
      {
        "paragraph": "“Do you know why I wanted you to stay?” Chester stared at her. His handsome face was turning colder\nlittle by little. “Were you the one who dug up Boris and his wife’s ashes?”"
      },
      {
        "paragraph": "Eliza’s eyes narrowed, and she pursed her pretty thin lips. Nevertheless, she continued to stay silent."
      },
      {
        "paragraph": "“You’re smart.” Chester laughed. “At least you’re smarter and calmer than any ordinary woman.”"
      },
      {
        "paragraph": "He had noticed many times that when faced with tough questions, she remained silent without getting\nagitated. This showed that she was mentally strong."
      },
      {
        "paragraph": "“Yes, I did that.” This time, Eliza nodded."
      },
      {
        "paragraph": "“Why?” Chester’s expression was imperceptible. “Do you know Charity?”"
      },
      {
        "paragraph": "“Yeah. ” Eliza nodded straight away. “That’s why I moved her parents’ ashes and buried them\nelsewhere.”"
      },
      {
        "paragraph": "Chester lit another cigarette. “Her parents’ ashes were well kept there. Who told you to move them? Was\nit Charity?”"
      },
      {
        "paragraph": "Eliza glimpsed at him in astonishment. “She’s as dead as a doornail. How could she have possibly asked\nme to dig up the ashes?”"
      },
      {
        "paragraph": "“As dead as a doornail?” Chester turned around with two cigarettes in his hand before he let out a deep\nlaugh."
      },
      {
        "paragraph": "“Isn’t she? She jumped into the turbulent sea. It would be hard even for a swimmer to stay alive. ” Eliza\nsuddenly said coldly, “Her dead body might’ve sunk to the seabed and got eaten up by the fishes.”"
      },
      {
        "paragraph": "“…Shut up.”"
      }
    ]
  },
  {
    "title": "Chapter 1314 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Chester threw a grim glance at Shedrick."
      },
      {
        "paragraph": "Shedrick’s heart shuddered, and he promptly corrected himself. “If you’re interested in her, I’ll try my best\nto send her to your bed, alright?”"
      },
      {
        "paragraph": "“Shut up. ” Chester could not help but warn him, “ I was asking her about something else.”"
      },
      {
        "paragraph": "“Seriously?” An incredulous look crossed Shedrick’s face."
      },
      {
        "paragraph": "Chester rubbed his temples. “Have you seen me pursuing or forcing any woman?”"
      },
      {
        "paragraph": "“That’s true too. With your status, it has always been the women pursuing you, ” Shedrick answered with\na grin."
      },
      {
        "paragraph": "Chester could not be bothered to drone on with him."
      },
      {
        "paragraph": "Hence, he turned around and walked out with long strides. When he was at the door, he paused to ask, “\nIs the movie The Belle that great?”"
      },
      {
        "paragraph": "“Of course. Look who the director is. It’s Director Cheever. All his movies are f*cking excellent.”"
      },
      {
        "paragraph": "Shedrick continued, “Tsk. Casting the female lead aside, people have also been vying for the first and\nsecond supporting female roles fiercely.”"
      },
      {
        "paragraph": "Chester fell silent for a few seconds before he said, “ Let Eliza be the first supporting actress then. Pull\nsome strings with Director Cheever and ask him to give her more parts.”"
      },
      {
        "paragraph": "With that, he strode out."
      },

      {
        "paragraph": "Shedrick froze. “Hang on. The first supporting actress’s role…” She had to play the villain who was as\nevil as the Wicked Witch of the West."
      },
      {
        "paragraph": "Was Chester trying to trick Eliza into taking on such a role?"
      },
      {
        "paragraph": "After all, a young actress like her cared most about her image. Playing the unlikable villain would most\nlikely destroy the reputation that she had built over the years."
      },
      {
        "paragraph": "However, Chester had left before Shedrick could finish his sentence."
      },
      {
        "paragraph": "Shedrick had no choice but to shut his mouth, hoping that Eliza would fend for herself."
      },
      {
        "paragraph": "Meanwhile, Eliza did not hurry to leave after she got into her car."
      },
      {
        "paragraph": "Seated in the driver’s seat, she flipped open the mirror in the sun visor and stared silently at the familiar\nyet strange face in the mirror."
      },
      {
        "paragraph": "Yes, it was strange."
      },
      {
        "paragraph": "It was strange because the face did not belong to her, but it was familiar because she had inhabited this\nbody for two years."
      },
      {
        "paragraph": "No one knew that she was Charity instead of Eliza."
      },
      {
        "paragraph": "When the real Charity jumped into the sea two years ago, a huge wave swept her into the deep sea and\nkilled her."
      },
      {
        "paragraph": "In her last moments, she was so frustrated and dissatisfied that she could not take revenge on her\nfamily’s behalf."
      },
      {
        "paragraph": "Nevertheless, she could not believe that when she opened her eyes once again, her soul had ended up\nin Eliza’s body."
      },
      {
        "paragraph": "Eliza had committed suicide because she could not get over a breakup, yet Charity came back to life\nwith Eliza’s body."
      },
      {
        "paragraph": "Rebirth was something that Charity had only come across in books. She had never thought that it would\nhappen to her."
      },
      {
        "paragraph": "She knew that it was not a coincidence."
      },
      {
        "paragraph": "It was the pendant. Back then, a priest did give Eliza and her a pendant, saying that the two of them\nwere doomed to die early. However, if the two of"
      },
      {
        "paragraph": "them carried this pair of pendants with them, one of them might have hope of staying alive."
      },
      {
        "paragraph": "Throughout these 20 years, she and Eliza had been carrying the pendants with them."
      },
      {
        "paragraph": "Little did they realize that what the priest said turned out to be true."
      },
      {
        "paragraph": "Indeed, only she or Eliza could survive."
      },
      {
        "paragraph": "Therefore, Charity had survived on Eliza’s behalf in the last two years. She had been working hard as an\nactress to make more money in order to set herself on a firm footing before she could take revenge."
      },
      {
        "paragraph": "Nevertheless, she did not expect to come across Chester today."
      },
      {
        "paragraph": "This man was still as disgusting as he was three years ago."
      },
      {
        "paragraph": "He even gave her hints about his intention of keeping Eliza as her lover."
      },
      {
        "paragraph": "The second she recalled losing her virginity to this man, she felt like throwing up."
      }
    ]
  },
  {
    "title": "Chapter 1315 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Chester must not have thought that Eliza was actually Charity."
      },
      {
        "paragraph": "Charity did not understand why he was still concerned about her. Was he not willing to let go of her even\nafter her family was broken and she was dead?"
      },
      {
        "paragraph": "If she were to describe her feelings toward Sarah as bone-deep hatred, then she loathed Chester."
      },
      {
        "paragraph": "If she had another chance, she wished she had nothing to do with this man. That was why she had been\ntrying hard to hide from him over the past two years, and even so, she still ended up crossing his path."
      },
      {
        "paragraph": "At this point, all she wanted was to make more money to compensate for the breach of contract and\nleave Felix Media afterward."
      },
      {
        "paragraph": "Amid her thoughts, her phone suddenly rang. It was a call from Shedrick. “Eliza, I have good news for\nyou. Young Master Jewell just said that our company owes you, so although you can’t be the female\nlead, he’ll cast you as the first supporting actress.”"
      },
      {
        "paragraph": "Eliza’s face stiffened. “Are you sure he wants me to be the first supporting actress? Is he trying to take\nrevenge on me?”"
      },
      {
        "paragraph": "Shedrick responded embarrassedly, “Don’t see Young Master Jewell in such a negative light. The first\nsupporting actress’s role is indeed unlikable, but it’s a challenge to your acting skills. Not everyone can\nmanage this role. How about this? I’ll pull some strings with Director Cheever and ask him to adjust your\npart so that it’s less unlikable. ”"
      },
      {
        "paragraph": "“Don’t you know Director Cheever hates actors who change their parts the most?” Eliza said mockingly,\n“If I do that, Director Cheever will hate me, and he’ll surely make things difficult for me when I join the\ncrew.”"
      },

      {
        "paragraph": "“So what do you want?” Shedrick’s head hurt. “ Young Master Jewell suggested it with the best of\nintentions.”"
      },
      {
        "paragraph": "“With the best of intentions?” Eliza did not buy that at all. “I’m not going to take it. I won’t act in Director\nCheever’s movie.”"
      },
      {
        "paragraph": "“Eliza, don’t bite the hand that feeds you.” Shedrick flew into a fury. “If you reject it, you’ll really offend\nYoung Master Jewell, and he can easily blacklist you.”"
      },
      {
        "paragraph": "Shedrick advised her, “Do your best in the movie, and I’ll strive to get you the best supporting actress\naward at the end of the year. In fact, the public is more concerned about the actors’ acting skills. If you\ndon’t like Cindy, you can outperform her with your acting.”"
      },
      {
        "paragraph": "A moment later, Eliza had no choice but to reply,“"
      },
      {
        "paragraph": "Okay.”"
      },
      {
        "paragraph": "In that case, she would go ahead and act."
      },
      {
        "paragraph": "It was merely a movie, and it would only take her one month to play the supporting role."
      },
      {
        "paragraph": "After leaving Felix Media, Eliza got rid of the paparazzi and switched to another car. She drove to a\nfarmhouse, which was 40 kilometers away."
      },
      {
        "paragraph": "She got out of the car and entered the farmhouse. A tanned man walked toward her. “Miss Robbins… ”\n“Where’s he?” Eliza asked."
      },
      {
        "paragraph": "“In the cellar, as always.”"
      },
      {
        "paragraph": "Eliza took a torchlight and put on a face mask"
      },
      {
        "paragraph": "before she headed straight to the cellar."
      },
      {
        "paragraph": "A man in scruffy clothes was locked up in there. His shirt was so dirty that one could not tell its original\ncolor. With injuries all over his body, he curled up in fear."
      },
      {
        "paragraph": "The man was none other than Thomas Neeson. When he caught sight of the person with the white face\nmask again, he went insane. “ I beg you to let me go.”"
      },
      {
        "paragraph": "He sank to his knees with a thump. “Miss, no— I mean Madam, please let me go. I beg you.”"
      },
      {
        "paragraph": "He was close to going mad as he had been locked here for almost a month."
      },
      {
        "paragraph": "After Chester crippled him, he was admitted to the hospital for one week. During that one week, Sarah\ndid not visit him at all."
      },
      {
        "paragraph": "Then, once he was discharged, he was kidnapped and locked up in here."
      },
      {
        "paragraph": "This person would show up now and then, and she was the one who left him scarred all over."
      },
      {
        "paragraph": "“I can’t let you go yet.” Eliza approached him uncannily."
      },
      {
        "paragraph": "“Who the hell are you?” Trembling, Thomas asked, “Who told you to kidnap me? Was it… Freya or\nCatherine?”"
      },
      {
        "paragraph": "Eliza smirked. “If you hadn’t been this stupid, you wouldn’t have ended up in this state. You know too\nmuch.”"
      },
      {
        "paragraph": "“What do you mean?” Thomas roared, “ Sarah was the one who instructed you, right?”"
      }
    ]
  },

  {
    "title": "Chapter 1316 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Eliza kept quiet."
      },
      {
        "paragraph": "However, the white mask looked intimidating and eerie under the dim lights."
      },
      {
        "paragraph": "Having been imprisoned in this dark spot for a long time, Thomas was on the brink of breaking down. He\nbellowed uncontrollably, “ It must be her. It must be her. Ask her to come here. I’m her brother.”"
      },
      {
        "paragraph": "“ I’m sure she detests having a brother like you. ” Eliza said unforgivingly, “You disrupted her plans time\nand time again even though she has advised and warned you before. If you didn’t stir up trouble, she\nwouldn’t have done this to you. You couldn’t even handle the trivial tasks she asked you to do. ”"
      },
      {
        "paragraph": "“My bad. It’s my fault.” After hearing her words, Thomas was even more certain that Sarah was the one\nwho kidnapped him."
      },
      {
        "paragraph": "He knew better than anyone else that his sister had always been cruel. She had some mysterious people\nsecretly working for her."
      },
      {
        "paragraph": "“I won’t dare to do it anymore. Tell her that I’ll behave myself in the future.” Thomas said tearfully,\n“Chester has crippled me down there, and"
      },
      {
        "paragraph": "I’m already very pathetic. Considering that I’m his brother, please let me go.”"
      },
      {
        "paragraph": "A glint flashed in Eliza’s eyes."
      },
      {
        "paragraph": "She did not expect Chester to be the one who crippled Thomas."
      },
      {
        "paragraph": "Had he not always been protective toward Sarah?"
      },

      {
        "paragraph": "“Unfortunately, you grasped it too late.” Eliza said indifferently, “Nothing in the world can cure regrets.\nToday might be my last time coming here. Do you know why?”"
      },
      {
        "paragraph": "A scary thought came to Thomas’ mind."
      },
      {
        "paragraph": "He finally broke down with all his tears and snort streaming down his face. “No, please. I beg you, and I’ll\nkneel to you. As long as you let me go, I’ll pay you. I have money.”"
      },
      {
        "paragraph": "“No, thank you. Being in this field, I need to stick to its rules. I’ve been paid to do this.”"
      },
      {
        "paragraph": "With that, Eliza drew a dagger and had it glided over his face slowly and softly."
      },
      {
        "paragraph": "A nasty smell subsequently filled his nose."
      },
      {
        "paragraph": "Thomas was so terrified that he had wet his pants."
      },
      {
        "paragraph": "“You’re nothing but trash.” Eliza smiled grimly."
      },
      {
        "paragraph": "“Yeah. I’m trash. I beg you.” Thomas burst into tears."
      },
      {
        "paragraph": "“It’s no use.” Eliza raised the dagger."
      },
      {
        "paragraph": "Frustrated, Thomas began to hurl insults. “Sarah Neeson, you’re such a b*tch. I’ve helped you so much\nthese years. You’ll be cursed with a horrible death. Even after I die, I won’t let you off the hook Before he\ncould finish his sentence, the dagger stabbed into his chest."
      },
      {
        "paragraph": "Upon sensing a slight pain, Thomas fainted in fear."
      },
      {
        "paragraph": "Eliza took the dagger out. The dagger was unique in that it shrank when it entered his body."
      },
      {
        "paragraph": "She simply did that to frighten Thomas, but it turned out that he was as easily frightened as she had\nexpected."
      },
      {
        "paragraph": "She really resented Thomas so much that she even felt like killing him."
      },
      {
        "paragraph": "If it had not been for him, her parents would not have died."
      },
      {
        "paragraph": "At this thought, a strong sense of bitterness shot out of Eliza’s eyes. “Thomas Neeson, Sarah Neeson,"
      },
      {
        "paragraph": "I’ll make you guys suffer a living hell one day.”"
      },
      {
        "paragraph": "“Miss Robbins…”"
      },
      {
        "paragraph": "The tanned man walked in."
      },
      {
        "paragraph": "“Take him out and find a secluded spot. When he’s almost awake, pretend to bury him so that he has the\nchance to escape,” Eliza instructed indifferently."
      },
      {
        "paragraph": "“We put so much effort in capturing him. Why let him escape…”"
      },
      {
        "paragraph": "“I’m just helping a friend out.” Eliza’s gaze gradually turned gentle."
      },
      {
        "paragraph": "“That’s rare. You actually have friends, Miss Robbins, ” the man said in astonishment."
      },
      {
        "paragraph": "“Yeah. I had some a long time ago, but we don’t keep in touch anymore.” Eliza lowered her voice. She\nwould never forget the kindness she received when she felt the most hopeless."
      }
    ]
  },
  {
    "title": "Chapter 1317 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Eliza also hated Shaun, but her friend had just gotten back together with him recently. In this case, she\ndid not mind lending her friend a hand."
      },
      {
        "paragraph": "“After Thomas makes his escape, we can’t use this place anymore. You need to find another location\nsoon, ” Eliza ordered."
      },
      {
        "paragraph": "“Alright.”"
      },
      {
        "paragraph": "After Eliza left, the man took Thomas to the mountain behind."
      },
      {
        "paragraph": "Only until Thomas was almost awake did the man pretend to use a shovel to dig a hole seriously."
      },
      {
        "paragraph": "At the sight of the scene, it finally dawned on Thomas that the man wanted to bury him alive."
      },
      {
        "paragraph": "The man thought he was dead, but he was still alive."
      },
      {
        "paragraph": "While enduring the pain in his chest, Thomas ran away stealthily."
      },
      {
        "paragraph": "“Eh? Where are you? Stop there.” By the time the man realized it, Thomas had run a considerable\ndistance, and the former started going after him right away."
      },
      {
        "paragraph": "Thomas ran like the wind to the village at the foot o f the mountain while screaming ‘help’."
      },
      {
        "paragraph": "With that, the man stopped going after him and ran off in the opposite direction instead."
      },
      {
        "paragraph": "After Thomas arrived at the village, he promptly borrowed a cell phone. Initially, he wanted to call the\nambulance. He wanted to call the ambulance at first, but on second thought, he called the police, lest\nSarah discover that he had made his escape."
      },

      {
        "paragraph": "Once the police took him to the police station, he quickly reported the case. The police went to the\nlocation that he mentioned but could not identify anyone suspicious."
      },
      {
        "paragraph": "“It’s Sarah who got people to kidnap me.” Thomas hurriedly said, “She wants to kill me. Hurry up and\narrest her.”"
      },
      {
        "paragraph": "The police frowned. Seeing that he looked crazy, a police officer could not help but ask, “You claim that\nshe wants to kill you, but do you have any evidence?”"
      },
      {
        "paragraph": "“Yeah. The kidnapper has tacitly admitted it, ” Thomas swiftly replied."
      },
      {
        "paragraph": "“But we didn’t even catch sight of the person who kidnapped you.” The police officer asked, “Besides,\nhave you seen the kidnapper in person?”"
      },
      {
        "paragraph": "“No, but I’m sure it’s her.” Trembling, Thomas continued, “Quickly arrest her. Otherwise, she’s going to\nkill me.”"
      },
      {
        "paragraph": "“Mr. Neeson, firstly, you haven’t seen the kidnapper in person, and second, we didn’t come across her.\nYou don’t have any evidence supporting your claim at all.” The police officer made it abundantly clear to\nhim and said, “Well, we’ll get more people to hunt the criminal down. You may go to the hospital or inform\nyour family first.”"
      },
      {
        "paragraph": "“I… I don’t have a family.” At this moment, Thomas was too scared to contact Sarah."
      },
      {
        "paragraph": "To him, Sarah was someone who wanted to take his life."
      },
      {
        "paragraph": "She was so cruel that she even wanted to kill her biological brother. At this thought, hatred overwhelmed\nhim."
      },
      {
        "paragraph": "‘Sarah, since you’re making my life difficult, I’m going to do the same to you.”"
      },
      {
        "paragraph": "After he was sent to the hospital, he immediately called Shaun."
      },
      {
        "paragraph": "“Young Master Hill, I’m Thomas Neeson,” he instantly screamed."
      },
      {
        "paragraph": "As soon as Shaun heard Thomas’s voice, his tone turned cold. “How dare you call me?”"
      },
      {
        "paragraph": "“Young Master Hill, save me. Sarah wants to kill me, ” Thomas said imploringly."
      },
      {
        "paragraph": "Shaun was momentarily stunned. Sarah wanted to kill Thomas?"
      },
      {
        "paragraph": "“Why should I save you?” Shaun was baffled."
      },
      {
        "paragraph": "“ I know the second trial of your case with Sarah is about to begin. I can help you win it.” Thomas said in\nagitation, “ I know many evil deeds that she has done secretly.”"
      },
      {
        "paragraph": "Shaun raised his brow. “Tell me.”"
      },
      {
        "paragraph": "“Once, she drugged your drink, and I was the one who got her the drug.” When Thomas was done\nspeaking, he shuddered and immediately added, “It was Sarah who instructed me to do it. She said you\ndidn’t want to touch her, but she wanted to be pregnant with your child. Who would have known that you\nwent to look for Catherine instead?”"
      }
    ]
  },
  {
    "title": "Chapter 1318 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Apparently, you know quite a lot of things.” Shaun’s tone was grim."
      },
      {
        "paragraph": "Upon hearing it, Thomas’s heart raced in fear. “I can be your witness, but you need to promise me one\nthing, that is to ask Chester to protect me. I don’t want to be kidnapped anymore.”"
      },
      {
        "paragraph": "Although Shaun was a shadow of his former self, he was Chester’s good friend. In this regard, Thomas\nbelieved that Chester would still be able to protect him."
      },
      {
        "paragraph": "“Kidnap?” Shaun was startled."
      },
      {
        "paragraph": "“Yes. Sarah, that b*tch, probably thinks that I always give her trouble and disrupt her plans, so she wants\nto kill me.” Thomas said in agony, “I’ve been locked in a dark cellar for the past one month. Every day\nwas like a living hell for me. There was a masked woman who occasionally came and tortured me. She\neven planned on killing me in the end, but I escaped. I’m still wounded.”"
      },
      {
        "paragraph": "“Alright. I’ll get someone to protect you. Keep a low"
      },
      {
        "paragraph": "profile and don’t let Sarah find out,” Shaun immediately said."
      },
      {
        "paragraph": "“Okay, okay. Young Master Hill, I’m counting on you to protect my life.” Thomas could not be bothered\nabout other things at this point."
      },
      {
        "paragraph": "On the other end."
      },
      {
        "paragraph": "Shaun put down his phone."
      },
      {
        "paragraph": "In the private room, Catherine was flipping the oily barbecued meat. The aroma of both the cumin and\nthe meat subsequently permeated the room. “ Thomas called you and told you that Sarah wants to kill\nhim, huh?”"
      },

      {
        "paragraph": "“Mm.” Shaun could not make heads or tails of Thomas either. “From his tone, he seemed to have gotten\nthe fright of his life.”"
      },
      {
        "paragraph": "“Now that he has come to you to ask for help, he must be tortured both mentally and physically. ”\nCatherine could not resist tutting. “Having said that, it’s a bit strange. Would a cruel person like Sarah\nallow him to escape?”"
      },
      {
        "paragraph": "“That’s what I’m thinking too.” Shaun pondered. “ I suspect someone purposely kidnapped Thomas and\nframed Sarah with the sole intention of making"
      },
      {
        "paragraph": "these siblings hate each other.”"
      },
      {
        "paragraph": "“Perhaps.” Catherine shrugged. “Wicked people like them would surely have offended other people apart\nfrom us. You’re really lucky this time, Attorney Hill. It seems like you’ll win the case.”"
      },
      {
        "paragraph": "“Please. I can win it even without Thomas. I just need to use some tactics.”"
      },
      {
        "paragraph": "Shaun took a piece of meat and some salad for her. “ Cathy, believe me. My reputation as the most\nbrilliant attorney in Australia is well earned.”"
      },
      {
        "paragraph": "“Sure, sure. You once lost to the attorney whom I hired with two thousand dollars, ” Catherine mocked\nhim."
      },
      {
        "paragraph": "“That time… It wasn’t because I couldn’t beat him. I knew that I misunderstood you, so I didn’t want to\nproceed with the lawsuit, ” Shaun explained with a tinge of guilt."
      },
      {
        "paragraph": "At the mention of that issue, Catherine went silent."
      },
      {
        "paragraph": "Although it was over, she could not get over the fact that Logan had lost his finger."
      },
      {
        "paragraph": "Silence instantly befell the private room. Shaun tightened his grip on the fork. “Cathy, I’d like to make it\nup to Logan. See what he needs— ”"
      },
      {
        "paragraph": "“He’s a man who’s easily satisfied. He’s quite content with his present condition, and there’s nothing else\nhe needs. ” Catherine interrupted him and changed the topic. “Let’s eat.”"
      },
      {
        "paragraph": "Nevertheless, the situation was rather awkward after that. No matter what Shaun said, Catherine was not\nreally in the mood to interact with him."
      },
      {
        "paragraph": "As Logan’s boss, she had failed to protect his subordinate, who had been protecting her wholeheartedly.\nShe even got together with the person who chopped off his finger. As such, Catherine was quite annoyed\nwith herself."
      },
      {
        "paragraph": "Shaun stared at her silently and gradually spoke less."
      },
      {
        "paragraph": "Despite the fact that he had gotten back together with Catherine, he knew that certain wounds were\nimpossible to heal."
      }
    ]
  },
  {
    "title": "Chapter 1319 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "When Shaun chopped off Logan’s finger, Catherine told him that it would be impossible for his finger to\ngrow again. Even so, Shaun chopped it off regardless."
      },
      {
        "paragraph": "He may have been taken advantage of by Sarah, but whenever he reflected on it, he felt that he was still\nundeniably responsible."
      },
      {
        "paragraph": "The Hill family’s villa."
      },
      {
        "paragraph": "Shaun was still not asleep in the dead of night."
      },
      {
        "paragraph": "He stood at the window for a very long time. At last, he took a knife and chopped one of his fingers off\nviolently."
      },
      {
        "paragraph": "As soon as Chester received an emergency call in the middle of the night, he rushed to the hospital."
      },
      {
        "paragraph": "After the doctor bandaged Shaun’s wound, Chester looked at his hand from which a finger was missing.\nA grim look flashed in his eyes. “ Shaun, you’re f*cking crazy.”"
      },
      {
        "paragraph": "“It’s just a finger, not a hand. ” Shaun bit his pale, thin lips. “This is much better. I don’t owe anyone now,\nand there won’t be a distance between her and me anymore.”"
      },
      {
        "paragraph": "“What a madman.” Chester insulted, “That’s why I f*cking hate relationships. After you and Rodney\nrespectively got into a relationship, both of you seemed to have gone insane. He’s still lying on the\nhospital bed, whereas you…”"
      },
      {
        "paragraph": "“Chester, you won’t understand it. Sometimes, relationships can be painful yet sweet. The feeling is even\nsweeter than after you perform an operation and earn hundreds of billions of dollars.”"
      },

      {
        "paragraph": "Shaun gave a weak smile. “I think it’s worth exchanging a finger for a complete relationship. What’s\nmore, I dislike owing people. I said that I’d make it up to him, and I’ve always been a man of m y word.”"
      },
      {
        "paragraph": "Chester was at a loss for words at that moment. He sat by Shaun’s bed and suddenly zoned out. “"
      },
      {
        "paragraph": "Shaun, do you believe that dead people will appear in one’s dream and deliver a message?”"
      },
      {
        "paragraph": "Shaun was momentarily stunned. “ I’m not sure."
      },
      {
        "paragraph": "What gives?”"
      },
      {
        "paragraph": "Chester then told him briefly about what happened when he met Eliza today. “If this isn’t true, how would\nEliza have known that Jennifer’s ashes were not a human’s? She even relocated Boris’s ashes. ”"
      },
      {
        "paragraph": "Shaun was dumbfounded. After a while, he replied, “ There are all kinds of occurrences in this world."
      },
      {
        "paragraph": "However, if Charity is dead, what Eliza said could be true. Cases of dead people appearing in one’s\ndream and delivering their message do exist.”"
      },
      {
        "paragraph": "“Do you also think that… she’s dead?” Chester was dazed. The scene of Charity’s bashful expression\nunder his body back then ran through his mind in spite of himself."
      },
      {
        "paragraph": "He had no idea why he remembered it so vividly. Perhaps it was because it was his first time."
      },
      {
        "paragraph": "He did not tell anyone about it, not even Charity, Shaun, and Rodney."
      },
      {
        "paragraph": "“Could she have survived?” Shaun looked at him in bafflement. “Why did you mention her out of the\nblue? Could it be…”"
      },
      {
        "paragraph": "“Perhaps… I feel that her passing has to do with me.” Chester’s face darkened. “After Sarah’s true colors\nhave been exposed, I’m more convinced by Catherine’s statement that Charity didn’t kill Shelley, yet I"
      },
      {
        "paragraph": "hired a lawyer to send her to jail."
      },
      {
        "paragraph": "Because of Charity’s predicament, the Neeson family ended up in a mess.”"
      },
      {
        "paragraph": "“ In that case, I’m also responsible for it.” Shaun felt upset."
      },
      {
        "paragraph": "“It’s fine. Don’t overthink it. ” Chester rose to his feet. “Let me ask Catherine to come over.”"
      },
      {
        "paragraph": "“No need. It’s so late. I don’t want to disrupt her sleep.” Shaun rejected his suggestion."
      },
      {
        "paragraph": "Chester was speechless. Chopping his finger was such a big deal, yet he was afraid of disrupting her\nsleep. Come on."
      },
      {
        "paragraph": "11:00 a.m. After Shaun left the hospital, he contacted Logan, and when Logan came over, he tossed his\nfinger to the latter at once."
      }
    ]
  },
  {
    "title": "Chapter 1320 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Logan, who was having a churro, almost threw up."
      },
      {
        "paragraph": "His eyes swiftly swept over Shaun’s bandaged hand. Then, he widened his eyes in shock. “Young\nMaster Hill, this is…”"
      },
      {
        "paragraph": "“This is my compensation to you. I told you before this, didn’t I?” Shaun said indifferently. His light-\nhearted manner made it seem as if he was merely compensating Logan with money."
      },
      {
        "paragraph": "Logan was dumbfounded. After coming to his senses, he gazed at Shaun in admiration."
      },
      {
        "paragraph": "He thought that Shaun was all talk at first because he was still as arrogant as ever even though the Hill\nfamily had collapsed. How could he possibly bear to chop off his finger to make it up to someone else’s\nsubordinate?"
      },
      {
        "paragraph": "However, Shaun did it."
      },
      {
        "paragraph": "“Young Master Hill, I know the true reason why you did it. Anyway, it’s really admirable, and I hardly ever\nadmire people. You’re the first, ” Logan said sincerely."
      },
      {
        "paragraph": "“I don’t want to owe anyone, especially you. Although you’re just in charge of protecting Cathy, I know\nyou’re the one who kept her and the kids safe and sound all those years abroad.” Shaun lightly rubbed\nthe wound on his hand, and it hurt. However, he felt less guilty now when facing Logan."
      },
      {
        "paragraph": "Logan raised his brows. “It’s fine as long as you don’t repeat your old mistakes. I, too, hope that she’ll be\nhappy from now on. After all… I feel that her life has left her exhausted.”"
      },
      {
        "paragraph": "As soon as Logan finished speaking, he tossed the finger back to Shaun. “You can keep it to yourself. I\ndon’t have the peculiar hobby of keeping other people’s fingers.”"
      },

      {
        "paragraph": "After that, Logan headed straight to Hudson Corporation to look for Catherine."
      },
      {
        "paragraph": "Catherine walked out from a meeting with a few executives, only to see Logan leaning against the wall\nwith both his hands in the pockets of his pants. His cool expression made the female employees who\nwalked past him turn around to do a double – take at him."
      },
      {
        "paragraph": "“Tsk. You and Austin are so handsome, yet you guys are gay.” Catherine felt sorry for the woman every\ntime Catherine saw him. “No wonder the netizens say that it’s not easy for a woman to get a man. Not\nonly do women have female rivals but also male rivals.”"
      },
      {
        "paragraph": "“ If you feel sorry for those women, you can share Shaun with them to settle their trouble.” Logan bit his\nlip playfully."
      },
      {
        "paragraph": "Catherine rolled her eyes. “I’m ready to do so, but I don’t think it’s fine by him.”"
      },
      {
        "paragraph": "Logan sized her up intently a few seconds before he suddenly asked, “Don’t you know about it?”"
      },
      {
        "paragraph": "“Know about what?” Catherine was puzzled."
      },
      {
        "paragraph": "“He still hasn’t told you, huh?” It struck Logan that Catherine was unaware of it."
      },
      {
        "paragraph": "“What?” Catherine recalled her conversation with Logan, and her expression darkened. “Is Shaun\ncheating on me again?”"
      },
      {
        "paragraph": "“What do you mean by again? He was previously hypnotized by Sarah, so technically, he didn’t cheat on\nyou.”"
      },
      {
        "paragraph": "It was rare for Logan to stand up for Shaun, so hearing him say that made Catherine wonder if pigs could\nfly. “You actually spoke up for Shaun. Don’t you hate him?”"
      },
      {
        "paragraph": "“I’m not a petty person anyway.” Logan looked into her eyes and said with mixed feelings, “What’s more,\nhe has made it up to me.”"
      },
      {
        "paragraph": "Catherine was increasingly bewildered."
      },
      {
        "paragraph": "Logan lifted his hand from which one finger was missing. “This morning, Shaun returned a finger to me,\nand it belonged to him.”"
      },
      {
        "paragraph": "Startled, Catherine’s head began to buzz. It took her a long while before she came back to her senses."
      },
      {
        "paragraph": "“He chopped off one of his fingers,” Logan added plainly. “What did you tell him yesterday? I was quite\nsurprised that he did this out of the blue.”"
      },
      {
        "paragraph": "“Yesterday?”"
      },
      {
        "paragraph": "Catherine recalled that Shaun suddenly mentioned Logan’s finger when they had a barbecue together.\nAfter that, her spirits sank, and she barely spoke to him."
      },
      {
        "paragraph": "There was a knot in her heart that was too painful to untie."
      },
      {
        "paragraph": "However, she did not expect Shaun to chop off his finger for real."
      },
      {
        "paragraph": "She thought that he was all talk. After all, it was a finger, not a strand of hair or a tree."
      }
    ]
  },
  {
    "title": "Chapter 1321 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Was Shaun dumb?"
      },
      {
        "paragraph": "Logan noticed that Catherine’s pretty, confused face gradually paled, and he could not help but let out a\nsigh."
      },
      {
        "paragraph": "“To be honest, when you got back together with Shaun, I wondered if there wasn’t a better man in this\nworld. I didn’t understand why you had to cling to him. But frankly speaking, he may have been tricked by\nSarah back then, but he does truly love you now. If it weren’t for you, how could he have brought himself\nto chop off his finger? He did that for the sole purpose of reducing the distance between you and him.”"
      },
      {
        "paragraph": "Catherine, of course, grasped his point."
      },
      {
        "paragraph": "She had verbally agreed to get back together with Shaun these few days."
      },
      {
        "paragraph": "In fact, she did it for the sake of the children. Moreover, he had been pestering her so much that she\ncould not do anything nor be bothered to oppose him."
      },
      {
        "paragraph": "However, she had not yet opened her heart to him."
      },
      {
        "paragraph": "Logan shrugged. “When you returned from overseas, you kept saying that you wanted to take revenge\non him before getting back together with him. However, I could see that you were swayed. It was\nbecause he chopped off my finger that you totally gave up on him."
      },
      {
        "paragraph": "“Actually, I’ve long since gotten over it. You’re the one who hasn’t, and it’s probably because you think\nthat you’ve dragged me down with you and failed to protect me. But I hope that the two of you can patch\nthings up this time.”"
      },
      {
        "paragraph": "After he was done speaking, he turned around and walked in the other direction."
      },

      {
        "paragraph": "A few steps later, he turned around again and added, “I just came from his place, and he didn’t look so\ngood.”"
      },
      {
        "paragraph": "Catherine stood frozen for a while until Harvey came over and said, “chairwoman Jones, General\nManager Wolfe wants to ask you out for lunch and talk about business…”"
      },
      {
        "paragraph": "“ ‘I’m not available. I’m taking today off, and I won’t be back in the office.”"
      },
      {
        "paragraph": "Catherine then tossed the document to him and immediately left the office."
      },
      {
        "paragraph": "She drove directly to Hill Corporation."
      },
      {
        "paragraph": "Once she arrived, she took the elevator to the top floor and kicked the office door open."
      },
      {
        "paragraph": "There were five to six executives inside, and all of them cast bizarre gazes on her."
      },
      {
        "paragraph": "“Cathy, what brings you here?” Shaun instantly stood up. There was a look of surprise on his slightly pale\nface."
      },
      {
        "paragraph": "“President Hill, we’ll leave now. ” The executives excused themselves knowingly."
      },
      {
        "paragraph": "When the executives left, they were still gossiping in whispers."
      },
      {
        "paragraph": "“It seems like Young Master Hill has gotten back together with his ex-wife.”"
      },
      {
        "paragraph": "“Duh. Rumors were flying about it earlier. How could it be fake?”"
      },
      {
        "paragraph": "“Hey, I have never seen Catherine come to look for Young Master Hill before, but now, I’m convinced. ”"
      },
      {
        "paragraph": "“Do you guys think I’m deaf? Hurry up and get"
      },
      {
        "paragraph": "out. ” Shaun glowered at the bunch of executives impatiently before he slammed the door shut."
      },
      {
        "paragraph": "Then, he asked delightedly in a gentle tone, “Cathy, has Logan told you something?”"
      },
      {
        "paragraph": "“Which hand did you chop off your finger from? Show it to me.” Catherine ordered glumly."
      },
      {
        "paragraph": "“There’s nothing much to see. It’s grotesque, and it might give you a fright.” Shaun retreated awkwardly."
      },
      {
        "paragraph": "He had never experienced such poor self-esteem until he looked at her foxy face at this moment."
      },
      {
        "paragraph": "“Shaun.” Catherine lifted her reddened eyes and stared at him. “Why didn’t you think that it would\nfrighten me when you chopped off your finger?”"
      },
      {
        "paragraph": "Shaun’s exquisite, thin lips quivered. At last, he stretched out his hand obediently."
      },
      {
        "paragraph": "Among the positions of his five fingers, there was one empty spot wrapped with a thick layer of bandage."
      }
    ]
  },
  {
    "title": "Chapter 1322 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine felt like her eyes were being pricked by something."
      },
      {
        "paragraph": "She tried to hold it in, but her eyes still reddened."
      },
      {
        "paragraph": "“ Shaun, is there something wrong with you?” She lost control and scolded him."
      },
      {
        "paragraph": "Shaun gazed at her reddened eyes, and suddenly, he did not feel so self-conscious or nervous anymore.\nOn the contrary, his lips lifted in a sweet smile. “ You’re concerned about me.”"
      },
      {
        "paragraph": "Catherine was too pissed off by Shaun to say anything."
      },
      {
        "paragraph": "He was in this state, yet he still said he was concerned about him. Was that the point?"
      },
      {
        "paragraph": "“Cathy, I’m really happy. It seems like chopping m y finger off was worth it.” Shaun said tenderly, “If I\nknew earlier, I wouldn’t have delayed it until today. I would’ve chopped it long ago.”"
      },
      {
        "paragraph": "“Shaun, actually, I…” Catherine felt a lump in her throat."
      },
      {
        "paragraph": "“Cathy, don’t say anything. Listen to me.”"
      },
      {
        "paragraph": "Shaun used his other perfectly fine hand to cover her mouth. “You told me before that you treat Logan as\nyour family and that if I chopped his fingers off, it’d be impossible for us to be together. However, I went\ncrazy and still did it anyway. In fact, I had another reason. I was jealous of Logan. I was very\nuncomfortable seeing you care so much about another man. But it’s been proven that I was wrong.”"
      },
      {
        "paragraph": "“Although you’ve agreed to make up with me, I understand you did that for the children. You barely take\nthe initiative to call, message, or meet me."
      },

      {
        "paragraph": "There are hurdles between us. Sarah is the first hurdle, while Logan is the second. I may not be able to\ncompensate you for the first hurdle, so I must compensate you for the second. If not, even if we get back\ntogether, we can never return to the relationship we had in the past.”"
      },
      {
        "paragraph": "After he spoke, he hugged Catherine tightly."
      },
      {
        "paragraph": "“Cathy, my memories of the past are jumbled up, and I can’t remember them anymore. However, after\nyou came back to Australia, we were in a relationship for a short period. Although it was very short, it\nwas unforgettable to me. I clearly knew you"
      },
      {
        "paragraph": "approached me on purpose to get revenge on me, but I was still very happy. I was the stupid one for not\nknowing how to cherish you properly. Can you give me another chance again?”"
      },
      {
        "paragraph": "He lowered his head and looked at her with a deep gaze full of anticipation."
      },
      {
        "paragraph": "Catherine did not say anything. Instead, she lowered her head, held his injured hand, and interlocked\ntheir fingers. They could do that in the past, but now, one of his hands would never be able to interlock\nwith hers again."
      },
      {
        "paragraph": "Her tears fell uncontrollably."
      },
      {
        "paragraph": "She did not know why she was crying. She just could not help but think about how they always\ninterlocked their fingers when they loved each other deeply back then."
      },
      {
        "paragraph": "“Cathy, never in my life did I think I would see you shed tears for me.”"
      },
      {
        "paragraph": "Shaun lowered his head and used his thin lips to kiss the tears on her face away. “Aren’t tears salty?\nWhy are yours so sweet?”"
      },
      {
        "paragraph": "Haha."
      },
      {
        "paragraph": "Catherine wanted to cry, but after hearing his words, she could not resist bursting into laughter."
      },
      {
        "paragraph": "She raised her hand instinctively and hit him lightly. Shaun hissed in pain."
      },
      {
        "paragraph": "Catherine said nervously, “Don’t pretend. I was hitting your chest, not your wound.”"
      },
      {
        "paragraph": "“The body vibrates, and the wound will hurt too. ” Shaun smiled bitterly."
      },
      {
        "paragraph": "Catherine frowned in silence. Just as Shaun thought he would receive her warm care next, she suddenly\nsaid, “You’re really weak. Logan sustained such severe injuries back then and even lost his finger, yet he\ndidn’t even complain when I sent him to the hospital.”"
      },
      {
        "paragraph": "Shaun was discontent from being looked down on by the woman he loved. “I was joking. I’m not in pain.\nIf you don’t believe me, you can press hard on my wound and see.”"
      },
      {
        "paragraph": "He then lifted his hand and tensed his handsome face as if he had nothing to lose."
      },
      {
        "paragraph": "Catherine suddenly realized that he looked pretty childish that way. He was so childish that he looked a\nlittle cute, especially when that handsome face was very pale. That look could make any woman’s heart\nache."
      }
    ]
  },

  {
    "title": "Chapter 1323 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Really? Let me try then.” When Catherine extended her hand and acted like she was about to press\ndown, she noticed Shaun closing his eyes quickly, and his eyelashes were trembling. Even his temples\nwere tense."
      },
      {
        "paragraph": "The corners of Catherine’s lips curved up slightly. In the end, she put her hands down, tiptoed, and\nkissed him."
      },
      {
        "paragraph": "Shaun was so stunned that he opened his eyes. The intense pain never came. Instead, what came was\na woman’s jelly-like juicy lips."
      },
      {
        "paragraph": "“Open your mouth. ” The woman’s soft, seductive voice could be heard vaguely."
      },
      {
        "paragraph": "Shaun felt as if his heart was about to melt. Was it not usually the men who talked dirty?"
      },
      {
        "paragraph": "However… Ahem, it sounded even sexier coming from Catherine."
      },
      {
        "paragraph": "Shaun was greatly stimulated. He hugged her tight and deepened the kiss fiercely."
      },
      {
        "paragraph": "He had kissed Catherine before this, but he was not a fool. He could sense that this kiss was not quite\nthe same as the ones in the past. At least, she was reacting passionately, so much that it made Shaun’s\nblood begin to heat up."
      },
      {
        "paragraph": "Just as he wanted to progress further, Catherine grabbed his hand."
      },
      {
        "paragraph": "“Cathy…” Shaun’s sexy throat made a coaxing voice."
      },
      {
        "paragraph": "“Shaunny, don’t get too excited. Didn’t you say that it hurts when your body vibrates? Look at how much\nyou’re trembling now. You’ re like a sieve. ” Catherine blinked innocently and reminded him teasingly."
      },

      {
        "paragraph": "Shaun was upset. If only he knew, he would not have said those words. “If you kiss me, it won’t hurt.”"
      },
      {
        "paragraph": "“Cut it out.” Catherine rolled her pretty eyes."
      },
      {
        "paragraph": "However, that flirtatious look made Shaun feel even more impatient. “Cathy, it sounds really nice when\nyou call me that way. Did you call me like that in the past too? It sounds a bit familiar.”"
      },
      {
        "paragraph": "“Mmhm.”"
      },
      {
        "paragraph": "Catherine lowered her eyes. She did not want him to feel any familiarity."
      },
      {
        "paragraph": "She was afraid that his memories would gradually recover if he felt a sense of familiarity, and by then, he\nmight become a retard."
      },
      {
        "paragraph": "“Did you take an anti-inflammatory injection for your wound already?” Catherine asked."
      },
      {
        "paragraph": "“ I had an IV drip during dawn. But I have to be on the IV drip for at least three days in the hospital, ”\nShaun answered honestly."
      },
      {
        "paragraph": "“Will it be inconvenient when you work or type?” Catherine asked. Shaun was different from Logan.\nLogan did not need to use the computer much, whereas, as Hill Corporation’s president, Shaun had to\nuse the mouse or type often."
      },
      {
        "paragraph": "“I’ll slowly get used to it.” Shaun said with a smile, “Compared to you, all these are nothing at all. It’s okay\neven if I lose a hand.”"
      },
      {
        "paragraph": "“That won’t do.” Catherine cut him off with a straight face. “I’d despise you if you lost a hand.”"
      },
      {
        "paragraph": "Shaun was saying touching and romantic words. There was no need for her to throw a wet blanket on\nhim so heartlessly."
      },
      {
        "paragraph": "“I’m a sucker for good looks,” Catherine added another cruel sentence."
      },
      {
        "paragraph": "Shaun almost wanted to rush in front of the mirror in the bathroom and take a good look at whether he\nhad anything like wrinkles on his face."
      },
      {
        "paragraph": "“Um… Cathy, do you think my face needs some taking care of? Like putting a sheet mask on or\nsomething?” Shaun said sheepishly, “You can recommend some products to me.”"
      },
      {
        "paragraph": "Catherine burst into laughter at his nervous expression. “It’s fine. You still look quite young, but you\nshouldn’t stay up too late anymore. You have dark circles.”"
      },
      {
        "paragraph": "“Mmhm, okay. I’ll definitely go to bed early from now on so that you won’t abandon me.” Shaun was\nscared. After all, he was many years older than her."
      }
    ]
  },
  {
    "title": "Chapter 1324 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine found it hilarious. It was just a casual remark."
      },
      {
        "paragraph": "She may be a sucker for good looks, but if she loved someone, she would always love him even if he\nbecame old and ugly."
      },
      {
        "paragraph": "“Cathy, it’s noon already. Do you want to have lunch together?” Shaun asked in an attempt to please."
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "“What do you want to eat? There are quite a few restaurants near our company—”"
      },
      {
        "paragraph": "“Let’s go back and eat.” Catherine interrupted him. “Your current state isn’t suitable for working, so you\nshould go back home and recuperate.”"
      },
      {
        "paragraph": "“But I don’t want to go back to the Hill family’s residence to recuperate. I want to stay with you. ” Shaun\ngazed at her affectionately."
      },
      {
        "paragraph": "“I’m currently living with my dad. If I bring you back to the Yule family, I’ll get a good scolding from him.”\nAfter that, Catherine remained silent"
      },
      {
        "paragraph": "for a moment. Then, she said, “Let’s go to Palm Springs. Don’t you have a suite there? You can rest\nthere during the day and go back to accompany the children at night.”"
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "Shaun would do that with pleasure. As long as Catherine was willing to accompany him, he could even\nrest for a month."
      },

      {
        "paragraph": "On the way there, Catherine drove while Shaun sat in the passenger seat. He felt as happy as a kid. “\nCathy, there’s nothing at all at my place in Palm Springs. Let’s buy some food.”"
      },
      {
        "paragraph": "“We’ll go to the supermarket later.” Catherine agreed as well."
      },
      {
        "paragraph": "When they were shopping at the supermarket, Catherine went to the meat section and bought three big\npieces of pork ribs. Shaun was over the moon. “Cathy, you remember that I like your pork ribs the most.”"
      },
      {
        "paragraph": "“That’s right, and Suzie took after you. She likes those pork ribs too.”"
      },
      {
        "paragraph": "At the thought of her daughter, Catherine could not help but go soft-hearted. “Why don’t we go to the Hill\nfamily’s residence? Then, the children can eat it too.”"
      },
      {
        "paragraph": "“Not today. I want to have some time to ourselves,” Shaun said while holding her hand."
      },
      {
        "paragraph": "“Haven’t we gotten a lot of time to ourselves? You said you wanted time to ourselves yesterday as well,\nand I even agreed to have a barbecue with you.” Catherine felt increasingly sorry toward the children the\nmore she thought about it. As parents, they had not been accompanying them at all."
      },
      {
        "paragraph": "“Cathy, you ignored me halfway through the barbeque,” Shaun explained ruefully. “ It made me so\ndepressed that I immediately chopped my finger when I got home.”"
      },
      {
        "paragraph": "Catherine was utterly speechless. “Okay, okay. I’ll spend some time with you alone again.”"
      },
      {
        "paragraph": "“Mmm.” Shaun nodded and pushed the shopping cart obediently. One moment, he said he wanted\ngrapes and lychees. Then, the next, he said he wanted yogurt. However, all those were actually\nCatherine’s favorite food."
      },
      {
        "paragraph": "Catherine did say anything as well and left it all up t o him."
      },
      {
        "paragraph": "Once they had paid and walked out, they noticed that they had been followed by some people."
      },
      {
        "paragraph": "“Those reporters are so relentless.” Shaun frowned in contempt."
      },
      {
        "paragraph": "“Let them follow us all they want. Almost everyone knows that I’ve gotten back together with you without\ngetting a divorce yet anyway. I don’t mind anymore, ” Catherine said indifferently."
      },
      {
        "paragraph": "“Mm.” Shaun nodded his head profoundly."
      },
      {
        "paragraph": "At Palm Springs, Catherine put on an apron and was about to start cooking. However, Shaun felt\nespecially bad. “Cathy, why don’t I do the cooking? Although your cooking is delicious, women have to\nbe pampered. I don’t feel good letting you cook for me.”"
      },
      {
        "paragraph": "“Forget it. You’re injured now, and besides, I won’t cook too much. I’ll just cook two dishes.” Catherine\nthen chased him out."
      },
      {
        "paragraph": "Her cooking was speedy. In less than half an hour, she had made two dishes and a soup."
      },
      {
        "paragraph": "Shaun had not tasted her cooking in a very long time, so he thought it was particularly delicious. In the\nend, he even finished the soup dregs. After he was done eating, he lamented, “ I was definitely an idiot in\nthe past.”"
      }
    ]
  },
  {
    "title": "Chapter 1325 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“As long as you know it.” Catherine agreed with a smile."
      },
      {
        "paragraph": "Shaun choked. He continued saying, “I clearly already had you, a pretty wife who could earn money and\nhad good cooking skills. Why did I still get involved with Sarah? How could she compare to you? She’s\nnot as pretty or capable as you, and her cooking skills are terrible too. I must’ve been out of my mind.”"
      },
      {
        "paragraph": "Catherine raised her pretty eyebrows but did not say a word. She just watched as he flattered her."
      },
      {
        "paragraph": "“Cathy,” Shaun put his hand around her waist. “ Why are you so perfect?”"
      },
      {
        "paragraph": "“ I’ll have to ask my mom about this. She was the one who gave birth to such an excellent me.”\nCatherine accepted his flattery as a matter of course."
      },
      {
        "paragraph": "Shaun laughed before he lowered his head and kissed her lips without saying anything."
      },
      {
        "paragraph": "“Don’t mess around. I have to wash the dishes. ” Catherine pushed him away."
      },
      {
        "paragraph": "“Don’t wash them. I’ll do it,” Shaun said."
      },
      {
        "paragraph": "“Your hand is injured. How will you wash the dishes?”"
      },
      {
        "paragraph": "“Didn’t I buy a pair of gloves when we were at the supermarket? I was planning to use it to wash the\ndishes.” Shaun took the pair of gloves out. “Water won’t seep in.”"
      },
      {
        "paragraph": "Catherine was taken aback. She thought it was just o n a whim when he said he would wash the dishes."
      },
      {
        "paragraph": "“No need. You can wash them when you get better.” Catherine took the gloves away."
      },
      {
        "paragraph": "“Cathy, I can’t bear to let you wash the dishes.” Shaun frowned. “ I didn’t know better in the past. From\nnow on, I want to treasure you properly."
      },

      {
        "paragraph": "Although the food you make is delicious, I can be less picky and eat the food made by other people. ”"
      },
      {
        "paragraph": "Catherine was astonished."
      },
      {
        "paragraph": "In the past, Shaun’s pickiness about food was well- known. Every time, he would find every way possible\nto make her enter the kitchen. Hence, it was not easy for him to come to that sort of realization. “Shaun, I\ndon’t hate cooking. On the contrary, I like cooking food. However, I get too tired from work sometimes,\nwhich is why I’m not"
      },
      {
        "paragraph": "willing to cook every single day. I’ll naturally cook when I feel like doing it. When I don’t want to cook, I\ncan choose not to do it. No one can force me.”"
      },
      {
        "paragraph": "“Okay.” Shaun understood."
      },
      {
        "paragraph": "“Go and have some rest. I’ll wash the dishes today.” Catherine walked into the kitchen again."
      },
      {
        "paragraph": "After she was done cleaning up, Shaun pulled her into his embrace again. “Cathy, take a nap with me. I\nbarely slept last night.”"
      },
      {
        "paragraph": "“Mm.”"
      },
      {
        "paragraph": "Catherine looked at the dark circles underneath his eyes and nodded."
      },
      {
        "paragraph": "Without another word, Shaun immediately bridal- carried her to the bedroom. Once they were on the\nbed, he rested her head on his arm."
      },
      {
        "paragraph": "He had imagined this day for a very long time. He even thought that this day would never come."
      },
      {
        "paragraph": "Luckily, the heavens were generous to him."
      },
      {
        "paragraph": "Taking in the fragrance from her body, Shaun could not fall asleep even though he was very sleepy. “\nCathy, if only I can sleep with you like this at night too.”"
      },
      {
        "paragraph": "“Don’t push your luck.” Catherine pinched his body nonchalantly."
      },
      {
        "paragraph": "“After the situation is no longer dangerous for Suzie and Lucas, the four of us will stay together, okay?”\nShaun exclaimed in pain but continued talking anyway."
      },
      {
        "paragraph": "“…Mm. Let’s sleep.” Catherine closed her eyes."
      },
      {
        "paragraph": "She had the same thought after they got back together too. She wanted to bring up the children by her\nside."
      },
      {
        "paragraph": "Shaun grinned. Looking at her peaceful sleeping face, he felt so content that he had not fallen asleep\neven after Catherine had."
      },
      {
        "paragraph": "He was suddenly moved. He took out his phone and interlocked his perfectly fine hand with Catherine’s.\nAfter that, he took a picture and then posted it on Facebook. [With your hand in mine, I’ll grow old with\nyou. We slipped by each other time and time again, and we had gone through many ups and downs. I\nnever want to let go of your hand anymore in my life. I love you very much!]"
      }
    ]
  },
  {
    "title": "Chapter 1326 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "The recent heated discussion about the matter between Shaun and Catherine was on par with top- tiered\ncelebrities."
      },
      {
        "paragraph": "Immediately after Shaun posted on Facebook, countless netizens came over and commented on his\npost."
      },
      {
        "paragraph": "[Wow, are they openly getting back together?]"
      },
      {
        "paragraph": "[A soul-stirring romance drama of 6o episodes has suddenly ended. I’m not quite used to it.]"
      },
      {
        "paragraph": "[It still hasn’t ended. Wesley and Catherine aren’t divorced yet. I heard that Wesley isn’t willing to get a\ndivorce. I reckon there’ll still be trouble afterward."
      },
      {
        "paragraph": "[Young Master Hill, cherish Catherine properly. Don’t ever be as fickle as you were before.]"
      },
      {
        "paragraph": "[Young Master Hill is impotent, yet Catherine is still willing to make up with him. This must be true love.]"
      },
      {
        "paragraph": "Shaun read the netizens’ comments with amusement. Suddenly, Rodney sent a message to the\nbrothers’ Whatsapp group. [Ew, Shaun. You’re so cheesy. I’m disgusted.]"
      },
      {
        "paragraph": "Shaun’s expression darkened as he replied: [What will a single and lonely person like you f*cking"
      },
      {
        "paragraph": "Rodney: [Why? Are you looking down on single people? Even if I’m single, at least I already have a\nbaby. Hmph.]"
      },
      {
        "paragraph": "Shaun: [You’re right. I reckon the kid will call you uncle whenever he or she meets you in the future.]"
      },
      {
        "paragraph": "Attacked by that statement, Rodney was speechless: […]"
      },

      {
        "paragraph": "Even Chase, who had not voiced out in the group chat for a long time, appeared. [This can’t be. Our Rin\nmust’ve gotten back together with you because she cannot stand your pestering. Shaun, if you dare bully\nher again, I’ll beat you up until you die even if we’re friends.]"
      },
      {
        "paragraph": "Shaun’s expression turned black. [Watch what you say. She’s mine now. She has nothing to do with you\nat all.]"
      },
      {
        "paragraph": "Chase: [She’s from Melbourne, and I’m the most"
      },
      {
        "paragraph": "powerful man in Melbourne, so I’m half the bride’s family. I believe Rin will agree with what I said too.]"
      },
      {
        "paragraph": "Chester: [Yo, it’s so lively in the group chat today. Even Chase is here. I thought you’d never show up\nagain.]"
      },
      {
        "paragraph": "Chase: [Of course. Chatting with three stupid people will affect my IQ.]"
      },
      {
        "paragraph": "Chester sneered. [Chase, are you asking for a beating?]"
      },
      {
        "paragraph": "Rodney: [You want to be ganged up on, right?]"
      },
      {
        "paragraph": "Chase: [Did I say anything wrong? You all were fooled by Sarah for the past three years and treated two\nb*tches like a babe. I’m afraid my intelligence will drop. ]"
      },
      {
        "paragraph": "Chester: [I’ve got an operation to perform.] The conversation could not go on."
      },
      {
        "paragraph": "Rodney: [My butt hurts. I’m going to recuperate.]"
      },
      {
        "paragraph": "Shaun: [I have to accompany Cathy to sleep. This is a delight you single people won’t understand.]"
      },
      {
        "paragraph": "Shaun put down his phone. He was glum. He did not expect there would come a day where the three of\nthem would be mocked by Chase. 1"
      },
      {
        "paragraph": "In order to ease his sadness, he turned his attention to Catherine."
      },
      {
        "paragraph": "However, after he had turned his attention to her, he could not keep himself in check."
      },
      {
        "paragraph": "Catherine was fast asleep until suddenly, she felt slightly out of breath. It was as if a puppy was rubbing\nagainst her."
      },
      {
        "paragraph": "She opened her eyes just in time to see Shaun’s thin, hot lips landing on hers. That passionate look\nmade her heat up uncontrollably as well."
      },
      {
        "paragraph": "“Shaun, didn’t you want to take a nap?” She gritted her teeth. She might have been in too much of a\ndeep sleep just now, so she could not muster any strength in her body."
      },
      {
        "paragraph": "“I wanted to, but I really wanted to kiss you when I looked at you. I won’t be able to handle it if I kiss you\nlonger. Cathy, let me kiss you properly. We’ve never kissed this way in a long time.”"
      },
      {
        "paragraph": "Shaun was like a fierce and spoiled little puppy. His voice was hoarse and captivating."
      },
      {
        "paragraph": "Catherine was dizzy from his coaxing. Moreover, she was too lazy to move, so she just let him have his\nway."
      }
    ]
  },
  {
    "title": "Chapter 1327 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine took a bath with a blushing face before coming out of the bathroom."
      },
      {
        "paragraph": "Shaun was lying on the bed, looking at her lazily and intimately. “Why are you taking a bath in the middle\nof the day?”"
      },
      {
        "paragraph": "Catherine shot him a sharp glance, and her face flushed red. “It was all your fault that I was sweaty.”"
      },
      {
        "paragraph": "“ Is that so? ” Shaun smiled vaguely. He suddenly jumped down from the bed and lifted her off her feet."
      },
      {
        "paragraph": "Startled, Catherine frantically wrapped her hands around his neck “Shaunny, what are you doing again?\nPut me down quickly.”"
      },
      {
        "paragraph": "Shaun lowered his head and kissed her hard. “ Cathy, although my illness hasn’t recovered yet, I’ll try my\nutmost best to give you pleasure. Tell me, how was your experience just now?”"
      },
      {
        "paragraph": "Catherine turned away as her blushing face turned a darker shade of red."
      },
      {
        "paragraph": "“If you say nothing, I’ll take it that you agree it was good.” An ambiguous smile flashed on Shaun’s s.exy\nface."
      },
      {
        "paragraph": "“Shaun, can you cut it out?” Catherine was enraged."
      },
      {
        "paragraph": "“No.” Shaun hugged her tightly and said with a muffled voice, “I’ve been thinking of being together with\nyou like this for the whole afternoon. I don’t want to go anywhere else.”"
      },
      {
        "paragraph": "Catherine leaned on his chest quietly. With so many things happening lately, leaning on him like that\nmade her feel like the unknown future was not that scary."
      },

      {
        "paragraph": "However, not long after, that sense of tranquility was interrupted by Freya’s call. “Catherine, be honest\nwith me. Are you doing some shady stuff with Shaun?”"
      },
      {
        "paragraph": "Although Catherine did not put the call on speaker, the room was quiet enough for Shaun to hear their\nconversation"
      },
      {
        "paragraph": "Catherine’s body stiffened. When she subconsciously suspected if Sarah had installed security cameras\nor sorts, Freya suddenly said, “If that’s not the case, why haven’t you replied to the messages I sent\nyou?”"
      },
      {
        "paragraph": "Catherine let out a sigh of relief and quickly opened her Whatsapp. Freya did send her messages before,\nbut Catherine was making out with Shaun at that time."
      },
      {
        "paragraph": "At that thought, her face flushed uncontrollably. “No, I was taking a nap.”"
      },
      {
        "paragraph": "Upon hearing that, Shaun glanced at her with a flirty smile."
      },
      {
        "paragraph": "Catherine rolled her eyes at him."
      },
      {
        "paragraph": "Freya hmphed. “You can’t possibly be taking a nap with Shaun, right?”"
      },
      {
        "paragraph": "“No, you’re overthinking…” Catherine denied it embarrassingly."
      },
      {
        "paragraph": "Freya said, “ It’s impossible. I called you because I saw Shaun’s Facebook post. Are you guys openly\ngetting back together?”"
      },
      {
        "paragraph": "Catherine was puzzled. “What Facebook post? I didn’t see it.”"
      },
      {
        "paragraph": "“You didn’t know? Ah, what Shaun posted on Facebook was too cheesy. Something about loving you\nvery much.” Freya chuckled and said, “ Congratulations, you’re stuck with that unworthy man again.”"
      },
      {
        "paragraph": "Shaun, the unworthy man, frowned in dissatisfaction. Just as he wanted to say something, Catherine\ncovered his mouth."
      },
      {
        "paragraph": "“Okay, I’ll have a look at it later…”"
      },
      {
        "paragraph": "“Speaking of it…” Freya suddenly lowered her voice when she pried, “You’re so soft-hearted. Since\nShaun is impotent, why did you get back together with him?”"
      },
      {
        "paragraph": "Catherine regretted a little for blocking Shaun’s mouth just now."
      },
      {
        "paragraph": "At that moment, Shaun was quiet too. He simply looked at Catherine in silence and waited for her to\nreply."
      },
      {
        "paragraph": "Catherine said stiffly, “I’m not a person who cares a lot about that kind of stuff.”"
      },
      {
        "paragraph": "“But he can’t be completely impotent, right? Why don’t… I give you some good stuff? Hehe. ” Freya\nchuckled ambiguously."
      },
      {
        "paragraph": "“I can’t be bothered with you.” Catherine could not listen anymore, so she hung up straight away."
      },
      {
        "paragraph": "After that, the atmosphere was still quiet and eerie. Shaun kept his eyelashes downcast and did not say\na word. He looked as if he received a heavy blow."
      }
    ]
  },
  {
    "title": "Chapter 1328 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine stroked her hair unnaturally. “Don’t take Freya’s words to heart. Actually… That, just now, was\nstill okay.”"
      },
      {
        "paragraph": "She really wanted to kill Freya at that moment. She did not know how many times in her entire life\nFreya’s words had put her in trouble."
      },
      {
        "paragraph": "“What was still okay?” Shaun raised his head. His eyes shone with a bright smile."
      },
      {
        "paragraph": "Only then did Catherine realize she was tricked. She glared at him, turned around, and got down from\nthe bed. “I’m not talking to you anymore.”"
      },
      {
        "paragraph": "“Don’t.” Shaun wrapped his hand around her waist in a hurry. He sounded slightly down. “Actually, what\nFreya said isn’t wrong. Cathy, if I can’t recover, will you leave me?”"
      },
      {
        "paragraph": "Catherine put on a straight face. “ Shaun, whether I’ll leave you or not has nothing to do with this matter.\nIf I really cared about it, I wouldn’t have made up with you from the start. None of us knows what will\nhappen in the future, just like in the past. Although you whispered countless sweet nothings,"
      },
      {
        "paragraph": "we still separated in the end. I’ve gone through too much, so I don’t believe in the future. I only care\nabout the present.”"
      },
      {
        "paragraph": "Having heard that, Shaun remained silent for a full half a minute. “I understand. To put it simply, I still\nhaven’t given you enough sense of security. It’s okay. I have a whole lifetime of chances to prove it.”"
      },
      {
        "paragraph": "After a moment of hesitation, he leaned into her ears and said, “But… I’ll still make myself recover a s\nsoon as possible. I feel like… This matter is rather important to you.”"
      },
      {
        "paragraph": "Catherine turned around with her face burning."
      },

      {
        "paragraph": "Sooner or later, she would be driven insane by that man."
      },
      {
        "paragraph": "“Cathy, Sarah’s and my lawsuit will reconvene tomorrow. Come and watch it this time, okay?” Shaun said\nwith a smile."
      },
      {
        "paragraph": "“I’m busy. I don’t have time.”"
      },
      {
        "paragraph": "“Just come. It’s my first lawsuit after we made up. Don’t you want to see Sarah’s exasperated look when\nshe loses the lawsuit? Moreover, I look the most handsome when I’m in court.” Shaun kept bugging and\ncoaxing her."
      },
      {
        "paragraph": "Catherine eventually agreed because of his pestering."
      },
      {
        "paragraph": "On the second day, when Freya heard Catherine saying that she was going to watch Shaun in court,\nFreya was unconvinced. “Didn’t Sarah have the advantage in the last hearing? Shaun may lose this time.\nAre you going so that you can be ready to console him anytime?”"
      },
      {
        "paragraph": "“No, he’ll definitely win this time.” Catherine was utterly speechless with Freya’s jinxes."
      },
      {
        "paragraph": "“Tsk tsk, you haven’t even remarried, yet you already trust him fully.”"
      },
      {
        "paragraph": "“No. There’s a reason for it, but I can’t tell you now.” Catherine did not dare to reveal too much."
      },
      {
        "paragraph": "“Really?” Freya got excited. “Then I want to go too. I want to go and see Sarah’s face collapse in despair\nwhen she loses 1oo billion dollars. Haha.”"
      },
      {
        "paragraph": "“Okay. You’re pregnant, so you shouldn’t drive. I’ll pick you up.” Catherine knew Freya hated Sarah all\nalong, so she agreed."
      },
      {
        "paragraph": "However, when Catherine drove to Brighton Gardens half an hour later, Freya was still not down even\nafter more than lo minutes. As such, she gave Freya a call. “ Eldest Young Lady Lynch, how long will it"
      },
      {
        "paragraph": "take for you to come down?”"
      },
      {
        "paragraph": "“Don’t be hasty. I’m still curling my hair.”"
      },
      {
        "paragraph": "Catherine was speechless. “Sister, we’re going to a court to witness a trial. We’re not attending a\nbanquet.”"
      }
    ]
  },
  {
    "title": "Chapter 1329 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“I know. ” Freya said, “ I’m just worried Rodney will be there too. Think about it. Sarah is the woman he\nloves the most, so I must dress up nicely. I can’t become a plain, unattractive woman whom he looks\ndown on just because I’m pregnant.”"
      },
      {
        "paragraph": "“You’re overthinking. Rodney is still in the hospital.”"
      },
      {
        "paragraph": "“That’s not for sure. His obsession with Sarah is especially deep. Alright, let’s not talk anymore. I’m\nhanging up.”"
      },
      {
        "paragraph": "“Hurry up…”"
      },
      {
        "paragraph": "The call ended before Catherine could finish her sentence."
      },
      {
        "paragraph": "After waiting for another 1o minutes, Freya finally appeared. However, her dress-up was indeed very\nthoughtful. Her thick, long hair rested on her back. Her petite face that looked mixed-race seemed like\nthere was no powder on it, making her look clean, natural, and fresh. There was tomato-red lipstick\napplied on her lips. She exuded a youthful feeling without makeup and just a little lipstick."
      },
      {
        "paragraph": "As for her clothing, Freya wore a denim dress with a brown leather belt on her waist, exposing her pretty,\nfair, and slender legs. She had a white bag from Burberry’s new collection of that season."
      },
      {
        "paragraph": "When she walked out of the neighborhood, there were continuously guys who looked back to eye her. A\nyoung man even bumped into a tree because he was too fixated on staring at Freya."
      },
      {
        "paragraph": "Catherine watched that scene in silence until Freya opened the car door and got in."
      },
      {
        "paragraph": "“You don’t look like you’re three months pregnant at all, ” Catherine said."
      },

      {
        "paragraph": "“My stomach isn’t very big yet. If it gets bigger, it won’t be too easy for me to look pretty.” After Freya let\nout a worried sigh, she ran her fingers through her hair. “How do I look? I’m pretty, right?”"
      },
      {
        "paragraph": "Catherine was speechless."
      },
      {
        "paragraph": "“Are you speechless because of my beauty?” Freya battered her eyes playfully."
      },
      {
        "paragraph": "“Wait a minute, sister. Are you dressing up so nicely just to make Rodney regret it? But you don’t even\nlike Rodney. Don’t make yourself look as if you want him to regret dumping you, okay?”"
      },
      {
        "paragraph": "Catherine complained."
      },
      {
        "paragraph": "“You don’t understand. His attitude toward me was worse than dumping me,” Freya said furiously. “\nWhenever I think of that idiot forcing me to get an abortion because of a few drops of Sarah’s tears, I get\nso mad. I don’t mind losing to you, but I’m just not satisfied losing to Sarah, that evil witch.”"
      },
      {
        "paragraph": "“Then why did you act as if you didn’t care at all when the Snow family asked for your opinion?”\nCatherine could not resist asking."
      },
      {
        "paragraph": "“I’m not a fool. The Snow family is willing to stand on my side because they know I’m the victim. The\nSnow family treats me well, but that doesn’t mean I’m as important as Rodney. At the end of the day, I’m\nnot a member of the Snow family. They want to let Rodney return, but for one, they have already\nreleased a public statement, so they can’t bring down their pride. Secondly, they are worried that I’ll be\nuncomfortable. However, if I were to oppose letting Rodney return at that time, the Snow family would\nsurely be skeptical of me. That’s why I can’t make a decision.”"
      },
      {
        "paragraph": "Catherine gave her an approving glance. “You’re smarter now.”"
      },
      {
        "paragraph": "“Of course… ” After Freya said that, her expression suddenly darkened. “When wasn’t I smart?”"
      },
      {
        "paragraph": "“I used to think you were quite dim, ” Catherine said honestly. “But let me remind you. Don’t put on\nmakeup too often when you’re pregnant.”"
      },
      {
        "paragraph": "“Don’t worry. I developed these myself.” Freya took a small bag and handed it over to Catherine. “ It’s not\nlaunched on the markets yet. You’re the only one who has this in the whole of Australia. It’s called\nmanipulative cosmetics. It’ll allow you to have unrivaled beauty, yet men will think you have no makeup\non.”"
      },
      {
        "paragraph": "“Really?” Catherine widened her eyes. Everyone wanted to look pretty, and Catherine was no exception\neither."
      },
      {
        "paragraph": "“Look at my makeup today. Does it seem natural?” Freya raised her eyebrows."
      },
      {
        "paragraph": "Catherine immediately opened the small bag and started studying Freya’s cosmetics."
      },
      {
        "paragraph": "She forgot that she was supposed to go to court until Shaun gave her a call. “Cathy, are you here yet?\nThe trial will start in 10 minutes.”"
      }
    ]
  },
  {
    "title": "Chapter 1330 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine, who was in the midst of putting on makeup, was stunned."
      },
      {
        "paragraph": "“You can’t possibly have… forgotten about it, right?” Shaun gritted his teeth."
      },
      {
        "paragraph": "“How’s that possible? I’m just picking Freya up, but she was dilly-dallying.” Just as Catherine finished\nspeaking, she received a death stare from Freya."
      },
      {
        "paragraph": "“Why are you picking her up? Why is a pregnant woman like her running around?” Shaun was angry and\ngloomy. “Come over quickly. If you aren’t here, it’s meaningless even if I win.”"
      },
      {
        "paragraph": "“Okay. I’ll come immediately.”"
      },
      {
        "paragraph": "After Catherine hung up, Freya rolled her eyes at her. “I dilly-dallied and delayed your time?”"
      },
      {
        "paragraph": "“I waited for you for half an hour. I’m not lying, right?” Catherine said with a smile."
      },
      {
        "paragraph": "Freya turned her head around and ignored her."
      },
      {
        "paragraph": "Fortunately, the court was near that area."
      },
      {
        "paragraph": "Although they were a few minutes late, they managed to make it in time."
      },
      {
        "paragraph": "The trial had already started, and the seats in the front were full. Hence, they bent over and sat on the\nsecond last row quietly."
      },
      {
        "paragraph": "After they took their seats, Catherine set her gaze on Shaun."
      },
      {
        "paragraph": "Today, Shaun was wearing a black suit. With a white shirt inside and matched with a smart necktie, he\nlooked very immaculate. From the side, that handsome side profile was like a smooth and perfect line\ndrawn by a brush."
      },

      {
        "paragraph": "Sometimes, that man was as childish as a kid in front of Catherine. However, when he stepped on his\nbattlefield, he seemed like another person."
      },
      {
        "paragraph": "Meanwhile, Freya was different from her. She disliked Shaun, so she looked around after she sat down.\nThen, she saw a girl, about twenty years old and wearing a mask, sitting beside her."
      },
      {
        "paragraph": "When Freya looked over, that person was looking at her and Catherine too. There was a strange gleam\nin that girl’s dark eyes, which seemed very gentle."
      },
      {
        "paragraph": "However, when Freya’s gaze met hers, she quickly avoided Freya."
      },
      {
        "paragraph": "Freya blinked and looked at that girl’s exposed eyes. She felt they looked very, very familiar, as if she\nhad seen them somewhere before."
      },
      {
        "paragraph": "“Oh, I remember. Are you… Eliza… Eliza Robbins?” Freya lowered her voice happily."
      },
      {
        "paragraph": "“Mm.” Surprisingly, that girl admitted it openly."
      },
      {
        "paragraph": "Freya’s astonishment was followed by delight. “Oh my gosh, I like you a lot. I’ve seen you in Queen of\nPoisons before. It was terrific. Your acting skills were on point and simply beautiful.”"
      },
      {
        "paragraph": "“Thank you. I’ve heard of you before too. You’re the world’s youngest top cosmetic chemist. You’re very\noutstanding.” Eliza smiled and looked at Freya’s face."
      },
      {
        "paragraph": "Those two people used to be her good friends."
      },
      {
        "paragraph": "However, things did not go well for the three of them three years ago."
      },
      {
        "paragraph": "It was especially true for her, who lost her life in the end. Luckily, she could still meet those two friends\nafter her rebirth."
      },
      {
        "paragraph": "Freya, especially, was still the same as before. Those scars did not leave any trauma on her."
      },
      {
        "paragraph": "Although Eliza could not tell them she was Charity, she was very happy that she could get to know them\nagain."
      },
      {
        "paragraph": "Charity was back."
      },
      {
        "paragraph": "“What a pleasant surprise! The idol I like has heard of my name, ” Freya said while laughing. “By the\nway, why would you come and watch this trial? I know. You must’ve heard of Sarah’s bad reputation and\nhate her a lot too, right?”"
      },
      {
        "paragraph": "“Yes. ” Eliza nodded with a smile. “ I hate her very much.”"
      },
      {
        "paragraph": "“You’re really… my buddy.” Freya held Eliza’s hands in excitement. “I think we’ve gotten to know each\nother too late. Do you have some time later? Let’s have a meal together after this trial ends.”"
      },
      {
        "paragraph": "“Sure.”"
      },
      {
        "paragraph": "“Let’s exchange contacts.” “No problem.” Catherine, who was at the side, was speechless."
      }
    ]
  },
  {
    "title": "Chapter 1331 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine really wanted to pay attention to the trial, but Freya was too noisy."
      },
      {
        "paragraph": "Did Freya come to see Sarah lose or make friends?"
      },
      {
        "paragraph": "In just a moment, they had even settled dinner plans."
      },
      {
        "paragraph": "Just as she opened her mouth and wanted to say something, a man in front suddenly turned around. He\ngritted his teeth and said in a low voice, “Freya Lynch, can you be quiet?”"
      },
      {
        "paragraph": "The Snow family may have asked Rodney to please Freya, but that woman was busy socializing once\nshe arrived, and her enthusiastic look made him a little angry."
      },
      {
        "paragraph": "She was Nathan’s goddaughter after all. Was she not afraid of people approaching her with bad\nintentions? She even invited that person for a meal after knowing her for less than a minute."
      },
      {
        "paragraph": "Freya was taken aback. Only then she realized Rodney was sitting in front of her."
      },
      {
        "paragraph": "That b*stard really came. He even dared to be so fierce to her."
      },
      {
        "paragraph": "“Rodney, it’s none of your f*cking business.”"
      },
      {
        "paragraph": "She kicked his butt hard with her leg. The backrest of the chair had a cut-out, so her kick landed directly\non Rodney’s injured butt."
      },
      {
        "paragraph": "He lost control and jumped up from his seat while howling in pain."
      },
      {
        "paragraph": "The tense trial instantly fell silent. Everyone, including the judge, turned their gazes to Rodney oddly."
      },
      {
        "paragraph": "Rodney’s face flushed red in embarrassment. “I’m…"
      },

      {
        "paragraph": "I’m sorry.”"
      },
      {
        "paragraph": "The judge glared at him as a warning. “If you make any more noises, I’ll have no choice but to throw you\nout.”"
      },
      {
        "paragraph": "Shaun gave Rodney a speechless glance too. Rodney was already wounded. Could he not stay still?"
      },
      {
        "paragraph": "Rodney sat down aggrievedly before turning back and glaring at Freya fiercely."
      },
      {
        "paragraph": "Freya gave him a provoking smile. She even raised her middle finger and pointed it downward."
      },
      {
        "paragraph": "Rodney was speechless."
      },
      {
        "paragraph": "F*ck, Rodney was exasperated. Catherine was at a loss for words."
      },
      {
        "paragraph": "When she glanced sideways, she saw the girl beside Freya watching the scene as well. Those cold eyes\nwhich were exposed had traces of a smile in them."
      },
      {
        "paragraph": "They looked quite familiar."
      },
      {
        "paragraph": "Eliza had sensed Catherine’s gaze as well, so she turned her head and nodded at Catherine."
      },
      {
        "paragraph": "Catherine returned the nod. Just as she wanted to continue watching the trial, that restless Freya kicked\nRodney again."
      },
      {
        "paragraph": "That time, Rodney’s whole body trembled in pain, but he did not dare to jump up again."
      },
      {
        "paragraph": "Freya quickly leaned closer to him and said in a low voice, “I’m sorry, I’m sorry. I didn’t do it on purpose.\nMy legs are too long. All I did was move them, and they bumped into you.”"
      },
      {
        "paragraph": "Rodney tolerated the pain and gritted his teeth with a pale face. “Freya Lynch, do you think I’m a fool?”"
      },
      {
        "paragraph": "“Sigh. Why do you think so badly of others?” Freya said while kicking him again nonchalantly."
      },
      {
        "paragraph": "Rodney broke out in a cold sweat. No longer daring to sit there any longer, he quickly bent his waist and\ndragged his painful butt to sit down at the last row. He purposely sat behind Freya."
      },
      {
        "paragraph": "Freya turned behind and said softly,“ I know your legs are long too, but please be careful. I’m different\nfrom you. I have a baby in my stomach. If you kick and hurt me, I’ll tell the judge.”"
      },
      {
        "paragraph": "Rodney, who was preparing to pretend to kick her butt, was so startled that his legs stiffened."
      },
      {
        "paragraph": "Freya watched his aggrieved yet helpless expression and smiled smugly."
      },
      {
        "paragraph": "Catherine glanced at her helplessly. “Why don’t you and Rodney go outside, have a fight, and come in\nagain?”"
      },
      {
        "paragraph": "“Ah, I’ll stop disturbing you from watching Shaun, okay?” Only after the reminder did Freya turn quiet.\nShe could not miss out on Sarah’s despair look on her face for teaching Rodney a lesson. In the trial,\nShaun was in a passive situation."
      }
    ]
  },
  {
    "title": "Chapter 1332 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Sarah sat on the defendant’s seat. Her gaze was cold, and she felt very smug."
      },
      {
        "paragraph": "Her attorney, Stevens, said indifferently, “The rumored top attorney in Australia is nothing much.”"
      },
      {
        "paragraph": "Sarah asked in a low voice, “Are we guaranteed to win?”"
      },
      {
        "paragraph": "“Almost. Didn’t you see the judge’s dissatisfactory gaze toward Shaun? Now, let me trample him for the\nlast time.”"
      },
      {
        "paragraph": "Stevens stood up and asked Shaun, “Mr. Shaun Hill, I heard that you hooked up with a married woman\nrecently. Is that true?”"
      },
      {
        "paragraph": "Shaun’s lips moved. “She’s my ex-wife…”"
      },
      {
        "paragraph": "“All you need to answer is whether it’s true or false. Did you hook up with a woman who has yet\ndivorced?” Stevens said."
      },
      {
        "paragraph": "“Yes.” Shaun nodded."
      },
      {
        "paragraph": "Stevens smiled. He looked toward the judge. “Your Honor, you’ve heard that too. No matter what reason\nShaun has, the fact that he is together with a married woman publicly states that he has low morals. This\nis even a negative influence on society. Therefore, him cheating Sarah’s feelings and wasting more than\nten years of my client’s youth is undoubtedly despicable. It is poor conduct. I hope Your Honor can make\nthe fairest judgment. If a person like him gets rich, he’ll only think about harming innocent girls. In his\neyes, women are like clothes that can be simply toyed with.”"
      },
      {
        "paragraph": "The judge was a woman. Hence, after hearing Stevens’ words, she was unsatisfied with Shaun’s actions\ntoo."
      },

      {
        "paragraph": "Shaun stood up. “Miss Sarah Langley Neeson, let me ask you for the last time. Did I have sex with you\nbefore?”"
      },
      {
        "paragraph": "Sarah looked toward him ruefully. “I have no choice if you don’t want to admit it.”"
      },
      {
        "paragraph": "“Please reply to my question directly, ” Shaun said coldly."
      },
      {
        "paragraph": "“Yes.” Sarah nodded."
      },
      {
        "paragraph": "Shaun turned to the judge and said, “I appeal to bring the last witness to court.”"
      },
      {
        "paragraph": "“Who is the witness?” the judge asked."
      },
      {
        "paragraph": "“ It’s Sarah’s biological brother, Thomas Neeson.” After Shaun finished speaking, Sarah’s expression\nchanged."
      },
      {
        "paragraph": "Stevens immediately said, “Objection. Shaun didn’t make the application beforehand.”"
      },
      {
        "paragraph": "Shaun said, “Some things happened to Thomas lately, and he had been hospitalized all along. I didn’t\nknow whether he could make it to this trial or not, so I didn’t make an application. However, he sent me a\nmessage before the trial started and said he would come. Moreover, both sides mentioned Thomas’s\nname many times during the first hearing.”"
      },
      {
        "paragraph": "The judge glanced at the past records before she nodded. “Let him in.”"
      },
      {
        "paragraph": "Sarah’s originally smug face sank. She did not understand why Thomas would go to Shaun after he was\nmissing for a month?"
      },
      {
        "paragraph": "She thought Thomas was so terrified after being taught a lesson by Chester that the former secretly left\nthe country."
      },
      {
        "paragraph": "“How much does your brother know about your stuff?” Stevens asked in a deep voice."
      },
      {
        "paragraph": "“A lot.” Sarah did not feel good."
      },
      {
        "paragraph": "Stevens clenched his fists in frustration. “Why didn’t you tell me before?”"
      },
      {
        "paragraph": "“I wasn’t sure. He always listened to me.” Sarah was puzzled as well. At the same time, she secretly\nhated him. She should have gotten rid of Thomas a long time ago."
      },
      {
        "paragraph": "Soon, Thomas entered."
      }
    ]
  },
  {
    "title": "Chapter 1333 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "When Thomas saw Sarah, he could not help but shudder."
      },
      {
        "paragraph": "Sarah quickly said with reddened eyes, “Brother, where have you been all this time? I was so worried.\nHow did you get hurt? Did Shaun threaten you?”"
      },
      {
        "paragraph": "Shaun immediately rebuked, “Sarah, please mind your words. I can sue you for defamation.”"
      },
      {
        "paragraph": "The judge glared at Sarah as a warning too. “The witness can take his place.”"
      },
      {
        "paragraph": "After Thomas nervously got into the witness box, Shaun asked, “Mr. Thomas Neeson, I would like to ask\na question. Did I help Neeson Corporation many times after your father passed away? Did I secretly help\nNeeson Corporation to look for collaboration partners multiple times as well?”"
      },
      {
        "paragraph": "Thomas nodded fearfully. “Yes.”"
      },
      {
        "paragraph": "Shaun said, “If it weren’t for me, could Neeson Corporation have lasted until today?”"
      },
      {
        "paragraph": "Thomas shook his head. “No.”"
      },
      {
        "paragraph": "Shaun asked again, “Your sister said I had sex with her before. Do you think this is true?”"
      },
      {
        "paragraph": "Stevens stood up. “Objection. Thomas is just my client’s brother. How would he know such a private\nquestion? Moreover, as far as I know, Thomas and Shaun’s relationship was never good. There are too\nmany doubts as to why Thomas would suddenly be willing to be Shaun’s witness. We suspect Shaun\nthreatened the witness. All of you can see the injuries on the witness’s body.”"
      },
      {
        "paragraph": "The judge frowned, and everyone started whispering as well."
      },
      {
        "paragraph": "However, Thomas said loudly, “No, he didn’t threaten me. I’m the one who hates Sarah. She’s too evil.”"
      },

      {
        "paragraph": "Sarah’s expression changed. She said with tears in her eyes, “Brother, do you know what you’re saying?\nWe’ve gone through so many things after Mom’s death. If it weren’t for me, would you still be here in one\npiece?”"
      },
      {
        "paragraph": "Shaun laughed sarcastically and said, “Don’t take credit for all the good things. I was the one who fought\nthe lawsuits for him back then. If it weren’t for me, he would’ve gone to jail. On the other hand, Sarah,\nyou exploited your brother so many times all"
      },
      {
        "paragraph": "these years. You were innocent because he shouldered all the blame.”"
      },
      {
        "paragraph": "“That’s right.” Thomas suddenly remembered the incident where Chester made him impotent, and fury\nwelled within him. “After the Hill family went down, I bumped into Shaun once when he was drunk. I\ncalled you and told you about it. In the end, you instigated me to tell Simon about it and let him teach\nShaun a lesson, yet you got away clean.”"
      },
      {
        "paragraph": "Faced with everyone’s complicated gazes, Sarah immediately retorted and said, “What nonsense are\nyou spewing?”"
      },
      {
        "paragraph": "Stevens said, “There’s no need to talk about your personal grudges here. This is a court, not a market.”"
      },
      {
        "paragraph": "Thomas almost lost his rationality due to anger. Luckily, Shaun immediately said, “Thomas Neeson,\nplease reply to my previous question.”"
      },
      {
        "paragraph": "Thomas paused for a while before he hurriedly said, “How could you and my sister have had sex? Sarah\ntold me many times that you would puke every time you touched her. She would always complain to me\nin private, and she even scolded you… She said you were a useless thing.”"
      },
      {
        "paragraph": "Once those words came out, everybody was shocked."
      },
      {
        "paragraph": "Thomas said, “There was one time when she asked me to procure drugs. In the end, she didn’t succeed,\nand she even blamed me for the drug not being strong enough.”"
      },
      {
        "paragraph": "“Nonsense.” Stevens said in a deep voice, “Tell me. What benefits did Shaun give you to frame your\nsister?”"
      },
      {
        "paragraph": "Sarah sobbed and said, “Brother, we’re family.”"
      },
      {
        "paragraph": "She wanted to hint to Thomas that her money was his money too, hoping Thomas would come to realize\nit."
      },
      {
        "paragraph": "However, Thomas had long since despised her. How would he believe her? “When she and Shaun were\ndating, she often instigated me to give Shaun some hints so that he would give her luxurious houses and\nbranded bags. Furthermore, back when Shaun and Catherine hadn’t divorced yet, she always pretended\nto be hurt. It was so that she could cheat Shaun over to her place and make Catherine misunderstand.\nShe wanted to slip in when the husband and wife were fighting.”"
      },
      {
        "paragraph": "Sarah was furious. “That’s not true.”"
      },
      {
        "paragraph": "Thomas sneered. “It’s true. Your injuries were very light every single time, yet you always had me\nexaggerate it in front of Shaun.”"
      }
    ]
  },
  {
    "title": "Chapter 1334 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Sarah’s whole body trembled with an embarrassed expression."
      },
      {
        "paragraph": "Thomas continued saying, “You’re clearly a home- wrecker that ruined other people’s marriage. After\nShaun and Catherine had a conflict, and after you wounded yourself that time on purpose, you asked me\nto tell Shaun that you wanted to live in the seaside villa. The real reason is that you wanted to live in the\nseaside love nest that Catherine and Shaun used to stay in, then show it off to Catherine to give her a\nblow.”"
      },
      {
        "paragraph": "“Moreover, that year when Catherine was pregnant with fraternal twins, you told me that you would\ndefinitely deal with the twins after Shaun handed the children to you.”"
      },
      {
        "paragraph": "When Thomas revealed incident after incident, everyone in the courtroom was stunned."
      },
      {
        "paragraph": "Some even could not resist discussing it."
      },
      {
        "paragraph": "“Didn’t she say she was an innocent victim? That it was Shaun who betrayed her and married another\nwoman, and he coaxed her back with sweet words again afterward.”"
      },
      {
        "paragraph": "“So in the end, she was the mistress. Ew.”"
      },
      {
        "paragraph": "“She’s too manipulative, and she almost deceived me.”"
      },
      {
        "paragraph": "“She’s not just manipulative. She’s evil. She couldn’t even spare the newborn babies.”"
      },
      {
        "paragraph": "“That’s right. Children are the purest angels in the world.”"
      },
      {
        "paragraph": "“If you ask me, Shaun is a sc*m too. It takes two to tango. If he were a good man, he wouldn’t have been\ndeceived by Sarah. He deserves it for two- timing.”"
      },

      {
        "paragraph": "“The most innocent people are Catherine and the children.”"
      },
      {
        "paragraph": "Rodney sat in the audiences’ seat. He could hear everyone’s discussion clearly."
      },
      {
        "paragraph": "His pretty face, which was already pale, became paler as if he was about to faint and break down any\ntime."
      },
      {
        "paragraph": "He thought Sarah was just greedy, vain, and liked to"
      },
      {
        "paragraph": "play up to people of power and influence. Yet, he did not expect that she was more evil and scheming\nthan he thought."
      },
      {
        "paragraph": "What he could not accept most was Sarah even intended to hurt Shaun’s children."
      },
      {
        "paragraph": "Was that true?"
      },
      {
        "paragraph": "How terrifying could a person be to do such a thing? In the past, his image of her was pure and lovely."
      },
      {
        "paragraph": "However, at that moment, he suddenly realized that all those words were not her at all."
      },
      {
        "paragraph": "His unforgettable, young unrequited love during his youthful days had been for a fake image all along."
      },
      {
        "paragraph": "He was a joke."
      },
      {
        "paragraph": "On the court, Shaun was so angry that his veins pulsed."
      },
      {
        "paragraph": "Some things that Thomas said had happened before Shaun was hypnotized."
      },
      {
        "paragraph": "Many things in his memories had been distorted. It turned out that every time Sarah got hurt was her\nown doing and that the seaside villa used to be his and Catherine’s love nest."
      },
      {
        "paragraph": "No wonder Cathy hated him so much."
      },
      {
        "paragraph": "He even foolishly gave their love nest to Sarah."
      }
    ]
  },
  {
    "title": "Chapter 1335 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "When he thought of those years he and Sarah lived in the seaside villa, he wanted to slap himself right\nthere and then so badly. All his actions were torturing his own heart."
      },
      {
        "paragraph": "“You b*tch.” Shaun’s eyes were bloodshot. Even a well-mannered man like him could not resist cursing\nvulgar words at that moment."
      },
      {
        "paragraph": "“That’s not true, ” Sarah shouted amidst her frustrated and hopeless crying. “I didn’t do that. Thomas,\nwhy are you framing me? What benefit did Shaun give you? I know. Are you scared of Chester? Did you\nforget who made you this way?”"
      },
      {
        "paragraph": "“You. It’s all you. ” Thomas became unreasonable too. “Why didn’t you, as my sister, stop me whenever I\nhad evil thoughts? As long as it could hurt the people by Catherine’s side, you would encourage me to\ndo them. If it weren’t because you were so close to Shaun and his friends, I wouldn’t have been so\narrogant. You were the one who made me this way today.”"
      },
      {
        "paragraph": "“You brought everything today upon yourself."
      },
      {
        "paragraph": "Haven’t I cleaned up after you enough all these years? You’re so heartless and ungrateful.”"
      },
      {
        "paragraph": "“Ha, so you got fed up with me and had people kidnap me. You secretly want to kill me, right? You evil\nwoman, I’ll pull you down with me even if I’m unlucky.”"
      },
      {
        "paragraph": "“You’re crazy. When did I kidnap you? Don’t talk nonsense.”"
      },
      {
        "paragraph": "The siblings, Thomas and Sarah, started quarreling publicly in the courtroom."
      },
      {
        "paragraph": "“Silence.” The judge gavelled hard. She said angrily, “Do you all take this place as a market? If this\nquarrel continues, you’ll face detainment.”"
      },

      {
        "paragraph": "Sarah cried and said to the judge, “ I’m innocent. ” Thomas said, “What I said was the truth.”"
      },
      {
        "paragraph": "The judge’s temple throbbed. She hit the gavel furiously again. “Quiet.”"
      },
      {
        "paragraph": "She glared at Sarah. With that, Stevens held Sarah back in a hurry and told her not to say anything\nmore. The judge was really infuriated."
      },
      {
        "paragraph": "The room finally quieted down."
      },
      {
        "paragraph": "The judge said coldly, “The accused, you can present your statement.”"
      },
      {
        "paragraph": "Sarah quickly stood up and choked. “Although I don’t understand why my brother would help Shaun,\nwhat I said before was true. When I was 18, Shaun confessed to me and asked me to date him. In order\nto love him, I did the things he liked and even became a psychologist to cure his illness."
      },
      {
        "paragraph": "Everything I did was for his sake. I’m unsatisfied that I gave him more than ten years of my life only for\nthem to be fed to a dog. I’m even wrongly accused as an unscrupulous woman. It’s outrageous. I’m\nreally… unwilling to accept this. ”"
      },
      {
        "paragraph": "Toward the end, she started sobbing."
      },
      {
        "paragraph": "The sound of her crying echoed in the whole courtroom. Everyone silently listened to her weeping, and\nthey all had different expressions on their faces."
      },
      {
        "paragraph": "Freya, who was sitting behind, could not help but scold, “She’s really good at acting. F*ck, why didn’t she\nbecome an actress?”"
      },
      {
        "paragraph": "Eliza squinted her eyes. “My acting skills are nothing compared to hers.”"
      },
      {
        "paragraph": "Catherine sighed. “I just want to puke.”"
      },
      {
        "paragraph": "“You’re pregnant too?” Freya asked in excitement. “No, Shaun can’t make you pregnant, right?”"
      },
      {
        "paragraph": "“…I meant I’m so disgusted by her words that I want to puke,” Catherine said speechlessly."
      },
      {
        "paragraph": "“Haha, you have to understand me. It’s the pregnancy brain.” Freya smiled sheepishly. “Do you think the\njudge will be touched by Sarah’s acting?”"
      },
      {
        "paragraph": "“If it was a male judge, he may be. However, for a female judge…” Catherine laughed."
      },
      {
        "paragraph": "Eliza glanced at Catherine and continued Catherine’s sentence. “Guys always go weak easily a t the\nsight of women’s tears. However, as a woman, a female judge won’t go soft-hearted. On the contrary,\nshe’ll feel more repulsive toward women who like to use crying to gain sympathy. If you don’t believe it,\nlook around. Among the audience, most of the people who have gone soft-hearted at Sarah’s words are\nmen. Most women scoff at it.”"
      },
      {
        "paragraph": "Freya glanced left and right. “I realize you two have quite good chemistry.”"
      },
      {
        "paragraph": "“It’s not chemistry. It’s normal judgment.” Catherine smiled."
      },
      {
        "paragraph": "“That’s right.” Eliza nodded."
      },
      {
        "paragraph": "Freya was speechless. “That’s enough. Don’t make it look as if I can’t make normal judgments, okay?”"
      },
      {
        "paragraph": "”You even said I’m pregnant. Do you think you can still make normal judgments?” Catherine dealt her a\nblow."
      }
    ]
  },
  {
    "title": "Chapter 1336 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "When Sarah was almost done crying, the judge said to Shaun, “The plaintiff can present his statement.”"
      },
      {
        "paragraph": "Shaun stood up and gazed at Sarah. Beneath his short black hair, his perfect, handsome face was full of\nsadness and regret. “If someone asked me what first love is, I would think it’s a nightmare. I regret why I\nwanted to get to know you back then. You became my light during my younger days, so I treated you like\nfamily. For more than ten years, I gave what I could. Whether it was you or your family, I let all of you\ntake and request anything from me. I only got married after you went missing for a few years."
      },
      {
        "paragraph": "“Initially, it was just a contractual marriage with my wife. However, I gradually fell in love with her the\nmore we spent time together. After that, you came back, and I felt guilty toward you. In order to thank\nyou, I was always the first to lend a hand whenever you had a problem. But I didn’t know my actions had\nhurt my wife and drove her and my kids away from me for three years."
      },
      {
        "paragraph": "“I regret it, especially these days when I’ve found out the truth. I regret it so much that I’ve been drunk\nevery day and desperately want to stab myself to death with a knife. Because I regret it, I chopped off\nthis finger of mine to atone for my sins.”"
      },
      {
        "paragraph": "He raised his finger, which was still wrapped in a bandage. Everyone was horrified."
      },
      {
        "paragraph": "Shaun continued saying, “In fact, I only just got to learn about the things that Thomas said earlier. I don’t\nthink I owe Sarah anything. I just feel sorry for my ex-wife. I used to treat her as an unscrupulous woman\nwho was greedy and vain, but I misunderstood her. I owe her too much."
      },
      {
        "paragraph": "“I’m a bloody, living example. If other men experienced the same situation as me, I want to tell you guys\nthis. Exes are exes. If you’re married, then you should end your relationship with them. Don’t hurt your\nwife.”"
      },

      {
        "paragraph": "“The reason I want to take back the 1oo billion dollars isn’t that I need the money, but because I think\nshe doesn’t deserve it. A greedy woman like her doesn’t deserve to have that huge amount of money. If\nnot, it’ll make some bad people in society and even a group of young people think they can take\nshortcuts and reap benefits by deceiving other people’s feelings.”"
      },
      {
        "paragraph": "Shaun’s sharp eyes stared at Sarah. “I hope you’ll be able to earn money through your own abilities and\nhave your feet on the ground.”"
      },
      {
        "paragraph": "After he said his last sentence, Sarah’s face was as pale as snow."
      },
      {
        "paragraph": "Shaun was incredible."
      },
      {
        "paragraph": "He laid down such long personal repentance of his feelings at the start and included a positive\nimplication on society toward the end."
      },
      {
        "paragraph": "That case had gotten very big, so the judge would emphasize bringing positive influences to the society."
      },
      {
        "paragraph": "Sure enough, the judge became solemn. After communicating with two juries for a while, she said, “After\ntwo hearings, the court has listened to both parties’ statements. The following is the judgment of the\ncourt for this case:"
      },
      {
        "paragraph": "“The court deems that Sarah should return the 100 billion dollars and the seaside villa to Shaun\nimmediately. This money isn’t yours from the start. As for all the expenses Shaun spent on Sarah for\nmore than ten years, there’s no need to get them back. This is a punishment for Shaun. As a man, you\nbetrayed your wife and your children. You brought this upon yourself. This is a lesson for you.”"
      },
      {
        "paragraph": "The judge paused for a while before looking at Sarah. “Just now, there was a good sentence from the\nplaintiff. People can’t reap benefits by cheating other people’s feelings. What you have is already\nsomething that many others can’t have even after working hard their entire life. Don’t be too greedy. ”"
      },
      {
        "paragraph": "“This case has ended. The court adjourns.”"
      },
      {
        "paragraph": "After the judge left the courtroom, Sarah sat on the chair, devastated."
      },
      {
        "paragraph": "Her 100 billion dollars was gone just like that."
      },
      {
        "paragraph": "She was even told off by the judge in the courtroom. For Sarah, that was adding insult to injury."
      },
      {
        "paragraph": "Stevens glanced at her indifferently, and then he walked toward Shaun. “You really do deserve the title of\nthe top lawyer in Australia. You purposely put yourself at a disadvantage during the first hearing, right?\nYou want to make this case go big and let the judge notice the negative influences that this case brings.\n1oo billion dollars can tempt many people. If the judge didn’t sentence the money to you, many people\nwould learn from Sarah.”"
      },
      {
        "paragraph": "“That’s right, but you realized it too late.”"
      }
    ]
  },
  {
    "title": "Chapter 1337 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Shaun smiled. “Even if I didn’t call Thomas in for the second trial, the outcome would be the same. Even\nif the judge felt that I was in the wrong, she would still have to declare that I won in order to bring positive\ninfluence to society.”"
      },
      {
        "paragraph": "“You’re amazing.” Stevens nodded. He took the gamble and accepted the loss. “ I hope there’ll be a\nchance to go against you again in the future.”"
      },
      {
        "paragraph": "Then, he turned to leave, no longer caring about Sarah."
      },
      {
        "paragraph": "Sarah also tried to sneak away, but Shaun noticed her. “Return the money to me within three days, or I’ll\nhave to ask the police to enforce the law. By the way, move out of the seaside villa immediately. I’ll\ncollect the house before dark.”"
      },
      {
        "paragraph": "“Shaun Hill, don’t go too far.” Sarah wanted to kill him with her eyes."
      },
      {
        "paragraph": "“You’ve occupied a place that doesn’t belong to you for long enough. It’s time for you to get out.” After\nthat, Shaun walked straight towards Catherine."
      },
      {
        "paragraph": "The trial made him feel even more guilty towards Catherine."
      },
      {
        "paragraph": "Catherine stood up slowly and was forcefully wrapped into his arms before she could speak."
      },
      {
        "paragraph": "“Cathy, I’m sorry.” Shaun apologized with chagrin. “I was too stupid before. I now understand that you\nwere right not to forgive me.”"
      },
      {
        "paragraph": "“Then… Should I take back my words of forgiveness?” Catherine raised her brows provocatively."
      },
      {
        "paragraph": "Frightened, Shaun hurriedly said, “I made that up. ”"
      },

      {
        "paragraph": "Catherine burst out laughing. “Forget it. Some things can be more unpleasant the more you think about\nit.”"
      },
      {
        "paragraph": "“Yes. ” Freya also butted in “Any woman would die from anger if she found out that her love nest with her\nhusband was given to a mistress. Do you know Cathy specially moved to the seaside villa to accompany\nyou when your illness relapsed? You two basically pledged your love there.”"
      },
      {
        "paragraph": "Shaun’s face flushed red. “I didn’t know. I don’t remember…”"
      },
      {
        "paragraph": "“Enough, Freya. There’s no point in talking about that.” Catherine dissuaded her."
      },
      {
        "paragraph": "Freya huffed. “You sure are tolerant.”"
      },
      {
        "paragraph": "Catherine was exasperated. “I’d have gotten a cerebral hemorrhage out of anger if I weren’t.”"
      },
      {
        "paragraph": "“Cathy, don’t worry. When I get the villa back, I’ll get someone to burn it down.” Shaun said immediately,\n“Let’s build a new one.”"
      },
      {
        "paragraph": "“No need. I don’t ever want to see that piece of land again. Just sell it. ” Catherine changed the subject. “\nYou fought this lawsuit quite beautifully.”"
      },
      {
        "paragraph": "“I only did well because you’re here.” Shaun flattered her carefully. Then, he saw Rodney walking to the\ndoor in a daze."
      },
      {
        "paragraph": "He caught up and patted Rodney on the shoulder. “ You were discharged?”"
      },
      {
        "paragraph": "“Yeah.” Rodney was still at a loss, and even his eyes were red. “ Shaun, was Thomas telling the truth?”"
      },
      {
        "paragraph": "Freya’s gloomy voice rang out. “Oh my, it looks like a certain someone still can’t accept this reality."
      },
      {
        "paragraph": "Cathay, don’t you think he’s a fool?”"
      }
    ]
  },

  {
    "title": "Chapter 1338 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine smiled. “Actually, I don’t think there’s the need to bother about Sarah’s character. Don’t you\nlove her? In that case, you should be tolerant of all her bad and evil sides. How did that saying go? Love\nat its highest realm is loving a person as they truly are. Besides, someone has to collect Sarah."
      },
      {
        "paragraph": "What if she harms others if no one takes her? Young Master Snow is the most suitable for her.”"
      },
      {
        "paragraph": "“That’s true. Hey, hurry up and go after Sarah. She must be very sad and helpless now. You should\ncomfort her.” Freya gave a thumbs up."
      },
      {
        "paragraph": "As expected of her good sister. Freya’s ability to stab people’s wounds was unparalleled."
      },
      {
        "paragraph": "Rodney was originally very sad, but his handsome face turned red in embarrassment by their rant."
      },
      {
        "paragraph": "“Freya Lynch, that’s enough.” Rodney looked glum."
      },
      {
        "paragraph": "“ It is enough.” Freya turned to the side and pulled Eliza. “Didn’t you promise to have dinner with me?\nLet’s go. Cathy, do you want to join…”"
      },
      {
        "paragraph": "“Sure.” Catherine quite liked Eliza and was about to nod when she saw Shaun’s bitter eyes. She blinked\nand hurriedly said, “Why don’t… we get Shaun to treat us tonight? We can celebrate his victory in the\nlawsuit.”"
      },
      {
        "paragraph": "“Cathy… ” Shaun was not happy. He wanted to be alone with Catherine."
      },
      {
        "paragraph": "“What’s the point of being together all the time? It’s livelier with more people.” Catherine interrupted him."
      },
      {
        "paragraph": "Shaun felt attacked. They had just gotten back together, but she already thought that there was no point\nin them having time together alone?"
      },

      {
        "paragraph": "“You don’t want to?” Catherine saw him fall silent and raised her eyebrows."
      },
      {
        "paragraph": "“No, I was thinking of where to eat.” Shaun hurriedly squeezed out a fawning smile."
      },
      {
        "paragraph": "As long as she was happy, he would do anything."
      },
      {
        "paragraph": "“Have you thought of something?” Catherine asked with a smile."
      },
      {
        "paragraph": "“Yeah, I remember Rodney took us to a kaiseki restaurant the last time. The environment is elegant, and\nit’s quite good,” Shaun immediately said."
      },
      {
        "paragraph": "“Kaiseki sounds good. Is that okay, Miss Robbins?”"
      },
      {
        "paragraph": "Catherine turned to ask Eliza’s opinion."
      },
      {
        "paragraph": "Eliza looked at Shaun silently. She did not want to g o after learning that Shaun would be going."
      },
      {
        "paragraph": "However, when she saw Freya and Catherine looking at her, she nodded in the end."
      },
      {
        "paragraph": "“Then let’s go.” Shaun wrapped an arm around Catherine’s waist and walked outside."
      },
      {
        "paragraph": "Freya and Eliza followed from behind."
      },
      {
        "paragraph": "When the four walked into the elevator, a figure suddenly went in with them."
      },
      {
        "paragraph": "Except for Shaun, everyone looked at Rodney with a disgusted look in their eyes. Freya’s gaze was,\nespecially, full of contempt. “You’re not planning to come with us, are you?”"
      },
      {
        "paragraph": "“Ahem. Shaun is my brother. It’s natural that I celebrate his wins.” Rodney put on a bold face and looked\nat Shaun. “Shaun, you won’ t kick me out, right?”"
      },
      {
        "paragraph": "Shaun did not know how to reply."
      },
      {
        "paragraph": "He was a little speechless at Rodney’s shamelessly handsome face. He understood Rodney. Rodney\nprobably accepted the reality and was trying to get close to Freya now to return to the Snow family."
      },
      {
        "paragraph": "Freya spat, “You still have the cheek to celebrate for him? You stood with Sarah in the previous lawsuit.\nDidn’t you want Sarah to win? Now that you’ve been abandoned, you come running back to your brother.\nI’ve never seen such a shameless person like you.”"
      },
      {
        "paragraph": "Rodney’s face burned from the criticism. “Freya, why are you so sharp-tongued?”"
      },
      {
        "paragraph": "“Sorry, this isn’t called having a sharp tongue. I’m just telling the truth.” Freya retorted. “Do you know\nwhat a friend means? It’s like Cathy and me. We never give up on each other, and we respect each\nother’s likes and support each other’s"
      },
      {
        "paragraph": "decisions. Acting however you want and insisting on things being done your way is just called\nselfishness.”"
      },
      {
        "paragraph": "Shaun was quite satisfied with that answer. Although Freya’s words were a little sharp, they were all out\nin the open, and there were no hidden provocations. Moreover, if it were not for her, Catherine and he\nwould not have met and fallen in love with each other."
      },
      {
        "paragraph": "Freya’s lecture made a man like Rodney flushed red in his face and neck. If it were in the past, he would\nargue loudly. Yet now, he felt that he really was too selfish to his brother."
      }
    ]
  },
  {
    "title": "Chapter 1339 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Fine, I know you’re right, but that’s between Shaun and me,” Rodney said sullenly."
      },
      {
        "paragraph": "Freya nodded. “You’re right, but I just can’t stand how thick-skinned you are.”"
      },
      {
        "paragraph": "Thick-skinned Rodney was speechless."
      },
      {
        "paragraph": "If it were him in the past, he would have quarreled with Freya already."
      },
      {
        "paragraph": "Yet now, his thin lips moved, but he silently closed his mouth."
      },
      {
        "paragraph": "When the elevator arrived, he consciously kept up with Shaun and got into Shaun’s car."
      },
      {
        "paragraph": "Freya sat in Eliza’s car."
      },
      {
        "paragraph": "With that, they headed for the restaurant."
      },
      {
        "paragraph": "Along the way, Shaun held Catherine’s hand with one hand while holding the steering wheel with the\nother. “Cathy, when the 1oo billion dollars arrives, I’ll transfer it to you.”"
      },
      {
        "paragraph": "“Sure.” Catherine nodded."
      },
      {
        "paragraph": "Shaun’s eyes flashed with a trace of surprise. “I thought it would take some time to convince you to take\nit.”"
      },
      {
        "paragraph": "“You think too much. I’m keeping it for Suzie and Lucas. Who knows what will happen in the future? It’s\nbetter for me to leave them more money for their protection, ” Catherine said faintly."
      },
      {
        "paragraph": "“The only thing that will happen in the future is that I will always love you more and more,” Shaun\nconfessed tenderly."
      },

      {
        "paragraph": "Catherine blushed. “Please. There’s someone else in the car.”"
      },
      {
        "paragraph": "Shaun did not even look behind as he smiled mischievously. “Really? Why can’t I see anything? I only\nhave you in my eyes.”"
      },
      {
        "paragraph": "“Corny.” Catherine feigned anger. “I’m only corny to you.”"
      },
      {
        "paragraph": "Rodney, who was taken as air, was treated to their public affection the entire way."
      },
      {
        "paragraph": "He experienced what it felt like to be the third- wheel. If he had known, he would have gone with Freya.\nHe would rather be targeted by her than watch their public affection after his breakup."
      },
      {
        "paragraph": "Halfway there, Shaun received a call from Chester. “ I heard you won. Congratulations. Dinner should be\nyour treat.”"
      },
      {
        "paragraph": "“That’s what I’m planning to do. Why don’ t you join us?” Shaun reminded him, “But you’re not allowed to\nbring Cindy.”"
      },
      {
        "paragraph": "“Sure.”"
      },
      {
        "paragraph": "After hanging up the phone, Shaun looked at Catherine apprehensively. “Cathy, is it fine if I invite\nChester? If you don’t like it, I’ll tell him not to come immediately.”"
      },
      {
        "paragraph": "“It’s fine. I even agreed for the person in the backseat to get in the car.” Catherine smiled. “ Besides, he\nhelped me deal with Wesley the last time, so I owe him a favor.”"
      },
      {
        "paragraph": "“Thank you, Cathy.” Shaun smiled affectionately."
      },
      {
        "paragraph": "That appearance made Rodney utterly speechless. Shaun had no moral integrity at all."
      },
      {
        "paragraph": "Once they were at the restaurant, Catherine and the two women walked in front, and Rodney finally had\nthe chance to grab hold of Shaun. “Shaun, you’re too much. Ever since you’ve gotten back together with\nCatherine, Chester and I have become"
      },
      {
        "paragraph": "insignificant to you.” “It’s good that you know. If you want our friendship to continue, don’t offend my\nwife.” Shaun said seriously, “ If she tells me not to get too close to you, I’ll definitely listen to her.”"
      }
    ]
  },
  {
    "title": "Chapter 1340 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Did you forget? I mentioned this previously. What I got in exchange for thinking about your feelings was\nseparation from my wife and children.”"
      },
      {
        "paragraph": "Shaun patted him on the shoulder sadly. “After reaching my thirties, I realize that what I want most is a\nperfect home. Going home to a pair of lovely children and a beautiful wife after work every day is the\nmost wonderful thing in life.”"
      },
      {
        "paragraph": "Rodney froze at the words. He used to fantasize about such a life with Sarah, but he was mercilessly\nthrown a wet blanket."
      },
      {
        "paragraph": "“You won’t understand this feeling, ” After that, Shaun strode forward to catch up with Catherine."
      },
      {
        "paragraph": "Rodney was very upset. So what if Shaun had children? So what if Shaun had a wife? He had a child\ntoo."
      },
      {
        "paragraph": "Then, he glanced at Freya’s back but saw her walking ahead while holding Eliza’s hand. She did not\neven spare him a look."
      },
      {
        "paragraph": "The waiter took the group to the best private room in the restaurant. It was Japanese style, so it required\nthem to take off their shoes, and there was a balcony that overlooked the sea."
      },
      {
        "paragraph": "The table in the room was rectangular, and one side could seat three people."
      },
      {
        "paragraph": "Shaun and Catherine naturally sat on one side and left an empty seat next to them."
      },
      {
        "paragraph": "Meanwhile, Freya and Eliza sat on the other side. Rodney looked left and right before finally choosing to\nsit on the vacant seat next to Freya."
      },
      {
        "paragraph": "“Who allowed you to sit here? Go and sit next to Shaun.” Freya glared at him with disgust."
      },

      {
        "paragraph": "Rodney was unhappy. However, he knew that if his relationship with Freya did not improve, his child\nwould not acknowledge him in the future. Then, returning to the Snow family would be out of the\nequation. “Freya, I know that I was wrong. I apologize to you, okay? Let bygones be bygones. ”"
      },
      {
        "paragraph": "Not to mention Freya, even Shaun wanted to rub his forehead at those words."
      },
      {
        "paragraph": "His brother’s apology was too insincere. If he said those words, Catherine would definitely explode in\nanger. Since Catherine and Freya got along well, their characters were naturally similar."
      },
      {
        "paragraph": "As expected, Freya slammed her cup down the next second. Her beautiful face was full of anger. “You\ncan let bygones be bygones with just a few words, but you’re the one who turned my life upside down. If\nit weren’t for this child, I could look for a boyfriend and go on dates now. If you hadn’t dragged me to get\nan abortion, I wouldn’t have fallen from the stairs. If I had lost the child, I wouldn’t be able to get pregnant\nagain in my life. People like you are so selfish.”"
      },
      {
        "paragraph": "Rodney’s face burned at being scolded in front of everyone. “B-but if it weren’t because of that child, you\nwouldn’t have become my uncle’s goddaughter. My uncle will soon be the prime minister of the country,\nand you’ll be the princess"
      },
      {
        "paragraph": "“Hah. Just shut up if you don’t know how to talk. ”"
      },
      {
        "paragraph": "Freya was furious. “The Lynch family is also a scholarly family. I’ve never been short on money since I\nwas born. Do you think I want to be a princess? Besides, being a princess isn’t as easy as you make it to\nbe. I can’t be as free as I used to be, and I have to entertain all kinds of dignitaries."
      },
      {
        "paragraph": "People are kind to me on the surface, but behind my backs, they look down on me and say all kinds of\nbad things.”"
      },
      {
        "paragraph": "Rodney froze and lowered his head silently."
      },
      {
        "paragraph": "The more Freya spoke, the more upset she felt. Even her eyes were red. “I used to think about having an\nordinary love, getting married, and having children. Yet, I’m pregnant before I’m married. My belly isn’t\nshowing now, but when it gets bigger, I’ll have to sneak overseas to give birth to my child. You ruined my\nlife, sc*m.”"
      },
      {
        "paragraph": "If she had not been holding herself back, she would have poured hot water all over Rodney’s face."
      },
      {
        "paragraph": "At her words, Rodney felt so sullen, and it was not a nice feeling."
      },
      {
        "paragraph": "He felt bitter as if he had eaten a bitter gourd."
      },
      {
        "paragraph": "He had to admit that he had hurt Freya. If it were not for that product launch banquet and him inviting\nSarah and her brother, Freya would not have been schemed against by Thomas and gotten pregnant\nlater because Jessica deliberately changed her medicine."
      },
      {
        "paragraph": "She was a victim from beginning to end."
      }
    ]
  },
  {
    "title": "Chapter 1341 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "If… If only he agreed to the Snow family’s arrangement and married her back then."
      },
      {
        "paragraph": "That way, the child would have a complete family, and Freya would not have gotten pregnant before\nmarriage."
      },
      {
        "paragraph": "Unfortunately, there was no cure for regret in this world."
      },
      {
        "paragraph": "Catherine sighed. “Freya is right. She didn’t want to keep the child at first either. It was your sister who\nthreatened her, saying that Lynch Corporation would be suppressed if she aborted the child.”"
      },
      {
        "paragraph": "“I’m sorry… I’m really sorry.” Rodney was remorseful. “How about… I marry you? I’ll take responsibility\nfor it. I’ll definitely be good to you and the child in the future.”"
      },
      {
        "paragraph": "Although he did not love Freya, he was willing to take responsibility."
      },
      {
        "paragraph": "“In your dreams.” Freya was furious. “Are you worthy of me? You’re just a smelly piece of sh*t that Sarah\ngot tired of playing with. I’m not a garbage bin that collects trash that people throw away.”"
      },
      {
        "paragraph": "Hit by Freya’s words, Rodney turned pale and devastated. “That’s enough, Freya. Your words are too\nmuch. Everyone has gotten obsessed at one point in their lives. Even Shaun…”"
      },
      {
        "paragraph": "“Don’t drag me into this.” Shaun immediately grabbed Catherine’s hand nervously and glared at Rodney\nas a warning."
      },
      {
        "paragraph": "Upset, Rodney had a brain fart, and he subconsciously said, “Weren’t you abandoned before as well?\nYou’re garbage too. We’re both garbage, so we make a pair.”"
      },
      {
        "paragraph": "At those words, Freya’s beautiful face turned black with anger, and everyone else quietened down as\nwell."
      },

      {
        "paragraph": "Catherine and the others rubbed their brows. She had never seen anyone with such poor emotional\nintelligence. He was an expert in rubbing salt in people’s wounds."
      },
      {
        "paragraph": "Shaun poured him a cup of tea. “Rodney, if you don’t know how to talk, then just drink your tea quietly.\nDon’t ruin the atmosphere.”"
      },
      {
        "paragraph": "Rodney blinked and noticed that the atmosphere was off. Hence, he quickly said, “What I meant was …\nWe’ve both gone through the same misfortunes and have an affinity…”"
      },
      {
        "paragraph": "“Who do you have an infinity with? Rodney Snow, please keep your mouth shut. I’d rather find another\npiece of garbage than accept Sarah’s trash. Besides, why don’t you look in the mirror? Are you worthy of\nme? I’m rich and powerful, I’m backed by the future prime minister, and I’m beautiful. What about you?\nWhat do you have? You just have a useless *ss that has been beaten raw.”"
      },
      {
        "paragraph": "Shaun spat out his tea."
      },
      {
        "paragraph": "Eliza and Catherine also laughed."
      },
      {
        "paragraph": "Rodney’s face turned red in embarrassment. He seriously wondered if Freya’s mouth was poisonous."
      },
      {
        "paragraph": "“What are you guys laughing at?”"
      },
      {
        "paragraph": "The door suddenly opened, and Chester walked in dressed in a casual outfit. He carried a calm and\nelegant aura with a gentle smile on his handsome thin lips."
      },
      {
        "paragraph": "“Chester, you’re here.” Rodney looked at him like seeing a savior."
      },
      {
        "paragraph": "Only Eliza’s eyes flashed. She bowed her head and"
      },
      {
        "paragraph": "drank from her cup of tea."
      },
      {
        "paragraph": "“What happened?” Chester looked around. Only the seat beside Shaun was empty."
      },
      {
        "paragraph": "He took off his shoes and walked over to take a seat. Opposite him sat a woman with skin as white as\nsnow."
      }
    ]
  },
  {
    "title": "Chapter 1342 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Eliza was wearing a black suit today with her long hair draped over her shoulders. If she were an\nordinary woman, she would look dull. However, her facial features were delicate and pretty, and her skin\nwas clear. With the black and white contrast, she looked fashionable, like she belonged in a magazine."
      },
      {
        "paragraph": "Nevertheless, she sipped her tea while looking at her phone. She did not even look at him directly."
      },
      {
        "paragraph": "Chester raised his brows."
      },
      {
        "paragraph": "To protect her, Freya immediately said, “Young Master Jewell, this is my friend Eliza. She’s a big star, but\nplease don’t have any lewd thoughts about her. You’re getting married soon.”"
      },
      {
        "paragraph": "Chester chuckled in a low voice. “Miss Lynch, don’t make me seem like a person who gets ideas over\nthe opposite sex anytime and anywhere.”"
      },
      {
        "paragraph": "Freya blinked and said innocently, “I didn’t. I just heard that Young Master Jewell has a reputation for\nbeing a playboy, so I was a little worried.”"
      },
      {
        "paragraph": "“Then you’ve misunderstood me.” Chester glanced at Eliza and smiled. “Most of the time, women look at\nme like a cat looking at a fish. They want to cheat on their partners with me, especially… female stars.”"
      },
      {
        "paragraph": "At that remark, Freya and Catherine both became a little unhappy."
      },
      {
        "paragraph": "After all, they had invited Eliza over. Chester’s innuendo was a bit too much."
      },
      {
        "paragraph": "Shaun and Rodney also found it a little strange. After all, although Chester was a playboy, he seldom\ndeliberately mocked a woman."
      },
      {
        "paragraph": "“Young Master Jewell…” Catherine frowned."
      },

      {
        "paragraph": "However, Eliza spoke first. “I can understand. I heard Young Master Jewell’s wife is also a female star.\nWhen she first saw you, it must have been like a dog seeing a bone.”"
      },
      {
        "paragraph": "Catherine and Freya almost applauded. This was insinuating that Cindy was a dog. How amazing."
      },
      {
        "paragraph": "Chester fiddled with the teacup. “Eliza, was I too lenient with you the last time? People should be open-\nminded after losing, and no matter what, losing is losing.”"
      },
      {
        "paragraph": "“Lenient?” Eliza looked like she heard a joke. “"
      },
      {
        "paragraph": "Maybe you have a misunderstanding of what that word means.”"
      },
      {
        "paragraph": "Chester’s thin lips pursed coldly."
      },
      {
        "paragraph": "Sensing that the atmosphere was not quite right, Shaun immediately interrupted, “Chester, you and Miss\nRobbins know each other?”"
      },
      {
        "paragraph": "“Yeah, she’s a small star from one of my investments, Felix Media, ” Chester said faintly."
      },
      {
        "paragraph": "“Yes, quite small. This year, I earned hundreds of millions for Felix Media, ” Eliza said indifferently."
      },
      {
        "paragraph": "“Is that a lot?” Chester chuckled."
      },
      {
        "paragraph": "Eliza smiled. “Young Master Jewell, you shouldn’t say such things in public. You’ll be criticized to death.”"
      },
      {
        "paragraph": "“Who would dare to?” Chester knocked on the table again and again."
      },
      {
        "paragraph": "The room fell silent again."
      },
      {
        "paragraph": "Shaun and Catherine exchanged glances and saw the headache in each other’s eyes."
      },
      {
        "paragraph": "This meal was too chaotic."
      },
      {
        "paragraph": "Previously, it was Freya and Rodney fighting. Now that Chester had arrived, it became Chester and Eliza\nthrowing knives at each other."
      },
      {
        "paragraph": "How exhausting."
      },
      {
        "paragraph": "“Why don’t we have a drink?” Shaun changed the topic."
      },
      {
        "paragraph": "“Sure.” Eliza and Chester said at the same time."
      },
      {
        "paragraph": "Then, Eliza’s cold and clear eyes swept over to Chester, who smiled. “We really do have chemistry.”"
      },
      {
        "paragraph": "Freya tapped on the table. “Young Master Jewell, please remember you’re getting married to Cindy\nTurner.”"
      },
      {
        "paragraph": "Chester was speechless. The moment Cindy was mentioned, he felt disgusted."
      },
      {
        "paragraph": "Freya really knew how to touch a sore spot."
      },
      {
        "paragraph": "Chester looked at Rodney. “Take care of your child’s mother. There are many things a pregnant woman\ncan’t eat, especially raw food.”"
      },
      {
        "paragraph": "Freya, who was about to take a slice of sashimi, was annoyed."
      },
      {
        "paragraph": "That damn Chester Jewell. She cursed him to be cuckolded in the future, and for his child to be born\ndeformed."
      },
      {
        "paragraph": "”Chester is a doctor. Listen to him.” Rodney immediately took away the sashimi in front of her."
      }
    ]
  },

  {
    "title": "Chapter 1343 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Freya took a couple of deep breaths, and Catherine hurriedly said, “Let her try one. One slice is okay.”"
      },
      {
        "paragraph": "“Alright. Only one.” Rodney gave her the smallest slice."
      },
      {
        "paragraph": "“It’s none of your goddamn business. ” Freya really wanted to explode."
      },
      {
        "paragraph": "“Of course it’s my business. I care about my child.” Rodney said carefully, “Although you don’t\nacknowledge me, you can’t stop me from caring for the child.”"
      },
      {
        "paragraph": "Freya could not be bothered with him and simply washed the sashimi he gave her with cold water again."
      },
      {
        "paragraph": "Rodney’s expression darkened. “I’m not sick.”"
      },
      {
        "paragraph": "“I don’t know about that. You’ve stayed with Sarah for so long. Maybe you’re infected with something.”"
      },
      {
        "paragraph": "Rodney’s face went red with anger. After a long time, a voice squeezed out of his throat. “I didn’t do\nanything with Sarah, okay?”"
      },
      {
        "paragraph": "“Ahem.” Shaun and the others coughed."
      },
      {
        "paragraph": "Chester gave him an odd look. “You can’t do it too?”"
      },
      {
        "paragraph": "“Of course I can.” Rodney bristled. “I’m not the kind of person who messes around with other women. I\nbelieve in sex after marriage.”"
      },
      {
        "paragraph": "After a pause, he turned to Freya. “What happened to us was an accident.”"
      },
      {
        "paragraph": "Freya, who was suddenly mentioned, flushed with embarrassment."
      },
      {
        "paragraph": "“Are you implying Shaun and I mess around with other women?” Chester suddenly said."
      },

      {
        "paragraph": "“…No.”"
      },
      {
        "paragraph": "Rodney hurriedly lowered his head and ate in silence."
      },
      {
        "paragraph": "He regretted it. If he had known earlier, he would not have come for this meal. It was exhausting."
      },
      {
        "paragraph": "“Let’s stop talking about the past. Cheers.” Catherine raised her glass."
      },
      {
        "paragraph": "Rodney picked it up, thought about it, and put it down again. “I’m not well enough to drink yet.”"
      },
      {
        "paragraph": "“I’m driving,” Eliza said. Shaun. “I’m also driving.”"
      },
      {
        "paragraph": "Catherine was speechless. In the end, the only ones who could drink were Chester and her."
      },
      {
        "paragraph": "“Young Master Jewell, congratulations on your wedding.” Catherine raised her glass. “I hope you’ll have\na child soon.”"
      },
      {
        "paragraph": "Chester was at a loss for words."
      },
      {
        "paragraph": "Could he not drink this toast? He did not want that blessing."
      },
      {
        "paragraph": "Then, fearing that these people would argue again, Shaun changed the subject and talked about some\naffairs in the business world."
      },
      {
        "paragraph": "Catherine ate for a while and suddenly looked at Eliza. “Oh, do you like herring too? I had a friend who\nloved herring.”"
      },
      {
        "paragraph": "“Yeah, Cha… ” Freya said two syllables before she immediately choked."
      },
      {
        "paragraph": "However, the three men knew who she was talking about."
      },
      {
        "paragraph": "Chester froze and was lost in thought for two seconds."
      },
      {
        "paragraph": "Eliza’s grip on her chopsticks paused as well, and then she smiled faintly. “I think herring is delicious. Too\nmuch salmon makes me sick.”"
      },
      {
        "paragraph": "“Yeah, but I think… too much herring will also make me sick.” Chester took a slice of herring and raised\nhis brows."
      },
      {
        "paragraph": "Eliza looked up and met with the man’s deep gaze. She could catch a hint of vileness in his eyes, and\nshe chuckled. “Young Master Jewell can even get sick of having too many women, let alone a fish.”"
      },
      {
        "paragraph": "“You sure know me well.” Chester smiled charmingly."
      },
      {
        "paragraph": "People who were not in the know would think that they were flirting."
      },
      {
        "paragraph": "“ I can’t help it. I’ve seen many people like you in the entertainment circle. ” Eliza ignored his gaze."
      },
      {
        "paragraph": "“I’ve also seen many women like you.” Chester swirled his glass. “Trying to attract my attention, just\nlike…”"
      },
      {
        "paragraph": "His eyes darkened, and he suddenly fell silent."
      }
    ]
  },
  {
    "title": "Chapter 1344 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Eliza’s cold eyes were full of indifference. After waiting quietly for him for a while and noticing that he did\nnot continue his sentence, she continued to eat."
      },
      {
        "paragraph": "Her indifferent attitude made Chester’s eyes turn cold. “Why aren’t you saying anything?”"
      },
      {
        "paragraph": "“ I don’t know what to say. If I say I don’t want to attract your attention, you’ll call me hypocritical. If I say I\ndo want to attract your attention, you’ll call me cheap.”"
      },
      {
        "paragraph": "Eliza ate a slice of fish, chewed it carefully, and swallowed it before saying, “ So I should shut up, lest\nyou threaten to shut me out again.”"
      },
      {
        "paragraph": "Chester looked at her slow movements, and the undercurrents in the depths of his eyes surged."
      },
      {
        "paragraph": "Freya wanted to speak up for Eliza at first. However, she burst out laughing after hearing Eliza’s words. “\nThat’s true. Men are so senseless sometimes. Let’s eat.”"
      },
      {
        "paragraph": "Halfway through, Chester got up and went to the washroom."
      },
      {
        "paragraph": "When he was washing his hands, Shaun came out from behind. “Hey, you really embarrassed me\ntonight. Cathy was the one who invited Eliza. I don’t care what grievances you’ve had with her before.\nDid you need to target her so many times during the meal?”"
      },
      {
        "paragraph": "“Did I?” Chester did not react to it at all."
      },
      {
        "paragraph": "“Didn’t you?” Shaun glanced at him sideways. “Let me describe what you look like now. You look like you\nwant to sleep with her, but she has rejected you, so you’ re unreconciled and want to ruin her fun in order\nto find a sense of being.”"
      },
      {
        "paragraph": "“You’re nuts.” Chester scolded him."
      },

      {
        "paragraph": "“You never used to be like this.” Shaun pulled a paper towel and wiped his hands."
      },
      {
        "paragraph": "Chester frowned and took a drag on his cigarette. “By the way, why is Eliza here? When did Freya and\nCatherine know her?”"
      },
      {
        "paragraph": "“I’m not too sure either. I saw her sitting with Cathy and the others when I finished the lawsuit. Rodney\nsaid they only met today.”"
      },
      {
        "paragraph": "“Eliza went to see you in court?” Chester raised his brows."
      },
      {
        "paragraph": "“Yeah.”"
      },
      {
        "paragraph": "Shaun then went into the gents."
      },
      {
        "paragraph": "When they returned to the room, they found Eliza’s seat empty."
      },
      {
        "paragraph": "“Eliza said something came up, so she left.” Freya looked at Chester frustratingly. “Young Master Jewell,\nI know that Eliza is only an actor in your eyes. You can look down on her, but you can’t go too far with\nyour words.”"
      },
      {
        "paragraph": "Perhaps it’s because she came from Melbourne that she resented the superiority of the nobles in\nCanberra."
      },
      {
        "paragraph": "If it were in the past, she would endure it. However, she was now Nathan Snow’s adopted daughter, so\nshe did not want to tolerate it."
      },
      {
        "paragraph": "“Don’t make it seem like all women want you for your money and status. Yes, there are women like that,\nbut…”"
      },
      {
        "paragraph": "“How long have you known Eliza?” Chester interrupted her. “Two hours? Three hours? Do you know her\ntrue personality?”"
      },
      {
        "paragraph": "“Yes, we’ve known each other for a short time, but there’s affinity when it comes to making friends."
      },
      {
        "paragraph": "It’s like… that year when Cathy and I liked being friends with Charity, but you men didn’t. ” Freya\nsneered. “What do you like? Sarah, or types like Cindy?”"
      },
      {
        "paragraph": "Chester narrowed his eyes coldly. Rodney understood Chester well and knew that he was getting angry.\nAs such, he quickly said, “Freya, cut the cr*p. Maybe Eliza is an artiste in Chester’s company, so Chester\nknows her a little better."
      },
      {
        "paragraph": "Besides, your status isn’t ordinary now. Many people will deliberately try to curry favor with you. You\nhave to be a little wary.”"
      },
      {
        "paragraph": "Freya found his words ear-piercing. “Thank you for your reminder. Although I don’t have many friends, I\nknow what kind of friends I do have. At the very least, since I was young, I have never made any mistake\nexcept for befriending Cindy.”"
      }
    ]
  },
  {
    "title": "Chapter 1345 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine coughed while holding her water."
      },
      {
        "paragraph": "If Chester had not helped her the other day, she would have given Freya a thumbs up."
      },
      {
        "paragraph": "Freya was still the best at stabbing knives into people."
      },
      {
        "paragraph": "“You don’t know how to tell good from the bad.”"
      },
      {
        "paragraph": "Chester’s handsome features turned extremely cold and hard."
      },
      {
        "paragraph": "After all, Cindy was the woman he was going to marry. Hence, Freya’s cold mockery time and time again\nmade the proud Chester humiliated."
      },
      {
        "paragraph": "“That might be true, but I finally understand how suffocating it was for Cathy when she hung out with you\nguys three years ago.”"
      },
      {
        "paragraph": "Freya stood up and smiled at Catherine. “Cathy, I’m full. I’ll leave now.”"
      },
      {
        "paragraph": "“I’ll send you back.” Catherine immediately stood up."
      },
      {
        "paragraph": "“No need. You stay with Shaun. I’ve eaten too"
      },
      {
        "paragraph": "much, so I want to take a stroll.” Freya waved her hand and left immediately."
      },
      {
        "paragraph": "Less than half a minute later, Rodney got up. “ I’ll see her off.”"
      },
      {
        "paragraph": "Just like that, the room fell into a weird atmosphere."
      },
      {
        "paragraph": "Chester poured himself a glass of wine and said faintly, “I didn’t expect myself to become the most\nunwelcome one tonight. Forget it. I’ll leave too so that I don’t have to be the third wheel.”"
      },

      {
        "paragraph": "Everyone suddenly left, and Catherine shrugged speechlessly. “Let’s not hold this kind of get- together\nnext time. My friends and your friends find each other disagreeable.”"
      },
      {
        "paragraph": "“I underestimated how much they don’t see eye-to-eye.” Shaun hastily wrapped his arms around\nCatherine. “I’m sorry, Cathy. I don’t know what got into Chester today. Perhaps he’s worried that Eliza is\napproaching you with an ulterior motive.”"
      },
      {
        "paragraph": "“If she really has an ulterior motive, she wouldn’t approach Freya and me since we’re women. It’s more\nrealistic to try to get close to men with money and status.”"
      },
      {
        "paragraph": "Catherine shrugged. “She’s from the entertainment circle. What can she get by approaching us? Let me\nsell her a house at a discount? Or let Freya send her a few bottles of skincare products for free?”"
      },
      {
        "paragraph": "“Heh, that’s true. ” Stunned at her words, Shaun laughed."
      },
      {
        "paragraph": "“Besides… for some reason, I feel very close to Eliza when I see her.” Catherine suddenly said. “\nAlthough we only met this afternoon, every time our eyes meet, I feel like I’ve known her for a long time.”"
      },
      {
        "paragraph": "“Cathy, I’ll get jealous if you say that.” Shaun frowned, looking jealous. “Tell me honestly. Did you… have\na sense of familiarity with me when we first met? As if I was the perfect man for you, and you knew that\nyou would be with me forever.”"
      },
      {
        "paragraph": "Catherine spat out the wine in her mouth. She was going to laugh herself to death because of Shaun."
      },
      {
        "paragraph": "Be with him forever? Where did he learn stuff like that?"
      },
      {
        "paragraph": "“What are you laughing at? I’m serious.” Shaun gritted his teeth and said shamelessly."
      },
      {
        "paragraph": "When Catherine was done laughing, her lips curled. “Then let me ask you. Did you feel that way when\nyou first saw me?”"
      },
      {
        "paragraph": "“My memory was tampered with by Sarah. But if I still remember, I would definitely have had that feeling,\n” Shaun said brazenly."
      },
      {
        "paragraph": "“Forget it. The first time you saw me, you thought I was a lunatic, and the first time I saw you, I took you\nas my prey.” Catherine then leaned into his ear. Since she had drunk a little wine, her head was a little\nwarm, and she nibbled on his earlobe gently."
      }
    ]
  },
  {
    "title": "Chapter 1346 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "The string in Shaun’s mind snapped with a ‘buzz’."
      },
      {
        "paragraph": "He pulled Catherine into his chest as hard as he could."
      },
      {
        "paragraph": "“What are you doing? Let go.” Catherine struggled. After all, they were in a public space. What if the\nwaiter came in?"
      },
      {
        "paragraph": "“What do you think I’m doing? Since you provoked me, you’d have to take responsibility.” Shaun laughed\nwith his husky voice and lowered his head to seal her mouth with a kiss."
      },
      {
        "paragraph": "Catherine leaned in his arms. She felt very comfortable."
      },
      {
        "paragraph": "After some time, she heard Shaun vaguely say, “ I still like it when we have dinner alone. It’s too noisy\nwhen there are many people around.”"
      },
      {
        "paragraph": "“Yeah…”"
      },
      {
        "paragraph": "On the esplanade."
      },
      {
        "paragraph": "Freya did not drive since she came in Catherine’s car, and although there was a lot of traffic here, most\nof them were private cars."
      },
      {
        "paragraph": "Hence, she took out her phone and tried to call for a taxi."
      },
      {
        "paragraph": "Unbeknownst to her, at the entrance of another private restaurant building next to hers, a handsome\nyoung man was walking into his car. He was just about to drive away when he saw a glimpse of his first\nlove."
      },

      {
        "paragraph": "Under the dim moonlight, Freya was wearing a blue denim dress. Her long hair was in curly waves, her\nfigure was curvy, and her defined face was looking down slightly at her phone. Just by looking at her\nprofile, he could already see how charming she was."
      },
      {
        "paragraph": "Patrick’s breath stopped."
      },
      {
        "paragraph": "The last time he saw her was a few months ago at the airport, where she had two children with her.\nThen, after Catherine and Shaun’s matter came to light, he learned that the children were Catherine and\nShaun’s."
      },
      {
        "paragraph": "Later, he learned that she was the world’s youngest and most promising cosmetic chemist. Each one of\nher formulas was worth hundreds of millions."
      },
      {
        "paragraph": "Even later on, he heard that she was engaged after spending a night with Rodney, but it did not take long\nfor Rodney to abandon her for Sarah."
      },
      {
        "paragraph": "At that time, he did think about calling her and comforting her, but she was soon adopted by Nathan\nSnow."
      },
      {
        "paragraph": "Now, she was the goddaughter of the future prime minister. Her status was high up in the clouds, and\nshe was already a world away from him."
      },
      {
        "paragraph": "However, when he saw Freya’s familiar figure, he still could not resist the impulse to drive the car over."
      },
      {
        "paragraph": "Freya did not expect the car she had booked to arrive so quickly. She opened the door and got into the\nback seat. “Brighton Gardens, please.”"
      },
      {
        "paragraph": "Patrick tightened his grip on the steering wheel. It was his first time in the capital, so he did not know the\nroads here very well. All he could do was open the navigation app and enter the address of Brighton\nGardens."
      },
      {
        "paragraph": "When the navigation started, he quickly drove away."
      },
      {
        "paragraph": "Through the rearview mirror, he quietly looked at the woman in the back seat."
      },
      {
        "paragraph": "She did not seem to recognize him, but it had been three years. Three years since he was alone with her\nin such close quarters."
      },
      {
        "paragraph": "The scent on her was still the same as before. He could not help but think that if Linda not gotten injured\nthat year, and he made it in time to meet with Freya’s parent, maybe they would have gotten married\nlong ago. They might even have children already."
      },
      {
        "paragraph": "However, fate took a turn, and everything went in an unknown direction."
      },
      {
        "paragraph": "The car drove for three minutes before Freya’s phone rang, and the voice of the driver from the ride-\nhailing app sounded. “Miss, I’ve arrived at the location. Why can’t I see you?”"
      },
      {
        "paragraph": "“What” Freya was stunned. “I just got into a white car. That wasn’t yours?”"
      }
    ]
  },

  {
    "title": "Chapter 1347 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Lady, you got in the wrong car. I just arrived.” The driver wanted to cry."
      },
      {
        "paragraph": "“I’m so sorry, ” Freya immediately apologized. “I might have gotten into the wrong car. Tell you what, I’ll\ncancel the order so it won’t affect your credibility.”"
      },
      {
        "paragraph": "“Thank you so much.”"
      },
      {
        "paragraph": "“It’s okay, it was my fault.” Freya hung up the phone and hurriedly grabbed the driver in front. “ Mister,\nsorry, but I took the wrong car. Did you pick up the wrong person?”"
      },
      {
        "paragraph": "“No.”"
      },
      {
        "paragraph": "At the familiar man’s voice, Patrick turned around to reveal his handsome and elegant face."
      },
      {
        "paragraph": "Freya’s mind went blank for a few seconds. Her whole person seemed to be drenched with cold water,\nand her body was cold. “Why is it you?”"
      },
      {
        "paragraph": "“I ate there and just so happened to see you when I came out.” Patrick quickly turned back and focused\non driving. “ I drove over and you got in, as if you took me for a ride-hailing app driver.”"
      },
      {
        "paragraph": "Freya saw the Porsche logo on his steering wheel. She actually took the Porsche as a ridesharing car."
      },
      {
        "paragraph": "“ Sorry, let me off at the curb,” Freya said faintly."
      },
      {
        "paragraph": "“It’s fine. It’s not that far. I’ll drop you off in ten minutes or so,” Patrick said in a warm voice."
      },
      {
        "paragraph": "Freya looked at the back of his head and said stubbornly, “No need. We’re not close, so I don’t need you\nto send me back.”"
      },

      {
        "paragraph": "“Freya…” Patrick’s low voice was tinged with a touch of embarrassment. “It’s been so many years. Even\nif we broke up, we don’t have to be enemies. We’re still schoolmates, at least. Why do you… have to be\nlike this?”"
      },
      {
        "paragraph": "Why did she have to be like this?"
      },
      {
        "paragraph": "Freya was a little bitter. Why was she like what?"
      },
      {
        "paragraph": "Patrick’s place in her heart was different from Rodney’s."
      },
      {
        "paragraph": "The former was a man she loved deeply and later hated and was disappointed with. Even if they broke\nup and she no longer loved him, her heart could not be completely indifferent."
      },
      {
        "paragraph": "He could reignite her emotions with a casual remark."
      },
      {
        "paragraph": "Especially with her current pregnancy, she lived in a depressing and unhappy state."
      },
      {
        "paragraph": "“Patrick Jackson, I don’t want to see you. I get disgusted every time I see you, so I don’t want to sit in\nyour car, understand?” Freya said bluntly."
      },
      {
        "paragraph": "If Linda had not tipped Rebecca off about Freya getting the paternity test done in Melbourne, Rebecca\nwould not have noticed, and Charity would not have been framed."
      },
      {
        "paragraph": "In these three years, how many times had she hated Linda? How many times had she hated herself for\nhaving loved this man?"
      },
      {
        "paragraph": "“ I’ m disgusting?” Patrick’s arm trembled.” How many times do you want me to say it? When I was with\nyou, there really was nothing between Linda and me. Freya, if you weren’t so stubborn back then, we\nwouldn’t have ended up like this.”"
      },
      {
        "paragraph": "“So what if we ended up like this? I’m quite happy now, ” Freya said coldly."
      },
      {
        "paragraph": "“Freya, other people might not know, but I get you. You’re not the kind of person who’s greedy for power\nand wealth. The Lynch family is good, and the conditions they created for you from childhood made it so\nyou never lacked material things."
      },
      {
        "paragraph": "Everyone envied that you became the Prime Minister’s goddaughter, but I think that’s not what you\nwanted. It only happened because the Snow family owes you, because Rodney wanted to be with\nSarah.”"
      },
      {
        "paragraph": "Patrick’s words were full of regret, but they hit the nail on the head."
      },
      {
        "paragraph": "Freya’s body tensed in embarrassment."
      },
      {
        "paragraph": "What was more embarrassing than trying to keep herself bright and beautiful, but getting pried open by\nthe man she once abandoned?"
      },
      {
        "paragraph": "“Freya, you shouldn’t have come to Canberra in the first place, ” Patrick’s tone was bitter."
      }
    ]
  },
  {
    "title": "Chapter 1348 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Freya closed her eyes."
      },
      {
        "paragraph": "Should she not have come to Canberra?"
      },
      {
        "paragraph": "No, she did not regret it. Despite having experienced so much, if she had not been here, Catherine\nwould have faced so many things alone. How helpless and desperate would Catherine be?"
      },
      {
        "paragraph": "Fortunately, she was there. In those three years abroad, while begrudging her life at that point of time,\nshe drove her career to its peak out of spite."
      },
      {
        "paragraph": "“You’re wrong. I don’t regret it. I don’t want to be that stupid woman from three years ago that had no\ndream and no ambition in Melbourne, and only knew how to wait by your side foolishly.”"
      },
      {
        "paragraph": "“Freya, you still haven’t let go of the past…” Patrick spoke with a little tremor in his voice."
      },
      {
        "paragraph": "Why else would she still be resenting the past?"
      },
      {
        "paragraph": "It was because she could not let go. That was why she could not take things lightly."
      },
      {
        "paragraph": "That was Patrick’s perception."
      },
      {
        "paragraph": "“President Jackson, if you want to send me back, please stop talking. If you didn’t keep driving, I\nwould’ve gotten out a long time ago.” Freya was extremely annoyed."
      },
      {
        "paragraph": "Why was she so unlucky today? First, she argued with Rodney, then she argued with Chester. After\nfinally leaving, she encountered Patrick instead."
      },
      {
        "paragraph": "Patrick’s neat eyebrows frowned tightly. He wanted to say something, but was afraid that he might really\ndrive her out of the car."
      },

      {
        "paragraph": "He subconsciously drove slower."
      },
      {
        "paragraph": "Then, his phone rang. It was from Linda."
      },
      {
        "paragraph": "In his panic, he subconsciously muted it and threw it aside."
      },
      {
        "paragraph": "“If you don’t answer, aren’t you afraid your dear Linda would assume nonsense?” Freya mocked with a\nsmile."
      },
      {
        "paragraph": "“No, it was from the insurance company. ” Patrick lied and denied it."
      },
      {
        "paragraph": "Freya could not be bothered to expose him."
      },
      {
        "paragraph": "As they arrived at the entrance of Brighton Gardens, she got out straight away."
      },
      {
        "paragraph": "“Freya…” Patrick got down from the car immediately. In a daze, he looked at how close she was and felt\nlike there was a knife in his heart."
      },
      {
        "paragraph": "The two of them stood so close together, but their hearts were so far away."
      },
      {
        "paragraph": "Freya looked up, her beautiful eyes bright and flickering."
      },
      {
        "paragraph": "“Freya… I came to the capital to open a branch and will be here most of the time. ” Patrick took out a\nbusiness card from his pocket and handed it over. “ This is my number.”"
      },
      {
        "paragraph": "Freya extended two slender fingers and took it, flipping it. “Linda followed too, didn’t she?”"
      },
      {
        "paragraph": "Patrick’s handsome face stiffened. “Freya, Linda is innocent, so don’t hate her. These years, it’s because\nshe stayed with me and encouraged me"
      },
      {
        "paragraph": "that I was able to step out of our relationship in the past.”"
      },
      {
        "paragraph": "Freya felt like she heard a joke and snickered. “ You’re part of the reason why I hate her, but it’s none of\nyour business that I hate her. If you want to come, sure. I’ll take my time playing with you.”"
      },
      {
        "paragraph": "“What does that mean?” Patrick’s expression changed."
      },
      {
        "paragraph": "Freya smiled. “ If you didn’t appear in front of me again, I wouldn’t remember that I had a debt to settle\nwith her. Linda is mostly protected by you, so I can only deal with you first.”"
      },
      {
        "paragraph": "“Freya… ” Patrick’s voice lowered. “What are you planning?”"
      },
      {
        "paragraph": "“You want to expand the Jackson Corporation, right? Dream on. As long as I’m around, you’ll never\nsucceed. Believe me, with my current ability, suppressing you is as easy as crushing an ant.” Freya put\nhis business card in her bag."
      },
      {
        "paragraph": "This card had Patrick’s company name and phone number and she did not even have to look it up."
      },
      {
        "paragraph": "She turned to leave."
      },
      {
        "paragraph": "Patrick grabbed her anxiously. “If you want something, then take it out on me. There’s no need to harm\nLinda. She’s innocent.”"
      },
      {
        "paragraph": "“ If you love her so much, then go be a knight and protect her forever.” Freya smiled coldly."
      }
    ]
  },
  {
    "title": "Chapter 1349 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Patrick looked at her beautiful face in a daze, and anger erupted in his eyes. “Freya Lynch, it’s been\nthree years, but you haven’t changed at all. Instead, you’ve become even more vicious. No wonder\nRodney doesn’t want you either.”"
      },
      {
        "paragraph": "“Three years, but you’re still so stupid.”"
      },
      {
        "paragraph": "Freya clenched her fists. “Go ahead and scold me, but the more you scold me, the deeper the price\nyou’ll pay.”"
      },
      {
        "paragraph": "She slapped Patrick’s hand away and turned to enter the neighborhood without looking back."
      },
      {
        "paragraph": "She did not know how long she walked until there was finally no one around."
      },
      {
        "paragraph": "Only then did tears finally streamed down from her eyes."
      },
      {
        "paragraph": "Maybe it was because she was pregnant and sentimental, but Patrick’s words hurt her."
      },
      {
        "paragraph": "In Patrick’s eyes, she could never be compared to Linda."
      },
      {
        "paragraph": "Linda was the kindest woman, while she was the most vicious."
      },
      {
        "paragraph": "However, just what did she do wrong?"
      },
      {
        "paragraph": "She was always the one getting hurt, but no one ever felt sorry for her."
      },
      {
        "paragraph": "No one knew how lonely she was when she stood high in the clouds."
      },
      {
        "paragraph": "“Freya, why didn’t you wait for me…”"
      },

      {
        "paragraph": "Rodney, who was waiting at the door of her unit building, saw her figure and immediately walked up to\nher. When he saw her face streaked with tears, he was stunned for a moment and did not know what to\ndo. He had never seen Freya cry like this before. It made him feel unbearably… distressed."
      },
      {
        "paragraph": "“Why… Why are you crying?”"
      },
      {
        "paragraph": "Freya did not expect him to come out of nowhere. She wiped away her tears immediately with the back\nof her hand and walked into the building with her head down."
      },
      {
        "paragraph": "Rodney was lost in thought for two seconds before running after her. “ Is it because Chester went too far\njust now? I’m sorry. I was wrong too. Eliza is your friend. You can do whatever you want, so don’t be\nangry. Don’t cry, okay? It’s not good for the baby"
      },
      {
        "paragraph": "if you cry too much…” “Go away.”"
      },
      {
        "paragraph": "Freya could not help but scream at him."
      },
      {
        "paragraph": "Patrick’s last sentence of “No wonder Rodney doesn’t want you either” completely hurt her self- esteem\nand the sight of Rodney made her angry."
      },
      {
        "paragraph": "She could not control her tears."
      },
      {
        "paragraph": "“Why am I so unlucky? You’re all a bunch of sh*tty men. Go to hell.”"
      },
      {
        "paragraph": "Rodney was so frightened he frantically tried to look for tissues, but he found that he did not bring any, so\nhe could only anxiously say, “Don’t cry."
      },
      {
        "paragraph": "Stop crying already. It’s not good to cry…”"
      },
      {
        "paragraph": "He flip-flopped between those few words. His mouth was really stupid, and he did not know how to coax\na woman."
      },
      {
        "paragraph": "“My mom says that it’s easy to become old and ugly if you cry…”"
      },
      {
        "paragraph": "“Rodney Snow, if you don’t know how to talk, then shut your f*cking mouth. No one will think you’re\nmute.”"
      },
      {
        "paragraph": "Freya was furious and grabbed her bag to smash it o n him."
      },
      {
        "paragraph": "If it was before, Rodney would definitely have pushed her back, but after seeing her cry so hard tonight,\ncoupled with the fact that she was pregnant, he shrank away and said, “Go ahead. Hit me. Take it out on\nme if you’re in a bad mood. Just don’t cry.”"
      },
      {
        "paragraph": "“B*stard.” Freya was tired from hitting him, and the anger that had been repressed in her chest was\nfinally vented."
      },
      {
        "paragraph": "She sniffled hard. When she thought of how Rodney saw her crying, she felt embarrassed and rushed\ninto the elevator with her head down."
      },
      {
        "paragraph": "Rodney snuck in immediately. He saw that her eyes and nose were red and swollen from crying, making\nher look like a little rabbit, and his heart clenched."
      },
      {
        "paragraph": "It was his first time seeing the sharp-tongued Freya like this."
      },
      {
        "paragraph": "“Go away. Get out,” Freya pushed him."
      },
      {
        "paragraph": "“No. ” Rodney shrank in the corner of the elevator so she could not push him out no matter what."
      }
    ]
  }
]