[


  {
    "title": "Chapter 900 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Eldest Young Master Hill, you should forget about Miss Jones and go your separate ways.” Hadley\nsighed in his heart. He had warned Eldest Young Master Hill that night, but unfortunately, he did not\nlisten. Eldest Young Master Hill believed Sarah too much."
      },
      {
        "paragraph": "He regretted it now, but there was no medicine for regret in the world."
      },
      {
        "paragraph": "“Forget her?” Shaun suddenly looked up, getting u p and grabbing Hadley’s collar. He looked like a lion\nthat was about to collapse. “How am I supposed to forget her?! ”"
      },
      {
        "paragraph": "“When you helped Ms. Neeson with her lawsuit, haven’t you already stopped thinking about a future with\nMiss Jones? In that case, you should’ve been mentally prepared a long time ago, ” Hadley reminded\nhim."
      },
      {
        "paragraph": "Shaun froze. Hadley’s voice was like a fierce slap on his face."
      },
      {
        "paragraph": "Yes, he had decided not to love Catherine anymore before, so why could he not let her go now? Why did"
      },
      {
        "paragraph": "he feel like thousands of ants were gnawing on his heart?"
      },
      {
        "paragraph": "Hadley continued, “Do you feel sorry for Miss Jones? But to her, the best apology is to stop disturbing\nher. She’s right. If she weren’t close to you, maybe she wouldn’t have gotten hurt so much.”"
      },
      {
        "paragraph": "“Hadley… ” Shaun glared at him. He never thought that Hadley would have the courage to say such a\nthing to him."
      },
      {
        "paragraph": "“Eldest Young Master Hill, you should forget about Miss Jones and go your separate ways.” Hadley\nsighed in his heart. He had warned Eldest Young Master Hill that night, but unfortunately, he did not\nlisten. Eldest Young Master Hill believed Sarah too much."
      },
      {
        "paragraph": "“Eldest Young Master Hill, I’m sorry. I might have overstepped with my words today.” Hadley smiled\nbitterly. “As a bystander, I think that Miss Jones is too pitiful. Before you divorced her, you let Yael\nundress her in front of Irving and the others. You managed to deal with Yael and made Miss Jones feel a\nlittle touched, but this kidnapping incident has ruined her hope. You asked her to forgive you, but how will\nshe face Logan and his missing finger in the future?”"
      },
      {
        "paragraph": "“Yes, she told me herself that a finger can’t grow back.”"
      },
      {
        "paragraph": "Shaun smiled sadly as he stumbled back two steps. He turned to leave."
      },
      {
        "paragraph": "“Eldest Young Master Hill…” Hadley wanted to chase after him."
      },
      {
        "paragraph": "Shaun said wearily, “Go. I want some quiet time alone.”"
      },
      {
        "paragraph": "In the sports car, Freya shouted excitedly, “Cathy, do you think Shaun Hill will doubt Sarah this time?”"
      },
      {
        "paragraph": "“I’m not sure, but I think Sarah will try everything to clear herself of suspicion.” Catherine never dared to\nunderestimate Sarah."
      },
      {
        "paragraph": "“That’s true. I thought you completely won Shaun over the last time, but who would’ve expected her to\ncome up with a kidnapping case?”"
      },
      {
        "paragraph": "Freya clicked her tongue. “Shaun is definitely regretting it right now. I think he’ll come looking for you\nagain. You didn’t see his face when we left the court. The remorse and sadness in his eyes…"
      },
      {
        "paragraph": "Hehe, how satisfying.”"
      },
      {
        "paragraph": "“Unfortunately, no matter how satisfying it is, Logan’s finger is still gone.” Catherine could not help but lift\nher beautiful and slender fingers."
      },
      {
        "paragraph": "When Freya saw this, her heart was struck by sadness. “It’s okay. Sooner or later, we’ll deal with Sarah\nand her brother.”"
      },
      {
        "paragraph": "“You should be careful,” Catherine reminded her,“ Sarah can be a lunatic. She even attempted suicide in\norder to gain Shaun’s trust. This kind of woman is terrifying.”"
      },
      {
        "paragraph": "“Yeah, I’ll watch out.”"
      },
      {
        "paragraph": "Freya saw Wesley’s handsome figure standing outside Hackett Institute from a distance. “ Have you\nreally decided to marry Wesley?”"
      },
      {
        "paragraph": "“Yeah, he’s really good to me. I don’t want to let him down anymore.” Catherine looked at the figure and\nher eyes shone with a gentle light."
      },
      {
        "paragraph": "Freya was stunned. She could feel that after this incident, Catherine was really treating Wesley\ndifferently. In the past, she often resisted when they walked together, but now, she no longer was."
      },
      {
        "paragraph": "Wesley had gained an advantage this time, right?"
      },
      {
        "paragraph": "“Well, that’s good. Men like him are really rare. But if Shaun finds out, will he threaten you to separate\nlike before?” Freya asked worriedly."
      },
      {
        "paragraph": "“That’s why I’m not going to make it public. At least, not until we register.” Catherine smiled faintly."
      }
    ]
  },
  {
    "title": "Chapter 901 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“That’s a good idea. Then, I’ll wait to be your bridesmaid. I’ve been waiting for this day for a long time.”\nFreya was sincerely happy for Catherine."
      },
      {
        "paragraph": "Catherine was stunned."
      },
      {
        "paragraph": "Yes, she was married before but she never had a wedding."
      },
      {
        "paragraph": "Thinking about it, she really was quite pitiful. “Okay, then be prepared to be a bridesmaid.”"
      },
      {
        "paragraph": "The car stopped in front of Wesley, and Catherine got out."
      },
      {
        "paragraph": "“I heard you won.” Wesley smiled and took her hand naturally."
      },
      {
        "paragraph": "“Yeah. It’s thanks to the evidence you gave me. ” Catherine looked up at him. “I’ll cook for you tonight to\ncelebrate?”"
      },
      {
        "paragraph": "“Of course, we have to celebrate.” Wesley lifted her hand and took out a diamond ring from his pocket,\nputting it on for her. “But such beautiful fingers are meant to wear diamond rings. Let me do the"
      },
      {
        "paragraph": "cooking instead.”"
      },
      {
        "paragraph": "Catherine looked at the large diamond ring on her middle finger and was stunned. “This is…?”"
      },
      {
        "paragraph": "“Are you willing?” Wesley looked at her seriously. “ I don’t want to be engaged this time. Can we get\nmarried straight away?”"
      },
      {
        "paragraph": "“That’s a good idea. Then, I’ll wait to be your bridesmaid. I’ve been waiting for this day for a long time.”\nFreya was sincerely happy for Catherine."
      },
      {
        "paragraph": "Catherine was slightly stunned. Although she had mentioned marriage to Freya in the car earlier, she did\nnot expect him to propose so soon."
      },
      {
        "paragraph": "“I’m sorry, I seem to have scared you.” Wesley smiled helplessly. “I’m really afraid that you’ll run away\nagain.”"
      },
      {
        "paragraph": "“I won’t.” Catherine put down her hand and smiled. “Okay, I agree.”"
      },
      {
        "paragraph": "“Really?” Wesley was surprised, but there was a happy smile on his elegant and handsome face."
      },
      {
        "paragraph": "“Of course.” Catherine paused and hesitated before saying, “But I hope we won’t make it public for the\ntime being. After all, you know that Shaun is extremely powerful and selfish. I’m afraid that he might try to\nstop it if he knows that we’re together. Let’s wait until after the wedding.”"
      },
      {
        "paragraph": "“That’s what I was thinking too. It’s better to announce it after you have a baby,” Wesley said teasingly."
      },
      {
        "paragraph": "Catherine was stunned and suddenly thought of Lucas and Suzie."
      },
      {
        "paragraph": "“Don’t get me wrong.” Wesley guessed what she was thinking. “I’ll treat Lucas and Suzie like my own,\nbut I like children. Of course, it’s fine if you don’t want to…”"
      },
      {
        "paragraph": "“No, if we get married, I’ll definitely have your children. Otherwise, it’ll be unfair to you.” Catherine smiled.\nShe was not that selfish."
      },
      {
        "paragraph": "“Cathy, thank you. I’ll still listen to you. As long as it’s your children, I’ll like them all the same.” Wesley\nsmiled and held her hand. “Let’s go to the kitchen at my place. I’m worried that Shaun will come here.”"
      },
      {
        "paragraph": "“Yeah, I also plan to move to my dad’s place first. A t least I can accompany Lucas every day in the\nfuture.”"
      },
      {
        "paragraph": "She used to live here purely for the convenience of seducing Shaun, but now that she no longer had that\nthought, there was no need for her to continue living here."
      },
      {
        "paragraph": "Moreover, she was quite apologetic for having neglected Lucas during this period of time."
      },
      {
        "paragraph": "”Okay, I’ll help you move tomorrow.” Wesley held her hand to the car."
      }
    ]
  },
  {
    "title": "Chapter 902 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Late at night in the clubhouse."
      },
      {
        "paragraph": "When Chester finally found Shaun, he was already drunk. However, the man was still holding a bottle o f\nliquor in his hand and pouring the contents into his mouth."
      },
      {
        "paragraph": "“Stop drinking. Your stomach won’t be able to stand it.” Chester took away the bottle of wine."
      },
      {
        "paragraph": "“Give me the bottle!” Shaun’s drunken eyes were slightly red. He patted his chest hard and his voice was\nhoarse. “Only the stomachache will make it so it doesn’t hurt as much here. I’m not a f*cking human.\nHow could I have… hurt her like that?”"
      },
      {
        "paragraph": "There was a complicated look in Chester’s eyes. Despite knowing Shaun for so long, it was the first time\nhe saw Shaun… crying."
      },
      {
        "paragraph": "He was really crying."
      },
      {
        "paragraph": "“Don’t say that.” Chester sat beside him and lit a cigarette. “No one expected Logan Law to be framed.”"
      },
      {
        "paragraph": "“Chester, do you think… this was all Sarah’s doing?” Shaun looked at him blankly. “I don’t want to\nsuspect her, but if she hadn’t said that she wanted Logan’s finger, I wouldn’t have chopped it off. If\nThomas hadn’t asked me to take on the lawsuit, I wouldn’t have appeared in court today. It’s because of\nall this that I can’t go back to Catherine.”"
      },
      {
        "paragraph": "“I don’t know either, but if it’s really Sarah, then the way she hides her true colors is too f*cking scary. I’m\nafraid not many people can scheme using death. But there really is no trace of those people. Sarah and\nThomas shouldn’t have such ability.”"
      },
      {
        "paragraph": "Late at night in the clubhouse."
      },
      {
        "paragraph": "Chester took a large breath. He also grew up with Sarah and thought of her as a younger sister in his\nheart. In his mind, she was simple, innocent, and kind."
      },
      {
        "paragraph": "However, all the things that had happened recently also made him begin to suspect that maybe Sarah\nhad changed."
      },
      {
        "paragraph": "“If it’s not her, then who is trying to use Logan to get Catherine and me to break up? Who would benefit\nfrom Catherine and me breaking up?” Shaun’s lips curved. He did not want to suspect Sarah either, but\nhe had to admit that it was possible that Sarah had planned this incident."
      },
      {
        "paragraph": "Even if it was not her, after the incident, the Neeson siblings had deliberately fanned the flames to\nworsen the conflict between him and Catherine."
      },
      {
        "paragraph": "Unfortunately, he was not rational enough to think about it then because he sympathized with Sarah too\nmuch."
      },
      {
        "paragraph": "“The spectators see the chess game better than the players.” Shaun smiled bitterly. “Before, I didn’t\nunderstand why Grandpa Derek wanted to hold Rodney back. Maybe it’s because he could see it more\nclearly than we do.”"
      },
      {
        "paragraph": "“Yes, if Rodney had been around, with his temper, Logan… might have lost his life.” Chester’s heart got\ncolder the more he thought about it."
      },
      {
        "paragraph": "It seemed as if there was a force behind this manipulation. The three of them were usually good at\nstrategizing and planning, but it seemed that they were always unable to stay calm when Sarah was\ninvolved. Thinking about it, it was too terrifying."
      },
      {
        "paragraph": "“Chester, in the future… stay away from Sarah.” Shaun felt cold inside. “Whether or not this has anything\nto do with her, I feel that she’s not that simple.”"
      },
      {
        "paragraph": "“That’s something you should tell yourself. You’re the one who has the deepest ties to her. ” Chester\nshook his head. “As for Rodney, he’ll probably never believe it.”"
      },
      {
        "paragraph": "“That’s up to him, but… In the future, I won’t let Rodney harm Cathy anymore…” After Shaun spoke, he\nsmiled sadly. “Forget it. The one who has hurt her the most is me.”"
      },
      {
        "paragraph": "“Shaun, let go. Don’t look for her anymore.” Chester suddenly felt that he had gone too overboard with\nCatherine. Although he had not caused trouble for her like Rodney, he had thought that she was a\nvicious woman in his heart."
      },
      {
        "paragraph": "Especially when Catherine got close to Charity. He disliked Catherine even more then and thought that\nbirds of a feather flock together."
      },
      {
        "paragraph": "Thinking about it now, he had gone too far."
      },
      {
        "paragraph": "“No, I’m going to beg for her forgiveness. ” Shaun grabbed the bottle and drank until his stomach could\nno longer endure the severe pain. He rushed to the washroom and vomited heavily. There was even\nblood mixed in the bile."
      },
      {
        "paragraph": "“Sh*t.”"
      },
      {
        "paragraph": "Chester let out a low curse and hurriedly sent him to the hospital."
      },
      {
        "paragraph": "The doctor diagnosed it as gastrointestinal perforation and said immediate surgery was required."
      }
    ]
  },
  {
    "title": "Chapter 903 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "However, before the surgery…"
      },
      {
        "paragraph": "Shaun gritted his teeth and endured the severe pain, tossing his phone to Chester. “Find Catherine’s\nnumber. Call her with your phone.”"
      },
      {
        "paragraph": "They were brothers for many years, so Chester immediately knew what Shaun was thinking of. However,\nhe felt that Catherine would not come. Even so, looking at how Shaun’s handsome face had become\npale, he could not help but call Catherine o n his phone."
      },
      {
        "paragraph": "“Hello.” A soft female voice sounded."
      },
      {
        "paragraph": "Chester cleared his throat. “This is Chester. Shaun drank too much and got a hole in his stomach. He\nneeds to undergo surgery— ”"
      },
      {
        "paragraph": "“I’m not a doctor,” Catherine interrupted him directly and coldly."
      },
      {
        "paragraph": "“He vomited blood.” Chester smiled bitterly. “ Shaun is very regretful now. I’ve never seen him suffer so\nmuch. Can you come over? He really needs you.”"
      },
      {
        "paragraph": "“You’ve called the wrong person. I think the one he needs is Sarah. Don’t call me again. Even if he dies,\nthere’s no need to inform me and get me to send flowers. After all, flowers cost money. I don’t want to\nwaste a single cent on a person like him.”"
      },
      {
        "paragraph": "Catherine hung up the call directly."
      },
      {
        "paragraph": "However, before the surgery…"
      },
      {
        "paragraph": "The call had been on speaker. Shaun was currently lying on the hospital bed, about to faint from the\npain. When he heard the conversation, the slight hope in his eyes gradually extinguished, replaced with\nendless darkness and misery."
      },
      {
        "paragraph": "The hole in his stomach hurt, but it was not as painful as the sting caused by the coldness of her words."
      },
      {
        "paragraph": "Chester sighed and asked the doctor to push him in for surgery."
      },
      {
        "paragraph": "In the Yule family’s villa."
      },
      {
        "paragraph": "Catherine casually tossed the phone aside with an indifferent face. It showed no emotions at all."
      },
      {
        "paragraph": "He thought that her heart would ache just because there was a hole in his stomach? Did he think that\nshe would rush over in the middle of the night?"
      },
      {
        "paragraph": "He really thought of her as a woman who was worried about him."
      },
      {
        "paragraph": "Not anymore."
      },
      {
        "paragraph": "“Mommy, did something happen to Shaun?” Lying in bed, Lucas dazedly opened his eyes."
      },
      {
        "paragraph": "“Yeah, are you worried about it?” Catherine asked in a low voice."
      },
      {
        "paragraph": "“No. What’s that saying? Good things never last, bad things never die. He won’t die that easily,” Lucas\nsaid faintly."
      },
      {
        "paragraph": "Catherine snorted a laugh. “That’s right, darling. Go to bed early. Mommy hasn’t rested for several days\nnow.”"
      },
      {
        "paragraph": "“Mm.” Lucas looked at his mommy’s sleeping face and narrowed his eyes."
      },
      {
        "paragraph": "Even if Mommy did not care, he would give back the hurt that Mommy suffered today a thousand times"
      },
      {
        "paragraph": "… to his so-called father."
      },
      {
        "paragraph": "At the same time."
      },
      {
        "paragraph": "Sarah kept calling Shaun but he did not answer. The reply she got was an automated voice telling her\nthat his phone was turned off."
      },
      {
        "paragraph": "She called Chester, but he did not answer as well. Her calls to Rodney were also left unconnected."
      },
      {
        "paragraph": "She lost her temper in the villa and screamed in anger."
      },
      {
        "paragraph": "She never expected that in just one night, the three young masters in the capital would all not answer her\ncalls. After all, in the past, the three of them had cradled her in the palms of their hands."
      }
    ]
  },
  {
    "title": "Chapter 904 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Thomas was anxious. “Sarah, what should we do? If they ignore us in the future, it’ll be too difficult for us\nto gain a foothold in the capital.”"
      },
      {
        "paragraph": "“Shaun is just acting in a fit of anger and won’t leave me. Besides, Rodney is only temporarily locked up.\nThe Snow family can’t lock him up for the rest of his life, ” Sarah gritted her teeth and said."
      },
      {
        "paragraph": "“Ugh, I thought you could use this opportunity to get back together with Eldest Young Master Hill, but you\njust barely missed it. Who would’ve"
      },
      {
        "paragraph": "thought that Catherine would actually win the case?” Thomas carefully looked askance at her. “ Sarah,\nthose two kidnappers were hired by you, right?”"
      },
      {
        "paragraph": "“Don’t talk nonsense. I didn’t do anything.” Sarah glared at him fiercely. “Go back.”"
      },
      {
        "paragraph": "“Fine.” Thomas shrugged. She denied it, but he did not believe her."
      },
      {
        "paragraph": "After Thomas left, Sarah immediately dialed a number angrily. “Aren’t your people too careless? It was\nthe same with Lucifer’s case before. This"
      },
      {
        "paragraph": "time, there was surveillance footage left after kidnapping me, and even the fingerprints in the car weren’t\ncleaned. Logan Law should’ve been done for, but the court ended up declaring him innocent. Even\nShaun is suspecting me now. You’re going to get me killed.”"
      },
      {
        "paragraph": "“Get you killed?”"
      },
      {
        "paragraph": "Thomas was anxious. “Sarah, what should we do? If they ignore us in the future, it’ll be too difficult for us\nto gain a foothold in the capital.”"
      },
      {
        "paragraph": "The man on the other end let out a low laugh. “ Since you came up with that vicious scheme, you\nshould’ve been prepared to bear the worst consequences. The kidnapping was done at your whim, and I\nalready carried it out seamlessly even though you only gave me less than half a day to plan. Why didn’t\nyou make these things clear beforehand? I deleted all the surveillance footage in accordance with your\ninstructions, but I can’t dismantle all the dashcams in the cars in the community.”"
      },
      {
        "paragraph": "“ If you had just destroyed the car, then everything would have worked out perfectly,” Sarah snapped at\nhim."
      },
      {
        "paragraph": "“Are you stupid? How would Shaun Hill have found you in the shortest time possible if the car was\ndestroyed? Logan Law was really injected with drugs. If Shaun hadn’t arrived within the time we planned,\nyou would’ve really been assaulted by Logan, ” the man scolded coldly. Sarah was speechless for a\nmoment."
      },
      {
        "paragraph": "Then, he said, “Sarah Neeson, I’ve helped you twice but apparently, you’re still incapable of returning t o\nShaun Hill. Don’t come to me again. You’re of no use to me— ”"
      },
      {
        "paragraph": "“How am I of no use? Even if Shaun doesn’t intend to marry me, Rodney is still devoted to me. Once his\nuncles will become the prime minister next year. By then, the Snow family’s status will naturally rise as\nwell.”"
      },
      {
        "paragraph": "Sarah said hurriedly. If the three young masters were no longer reliable, she had to make sure she kept\na strong grip on this helper."
      },
      {
        "paragraph": "“Besides, haven’t you always liked Catherine Jones? This time, she and Shaun have turned against\neach other. I’m afraid there’s no way for them to get back together. Your opportunity has come. You\nshould be thanking me, ” Sarah sneered."
      },
      {
        "paragraph": "The person laughed in a low voice. “Sarah Neeson, I’ve helped you twice. I really won’t help you again\nunless you can think of what value you can still bring to me. There’s no need to threaten me either. If this\nmatter is exposed, I’m afraid you’ll also lose the qualification to marry Rodney Snow. Besides,"
      },
      {
        "paragraph": "it’s very easy for me to make a powerless woman disappear.”"
      },
      {
        "paragraph": "The call ended with a beep and a chill filled Sarah’s heart."
      },
      {
        "paragraph": "In a villa in the city, Wesley stood in front of the floor-to-ceiling window with his phone."
      },
      {
        "paragraph": "The window in front of him reflected his slender and upright figure. His dark blue pajamas were wrapped\naround his body. His refined and handsome face gave off a dark and deep aura, which was very different\nfrom his gentle and elegant appearance during the day."
      },
      {
        "paragraph": "Soon, his phone rang, and another unfathomable voice sounded. “How are things going?”"
      },
      {
        "paragraph": "“Almost there, ” Wesley replied respectfully."
      },
      {
        "paragraph": "“Very good. The Hill family has stood on top for too long. It’s time for them to fall. I’ll be waiting for you,”\nthe person said happily, “You’ve done a good job recently. I’m very optimistic about you.”"
      },
      {
        "paragraph": "“Thank you.”"
      },
      {
        "paragraph": "After hanging up the phone, Wesley’s warm eyes showed hatred and resentment."
      },
      {
        "paragraph": "Shaun Hill. Soon, he would personally drag that man down!"
      },
      {
        "paragraph": "He would never forget how Shaun had humiliated him in the eyes of the public during Old Master Yule’s\nbirthday party, and he would never forget how cruelly the man had snatched Catherine away."
      },
      {
        "paragraph": "He had been laying low for three years."
      },
      {
        "paragraph": "However, he would sit in the top position of the country soon enough."
      }
    ]
  },
  {
    "title": "Chapter 905 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "Just as Catherine was making breakfast for Lucas, Joel suddenly got a call from Old Master Yule."
      },
      {
        "paragraph": "“Joel Yule, you actually sold the shares of the company. This is our Yules’ family business which our\nancestors left to us. Get to the company right now. Even if you can’t physically come here, you have to\ncrawl over, you wicked thing!”"
      },
      {
        "paragraph": "The old master scolded so loudly that even Catherine heard it in the kitchen."
      },
      {
        "paragraph": "“Dad…” She looked at Joel worriedly. “I guess Mr. Kawada went to the company.”"
      },
      {
        "paragraph": "“It’s fine. Since I had decided to sell them, I was already prepared to be scolded by your grandfather.”\nJoel smiled bitterly and helplessly."
      },
      {
        "paragraph": "“Grandpa is very angry now. I’m afraid he won’t just stop at scolding you.” Catherine frowned."
      },
      {
        "paragraph": "“The worst thing that can happen is that they expel me from the Yule family. I don’t care anymore.” Joel\ngave a long sigh."
      },
      {
        "paragraph": "“I’ve obeyed your grandparents all my life. Back then, it was them who insisted on me being with Nicola,\nwhich led to me separating from your mom. The fatherly love that should’ve belonged to you was all\ngiven to Melanie, but the most ridiculous thing is that Melanie isn’t even my daughter. Yet, your\ngrandparents still protect Damien and Melanie. I’ve had enough of this life.”"
      },
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "“Grandpa, you’re not alone. Mommy and I will be with you.” Lucas lifted his cute little face and comforted\nhim."
      },
      {
        "paragraph": "“You’re a good boy. In the future, everything Grandpa has will be for you, your mom, and Suzie.” Joel\nsmiled. “Thinking about it, I’m only in my 5os. I want to start another company.”"
      },
      {
        "paragraph": "“Dad, you’ll always have my support. ” Catherine smiled. “I’ll go with you to the company after breakfast.\nAfter all, I was the one who sold the shares. Mr. Kawada must have gone to the company in person. I\nhave to talk to him in person.”"
      },
      {
        "paragraph": "At 8:00 a.m., the father and daughter drove to Yule Corporation."
      },
      {
        "paragraph": "When the two walked into the company, all the employees cast odd and indignant glances at the"
      },
      {
        "paragraph": "“The person in charge of Yule Corporation might change soon. I wonder if we’ll still be called Yule\nCorporation.”"
      },
      {
        "paragraph": "“What does that mean? What are you guys talking about?”"
      },
      {
        "paragraph": "“My God, it’s such a big event but you still don’t know? Today, President Kawada from Delta Co. Ltd.\ncame to the company, saying that Joel Yule sold all his shares to him. President Kawada will be the\nbiggest shareholder in the future.”"
      },
      {
        "paragraph": "“Isn’t Delta Co. Ltd. from Japan? So our company is going to become a foreign-funded company in the\nfuture?”"
      },
      {
        "paragraph": "“Yeah. More importantly, it’s impossible for Old Master Yule to regain control of the company."
      },
      {
        "paragraph": "Kawada definitely won’t let him manage Yule Corporation. I’m guessing things in the upper management\nwill become turbulent.”"
      },
      {
        "paragraph": "“Joel Yule must be insane. Yule Corporation is the Yule family’s foundation.”"
      },
      {
        "paragraph": "“No kidding! All the shareholders are going mad with anger. Didn’t you see them rushing over this\nmorning? They’re all in the conference room now. ”"
      },
      {
        "paragraph": "Catherine completely ignored the employees’ chatter and walked directly into the conference room with\nJoel."
      },
      {
        "paragraph": "The conference room was noisy, and Old Master Yule was yelling at President Kawada, “In Yule\nCorporation, what I say, goes. Without my consent, he’s not qualified to sell his shares to anyone. You\ncan continue dreaming if you want to enter our company.”"
      },
      {
        "paragraph": "“Mr. Yule, don’t get worked up. Look, Miss Jones and Mr. Yule are here.” Mr. Kawada grinned. “It was\nMiss Jones who personally agreed to sell the shares to me. We even signed the transfer agreement and\nI’ve already remitted the money. If you back out now, I can sue you for fraud.”"
      }
    ]
  },
  {
    "title": "Chapter 906 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Catherine Jones, how could you do such a thing?”"
      },
      {
        "paragraph": "Melanie screamed at Catherine in anger. “ It took hundreds of years for our ancestors to develop Yule\nCorporation to where it is today, but you ended up selling it to someone from Japan. Aren’t you afraid\nthat our ancestors will crawl out of their graves to find you?”"
      },
      {
        "paragraph": "“Brother, you’re too muddle—headed. Were you encouraged by Catherine? Are you trying to make Mom\nand Dad die from anger? They gave you the company shares because they trusted you. If you didn’t\nwant them, you could’ve told us. We could have bought the shares in your hands as shareholders. Why\ndid you sell them to others?”"
      },
      {
        "paragraph": "Damien was so angry he wanted to vomit blood. He originally thought that by encouraging the old master\nto come back to the company, he would be able to come back as well and gain control of the company."
      },
      {
        "paragraph": "However, Joel actually sold the shares and Kawada joined. In the future, Kawada could control Yule\nCorporation however he wanted. “You b*tch!”"
      },
      {
        "paragraph": "Old Master Yue grabbed the cup in front of him and flung it at Catherine’s face."
      },
      {
        "paragraph": "However, it missed. Catherine moved her head and dodged the cup."
      },
      {
        "paragraph": "“I was wrong. I shouldn’t have accepted you back into the Yule family. I originally still had expectations\nfor you. What did I do in my past life to be so unlucky as to have a granddaughter like you?!"
      },
      {
        "paragraph": "“Make it clear to Mr. Kawada immediately. The agreement was signed by you and has nothing to do with\nyour father. It has nothing to do with Yule Corporation. I won’t acknowledge this contract. ”"
      },
      {
        "paragraph": "“Catherine Jones, how could you do such a thing?”"
      },
      {
        "paragraph": "Old Master Yule lost his temper and roared."
      },
      {
        "paragraph": "Catherine raised her brows. “Grandpa, didn’t you hear what Mr. Kawada said? If I deny it, I would have\ncommitted commercial fraud. I’d have to go to jail.”"
      },
      {
        "paragraph": "“It’s better for you to go to jail than for Yule Corporation’s shares to fall into the hands of a Japanese\nman,” Damien said in a deep voice, “ Brother, I advise you to persuade her well. I know I’ve let you down\nbefore, but in the end, we’re still brothers. No matter how much we fight, we’re still family. The company’s\nname is Yule. If you sell it, the company name might be changed in the future. Can you bear to see\nthat?”"
      },
      {
        "paragraph": "Another shareholder, Director Pan, immediately said, “Yes. Joel, you’ve worked in Yule Corporation for\ndecades. We’ve all worked hard to grow the company to what it is today. All of us think of Yule\nCorporation as our child. Think carefully. Don’t do something you’ll regret.”"
      },
      {
        "paragraph": "“Do you have to force me, your father, to kneel in front of you?” Old Master Yule cried out pleadingly."
      },
      {
        "paragraph": "“Dad, I’m sorry. Catherine is my daughter. I can’t let her go to jail.” Joel let out a long sigh."
      },
      {
        "paragraph": "“You…”"
      },
      {
        "paragraph": "Old Master Yule was so angry that his blood pressure surged. He staggered a few steps and fainted."
      },
      {
        "paragraph": "“Grandpa!” Melanie immediately rushed over to support the old man. “Hurry up and call an ambulance.”"
      },
      {
        "paragraph": "Joel quickly dialed 000 and an ambulance swiftly came over to send the old master to the hospital. Only\nDamien did not go since he was unable to walk."
      },
      {
        "paragraph": "The conference room was in an uproar."
      },
      {
        "paragraph": "“Since Old Master Yule has fainted, we’ ll discuss this matter another day,” Damien ordered coldly and\nprepared to leave immediately."
      },
      {
        "paragraph": "Kawada smiled coldly. “Sorry, but since I’ve come today, I have no intention to leave. From today\nonward, I’m the largest shareholder of Yule Corporation, so I request that a board meeting be held next\nMonday. I have the right to know many things about the company, and the chairman will also need to be\nre-elected.”"
      },
      {
        "paragraph": "Then, President Kawada left directly."
      },
      {
        "paragraph": "Director Pan’s scalp tingled. “Damien, Kawada is very cunning. He’s definitely not easy to deal with.”"
      },
      {
        "paragraph": "“I know. Delta Co., Ltd. is one of the top ten companies in Japan. How can President Kawada be a\nsimple person? He’s been eyeing Yule Corporation for a long time.” Damien gritted his teeth in anger.\n“Catherine Jones has really given me a big problem.”"
      }
    ]
  },
  {
    "title": "Chapter 907 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "In the hospital."
      },
      {
        "paragraph": "In front of the emergency room, Melanie could not help but glare at Catherine after she hung up the\nphone."
      },
      {
        "paragraph": "“Look at what you’ve done. Just now, President Kawada said a board meeting will be held next"
      },
      {
        "paragraph": "week. From his tone, it sounds like he wants to sit in the position of chairman.”"
      },
      {
        "paragraph": "Catherine listened to her indifferently and gave her a side -glance. “Isn’t that obvious? Did you think a\nperson like President Kawada would only want to take a share of the dividends after joining Yule\nCorporation?”"
      },
      {
        "paragraph": "“You… ” Melanie was furious. “Catherine Jones, are you doing this on purpose? That’s right. After all,\nyour last name isn’t Yule. You don’t care who Yule Corporation belongs to. All people like you care about\nis money.”"
      },
      {
        "paragraph": "“You don’t say! Anyway, even if I’m my dad’s successor, you all love to ignore me and don’t acknowledge\nme at all in the company. I advised the shareholders not to open a joint venture company with Campos\nCorporation, but you all refused to listen."
      },
      {
        "paragraph": "“So, I persuaded my dad to sell his shares. Besides, didn’t you and your dad painstakingly encourage\nGrandpa to let you both return to Yule Corporation? You’ve long conspired with the shareholders of the\ncompany.”"
      },
      {
        "paragraph": "In the hospital."
      },
      {
        "paragraph": "Catherine said with a fake smile on her face, “Now that Dad and I are gone, we have nothing to do with\nYule Corporation anymore. You should be happy instead.”"
      },
      {
        "paragraph": "Melanie wanted to vomit blood. How could she be happy?"
      },
      {
        "paragraph": "Joel was in poor health, so as long as Old Master Yule was around, he could hold Joel down firmly."
      },
      {
        "paragraph": "However, if President Kawada joined, it did not matter how much Grandpa pressured him. Besides,\nPresident Kawada might not care about Old Master Yule at all."
      },
      {
        "paragraph": "“Uncle, didn’t you see? Grandpa fainted from anger just now.” Melanie had to turn her attention to Joel.\n“If Kawada becomes the chairman of the company, Grandpa might actually die from anger. He’s your\nfather.”"
      },
      {
        "paragraph": "“I’ve already sold the shares. And I can’t let Catherine go to jail, ” Joel replied perfunctorily and casually."
      },
      {
        "paragraph": "“Just let her go to jail.”"
      },
      {
        "paragraph": "Old Madam Yule suddenly appeared with a cane."
      },
      {
        "paragraph": "“Mom…” Joel was about to speak but the old madam slapped him across the face."
      },
      {
        "paragraph": "“Are you trying to anger your father and me to death? Did your father make you the company’s majority\nshareholder just for you to sell your shares? He wanted you to take charge of Yule Corporation and\nmake it flourish. Joel, how could you have done such a thing?”"
      },
      {
        "paragraph": "The old madam accused him sadly and with disappointment. “It’s all thanks to the great expectations we\nhad for you. If we had known, we should’ve handed the company to Damien instead.”"
      },
      {
        "paragraph": "Joel’s heart burst into chills. “Mom, have you forgotten what Damien did to me? Nicola and he —”"
      },
      {
        "paragraph": "“He was seduced by Nicola. Your brother is simple and sentimental. He has never had a girlfriend in his\nlife before this. Nicola fooled him. In addition, he has low self-esteem and has been suffering all these\nyears. Can’t you be more understanding as an older brother?” Old Madam Yule said hatefully."
      },
      {
        "paragraph": "Joel’s heart chilled, but Catherine could not bear to hear it anymore."
      },
      {
        "paragraph": "“Damien Yule suffered, but didn’t my dad suffer too? The wife he was married to cuckolded him for tens\nof years, and even the child he raised was not his own. Have you thought about my dad’s feelings? He\nwas given a slow-acting poison and even now, his body is still unwell.”"
      },
      {
        "paragraph": "“Your grandfather knows that his body is unwell. That’s why he went back to Yule Corporation at his age,\n” Old Madam Yule said angrily, “If you didn’t want to manage the company, you could’ve given the shares\nto Damien. Why did you sell them to others? Do you need money that desperately?”"
      },
      {
        "paragraph": "“Grandma, don’t you understand yet? Uncle… thinks that after Grandpa came back to the company, he’s\nbeen stopping Catherine from climbing to the top,” Melanie said provokingly,“ The last time Catherine\ncame to the company, Grandpa didn’t listen to her and agreed to cooperate with Campos Corporation.”"
      },
      {
        "paragraph": "“Absurd! Does Yule Corporation belong to you? Why should your grandfather listen to you?” Old Madam\nYule glared hatefully at Catherine. “Who do you think you are?”"
      },
      {
        "paragraph": "”Mom…” Joel got angry."
      },
      {
        "paragraph": "”What? Are you going to argue with me over an illegitimate daughter?” Old Madam Yule lost her temper."
      }
    ]
  },
  {
    "title": "Chapter 908 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Catherine isn’t an illegitimate child.”"
      },
      {
        "paragraph": "“Since you didn’t marry her mom, it means she’s an illegitimate child. This kind of person isn’t qualified to\nbe a part of the Yule family’s house. If you insist on acknowledging her, you’re no longer my son.” Old\nMadam Yule threatened Joel."
      },
      {
        "paragraph": "“Dad is still in the emergency room, so I don’t want to argue with you.” Joel panted as he turned around.\nHe was so pissed that his frail body was trembling."
      },
      {
        "paragraph": "“Take a seat first, Dad.” Catherine promptly held him to the seat. “I’m going downstairs to buy you a\nbottle of water.”"
      },
      {
        "paragraph": "Melanie teased in a strange tone, “Even Granny isn’t seated yet despite her old age. You’re quite good at\ncurrying favors. No wonder you’ve got Uncle Joel wrapped around your hands.”"
      },
      {
        "paragraph": "Then, she turned around and brought Old Madam Yule to a seat."
      },
      {
        "paragraph": "“You’re so understanding, unlike someone.” Old Madam Yule shook her head. She was extremely upset\nwith Catherine."
      },
      {
        "paragraph": "Joel was so infuriated that his face reddened. If it had not been for the fact that Old Master Yule was\ncurrently under emergency treatment, he would have left without a second thought."
      },
      {
        "paragraph": "“It doesn’t matter, Dad. Grandpa and Granny haven’t liked me since the very beginning anyway, and\nafter all, they weren’t the ones who raised me. Fortunately, I have no intention of returning to the Yule\nfamily’s house either.”"
      },
      {
        "paragraph": "“Catherine isn’t an illegitimate child.”"
      },
      {
        "paragraph": "After consoling Joel, she turned around and went downstairs to get him some water."
      },
      {
        "paragraph": "In the VIP ward."
      },
      {
        "paragraph": "Shaun was lying on the bed while on sodium chloride IV infusion."
      },
      {
        "paragraph": "His pale yet exquisitely handsome face was expressionless, and his gaze was empty. As if he had given\nup on the world, he exuded a sense of despondency."
      },
      {
        "paragraph": "Even the air of authority, sternness, and sharpness he used to have was absent. At that moment, he was\njust like a man at his wits’ end."
      },
      {
        "paragraph": "At the sight of his situation, Hadley took pity on him. “Eldest Young Master, you should eat something.\nSince your surgery ended yesterday, you haven’t eaten anything. Your body won’t be able to take it no\nmatter how fit you usually are.”"
      },
      {
        "paragraph": "Shaun pursed his thin lips without uttering a word. He was not even in the mood to say anything."
      },
      {
        "paragraph": "He had never hated his mouth so much. Why was he not a dumb person? Otherwise, he would not have\nthrown those hurtful remarks at Catherine."
      },
      {
        "paragraph": "At that moment, a familiar figure flashed past the door."
      },
      {
        "paragraph": "He sat up with a jolt and directly removed the tubes on his hand before he dashed after the figure."
      },
      {
        "paragraph": "Hadley was taken aback. “Eldest Young Master, your hand is still bleeding… You’ve just had an\noperation. The doctor said that you can’t move, or your wound will split open.”"
      },
      {
        "paragraph": "Nevertheless, Shaun acted as if he did not hear it. Instead, he ran as fast as he could until he gripped\nthe thin person in front of him."
      },
      {
        "paragraph": "“Cathy…”"
      },
      {
        "paragraph": "Catherine, who was walking forward, suddenly felt someone grip her and heard a man’s hoarse voice at"
      },
      {
        "paragraph": "the same time."
      },
      {
        "paragraph": "She turned around, only to see Shaun’s eyes filled with agony."
      },
      {
        "paragraph": "He still looked handsome despite being in a white hospital gown. In fact, the outfit revealed the\nweakness of the usually powerful man, making him seem like a little puppy that needed care and\nprotection."
      },
      {
        "paragraph": "“Are you here to visit me?” Shaun fixed his greedy eyes on her. His tone was filled with cautiousness and\nflattery, which was rare. “My ward is at the back.”"
      }
    ]
  },
  {
    "title": "Chapter 909 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine fixed her stony gaze on Shaun’s cautious look."
      },
      {
        "paragraph": "She found it ludicrous."
      },
      {
        "paragraph": "The corners of her mouth curled her lips into a mocking smile."
      },
      {
        "paragraph": "“Do you think I’m here to visit you?” Catherine shrank from his grip. “We have nothing to do with each\nother anymore.”"
      },
      {
        "paragraph": "She then turned around to leave, but Shaun was quick enough to stand in front of her. Although he was\nsick, his tone was arrogant as usual. “When did I break up with you? Catherine, you’re still my girlfriend.”"
      },
      {
        "paragraph": "“Mr. Hill, you have such a poor memory. Let me remind you that you were holding onto Sarah’s arms\nintimately when you showed up at the court yesterday.”"
      },
      {
        "paragraph": "Catherine was really amazed by his shameless behavior. “Someone who’s ashamed won’ t bring himself\nto say such things.”"
      },
      {
        "paragraph": "“You can treat me as shameless, then.”"
      },
      {
        "paragraph": "Shaun was reluctant to let go of her hand. He knew that he had wronged her a lot, so perhaps he should\nnot disturb her as Hadley said. However, he could not stop thinking about her since last night."
      },
      {
        "paragraph": "He had heard a saying that one would think of the person they loved when they were sick."
      },
      {
        "paragraph": "Unfortunately, he had grasped it too late."
      },
      {
        "paragraph": "Catherine fixed her stony gaze on Shaun’s cautious look."
      },
      {
        "paragraph": "“Cathy, I’m sorry. I didn’t mean to. It was because I really did see Logan tearing Sarah’s clothes apart\nwhen I saved her the other day…”"
      },
      {
        "paragraph": "“Stop telling me how angry you are for Sarah. I find it disgusting.” Catherine interrupted him. “ Actually,\nyou guessed it right, Shaun. I only agreed to get back together with you with the intention of taking\nrevenge on you. I want Sarah to experience the feeling of having her beloved person snatched away.”"
      },
      {
        "paragraph": "“What did you say? ” Shaun was dazed. His heart felt like it had been punched. “This is impossible… ”"
      },
      {
        "paragraph": "“Impossible?” Catherine snorted, “What makes you so confident? Think about all the things you have\ndone to me before. Do you want me to list them out one by one? First of all, when you had an affair with\nSarah but were afraid of being criticized by the public, you threatened me with my dad and forced me to\ntell the public that we had gotten a divorce. Then, the netizens lashed out at me."
      },
      {
        "paragraph": "“The second incident was when you insisted on saving Thomas, who forced himself upon Freya, which\nadded fuel to the fire. In the end, Thomas came out and accused Freya in front of the media."
      },
      {
        "paragraph": "“Thirdly, you treated me like a dog and locked me up. You even planned on letting Sarah look after my\nchildren."
      },
      {
        "paragraph": "“Fourth, you pushed me and caused me to suffer a miscarriage."
      },
      {
        "paragraph": "“The fifth was when Sarah claimed that I had depression, so you asked the doctor to lock me up and give\nme a shot and medicine every day. I told you many times that I was fine and I wasn’t ill at that time."
      },
      {
        "paragraph": "“The sixth was leaving Sarah to manage the only company my mom had left for me after I pretended to\nbe dead. You have so many companies, but you just had to give her Hudson. Couldn’t you give her\nsomething else?”"
      },
      {
        "paragraph": "The more Catherine described, the more furious and agitated she became. Her pretty eyes were burning\nwith resentment."
      },
      {
        "paragraph": "Shaun was utterly stunned. It finally hit him that she had never stopped hating him."
      },
      {
        "paragraph": "Did it mean that all her previous smiles, concern, and gentleness toward him were insincere?"
      },
      {
        "paragraph": "It pained him so much that he could barely breathe."
      },
      {
        "paragraph": "It could be due to the fact that he just had an operation, but he felt like he was going to faint anytime\nsoon."
      },
      {
        "paragraph": "Catherine pretended that she did not notice and continued to criticize sarcastically, “All I’ve mentioned\nhappened before my return. Now, I’m going to list the things you did to me after I returned. The first\nmatter was that you asked the company shareholders and partners to pressure me because Sarah\npersuaded you to do so. If I weren’t clever enough, Hudson would’ve long since collapsed because of\nyou. “Secondly, Sarah drugged you, yet you came to me to relieve yourself. After that, you even warned\nme to take contraceptive pills so that I wouldn’t be pregnant with your children.”"
      }
    ]
  },
  {
    "title": "Chapter 910 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Thirdly, I’ll ignore the fact that you forced me to get a divorce because you wanted to marry Sarah, but\nwhy did you have to ask Yael to strip off my clothes? Yes, you’ve helped me to take revenge on her, but\ndo you understand the agony and humiliation of being pressed on the floor and stripped little by little?\nYou basically trampled on my dignity."
      },
      {
        "paragraph": "“The fourth matter has to be Logan’s case. After learning that Sarah was kidnapped, you left me on\nMount Wellington in the middle of the night. I begged you not to go, but you still left heartlessly."
      },
      {
        "paragraph": "“Logan is my family, yet how did you treat him? You chopped off his finger to please Sarah. Shaun, don’t\nyou find yourself terrifying?”"
      },
      {
        "paragraph": "Terrifying?"
      },
      {
        "paragraph": "He was terrifying?"
      },
      {
        "paragraph": "Shaun’s hands were trembling."
      },
      {
        "paragraph": "If she had not listed those things one by one, he would have forgotten all these evil deeds he had"
      },
      {
        "paragraph": "done to her."
      },
      {
        "paragraph": "He was not inherently cruel. However, he could easily transform into a devil when it came to her affairs."
      },
      {
        "paragraph": "“I’m sorry, Cathy. I won’t do it anymore, I swear… ”"
      },
      {
        "paragraph": "“Thirdly, I’ll ignore the fact that you forced me to get a divorce because you wanted to marry Sarah, but\nwhy did you have to ask Yael to strip off my clothes? Yes, you’ve helped me to take revenge on her, but\ndo you understand the agony and humiliation of being pressed on the floor and stripped little by little?\nYou basically trampled on my dignity."
      },
      {
        "paragraph": "“ Stop swearing. When we were in a relationship, you promised to be faithful. But how many days had\nwe been together?”"
      },
      {
        "paragraph": "A look of disgust washed over Catherine’s face. “ Shaun, you made me realize that I can never trust your\nwords because no one knows when you’ll turn against me.”"
      },
      {
        "paragraph": "“ I won’t turn against you. I promise.” Shaun, who was at his wits’ end, clutched onto her sleeve. “You\nsaid earlier that you want to take revenge on Sarah and me, right? You said that you want to snatch me\naway from Sarah and torture her, right? I’m giving you the chance now.”"
      },
      {
        "paragraph": "He did not mind being tortured by Catherine as long as he did not have to part with her."
      },
      {
        "paragraph": "At this point, Shaun was like a helpless kid. All he hoped was for Catherine to give him another chance."
      },
      {
        "paragraph": "“Thanks, but I don’t want this chance anymore. ” Catherine looked at Shaun, who was going all out to\nkeep her by his side. If this had happened earlier, she would have taken delight in it."
      },
      {
        "paragraph": "‘Shaun, you used to think I’m worthless, but I bet you never thought that you’d one day be so frightened\nand pitiful.’"
      },
      {
        "paragraph": "Even so, she had to admit that she was also hurt in the process of making him fall for her again."
      },
      {
        "paragraph": "“Why don’t you want to take revenge on me anymore?”"
      },
      {
        "paragraph": "Given that an arrogant person like him ended up in this state, Shaun ridiculed himself. However, what\nfeared him most was that she did not wish to take revenge on him because this implied that they would\nhave nothing to do with each other anymore."
      },
      {
        "paragraph": "Catherine’s long lashes lowered. “Shaun, I’m a human too. I was swayed while we were dating,\nespecially when I found out that you didn’ t sleep with Sarah, and when you piggybacked me during our\nclimb to Mount Wellington."
      },
      {
        "paragraph": "“But then came Logan’s matter, and you gave me a hard slap which woke me up. I was planning to\nsacrifice my body to make you fall for me so that I could torture you, but what a silly behavior that was.\nWas I trying to take revenge on you or let you take advantage of me?”"
      },
      {
        "paragraph": "“No. You did take your revenge on me, just like how you’re doing it now. My heart hurts so badly…”\nShaun gazed at her miserably. “Stay here. You can torture me however you want as long as you’re\nhappy.”"
      },
      {
        "paragraph": "“No need.” Catherine shook her head. “When I begged you at Liona, you said you’d lock me up. Then,\nwhen I saw you chopping off Logan’s finger, my feelings for you were gone. “Next, I’ll take my revenge\non Sarah Neeson. I’m doing it not for you but for Charity. Let’s forget about our bittersweet vendetta in\nthe past. I don’t feel like using our relationship as the tool for revenge anymore.”"
      }
    ]
  },
  {
    "title": "Chapter 911 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine herself said that she no longer had feelings for Shaun."
      },
      {
        "paragraph": "The corners of Shaun’s eyes reddened with pain."
      },
      {
        "paragraph": "It turned out that she did give him chances, and she did give in to him."
      },
      {
        "paragraph": "However, he had missed the chance the night he left her alone on Mount Wellington without a second\nthought."
      },
      {
        "paragraph": "Shaun, oh, Shaun. For Sarah, how much have you hurt this woman who used to love you?"
      },
      {
        "paragraph": "“ Shaun, I know you’ll never let go of Sarah. In this case, we’ll be rivals in the future.”"
      },
      {
        "paragraph": "Catherine shrank back from his touch and left without looking back."
      },
      {
        "paragraph": "“Don’t leave me, Cathy…” As much as Shaun wanted to go after him, his post-surgery wound had\nopened, and blood stained his gown. With every step he took, his wound felt as if it was sliced open. The\npain was so intense that his face became as white as a sheet."
      },
      {
        "paragraph": "He wanted to let her know that he did not want to be her rival. Instead, he wanted her to be his girlfriend\nand wife. He would not be bothered about Sarah’s affairs anymore."
      },
      {
        "paragraph": "Despite that, his body did not permit him to move further."
      },
      {
        "paragraph": "Shaun fell onto the ground in pain. When he lifted his head, he caught sight of Catherine turning her\nhead around and glancing at him amid his blurry vision. However, her glance was cold, and she left"
      },
      {
        "paragraph": "Catherine herself said that she no longer had feelings for Shaun."
      },
      {
        "paragraph": "without an intention to turn around."
      },
      {
        "paragraph": "With that, she left."
      },
      {
        "paragraph": "Even though she saw his shirt covered with blood and noticed he was in so much pain that he was going\nto pass out, she did not turn back. She was not even anxious, concerned, or frightened."
      },
      {
        "paragraph": "Ha."
      },
      {
        "paragraph": "His eyes reddened again."
      },
      {
        "paragraph": "“Eldest Young Master, your wound has opened. ” Hadley’s worried voice rang beside his ear. “Doctor,\nhurry up and come over.”"
      },
      {
        "paragraph": "Soon, someone carried Shaun to the bed and sent him to the emergency room to stitch his wound up."
      },
      {
        "paragraph": "He asked the doctor not to anesthetize him."
      },
      {
        "paragraph": "His heart would ache less if his wound hurt more."
      },
      {
        "paragraph": "After buying some food, Catherine headed upstairs."
      },
      {
        "paragraph": "Old Master Yule was already out of the emergency room and out of danger for now, but he was still\nunconscious."
      },
      {
        "paragraph": "Old Madam Yule warned Joel moodily, “If you insist on selling off the shares, you’ll no longer be my son.\nDon’t bother coming home.”"
      },
      {
        "paragraph": "Agony flashed in Joel’s eyes. Instead of replying, he simply asked the doctor to treat Old Master Yule\nbefore he got ready to leave with Catherine."
      },
      {
        "paragraph": "Just as Joel and Catherine stepped out of the door, they came face to face with Charlie walking over in a\nhurry. At the sight of Catherine, Charlie’s eyes turned cold."
      },
      {
        "paragraph": "The first thing Charlie said was, “Uncle Joel, you must be senile.”"
      },
      {
        "paragraph": "Catherine bit her lip. “My dad isn’t senile. But you should worry about yourself. Now that President\nKawada is the largest shareholder in Yule Corporation, do you think he’ll assign his people to your newly-\nestablished investment company?”"
      },
      {
        "paragraph": "Charlie’s expression shifted. This was what worried him the most. He had initially planned to use this\ncompany to take over Yule Corporation, which would enable the Campos family to become the most\ninfluential family in Australia. However, he found out that Kawada used to be involved in the financial\nindustry. In that case, Kawada would certainly vie to dominate the joint venture afterward."
      },
      {
        "paragraph": "“Catherine Jones, I’m sure you did this on purpose.” Charlie gnashed his teeth."
      }
    ]
  },
  {
    "title": "Chapter 912 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine smiled faintly. “Anyway, we no longer have anything to do with Yule Corporation. It’s up to\nyou to do whatever you want, Young Master Campos. But having said that, let me remind you that\nDamien and his daughter might not be able to beat Kawada.”"
      },
      {
        "paragraph": "With that, Catherine left without bothering to see Charlie’s expression."
      },
      {
        "paragraph": "Soon, Melanie came out of the ward and looked at him anxiously. “Charlie, what do we do now? It\nseems that Joel is set on selling the shares, and no one can stop him.”"
      },
      {
        "paragraph": "Charlie’s heart did a flip before he sighed. “We can’t let Kawada be the chairman, much less have the\nchance to get involved in the internal affairs of Yule Corporation. Otherwise, he’ll make the Yule family\na figurehead sooner or later.”"
      },
      {
        "paragraph": "Melanie’s face instantly paled. In fact, she had expected this."
      },
      {
        "paragraph": "“Kawada is a cunning person, so you’re definitely no match for him. We have to depend on your dad. If"
      },
      {
        "paragraph": "your dad can’t beat him, then you and your dad…”"
      },
      {
        "paragraph": "Charlie shook his head as he spoke, “You guys can only sit back and enjoy the dividends. But you can\nonly take the amount he’s willing to offer you.”"
      },
      {
        "paragraph": "“No way…” Melanie was so shocked that she quickly shook her head. “Charlie, as my husband, you\nneed to help me. We’re bound together. What’s more, the Campos family and the Yule family have\nbeen working closely with each other. If I lose my position in Yule Corporation, it’ll certainly affect our\njoint venture.”"
      },
      {
        "paragraph": "Catherine smiled faintly. “Anyway, we no longer have anything to do with Yule Corporation. It’s up to\nyou to do whatever you want, Young Master Campos. But having said that, let me remind you that\nDamien and his daughter might not be able to beat Kawada.”"
      },
      {
        "paragraph": "“Needless to say, I’m concerned about this too. ” Charlie wrapped his arm around her shoulders. “\nWhat about getting Mike to help you out? I’ll make him your assistant.”"
      },
      {
        "paragraph": "Melanie’s eyes flashed with hesitance. She did not want to have Charlie’s people in Yule Corporation,\nand Mike Castle was Charlie’s secretary."
      },
      {
        "paragraph": "“Wifey, now is the time for us to unite and turn against outsiders, ” Charlie whispered. “As your\nhusband, I definitely want my wife’s family to be well. I have my dignity to retain too. Hopefully, Dad can\nhave complete control over Yule Corporation this time.”"
      },
      {
        "paragraph": "“Okay.” Melanie nodded without hesitation."
      },
      {
        "paragraph": "She believed that Charlie would deal with Kawada on her behalf, considering that she was his wife."
      },
      {
        "paragraph": "Little did she know that out of the corner of her eyes, Charlie’s eyes slowly turned grim."
      },
      {
        "paragraph": "Once Charlie walked out of the hospital, he called Mike over. “Find a way to contact President\nKawada.”"
      },
      {
        "paragraph": "“Young Master Campos, are you trying to…” “Collaborate.” Charlie narrowed his eyes."
      },
      {
        "paragraph": "Mike was dumbfounded. “But you don’t even know Kawada. Will he agree to collaborate with you?”"
      },
      {
        "paragraph": "“A rival can become your friend as long as you entice him enough.”"
      },
      {
        "paragraph": "Charlie snorted. “What else do Melanie and her dad have at this point? With only some shares left in\nYule Corporation, the two of them are no match for Kawada, who is different since he owns a\ntransnational company. We’ll achieve success if we work together. I’ve assigned you to work for\nMelanie. I want you to join hands with Kawada and make Yule Corporation ours within two months.”"
      },
      {
        "paragraph": "Looking at Charlie’s features on his handsome face, Mike could not help but shudder."
      },
      {
        "paragraph": "The public often called Shaun brutal, but they did not know how brutal the Campos family could\nactually be. Charlie could even take advantage of his wife in order to gain power. How terrifying."
      },
      {
        "paragraph": "In the ward."
      },
      {
        "paragraph": "Hadley informed Shaun, “Eldest Young Master, Miss Jones came to the hospital because Old Master\nYule was sent here after he fainted from anger during the meeting.”"
      },
      {
        "paragraph": "“Was it because Joel sold off the shares?” Shaun asked with a croaky voice."
      },
      {
        "paragraph": "“Yeah. It has spread like wildfire and caused an uproar across the business industry in Australia. ”\nHadley exclaimed, “There’s going to be a major change in Yule Corporation.”"
      },
      {
        "paragraph": "“Not bad. Considering the close collaboration between Campos Corporation and Yule Corporation,\nCharlie must have a hidden agenda. It was safe and wise of Catherine to get rid of this whirlpool.”"
      },
      {
        "paragraph": "Shaun’s exquisite and thin lips forced out a pale smile."
      },
      {
        "paragraph": "Speechless, Hadley secretly teased Shaun, ‘You’ve broken up with Catherine, yet you’re acting as if\nyou’re still her boyfriend.’"
      }
    ]
  },
  {
    "title": "Chapter 913 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Eldest Young Master, please focus on getting well first.” Hadley reminded, “We’re close to succeeding\nwith our microchip. By then, not only Australia but the whole world will place their orders with us. It will be\na big step-up for Hill Corporation this time.”"
      },
      {
        "paragraph": "Shaun remained silent."
      },
      {
        "paragraph": "Indeed, Hill Corporation would go further, and he would have more money to burn."
      },
      {
        "paragraph": "However, what was the point of making so much money? The woman whom he would like to spend\nmoney on had hated him to the core."
      },
      {
        "paragraph": "Shaun’s phone vibrated all of a sudden."
      },
      {
        "paragraph": "It was a call from Sarah. Before this, Sarah had sent him messages regarding her explanation on the\nnews."
      },
      {
        "paragraph": "He was not in the mood for checking it out at all. In fact, he just found it irritating."
      },
      {
        "paragraph": "At night, Irving from Liona gave him a call. “Eldest Young Master, Miss Neeson has slit her wrist in the\nvilla bathtub.”"
      },
      {
        "paragraph": "Shaun sat up right away and asked with a nervous voice, “How is she now?”"
      },
      {
        "paragraph": "“Luckily, we found out about it soon enough to send her to the hospital for emergency treatment. I’m now\nin the ambulance to the hospital, and I’ve already informed Thomas. Eldest Young Master, are you…"
      },
      {
        "paragraph": "“Eldest Young Master, please focus on getting well first.” Hadley reminded, “We’re close to succeeding\nwith our microchip. By then, not only Australia but the whole world will place their orders with us. It will be\na big step-up for Hill Corporation this time.”"
      },
      {
        "paragraph": "coming?”"
      },
      {
        "paragraph": "Shaun responded indifferently, “I just had an operation. How can I come?”"
      },
      {
        "paragraph": "“Oh, okay…” Irving was a little surprised as he thought Eldest Young Master would rush there anxiously."
      },
      {
        "paragraph": "Back then, Eldest Young Master would hurry to see Sarah without a second thought whenever\nsomething happened to her. This included even if he was on an overseas business trip, dealing with\nsome important matters."
      },
      {
        "paragraph": "Irving lowered his head and glanced at Sarah, who was lying in the ambulance with a pale face. As a\nman, he used to take pity on her too, but he had seen it so much that he was numb to it."
      },
      {
        "paragraph": "After all, it was not Sarah’s first time committing suicide. She had been admitted to the hospital so\nfrequently these days that it seemed like the hospital was her home."
      },
      {
        "paragraph": "In the ward, Shaun gave Chester a call."
      },
      {
        "paragraph": "Chester had just finished an exhausting six-hour operation. He was about to take a rest when he heard\nShaun’s words, which made him so furious that he did not know what to say."
      },
      {
        "paragraph": "“Is she addicted to committing suicide? She might as well rent a place in the hospital and stay there.”"
      },
      {
        "paragraph": "“She’s actually quite cruel to herself.” Shaun laughed bitterly. Ever since the trial, he could no longer\nthink sensibly when it came to Sarah’s affairs."
      },
      {
        "paragraph": "Moreover, Sarah had been staying in the hospital recently, so he had been frequenting between the\nhospital, office, and home. He had since had a good rest."
      },
      {
        "paragraph": "He, too, was exhausted."
      },
      {
        "paragraph": "“Yeah. It’s as if we must be responsible for her life.” Chester felt a twinge of annoyance."
      },
      {
        "paragraph": "He used to treat Sarah as his sister and sympathized with what she had gone through."
      },
      {
        "paragraph": "However, Shaun and Chester were not the ones who contributed to her suffering. She had been in\nendless trouble. One minute, she fell from the stairs, and the next, she nearly committed suicide because\nshe was treated violently. Now, she committed suicide in the house."
      },
      {
        "paragraph": "As a doctor, Chester had seen a lot of patients who passed away as a result of serious illnesses. Hence,\nhe valued life, but he did not sense that in Sarah."
      },
      {
        "paragraph": "In the morning."
      },
      {
        "paragraph": "Sarah woke up slowly, only to see Thomas playing games beside her."
      },
      {
        "paragraph": "Her eyes swept across the ward, and she nearly fainted. “Where’s Shaunic? Didn’t he come? And\nwhere’s Chester?” “Young Master Jewell came here for a short while last night, but Young Master Hill\nhasn’t come.”"
      }
    ]
  },
  {
    "title": "Chapter 914 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Thomas put down his phone and said indignantly, “ Young Master Hill is heartless. You almost died, yet\nhe’s so unconcerned. Sigh, Sarah, do you think they are fed up with your suicide tactic?”"
      },
      {
        "paragraph": "“ Shut up.” Sarah glowered at him. “Do you think I like to do this? He refused to pick up my calls or meet\nme. I have to make him believe that I have nothing to do with Logan’s matter.”"
      },
      {
        "paragraph": "“But I reckon he’s suspecting you.” Thomas let out a sigh. “I think you should give up on Eldest Young\nMaster. Young Master Snow isn’t bad either.”"
      },
      {
        "paragraph": "“Don’t mention him. That useless man is still locked up by the Snow family.”"
      },
      {
        "paragraph": "Sarah closed her eyes."
      },
      {
        "paragraph": "No one in Australia could compare to such an outstanding man like Shaun, so she was reluctant to give\nup on him."
      },
      {
        "paragraph": "Besides, she was truly in love with Shaun. Otherwise, she would not have stayed by his side even\nthough he could not bring himself to touch her over the past three years."
      },
      {
        "paragraph": "This was the only time Shaun had ignored her when she was hospitalized."
      },
      {
        "paragraph": "The next day, she could not hold back anymore as she lost control and smashed the things in the"
      },
      {
        "paragraph": "ward. She even made a scene and tried to kill herself."
      },
      {
        "paragraph": "She was sure that the Liona members outside the ward would inform Shaun about it."
      },
      {
        "paragraph": "Thomas put down his phone and said indignantly, “ Young Master Hill is heartless. You almost died, yet\nhe’s so unconcerned. Sigh, Sarah, do you think they are fed up with your suicide tactic?”"
      },
      {
        "paragraph": "Fortunately, Shaun finally showed up on the third day."
      },
      {
        "paragraph": "However, he was seated in the wheelchair and dressed in the same hospital gown as her. His handsome\nface had slimmed down, making his features look more pronounced and colder."
      },
      {
        "paragraph": "With his dark eyes fixed on her, Sarah felt inexplicably uneasy."
      },
      {
        "paragraph": "“Shaunic, what’s… What’s wrong with you?” Sarah looked at him in utter astonishment. “Are you\ninjured?”"
      },
      {
        "paragraph": "Hadley said faintly, “Eldest Young Master has just undergone an operation for gastrointestinal\nperforation. The doctor said he isn’t supposed to get out of bed, but you’ve been kicking up a fuss every\nday, so he had no choice but to come over.”"
      },
      {
        "paragraph": "“ S-Sorry. I didn’ t mean it. I didn’t know.” Sarah was on the verge of tears, but deep down, she was\ndelighted. It hit her that his absence earlier was because he had an operation, not because he was not\nconcerned about her. Now that he came, it showed that he actually cared about her."
      },
      {
        "paragraph": "“Since you know why I didn’t come earlier, can you leave me alone now?” Shaun’s attractive brows sank,\nand there was a hint of weariness in his eyes."
      },
      {
        "paragraph": "Sarah was stunned, and a wave of uneasiness washed over her. “ Shaunic, you misunderstood me. I\ndidn’t mean to kick up a fuss when you were sick. I was very miserable, especially when I thought you\nmight have misunderstood me…”"
      },
      {
        "paragraph": "“Is that why you slit your wrist to kill yourself?” Shaun interrupted her as he glanced at her wrist. “ Since\nyou don’t feel like living anymore, have you bought a grave plot?”"
      },
      {
        "paragraph": "“W-What?” Sarah froze. She could not believe that Shaun would say such a thing."
      },
      {
        "paragraph": "Agitated, Thomas began to shout, “ Eldest Young Master, you’ve gone too far. Are you trying to drive\nSarah to her death?”"
      },
      {
        "paragraph": "“Am I wrong in saying that? She asked for death, so how can you say that I’m forcing her?” Shaun\nmocked."
      },
      {
        "paragraph": "Thomas was at a loss for words."
      },
      {
        "paragraph": "Shaun’s mouth suddenly twitched. He wondered why he was so stupid before not to notice how Sarah\nand Thomas always sang the same tune. They made him feel like a sinner when he ignored Sarah."
      },
      {
        "paragraph": "“Sarah, how difficult is it to stop pestering me and leave me alone? Just tell me.”"
      },
      {
        "paragraph": "Sarah shuddered. It was her first time hearing such a merciless remark from Shaun."
      },
      {
        "paragraph": "It seemed like he was really bored of her."
      },
      {
        "paragraph": "“I’m sorry, Shaunic.” She covered her face and wept. “I don’t want to be like this either. I know I’ve been\ncausing you trouble…”"
      },
      {
        "paragraph": "“Sarah, there’s nothing to feel sorry about.” Thomas said in exasperation, “Eldest Young Master, you’ re\ntoo heartless. Have you forgotten who cured your illness back then? She has stuck with you through\nthick and thin. Even if both of you can’t be a couple, you can still be friends, right?”"
      }
    ]
  },
  {
    "title": "Chapter 915 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Friends?”"
      },
      {
        "paragraph": "Shaun chuckled. “Do you mean the kind of friend who is at her beck and call? But when she calls me\nand I arrive late, she’ll make a scene? At the same time, I have to take responsibility for her safety and\nhappiness for the rest of her life.”"
      },
      {
        "paragraph": "Sarah promptly argued, “No…”"
      },
      {
        "paragraph": "“Sarah, when did you turn into this kind of person?” Shaun interrupted her sentence impatiently. “We\nwere merely in a relationship, and we’ve never slept together up until this day. I’ve even given you lots of\nproperty and money when we broke up. But why do you always behave like you’ll kill yourself if I refuse\nto be with you?”"
      },
      {
        "paragraph": "He had had enough of everything."
      },
      {
        "paragraph": "He had enough of having to be responsible to Sarah for the rest of his life."
      },
      {
        "paragraph": "He had enough of hurting Catherine over and over again because of Sarah."
      },
      {
        "paragraph": "Sarah was shocked by his fierce expression. “You’ve misunderstood. I wanted to kill myself because I\nfeel that I’m… filthy. Shaunic, I love you. My love for you has never changed.”"
      },
      {
        "paragraph": "“Unfortunately, I don’t love you anymore.”"
      },
      {
        "paragraph": "“Friends?”"
      },
      {
        "paragraph": "Shaun said directly and indifferently, “ Sarah, you should be content. Catherine married me and even\nsuffered a miscarriage because of me, yet I didn’t give her a penny when we got a divorce. For a cruel\nand heartless man like me, I’m considered kind to you. I even went all out to protect and look after your\nuseless brother. Although you cured my illness, I’ve returned the favor. Tell me, in which aspect do I still\nowe you?”"
      },
      {
        "paragraph": "Sarah and Thomas were both dazed."
      },
      {
        "paragraph": "Shaun may be sitting in a wheelchair, but the rage i n his eyes filled them with fear."
      },
      {
        "paragraph": "A while later, Sarah said miserably, “Do you think Logan’s matter was my doing? I didn’t do it. I swear"
      },
      {
        "paragraph": "“Whether you did it or not, it no longer matters. What matters is that if you continue to pester me like this,\nI can never find another woman to marry.”"
      },
      {
        "paragraph": "Shaun’s handsome brows were filled with annoyance. “ I’ll soon announce to the public that we’ve\nbroken up so as to stop those reporters from taking random photos of us. Sarah, we’re done. If you plan\nto commit suicide in the future, don’t call me, and I’ll remove the Liona member from you as well. If\nyou’re kidnapped, ask the kidnapper to look for Thomas. I cannot be responsible to you for the rest of\nyour life.”"
      },
      {
        "paragraph": "With that, Shaun moved his wheelchair. Once Hadley grasped his intention, he immediately pushed him\nout."
      },
      {
        "paragraph": "“No, Shaunic. Don’t leave.” Sarah went after Shaun, sobbing. As much as she wanted to grab Shaun,\nHadley blocked her."
      },
      {
        "paragraph": "“Shaunic, I can’t live without you. Have you forgotten our promise? How can you be so cruel? Is it\nbecause of Catherine? She doesn’t even love you as much as I do.”"
      },
      {
        "paragraph": "Shaun looked back and glanced at her tearful face. If this were back then, he would have been moved."
      },
      {
        "paragraph": "However, scenes of Catherine’s heartbroken expression after he hurt her time and time again flashed\nbefore his eyes."
      },
      {
        "paragraph": "All of a sudden, his heart began to ache."
      },
      {
        "paragraph": "It was his first time being annoyed at Sarah."
      },
      {
        "paragraph": "“Even if she doesn’t love me, it’s fine as long as I love her. As for you, I have no feelings for you"
      },
      {
        "paragraph": "anymore.”"
      },
      {
        "paragraph": "Shaun had made it abundantly clear to her. Not wanting to stay any longer, he told Hadley to push him\nout of the ward."
      },
      {
        "paragraph": "Only then did it dawn on him that it was indeed hurtful to protect Sarah on one hand and try winning\nCatherine’s heart on the other hand."
      },
      {
        "paragraph": "Since Catherine called him cruel, he might as well be unequivocally cruel."
      },
      {
        "paragraph": "Sounds of Sarah’s hysterical weeping echoed in the ward. Thomas was also in a foul mood."
      },
      {
        "paragraph": "“We’re done. As I said, your suicide tactic has annoyed Eldest Young Master. Now that we’ve lost such a\nbig support, what do we do?”"
      },
      {
        "paragraph": "“Shut up, ” Sarah yelled at him in distress. Her eyes were burning with intense hatred. ‘Shaun, you’re too\ncruel.’"
      },
      {
        "paragraph": "She loved him so much that she had hurt her body for him again and again. Yet, he still abandoned her\nin the end, and for that, she must make him suffer."
      }
    ]
  },
  {
    "title": "Chapter 916 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "Shaun announced on his official account on Facebook. [Recent rumors about Sarah Neeson and I\ngetting married and getting back together are spreading like wildfire. Today, I’m here to confirm that Miss\nNeeson and I have officially broken up because we no longer have feelings for each other. We will never\nget back together again.]"
      },
      {
        "paragraph": "Once the news was released, it caused an uproar on Facebook."
      },
      {
        "paragraph": "[Eldest Young Master is truly a scumbag.]"
      },
      {
        "paragraph": "[It’s my first time seeing a scummy man saying things so… arrogantly. I have no idea what to say\nanymore.]"
      },
      {
        "paragraph": "[They were only just preparing for their wedding the other day, yet now, they have no feelings for each\nother anymore. Tsk, to put it bluntly, he has changed his mind.]"
      },
      {
        "paragraph": "[It looks like Eldest Young Master is still thinking about Eldest Young Lady Jones.]"
      },
      {
        "paragraph": "[Is Eldest Young Master going to officially announce his relationship with Eldest Young Lady Jones? I\ncan’t wait.]"
      },
      {
        "paragraph": "[That’s very likely. I saw them going on an outing together the other day.]"
      },
      {
        "paragraph": "As such, the netizens went to Catherine’s profile and left their comments."
      },
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "[Rin, are you going to remarry Shaun officially?]"
      },
      {
        "paragraph": "[When are you guys going to make an official announcement about it? I’ll be the first to send you my\nblessings.]"
      },
      {
        "paragraph": "[Rin, don’t get back together with scummy Shaun. I think you deserve someone better.]"
      },
      {
        "paragraph": "Catherine, who was currently working in Hudson, was completely speechless when she spotted herself\nsomehow on the trending searches."
      },
      {
        "paragraph": "A moment later, she made an announcement through her account. [Shaun and I had attempted to get\nback together a while back, but we realized that we’re not a suitable match. Personally, I’m fond of men\nwho are decisive in relationships, so it’s impossible for us to get back together again. I hope you guys\nwon’t drag me into Shaun’s relationship"
      },
      {
        "paragraph": "anymore. From now on, we’ll wish each other well.]"
      },
      {
        "paragraph": "As soon as the news was released, it caused a commotion among the netizens who had been waiting for\nthe news."
      },
      {
        "paragraph": "[What do you mean by being fond of men who are decisive in relationships? Rin, was scummy Shaun\nalways in touch with Sarah when he was in a relationship with you?]"
      },
      {
        "paragraph": "[Poor Rin, don’t be upset because of Shaun anymore. You deserve someone better.]"
      },
      {
        "paragraph": "[I heard Shaun even filed a lawsuit against Rin a few days ago for the sake of Sarah. The two of them\nconfronted each other in court.]"
      },
      {
        "paragraph": "[Damn. Shaun has to be the scummiest person in the world.]"
      },
      {
        "paragraph": "At this moment, Shaun was sitting in the office. The minute he saw Catherine’s post, he felt as if\nsomething had pierced a hole in his heart, and he shuddered."
      },
      {
        "paragraph": "He did not expect her to be so cruel."
      },
      {
        "paragraph": "She even publicly announced that they would never get back together and wished each other well."
      },
      {
        "paragraph": "How could he be well without her?"
      },
      {
        "paragraph": "He promptly took a pen and drew a heart shape on the paper. After that, he took a picture of it and\nshared it on Facebook. [A lifetime of waiting.]"
      },
      {
        "paragraph": "The netizens then commented. [With a heart shape and the phrase ‘a lifetime of waiting’, does he mean\nthat he’s going to spend a lifetime waiting for Catherine?]"
      },
      {
        "paragraph": "[Oh man, what is Eldest Young Master doing? I’m not used to him being affectionate instead of scummy.]"
      },
      {
        "paragraph": "[We won’t understand the rich man’s world. Three years ago, he said that Sarah was his true love."
      },
      {
        "paragraph": "Three years later, he said he would spend a lifetime waiting for Catherine. Bah, I don’t buy it.]"
      },
      {
        "paragraph": "Catherine soon caught sight of the post that Shaun shared. The corners of her mouth curled into a\nmocking smile."
      },
      {
        "paragraph": "A lifetime of waiting? Forget about it. She would not buy it either."
      }
    ]
  },
  {
    "title": "Chapter 917 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun had waited for a long time, yet Catherine did not share anything on Facebook."
      },
      {
        "paragraph": "His heart sank into despair."
      },
      {
        "paragraph": "Although she denied having any connection with him previously, they still had interaction, which showed\nthat she cared about him. Now that there was no news from her, it meant that she had completely\nignored him."
      },
      {
        "paragraph": "The feeling of being ignored was f*cking miserable."
      },
      {
        "paragraph": "Shaun tossed his phone aside and rose to his feet. His wound began to hurt again."
      },
      {
        "paragraph": "Hadley was speechless. “Eldest Young Master, the doctor has made an exception and approved your\nreturn to the office even though your wound hasn’t healed. You should stop torturing yourself.”"
      },
      {
        "paragraph": "“Send me back to the manor.”"
      },
      {
        "paragraph": "Hadley heaved a sigh of relief, knowing that he was not going to look for Catherine. Otherwise, it would\nbe troublesome if his wound opened up like how it did last time and gave him a fever."
      },
      {
        "paragraph": "“By the way, buy more of Suzie’s favorite toys for me, ” Shaun reminded."
      },
      {
        "paragraph": "Hadley was stunned, but he immediately nodded. Accompanying his daughter more often was a much\nbetter choice than getting into a relationship."
      },
      {
        "paragraph": "At 5:00 p.m., Liam picked Suzie up from preschool."
      },
      {
        "paragraph": "Shaun had waited for a long time, yet Catherine did not share anything on Facebook."
      },
      {
        "paragraph": "Suzie jumped around while holding a cotton candy ball. However, when the little kid caught sight of\nShaun in the wheelchair, she froze. “Uncle Shaun, why is your leg crippled?”"
      },
      {
        "paragraph": "“No, I just had an operation. My wound hasn’t healed yet, so I can’t walk,” Shaun replied softly."
      },
      {
        "paragraph": "“Uncle Shaun, you’re so pitiful.” Suzie’s eyes flashed with sympathy. Although he was scummy, he was\nstill her biological father. “Let me blow on your wound, okay?”"
      },
      {
        "paragraph": "“It’s fine. I already feel much better.” Shaun’s heart melted. “ I’ve bought you many toys. Uncle Hadley\nhas already put them in your room. There are kitchen utensils, a makeup box, PAW Patrol, and many\nmore.”"
      },
      {
        "paragraph": "“That’s great. Thank you, Uncle Shaun.” Suzie leaped with joy, but she calmed down very soon. “"
      },
      {
        "paragraph": "Hang on. My mom said there’s no such thing as a free lunch.”"
      },
      {
        "paragraph": "Shaun was speechless."
      },
      {
        "paragraph": "Liam could not help but laugh at him. “Suzie, your mom is absolutely right. He gave you a free lunch\nwithout reason…”"
      },
      {
        "paragraph": "“Liam…” Shaun darted a cold glance at him. “I’ve long since reminded you.” Liam snorted. “"
      },
      {
        "paragraph": "Now, you finally regret it. But sadly, nothing in the world can cure regrets. Those who got hurt can’t\npretend that nothing has happened. What’s more… Logan is really important to Cathy.”"
      },
      {
        "paragraph": "Shaun clenched the arm of his wheelchair. “You were the one who sent her overseas back then, so you\nshould be well aware of the history between Logan and her. Can you tell me about it?”"
      },
      {
        "paragraph": "“Don’t you hold a grudge against me for bribing the doctor to fake her death and sending her overseas?”\nLiam sneered at him. “I can still remember how you punched me.”"
      },
      {
        "paragraph": "Shaun’s attractive brows had a hint of annoyance. Yes, he did hit Liam, but should he personally\napologize to Liam?"
      },
      {
        "paragraph": "In order to understand Catherine better, Shaun had no choice but to take a deep breath and said\nreluctantly, “Liam, I have to admit that I was impulsive back then. You were right.”"
      },
      {
        "paragraph": "At that time, he did not feel so as he was not in love with Catherine. Now that he recalled it, he would\ndefinitely be miserable if Catherine had died."
      },
      {
        "paragraph": "Liam glanced at him with astonishment. He did not expect that Shaun would apologize to him. Maybe\npigs could fly!"
      },
      {
        "paragraph": "“Fine. I’ll tell you. Logan and Austin were both brought up in the slums of Country A. In order to survive,\nthey were dispatched to an organization at a very young age to carry out missions. However, the things\nthey did were disgraceful. Logan and Austin wanted to defect, but the organization hunted them down."
      },
      {
        "paragraph": "“Cathy, who went there two years ago, happened to save them, and what they have to do in return is to\nwork for her unconditionally for five years. The two of them are Cathy’s right-hand men, and they’ve been\nvery loyal to her.”"
      }
    ]
  },
  {
    "title": "Chapter 918 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“When Cathy encountered a few dangers overseas, she was fortunate enough to have Logan and Austin\nprotect her. It was Logan who taught Cathy self- defense skills as well. Both of them are her coaches and\nher family.”"
      },
      {
        "paragraph": "“Why was she in danger overseas?” Shaun asked nervously."
      },
      {
        "paragraph": "“Please, do you think overseas is safe for a pretty woman like her who is unfamiliar with the place?” Liam\nmocked him. “She has suffered a lot to be who she is today.”"
      },
      {
        "paragraph": "She even had to look after two children while working her fingers to the bone. She was so exhausted that\nshe fell sick very often."
      },
      {
        "paragraph": "However, he must not let Shaun know about it."
      },
      {
        "paragraph": "“Actually, if it hadn’t been for you and Sarah, she wouldn’t have had to go overseas.”"
      },
      {
        "paragraph": "The more Liam went on about it, the more infuriated he became, so he took Suzie and left."
      },
      {
        "paragraph": "Suzie immediately entered her playroom."
      },
      {
        "paragraph": "Although she could not see her mother, the Hill family treated her very well with all the toys they bought\nher."
      },
      {
        "paragraph": "She had only been playing for a short while, Shaun came in a wheelchair."
      },
      {
        "paragraph": "“When Cathy encountered a few dangers overseas, she was fortunate enough to have Logan and Austin\nprotect her. It was Logan who taught Cathy self- defense skills as well. Both of them are her coaches and\nher family.”"
      },
      {
        "paragraph": "“Suzie, I need your help. Pretty please, ” Shaun whispered. Never had he thought that he would one day\nneed to beg his daughter. “Can you help me to ask Aunty Cathy out? Just say that you’d like to play with\nher.”"
      },
      {
        "paragraph": "“Uncle Shaun, didn’t you stop me from being in touch with Aunty Cathy?” Suzie raised her head and said\ndeliberately, “You said she’s a wicked woman for kidnapping me.”"
      },
      {
        "paragraph": "Shaun put his hand on his forehead. He wished he could bite his tongue off. “I misunderstood her back\nthen. I… I love her very much, and I want to be"
      },
      {
        "paragraph": "with her. Suzie, help me. As long as you promise me, I’ll do anything you want me to.”"
      },
      {
        "paragraph": "“I don’t want you to do anything. I just don’t want you to hurt Aunty Cathy anymore.”"
      },
      {
        "paragraph": "Suzie pouted. “Daddy said you hurt Aunty Cathy very badly this time. You even helped Aunty Sarah to\ndeal with Aunty Cathy, who didn’t even rest at all because she had to search for evidence. I won’t\nmatchmake you and Aunty Cathy anymore.”"
      },
      {
        "paragraph": "Shaun felt miserable. “I’ve reflected on myself. Once I get back together with her, I’ll definitely take good\ncare of her and love her…”"
      },
      {
        "paragraph": "“ It’s fine. Someone can do this better than you, ”"
      },
      {
        "paragraph": "Suzie blurted out."
      },
      {
        "paragraph": "Shaun was stunned. However, his handsome face soon turned grim, and he raised his tone in spite of\nhimself. “Who?”"
      },
      {
        "paragraph": "Who could do better than him?"
      },
      {
        "paragraph": "Could it be that Catherine had another man?"
      },
      {
        "paragraph": "At the thought of this possibility, Shaun’s chest burned."
      },
      {
        "paragraph": "“Oh no. Uncle, you look terrifying. ” Aware that she had spilled the beans, Suzie was so frightened that\nshe wanted to run away."
      },
      {
        "paragraph": "“Suzie, don’ t be scared. ” Shaun endured the pain and got out of his wheelchair. He hugged her and\nsaid imploringly, “I really love Catherine. Yes, I’ve hurt her a lot of times before, and it pains me too. I\nknow I shouldn’t bother her, but I can’t stop thinking about her all the time…”"
      },
      {
        "paragraph": "“Why didn’t you feel this way about her when you were with Aunty Sarah?”"
      },
      {
        "paragraph": "Suzie spoke bluntly with a dazed expression. “I…” Shaun was at a loss for words. “I did think about her,\nbut I kept my feelings to myself because I misunderstood her at that time. I thought she was a bad\nwoman…”"
      },
      {
        "paragraph": "“So you don’t like Aunty Cathy just because she’s bad? It shows that you only like kind women. But there\nare a lot of kind women out there. Does it mean that you like all of them?” Suzie’s question made Shaun\nspeechless again."
      }
    ]
  },
  {
    "title": "Chapter 919 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Indeed, Shaun always talked about how bad and wicked Catherine was."
      },
      {
        "paragraph": "Since there were many kind women out there, did he like them all? Nope."
      },
      {
        "paragraph": "Suzie pouted. “Why do you like Aunty Cathy then? You don’t like her when she’s bad, so you only like\nher when she’s not bad?”"
      },
      {
        "paragraph": "Shaun cast Suzie a strange look. “ I realized that… you might look similar to Liam, but you don’t take\nafter his personality. You’re so articulate at a young age, and I think you’re like me. You can become a\nlawyer in the future.”"
      },
      {
        "paragraph": "Deep down, Suzie mumbled. She was not Liam’s daughter in the first place. “I don’t want to be like you.\nGreat-grandma said that you’re a scumbag. I don’t want to be a scumbag’s daughter.”"
      },
      {
        "paragraph": "Shaun touched his nose bitterly. It seemed like everyone in Australia had confirmed that he was a\nscumbag."
      },
      {
        "paragraph": "“You’re right, Suzie. Back then, I was… too extreme. When I like someone, I should like both her good\nand bad sides. Unfortunately, I grasped it too late. Please help me…”"
      },
      {
        "paragraph": "“No.” Suzie rejected him mercilessly. “If I lie to Aunty Cathy for your sake, she might not want to see me\nagain. Since you did something wrong, you should sort out the problem yourself.”"
      },
      {
        "paragraph": "“But she won’t meet me.” Shaun’s face was filled with desolation."
      },
      {
        "paragraph": "Indeed, Shaun always talked about how bad and wicked Catherine was."
      },
      {
        "paragraph": "Suzie glanced at his face that resembled hers. As his daughter, she sympathized with him a little. “\nMommy used to tell me that as long as you put your mind to it, you can do it. Also, it’s shown on TV that\na persistent man can eventually soften a woman’s heart. You should ponder over it.”"
      },
      {
        "paragraph": "With that, the little kid quickly ran away."
      },
      {
        "paragraph": "Shaun was stunned. He did not expect that he would one day have a little brat to guide him through\nrelationships."
      },
      {
        "paragraph": "However, when he thought it over, he found it quite logical."
      },
      {
        "paragraph": "He might as well continue to pester her in the belief that she would forgive him someday."
      },
      {
        "paragraph": "After dinner, he reflected for a moment before he asked his chauffeur to send him to Hackett Institute.\nWhile bearing the pain on his wound, he bent over and placed the candles on the plaza downstairs to\nform the word ‘sorry’."
      },
      {
        "paragraph": "Every time he bent over, it hurt him so much as his wound tore open. However, he tried his best to\nendure the pain."
      },
      {
        "paragraph": "When he finally lit the candles, he had already attracted many onlookers in the neighborhood."
      },
      {
        "paragraph": "One of the boys approached Shaun and looked at him. “Sir, it’s you again.”"
      },
      {
        "paragraph": "Within seconds, Shaun recognized him as the boy who lived next to Catherine. He had bumped into him\na few times. “Yeah. I offended her.”"
      },
      {
        "paragraph": "“Oh, but putting candles like this won’t work.” The boy tilted his head and said, “That lady moved out\nyesterday morning. I even bumped into her, and"
      },
      {
        "paragraph": "she told me that she’d never come back anymore.” Ding."
      },
      {
        "paragraph": "The lighter in Shaun’s hand dropped onto the floor. His head began to buzz."
      },
      {
        "paragraph": "He did not expect that she would move out just like that. Did it mean that she no longer wanted to see\nhim?"
      },
      {
        "paragraph": "An inexplicable sense of bitterness washed over him."
      },
      {
        "paragraph": "The boy glanced at Shaun sympathetically and said, “My mom said that both of you are the most\nmiserable couple she has ever seen. You guys argue with each other several times a month. That lady is\nprobably sick of arguing with you this time. Hurry u p and go back. Stop placing the candles here, or it\nmight cause a fire.”"
      },
      {
        "paragraph": "The boy left as soon as he finished speaking."
      },
      {
        "paragraph": "Shaun raised his head and glanced at the floor that Catherine used to live on. The corners of his mouth\npulled into a sad smile."
      }
    ]
  },
  {
    "title": "Chapter 920 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun had trouble sleeping last night again. When he got up in the morning and put on his clothes,\nRodney’s deafening knocks on the door suddenly rang from the outside."
      },
      {
        "paragraph": "As soon as he opened the door, Rodney rushed in. The wound on his face had not healed, and his\nalluring eyes were filled with rage. “Shaun Hill, how dare you publicly announce that you’ve broken up\nwith Sarah. You even claimed that both of you would never get back together. Are you human? She has\nhurt herself so badly. Why must you torture her?”"
      },
      {
        "paragraph": "The fuss Rodney made caused Shaun’s head to hurt. “Did the Snow family just release you?”"
      },
      {
        "paragraph": "“Duh. I just went to visit Sarah, and she has slit her wrist to kill herself again because of you. Shaun, I f*\ncking feel like killing you.”"
      },
      {
        "paragraph": "Boiling with anger, Rodney pointed at him. “Hasn’t she suffered enough from the kidnap last time? I\nthought you’d protect her when the Snow family locked me up. But it turns out that you believe what"
      },
      {
        "paragraph": "other people say about Sarah plotting the incident. It wouldn’t take an idiot to know that Sarah couldn’t\nhave done such a thing.”"
      },
      {
        "paragraph": "At the sight of Rodney’s reaction, Shaun found himself so angry that he did not know what to say. He\nseemed to have grasped why Catherine always used to call him blind. It was probably because\nwhenever Catherine confronted him, he would act as how Rodney just did."
      },
      {
        "paragraph": "He really wanted to hit Rodney’s head with a hammer."
      },
      {
        "paragraph": "“Rodney, it’s true that the matter has nothing to do with Catherine and Logan…”"
      },
      {
        "paragraph": "Shaun had trouble sleeping last night again. When he got up in the morning and put on his clothes,\nRodney’s deafening knocks on the door suddenly rang from the outside."
      },
      {
        "paragraph": "“After all, you’re biased toward Catherine. You’ve been so bewitched by her that you can’t differentiate\nright from wrong, ” Rodney shouted at him."
      },
      {
        "paragraph": "Shaun’s temples pulsed, and he said indifferently, “ Enough. No matter how you criticize and advise me,\nI’ve made up my mind. Since I have no feelings for Sarah anymore, I should keep a distance from her.\nShe should have her own life too. I can’t possibly protect her forever. So when both of you meet up next\ntime, you don’t have to invite me. Even if you kneel in front of me now, I won’t change my mind.”"
      },
      {
        "paragraph": "“Great, Shaun. I’ll remember your words. From now on, I, Rodney Snow, do not have a cruel buddy like\nyou anymore. Since you don’t want Sarah, I do. I’ll be responsible for the rest of her life.”"
      },
      {
        "paragraph": "Rodney kicked the door and left in a huff."
      },
      {
        "paragraph": "Disappointed, Shaun rubbed his forehead. He did not expect that his relationship with Rodney would one\nday end in such a state because of a woman."
      },
      {
        "paragraph": "However, he did not want anyone to affect or threaten his relationship anymore."
      },
      {
        "paragraph": "Whether he loved a person or not, he had to make it clear."
      },
      {
        "paragraph": "In the mall."
      },
      {
        "paragraph": "Sarah was casually shopping around."
      },
      {
        "paragraph": "All of a sudden, a sleazy-looking, fat man clutched onto her arm. “Hey, Sarah. Are you shopping around?\nWhat are you planning to buy? I can buy it for you as long as you become my woman.”"
      },
      {
        "paragraph": "“Young Master Russell, let go of me.”"
      },
      {
        "paragraph": "Sarah struggled with all her strength, and her pure face was filled with panic."
      },
      {
        "paragraph": "However, Young Master Russell was more tempted to have her the more she struggled. “Why are you\nstill so reserved? You used to have Shaun and Chester protect you, but I heard they don’t care about you\nanymore. Shaun even announced to the public that he would never get back together with you. But I’m\nquite interested in the woman of Australia’s wealthiest man.”"
      },
      {
        "paragraph": "“Herman, I don’t even like you. Let go of me now. You’re hurting me.”"
      },
      {
        "paragraph": "She begged softly."
      },
      {
        "paragraph": "Herman Russell melted upon hearing her. “My darling, you sound so sweet. I’m particularly eager to hear\nyou invite me to bed with you. Let’s go. No matter what, I have to take you away today.”"
      },
      {
        "paragraph": "He dragged her away by force."
      },
      {
        "paragraph": "When Yael spotted Herman almost hugging Catherine, she dashed out and gave him a kick before she\nhurriedly protected Sarah in her arms."
      },
      {
        "paragraph": "“How dare you b*stard kick me. You’ve lived…” Herman lifted his head, only to see Yael’s stony\nexpression. He instantly choked. “Are you from Liona?”"
      }
    ]
  },
  {
    "title": "Chapter 921 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Hurry up and get lost,” Yael warned."
      },
      {
        "paragraph": "Herman glared at her with fury, but he could only do as he was told. After all, he could not afford to\nprovoke Shaun, who was in charge of Liona."
      },
      {
        "paragraph": "However, he did not think that someone from Liona was still protecting Sarah. Shaun had asked Yael to\nleave, had he not?"
      },
      {
        "paragraph": "Only after Herman left did Yael immediately lift Sarah up to her feet. “Are you okay, Miss Neeson? It’s my\nfault. I only managed to sneak back to Australia a few days ago, and I didn’t expect…”"
      },
      {
        "paragraph": "“Yael, I’m thankful for you. Otherwise, I would’ve jumped off the building today. ” Sarah hugged Yael and\nburst into tears. “Now that everyone knows that I’ve lost my pillar, a lot of them have come to humiliate\nme.”"
      },
      {
        "paragraph": "Yael was both heartbroken and angry to hear that. “ Eldest Young Master is really cruel. You’ve known\nhim for more than ten years. It’s okay if he doesn’t want you, but he didn’t have to announce it to the\npublic.”"
      },
      {
        "paragraph": "“Drop it, Yael. If Shaunic realizes that you’re back, he might destroy your tendons. ” Sarah pushed her\naway in a state of panic. “He can be so heartless towards me, much less you.”"
      },
      {
        "paragraph": "Yael shuddered and recalled Eldest Young Master thinking about kicking her out of Liona."
      },
      {
        "paragraph": "“Yael, don’t stay by my side anymore. If Shaunic gets back together with Catherine in the future, you\nmust remember to please Catherine, okay?” Sarah reminded her concernedly, “ It’s not worth staying"
      },
      {
        "paragraph": "“Hurry up and get lost,” Yael warned."
      },
      {
        "paragraph": "with me.”"
      },
      {
        "paragraph": "Yael almost burst out crying. The public always dreaded people from Liona, but they did not know that\nshe was merely a bodyguard in the Hill family who treated her like a dog. Only Sarah took her as a\nfriend. Even up until this day, Sarah had been genuine in looking out for her."
      },
      {
        "paragraph": "“Leave now.” Sarah pushed her away with tears in her eyes."
      },
      {
        "paragraph": "Only after Yael left did Sarah give someone a call. “ She has left…”"
      },
      {
        "paragraph": "Spaced out, Yael was just about to get into her car in the car park when a middle-aged man with"
      },
      {
        "paragraph": "sunglasses suddenly approached her. “Miss Chadwick, I’d like to have a word with you.”"
      },
      {
        "paragraph": "“Who are you? Go away.” Yael glowered at him."
      },
      {
        "paragraph": "Nevertheless, the man in sunglasses blocked her way, and the corners of his mouth twitched. “I know\nyou’re a member of Liona, but are you planning to be Shaun’s dog forever?”"
      },
      {
        "paragraph": "Yael was taken aback."
      },
      {
        "paragraph": "On the upper floor of the mall."
      },
      {
        "paragraph": "Sarah had ordered a cup of coffee. As she slowly stirred it, the music in the cafe suddenly changed into\na sweet tune."
      },
      {
        "paragraph": "After that, a servant pushed a large three-tier cake toward her. On top of the cake were the two words\n‘Marry Me’ written with jam."
      },
      {
        "paragraph": "While Sarah was stunned, she saw Rodney coming toward her with a large bouquet of flowers. Then, he\nsank to his knees in front of her. “Sarah, please marry me. To be honest, I’ve liked you for a long time\nnow, ever since we were studying, but you were in a relationship with Shaun at that time. Since Shaun\ncan’t make you happy, I’ll do it. I might not be as outstanding as him, but I’ll give"
      },
      {
        "paragraph": "you all my love, and this will never ever change.”"
      },
      {
        "paragraph": "“Rodney…” Sarah was dazed for a moment, but she promptly played along with her eyes red. “I… I\nreally don’t deserve you.”"
      },
      {
        "paragraph": "“Enough. In my eyes, you’re the purest woman, and I want you to be my wife. Please give me a chance.”\nRodney raised his head affectionately. “ Don’t reject me.”"
      },
      {
        "paragraph": "“…Okay.” Sarah finally nodded. At present, it was impossible for her to get back together with Shaun\nanymore, so she could only marry Rodney reluctantly. Although Rodney could not inherit Snow\nCorporation, at least she would not be taunted and teased anymore."
      },
      {
        "paragraph": "“That’s wonderful, Sarrah. Thank you.” Rodney cautiously put a ring on her finger and wrapped her into\nhis arms."
      },
      {
        "paragraph": "At the side, some people had taken videos and photos of them and shared them online. Soon, ‘ Young\nMaster Snow Proposed To Sarah’ made it to the trending searches."
      },
      {
        "paragraph": "[Damn, how lucky of Sarah. Shaun had just dumped her, yet here Young Master Snow was, proposing to\nher immediately after.]"
      }
    ]
  },
  {
    "title": "Chapter 922 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "[It shows that Sarah is a good woman who deserves to be cherished. Otherwise, Shaun wouldn’t have\nloved her, and Rodney wouldn’t have spent ten years waiting for her. How touching.]"
      },
      {
        "paragraph": "[Is Sarah trying to take revenge on Young Master Hill? If not, why would she agree to marry Young\nMaster Snow so soon?]"
      },
      {
        "paragraph": "[What a slap in the face. I wonder if Young Master Hill regrets it.]"
      },
      {
        "paragraph": "Freya was lying on the couch in Brighton Gardens while Catherine cooked for her. The moment she\ncaught sight of the news, she was so shocked that she nearly choked on the chips."
      },
      {
        "paragraph": "“Hey, Cathy. Take a look at this. Rodney, that annoying man, has proposed to Sarah.” Freya hurriedly ran\nto Catherine to share the gossip with her. “What a bad match! A cow dunk has stained the cake.”"
      },
      {
        "paragraph": "Catherine blinked. “In your eyes, Rodney has become a cake?”"
      },
      {
        "paragraph": "Freya blinked. “I just feel sorry for him. Actually, he shouldn’t be labeled as a bad man even though his\nremarks could be wicked at times. There’s just something wrong with his mind, like Shaun. No, I think his\nissue is more serious than Shaun’s.”"
      },
      {
        "paragraph": "“ I didn’t expect the Snow family to release him so soon. I reckon… the Snow family’s blood must be\nboiling right now.” Catherine pondered. “His proposal has caused quite a commotion. It has even made it\nto the top searches.”"
      },
      {
        "paragraph": "“I’m sure she has paid to be in the top searches.” Freya ridiculed, “It has only been a few days since\nShaun publicly announced that he’ll never get back together with Sarah. Yet now, she has agreed to"
      },
      {
        "paragraph": "[It shows that Sarah is a good woman who deserves to be cherished. Otherwise, Shaun wouldn’t have\nloved her, and Rodney wouldn’t have spent ten years waiting for her. How touching.]"
      },
      {
        "paragraph": "marry Rodney. What a wh*re.”"
      },
      {
        "paragraph": "“ Isn’t this normal? Since Shaun has refused to get back together with her, she can only hold onto\nRodney.” Catherine’s face was filled with sarcasm. “ I wonder how Shaun will react to this.”"
      },
      {
        "paragraph": "“Haha. He must be boiling with anger. He probably thought that Sarah would be loyal to him forever,\nwhen in fact, she’s a clever person.”"
      },
      {
        "paragraph": "In the office of Hill Corporation."
      },
      {
        "paragraph": "When Shaun received the photo of Rodney proposing to Sarah, he was not jealous nor exasperated at\nthe sight of the two of them hugging each other. However, his brows furrowed deeply."
      },
      {
        "paragraph": "Perhaps he was surprised at how soon Sarah agreed to Rodney’s proposal when she was just making a\nscene about how much she loved him a few days ago."
      },
      {
        "paragraph": "Was she trying to take revenge on him?"
      },
      {
        "paragraph": "Or did she know that she could no longer pin her hopes on him, so she held onto Rodney? After all, no\nmatter family background or appearance, Rodney was one of the top five Young Masters in Canberra."
      },
      {
        "paragraph": "It finally hit Shaun that he did not understand Sarah."
      },
      {
        "paragraph": "Amid his thoughts, Rodney gave him a call. “Have you seen it? I’ve proposed to Sarah. Since you don’t\ncherish her, I will, and I’ll stay by her side from now on.”"
      },
      {
        "paragraph": "“Well… Congratulations.” Shaun thought for a moment before he congratulated Rodney. Anyhow, this\nwas not a bad thing. Sarah would stop pestering him, and Rodney would be able to fulfill his wishes at\nthe same time."
      },
      {
        "paragraph": "“…Aren’t you mad?” Rodney was a little disappointed to find that his action had no impact on Shaun."
      },
      {
        "paragraph": "“What should I do, then? Now that you’ve proposed to Sarah, am I supposed to snatch her away from\nyou?” Shaun said nonchalantly, “I meant it when I said that I don’t love her anymore. You can send me a\nwedding invitation when the time comes.”"
      },
      {
        "paragraph": "After that, Shaun hung up the call. Rodney stared at the phone with a strange feeling. He felt as if he\nwas the abandoned woman eager to see Shaun regret, yet Shaun was not at all upset."
      }
    ]
  },
  {
    "title": "Chapter 923 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "While Rodney was down, Old Master Snow’s call suddenly came in."
      },
      {
        "paragraph": "Rodney was so frightened that he almost threw his phone away. Seeing a call from the Snow family\nnow was like seeing the king of hell coming for his life."
      },
      {
        "paragraph": "Then, the phone stopped ringing, but soon, another call came in. The cycle kept going on and on."
      },
      {
        "paragraph": "Left with no choice, Rodney could only pick up the call. “Grandpa…”"
      },
      {
        "paragraph": "“How dare you still call me your grandpa for turning a deaf ear to my words? You wicked thing. I\nshouldn’t have let you out. ” Old Master Snow was exasperated. “I’ve only just let you out this morning,\nand you’ve proposed to Sarah by evening. Come back, and I’ll beat you to death.”"
      },
      {
        "paragraph": "“Grandpa, Sarah is really pitiful. I must stand up to protect her this time. I don’t understand why all of\nyou have such prejudice toward Sarah.”"
      },
      {
        "paragraph": "Rodney said frustratingly, “Catherine is an outsider, yet all of you believe everything she says. I’m your\nbiological grandson. Do you think I can’t tell whether Sarah is a good person or not?”"
      },
      {
        "paragraph": "“Shut your mouth, you idiot, ” Old Master Snow scolded. “If you dare marry Sarah, don’t bother coming\nback to the Snow family ever again.”"
      },
      {
        "paragraph": "“I’m sorry, Grandpa. I must marry Sarah,” Rodney replied without hesitation."
      },
      {
        "paragraph": "“Very well, Rodney Snow. Don’t you regret this.”"
      },
      {
        "paragraph": "While Rodney was down, Old Master Snow’s call suddenly came in."
      },
      {
        "paragraph": "Old Master Snow threw the phone aside in a fit of anger. The old man was so pissed off that he almost\nfainted."
      },
      {
        "paragraph": "“Dad, calm down.” Jason tried to soothe him. “Get lost. What a rotten son you have. He exists"
      },
      {
        "paragraph": "only to make me angry.” Old Master Snow lost his temper."
      },
      {
        "paragraph": "Jason sighed. Old Master Snow had obviously forgotten that Rodney was the Snow family’s first\ngrandchild. When Rodney was born, Old Master Snow grinned ear to ear every day and treated\nRodney very preciously."
      },
      {
        "paragraph": "“Go. Go and call Jessica back,” Old Master Snow ordered."
      },
      {
        "paragraph": "Soon, Jessica came back."
      },
      {
        "paragraph": "Old Master Snow said, “Jessica, I have a task for you. I don’t care what method you use, but you\nmustn’t let Rodney marry that woman, Sarah, into the family.”"
      },
      {
        "paragraph": "Jessica’s head hurt. Why did these kinds of trivial matters always fall on her shoulders?"
      },
      {
        "paragraph": "“There’s no other way.” Old Master Snow was helpless. “You’re the most hard-hearted person in the\nSnow family. Only you can bear to do this.”"
      },
      {
        "paragraph": "Jessica smiled bitterly. She did not know if she should be happy or sad at that fact."
      },
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "During the launching banquet of Osher Corporation’s new product, Rodney was all smug."
      },
      {
        "paragraph": "In his career, obtaining a super trump card that was Freya had enabled the company to launch a\nfirming serum. Many employees had already tested the serum, and the effects were excellent. Hence,\nhe could see a breakthrough in Osher Corporation’s sales again."
      },
      {
        "paragraph": "As for his love life, Sarah, whom he had loved secretly for more than ten years, finally said yes to his\nproposal. At this moment, he felt like his life was perfect."
      },
      {
        "paragraph": "Chester, who was holding a glass of wine, gave him a side glance. “Put away that silly smile of yours.\nYou haven’t stopped smiling ever since I walked in the door.”"
      },
      {
        "paragraph": "Cindy smiled. “It can’t be helped. Young Master Rodney now has both his career and the love of his\nlife. By the way, Young Master Snow must’ve invited Sarah over tonight, but why can’t I spot her?”"
      },
      {
        "paragraph": "“She’s here.” After Rodney spoke, his eyes lit up at the sight of the woman who had just entered the\nroom."
      },
      {
        "paragraph": "That night, Sarah wore a red velvet mermaid-style dress that had a high slit at the side and a large\ngirlish ribbon on the neckline. The dress made her look fairer and gave off a playful, girlish vibe."
      },
      {
        "paragraph": "When she appeared, it was as if all spotlights were on her. The red color was especially eye-catching."
      },
      {
        "paragraph": "Beside her, Thomas wore a black suit. As both brother and sister walked over, they caught everyone’s\nenvious and jealous gazes."
      },
      {
        "paragraph": "If there were a woman that all women of Australia envied at the moment, it would naturally be Sarah."
      }
    ]
  },
  {
    "title": "Chapter 924 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Although Sarah had lost Young Master Hill, she still had Young Master Snow, whose family would most\nprobably produce the new prime minister for next year."
      },
      {
        "paragraph": "“No wonder Young Master Snow couldn’t forget her. She’s very beautiful indeed.”"
      },
      {
        "paragraph": "“Isn’t she? Her figure is so good, and she’s such a stunner.”"
      },
      {
        "paragraph": "When Sarah heard the series of compliments, she started to feel smug."
      },
      {
        "paragraph": "So what if she had lost Shaun? She could still be everyone’s center of attention."
      },
      {
        "paragraph": "Cindy secretly felt envious as she looked on. She initially looked down at Sarah when Shaun dumped\nher, but who would expect…"
      },
      {
        "paragraph": "Chester was the only one with a frown. He had caught the hidden smugness in Sarah’s eyes the moment\nshe walked in just now."
      },
      {
        "paragraph": "Although it was gone in an instant, it was strange."
      },
      {
        "paragraph": "She clearly loved Shaun for more than 1o years and had just broken up. She even attempted suicide for\nShaun before. Could she indulge herself in a relationship with Rodney in just a few days?"
      },
      {
        "paragraph": "He suddenly realized that maybe they did not truly understand Sarah before."
      },
      {
        "paragraph": "She had changed a long time ago."
      },
      {
        "paragraph": "Although Sarah had lost Young Master Hill, she still had Young Master Snow, whose family would most\nprobably produce the new prime minister for next year."
      },
      {
        "paragraph": "However… He glanced at Rodney, who was smiling sweetly, and secretly let out a helpless sigh."
      },
      {
        "paragraph": "Forget it. It was fine as long as Rodney liked it. He finally got his wishes fulfilled."
      },
      {
        "paragraph": "“ Sarah… ” Rodney immediately went forward and held Sarah’s hand."
      },
      {
        "paragraph": "“Rodney, don’t do this. Many people are watching, and I’m still not too comfortable with it.” A trace of\nawkwardness flashed across Sarah’s eyes, especially when she saw Chester’s gaze. “Chester, you\ncame too…”"
      },
      {
        "paragraph": "Her eyes wandered around hesitantly after she spoke."
      },
      {
        "paragraph": "“I didn’t invite Shaun.” Rodney could guess her thoughts."
      },
      {
        "paragraph": "“ Is that a good idea?” Sarah said worriedly, “After all, he’s your best friend. You invited Chester, but not\nhim. What will other people say?”"
      },
      {
        "paragraph": "“Sarah, Shaun has hurt you quite deeply, yet you’re still so considerate of us, ” Rodney said\naffectionately."
      },
      {
        "paragraph": "“I don’t want to affect the relationship between you both.” After all the talking, Sarah realized that\nalthough Rodney was touched, Chester was still indifferent to her."
      },
      {
        "paragraph": "Her heart sank. Did Chester notice something?"
      },
      {
        "paragraph": "“Okay, Rodney. The press conference is about to start, ” Chester reminded him."
      },
      {
        "paragraph": "Soon, Freya, who was the cosmetic chemist, came downstairs."
      },
      {
        "paragraph": "She wore an off-shoulder vintage red mermaid- style dress that exposed her shoulders. Her skin was as\nfair as snow, and there was a diamond necklace o n her beautiful collarbone. Matched with her mixed\nrace -like deep-set cheeks, no one could take their eyes off her."
      },
      {
        "paragraph": "“Wow, this must be the new research and development director of Osher Corporation. She’s so pretty.”"
      },
      {
        "paragraph": "“Isn’t she? They both wore red dresses, but she has completely defeated Sarah.”"
      },
      {
        "paragraph": "“Watch yourself. Sarah is Rodney Snow’s fiancee after all. But both of them are different. Sarah is just a\npretty face, while Freya is pretty and capable.”"
      },
      {
        "paragraph": "“I heard Osher Corporation gave Freya some shares as an invitation for her to join the company. She’s\nnow Osher Corporation’s shareholder.”"
      },
      {
        "paragraph": "“ I wonder if she’s looking for a boyfriend. I really want to get acquainted with her.”"
      },
      {
        "paragraph": "The discussion made Sarah’s blood boil."
      },
      {
        "paragraph": "For that night’s look, she had prepared for an entire day to have that effect."
      }
    ]
  },
  {
    "title": "Chapter 925 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Sarah really suspected that she, Catherine, and Freya were sworn enemies. Otherwise, why would they\nannoy her wherever she went?"
      },
      {
        "paragraph": "Thomas, who was by her side, stared deadly at Freya with visible greed in his eyes."
      },
      {
        "paragraph": "“Sarah, I must get this woman today.”"
      },
      {
        "paragraph": "Thomas whispered in Sarah’s ear, “I didn’t think Freya would become such a dazzling beauty. There are\nno downsides for me if I marry her.”"
      },
      {
        "paragraph": "“Okay, I support you. It just so happens that there are many reporters here tonight. You can take\nadvantage of this opportunity, but be careful.” Sarah took a deep breath. She could get her revenge out\nof spite. Once Freya married Thomas, she would have many chances to deal with her."
      },
      {
        "paragraph": "“I will.”"
      },
      {
        "paragraph": "Thomas nodded his head sleazily."
      },
      {
        "paragraph": "On the stage, Freya was already introducing the new product to everyone."
      },
      {
        "paragraph": "“Good evening, everyone. I’m Freya, the person in charge and also the cosmetic chemist of the new\nproduct…”"
      },
      {
        "paragraph": "Rodney stared at Freya nervously. At first, he was worried about letting her introduce the product on her\nstage."
      },
      {
        "paragraph": "Sarah really suspected that she, Catherine, and Freya were sworn enemies. Otherwise, why would they\nannoy her wherever she went?"
      },
      {
        "paragraph": "Yet, little did he know that she would be so graceful and natural in front of all the media. On top of that\npretty face of hers, she was very pleasing to the eye."
      },
      {
        "paragraph": "It was rare for him to be impressed by Freya."
      },
      {
        "paragraph": "It seemed like inviting her to join Osher Corporation was a wise decision."
      },
      {
        "paragraph": "“Rodney…” Sarah suddenly wrapped his arm around his. She forced a smile and said, “I didn’t think Ms.\nLynch would wear a red dress tonight as well. I wouldn’t have worn a red dress too if I had"
      },
      {
        "paragraph": "Rodney was stunned. Thomas immediately sighed and said, “What a coincidence that Sarah wore a red\ndress too. Everyone was comparing them both just now. They said Freya’s temperament completely\ncrushed Sarah’s or something…”"
      },
      {
        "paragraph": "“Brother…” Sarah glared at Thomas. “It’s not specified that I’m the only one who can wear a red dress.”"
      },
      {
        "paragraph": "“I suspect she did it on purpose. It’s not like Catherine hasn’t done that kind of thing in the past. Since\nFreya and Catherine are good friends, they naturally learn from each other. However, you and Shaun\nhave already broken up. She has no reason to target you, ” Thomas complained."
      },
      {
        "paragraph": "Rodney’s brows knitted into a tight frown. He did not say a word."
      },
      {
        "paragraph": "“Rodney, don’t mind him. This is my brother’s personality, ” Sarah said in a hurry."
      },
      {
        "paragraph": "“It’s okay. What your brother said is right. You’re m y girlfriend now. How can you be compared to a mere\ncosmetic chemist?”"
      },
      {
        "paragraph": "Rodney spoke with a low voice as he watched Freya, who was on the stage."
      },
      {
        "paragraph": "Sarah and Thomas secretly made eye contact. There was a hint of smugness in their eyes."
      },
      {
        "paragraph": "After Freya finished her speech, she went down the stage with the help of an employee."
      },
      {
        "paragraph": "That was when Secretary Lane came over and said, “ Ms. Lynch, President Snow has requested to see\nyou upstairs.”"
      },
      {
        "paragraph": "Freya nodded. She thought Rodney wanted to discuss something work-related."
      },
      {
        "paragraph": "When she arrived at the room upstairs, Rodney was standing in front of the window. He wore a white\ntailored suit matched with a pink shirt inside. His hands were tucked lazily in his pockets."
      },
      {
        "paragraph": "If it were other men, they would look very tacky dressed up like that. However, Rodney’s evil- looking\nattractive face could carry that flashy outfit. He looked very handsome, like a famous young celebrity."
      },
      {
        "paragraph": "Of all things, that piece of cake had to be stained with a cow dunk, which was Sarah."
      }
    ]
  },
  {
    "title": "Chapter 926 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“I’ve prepared a dress for you. Change into it before you go down.” Rodney pointed at a dark green\ndress on the sofa with his chin."
      },
      {
        "paragraph": "“My clothes are fine. Why do I have to change it?” Freya was puzzled."
      },
      {
        "paragraph": "“The color of your dress is the same as Sarah’s,” Rodney said calmly. “ Since she’s my fiancee and the\nfuture wife to the company’s president, I won’t allow you to wear the same color as her.”"
      },
      {
        "paragraph": "After a moment’s astonishment, Freya’s chest felt like it could explode from anger. “What the f*ck? Why\ndon’t you say you won’t allow Sarah and I to have the same gender too?”"
      },
      {
        "paragraph": "Rodney frowned at her words. “You’re a daughter from a noble family, yet your mouth is full of foul words.\nHow vulgar.”"
      },
      {
        "paragraph": "“Why didn’t you say I was vulgar when you hired me to be the cosmetic chemist?”"
      },
      {
        "paragraph": "Freya sneered. “The design of my dress is different from Sarah’s. Why can’t I wear a red dress just\nbecause she wore it? Do you really think of yourself as the nephew of Australia’s president already?"
      },
      {
        "paragraph": "Your uncle hasn’t even assumed the position. Everyone in the Snow family keeps a low profile, so how\ndid they have a child like you? Rodney, can you stop being a disgrace to your family?”"
      },
      {
        "paragraph": "After that, she turned around to leave."
      },
      {
        "paragraph": "“I’ve prepared a dress for you. Change into it before you go down.” Rodney pointed at a dark green\ndress on the sofa with his chin."
      },
      {
        "paragraph": "Rodney was infuriated. “Freya Lynch, don’t think I don’t know that you clashed colors with Sarah on\npurpose. All you want is to let the people here tonight think you’re prettier than Sarah and have people\nmock her. She’s already so miserable. Why can’t you and Catherine just leave her alone?”"
      },
      {
        "paragraph": "Freya took a deep breath. She was fuming from anger. “Are you crazy? If you have such a rich\nimagination, why did you start a cosmetics company? You should be a writer instead. Do you think I can\nread Sarah’s mind? How would I know what she’d wear?”"
      },
      {
        "paragraph": "“A scheming woman like you will have your own ways.” Rodney snorted."
      },
      {
        "paragraph": "“I can’t be bothered to care about you. Anyway, don’t think of making me change my clothes, unless I\ndie. ” Freya kept walking. She was not going to argue with that fool any longer."
      },
      {
        "paragraph": "“Stop right there…”"
      },
      {
        "paragraph": "Enraged, Rodney instinctively stretched out his hand to grab her puffy sleeves. Her dress was off-\nshouldered, but when he tugged on it as she was walking forward, half a side of the dress slipped."
      },
      {
        "paragraph": "Even her nipple cover fell out."
      },
      {
        "paragraph": "Rodney stared at her chest dumb foundedly, which had nothing covering it."
      },
      {
        "paragraph": "It was apparent that she was busty when she wore the dress, but he never thought she was that busty."
      },
      {
        "paragraph": "A gush of blood rushed up to his head, and his handsome face flushed red."
      },
      {
        "paragraph": "“Rodney, you pervert. What are you looking at? ” Freya screamed and covered her chest instinctively\nwith one hand while she slapped him on the face with another."
      },
      {
        "paragraph": "“How dare you hit me?” Rodney covered his face. His alluring eyes widened in anger."
      },
      {
        "paragraph": "“You yanked my clothes off. Should I not have hit you?” Freya’s pretty face flushed, either from anger or\nembarrassment. A man had never seen her bare before in her entire life."
      },
      {
        "paragraph": "“You were the one who didn’t want to change.” Rodney threatened her unconfidently, “If you don’t\nchange, I’ll do it for you.”"
      },
      {
        "paragraph": "“Come on, then. You can change my clothes for me.” Freya got closer to him furiously. “ If you have the\nguts, take off my clothes. Worse comes to worst, I’ll call the police and say you took advantage of me.\nOnce this becomes a big issue, let’s see who will be more embarrassed. I’ve experienced more\nembarrassing things than this three years ago anyway.”"
      },
      {
        "paragraph": "As such, Rodney was forced to take a few steps back. He was much taller than her, so his breath heated\nup when he glanced down at her chest."
      },
      {
        "paragraph": "“Fine. Quickly put on your clothes and get out, ” he ordered. She would eventually drive him insane."
      },
      {
        "paragraph": "After glaring at Rodney, Freya went to the bathroom to tidy her clothes. A moment later, her head\npopped out from the bathroom in frustration. “Rodney, pick my nipple cover up for me.”"
      },
      {
        "paragraph": "Rodney was taken aback. When he saw the pink thing on the floor, he felt awful. “Why do you even wear\nthis thing?” Pick it up? F*ck, he could not do it at all."
      }
    ]
  },
  {
    "title": "Chapter 927 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Rodney, you must be an idiot. How do you expect me to walk out of here without wearing that?” Freya\ngritted her teeth."
      },
      {
        "paragraph": "“Who are you calling an idiot? Say that once more, and I’ll throw this thing of yours away.” Rodney was\nexasperated. For a clever and wise person like him to be humiliated by her time and time again was too\nmuch."
      },
      {
        "paragraph": "“…I was wrong, Brother Snow. Can you please pass me my nipple cover?” Freya immediately put on a\nsmile. “If you’re not willing to, I can only run out in this state and shout that President Snow has ulterior\nmotives toward me. There are many reporters outside, and your little Sarah is there too.”"
      },
      {
        "paragraph": "“Well played.”"
      },
      {
        "paragraph": "Freya’s threat gave Rodney no choice but to brace himself to pick it up and pass it to her."
      },
      {
        "paragraph": "Looking at his blushing face, Freya found it speechless yet hilarious. He just had to pick up a nipple\ncover! Did he have to act like that? “Hey, have you not had sex with a woman before?”"
      },
      {
        "paragraph": "“I’ve never had sex with a woman? Ha! Are you joking?” Rodney laughed sarcastically, but actually, he\nhad no confidence at all. After all, it was indeed quite embarrassing for a 30-year-old man not to be a\nvirgin."
      },
      {
        "paragraph": "“So you have had sex before? Who? Since Sarah is outside, should I go and tell her that her fiance had\na woman before her? ” Freya’s smiling face made Rodney feel like giving her a good beating."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Freya Lynch, no one will think you’re a mute even if you don’t say anything,” Rodney warned with a grim\nexpression."
      },
      {
        "paragraph": "“ I was just curious. Hey, you saw me just now. It can’t be your first time looking at a woman…”"
      },
      {
        "paragraph": "Rodney could not tolerate her anymore, so he slammed the door and left before Freya could finish her\nsentence."
      },
      {
        "paragraph": "That loud bang when he slammed the door was strangely funny to Freya."
      },
      {
        "paragraph": "He was angry from embarrassment."
      },
      {
        "paragraph": "How can he be so pure? Tsk tsk, Sarah really got lucky."
      },
      {
        "paragraph": "At the banquet hall, Rodney downed a glass of wine."
      },
      {
        "paragraph": "Damn it. He did not know whether it was because Freya had pissed him off or because it was his first\ntime seeing a woman, but a specific part of his body felt hot."
      },
      {
        "paragraph": "When he thought about it, the fact that he was an adult yet still a virgin was indeed quite embarrassing."
      },
      {
        "paragraph": "“Rodney, what’s wrong with you? Are you in a bad mood?” Sarah walked over worriedly."
      },
      {
        "paragraph": "“ If it wasn’t for Freya who pissed me off.” Rodney was irritated. “How could there be such a shameless\nwoman in this world?”"
      },
      {
        "paragraph": "“What did she do?”"
      },
      {
        "paragraph": "“She actually… She… Nothing.” As Rodney recalled the scene in the room just now, a trace of\nawkwardness flashed across his face."
      },
      {
        "paragraph": "Sarah’s heart sank when she saw it. What did he do with Freya that he could not tell her about it?"
      },
      {
        "paragraph": "Right at that moment, she saw Freya walking gracefully down the spiral staircase, and she was still\nwearing that red dress."
      },
      {
        "paragraph": "A hint of frustration flashed across Sarah’s eyes."
      },
      {
        "paragraph": "Freya had not changed her clothes."
      },
      {
        "paragraph": "“ I’m sorry, Sarah. I asked her to change her dress, but she refused to.” Rodney looked guilty. “ I can’t\npossibly strip it off her either.”"
      },
      {
        "paragraph": "“I know. It’s okay. It’s just a dress. You don’t have t o worry about it. ” Sarah forced herself to console\nhim."
      },
      {
        "paragraph": "“Hi, Ms. Neeson, President Snow.” Freya suddenly greeted them. “I’m sorry I didn’t change my clothes in\nthe end.”"
      },
      {
        "paragraph": "Her voice was loud, so many people in the banquet hall turned their gazes toward her."
      },
      {
        "paragraph": "“Ms. Lynch, why do you need to change your clothes?” General Manager Fisher asked. “Your dress\ntonight is quite stunning.”"
      },
      {
        "paragraph": "Sarah was suddenly hit with a bad feeling, and Rodney had realized it too. Hence, he immediately\nwarned, “Freya…”"
      },
      {
        "paragraph": "“President Snow, I’m sorry. I really didn’t know that my dress would be the same color as Ms. Neeson’s.”"
      }
    ]
  },
  {
    "title": "Chapter 928 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya raised her frightened and aggrieved voice, afraid that the people at the sides could not hear her.\n“The dark green dress that you made me change into was too small. I couldn’t put it on. Ms. Neeson,\nplease let me know beforehand the color of the dress you’ll be wearing next time. I’m afraid I’ll get a\nscolding from Master Snow if I clash colors with you again.”"
      },
      {
        "paragraph": "The people around looked at Sarah in disdain and started discussing among themselves."
      },
      {
        "paragraph": "“This is too unreasonable. Is she the only one who can wear red?”"
      },
      {
        "paragraph": "“Exactly. The color of her dress isn’t as nice as Ms. Lynch’s, so she got Ms. Lynch to change it. I really\ncouldn’t tell that she was this kind of person.”"
      },
      {
        "paragraph": "“Young Master Snow, too. Ms. Lynch is the cosmetic chemist of this product and has contributed greatly\nto Osher Corporation, only to be criticized for wearing a dress of the same color as Sarah. He’s too\nbossy.”"
      },
      {
        "paragraph": "Rodney and Sarah’s faces were flushed red from being criticized. Rodney desperately wanted to gobble\nFreya alive."
      },
      {
        "paragraph": "General Manager Fisher secretly grumbled as well. He should not have asked the question."
      },
      {
        "paragraph": "Hence, he quickly thought of a way to change the topic in the direction of the new product, but the news\nspread like wildfire. By then, the incident about the dress had traveled across the press conference."
      },
      {
        "paragraph": "Everyone’s gazes toward Sarah were filled with disdain."
      },
      {
        "paragraph": "Freya raised her frightened and aggrieved voice, afraid that the people at the sides could not hear her.\n“The dark green dress that you made me change into was too small. I couldn’t put it on. Ms. Neeson,\nplease let me know beforehand the color of the dress you’ll be wearing next time. I’m afraid I’ll get a\nscolding from Master Snow if I clash colors with you again.”"
      },
      {
        "paragraph": "Sarah despised Freya to death. With that, she called Thomas over. “Tonight, no matter what method you\nuse, I want Freya to wish she was dead.”"
      },
      {
        "paragraph": "“Don’t worry, Sarah. I’ve already had someone spike the wine Freya is drinking now.” Thomas smiled\nevilly and said, “Tonight, in bed, I’ll give her a worse torture than death.”"
      },
      {
        "paragraph": "“I’m looking forward to your good news.” Sarah looked at him in satisfaction."
      },
      {
        "paragraph": "At the same time, Chester walked over to Rodney.“"
      },
      {
        "paragraph": "I still have some other business to attend to. I’ll be leaving first.”"
      },
      {
        "paragraph": "“Okay. I won’t see you off then.” Rodney tapped his shoulder."
      },
      {
        "paragraph": "Chester gave Rodney a thoughtful glance. “Rodney, it’s just a dress. There’s no need to go that far.”"
      },
      {
        "paragraph": "Rodney was awkward from being told off by his brother. “You’ve misunderstood. I…”"
      },
      {
        "paragraph": "“Rodney, you should keep a low profile. Your uncle’s campaign is coming up, so don’t go creating trouble\nfor the Snow family. I’m being honest with you because I see you as my brother.” Then, Chester left with\nCindy."
      },
      {
        "paragraph": "In the car, Cindy was trying to guess Chester’s expression carefully. “Chester, do you think tonight"
      },
      {
        "paragraph": "“I didn’t think Sarah was this kind of person.” Chester took a cigarette out and elegantly bit it between his\nlips. “She can’t even tolerate someone wearing a similar dress to hers. We really didn’t know her that\nwell.”"
      },
      {
        "paragraph": "“That’s right. ” Cindy smiled sheepishly. It seemed like she had to stay away from Sarah in the future."
      },
      {
        "paragraph": "“With her personality, it’s not a good thing for Rodney to be with her, ” Chester lamented."
      },
      {
        "paragraph": "11:00 P.M."
      },
      {
        "paragraph": "Freya felt her head getting dizzier. She suspected that she was drunk, so she took her leave and went on\nthe elevator to go to her room upstairs for a rest."
      },
      {
        "paragraph": "However, the moment she walked out of the elevator, her head began to spin before she fainted on the\nground."
      },
      {
        "paragraph": "Thomas walked out from a corner with an evil grin and picked her up from the ground."
      },
      {
        "paragraph": "That narrow waist almost made him lose control on the spot."
      },
      {
        "paragraph": "“Little b*tch, tonight has just begun. Wait and see what I’ll do with you.” Thomas pinched her cheeks as\nhe carried Freya toward a room."
      },
      {
        "paragraph": "When he was about to open the door, he realized that he had accidentally left his key card on the\nbanquet hall’s sofa."
      }
    ]
  },
  {
    "title": "Chapter 929 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Not long after Thomas left, Freya woke up from the heat."
      },
      {
        "paragraph": "Her body was on fire, and she stood up in a blur, not knowing where she was. She tried to find her way\nfor quite some time until she stumbled out and bumped into a man."
      },
      {
        "paragraph": "She felt as if she had found an air conditioner, so she held onto that man and refused to let go."
      },
      {
        "paragraph": "“Eldest Young Lady, isn’t this Freya Lynch…” The assistant glanced nervously at Jessica’s furrowed\nbrows."
      },
      {
        "paragraph": "“Someone has done something to her.” Jessica stared at Freya’s flushed face."
      },
      {
        "paragraph": "The assistant was taken aback. “ But this is Osher Corporation’s press conference. She’s the research\nand development director and tonight’s main character. Who dares to be so daring?”"
      },
      {
        "paragraph": "“I’ll bring her to my room. You should keep an eye over here. The person who’s looking for someone\nhere will probably be the person who harmed her.”"
      },
      {
        "paragraph": "After giving the order, Jessica helped Freya back to her room."
      },
      {
        "paragraph": "When they arrived at the room, Freya’s body was so hot that she could not tolerate it anymore, so she\nkept rolling around on the bed."
      },
      {
        "paragraph": "Jessica got a headache from watching her. As such, she had no choice but to fill the bathtub with cold\nwater and put Freya in."
      },
      {
        "paragraph": "Not long after Thomas left, Freya woke up from the heat."
      },
      {
        "paragraph": "By the time she was done, the assistant had returned as well. “Eldest Young Lady, Thomas came back\nlooking for someone just now. I saw him going into the fire exit, where he walked up and down, searching\nfor many times.”"
      },
      {
        "paragraph": "“Thomas…” Jessica narrowed her eyes. Thomas was Sarah’s brother, and she was familiar with his\nname for all the terrible things he had done over the years. Rodney was just dating Sarah, yet Thomas\nwas already so unrestrained."
      },
      {
        "paragraph": "In the future, if Uncle Nathan assumed the position of president and Sarah managed to be part of the\nSnow family, would Thomas not be fearless of the law?"
      },
      {
        "paragraph": "Grandpa was right. No matter what method they used, Sarah could not marry into the Snow family."
      },
      {
        "paragraph": "“Eldest Young Lady, Ms. Lynch sounds like… she’s very uncomfortable. ” The assistant blushed from\nhearing Freya’s voice."
      },
      {
        "paragraph": "Jessica glanced at him. “Find out where Rodney is.”"
      },
      {
        "paragraph": "At the banquet hall downstairs, Rodney was socializing with one group of guests after another.\nFurthermore, he was in a good mood that day, so he drank until he got drunk."
      },
      {
        "paragraph": "Sarah helped him over to the elevator. “Rodney, be careful.”"
      },
      {
        "paragraph": "“No, Sarah. I’m happy. ” Rodney hugged her and giggled."
      },
      {
        "paragraph": "Sarah remained silent as she leaned in his embrace. She was thinking about whether she should have\nsex with Rodney that night since he was drunk."
      },
      {
        "paragraph": "Although Rodney had already proposed to her, the Snow family was definitely against it. It was unknown\nwhen the wedding would be held either. In that case, she might as well get pregnant with Rodney’s child\nfirst. By then, the Snow family"
      },
      {
        "paragraph": "would have no choice."
      },
      {
        "paragraph": "“Rodney, I’ll help you back to the room.” She tried to turn him on by touching him with her hands."
      },
      {
        "paragraph": "Inexperienced in that matter, Rodney felt as if a flame was ignited in his body, and he was really\nuncomfortable."
      },
      {
        "paragraph": "When they finally reached the door to his suite, Sarah intentionally fumbled around his body to search for\nthe key card. As such, Rodney’s breathing quicken."
      },
      {
        "paragraph": "“Ms. Neeson seems to be very open about s*x. I recall you just broke up with Shaun not long ago. ”"
      },
      {
        "paragraph": "A woman’s mocking voice came from behind Sarah."
      },
      {
        "paragraph": "Startled, Sarah turned her head around only to see Jessica standing behind her."
      },
      {
        "paragraph": "Jessica and Rodney looked slightly alike. They had the same alluring eyes, but Jessica’s eyes were calm\nand sharp as if Sarah was nothing but an ant to her."
      },
      {
        "paragraph": "“Sister… Jessica.”"
      },
      {
        "paragraph": "Sarah instinctively felt afraid. Jessica’s personality was utterly different from Rodney’s since they were\nyoung. She was cold and heartless."
      },
      {
        "paragraph": "“Don’t call me sister. I don’t know you that well.” Jessica hinted at her assistant with her eyes. “Go and\nget Second Young Master.”"
      },
      {
        "paragraph": "The assistant nodded before he immediately took Rodney over from Sarah’s hands."
      },
      {
        "paragraph": "Sarah bit her lips. She was upset that her initial plans had been messed up."
      },
      {
        "paragraph": "“Ms. Snow, I know you look down on me because the Neeson family can’t compare to the Snow family.\nHowever, Rodney really treats me very well. He has sacrificed so much for me that I don’t want t o hurt\nhim anymore. After going through so many things, I know who’s worth treasuring. As long as Rodney\ndoesn’t let go, I won’t leave him.”"
      },
      {
        "paragraph": "“Well, you came back to your senses just at the right time, just when Shaun publicly announced that he\nwouldn’t get back together with you. Before that, you’ve never even noticed how well Rodney treated\nyou.”"
      },
      {
        "paragraph": "Jessica’s tone was sarcastic. “However, you do have self-awareness. Indeed, the Neeson family can’ t\ncompare to the Snow family, yet there are always people who like to be delusional, especially those that\ndon’t know their limits.”"
      },
      {
        "paragraph": "Her words were blunt, and Sarah’s pretty face paled from the blow to her pride."
      },
      {
        "paragraph": "Jessica was not a man, so she did not sympathize with Sarah at all. With that, she had someone take\nRodney and left straight away."
      },
      {
        "paragraph": "Once they entered the elevator, Jessica ordered, “ Send him to my suite.”"
      },
      {
        "paragraph": "The assistant was startled. “But Ms. Freya is in there, and she’s currently…”"
      },
      {
        "paragraph": "If they sent Rodney in at that moment, were they not sending a sheep into a lion’s den?"
      },
      {
        "paragraph": "“He was the one who invited Thomas. The fact that Thomas dared to put something in the drinks is a\nresult of him pampering Sarah. In that case, he should take the responsibility of helping Freya.”"
      },
      {
        "paragraph": "Jessica sighed after she spoke. “Besides, my grandpa gave me a task, and I’m left with no choice either.\nWe can’t let Sarah join the Snow family no matter what. If not, it’ll not only harm Rodney but the Snow\nfamily as well…”"
      },
      {
        "paragraph": "The assistant suddenly fell silent. He, too, admired Eldest Young Lady’s ruthlessness sometimes, but\nunfortunately, she was not a man."
      },
      {
        "paragraph": "Rodney, who was utterly drunk, did not know that he was set up."
      },
      {
        "paragraph": "He was thrown into the room. When he got to the bed, he started taking off his clothes and shoes\ninstinctively."
      },
      {
        "paragraph": "Freya still felt very uncomfortable even after she was soaked in cold water for a long time. She forced\nherself up and stumbled out of the bathroom. When she saw a good -looking man on the bed, she was\nlike a predator that had found its prey."
      },
      {
        "paragraph": "She could not resist going near…"
      },
      {
        "paragraph": "10:00 a.m."
      },
      {
        "paragraph": "After Rodney opened his eyes sluggishly, the first thing he saw was a woman lying in his embrace, with\nher face buried in his chest. The blanket barely covered both of them."
      },
      {
        "paragraph": "However, the woman’s exposed fair shoulder made Rodney’s blood rush again."
      },
      {
        "paragraph": "He may be inexperienced, but he knew what happened last night."
      },
      {
        "paragraph": "Although it happened in a blur, he remembered he had a pleasant night. He had never expected Sarah\nto be so aggressive."
      },
      {
        "paragraph": "“ Sarah… ” He lowered his head and kissed her ear."
      },
      {
        "paragraph": "The woman in his arms raised her tired, pretty little face."
      },
      {
        "paragraph": "Their gazes met, and they faced each other."
      },
      {
        "paragraph": "A surprised scream came out of their throats at the same time."
      },
      {
        "paragraph": "Rodney was so startled that he jumped down the bed, while Freya was so frightened that she quickly\ncovered herself with the blanket."
      },
      {
        "paragraph": "“F*ck, Rodney Snow. What did you do to me?” Freya glared at him. Her gaze looked as if she wanted to\neat him alive."
      },
      {
        "paragraph": "“I should be the one asking that question. ” Rodney was about to break down. “Why are you in my room?\nWhy are you on my bed?”"
      },
      {
        "paragraph": "“This is your room?” Freya was stunned."
      }
    ]
  },
  {
    "title": "Chapter 930 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Nonsense. Of course this is…”"
      },
      {
        "paragraph": "Rodney looked around. Suddenly, he felt unconfident. This did not look like his room either."
      },
      {
        "paragraph": "“This isn’t your room as well, right?” Freya’s eyes were red from anger. “Rodney Snow, you pervert. Who\nwould’ve known you’d make a move on me behind Sarah’s back? You looked so deeply in love with her.\nAre you short of women? Why didn’t you go and look for Sarah?”"
      },
      {
        "paragraph": "“I made a move on you?” Rodney was enraged. “ You were the one who fancied my identity and sneaked\nin while I was drunk.”"
      },
      {
        "paragraph": "He was about to go insane. He finally proposed to Sarah and painstakingly kept his virginity, yet it was all\ndestroyed by that woman overnight."
      },
      {
        "paragraph": "“Ugh, with that retarded brain of yours, I wouldn’t be interested in having sex with you even if you begged\nme to. Besides… last night was my first time too, okay?” Freya was so upset that she could cry."
      },
      {
        "paragraph": "“Enough. Don’t take me for a fool. There’s no way a fickle woman like you is still a virgin. I’ve seen you\ncling to other men…”"
      },
      {
        "paragraph": "Before he could finish his sentence, he noticed bloodstains on the white sheets, and he suddenly froze."
      },
      {
        "paragraph": "The bloodstains could not be faked. He did not expect that it was really Freya’s first time."
      },
      {
        "paragraph": "“Nonsense. Of course this is…”"
      },
      {
        "paragraph": "He was in a daze and at a loss. “Hey, don’t look for me to take responsibility. I won’t be responsible for\nyou.”"
      },
      {
        "paragraph": "“Scumbag, you should die.”"
      },
      {
        "paragraph": "Freya took a pillow and was about to hit his body."
      },
      {
        "paragraph": "At that moment, the room door opened, and a bunch of reporters barged in."
      },
      {
        "paragraph": "That scene was too familiar. Rodney could break down right there and then. Why was he always met\nwith those kinds of stuff?"
      },
      {
        "paragraph": "“Young Master Snow, aren’t you in a relationship with Sarah? Why did you sleep with Director Lynch?”"
      },
      {
        "paragraph": "“Young Master Snow, does this mean you’re having an affair?”"
      },
      {
        "paragraph": "“Ms. Lynch, can you explain your relationship with"
      },
      {
        "paragraph": "Young Master Snow?”"
      },
      {
        "paragraph": "“It seems like last night was intense.”"
      },
      {
        "paragraph": "The reporters kept snapping their cameras at Freya and Rodney."
      },
      {
        "paragraph": "Freya quickly wrapped herself in the blanket and escaped to the bathroom. Was this not the idea that\nshe had used against Rodney last time? Never did she expect that she would have her pictures taken\ntoday and that feeling drove her insane."
      },
      {
        "paragraph": "Why was she so unlucky? Who exactly did she offend?"
      },
      {
        "paragraph": "Fortunately, the security guards of the hotel rushed over and cleared the scene. They even were so\nthoughtful to send both of them clothes."
      },
      {
        "paragraph": "After Freya had changed into the clothes and sneaked out of the bathroom, Rodney lashed out at the\nhotel’s manager with a dark expression."
      },
      {
        "paragraph": "“Those reporters just ran straight in without even needing to knock on the door. This obviously means\nthat they had the key card. What is your hotel doing?”"
      },
      {
        "paragraph": "“Young Master Snow, you held a press conference here last night. It was Osher Corporation who"
      },
      {
        "paragraph": "booked rooms for the reporters. They slept in the rooms downstairs last night. As for the fact that they\ncame in because they had the key card, I really don’t know how it ended up in their hands, ” the hotel\nmanager explained embarrassedly."
      },
      {
        "paragraph": "“Go and investigate this thoroughly. Now.”"
      },
      {
        "paragraph": "Having lost his temper, Rodney warned Freya, “ If the media asks, you should say you’re the one who\nseduced me. Do you understand? You don’t have a man anyway, whereas I’m different. Sarah will break\nup with me.”"
      },
      {
        "paragraph": "“I seduced you?” Freya was speechless. “Are you even a man? Don’t you feel ashamed? All you ever do\nis think about yourself. Have you ever thought about how important this matter is to me, a woman?”"
      },
      {
        "paragraph": "“Stop talking nonsense. If I find out that you were the one who got me in here last night, the\nconsequences will be horrible,” Rodney warned her grimly."
      },
      {
        "paragraph": "“Same goes for you.”"
      },
      {
        "paragraph": "Freya walked out angrily, but when she was at the door, she turned her head around."
      }
    ]
  },
  {
    "title": "Chapter 931 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Don’t worry, Sarah won’t break up with you. Now that she doesn’t have Shaun, you’re the only"
      },
      {
        "paragraph": "person she can rely on. All she’ll do is throw a small tantrum and act like she wants to break up. If you\ncoax her, she’ll forgive you. By the way, she’ll surely say that the fault doesn’t lie with you and that you’re\ninnocent. She’ll find an excuse to get you out of this.”"
      },
      {
        "paragraph": "After that, Freya slammed the door and left. Rodney was stunned by her words."
      },
      {
        "paragraph": "When Freya had just walked out of the hotel with her sore legs, Catherine gave her a call."
      },
      {
        "paragraph": "“Sister, you’re incredible.”"
      },
      {
        "paragraph": "Catherine admired her a lot. “Rodney just proposed to Sarah grandly, and you had sex with him on the\nnext day. You’re working so hard just to get revenge on Sarah. You and Rodney are on the trending\nsearches now. Everyone in Australia knows about it.”"
      },
      {
        "paragraph": "“Go away.” Freya felt helpless. “I don’t know anything, okay? I drank too much last night, and I blacked\nout. My first time was ruined by that idiot, Rodney. I feel like crying.”"
      },
      {
        "paragraph": "“Somebody must’ve set you up, ” Catherine reminded her, “Have you taken the contraceptive pills?\nQuickly go and buy it..”"
      },
      {
        "paragraph": "“You’re right.”"
      },
      {
        "paragraph": "“Don’t worry, Sarah won’t break up with you. Now that she doesn’t have Shaun, you’re the only"
      },
      {
        "paragraph": "Freya immediately found a pharmacy nearby. Just a s the pharmacy employee turned around to get\nFreya’s request for contraceptives, the landline suddenly rang."
      },
      {
        "paragraph": "When the employee picked up the phone, her expression changed slightly."
      },
      {
        "paragraph": "Once she hung up, she said to Freya, “The medicine is placed inside. I’ll go get it, so please wait for a\nmoment.”"
      },
      {
        "paragraph": "Inside, the employee switched the contraceptive pills to vitamin C pills for Freya."
      },
      {
        "paragraph": "Freya paid for it before she went out and ate the medicine."
      },
      {
        "paragraph": "Unbeknownst to her, Jessica was sitting in a sedan by the road."
      },
      {
        "paragraph": "After Freya had left, Jessica gave Old Master Snow a call. “Grandpa, I’ve already asked the pharmacy\nemployee to switch the contraceptive pills.”"
      },
      {
        "paragraph": "“Mm, you’ve done well. This is unfair to Freya, but we’ll compensate the Lynch family once she becomes\npart of the Snow family.”"
      },
      {
        "paragraph": "In the meantime, when Sarah saw Freya and Rodney’s barely clothed picture in the news, her pretty face\ntwisted on the spot."
      },
      {
        "paragraph": "Did Jessica not take Rodney away last night? How did he end up sleeping with Freya?"
      },
      {
        "paragraph": "She was so angry that she hurriedly called Thomas. “You stupid, what exactly did you do last night?"
      },
      {
        "paragraph": "Didn’t you say you wanted to sleep with Freya? Why did you let her sleep with Rodney instead?”"
      },
      {
        "paragraph": "“I don’t know. ” Rodney was infuriated as well. “ I forgot my key card yesterday, so I left Freya at the fire\nexit. She was gone when I returned. I even went to her room to find her, but she wasn’t there.”"
      },
      {
        "paragraph": "“You useless thing! Can’t you do anything properly?”"
      },
      {
        "paragraph": "Sarah scolded him. No matter how stupid she was, she knew that Jessica was observing her last night."
      },
      {
        "paragraph": "This must have been Jessica’s doing."
      },
      {
        "paragraph": "Just as she was about to complain to Rodney, a video of a statement from the director of Snow\nCorporation himself, Jason Snow, popped up all of a sudden."
      },
      {
        "paragraph": "When she tapped into the video, it was Jason having an interview at the door to his house."
      },
      {
        "paragraph": "A reporter asked, “Director Snow, your son, Rodney Snow, spent last night with Freya Lynch. Have you\nheard about it?”"
      },
      {
        "paragraph": "Jason said, “I have, but this is nothing. Freya is my son’s fiancee from the start.”"
      },
      {
        "paragraph": "“What? But didn’t Rodney propose to Sarah Neeson just a few days ago? Sarah is his real fiancee.”"
      }
    ]
  },
  {
    "title": "Chapter 932 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Jason said, “Marriage isn’t child’s play. Proposing to Sarah is Rodney’s own problem. The Snow family\nwill never approve of his marriage nor of Sarah joining the Snow family. As for Freya, she’s the fiancee\nthat everyone in the Snow family has chosen for Rodney. Since this matter has occurred, the Lynch\nfamily will come to Canberra soon to discuss the marriage.”"
      },
      {
        "paragraph": "“Then, what will happen to Sarah?” the reporter asked."
      },
      {
        "paragraph": "“We, the Snow family, have strict family rules. We’ll never allow Rodney to have a mistress.”"
      },
      {
        "paragraph": "With that, the video ended."
      },
      {
        "paragraph": "Sarah’s hands were trembling. When she came back to her senses, she started screaming and\nsmashing things hysterically."
      },
      {
        "paragraph": "She had never expected the Snow family to be so inconsiderate of her. Since they publicly said that\nFreya was Rodney’s fiancee, then what was she?"
      },
      {
        "paragraph": "Three years ago, Freya’s reputation was ruined because of Thomas. Three years later, the Snow family\nwould rather accept a b*tch like Freya over her."
      },
      {
        "paragraph": "Where was she lacking compared to Freya?"
      },
      {
        "paragraph": "There was that idiot, Rodney as well. He said he loved her yesterday, yet he had sex with Freya the next\nmoment. Men were all good for nothing."
      },
      {
        "paragraph": "Jason said, “Marriage isn’t child’s play. Proposing to Sarah is Rodney’s own problem. The Snow family\nwill never approve of his marriage nor of Sarah joining the Snow family. As for Freya, she’s the fiancee\nthat everyone in the Snow family has chosen for Rodney. Since this matter has occurred, the Lynch\nfamily will come to Canberra soon to discuss the marriage.”"
      },
      {
        "paragraph": "At that moment, Rodney called."
      },
      {
        "paragraph": "She immediately smashed her phone."
      },
      {
        "paragraph": "However, she quickly calmed down. Rodney could not be so easily forgiven, but she could not let go of\nhim either. After all, the only presentable man she had by her side now was Rodney."
      },
      {
        "paragraph": "On the other hand, when Rodney saw Jason’s statement, he rushed back to the Snow family."
      },
      {
        "paragraph": "“Dad, what nonsense did you say in front of the reporters? When did Freya become my fiancee? I’m not\neven familiar with her. My fiancee is Sarah.”"
      },
      {
        "paragraph": "On the way, Sarah did not pick up his calls at all. He was about to go insane. He had to explain\neverything clearly."
      },
      {
        "paragraph": "“Have you given any dowry to Sarah?” Jason asked coldly. “Did an engagement ceremony take place"
      },
      {
        "paragraph": "between the Snow family and the Neeson family?"
      },
      {
        "paragraph": "Did Sarah meet your parents and have a meal with us?”"
      },
      {
        "paragraph": "Rodney was taken aback. “I’ve already proposed and given her a ring. The media knows about it…”"
      },
      {
        "paragraph": "“As long as the engagement procedure isn’t done, Sarah isn’t your fiancee.” Old Master Snow cut him off\ncoldly. “Moreover, you slept with Freya, so you have to take responsibility. The Snow family doesn’t play\naround with women and abandon them afterward.”"
      },
      {
        "paragraph": "“Speaking of last night, I was clearly set up by Jessica. ” Rodney glared at Jessica furiously. “ I’ve\nalready investigated it. The suite that I slept in last night was checked in under your name. The security"
      },
      {
        "paragraph": "camera at the door showed it was you who sent me into the room. You did it on purpose.”"
      },
      {
        "paragraph": "“That’s right. It was me.” Jessica’s expression was calm."
      },
      {
        "paragraph": "“You’re my sister. How could you do this to me?” Rodney threw a fit. “You’re a cold-blooded animal. You’ll\ndo whatever it takes to win Grandpa’s favor.”"
      },
      {
        "paragraph": "“ Shut your mouth.” Jessica glared at him with her cold eyes. “Do you know why I threw you into the\nroom last night? Because someone set Freya up at the banquet hall. The research and development\ndirector of your company had something done to her during the press conference. I really don’t\nunderstand how you manage the company.”"
      },
      {
        "paragraph": "“It’s impossible…” Rodney was shocked."
      },
      {
        "paragraph": "“ If Freya wasn’t unconscious, do you think she’ll have sex with you?” Jessica’s expression was filled with\nsarcasm. “By the way, the person who set her up Sarah’s good brother.”"
      },
      {
        "paragraph": "“You mean Thomas?” Rodney gasped in surprise."
      },
      {
        "paragraph": "If it were other people, he would not have believed it. However, when he recalled the things Thomas had\ndone to Freya before, he did not dare to deny it. “Is there a misunderstanding…”"
      }
    ]
  },
  {
    "title": "Chapter 933 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“When I went to the hotel last night, I saw there was something wrong with Freya. She couldn’t even\nwalk properly, so I had my assistant send her to my room. Later, Thomas was searching for someone\nright at the place where I found Freya. He even went to her room to look for her. Then, I thought of\nchecking the security cameras, but coincidentally, the security cameras on the 28th floor weren’t\nworking.”"
      },
      {
        "paragraph": "After Jessica spoke, Old Master Snow rapped the table in anger. “Thomas is too bold.”"
      },
      {
        "paragraph": "“He’s not bold. The hotel employees knew that his sister is Second Young Master Snow’s girlfriend, so\nthey didn’t dare to offend him.”"
      },
      {
        "paragraph": "Jessica glanced at Rodney coldly. “If it weren’t for you, Thomas wouldn’t have come. In that case, me\nsending you to help Freya is a matter of course too. You solved the trouble that you created yourself.\nIsn’t that great?"
      },
      {
        "paragraph": "“Moreover, with Freya’s state last night, it was obvious that the drug was potent. Even soaking her in the\ncold bath was useless, and I was afraid something might happen to her.”"
      },
      {
        "paragraph": "Rodney could not find any words to say."
      },
      {
        "paragraph": "He never thought Thomas would dare to set Freya up during the press conference. No matter what,\nFreya was his company’s shareholder. More so, she was the research and development department’s\ndirector to whom he entrusted major responsibilities."
      },
      {
        "paragraph": "When he recalled how he scolded Freya for seducing him, he felt a twinge of regret and guilt."
      },
      {
        "paragraph": "“When I went to the hotel last night, I saw there was something wrong with Freya. She couldn’t even\nwalk properly, so I had my assistant send her to my room. Later, Thomas was searching for someone\nright at the place where I found Freya. He even went to her room to look for her. Then, I thought of\nchecking the security cameras, but coincidentally, the security cameras on the 28th floor weren’t\nworking.”"
      },
      {
        "paragraph": "“Sis, were you the one who called the reporters?” he asked, gritting his teeth."
      },
      {
        "paragraph": "“Mm. If I didn’t make this a big issue, how would you take responsibility for Freya?” Jessica nodded\nwithout any guilt."
      },
      {
        "paragraph": "“You’re despicable!” Rodney said coldly, “ Unfortunately, it’s useless even if you called the reporters. I\nwon’ t marry Freya even if I die. I will never hurt Sarah in my life. I’ll immediately clarify everything to the\nmedia.”"
      },
      {
        "paragraph": "With that, he turned around and headed outside."
      },
      {
        "paragraph": "Jessica’s calm voice came from behind."
      },
      {
        "paragraph": "“You can go. If you dare do that, there’s no need for Osher Corporation to launch their new product\nanymore. All I need to do is inform the related authorities. I have countless ways to stop it. Not just the\nnew product, but I can even make Osher Corporation’s counters close down within a night."
      },
      {
        "paragraph": "You can try it.”"
      },
      {
        "paragraph": "“You…” Rodney glared at her. If his gaze could rip her apart, he would. “Grandpa, Dad, look at her…”"
      },
      {
        "paragraph": "“Jessica, if there’s anything you can’t manage, you can look for me anytime, ” Old Master Snow said\ngently. “We can shut down his Osher Corporation. It’s possible to make him not earn even a single\npenny.” and make him earn."
      },
      {
        "paragraph": "“Thank you, Grandpa.” Jessica smiled."
      },
      {
        "paragraph": "Rodney’s blood boiled."
      },
      {
        "paragraph": "At Brighton Gardens."
      },
      {
        "paragraph": "When Freya saw Jason’s video, she felt awful."
      },
      {
        "paragraph": "“Are the Snow family members stupid? When did I become Rodney’s fiancee? Why do I not know of it\nmyself?”"
      },
      {
        "paragraph": "Catherine looked at her worriedly. “The Snow family members don’t want Rodney to marry Sarah. That’s\nwhy they pushed you out to stop them both.”"
      },
      {
        "paragraph": "“Haha, I will never get married to him. He can do whatever he wants with Sarah,” Freya said angrily."
      },
      {
        "paragraph": "Catherine sighed. “You can only acknowledge it now. If you deny it, the netizens will scold you for being a\nmistress and say that you ruined Rodney and Sarah’s relationship. Do you want to be called a mistress,\nor would you rather Sarah get scolded?”"
      },
      {
        "paragraph": "Freya was stunned. She was exasperated. “Why is it like this?”"
      },
      {
        "paragraph": "“It’s simple. The Snow family must’ve arranged the reporters this morning. They’re most probably going\nwith the flow.” Catherine frowned. “As for the fact that you got set up last night, I reckon the Snow family\nwouldn’t do that. Were you being targeted by some perverted guy yesterday?”"
      }
    ]
  },
  {
    "title": "Chapter 934 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Isn’t it normal for a beautiful person like me to be targeted by perverts?” Freya said in a daze, “No,\nThomas was there yesterday. It must’ve been that scumbag.”"
      },
      {
        "paragraph": "Catherine was astonished, but she quickly caught on."
      },
      {
        "paragraph": "“That must be it. If he dared to barge into your house with some people, it’s not surprising that he would\ndo something to you during the press conference yesterday. After all, he thinks he can do whatever he\nwants since Rodney is backing Sarah. As long as Sarah is here, Rodney will not dare to do anything to\nhim.”"
      },
      {
        "paragraph": "“He’s too f*cking cocky.”"
      },
      {
        "paragraph": "Freya trembled out of contempt. “Did I have some grudge with this disgusting guy in my previous life?”"
      },
      {
        "paragraph": "“Firstly, it’s obviously because of your beauty. Secondly, he might want to marry you.” Catherine analyzed\nit rationally."
      },
      {
        "paragraph": "“You’re a top cosmetic chemist now. Furthermore, the Lynch family’s business has been growing under\nyour brother’s management. In fact, the reason Neeson Corporation still exists is that they relied on\nShaun’s connections."
      },
      {
        "paragraph": "“ Since they’ve lost Shuan’s backing, and Rodney isn’t as capable, Thomas may think you’re the only\none who’s just good enough for him. He doesn’t mind having sex with you first then marrying you\nafterward.”"
      },
      {
        "paragraph": "“Isn’t it normal for a beautiful person like me to be targeted by perverts?” Freya said in a daze, “No,\nThomas was there yesterday. It must’ve been that scumbag.”"
      },
      {
        "paragraph": "“Just good enough for him?” Freya was speechless. “No elite lady in the whole of Australia will want to\nget married to a scumbag like him.”"
      },
      {
        "paragraph": "Catherine laughed. “Don’t put it that way. People like Thomas and Sarah are quite confident of\nthemselves. They might even think we can’t compare to them at all.”"
      },
      {
        "paragraph": "Freya gave it a thought and realized that the possibility of that happening was high. She felt increasingly\ndisgusted and uncomfortable the more she thought about it."
      },
      {
        "paragraph": "“I reckon Sarah knew about this matter too,” Catherine said. “She can’t stand the sight of you. I think she\nwants to wait until Thomas destroys and marries you. After that, she can torture you all she wants and, at\nthe same time, achieve her aim of taking revenge on me. However, I don’t think they expected that you\nwould sleep with Rodney. I guess Sarah’s blood must be boiling now.”"
      },
      {
        "paragraph": "“Those two b*tches. ” Freya trembled in anger. “I won’t let them off the hook. I’ve made up my mind. I\nwant to be Rodney’s fiancee. As long as the Snow family officially acknowledges me, Sarah will be the\nmistress that everyone will despise.”"
      },
      {
        "paragraph": "Catherine was speechless. She had to admit that Freya did not have many choices now that things had\ngone this far."
      },
      {
        "paragraph": "“Currently, you’re just Rodney’s fiancee. You can still cancel the engagement later. By then, Rodney will\ndefinitely still be involved with Sarah anyway. After some time, you can say Rodney had been cheating\non you while you guys were engaged, so you decided to cancel the engagement. At the same time, you\ncan gain sympathy from the public and tarnish Sarah and Rodney’s reputation too.”"
      },
      {
        "paragraph": "“Cathy, your tactic is amazing. ” Freya gave her a thumbs up. “Not only Sarah, but I want to teach\nRodney a lesson too. That idiot said I seduced him this morning. However, Rodney won’t admit I’m his\nfiancee.”"
      },
      {
        "paragraph": "“Don’t worry. The Snow family has already"
      },
      {
        "paragraph": "acknowledged you. Besides, the reporters took pictures of both of you on the bed themselves. If he\ndenies it, you can go to the reporters and complain to them in tears, ‘Second Young Master Snow didn’t\nsay that when he coaxed me to have s*x with him. He said I’m capable, I have a nice body, and I’m\npretty. Otherwise, I wouldn’t have willingly went back to Osher Corporation to work for his sake… ”’"
      },
      {
        "paragraph": "Catherine acted it out to Freya."
      },
      {
        "paragraph": "Freya was stunned. “Cathy, I realize… you’re quite b*tchy now too.”"
      },
      {
        "paragraph": "Catherine rolled her eyes. “I’ve come to understand all of their strategies after interacting with many of\nthem. Learn it.”"
      },
      {
        "paragraph": "“Smart. You are very smart. Otherwise, Sarah wouldn’t have lost to you.” Freya gave a thumbs up."
      },
      {
        "paragraph": "“You think too much. She didn’t lose to me. I was the one who lost to her all along. If not, Logan wouldn’t\nhave lost his finger.” Catherine smiled bitterly. That was the most unacceptable pain in her heart."
      },
      {
        "paragraph": "Freya did not know how to reply, but coincidentally, her father gave her a call at this moment."
      },
      {
        "paragraph": "“Freya Lynch, you rascal. How dare you sleep with another man before getting married? What did I teach\nyou about loving yourself as a girl? Besides, don’t you have other men to sleep with? Rodney already\nhas a girlfriend…”"
      }
    ]
  },
  {
    "title": "Chapter 935 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Dad, you misunderstood. I was set up.” Freya had no choice but to explain the whole incident."
      },
      {
        "paragraph": "Mr. Lynch remained silent for quite a while before he said, “In that case, Rodney has to be responsible\nfor you. The Snow family has already contacted me. Your mom and I are coming to Canberra today to\nhave a meal with the Snow family.”"
      },
      {
        "paragraph": "“Oh.”"
      },
      {
        "paragraph": "Freya did not expect the Snow family to be so swift in their actions. Hence, she gave it some thought"
      },
      {
        "paragraph": "and told Mr. Lynch her plan."
      },
      {
        "paragraph": "Mr. Lynch was enraged when he heard it. “What? Rodney said you seduced him? He must be blind. My\ndaughter is so beautiful, yet he looks down on"
      },
      {
        "paragraph": "you. Fine. I’ll go along with whatever you want to do. Although the Snow family is a wealthy family, the\nLynch family has never thought of relying on them. Your mom and I will cooperate with you in this act.”"
      },
      {
        "paragraph": "“Thank you, Dad. ” Freya was so touched that she blew him a kiss."
      },
      {
        "paragraph": "Catherine, who watched her from the side, was envious. In fact, she envied the atmosphere that Freya’s\nfamily had. Freya was doted on by her parents and brother since she was young, unlike her."
      },
      {
        "paragraph": "Although Catherine had Joel, it still could not compare to the Lynch family."
      },
      {
        "paragraph": "At the seaside villa."
      },
      {
        "paragraph": "“Dad, you misunderstood. I was set up.” Freya had no choice but to explain the whole incident."
      },
      {
        "paragraph": "Rodney drove over in a hurry and barged in, only to see Sarah sitting on the sofa, crying. Her face was\nstreaked with tears."
      },
      {
        "paragraph": "“Why are you here? Leave. I don’t want to see you. ”"
      },
      {
        "paragraph": "Sarah threw a tantrum at him and shouted as she cried, “Who was the one who said he’d love me\nforever? Yet, before I know it, you had sex with another woman. I hate betrayal the most in my life.”"
      },
      {
        "paragraph": "“Sarah, I’m sorry. I can explain.”"
      },
      {
        "paragraph": "Rodney was angry at first, but he became flustered when he saw her face."
      },
      {
        "paragraph": "“Last night, Freya was set up by Thomas, so Jessica threw me to Freya to relieve her. I was so drunk at"
      },
      {
        "paragraph": "that time. I didn’t know what happened at all.” “Thomas?”"
      },
      {
        "paragraph": "Sarah was horrified. She did not think Rodney would know about it so quickly. “This… This is\nimpossible.”"
      },
      {
        "paragraph": "“My sister saw it with her own eyes. I also wanted to look for Thomas just now, but I found out that he\nhad escaped overseas. He’s obviously guilty.”"
      },
      {
        "paragraph": "Rodney was pissed off. “ Sarah, why did you bring Thomas over last night? After all, Freya is a director in\nOsher Corporation. He’s too fearless. You should keep a distance from him in the future. I don’t want to\nsee him anymore in my life.”"
      },
      {
        "paragraph": "“You… You’re blaming me? I’m the victim here, okay?”"
      },
      {
        "paragraph": "Sarah felt even more upset, and more tears fell from her eyes. “I don’t wish to have a brother like him\neither, but what choice do I have? This is my fate. If I knew it, I surely would’ve stopped him.”"
      },
      {
        "paragraph": "“I’m not blaming you. ” Rodney smiled bitterly. “ Sarah, I just want you to understand that I didn’t betray\nyou on purpose.”"
      },
      {
        "paragraph": "“Don’t say any more.” Sarah pushed him away with her eyes red. “Your dad said it himself. Freya is the"
      },
      {
        "paragraph": "fiancee they chose, and I’m just a mistress. I don’t want to come in between both of you anymore…”"
      }
    ]
  },
  {
    "title": "Chapter 936 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Sarah, you’re the woman I love.” Rodney grabbed her hand frantically and said passionately, “For you, I\ncan give everything up.”"
      },
      {
        "paragraph": "“What… What do you mean?” Sarah had a bad feeling about this."
      },
      {
        "paragraph": "Rodney laughed bitterly. “My sister told me if I don’t acknowledge Freya as my fiancee, the Snow family\nwill blacklist Osher Corporation. And that cold-blooded woman, Jessica, can really do it. If the Snow\nfamily oppresses me, I may lose everything, but it’s okay. I still have some savings. I’m happy as long as\nI have you.”"
      },
      {
        "paragraph": "Sarah was stunned."
      },
      {
        "paragraph": "She already loathed Rodney for losing his right of succession to the Snow Corporation. If he lost Osher\nCorporation too, then what else would he have?"
      },
      {
        "paragraph": "They had to live on with that little bit of savings he had?"
      },
      {
        "paragraph": "How long could that tiny amount of savings last?"
      },
      {
        "paragraph": "Perhaps she would have to take care of Rodney and Thomas, the two useless things, with that small\namount of separation fee that Shaun had given her."
      },
      {
        "paragraph": "Besides, if she were to be with Rodney, who had lost everything, would others not laugh at her?"
      },
      {
        "paragraph": "“Rodney, thank you for loving me so much.”"
      },
      {
        "paragraph": "“Sarah, you’re the woman I love.” Rodney grabbed her hand frantically and said passionately, “For you, I\ncan give everything up.”"
      },
      {
        "paragraph": "Sarah raised her tearful gaze. “I’m aware of all the sacrifices you’ve made for me, but I can’t harm you.\nYou’ve put in a lot of effort after you graduated to establish Osher Corporation. There’s too much of your\nhard work in there. As a man, you should prioritize your career. I don’t want you to be looked down on by\nothers because of me.”"
      },
      {
        "paragraph": "Rodney was extremely touched. “ Sarah, it’s okay. I don’t mind being looked down on by other people. ”"
      },
      {
        "paragraph": "Sarah’s blood boiled. Rodney had to be an idiot, but she could not express it openly."
      },
      {
        "paragraph": "“But I do. I can’t let others look down on you. Besides, you may not regret it now, but who knows if you\nwould in the future?” Sarah sighed. “ If we can be together, I hope this will be a relationship with no\nregrets.”"
      },
      {
        "paragraph": "“What do you mean? You’re pushing me away?”"
      },
      {
        "paragraph": "Rodney was in agony."
      },
      {
        "paragraph": "“No. Let’s separate temporarily. Anyway, you’re only acknowledging Freya as your fiancee, not getting\nmarried. In the meantime, I’ll do my best to win the Snow family’s approval."
      },
      {
        "paragraph": "“I think when two people are together, they still need their parents’ support. I don’t want to see you be at\nodds with your family, and I hope you can mature quickly too. So much so that no one can threaten you. I\nbelieve you can do it.”"
      },
      {
        "paragraph": "Sarah looked at him encouragingly."
      },
      {
        "paragraph": "Rodney was deeply moved, but he felt even more sorry for her. “But Sarah, if I acknowledge Freya as my\nfiancee, others will mock you.”"
      },
      {
        "paragraph": "“For you, I don’t care even if I’m mocked at. As long as… I’m in your heart.”"
      },
      {
        "paragraph": "Sarah lowered her gaze and sighed. She had a sad, helpless look. “Maybe the heavens want to torture\nme. My love life seems to be filled with hardships. ”"
      },
      {
        "paragraph": "“Sarah, thank you for the sacrifices you’ve made for me.”"
      },
      {
        "paragraph": "Rodney raised his hand. “I, Rodney Snow, swear that you’re the only one I will love forever. I’ll definitely\nmarry you. Just wait and see, and I will mature quickly. I was too foolish in the past, with n o desire to\nimprove. I will develop Osher Corporation into a top global cosmetics brand as soon as possible. I have\nthe confidence to achieve it in a year. By then, no one can stop us from being together.”"
      },
      {
        "paragraph": "“Okay. I’ll be waiting for you.”"
      }
    ]
  },
  {
    "title": "Chapter 937 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "After leaving the seaside villa, Rodney called Chester out. He was in a bad mood."
      },
      {
        "paragraph": "However, when he went over, he realized Shaun was there too. Shaun had a straight face, and he wore\na black shirt and a pair of black pants. He looked exactly like a living king of hell."
      },
      {
        "paragraph": "“Why are you here too?”"
      },
      {
        "paragraph": "Rodney could not stand the sight of Shaun."
      },
      {
        "paragraph": "Shaun frowned his brows and looked at him, to which Chester hurriedly said, “Shaun heard you got into\ntrouble, so he was quite worried. Rodney, we’re all childhood friends who grew up together. Do we have\nto be like this because of a woman?”"
      },
      {
        "paragraph": "“ It’s not any other woman. It’s Sarah! ” Rodney’s tone was very aggressive. “ Shaun, in the end, it’s your\nfault that Sarah is so miserable. If it weren’t for you, the Snow family wouldn’t oppose her."
      },
      {
        "paragraph": "She’s really a good lady. Although I did her wrong, she’s still so considerate of me.”"
      },
      {
        "paragraph": "“Really?” Chester adjusted his glasses and exchanged glances with Shaun."
      },
      {
        "paragraph": "“In what way is she considerate of you?” Shaun was slightly curious."
      },
      {
        "paragraph": "Rodney explained sadly how the Snow family had threatened him."
      },
      {
        "paragraph": "“Not only didn’t Sarah blame me, she even cared about my company. She didn’t want others to look\ndown on me, so she said she’ll strive to make the Snow family members like her. Sarah is just too kind,"
      },
      {
        "paragraph": "After leaving the seaside villa, Rodney called Chester out. He was in a bad mood."
      },
      {
        "paragraph": "but you, Shaun, don’t even know how to cherish such a good woman. You must regret it a lot now, but\nregretting it is useless.”"
      },
      {
        "paragraph": "Shaun raised his eyebrows. If it were before, he might have been impressed with Sarah. He would even\nhave similar thoughts as Rodney."
      },
      {
        "paragraph": "However, he did not love Sarah anymore. When he calmed down and thought it over, he somehow felt\nthat Rodney was a simpleton."
      },
      {
        "paragraph": "He really wanted to remind Rodney that if he lost everything, a normal woman might not even want to be\nwith him."
      },
      {
        "paragraph": "Nevertheless, Sarah was superior in the fact that although she despised Rodney, she could still sound\nlike she was being thoughtful of him."
      },
      {
        "paragraph": "The more Shaun looked at Rodney, the more he felt that Rodney was like the old him."
      },
      {
        "paragraph": "He used to be suspicious of Sarah’s character, but now he was even sure that Sarah was not as\ninnocent and kind as he thought."
      },
      {
        "paragraph": "Unfortunately, he had hurt Catherine, who loved him deeply, for the sake of a person like that."
      },
      {
        "paragraph": "“Indeed… She’s quite kind.” After meeting Shaun’s gaze, Chester held his glass and cleared his throat. “\nSo what do you plan to do next?”"
      },
      {
        "paragraph": "Rodney laughed bitterly. “I can only pretend to get engaged with Freya and make the Snow family let\ntheir guard down. After that, I’ll go all out and work hard for Sarah’s sake. I’ll become so powerful that no\none in the Snow family can stop me. Sigh. I was too lazy in the past. I won’t be like that anymore in the\nfuture.”"
      },
      {
        "paragraph": "“Have you ever thought of Freya?” Shaun suddenly spoke. “You ruined her, yet you still want to use her.”"
      },
      {
        "paragraph": "Rodney froze. After feeling a fleeting trace of guilt, he immediately said, “You think too much. This\nwoman isn’t easy to deal with either. You guys don’t know this, but the Lynch family is coming to\nCanberra today. The two families will have a meal together tomorrow. Ha! I reckon she must’ve thought\nof taking advantage of the Snow family for a long time now. I’ll never marry a woman like her.”"
      },
      {
        "paragraph": "Shaun frowned. “When a woman experiences something like this and doesn’t acknowledge herself as\nyour fiancee, she’ll get scolded by the public. Other people will say that she broke…”"
      },
      {
        "paragraph": "“ Shaun, what’s wrong with you? Why do you keep siding with Freya?” Rodney cut him off angrily. “\nOther people may not know this, but you both should know. That woman has ruined the virginity that I’ve\nkept for 3o years. She should know about my feelings toward Sarah, yet she just had to get into this\nmess. Well then, she can’t blame me for being heartless.”"
      }
    ]
  },
  {
    "title": "Chapter 938 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Seeing Rodney’s prejudiced appearance made Shaun really want to throw him into the toilet and pour\nsome cold water on him to wake him up."
      },
      {
        "paragraph": "However, it would probably be no use, just like how he was before."
      },
      {
        "paragraph": "He did not believe anything anyone said. It was as if he was possessed."
      },
      {
        "paragraph": "“Come on. Drink if you’re in a bad mood. You’ll have no worries when you’re drunk.” Chester poured beer\nfor Rodney."
      },
      {
        "paragraph": "Only when Rodney was drunk and asleep on the sofa did Chester light a cigarette and sighed faintly."
      },
      {
        "paragraph": "“Why do I feel like Sarah isn’t trying to help him succeed at all? She just dislikes that he has nothing\nwithout Osher.”"
      },
      {
        "paragraph": "“I feel so too.” Shaun gave him a strange look. “ Didn’t you believe in Sarah before?”"
      },
      {
        "paragraph": "“She’s too good at pretending. Maybe Sarah changed three years ago, but we didn’t notice.”"
      },
      {
        "paragraph": "Chester glanced at him. “You didn’t go to the press conference yesterday, but it was quite a night. Freya\nwore a dress the same color as Sarah, and Rodney dragged Freya upstairs and forced her to change."
      },
      {
        "paragraph": "“Do you think the old Rodney would do something like that? Coincidentally, Freya’s red dress last night\nlooked better than Sarah’s.”"
      },
      {
        "paragraph": "Seeing Rodney’s prejudiced appearance made Shaun really want to throw him into the toilet and pour\nsome cold water on him to wake him up."
      },
      {
        "paragraph": "Shaun was startled. According to his understanding of Rodney, he definitely would not do such a thing\nwithout reason."
      },
      {
        "paragraph": "Rodney was a boorish person and would not think about the color of someone’s clothes unless someone\nincited him."
      },
      {
        "paragraph": "There was obviously no one else besides Sarah who would mind, and Rodney cared about Sarah’s\nfeelings the most."
      },
      {
        "paragraph": "“Chester, thank god… thank god I didn’t marry her back then.” Shaun suddenly lamented, “Do you think\neverything she said about Lucifer was true?”"
      },
      {
        "paragraph": "Chester had a strange look in his eyes. If it were before, he would have said absolutely not, but now…"
      },
      {
        "paragraph": "“It’s hard to say.”"
      },
      {
        "paragraph": "Shaun smiled bitterly. “I’m not qualified to laugh at Rodney. I used to be like him too.”"
      },
      {
        "paragraph": "“I was the same as well. ” Chester sighed. “That’s why I didn’t say some things earlier. He loves Sarah to\ndeath. If I say one bad thing about her, he’ll really throw hands at me.”"
      },
      {
        "paragraph": "“ If Cathy knows that Rodney is treating Freya like this, I bet she’ll be very angry,” Shaun muttered."
      },
      {
        "paragraph": "In the past, his foolishness had hurt Catherine. From now on, he did not want anyone around her to get\nhurt again."
      },
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "Shaun’s car drove into the parking lot of Hudson Corporation."
      },
      {
        "paragraph": "He honked the horn for a long time, yet the guard did not open the gates."
      },
      {
        "paragraph": "When the administrator came over, Shaun opened the door."
      },
      {
        "paragraph": "Upon seeing Shaun’s cold and handsome face, the administrator’s smile trembled. “I’m sorry, Eldest\nYoung Master Hill. Our chairman said that unfamiliar vehicles aren’t allowed to enter, especially… yours.”"
      },
      {
        "paragraph": "Shaun clenched the steering wheel bitterly. He did not think she would be so cruel. He was not even\nallowed to enter Hudson’s parking lot."
      },
      {
        "paragraph": "“Get out of the way,” Shaun said coldly."
      },
      {
        "paragraph": "“I’m sorry, I…” Before the administrator could finish his sentence, a check was stuffed into his hand."
      },
      {
        "paragraph": "“This is the money to compensate me for crashing the gate.”"
      },
      {
        "paragraph": "Then, Shaun started the car and charged toward the gate with a crash."
      },
      {
        "paragraph": "The administrator felt helpless. Not long after, Catherine’s car drove over, and she frowned at the broken\nrailing."
      },
      {
        "paragraph": "“President Jones, it was Eldest Young Master Hill who broke it. He even gave me a check, ” the\nadministrator explained."
      },
      {
        "paragraph": "Catherine frowned. He would have come sooner or later."
      }
    ]
  },
  {
    "title": "Chapter 939 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine drove in and saw a black Aston Martin parked beside her exclusive parking space."
      },
      {
        "paragraph": "Shaun sat at the front of the car, wearing a white shirt that was loosely tucked into his trousers. He\nprobably had lost some weight recently as his clothes looked a little loose."
      },
      {
        "paragraph": "“ Shaun Hill, why are you here? I believe I’ve made myself very clear. ” Catherine slammed the door as\nshe got off. Her tone sounded impatient."
      },
      {
        "paragraph": "Shaun’s heart ached."
      },
      {
        "paragraph": "All this while, he did not come to look for her at the company because he was afraid that she would look\nat him with such cold eyes."
      },
      {
        "paragraph": "“I have something to talk to you about. It has to do with your friend, Freya.”"
      },
      {
        "paragraph": "“What is it?” Catherine paused."
      },
      {
        "paragraph": "“Are we going to talk here? Let’s go to your office.” Shaun walked towards her."
      },
      {
        "paragraph": "“…Fine.”"
      },
      {
        "paragraph": "Catherine frowned. If it was about Freya, then she had to agree."
      },
      {
        "paragraph": "Once they were upstairs, she said directly, “Spit it out.”"
      },
      {
        "paragraph": "Shaun looked around. “Is this how you treat your guests? Where’s the cup of tea?”"
      },
      {
        "paragraph": "Catherine drove in and saw a black Aston Martin parked beside her exclusive parking space."
      },
      {
        "paragraph": "“If you’re here for tea, you can go out and turn right, and take the elevator and go straight down.”\nCatherine crossed her arms. “I’m very busy. I have n o time to drink tea with Eldest Young Master Hill.”"
      },
      {
        "paragraph": "“You’re so heartless.” Shaun’s heart was extremely bitter. He never thought that he would have to use\nFreya as an excuse just to see her. “Why did you move?”"
      },
      {
        "paragraph": "“Shaun Hill, I only let you up because of Freya.” Catherine was getting impatient."
      },
      {
        "paragraph": "“Do you not want to see me that much?” Shaun looked at her with his deep eyes."
      },
      {
        "paragraph": "“ Isn’t that inevitable? Just looking at you disgusts me.”"
      },
      {
        "paragraph": "Catherine did not conceal the disgust in her eyes."
      },
      {
        "paragraph": "“Haven’t I made myself clear enough? You’re always like that. When you think you’re right, you look\ndown on me from high above, and your actions towards me are worse than death. But the moment you\nknow you’re wrong, you immediately come back to please me and beg for forgiveness. It has happened\nmore than just once or twice. Even if you’re not tired, I’m annoyed.”"
      },
      {
        "paragraph": "Shaun’s handsome face turned unpleasant at her words."
      },
      {
        "paragraph": "No one had ever scolded him like this. However, he now realized that he was willing to take the scolding\nas long as he could see her."
      },
      {
        "paragraph": "These days, he has been going crazy thinking about her every day. Especially the guilt and longing that\nmade him suffer."
      },
      {
        "paragraph": "“I’m only here to remind you that it’s best not to let Freya agree to the engagement with Rodney.”"
      },
      {
        "paragraph": "Shaun said with some difficulty, “Rodney has been completely bewitched by Sarah, and there’s no way\nhe’ll marry Freya. Freya is just a strategy he’s using to delay the Snow family…”"
      },
      {
        "paragraph": "“Is that all you wanted to say?” Catherine interrupted him in exasperation. “I don’t need you t o tell me\nwhat I already know. Do you think I’m stupid enough to think that Rodney suddenly likes Freya because\nthey spent a night together?"
      },
      {
        "paragraph": "“Have you ever thought about how the public would criticize Freya if she didn’t admit that they were\nengaged? They would say she wrecked other people’s relationships and call her the third-party.”"
      },
      {
        "paragraph": "Shaun gulped. In fact, he had also thought of that."
      },
      {
        "paragraph": "“You’re saying all this because you want to stop Freya from getting in between Rodney and Sarah, right?\nYou’re also taking great pains in order to make sure Sarah gains happiness.” Catherine sneered."
      },
      {
        "paragraph": "“It’s not that. Cathy, I really didn’t know Sarah well before. But so many things have happened recently\nthat I now realize I was indeed blind before. She’s not that simple.”"
      },
      {
        "paragraph": "Shaun hurriedly defended, “If Freya continues on with this, she’ll become cannon fodder between Sarah\nand Rodney. Rodney has been completely brainwashed by Sarah. His feelings for her are too deep.”"
      },
      {
        "paragraph": "“Oh,” Catherine responded faintly. “Are you done? Then you can go.”"
      },
      {
        "paragraph": "This annoyed Shaun. How many times had she told him to leave today?"
      },
      {
        "paragraph": "“Cathy, I’ll compensate Logan, okay? Or… I’ll pay him back with my finger.”"
      }
    ]
  },
  {
    "title": "Chapter 940 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine looked astonished."
      },
      {
        "paragraph": "She had never thought that the high and mighty Shaun Hill would propose such compensation."
      },
      {
        "paragraph": "In his eyes, Logan was just a bodyguard. With Shaun’s previous character, there was no way he would\nuse his own fingers to compensate."
      },
      {
        "paragraph": "When Shaun saw that she had stopped talking, a hint of determination flashed in his narrow dark eyes.\n“As long as you can forgive me, I’m willing to compensate him with my own finger. He can even cut it off\nhimself.”"
      },
      {
        "paragraph": "He held out his hand and looked at her with burning eyes."
      },
      {
        "paragraph": "It was just a finger. Without it, he could still hug and kiss her."
      },
      {
        "paragraph": "The pain of losing a finger would definitely not be a s deep as the pain of her hating and avoiding him."
      },
      {
        "paragraph": "Catherine glanced at his fingers. She had known before that his fingers were slender and clean, but she\nhad never seen a man’s fingers look as good as his."
      },
      {
        "paragraph": "“No need.” She turned away and said faintly, “ What’s the point of cutting off your finger? Logan can’t\nattach it to his anyway.”"
      },
      {
        "paragraph": "Shaun’s handsome face revealed a smile, and even his eyes were bright like starlight. “Cathy, is it\nbecause you feel bad for me? You can’t bear for me to cut off my finger.”"
      },
      {
        "paragraph": "Catherine looked astonished."
      },
      {
        "paragraph": "“You’re overthinking.” Catherine immediately denied it. “It’s because I don’t want to forgive you, and I\ndon’t want to get back together with you."
      },
      {
        "paragraph": "Shaun Hill, don’t you get it yet? Being with you is too painful, and I’ve never had a day of peace."
      },
      {
        "paragraph": "Besides, you can even hurt your own children. I can never get back together with a man like you.”"
      },
      {
        "paragraph": "As soon as she finished, she got up."
      },
      {
        "paragraph": "Shaun’s handsome face paled, and he subconsciously grabbed her arm. “Where are you going?”"
      },
      {
        "paragraph": "“Obviously, if you won’t leave, then I will, ” Catherine said calmly."
      },
      {
        "paragraph": "Shaun’s throat moved in pain, and his grip on her tightened slightly. As he stared at her for half a second,\nthe guilt in his eyes was replaced by an abyss of darkness."
      },
      {
        "paragraph": "“Cathy, don’t you understand? Since you incurred me in this life, don’t even think of leaving.”"
      },
      {
        "paragraph": "“ Shaun Hill, you’re dreaming.” Catherine looked up with eyes full of anger."
      },
      {
        "paragraph": "However, Shaun only smiled. It was fine if she hated him or if she was angry at him. As long as he could\nsee her face from now on, he would be satisfied."
      },
      {
        "paragraph": "As for the rest, it did not matter. For the rest of his life, he would be able to soften her eventually."
      },
      {
        "paragraph": "Yet, if he let go now, they would have nothing to do with each other."
      },
      {
        "paragraph": "“Cathy, you shouldn’t have come back to me for revenge.” Shaun stared at her. “If I had married Sarah,\nnothing would have happened to you. But you just had to make me fall deeply in love with you. Say, do\nyou think I’d let go of the woman I love so deeply?”"
      },
      {
        "paragraph": "“Why? What are you going to threaten me with this time?” Catherine mocked. “Sorry to say this, but my\ndad’s illness has been cured, and Yule Corporation has nothing to do with me anymore. Do you want to\ndeal with Hudson again? Go ahead. I have a lot of money anyway, so it’s fine if Hudson changes owners.\nMoney is just a mere worldly possession.”"
      },
      {
        "paragraph": "Shaun was at a loss for words. Yes, there was nothing he could threaten her with anymore. What else\ncould he do?"
      },
      {
        "paragraph": "“Cathy, don’t force me. In this life, you can only be mine.” He stared at her for a moment and left behind\nthose determined words, and turned to leave."
      },
      {
        "paragraph": "Just like that, Catherine’s good mood was ruined for the day."
      },
      {
        "paragraph": "With Shaun’s character, she was sure that he would not give up easily. However, she did not know what\nhe would do this time."
      },
      {
        "paragraph": "5:00 P.M."
      },
      {
        "paragraph": "Wesley drove over to pick her up."
      },
      {
        "paragraph": "When she got into the car, her eyes flashed with anxiety. “Wesley, you should come to see me less often\nfor now. Shaun came to the company today. I’m afraid he’ll deal with you to threaten me again i f he finds\nout about our relationship.”"
      },
      {
        "paragraph": "“He has always been like that. How despicable.” Wesley sneered in anger."
      }
    ]
  },
  {
    "title": "Chapter 941 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Yeah. ” Catherine sighed softly. “But he is much more powerful than he was before. Nothing good will\nhappen if we fight him with force.”"
      },
      {
        "paragraph": "Wesley looked deep into her eyes. He wanted to comfort her that the Hill Corporation would fall soon, but\nunfortunately, she would not understand i t now. “Cathy, why don’t we… register our"
      },
      {
        "paragraph": "marriage. Once we register, we’ll be lawfully wedded, and Shaun won’t be able to do anything.”"
      },
      {
        "paragraph": "“Register?”"
      },
      {
        "paragraph": "Catherine was utterly shocked."
      },
      {
        "paragraph": "She had just agreed to the proposal, yet they were registering so soon? She blanked out for a moment."
      },
      {
        "paragraph": "“Yes. Is it too sudden? Did I scare you?” Wesley said with shame, “Cathy, I have no choice either. I don’t\nwant to lose you again. Don’t worry, the registration and the ceremony will be held at the same time.\nLet’s have our wedding back in Melbourne so as not to tip Shaun off. I don’t want to be like Shaun. Even\nthough you were wedded to him, you didn’t even get a decent wedding.”"
      },
      {
        "paragraph": "“Thank you.” Catherine felt relieved when she heard his words, and the anxiety in her dispelled."
      },
      {
        "paragraph": "Under current circumstances, it seemed there was no need to hesitate anymore."
      },
      {
        "paragraph": "Besides, Wesley had waited for her for so long. She should not make him wait any longer."
      },
      {
        "paragraph": "“Okay. I’ll agree.”"
      },
      {
        "paragraph": "“Yeah. ” Catherine sighed softly. “But he is much more powerful than he was before. Nothing good will\nhappen if we fight him with force.”"
      },
      {
        "paragraph": "She nodded after a moment."
      },
      {
        "paragraph": "“That’s great. I’ll immediately get the people in Melbourne to prepare. The wedding won’t be big to avoid\ntoo much people’s attention, but I’ll definitely make sure it’s beautiful. Both our parents will be there. Oh\nright, let’s have Suzie and Lucas be our flower girl and page boy,” Wesley said happily."
      },
      {
        "paragraph": "“Okay.” Catherine nodded hesitantly. “But if your parents find out I have two children…”"
      },
      {
        "paragraph": "“They already know, but there’s nothing they can do because I like you so much. I told them that I won’t\nmarry anyone except you. Otherwise, I would rather leave the family and become a monk. They can’t do\nanything about it.”"
      },
      {
        "paragraph": "Wesley glanced at her belly and said, “Besides, since you had twins before, maybe you’ll have"
      },
      {
        "paragraph": "another two the next time. Then, the family will be lively.”"
      },
      {
        "paragraph": "Catherine blushed in embarrassment. “Don’t say that. It’s making me a little pressured…”"
      },
      {
        "paragraph": "“I’m just joking. As long as it’s yours, I’ll like them.”"
      },
      {
        "paragraph": "Wesley leaned in and kissed her forehead."
      },
      {
        "paragraph": "Catherine closed her eyes and said to herself, ‘So be it.’"
      },
      {
        "paragraph": "Soon, she would marry again."
      },
      {
        "paragraph": "In this marriage, she wanted to grow old with Wesley."
      },
      {
        "paragraph": "5:30 p.m."
      },
      {
        "paragraph": "In the restaurant, the Snow and Lynch families dined together."
      },
      {
        "paragraph": "Old Master Snow was present. Beside him sat Jason and his wife, in addition to Carson and Jessica.\nOnly the protagonist, Rodney, was absent."
      },
      {
        "paragraph": "Mr. Lynch’s expression was unpleasant. Although the Snow family was much bigger than the Lynch\nfamily in both business and power, Rodney’s absence was too disrespectful to Freya."
      },
      {
        "paragraph": "“Old Master Snow, seeing that Rodney isn’t showing up, nothing forced will turn out good… ”"
      },
      {
        "paragraph": "“Maybe he’s stuck in traffic.” Old Master Snow shot a look at Jessica."
      },
      {
        "paragraph": "Jessica immediately took her phone and went out to make a call. “I’ll give you ten minutes. If you don’t\nget over here by then, don’t bother coming at all.” “Jessica Snow, don’t be so vicious. I’m stuck in traffic.”\nRodney’s angry voice sounded."
      }
    ]
  },
  {
    "title": "Chapter 942 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“You know very well whether you’re stuck in traffic or deliberately dawdling.”"
      },
      {
        "paragraph": "Jessica said coldly, “You want me to leave Osher alone, yet you also want to give the Lynch family and\nme an attitude. I don’t think you understand your situation.”"
      },
      {
        "paragraph": "At that, she ended the call."
      },
      {
        "paragraph": "After she returned to the room, no one asked when Rodney was coming either."
      },
      {
        "paragraph": "However, ten minutes later, Rodney rushed into the room, panting."
      },
      {
        "paragraph": "His handsome face was flushed because he ran three kilometers in a few minutes, and he could not utter\na word for a long time."
      },
      {
        "paragraph": "Jason smiled and said, “President Lynch, you can rest assured now. Our Rodney is very sincere. Look,\nhe used up all his strength running over here.”"
      },
      {
        "paragraph": "Mr. Lynch glanced at Rodney but did not think highly of him."
      },
      {
        "paragraph": "Rodney was wearing a pair of jeans and a floral"
      },
      {
        "paragraph": "shirt. He did look beautiful, but why should a man be beautiful?"
      },
      {
        "paragraph": "Before this, Patrick was handsome as well, but his character was not great. Why did his daughter always\nmeet such men?"
      },
      {
        "paragraph": "“You know very well whether you’re stuck in traffic or deliberately dawdling.”"
      },
      {
        "paragraph": "Fortunately, Freya did not intend to marry him."
      },
      {
        "paragraph": "“Rodney, these are Freya’s parents.” Jason introduced. “Hurry up and greet them.”"
      },
      {
        "paragraph": "“Uncle, Aunty,” Rodney called out stiffly and was just about to sit down."
      },
      {
        "paragraph": "Carson directly dragged the chair away. “Brother, go and sit with sister-in-law.”"
      },
      {
        "paragraph": "Sister-in-law…"
      },
      {
        "paragraph": "The corners of Rodney’s mouth twitched, and Freya did not feel comfortable with it as well. “Just call me\nFreya. We should be around the same age.”"
      },
      {
        "paragraph": "“That won’t do. The Snow family pays great attention to seniority in the family. Even if you’re younger\nthan me, I have to call you sister-in-law.” Carson grinned. “Sister-in-law, let’s add each other’s\nWhatsApp.”"
      },
      {
        "paragraph": "Freya thought Carson was much more amiable than Rodney. After she took out her phone and added\nCarson, Wendy Collins also said, “Freya, add me as well. This way, we can contact each other. Your\nparents are in Melbourne, so you can just think of the Snow family as your family from now on.”"
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "With that, Freya added all the Snow family members ‘ WhatsApp before Wendy took out a brocade box\nand handed it over. “Since it’s an engagement,"
      },
      {
        "paragraph": "there must be an engagement gift. This is for you.”"
      },
      {
        "paragraph": "Freya opened it to see a jade pendant. The style was very modern and original, and the jade was bright\nand clear like water."
      },
      {
        "paragraph": "Rodney was shocked. His mother had spent tens of millions of dollars to buy that at an auction a few\nyears ago. She claimed that it was for his future wife, but he did not expect her to give it to Freya now."
      },
      {
        "paragraph": "“Mom…”"
      },
      {
        "paragraph": "“Shut up.” Wendy gave him a warning glare."
      },
      {
        "paragraph": "Freya was a little stunned. She knew nothing about the jade at all."
      },
      {
        "paragraph": "However, Mrs. Lynch could tell. “That’s too expensive. I think it must be worth tens of millions of dollars.”"
      },
      {
        "paragraph": "“There’s more. I’ve promised before that as long as Freya is willing to marry into the Snow family, I can\ngive her 1o percent of Snow Corporation’s shares.” Old Master Snow said in a deep voice, “Take it."
      },
      {
        "paragraph": "There’s no way the Snow family will ill-treat Freya.”"
      },
      {
        "paragraph": "The Lynch family was stunned."
      },
      {
        "paragraph": "Mr. Lynch was even more surprised. The Snow family was indeed a good family, but it was a pity that he\ndid not like Rodney. After the meal, Old Master Snow said, “Rodney, send your in-laws to the airport.\nThey’re going back to Melbourne tonight.”"
      }
    ]
  },
  {
    "title": "Chapter 943 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Okay, ” Rodney replied."
      },
      {
        "paragraph": "When he went to get the car, Mr. Lynch lamented, “ Except for Rodney’s crooked personality, the rest of\nthe Snow family is quite nice. They don’t have the arrogance that the typical large and wealthy families\nhave.”"
      },
      {
        "paragraph": "“You’re absolutely right, Dad.” Freya nodded in agreement."
      },
      {
        "paragraph": "However, Mrs. Lynch felt sorry for her. “Actually, Carson is quite good. Why weren’t you engaged to him\ninstead?”"
      },
      {
        "paragraph": "Soon, Rodney drove the car over."
      },
      {
        "paragraph": "He hardly talked to Mr. and Mrs. Lynch, but along the way, Freya was acting spoiled to her parents."
      },
      {
        "paragraph": "It was clear that the Lynch family pampered Freya quite a lot. The Lynch family atmosphere seemed\ngood, unlike some small local families who tried to curry favor with him the moment they heard that he\nwas from the Snow family."
      },
      {
        "paragraph": "Only after Mr. and Mrs. Lynch got on the plane that Freya and Rodney left."
      },
      {
        "paragraph": "Rodney said directly, “I have no choice but to agree to this marriage for the time being, but don’t think too\nmuch about it. I’ll never like you, and I’ll never be responsible for you. By the way, give me back the jade\npendant that my mother gave you.”"
      },
      {
        "paragraph": "“Okay, ” Rodney replied."
      },
      {
        "paragraph": "Freya was stunned. She knew that he was a scumbag, but such scummy men were rare."
      },
      {
        "paragraph": "“Hurry up and give it to me.” Rodney was embarrassed by her gaze, but he had no choice. He could not\nhurt Sarah. “I’m going to give it to Sarah.”"
      },
      {
        "paragraph": "Freya really wanted to ask, ‘If your mom knows, will she die of anger?’"
      },
      {
        "paragraph": "“You don’t want to give it back?” Rodney glared at her. “Freya Lynch, this jade pendant is as expensive\nas I am. It’s not something you can afford to keep. ”"
      },
      {
        "paragraph": "“This jade pendant… is indeed quite expensive.” Freya took it out and deliberately waved it in front of\nhim. “But you? Forget it. Although you’re part of the Snow family, you don’t have any status, and"
      },
      {
        "paragraph": "you don’t have any rights to inheritance. As for Osher, if I hadn’t given you the formula, it would’ve"
      },
      {
        "paragraph": "gone downhill in the next two years.”"
      },
      {
        "paragraph": "“You…” Rodney’s face flushed in anger. He was such an excellent person, but she spoke as if he was\nworthless."
      },
      {
        "paragraph": "“Tsk, as a man, aren’t you ashamed of living like this?” Freya then took out her cell phone to make a call."
      },
      {
        "paragraph": "Rodney did not know what she was doing until he heard Freya sweetly call out the word ‘Aunty’. That\nwas when he realized this woman had called his mother."
      },
      {
        "paragraph": "“Freya Lynch, give me the phone.” Rodney reached out to grab it."
      },
      {
        "paragraph": "“Rodney Snow, I dare you to hit me,” Freya shouted while she dodged. “Well, Aunty. Rodney said he\nwants the jade pendant you gave me. He said that it’s not something I can keep, and he wants to give it\nto Sarah.”"
      },
      {
        "paragraph": "“Mom, I didn’t. Don’t listen to her… ” Rodney was so anxious that he hugged Freya in an attempt to grab\nher phone over and explain, only to find out that she dialed an invalid number."
      },
      {
        "paragraph": "“Bahaha. ” Freya burst out in laughter. “Weren’t you pretty arrogant earlier? Didn’t you want to give this to\nSarah?”"
      },
      {
        "paragraph": "“Freya Lynch, you lied to me.” Rodney went mad with anger. He wanted to teach her a lesson, but he\nsuddenly realized that he was hugging her tightly."
      },
      {
        "paragraph": "He pushed her away."
      },
      {
        "paragraph": "“Tsk. I need to go back and shower. I’m afraid I’ll get sick from hugging someone like you.” Freya walked\nout of the airport with a disgusted face."
      },
      {
        "paragraph": "“You’re the one who’s sick.” Rodney snarled."
      },
      {
        "paragraph": "“Oh, you didn’t know?” Freya looked back at him with a complicated look."
      },
      {
        "paragraph": "“After Cathy slept with Shaun the last time, she had to rush to the hospital to get a checkup. She was\nafraid of contracting a disease because Shaun was in a relationship with Sarah, who had slept with that\nLucifer guy for god knows how many times."
      },
      {
        "paragraph": "“Do you need me to talk about Lucifer? He did drugs and liked to sleep around with all kinds of women.\nWho knew if he got a disease? Why else did you think Shaun refused to touch Sarah? He also has his\nown concerns.”"
      }
    ]
  },
  {
    "title": "Chapter 944 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Stop talking nonsense.” Rodney was a little disturbed by what Freya said."
      },
      {
        "paragraph": "“ I’m just telling the truth. ” At that, Freya turned around and hailed a cab."
      },
      {
        "paragraph": "“You don’t want me to send you back?” Rodney blurted out."
      },
      {
        "paragraph": "“ I wouldn’t dare. You’re too noble. I’m afraid that you’ll throw me off a viaduct. ” Freya immediately got in\nthe car without staying back."
      },
      {
        "paragraph": "Rodney was in a daze for a long time. This did not play out as he imagined."
      },
      {
        "paragraph": "He thought that Freya would definitely pester him. After all, 10 percent of Snow Corporation’s shares was\nvery tempting."
      },
      {
        "paragraph": "Hold on. He had forgotten to remind her to take contraceptives."
      },
      {
        "paragraph": "Fifty minutes later, Freya got out of the car, only to see Rodney show up at the community gate."
      },
      {
        "paragraph": "“What do you want this time?” Freya’s mood turned sour as soon as she saw that idiot."
      },
      {
        "paragraph": "“Eat this.” Rodney handed her a box of contraceptives with evasive eyes. “ I can’t let you be pregnant\nwith my child.”"
      },
      {
        "paragraph": "Freya’s heart chilled."
      },
      {
        "paragraph": "Why was she so unlucky in her life? First, she met Patrick, and now, it was Rodney."
      },
      {
        "paragraph": "“Stop talking nonsense.” Rodney was a little disturbed by what Freya said."
      },
      {
        "paragraph": "“Don’t worry. I ate one when I came out of the hotel yesterday. It would have been too late if I waited for\nyou to bring it to me. ” Freya held back her anger as she approached step by step."
      },
      {
        "paragraph": "“Rodney Snow, don’t go too far. I was set up at your press conference, so I’m the victim. Please\nremember that if it weren’t because I joined Osher, my first time wouldn’t have been ruined by you."
      },
      {
        "paragraph": "You can dislike me, but you should at least have a conscience.”"
      },
      {
        "paragraph": "Rodney could not help but step back from the anger in her eyes, and his body felt a little weak."
      },
      {
        "paragraph": "“I’m doing it for your own good. I don’t like you, so even if you end up pregnant with my child, you’ll be a\nsingle mother. Anyway, don’t think your status will change just because you have my child.”"
      },
      {
        "paragraph": "“Don’t worry. I don’t want to propagate your inferior genes, but this happened to me at your press\nconference. Shouldn’t you give me an explanation as to who set me up?” Freya said aggressively."
      },
      {
        "paragraph": "Rodney was stunned by the question. Of course, he knew it was Thomas."
      },
      {
        "paragraph": "However, Thomas was Sarah’s brother, and Sarah had already compromised so much for him. If he told\nher, Thomas might be taken away."
      },
      {
        "paragraph": "“ I… How would I know? You must have stirred up some wild bees by dressing up like that. ” Rodney\nlooked away in guilt, not daring to meet her eyes."
      },
      {
        "paragraph": "However, his gaze could not escape Freya’s eyes."
      },
      {
        "paragraph": "It seemed like Cathy’s guess was right. It really was Thomas Neeson that night, and Rodney knew it,"
      },
      {
        "paragraph": "but he was covering it up for Sarah."
      },
      {
        "paragraph": "A deep trace of disappointment flashed deep in her eyes."
      },
      {
        "paragraph": "Although she did not like him, she still approved of this man. She just thought he was blind to like Sarah."
      },
      {
        "paragraph": "It was fine if his eyes were blind, but his heart was blind too, so much that he could not distinguish right\nfrom wrong. There was nothing to appreciate about a person like that."
      },
      {
        "paragraph": "Without another look at him, Freya turned to leave."
      },
      {
        "paragraph": "“Hey, you’re just… leaving like that?” Rodney was stunned for a moment but subconsciously stopped\nher."
      },
      {
        "paragraph": "“What? Will you tell me that it was Thomas? Will you help me catch him? You even helped him to cover\nup the evidence.”"
      },
      {
        "paragraph": "Freya sneered coldly. “Rodney Snow, don’t take me for a fool. That night, only Thomas would dare to do\nsuch a thing, considering how he dared to break into my house, beat me up, and assault me three years\nago."
      },
      {
        "paragraph": "“Three years later, he has you to protect him, so what can’t he do? He has such a good life. Even if he\ndoesn’t have Young Master Hill, he still has Young Master Snow.”"
      },
      {
        "paragraph": "Then, she lowered her eyes to conceal the hatred in her eyes and left without looking back."
      },
      {
        "paragraph": "Rodney watched her silhouette, and his beautiful face heated up in embarrassment. He did not think she\nwould know everything."
      },
      {
        "paragraph": "It was Thomas who set her up and Rodney who ruined her innocence."
      },
      {
        "paragraph": "Thinking about it, he really did go too far by saying those words."
      },
      {
        "paragraph": "She had done nothing wrong since the start. He should make it up to her."
      }
    ]
  },
  {
    "title": "Chapter 945 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "At night, a business banquet was in progress."
      },
      {
        "paragraph": "Shaun stood on the open-air balcony, under the night sky, with a wine glass in his hand."
      },
      {
        "paragraph": "His deep and gloomy eyes looked through the window at the brilliant and spectacular party inside."
      },
      {
        "paragraph": "He would not have come if the host had not been a partner for many years."
      },
      {
        "paragraph": "He was not at all interested in events like this."
      },
      {
        "paragraph": "If he had not fallen out with Catherine, she might have accompanied him to this banquet. With her, the\nbanquet would not be so boring."
      },
      {
        "paragraph": "Perhaps it was because he had drunk a little, but Shaun’s mind was filled with a ruthless thought."
      },
      {
        "paragraph": "He missed her. He wanted to drag her into his arms tightly and kiss her hard."
      },
      {
        "paragraph": "Suddenly, a man and woman came out. “Hubby, why did you ask me for Nebula’s contact information\njust now?”"
      },
      {
        "paragraph": "“It’s because of Wesley Lyons from Golden Corporation.” The man explained, “He thought that the dress\nyou wore during our wedding was beautiful, so he asked me for Nebula’s contact.”"
      },
      {
        "paragraph": "“Why is a man like him going to Nebula? Is he getting it for his girlfriend? But I never heard of him having\na girlfriend before. Hey, did you make it clear to him? Nebula mainly makes wedding dresses.”"
      },
      {
        "paragraph": "At night, a business banquet was in progress."
      },
      {
        "paragraph": "“I did. He didn’t answer me when I asked if he was getting married, but I heard that his family in\nMelbourne had arranged a marriage for him, and he was very satisfied with it.”"
      },
      {
        "paragraph": "“Maybe he really is getting married. You’ll have to attend the wedding.”"
      },
      {
        "paragraph": "“He said it won’t be a grand wedding, and the ceremony will be held in Melbourne, but I’ve already given\nhim my blessings.”"
      },
      {
        "paragraph": "Wesley Lyons!"
      },
      {
        "paragraph": "Shaun’s dark pupils moved."
      },
      {
        "paragraph": "If that man had not mentioned it, he would have forgotten that name."
      },
      {
        "paragraph": "Three years ago, Wesley continually pestered Catherine and eyed her covetously, but now, he was\ngetting married."
      },
      {
        "paragraph": "After all, three years had passed. He could not wait for Catherine forever, and he was not getting\nyounger, so it was normal for him to get married."
      },
      {
        "paragraph": "However, there was an inexplicable sense of unease in his heart."
      },
      {
        "paragraph": "Annoyed, he took a sip of wine. The person Wesley was marrying was not Catherine, so why was he\nthinking so much?"
      },
      {
        "paragraph": "At 9:00 p.m., when he was getting ready to leave, he just so happened to see Wesley coming out from\nthe washroom corridor."
      },
      {
        "paragraph": "It was clear that Wesley was in a good mood. A relaxed smile hung on the corners of his lips, and he was\ndressed in a handsome black suit and vest, which made him look graceful and elegant."
      },
      {
        "paragraph": "Shaun frowned and subconsciously felt like he was an eyesore."
      },
      {
        "paragraph": "“President Hill.” Wesley nodded politely at him as a greeting."
      },
      {
        "paragraph": "“Hm.” Shaun lifted his long legs and left. When the arrogant guy left, a mocking smile curled on Wesley’s\nmouth."
      },
      {
        "paragraph": "‘Shaun Hill, let’s see how long you can be proud of yourself! ‘"
      },
      {
        "paragraph": "‘Soon, you’ll fall from the clouds, and your woman will marry me.’"
      },
      {
        "paragraph": "‘It’s a pity that you don’t know anything yet.’"
      },
      {
        "paragraph": "After leaving the business banquet, Shaun had the driver send him to the entrance of the Yule family\nvilla."
      },
      {
        "paragraph": "Then, he told the driver to leave as he leaned against the car by himself, quietly looking at the windows\nof the villa."
      }
    ]
  },
  {
    "title": "Chapter 946 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "On the second -floor window of the villa, Lucas’s nimble little body climbed up to the window and glanced\nout. “Mommy, Shaun is at the gate again.”"
      },
      {
        "paragraph": "These nights, Shaun would always stop his car at the Yule family villa’s entrance, and sometimes, he\nwould only leave after Catherine left for work."
      },
      {
        "paragraph": "Catherine was already used to it. “Don’t mind him. Go to sleep.”"
      },
      {
        "paragraph": "Catherine carried Lucas down from the chair and pulled the window shutters, afraid that Shaun’s sharp\neyes would see Lucas."
      },
      {
        "paragraph": "“Mommy, if he’s always here, what will happen if he finds out that you’re getting married to Uncle\nWesley?” Lucas said worriedly."
      },
      {
        "paragraph": "“He won’t. When the time comes, I’ll have the company declare that I’m on a business trip and will be\ngone for a few days.” Catherine rubbed his little head to comfort him. “Lucas, will you… mind that\nMommy is getting married?”"
      },
      {
        "paragraph": "“No. I’m glad that Mommy has finally found someone who will treat you well, ” Lucas said seriously. “And\nUncle Wesley is very good to Suzie and me. Of course, if he treats you badly one day, I will teach him a\nlesson for you. I’m very good at martial arts now. When I grow up, I’ll become so powerful that no one\ncan bully Mommy anymore.”"
      },
      {
        "paragraph": "“Good boy.” Catherine kissed his forehead."
      },
      {
        "paragraph": "The next day, Catherine drove out from the villa."
      },
      {
        "paragraph": "On the second -floor window of the villa, Lucas’s nimble little body climbed up to the window and glanced\nout. “Mommy, Shaun is at the gate again.”"
      },
      {
        "paragraph": "When she came out of the gate, she drove away directly as if she did not notice Shaun’s existence."
      },
      {
        "paragraph": "Shaun watched her distant car with a face full of bitterness."
      },
      {
        "paragraph": "In the past, when he waited at the gate, she would still come out to talk with him in the morning."
      },
      {
        "paragraph": "Now, she did not even give him the opportunity to meet her."
      },
      {
        "paragraph": "However, since she went to work, there was no need for him to stay here anymore."
      },
      {
        "paragraph": "In the evening, when he was getting ready to go to the Yule family, Old Madam Hill suddenly called him\nand asked him to come back."
      },
      {
        "paragraph": "It was already 6:00 p.m., and Suzie was eating with Old Master and Old Madam Hill."
      },
      {
        "paragraph": "When she saw Shaun walk in, her heart became inexplicably sour as she bit the spoon."
      },
      {
        "paragraph": "Although she was still young, she could see that scummy dad was thinner and more disheveled. His\noriginally clean and neat short hair had grown slightly. He was still handsome and dashing, but he was\nalso much more sullen."
      },
      {
        "paragraph": "“Eat some dinner before you go upstairs for a good night’s sleep.” Old Madam Hill sighed."
      },
      {
        "paragraph": "No matter what, he was still her grandson, so seeing him like this made her heart ache. “Stop waiting at\nthe Yule family’s gate every day. You just finished surgery. You will only ruin your body.”"
      },
      {
        "paragraph": "“ I’m busy. If there’s nothing else you need, I’ll be leaving.”"
      },
      {
        "paragraph": "As Shaun was about to turn to leave, Old Master Hill suddenly lost his temper."
      },
      {
        "paragraph": "“Don’t think I don’t know that you’re going to the Yule family again. Everyone in Sherman Mountain\nalready knows about you waiting there every night, and she wants you to leave. Back then, all of us\npersuaded you, but it was no use. Now that you regret it, you want to go back to her again. Do you think\nyou can get back with her or throw her away whenever you want?”"
      },
      {
        "paragraph": "“Yes, Shaun. Let her go, and let yourself go. You’re still young, with a long road ahead of you. She’s not\nthe only woman in this world.” Old Madam Hill shook her head."
      },
      {
        "paragraph": "She was too old to understand the younger generation’s love affairs, but she felt like no woman would be\nable to forgive her grandson."
      },
      {
        "paragraph": "“I don’t want anyone else but her.” Shaun clenched his fist stubbornly and walked forward."
      },
      {
        "paragraph": "Suzie ran over and suddenly grabbed his hand."
      },
      {
        "paragraph": "“Uncle, don’t go. Can you sleep with me tonight? Daddy isn’t coming home, and I don’t want to sleep\nwith the nanny.”"
      },
      {
        "paragraph": "The little girl looked at him with limpid and pleading eyes, and Shaun’s heart softened. He could not bear\nto refuse her."
      },
      {
        "paragraph": "He could say it to others, but he could never say ‘no ‘ to Suzie."
      },
      {
        "paragraph": "“Stay with Suzie.” Old Madam Hill immediately persuaded him when she saw that he had not moved.\n“You haven’ t been back in a while, so she misses you.”"
      }
    ]
  },
  {
    "title": "Chapter 947 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“…Okay.” Shaun gave in."
      },
      {
        "paragraph": "At night, after the nanny gave Suzie a bath, Shaun hugged her to sleep."
      },
      {
        "paragraph": "Although he had not slept much in the past few days, he could not fall asleep when he lay in bed."
      },
      {
        "paragraph": "However, he did not expect Suzie to toss and turn o n his chest, not able to sleep either. “Uncle…”"
      },
      {
        "paragraph": "“Hm? What’s wrong?” Shaun looked at her gently."
      },
      {
        "paragraph": "Suzie’s heart felt sour. She knew that he was her real father, but she could not tell him that her mommy\nwas about to marry Uncle Wesley in a week."
      },
      {
        "paragraph": "Uncle Wesley was good, but her scummy dad looked so pitiful. She clearly hated him a few days ago,\nbut her heart had turned soft the past few days. She was such a kind little cutie."
      },
      {
        "paragraph": "“Uncle, next week… Daddy will take me out to play for a few days. ” In the end, Suzie could not resist\nreminding him."
      },
      {
        "paragraph": "“That’s good. Liam should take you out to play. I’ll give him two days off.” Shaun did not think too much\nabout it."
      },
      {
        "paragraph": "Suzie’s heart ached, and she dropped another hint. “ Daddy’s friend is getting married, so he’s bringing\nme to the wedding. We’re not going to play.”"
      },
      {
        "paragraph": "“Oh, there are lots of sweets to eat at weddings, but you can’t eat too much, ” Shaun said in a low voice."
      },
      {
        "paragraph": "Deep down, Suzie sighed helplessly."
      },
      {
        "paragraph": "Well, those were all the hints she could give."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "If it were too obvious, Mommy and Lucas would definitely be angry, and she could not let Uncle Wesley\ndown as well."
      },
      {
        "paragraph": "‘Scummy dad, it’s on you to detect it early. If you can’t, then that’s it.’"
      },
      {
        "paragraph": "The next few days, Shaun ran back and forth between the Yule family villa and the company."
      },
      {
        "paragraph": "In the blink of an eye, six days had passed. That afternoon, his head felt a little dizzy, probably because\nhe had not had a good rest."
      },
      {
        "paragraph": "When the secretary reminded him that there was an international video conference held at 3:00 p.m., he"
      },
      {
        "paragraph": "lost his temper and said, “Don’t come to me for every little thing. Liam can handle these things. ”"
      },
      {
        "paragraph": "“No, President Hill. The Second Young Master is on leave today and tomorrow, ” the secretary said."
      },
      {
        "paragraph": "Shaun froze and suddenly remembered Suzie saying that Liam was going to attend a wedding. “Alright, I\ngot it.”"
      },
      {
        "paragraph": "The following night, he drove to the entrance of the Yule villa."
      },
      {
        "paragraph": "He waited at the gate until g:oo a.m., but he did not see any vehicles coming out the gate."
      },
      {
        "paragraph": "Never mind Catherine, even Wesley was not around."
      },
      {
        "paragraph": "For some reason, a wave of uneasiness welled up in him, and he could not help but give Hadley a call."
      },
      {
        "paragraph": "“Find out where Catherine went and why she didn’t come back last night.”"
      },
      {
        "paragraph": "Hadley really did not want to do so, but he was Shaun’s subordinate. Hence, he got someone to ask\nHudson Corporation and quickly replied, “Ms. Jones has gone to Perth on a business trip.”"
      },
      {
        "paragraph": "As the boss of a listed company, it was common to travel for business. Shaun’s heart suddenly dropped,\nafraid that she had found a new boyfriend."
      },
      {
        "paragraph": "Even though he knew that she would not have one so soon, he was still afraid."
      },
      {
        "paragraph": "“Find out when she went and which hotel she’s staying in. Also, book me a ticket to Perth.” Shaun\nimmediately said."
      },
      {
        "paragraph": "Hadley’s head began to hurt. “Eldest Young Master, the company is very busy…”"
      },
      {
        "paragraph": "“There’s nothing more important than her. Suzie said that women have to be pestered. In that case, I will\nfollow her wherever she goes. I believe that she’ll understand my sincerity, ” Shaun said in a low voice."
      }
    ]
  },
  {
    "title": "Chapter 948 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Hadley was speechless and secretly thought to himself that little miss Suzie really knew how to mash her\nparents together."
      },
      {
        "paragraph": "If Ms. Jones were to learn about this trick, she might go crazy."
      },
      {
        "paragraph": "“Okay, I’ll check it out.”"
      },
      {
        "paragraph": "Hadley had no choice but to call the people in Perth. However, he learned that there was no record of\nCatherine staying in a hotel."
      },
      {
        "paragraph": "Did Ms. Jones have a private residence there?"
      },
      {
        "paragraph": "He called the airport next and found that there was no flight record of Ms. Jones flying to Perth."
      },
      {
        "paragraph": "Instead, he learned that Ms. Jones and Freya flew to Melbourne yesterday."
      },
      {
        "paragraph": "His head suddenly felt a little numb. Why did Ms. Jones go to Melbourne at this time but claimed that she\nwas in Perth for a business trip? Was it because she was doing something secretly in Melbourne, and\nthe reason was to hide it from the Eldest Young Master?"
      },
      {
        "paragraph": "Thinking about it, it was highly likely."
      },
      {
        "paragraph": "Just as he was thinking, Shaun called. “ Have you booked the ticket?”"
      },
      {
        "paragraph": "“No, I… I didn’t find out where Ms. Jones is staying in Perth. She might have a private residence there. ”\nHadley immediately made a decision. Since Ms. Jones was trying to hide it, he would help her out. “\nEldest Young Master, don’t go. Hudson said that Ms. Jones will only be away for two to three days. She\nmight come back tomorrow.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Then I can come back with her. Forget it, I’ll get Chance to check.”"
      },
      {
        "paragraph": "Shaun immediately called Chance after hanging up. After all, Liona had eyes all over the world."
      },
      {
        "paragraph": "About half an hour later, Chance called bearing news. “Eldest Young Master, the flight information\nshowed that Ms. Jones didn’t go to Perth for a business trip. She went to Melbourne with Freya Lynch.”"
      },
      {
        "paragraph": "“What is she doing in Melbourne? ” Shaun’s eyes dimmed. “Hadley checked and said that she went to\nPerth.”"
      },
      {
        "paragraph": "“ She told the company that she went to Perth, but she didn’t go,” Chase said. “There’s no record of"
      },
      {
        "paragraph": "her staying in a hotel in Melbourne, but her hometown is in Melbourne, so she might be staying at her old\nhome.”"
      },
      {
        "paragraph": "Shaun became more and more suspicious. Why did she have to lie if she was going back to Melbourne\nwith Freya?"
      },
      {
        "paragraph": "Right, Liam took a day off today too."
      },
      {
        "paragraph": "Was it too coincidental? The three people left Canberra at the same time, and it seemed like Joel was\nnot around today either."
      },
      {
        "paragraph": "“Find out where Liam and Joel Yule went.” He suddenly ordered."
      },
      {
        "paragraph": "Soon, Chance found out about Liam’s whereabouts. “Eldest Young Master, Liam and Joel Yule have also\ngone to Melbourne.”"
      },
      {
        "paragraph": "Suzie said that Liam was bringing her to a friend’s wedding. Children told no lies."
      },
      {
        "paragraph": "Liam, Freya, Catherine, and Joel. What friend did they have in common that they would attend the\nwedding together?"
      },
      {
        "paragraph": "It did not make sense."
      },
      {
        "paragraph": "Wait…"
      },
      {
        "paragraph": "He suddenly remembered that when he attended the banquet the other day, he heard that Wesley Lyons\nwas getting married, and the bride was someone local."
      },
      {
        "paragraph": "However, Liam and Joel did not have to attend Wesley’s wedding. They did not know Wesley well."
      },
      {
        "paragraph": "Unless the bride was not a local at all, but…"
      },
      {
        "paragraph": "As that thought flashed, his entire person panicked. “Arrange a private jet for me immediately. I want to\ngo to Melbourne. Now.”"
      },
      {
        "paragraph": "Chance was startled. “But Melbourne is a little far, and you’ll need to apply for a flight route to\nMelbourne…”"
      },
      {
        "paragraph": "“I don’t care. Use the quickest possible way. I don’t care how much money it takes to hire someone. Do it\nnow.” Shaun was going crazy from the anxiousness."
      },
      {
        "paragraph": "He hoped that it was just a wild guess and that it was not true. What if the person Wesley was marrying\nwas really Catherine?"
      }
    ]
  },
  {
    "title": "Chapter 949 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun was completely caught off guard at the thought that Catherine was suddenly going to marry\nsomeone else. At the same time, his heart seemed to be tightly seized by an invisible force, it hurt so\nmuch he wished he was dead."
      },
      {
        "paragraph": "It turned out that his feelings for that woman were deeper than he had imagined."
      },
      {
        "paragraph": "He would rather destroy everyone than let her marry another man."
      },
      {
        "paragraph": "As he made his way to her, he kept calling Catherine, but she was simply uncontactable."
      },
      {
        "paragraph": "On the other side, in Hill Corporation, when Hadley heard that Shaun was urgently mobilizing a private\njet, he hesitated for a long time before uneasily dialing Catherine’s number."
      },
      {
        "paragraph": "“Hadley, what’s wrong?”"
      },
      {
        "paragraph": "Hadley smiled bitterly when Catherine’s voice came through. “Ms. Jones, why did you sneak off to\nMelbourne? He panicked and arranged for a private jet to go over to take care of you.”"
      },
      {
        "paragraph": "“Barn.”"
      },
      {
        "paragraph": "Freya, the bridesmaid beside Catherine, was so shocked that the high heels in her hands fell to the\nground."
      },
      {
        "paragraph": "“Hadley, I’m getting married today.” Catherine said in a low voice."
      },
      {
        "paragraph": "“What?” Hadley leapt from his chair in shock. “You … Who are you getting married to? Why wasn’t there\nany news of this?”"
      },
      {
        "paragraph": "He slapped his face hard, suspecting that it was a nightmare."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Wesley Lyons. ” Catherine’s tone was soft. “ I’ve been entangled with Wesley and Shaun for so many\nyears. After the last incident, I finally understood that Wesley is the best for me. I want to cherish him, but\nI’m afraid of Shaun finding out, so we planned to first have a low-profile wedding. I guess"
      },
      {
        "paragraph": "… Shaun might have noticed something. Even if he hasn’t, he’ll find out when he arrives.”"
      },
      {
        "paragraph": "Hadley. “"
      },
      {
        "paragraph": "He was rendered completely speechless by the explosive news."
      },
      {
        "paragraph": "“Ms. Jones, you’re really… doing something big while keeping mum about it.” He smiled bitterly. “If the\nEldest Young Master finds out, he’ll definitely go mad.”"
      },
      {
        "paragraph": "He might even do something extremely crazy."
      },
      {
        "paragraph": "The thought of having to face such a terrifying Eldest Young Master made him shudder and want to\nresign."
      },
      {
        "paragraph": "“Ms. Jones, I estimate that it’ll take two and a half hours to reach Melbourne at the fastest speed.”\nHadley could only remind her."
      },
      {
        "paragraph": "It was a fact that Catherine and Shaun could no longer get back together, so he could not persuade her.\nBesides, Ms. Jones had really suffered too much these years."
      },
      {
        "paragraph": "“Thank you for telling me, Hadley.” Catherine sincerely thanked him. If it were not for Hadley secretly\nhelping her all these years, she would not be where she was today."
      },
      {
        "paragraph": "“ I won’t tell Eldest Young Master about this, but I think he’ll find out as soon as he arrives in Melbourne.”"
      },
      {
        "paragraph": "Hadley said and hung up the call."
      },
      {
        "paragraph": "In the hotel suite, Freya looked at Catherine anxiously. “What should we do? Two and a half hours. It’ll\nbe ab-out 1z 3o p.m. when Shaun arrives. I f he makes haste, the wedding ceremony may not be over\nyet.”"
      },
      {
        "paragraph": "“Then we’ll hold it in advance. ” Wesley suddenly came in. “I’ll inform the hotel that it’ll be held at 11: 28\na.m.”"
      },
      {
        "paragraph": "Catherine was startled. “But the guests haven’t arrived yet.”"
      },
      {
        "paragraph": "“Our relatives are all staying in this hotel, so we can call and ask them to come earlier. ” Wesley gently\npressed his hands on her shoulder, assuring her, “ I’ll also arrange for some reporters to come over. I\noriginally planned to keep it under the radar, but Shaun might have noticed something, so it’s better to\nmake it public. I don’t believe that he’ll snatch away someone else’s wife without regard to his\nreputation.”"
      },
      {
        "paragraph": "Catherine nodded blankly."
      },
      {
        "paragraph": "Frankly speaking, Shaun was a terrifying person. She did not know if he would do such a thing."
      },
      {
        "paragraph": "Freya was gloomy. “You wanted to wait until you were pregnant to announce it. Where exactly did the\nnews leak?”"
      }
    ]
  }
]