[

  {
    "title": "Chapter 800 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine’s words made Shaun feel at ease all of a sudden."
      },
      {
        "paragraph": "Despite knowing that he had a change of heart, he had still felt swamped by guilt all because of his\npromise from back then. After Sarah returned, she managed to cure his illness, but he could not bring\nhimself to do it with her."
      },
      {
        "paragraph": "Nevertheless, Catherine was right."
      },
      {
        "paragraph": "Shaun and Sarah were merely in a relationship and they had never slept together. Previously, Shaun\nsincerely wished to marry Sarah. If it were not for Lucifer’s appearance, he would have ended up\nmarrying Sarah."
      },
      {
        "paragraph": "He admitted that Sarah was pitiful, but he was not the one who contributed to her heartbreaking past."
      },
      {
        "paragraph": "Catherine then continued, “I’m not an unreasonable person anyway. If there were no one by Sarah’s\nside, it’d be fine with me if you wanted to go and help her since you’re her ex-boyfriend. But someone’s\nwith her now and Sarah’s brother is in Canberra. If you plan to go there, I won’t give you a second\nchance.”"
      },
      {
        "paragraph": "With that, she opened the car door and directly got out while carrying Suzie."
      },
      {
        "paragraph": "“Fine, I’m not going there.”"
      },
      {
        "paragraph": "Upon noticing that she was leaving, Shaun quickly undid his seat belt and went after her. He took Suzie\nfrom her arms with a sparkle in his eyes. “So can you give me another chance tonight?”"
      },
      {
        "paragraph": "Shaun began to push his luck. “After all, you were trying to control me just now.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“When did I control you? I was just telling the truth.” Catherine started to lose her temper. If she had not\nspent a long time lecturing Shaun, he would have gone to look for Sarah. How dare he ask such a\nquestion."
      },
      {
        "paragraph": "“Are you mad? Are you jealous?”"
      },
      {
        "paragraph": "Shaun’s mouth curved into a mischievous smile."
      },
      {
        "paragraph": "Even though she maintained an impassive face, he knew that she was concerned about him deep down."
      },
      {
        "paragraph": "“You’re overthinking it. I just don’t want things to b e like before when you kicked me to the curb and\ndivorced me immediately after we slept together. Shaun, all I want is a sense of security. I don’t want t o\nalways be the one who will be dumped at any moment.”"
      },
      {
        "paragraph": "As soon as Catherine finished speaking, she walked forward without looking back."
      },
      {
        "paragraph": "At the sight of her black hair being blown by the night breeze and her fine curves, Shaun’s heart\nsomehow ached."
      },
      {
        "paragraph": "Shaun went after her and entered the house. Then, h e placed Suzie on the bed in her bedroom."
      },
      {
        "paragraph": "“Tomorrow, I’ll send Suzie to preschool. You don’t have to come and pick her up. ” Catherine tucked\nSuzie in bed."
      },
      {
        "paragraph": "“Oh. ” Shaun’s eyes swept over the house. He raised his brows with a sense of wickedness. “I think I\nmight as well sleep here tonight. I can just sleep on the couch.”"
      },
      {
        "paragraph": "“Are you dreaming?” After rolling her eyes, Catherine pushed him out of the bedroom harshly. “ Freya will\nbe back tonight. It’ll be awkward if you sleep here.”"
      },
      {
        "paragraph": "“In that case, I… I can sleep on the couch in your bedroom.” Shaun threatened her with a low voice, “"
      },
      {
        "paragraph": "Aren’t you afraid that I’ll go to the hospital and look for Sarah if you let me go?”"
      },
      {
        "paragraph": "He did not expect this sentence to offend Catherine."
      },
      {
        "paragraph": "“If you want to look for her, that’s your business. It’s not like I’ve tied your legs together anyway.”"
      },
      {
        "paragraph": "This time, she directly pushed him out of the main door and slammed it."
      },
      {
        "paragraph": "Shaun ruffled his short black hair in annoyance."
      },
      {
        "paragraph": "He blamed himself for offending her with his stupid remark."
      },
      {
        "paragraph": "As soon as he turned around, he saw Freya walking out of the elevator while humming a tune."
      },
      {
        "paragraph": "When their eyes met, Freya was taken aback. “ S- Shaun, why are you here again?”"
      },
      {
        "paragraph": "What did she mean by ‘again’?"
      },
      {
        "paragraph": "Shaun disliked the sight of Freya as she had ruined his opportunity to stay with Catherine."
      },
      {
        "paragraph": "“Isn’t your office in the States? When are you leaving?” Shaun asked nonchalantly."
      },
      {
        "paragraph": "“Leave?” Freya was stunned. “I’m not planning to leave. I’ll be staying in Canberra to work.”"
      },
      {
        "paragraph": "Shaun’s head hurt at the thought of this third wheel who would continue to stay here."
      },
      {
        "paragraph": "He pulled a long face and asked, “Are you going to keep staying with Catherine?”"
      },
      {
        "paragraph": "”Of course. We’re best friends, and we depend on each other…”"
      }
    ]
  },
  {
    "title": "Chapter 801 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun suddenly took out a bunch of keys from his pocket. “These are the keys to a duplex apartment on\nthe top floor of Brighton Gardens. This furnished apartment is › 4o square meters. Move there and it’s\nyours from today onward.”"
      },
      {
        "paragraph": "Freya was dumbfounded."
      },
      {
        "paragraph": "Although she had not returned to Canberra for years, she knew that Brighton Gardens was one of the\nmost expensive apartments in Canberra."
      },
      {
        "paragraph": "Considering that it was situated downtown, every inch of land was worth a fortune."
      },
      {
        "paragraph": "Shaun actually offered her an apartment just like that?"
      },
      {
        "paragraph": "“Do you want it?” Shaun asked her."
      },
      {
        "paragraph": "“Yes!”"
      },
      {
        "paragraph": "Freya took the keys, thinking that it would be a waste to reject the scumbag’s offer. “ I’ll move out\ntomorrow.”"
      },
      {
        "paragraph": "“Mm.”"
      },
      {
        "paragraph": "Shaun nodded with satisfaction. After that, he entered the elevator and left. At last, he had managed to\nkick this third wheel out."
      },
      {
        "paragraph": "After Freya opened the door and stepped into the house, she quickly ran to Catherine. She showed off\nthe keys, saying, “Damn. Just now, Eldest Young Master Hill gave me the duplex apartment on the top"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "floor of Brighton Gardens. He said it’s › 40 square meters.”"
      },
      {
        "paragraph": "Catherine was drinking water and spat it out immediately."
      },
      {
        "paragraph": "In a daze, Catherine fixed her eyes on the bunch of keys. She felt speechless. “You didn’t tell him that\nyou’re going to move out, did you?”"
      },
      {
        "paragraph": "“Of course, I did. I’m not a fool. ” Freya giggled and said, “What’s more, I can give you the apartment\nafterward.”"
      },
      {
        "paragraph": "“It’s fine. I’m wealthy and not desperate for an apartment. ” Catherine found it ridiculous. Shaun probably\nwore a ten-dollar hat on a five -cent head. When they divorced before this, she did not receive an\napartment from him, yet he was willing to spend 1oo million dollars just to kick out Freya, who was the\nthird wheel in his eyes."
      },
      {
        "paragraph": "“Yeah, I know your relationship has improved lately, so I won’t stay here and disturb you guys…\nHehehe.” Freya made a coquettish grimace."
      },
      {
        "paragraph": "“Get out.” Catherine could not be bothered about Freya. She turned around and took a bath."
      },
      {
        "paragraph": "After showering, she got back to her bed and opened WhatsApp. She noticed that someone with the\nname ‘Shauncierely Yours’ had reached out to her."
      },
      {
        "paragraph": "‘Shauncierely Yours’."
      },
      {
        "paragraph": "Catherine felt uneasy and spaced out for a moment. When Shaun and Catherine were madly in love with\neach other previously, he had changed his WhatsApp name to this."
      },
      {
        "paragraph": "Sure enough, he was still the same old him. He still behaved in the same manner."
      },
      {
        "paragraph": "Shortly after, Shaun sent her a WhatsApp message. [ You blocked my last number, so I got a new\nnumber."
      },
      {
        "paragraph": "She did not reply."
      },
      {
        "paragraph": "Then, Shaun sent her a selfie. He was wearing a bathrobe that was tied loosely. Apart from his\nhandsome face, his muscular abs that were covered with glistening water droplets were also in view. He\nexuded a sense of wildness and thuggishness."
      },
      {
        "paragraph": "Although Catherine had seen the man from head to toe before, she could not help but blush at the sight\nof his naked body."
      },
      {
        "paragraph": "What was this flirty man trying to do?"
      },
      {
        "paragraph": "At this moment, she played the voice message she had just received. The man’s gentle masculine voice\nmade her feel as if electricity was passing through her body, causing her to go weak."
      },
      {
        "paragraph": "“Darling, I’m home. I didn’t go anywhere.” Darling?"
      },
      {
        "paragraph": "What nonsense! Catherine’s face flushed."
      },
      {
        "paragraph": "This man was shameless indeed."
      },
      {
        "paragraph": "Nevertheless, Sarah must be mad that Shaun did not go see her tonight."
      },
      {
        "paragraph": "After some thought, Catherine sent him a kiss emoji."
      },
      {
        "paragraph": "After sending the emoji, her face turned crimson again."
      },
      {
        "paragraph": "She felt embarrassed. She just wanted to seduce the man and piss Sarah off on purpose."
      }
    ]
  },
  {
    "title": "Chapter 802 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Zion Residence."
      },
      {
        "paragraph": "Once Shaun saw the kiss emoji, he felt a surge of excitement inside him. His Adam’s apple bobbed,\ncausing him discomfort for some inexplicable reason."
      },
      {
        "paragraph": "He lay down, imagining Catherine kissing him."
      },
      {
        "paragraph": "At that moment, he suddenly sat up on the bed and messaged Catherine four words: [I want it tomorrow.]\nThen, he ran to the bathroom to take a cold shower."
      },
      {
        "paragraph": "He had never been aroused by Sarah despite being with her for a long time. Never in his wildest dreams\ndid he think that a simple emoji from Catherine would make him burn with excitement. He gave a bitter\nlaugh."
      },
      {
        "paragraph": "When he came out of the bathroom, his phone rang again."
      },
      {
        "paragraph": "Yael called him. “Eldest Young Master Hill, aren’t you coming? Miss Neeson is crying in the hospital. She\nrefuses to get bandaged.”"
      },
      {
        "paragraph": "Shaun was somehow annoyed. “ It’s her body, not mine! ”"
      },
      {
        "paragraph": "Yael panicked when he screamed at her. “But Miss Neeson really needs you now, Eldest Young Master\nHill. These days when you haven’t been around, she hasn’t been able to eat or sleep well. Because of\nthat, she was absent-minded and fell from the stairs during the blackout tonight. The doctor said that her\nlegs are injured. If she doesn’t get them treated right away, she might be disabled in the future.”"
      },
      {
        "paragraph": "Yael’s words felt like a huge weight on Shaun’s mind."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "For the first time, he did not feel a twinge of guilt. Instead, he felt exhausted."
      },
      {
        "paragraph": "As Catherine had said, he had merely been in a relationship with Sarah."
      },
      {
        "paragraph": "Why did it feel as if he had to take responsibility for her entire life?"
      },
      {
        "paragraph": "“Okay, I’ll come over, ” he whispered after some time."
      },
      {
        "paragraph": "In the hospital, Yael immediately told Sarah about it. Sarah was excited. She knew that Shaun would\ncome eventually."
      },
      {
        "paragraph": "Sarah was upset and mad at him when he did not come after Yael called him the first time. However, she\nwas glad that Yael managed to call him over at last."
      },
      {
        "paragraph": "The moment he appeared, there would be reporters taking photos of them. Then, everyone in Australia\nwould know that something had happened to her and Shaun was the first one who anxiously rushed t o\nthe hospital to see her."
      },
      {
        "paragraph": "Ha! She could already imagine Catherine’s indignant expression tomorrow."
      },
      {
        "paragraph": "Catherine was trying to snatch her man. Nevertheless, once Sarah gave an order, Shaun would dump\nCatherine mercilessly."
      },
      {
        "paragraph": "20 minutes later."
      },
      {
        "paragraph": "When Sarah saw Shaun in the hospital, she quickly lay on the bed and feigned a tearful, disappointed\nlook."
      },
      {
        "paragraph": "In order to win Shaun’s sympathy, Sarah had ruthlessly fallen from the stairs today. Her forehead, legs,\nand arms were injured. She looked extremely pitiful."
      },
      {
        "paragraph": "“Shaunic, you’re finally here. I thought I’d never get to see you again.”"
      },
      {
        "paragraph": "The second Sarah saw him, she started to weep bitterly. She stretched out her hands and fell into his\narms."
      },
      {
        "paragraph": "Shaun could not help but hold her, or she would fall from the bed."
      }
    ]
  },
  {
    "title": "Chapter 803 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Shaunic, I miss you so badly.” Sarah nestled in Shaun’s arms, her tears wetting his shirt. “I’ve been\nreflecting on myself these days. I was too silly and foolish. I swear that I won’t wrong you anymore.\nCome back to me. I really miss you.”"
      },
      {
        "paragraph": "Shaun narrowed his eyes and carried her to the bed. After that, he turned around and said to the doctor\noutside, “Come in and treat her.”"
      },
      {
        "paragraph": "“No. If you don’t promise me, I won’t get treated. ” Sarah struggled in agitation."
      },
      {
        "paragraph": "At the sight of her expression, Shaun’s eyes flashed with annoyance. His handsome face slowly\nrevealed a sense of sternness. “Enough. Stop using your body to threaten me.”"
      },
      {
        "paragraph": "He had no idea why Sarah had become so impudent and unreasonable. She was even threatening him\nnow, which was the tactic he hated most."
      },
      {
        "paragraph": "It was his first time using such a grim tone to speak to Sarah. After being dazed for a moment, she\nbegan to weep more. “I hate to behave like this too. I hate what kind of a person I am now, but what can I\ndo? Do I just allow myself to lose you? I can’t bring myself to do it.”"
      },
      {
        "paragraph": "“Sarah, why can’t we just separate without holding grudges?”"
      },
      {
        "paragraph": "Shaun was not touched at all. Instead, he felt a wave of tiredness sweeping over him. “Your legs belong t\no you. Even if you’re crippled in the future, I won’t take responsibility for it because I wasn’t the one who\npushed you down the stairs.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Sarah looked at his handsome face incredulously. H e had always been gentle and tolerant. Based on\nthe remark he made tonight, she had a totally different impression of him."
      },
      {
        "paragraph": "“Eldest Young Master Hill, you can’t provoke Miss Neeson anymore. ” Yael became anxious. “Have you\nforgotten that Miss Neeson was the one who cured your illness? If it hadn’t been for Miss Neeson being\nin the same mental hospital as you, you wouldn’t have been bold enough to get back up on your feet.”"
      },
      {
        "paragraph": "“That was why I decided to marry her, yet she was the one who did those things, ” Shaun said grumpily,\n“Now, I’ve become the laughing stock among everyone in Canberra. When someone exposed me as a\ncuckold during our wedding, I endured it and forgave you. But why won’t you let me go? If it hadn’t been\nfor Lucifer’s death, you would’ve carried on doing those bad deeds with him. Sarah, don’t treat me as a\nfool.”"
      },
      {
        "paragraph": "At that instant, Sarah’s face turned ghastly. “I wouldn’t, Shaunic. Don’t think of me so negatively.”"
      },
      {
        "paragraph": "She suddenly threw the blanket on the floor like a madwoman and wept bitterly. “Why are you"
      },
      {
        "paragraph": "making me out to be this way? Being forced upon b y a disgusting man again and again was miserable\nfor me too.”"
      },
      {
        "paragraph": "“Miss Neeson, don’t move around. Your legs are injured.”"
      },
      {
        "paragraph": "Yael urged Shaun restlessly, “Eldest Young Master Hill, soften your tone and advise her. If she continues\nto behave like this, her legs might really be crippled.”"
      },
      {
        "paragraph": "Looking at Sarah’s hysterical expression, he felt so weak that his head began to hurt."
      },
      {
        "paragraph": "He turned around and said to the hospital staff, “ Just press her down and tie her up to bandage her\ninjuries first.”"
      },
      {
        "paragraph": "The hospital staff looked at each other for a while. Then, they followed his instructions and pressed\nSarah on the bed."
      },
      {
        "paragraph": "Sarah, who had only pretended to lose control, never expected Shaun to be so cruel. She thought that\nhe would calm her. Now that he was asking the staff to tie her up, she was so furious that she kept\nkicking. She even injured a hospital staff member with her kick."
      },
      {
        "paragraph": "Shaun went to her and held one of her legs so that the doctor could apply medicine to her injuries."
      },
      {
        "paragraph": "However, once the doctor was done applying the medicine, Sarah took off the bandage. She said amid\nher sobs, “No. Without you, I’d rather be crippled. ”"
      },
      {
        "paragraph": "After being provoked over and over again, Shaun flew into a rage. “Go ahead and be a cripple, then. I\ndon’t f*cking need to take responsibility for your life.”"
      },
      {
        "paragraph": "“Shaun, is this what a human would say?”"
      },
      {
        "paragraph": "Rodney, who had rushed over, happened to hear Shaun’s words and lost his temper right away."
      },
      {
        "paragraph": "“She’s your woman! She’s your fiancée! You have to take responsibility for her.” Rodney pulled Shaun\naside. Feeling devastated, he pointed at Sarah on the bed who was badly injured. “Have you forgotten\nthat you promised to take care of her? And this is how you hurt her.”"
      },
      {
        "paragraph": "“How did I hurt her?”"
      },
      {
        "paragraph": "Shaun’s impatience had reached its limits. “Rodney Snow, you’re not me. You know nothing.”"
      },
      {
        "paragraph": "“All I know is that if you don’t marry Sarah, her reputation will be ruined forever,” Rodney responded\nangrily, “She loves you. Do you think she did all those things on purpose? She’s a victim. What’s more,\nyou’re still involved with Catherine, but did she criticize you? What gives you the right to criticize her?”"
      }
    ]
  },
  {
    "title": "Chapter 804 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Are you done?”"
      },
      {
        "paragraph": "Shaun lost his temper. “That’s her reputation. I have no responsibility for it.”"
      },
      {
        "paragraph": "“You’ve been with her for over ten years. If not you, then who’s supposed to take responsibility for it?”\nRodney asked furiously."
      },
      {
        "paragraph": "For the first time in his life, Shaun felt that his relationship with Sarah made him feel completely drained."
      },
      {
        "paragraph": "He just did not want to marry Sarah. What was so difficult about it?"
      },
      {
        "paragraph": "Was he the one who had gotten a man to force himself upon Sarah in the States? Was he the one who\nmade Sarah and Lucifer sleep together?"
      },
      {
        "paragraph": "No."
      },
      {
        "paragraph": "“Rodney, if you like her so much, go ahead and marry her. Don’t come to me all the time just to force\nme.”"
      },
      {
        "paragraph": "Shaun strode toward the door as he felt like smoking."
      },
      {
        "paragraph": "After glancing at Sarah’s pale expression, Rodney could not help but follow Shaun out."
      },
      {
        "paragraph": "He gripped Shaun’s arm and whispered, “Do you think that I don’t want to marry her? The thing is, she’s\nonly in love with you. You’re the one she wants to be with. Shaun, you can’t pass her to someone else\njust because you don’t want to be with her. She’s a human, and she loves you with all her heart.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“… I don’t love her anymore.” Shaun suddenly lifted his head. With dark currents surging in his deep -set\neyes, he looked like a lion who had been provoked."
      },
      {
        "paragraph": "“What did you say?” Rodney was dazed."
      },
      {
        "paragraph": "“You can treat me as a scumbag. Anyway, it’s impossible for me to marry her again, ” Shaun said\nresolutely."
      },
      {
        "paragraph": "“What a b*stard you are!” Rodney was so infuriated that he punched Shaun in the face. “It must be\nCatherine who seduced you again, right? I’m going t o kill her.”"
      },
      {
        "paragraph": "He turned around and was about to leave. However, Shaun blocked his way and warned him\nimpassively, “You’re not allowed to look for Catherine. It has nothing to do with her. Even without her, I\nstill won’t marry Sarah.”"
      },
      {
        "paragraph": "“Don’t think about deceiving me. Everything was fine before Catherine returned. I’ll make sure she’ll pay\nfor Sarah’s suffering.” Rodney could not be bothered about Shaun."
      },
      {
        "paragraph": "The two men pushed and shoved each other in the corridor."
      },
      {
        "paragraph": "At last, Rodney punched him as he could no longer tolerate him."
      },
      {
        "paragraph": "Shaun’s anger had reached its peak as well. The two of them began to fight in the corridor."
      },
      {
        "paragraph": "“Stop fighting! ” Chester, who rushed here after hearing the news, hurriedly separated them. “Both of you\nare distinguished people. Don’t you find it shameful to be watched as though you guys are animals?”"
      },
      {
        "paragraph": "The two of them were shocked. Only then did they realize that there were many onlookers around them."
      },
      {
        "paragraph": "Fortunately, this floor was for VIP patients, so there were not many people. Most of them were doctors."
      },
      {
        "paragraph": "“Carry on with your work. If any of you dare to spread about tonight’s incident, you’ll be fired"
      },
      {
        "paragraph": "straight away,” Chester warned them before he dispersed the crowd."
      },
      {
        "paragraph": "Rodney, whose face was injured, made a cruel remark to Shaun. “If you dare dump Sarah, we won’t be\nbuddies anymore.”"
      },
      {
        "paragraph": "“Suit yourself.” Shaun maintained an impassive face, which made Rodney almost go mad again."
      },
      {
        "paragraph": "“Enough, Rodney. This is Shaun and Sarah’s affair. Why do you keep meddling in it?” Chester warned\nhim helplessly, “What’s more, Sarah is in the ward. Knowing that the two of you are fighting for her, she\nmust be heartbroken.”"
      },
      {
        "paragraph": "At the thought of Sarah, Rodney was immediately at a loss for words."
      },
      {
        "paragraph": "Similarly, Shaun remained silent while standing at one side."
      },
      {
        "paragraph": "In the ward, Sarah gnashed her teeth as she heard the two of them fighting."
      },
      {
        "paragraph": "Never had she thought that Shaun would heartlessly say that he would not marry her."
      },
      {
        "paragraph": "‘Shaunic, how cruel of you!’"
      },
      {
        "paragraph": "She loved him so much, yet she demeaned herself again and again because of him."
      },
      {
        "paragraph": "In the morning."
      },
      {
        "paragraph": "Hackett Institute."
      }
    ]
  },
  {
    "title": "Chapter 805 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "When Catherine was preparing breakfast for Suzie and Freya in the kitchen, Freya shouted from outside\nall of a sudden."
      },
      {
        "paragraph": "Then, Freya walked into the kitchen with her phone. “Cathy, I’m going to show you something. Don’t be\nmad.”"
      },
      {
        "paragraph": "Catherine grabbed the phone and looked at it. Today’s news headline was ‘Sarah Injured, Young Master\nHill Immediately Rushed To The Hospital. Their Break—up Rumors Quashed.’"
      },
      {
        "paragraph": "When she clicked open the video, the reporter gave a detailed explanation of the news."
      },
      {
        "paragraph": "“Young Master Hill and Sarah’s wedding was canceled all of a sudden previously, and there was n o\nnews about it later. Rumors about their break-up had been spreading like wildfire. However, our reporter,\nwho kept watch at the hospital last night, happened to learn that Sarah was admitted to the hospital.\nShortly after, Young Master Hill rushed to the hospital with a somber look, probably because h e was\nworried about Sarah’s condition. It wasn’t until seven o’clock in the morning that our reporter saw Young\nMaster Hill leaving the hospital wearily"
      },
      {
        "paragraph": "Catherine turned off the news straight away. Then, she returned the phone to Freya. Her pretty face was\ncalm and nonchalant as if it had nothing to do with her."
      },
      {
        "paragraph": "“Are you okay?”"
      },
      {
        "paragraph": "Freya looked at Catherine uneasily."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "To be honest, Freya never thought that Shaun would be so scummy. Last night, Shaun had even offered\nher an apartment to make her move out, so she thought he was insistent on pursuing Catherine.\nNevertheless, he still ended up going to look for Sarah. Even an outsider like her felt indignant over it."
      },
      {
        "paragraph": "“Of course, I am. But I’ve underestimated this shameless person.”"
      },
      {
        "paragraph": "Catherine scoffed deep down. Last night, Shaun had even sent her a selfie that he took at home and she\nactually bought it."
      },
      {
        "paragraph": "‘Shauncierely Yours’? Go to hell!"
      },
      {
        "paragraph": "Well, it was a slap in the face for her. It got her to become calmer and more alert."
      },
      {
        "paragraph": "“Let’s have breakfast. After that, I’ll send Suzie to preschool.”"
      },
      {
        "paragraph": "Catherine brought breakfast to the table."
      },
      {
        "paragraph": "After breakfast, she drove Suzie to preschool."
      },
      {
        "paragraph": "When she dropped Suzie off, she came across Sheldon who was dropping Lucas off at the gate."
      },
      {
        "paragraph": "“Thanks again, Uncle Sheldon.” Catherine was grateful to him. In order to prevent Lucas from being\nsuspected, Joel got Sheldon to pretend to be Lucas’ father. Fortunately, Sheldon looked like Joel, so no\none suspected him."
      },
      {
        "paragraph": "“You’re most welcome. It’s because of your dad that I managed to come back to Yule Corporation and\nbecome the manager, ” Sheldon responded with a smile."
      },
      {
        "paragraph": "Catherine grinned. She bent over to kiss Lucas on the forehead. “Lucas, do you miss me?”"
      },
      {
        "paragraph": "“I’m not Suzie. ” An arrogant look crossed Lucas’ face. Even so, he began to walk toward Catherine’s\narms to get some affection."
      },
      {
        "paragraph": "“ I’ll accompany you to have dinner at Grandpa’s place tonight,” Catherine said softly."
      },
      {
        "paragraph": "“Mommy, I want to come along,” Suzie shouted."
      },
      {
        "paragraph": "“No way. Now that you’re a member of the Hills, people will suspect you if you always stay with me, ”\nCatherine warned her."
      },
      {
        "paragraph": "After sending Suzie and Lucas off, she received a WhatsApp message from ‘Shauncierely Yours’. [\nDarling, have you sent Suzie to preschool?]"
      },
      {
        "paragraph": "Catherine lowered her head and glanced at it. After that, she blocked him again."
      },
      {
        "paragraph": "Shaun drove to the office after sending the message. On his way there, he checked his WhatsApp from\ntime to time."
      },
      {
        "paragraph": "He did not receive a reply from Catherine even after he arrived at the office."
      },
      {
        "paragraph": "Irritated, he sent her another message. [What are you busy with? Why aren’t you replying to my\nmessage?]"
      },
      {
        "paragraph": "Nevertheless, his messages only showed one tick. A t that moment, he realized that he could not see her\nprofile photo anymore."
      },
      {
        "paragraph": "Shaun was speechless."
      },
      {
        "paragraph": "What did this mean? Last night, he was still able to see her profile photo and his messages showed two\nticks. Could she have blocked him again?"
      },
      {
        "paragraph": "Somehow, he experienced a burning sensation in his chest, which also carried a hint of gloom,\ngrievance, and annoyance. At this very moment, Hadley came in. “President Hill, please sign this\ndocument as soon as possible.”"
      }
    ]
  },
  {
    "title": "Chapter 806 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun stared at Hadley grimly. Hadley was speechless."
      },
      {
        "paragraph": "What had he done wrong? All he was asking for was a signature. Indeed, being Eldest Young Master\nHill’s assistant was getting tougher."
      },
      {
        "paragraph": "“Pass me the document.”"
      },
      {
        "paragraph": "Shaun slowly opened his mouth while giving him a death stare."
      },
      {
        "paragraph": "Hadley handed it to him. It was only after Shaun signed it that Hadley said, “By the way, there’s one more\nthing, Eldest Young Master Hill. You’ve made the news for visiting Sarah in the hospital last night.”"
      },
      {
        "paragraph": "Hadley clicked open the news and showed it to Shaun. “Now that you’re pursuing Ms. Jones, I think if\nshe sees this piece of news, she might feel… some disappointment.”"
      },
      {
        "paragraph": "“Why didn’t you tell me earlier?”"
      },
      {
        "paragraph": "After Shaun watched the video, his face turned grim"
      },
      {
        "paragraph": "straight away. “Which reporter is it?”"
      },
      {
        "paragraph": "“It’s the reporter from Sun Weekly. The news organization always reports trivial matters that happen in\nsociety. There are always reporters keeping watch in the hospital.”"
      },
      {
        "paragraph": "Shaun gritted his teeth. “I’m giving you half the day to make this news organization disappear. At the\nsame time, get all the news about last night’s incident deleted. Also, warn other news organizations that\nthey’re going to suffer the same consequence if they dare report on me.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Alright.”"
      },
      {
        "paragraph": "Hadley also felt that Sun Weekly was asking for death."
      },
      {
        "paragraph": "After he left, Shaun immediately drove to Hudson Corporation, only to find that Catherine had not arrived\nyet."
      },
      {
        "paragraph": "Harvey was annoyed at how Shaun was playing the field. However, due to Shaun’s identity, he had no\nchoice but to pour a cup of hot coffee for him. “ Chair woman Jones doesn’t come to the office every day.\nShe follows her personal schedule sometimes.”"
      },
      {
        "paragraph": "“Give her a call and ask her to come here,” Shaun said in a strident tone."
      },
      {
        "paragraph": "Harvey then called Catherine in front of him. “ Chairwoman Jones, President Hill is in Hudson and says\nthat he wants to meet you.”"
      },
      {
        "paragraph": "“ I’m too busy to entertain him. Ask him to go to hell.” Catherine hung up the call as soon as she finished\nher sentence."
      },
      {
        "paragraph": "Shaun’s face darkened in an instant. Harvey dared not to breathe too loudly."
      },
      {
        "paragraph": "Luckily, Shaun left shortly afterward."
      },
      {
        "paragraph": "In the afternoon, Shaun went to the hospital again when Rodney was not around."
      },
      {
        "paragraph": "“Shaunic, you’re here.” The moment Sarah saw him, her eyes glowed."
      },
      {
        "paragraph": "When the news was released this morning, those rich young ladies in Canberra who had shunned Sarah\nbefore immediately called her to send their greetings. Quite a number of them came to visit Sarah in the\nmorning, and there were different kinds of health supplements on the table."
      },
      {
        "paragraph": "At that moment, Sarah was extremely complacent. A s such, she could not bring herself to let Shaun go."
      },
      {
        "paragraph": "“Are you feeling much better?” Shaun asked in a low voice."
      },
      {
        "paragraph": "“My legs still hurt. The doctor said my tendons are injured.” Sarah looked at the wound on the corner o f\nhis mouth. “ I’m sorry, Shaunic. Because of me, you got into a fight with Rodney. Do your injuries hurt?\nLet me apply some medicine for you.”"
      },
      {
        "paragraph": "“No need.”"
      },
      {
        "paragraph": "Shaun took out a document. “Sarah, I came here today to make something clear to you. I…”"
      }
    ]
  },
  {
    "title": "Chapter 807 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“ Shaunic, I’m not feeling well. Let’s talk about it sometime later.” Once Sarah caught sight of the title\ndeed in the folder, she had a sinking feeling deep down. She quickly feigned feeling unwell and lay down."
      },
      {
        "paragraph": "“ Sarah, stop running away from it.” Shaun did not feel like dragging the matter on anymore, so he acted\nruthlessly. “This is the title deed to the seaside villa. Also, I’ll compensate you with one duplex apartment\nand ten commercial properties."
      },
      {
        "paragraph": "Here’s a card with 1oo billion dollars inside, which is enough for you to live a luxurious life.”"
      },
      {
        "paragraph": "“Stop it. I won’t break up with you. ” Sarah spilled the glass of hot water beside her in agitation and\nconsequently burned her hand."
      },
      {
        "paragraph": "“Miss Neeson…” Yael was so shocked that she immediately pressed the bell to call the doctor over."
      },
      {
        "paragraph": "“My hand hurts. It hurts so badly.” Sarah began to cry in pain."
      },
      {
        "paragraph": "Yael advised Shaun, “Eldest Young Master Hill, Miss Neeson hasn’t recovered yet. Why must you"
      },
      {
        "paragraph": "provoke her at this time?”"
      },
      {
        "paragraph": "If this had happened back then, Shaun would have tolerated it."
      },
      {
        "paragraph": "However, Sarah had refused to accept the fact and kept kicking up a fuss since last night. Moreover,\nShaun had spent the night keeping her company yesterday and did not get to sleep. With all kinds of\nemotions overwhelming him, he barely had any patience left."
      },
      {
        "paragraph": "“Sarah, don’t go too far. We can never get back together.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun put down the document before he turned around and left."
      },
      {
        "paragraph": "Whenever he saw Sarah making a scene now, he somehow had a strong urge to run away. It also\nconfirmed his intentions to end his relationship with Sarah."
      },
      {
        "paragraph": "While sobbing, Sarah smashed a lot of things."
      },
      {
        "paragraph": "When Rodney arrived, he was heartbroken to see her swollen hands."
      },
      {
        "paragraph": "“Rodney, Shaunic has decided to abandon me. He gave me these things to get rid of me.” Sarah fell into\nhis arms and burst into tears. “What am I to him? I’m the person who cares about him the most."
      },
      {
        "paragraph": "I’m not even concerned about his identity or wealth.”"
      },
      {
        "paragraph": "“He has gone too far.”"
      },
      {
        "paragraph": "Looking at those documents, Rodney felt that Shaun deserved to die. How could he treat Sarah the way\nChester played around with those women out there?"
      },
      {
        "paragraph": "“Sarah, stop crying. I’ll deal with him on your behalf.” Rodney clenched his fists. “If Shaun abandons you,\nI’ll marry you. I won’t let you become a laughing stock. I come from the Snow family. Although I’m not as\ninfluential as Shaun, m y family has quite a high status too.”"
      },
      {
        "paragraph": "“Rodney…” Sarah was dazed for a moment. Then, she shook her head incredulously. “No way. How\ncould I possibly hurt you like this? What’s more, your family won’t approve of it.”"
      },
      {
        "paragraph": "“As long as I approve it, my family can’t do anything.” Rodney wiped her tears away. “ Sarah, I’ll always\nstay by your side. If you want Shaun, I’ll do anything I can to make him yours again. If you choose to give\nup on him, I’ll marry you.”"
      },
      {
        "paragraph": "“Thank you, Rodney.” Sarah nestled in his arms and wept bitterly."
      },
      {
        "paragraph": "Sarah smiled a little without Rodney’s realization."
      },
      {
        "paragraph": "She felt fortunate to have Rodney as her backup. Rodney might not be as great as Shaun, but once his\nuncle was elected as the next prime minister, the Snows would be at the height of their power."
      },
      {
        "paragraph": "At this very moment, Rodney’s assistant ran in. “Oh no, President Snow!”"
      },
      {
        "paragraph": "“What’s the fuss?” Rodney glowered at him in annoyance."
      },
      {
        "paragraph": "“Look, President Snow.” With a long face, his assistant took the phone and showed him. “Old Master\nSnow was interviewed at the entrance of Snow Corporation just now.”"
      },
      {
        "paragraph": "Rodney clicked open the video and watched Old Master Snow say, “About 20 years ago, I decided to\ndivide the Snow family’s property among my children. Fortunately, these children have not disappointed\nme over the years. Now that Jason is in charge of Snow Corporation, I’m at ease. I still own 3o% of the\ncompany’s shares, which will be passed to Jessica and Carson in the future.”"
      },
      {
        "paragraph": "The reporter asked curiously, “But don’t you have a grandson called Rodney?”"
      },
      {
        "paragraph": "Old Master Snow replied with a snort, “Rodney has let me down. The Snow Corporation’s shares will\nhave nothing to do with him. If he’s planning on inheriting the Snow family’s assets, he can dream on.”"
      },
      {
        "paragraph": "Rodney’s phone dropped to the floor."
      },
      {
        "paragraph": "His handsome face changed. Then, he rose to his feet all of a sudden. “Sarah, I need to go home now a\ns something has come up.”"
      }
    ]
  },
  {
    "title": "Chapter 808 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Sarah’s mind was in a mess too."
      },
      {
        "paragraph": "She did not have the mood to persuade Rodney to stay at all."
      },
      {
        "paragraph": "Just a moment ago, she thought she would get married to Rodney if she could not get Shaun back."
      },
      {
        "paragraph": "After all, he was the successor of Snow Corporation and the nephew of the future president."
      },
      {
        "paragraph": "It was not less honorable than marrying Shaun."
      },
      {
        "paragraph": "However, in just an instant, Rodney was disqualified by the Snow family from inheriting Snow\nCorporation’s shares. Without the support of the Snow family, Rodney, who only had Osher Corporation,\nwas nothing. She would have a worse marriage than Cindy."
      },
      {
        "paragraph": "Sarah was about to go insane. Why was she so unlucky?"
      },
      {
        "paragraph": "Rodney rushed back home immediately."
      },
      {
        "paragraph": "In the gazebo, Old Master Snow and Jessica were talking about the company’s matters."
      },
      {
        "paragraph": "“Jessica, if only you were a boy. You’re much more capable than Rodney.” Whenever Old Master Snow\nlistened to his granddaughter talk about work, he would get emotional."
      },
      {
        "paragraph": "“Grandpa, you sound as if you’re discriminating against us women,” Jessica said jokingly."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Just as Old Master Snow was about to speak up, Rodney lifted the curtains and barged in. “Grandpa,\ndon’t I have the right of succession to Snow Corporation too? Why did you disqualify me?”"
      },
      {
        "paragraph": "“Because you’re too stupid.” It was as if Old Master Snow had expected his appearance, and he touched\nhis coffee coaster lightly."
      },
      {
        "paragraph": "He was too stupid?"
      },
      {
        "paragraph": "Rodney’s blood boiled in anger. “How am I stupid? Ever since I was born, I have been the quickest\nlearner out of everyone in the Snow family at whatever I learn. The year I had my final exam, my results\nwere placed third out of the whole country. I even studied at the top university in the whole world. You\neven said I am smarter than my uncle.”"
      },
      {
        "paragraph": "Old Master Snow laughed coldly. “That’s why I said you’re stupid. You still haven’t realized the reason\nwhy I’m scolding you. Indeed, you were clever when you were young, but you got dumber as you grew\nup. I don’t feel at ease handing over Snow Corporation’s shares to you. Unless… you get married\naccording to my arrangement.”"
      },
      {
        "paragraph": "Only then did Rodney realize. “To put it bluntly, this is just your tactic of forcing me to get married.”"
      },
      {
        "paragraph": "“No, this isn’t a tactic. It’s your one and only chance.” Old Master Snow took a sip of coffee as he said\ncalmly."
      },
      {
        "paragraph": "“I won’t follow your arrangements and marry a woman that I don’t love.” Rodney thought for a moment\nand suddenly said, “But I can marry a wife and let you have a great-grandchild soon.”"
      },
      {
        "paragraph": "“You don’t mean that you’re marrying Sarah, right?” Jessica said. Her refined eyebrows were knit in a\nfrown."
      },
      {
        "paragraph": "“Yes. Sarah is a good lady…”"
      },
      {
        "paragraph": "Old Master Snow threw his cup to the floor before Rodney could finish speaking. “ If you dare marry\nSarah, don’t ever come back to the Snow family. ”"
      },
      {
        "paragraph": "“Grandpa.” Rodney was shocked and enraged. “Did you listen to the rumors? Weren’t you the one who\nsaid that we should believe in what we see and not"
      },
      {
        "paragraph": "what we hear? Sarah has never treated me as a substitute.”"
      },
      {
        "paragraph": "Jessica sneered. “If she doesn’t take you as a substitute, why will she want to get married to you after\nShaun rejected her?”"
      },
      {
        "paragraph": "She could not understand why she had such a stupid brother."
      },
      {
        "paragraph": "“I was the one who proposed to her…”"
      },
      {
        "paragraph": "“Shut up and get lost.” Old Master Snow was afraid that his anger would put his health at risk if he looked\nat Rodney some more. “Don’t talk to me."
      },
      {
        "paragraph": "I’ve made up my mind.”"
      },
      {
        "paragraph": "After that, Old Master Snow walked away."
      }
    ]
  },
  {
    "title": "Chapter 809 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Jessica glanced at Rodney helplessly. “Grandpa is serious. You should think this through. Is it worth it for\na woman? How far can you go without the Snow family’s support?”"
      },
      {
        "paragraph": "“I’ve thought it through. Unlike you, I won’t marry someone that I don’t love, ” Rodney said furiously."
      },
      {
        "paragraph": "Jessica’s expression changed, and a trace of sadness flashed across her eyes. Then, she walked out of\nthe gazebo and left too."
      },
      {
        "paragraph": "Rodney stood there for a while before he walked out of the Snow family’s house annoyedly."
      },
      {
        "paragraph": "When he got in the car, he received a call from General Manager Stevens. “President Snow, our\ncompany’s acquisition of Country F’s SKITTL Group has failed.”"
      },
      {
        "paragraph": "“What happened? Haven’t you took two full years t o prepare for SKITTL Group’s acquisition?” Rodney\nfelt an inexplicable anger wash over him again."
      },
      {
        "paragraph": "Initially, he wanted to take the opportunity of acquiring SKITTL Group to let Osher Corporation step into\nthe shampoo industry and even expand it globally. That way, he did not need to pay SE Group any mind\nat all."
      },
      {
        "paragraph": "If a company wanted to grow bigger, it had to expand its range of products. He thought that the\nacquisition would surely be successful."
      },
      {
        "paragraph": "General Manager Stevens laughed bitterly.“ President Snow, SKITTL Group initially wanted us t o be the\nacquiring company. But after news got out that the Snow family has canceled your right of succession,\nSKITTL Group made some considerations. They were afraid that Osher Corporation’s future"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "developments might not be good without the support of Snow Corporation, so they went for a large\ncompany in the US.”"
      },
      {
        "paragraph": "“Bullsh*t, did I come this far by relying on Snow Corporation? I relied on myself. ” Luck was not on\nRodney’s side today."
      },
      {
        "paragraph": "“President Snow, the most important thing now is t o stabilize the position of Osher Corporation’s\nskincare brand in Australia. There are rumors that Freya and SE Group’s general manager is planning to\ncollaborate. Once they develop a new product, Osher Corporation’s position will plummet. We might\neven be eliminated.”"
      },
      {
        "paragraph": "General Manager Stevens continued, “The products are upgraded and replaced too quicHy these days.\nWe need an excellent, top cosmetic chemist. Since you have lost the support of the Snow family, you’ll\nbecome a laughing stock among the wealthy families in Australia once Osher Corporation starts going\ndown.”"
      },
      {
        "paragraph": "Rodney gripped his phone tightly. The veins on the back of his hand were throbbing."
      },
      {
        "paragraph": "He had never imagined that he, the favored one in the Snow family, would be in such a situation one day."
      },
      {
        "paragraph": "Osher Corporation was his blood, sweat, and tears. If he lost Osher Corporation, he would be left with\nnothing at all."
      },
      {
        "paragraph": "“President Snow, no matter what, you have to beg Freya to come back to the company,” General\nManager Stevens said bitterly. “We’ve thought of every possible way. But that year, it was you…”"
      },
      {
        "paragraph": "“Shut up. Enough, I got it.” Rodney almost smashed his phone."
      },
      {
        "paragraph": "He never thought that there would come a day"
      },
      {
        "paragraph": "where he had to beg Freya."
      },
      {
        "paragraph": "Above all, that woman even ruined his reputation just a few days ago, but he could not tear her apart yet.\nF*ck."
      },
      {
        "paragraph": "At night, Catherine had a meal with Joel and Lucas a t the Yule family’s manor."
      },
      {
        "paragraph": "When Joel and Lucas learned that Catherine would be staying overnight, they were thrilled."
      },
      {
        "paragraph": "The huge villa felt too empty with only the two of them and a few servants."
      },
      {
        "paragraph": "At 8:00 p.m., just as Catherine was about to fill up the bathtub for Lucas’s bath, Hackett Institute’s\nmanagement gave her a call all of a sudden."
      },
      {
        "paragraph": "“Ms. Jones, according to your neighbor, a man has been waiting for you at your door since this evening\nand hasn’t left yet. It looks like it’s your… ex- boyfriend.”"
      },
      {
        "paragraph": "“Ex-boyfriend?” The corners of Catherine’s mouth twitched. Her neighbor had seen Shaun going in and\nout of her door a few times before. However, he had not shown up for a while now. Her neighbor must\nhave mistaken Shaun as her ex-boyfriend, who had broken up with her."
      },
      {
        "paragraph": "“Yes, ” the management said, “of course. I’m just informing you. It’s your choice whether to come back or\nnot. If there’s any dispute or disturbance, you can choose to report this to the police. ” After hanging up,\nCatherine immediately called the police. ”Hello, is this 000?”"
      }
    ]
  },
  {
    "title": "Chapter 810 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "9:30 p.m."
      },
      {
        "paragraph": "Shaun leaned on the door of Catherine’s house and looked at his phone from time to time."
      },
      {
        "paragraph": "Why was that woman not back yet when it was already so late? Could she be on a date with some guy\nagain? If Shaun had not tracked Isaac’s whereabouts beforehand and found out that he was working\nextra hours at his company tonight, he would not have waited here foolishly for seven hours."
      },
      {
        "paragraph": "He had never waited for a woman like that before. Ding. A sound came from the elevator."
      },
      {
        "paragraph": "A few policemen walked toward him with a frown. “It must be you.”"
      },
      {
        "paragraph": "Shaun was dumbfounded."
      },
      {
        "paragraph": "“Let’s go. Either you leave this neighborhood, or follow us back to the police station.” The police said\ncoldly, “The owner of this house has already made a police report. She said you’re her ex-husband who\nhas been pestering her so much even after the divorce that she doesn’t dare come home.” “She called\nthe police?"
      },
      {
        "paragraph": "Shaun’s handsome face twitched, and he exuded a terrifying aura. Unbeknownst to him, it made the\npolice more certain that he was a violent man with bad behavior."
      },
      {
        "paragraph": "“Nonsense. Should she allow you to pester her if she doesn’t call the police?” A policeman started to\neducate Shaun. “ I’ve seen many men like you who still abuse their wives even after they’re divorced. Let\nme advise you on one thing. Since you’re already divorced, just live your own life. Are you still a man if\nyou keep clinging on to her?” “Very well.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun clenched his fists and walked toward the elevator in long strides."
      },
      {
        "paragraph": "When the elevator doors closed, he heard the policemen outside talking."
      },
      {
        "paragraph": "“This guy’s temper is so bad. If I were a woman, I’d divorce him too.”"
      },
      {
        "paragraph": "Shaun walked to the parking lot. He slammed the car door shut and made a call to Master Ziegler of\nLiona."
      },
      {
        "paragraph": "“Find out Catherine’s location for me. I want to know where she is.”"
      },
      {
        "paragraph": "Not long after, Master Ziegler sent him an address: [ Catherine is at the Yule family’s villa.]"
      },
      {
        "paragraph": "Shaun’s expression loosened up a little. Luckily Catherine was not on a date with another man. If not…\nhe might murder that man."
      },
      {
        "paragraph": "The next morning."
      },
      {
        "paragraph": "Catherine had a good night’s sleep with Lucas. When they woke up to have breakfast, the butler came in\nand said, “President Yule, a sports car arrived at the door around 10 p.m. last night and has been parked\nthere ever since. The guard said the lights on the car came on several times at night, so there is\nsomeone inside. The model of the sports car is a global limited edition. Currently… only Shaun has it in\nthe whole of Australia.”"
      },
      {
        "paragraph": "Joel’s expression turned cold. “Why is he waiting at our door? I’ve never seen such a shameless person i\nn my whole life.”"
      },
      {
        "paragraph": "Lucas looked at Catherine nervously. “Mommy…”"
      },
      {
        "paragraph": "“Don’t worry. Let’s have our breakfast first. I’ll meet him once I’ve eaten.”"
      },
      {
        "paragraph": "With that, Catherine filled Joel and Lucas’s plates. She would still have to meet Shaun anyway."
      },
      {
        "paragraph": "“Catherine, listen to me. Stay away from that guy. Isaac’s pretty good too. You can get to know him more,\n” Joel advised her earnestly. “Shaun is a fickle scumbag. If Sarah didn’t get into trouble, he wouldn’t even\nturn back and look for you.”"
      },
      {
        "paragraph": "“I know. Dad, let Uncle Sheldon send Lucas to preschool later, and don’t let anybody find out, ” Catherine\nreminded."
      }
    ]
  },
  {
    "title": "Chapter 811 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "After breakfast, Catherine walked out from the main entrance of the Yule family’s villa."
      },
      {
        "paragraph": "Shaun immediately opened the car door and walked toward her. Having not been home for two\nconsecutive nights, the shirt he wore was crumpled, and there was stubble on his face. However, that did\nnot affect his good looks at all. In fact, it strengthened his presence further. Even his gloomy mood was\nfilled with a compelling taste of a bad boy that women loved."
      },
      {
        "paragraph": "“You called the police last night?” Shaun stared at Catherine with bloodshot eyes."
      },
      {
        "paragraph": "“That’s right. You kept standing at my door, not wanting to leave. It was a huge inconvenience to m e, ”\nCatherine said coldly without any hint of guilt."
      },
      {
        "paragraph": "“You…”"
      },
      {
        "paragraph": "Shaun’s chest heaved. As a highly regarded man, he had never been humiliated by a woman like that\nbefore."
      },
      {
        "paragraph": "“What about me? I’m not a person who’s at your beck and call. Mr. Hill, you can’t choose a useful woman\nwhen you need her but abandon her for another attractive yet useless woman when you don’t.”\nCatherine scolded him bluntly. “I remember telling you this clearly the night before, that if you went to\nSarah, you shouldn’t bother coming back to me anymore.”"
      },
      {
        "paragraph": "When Catherine recalled that he sent a selfie of him at home to her but went to find Sarah the next\nmoment, she was truly disgusted with him."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“I… I had no choice. Sarah fell down from the stairs that day, and she hurt her leg. If I didn’t go, she\nwould refuse to get treated. In the end, I went and made things clear to her. See? Rodney even fought\nwith me over this matter.”"
      },
      {
        "paragraph": "Shaun pointed at the wound on his mouth. All he could do was act pitiful as he hissed in pain. “It still\nhurts a lot.”"
      },
      {
        "paragraph": "“Serves you right, ” Catherine said those three words and sneered."
      },
      {
        "paragraph": "Shaun stiffened for a moment before he said brazenly, “Yes, I deserved it. You have foresight after all,\nbabe. You told me not to go.”"
      },
      {
        "paragraph": "“Who’s your babe? Watch your mouth.” Catherine’s scalp tingled from him calling her babe,"
      },
      {
        "paragraph": "to which she glared at him with her bright eyes."
      },
      {
        "paragraph": "Her discerning big eyes, delicate fair skin, and juicy pink lips made Shaun’s heart melt. It melted more\nwhen he recalled the kiss emoji that she sent him."
      },
      {
        "paragraph": "He was determined to get her to forgive him that day, even if he had to be brazen-faced. Then, he would\nslowly savor the taste of kissing her."
      },
      {
        "paragraph": "“Cathy, I’ve already cleared things up with Sarah. I don’t love her anymore, and it’s impossible for me to\nget back together with her and marry her.”"
      },
      {
        "paragraph": "Shaun held Catherine’s petite hands and grabbed them tightly. His deep, obsidian-like gaze was serious."
      },
      {
        "paragraph": "Catherine’s mind wandered for a moment."
      },
      {
        "paragraph": "He had once looked at her with contempt and said that the one he loved was Sarah."
      },
      {
        "paragraph": "So, when she heard him saying that from his thin lips again, she did not feel touched. Instead, she\nthought it was ironic."
      },
      {
        "paragraph": "“Babe, can you give me another chance?”"
      },
      {
        "paragraph": "Shaun thought her remaining silent meant that she was touched. Hence, he stretched his hands and\nwanted to pull her into his embrace."
      },
      {
        "paragraph": "However, Catherine put her hands against his chest. “Shaun, I really don’t know whether I should believe\nyou again or not. I’ve been hurt by you too many times now. I’m afraid that if I start having expectations\nof you once more, Sarah will call you away again or threaten you with her life. I haven’t been with you for\nlong, but you and Sarah have known each other for more than 1o years…”"
      },
      {
        "paragraph": "“No, Cathy. I won’t fail you anymore.” Shaun hugged her tightly. “Don’t you know what type of person I\nam by now? I won’t say such words if I’m not sure of my feelings.”"
      },
      {
        "paragraph": "Catherine’s face was buried in his embrace. At a place where he could not see, there was mockery in her\neyes."
      },
      {
        "paragraph": "She knew him all too well. He could utter any sweet words when he was in love. That was why she fell\nfor him again despite being hurt by him time and time again."
      },
      {
        "paragraph": "However, when he was not in love, he was cold, heartless, and cruel."
      },
      {
        "paragraph": "“Babe…” When Shaun saw Catherine still in his arms, a wave of passion surged in him. “You owe m e a\nkiss.”"
      },
      {
        "paragraph": "After that, he lowered his head and kissed her."
      }
    ]
  },
  {
    "title": "Chapter 812 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "A hand covered Shaun’s lips before he could kiss Catherine."
      },
      {
        "paragraph": "“When did I owe you a kiss?” Catherine was puzzled. She was about to be defeated by his\nshamelessness."
      },
      {
        "paragraph": "“The night the day before yesterday. ” Shaun took his phone out and showed her the kiss emoji that she\nhad sent him."
      },
      {
        "paragraph": "Catherine’s pretty face flushed when she saw the kiss emoji on the phone. She had done it at the spur of\nthe moment purely with the intention to make this man yearn for her. However, she did not expect him to\nremember it so well."
      },
      {
        "paragraph": "“Oh, I remember. But… did you go look for Sarah immediately after receiving my emoji?” she asked with\na fake smile."
      },
      {
        "paragraph": "“No.”"
      },
      {
        "paragraph": "Shaun’s expression stiffened, and he said unnaturally, “I went to take a cold bath after I received it.”"
      },
      {
        "paragraph": "Since they were adults, Catherine found herself understanding his words right away."
      },
      {
        "paragraph": "Her eyes widened in disbelief before her cheeks heated up. She was speechless."
      },
      {
        "paragraph": "Seriously? Was it not just an emoji that everyone was using? Why was he so horny?"
      },
      {
        "paragraph": "“You just broke up with Sarah a few days ago. Was that necessary?” She could not help but mutter softly."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "However, Shaun’s hearing was excellent. Having heard her clearly, a hint of embarrassment flashed\nacross his eyes. Then, his lips moved. At first, he wanted to say that he could only react to her, but he\nwanted to avoid her from thinking that he only loved her body and not her person if she found out the\ntruth. It would be troublesome if she overthought."
      },
      {
        "paragraph": "“No. You’re the one who has a destructive power over me.”"
      },
      {
        "paragraph": "Catherine averted her gaze. “Does it mean that you owe me a beating if I send you a punching emoji\nnext time?”"
      },
      {
        "paragraph": "“Sure.” Shaun stared at her lips with a scalding"
      },
      {
        "paragraph": "gaze. As long as he could kiss her, he would take any beating in the future."
      },
      {
        "paragraph": "That man had no bottom line at all."
      },
      {
        "paragraph": "“I think you’re still dreaming. I’m too lazy to waste my time with you. I’m going to the company.”"
      },
      {
        "paragraph": "Catherine could not care less about him anymore and turned around straight away."
      },
      {
        "paragraph": "“Wait, I’ll take you to the company.” Shaun grabbed her arm and opened the door to the passenger seat."
      },
      {
        "paragraph": "Catherine glanced at the passenger seat. “No. I don’t want to sit in a place where other women have sat\nbefore.”"
      },
      {
        "paragraph": "After that, she walked toward the main entrance of the villa. The guard had already driven her car over."
      },
      {
        "paragraph": "Catherine opened the car door and got into the driver’s seat. However, Shaun immediately sat on the\npassenger seat and buckled his seat belts."
      },
      {
        "paragraph": "“Brother, why are you following me? I have to go to work.” Catherine snapped."
      },
      {
        "paragraph": "“I’ll send you to work. We can spend more time with each other on the way.” Shaun’s thin lips"
      },
      {
        "paragraph": "lifted in a smile. “I just realized even the air is sweeter when I’m with you.”"
      },
      {
        "paragraph": "Catherine shuddered. “Shut up.”"
      },
      {
        "paragraph": "Shaun frowned, looking aggrieved. He did not sleep in the car all night just so he could say these\ntouching, romantic words. He had been learning on his phone, but she did not give him the chance to\nuse them at all."
      },
      {
        "paragraph": "“Alright, I’ll shut up. But my mind is filled with your voice, so it doesn’t matter if we talk or not.” H e smiled\naffectionately."
      },
      {
        "paragraph": "The corners of Catherine’s mouth twitched as she put her hand on her forehead. “What about your\nsports car? Are you just going to leave it there?”"
      },
      {
        "paragraph": "“You said you don’t want to sit on it, so I don’t want it anymore. I’ll just get a new car.” Shaun took his\nphone out and called Hadley. He looked at the logo on Catherine’s steering wheel and said, “Get me an\nAston Martin.”"
      },
      {
        "paragraph": "“But you just bought your car not long ago.”"
      }
    ]
  },
  {
    "title": "Chapter 813 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“I’m not driving that anymore. Cathy doesn’t like it, so there’s no need to keep it.”"
      },
      {
        "paragraph": "Hadley felt embarrassed. “But will an Aston Martin be too cheap? It doesn’t really match your status.”"
      },
      {
        "paragraph": "“Never mind. Cathy drives an Aston Martin too. Since she drives a white one, you can get a black one for\nme. Just nice, we’ll have matching cars.”"
      },
      {
        "paragraph": "Shaun hung up after he said that. It was as if changing a sports car to him was as easy as shopping for\nvegetables."
      },
      {
        "paragraph": "Catherine concentrated on her driving and let him do whatever."
      },
      {
        "paragraph": "As she drove, Shaun said, “This isn’t the way to Hudson Corporation.”"
      },
      {
        "paragraph": "“Mm, I’m going to Yule Corporation. The toxin in my dad’s body hasn’t cleared yet, so I’m going to his\ncompany to have a look.”"
      },
      {
        "paragraph": "It was mainly because Joel told her last night that Old Master Yule had agreed to let Melanie return to the\ncompany. As such, she had to go and take a look personally. Otherwise, Yule Corporation would become\na total mess because of Melanie and her father again."
      },
      {
        "paragraph": "“If you’re going to Yule Corporation, it means that you’re going to meddle in Yule Corporation’s matters.\nWill you be able to manage everything?” Shaun frowned when he heard her words. “Do you still have\ntime to be in a relationship with me?”"
      },
      {
        "paragraph": "“When did I agree to be in a relationship with you?” Catherine complained."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“It doesn’t matter whether you agree or not because I’ve agreed anyway.” Shaun smiled at her."
      },
      {
        "paragraph": "After glancing at him in silence, Catherine could not resist saying, “Can you go back and get some\nsleep?”"
      },
      {
        "paragraph": "“Are you worried about me?” Shaun’s eyes lit up."
      },
      {
        "paragraph": "“No, your dark circles are too deep. It makes you look like a panda, and it affects your looks.” Catherine\ngave him a merciless blow."
      },
      {
        "paragraph": "Shaun was suddenly at a loss for words. He had the urge to take his phone out to look at his face, but\nhis pride and honor did not allow that. Instead, he just put on a long face."
      },
      {
        "paragraph": "The car drove into Yule Corporation’s parking lot."
      },
      {
        "paragraph": "When Catherine parked the car and was about to get down, Shaun grabbed hold of her and said with a\nhoarse voice, “Cathy, can you add me to your WhatsApp contacts? Remove me from your blocked\ncontacts too. If you don’t, I’ll follow you everywhere you go.”"
      },
      {
        "paragraph": "Catherine sighed. Then, she added him to her WhatsApp contacts right before him and removed his\nnumber from her blocked contacts. “Can I go up now?”"
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "Shaun got down from the car with her. “Cathy, I heard Yule Corporation and Campos Corporation are\nplanning to establish a joint venture.”"
      },
      {
        "paragraph": "“There was that news before, but since I’m here, I won’t agree to it.”"
      },
      {
        "paragraph": "Shaun nodded. “Campos Corporation isn’t that simple. In the ten years of collaboration they had with Hill\nCorporation, they basically paralyzed the senior management of Hill Corporation. Be careful.”"
      },
      {
        "paragraph": "Catherine was taken aback, but she nodded. After she stepped into the elevator, she noticed that Shaun\nwas still waiting outside."
      },
      {
        "paragraph": "She lowered her head and smiled. She did not expect that this day would come for him."
      },
      {
        "paragraph": "The elevator went up and led her straight to the floor where Joel worked."
      },
      {
        "paragraph": "Joel’s right-hand man, Secretary Coleman, had been waiting there for a while. When Catherine turned\nup, he led the employees of the secretarial department forward immediately and said, “Eldest Young\nLady, Old Master Yule has brought Melanie to the company today, and they’re currently holding a\nmeeting.”"
      },
      {
        "paragraph": "“Why does my dad not know of this?” Catherine raised her eyebrows doubtfully."
      },
      {
        "paragraph": "“It was a last-minute decision from Old Master Yule. The senior management of every department and a\nfew important shareholders are at the meeting. By the way, the Campos Corporation’s people are here\ntoo.”"
      },
      {
        "paragraph": "“Lead the way. I will sit in too.”"
      },
      {
        "paragraph": "Catherine had a bad feeling. She turned around and immediately went into the elevator again."
      },
      {
        "paragraph": "At the conference room on the › 3rd floor."
      },
      {
        "paragraph": "When Charlie Campos ended his long speech, he said, “Everyone, we all want to earn money. If we want\nto earn more money, then we have to enter the finance sector. Now is the best opportunity to do so. Yule"
      },
      {
        "paragraph": "Corporation has been developing well in recent years, but it’s still a bit lacking as compared to the Hill\nfamily and the Snow family. Grandpa, what do you think?”"
      }
    ]
  },
  {
    "title": "Chapter 814 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Having not managed the company’s affairs for many years, Old Master Yule was dragged into today’s\nmeeting coincidentally by Melanie."
      },
      {
        "paragraph": "However, Charlie’s speech had moved him."
      },
      {
        "paragraph": "He was most upset about the fact that Yule Corporation would never be one of the top three wealthiest\nfamilies in Australia."
      },
      {
        "paragraph": "“Old Master Yule, say something. We believe in your views. ” President Parker flattered him. “Now that\nDirector Yule has been poisoned and is not as healthy as he used to be, Yule Corporation can only rely\non you.”"
      },
      {
        "paragraph": "“That’s right, Old Master Yule. Come back to the company.” A few shareholders advised him. “ Campos\nCorporation has been developing rapidly over the years, and they’ve advanced to the second largest\ncorporation in Australia. I think we shouldn’t miss out on this chance.”"
      },
      {
        "paragraph": "“Yes. Regardless of personal grudges, if it weren’t for the e-commerce that we’ve previously established\nwith Campos Corporation, Yule Corporation wouldn’t have developed so fast for the past few years.”"
      },
      {
        "paragraph": "“Old Master Yule, you should lead Yule Corporation to glory again.”"
      },
      {
        "paragraph": "Old Master Yule was instantly fired up by the comments. Although he had retired for many years, he was\nstill as ambitious as before. The reason he retired was due to his health problems. However, his health\nhad gotten better from recuperating all these years, so he started to become ambitious again."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Old Master Yule, let me tell you the truth.” President Parker went to Old Master Yule’s side and\nwhispered, “Although Director Yule appointed Catherine as his successor, her last name is still Jones.\nYule Corporation can’t possibly change its name to Jones Corporation in the future, right?”"
      },
      {
        "paragraph": "Old Master Yule’s expression changed. If no one had brought that up, he would never have realized it."
      },
      {
        "paragraph": "Melanie smirked. She turned her head and said,“ Grandpa, I’ve heard Charlie mention about starting a\njoint venture many times, and it is indeed viable. Currently, there are many people who want to become\nshareholders as well. If it weren’t for our marriage between the two families, Charlie wouldn’t have\nprioritized Yule Corporation for such a good project too. But to invest tens of billion dollars into this\nproject, we’ll need someone as bold as you to make a decision.”"
      },
      {
        "paragraph": "Old Master Yule took a deep breath before he pounded on the table. “Okay. It’s decided, then. ”"
      },
      {
        "paragraph": "“Grandpa, what did you decide on?”"
      },
      {
        "paragraph": "The office door was suddenly pushed open. Catherine entered in her high heels with a smile. She was in\na white blazer that made her look competent and not any less beautiful."
      },
      {
        "paragraph": "“About starting a joint venture with Campos Corporation. I think it’s very viable, ” Old Master Yule said as\nhe smiled. “Catherine, why are you here today?”"
      },
      {
        "paragraph": "“Dad said Melanie is coming back to the company today, so he told me to come over and have a look. ”\nCatherine gave Melanie and Charlie an eloquent glance. “I didn’t know that Sis had planned something\ngrand to do on her first day back.”"
      },
      {
        "paragraph": "“I’m only doing it for the sake of the company’s development, ” Melanie said humbly. “Besides, Campos\nCorporation has already been preparing this for half a year. It cannot be delayed anymore.”"
      },
      {
        "paragraph": "Catherine’s eyebrows moved. Melanie would have been smug in the past, but today, she could keep her\ncomposure well. Sure enough, she changed a lot ever since Nicola went to jail."
      },
      {
        "paragraph": "“So you’ve agreed to it, Grandpa?” Catherine looked toward Old Master Yule."
      },
      {
        "paragraph": "“I’ve heard Charlie explaining it in detail just now, and I’m quite satisfied. We’ll get a net profit of more\nthan 1o billion dollars in the first year. Why shouldn’t we do it?” Old Master Yule was full of confidence."
      },
      {
        "paragraph": "Catherine frowned. “Grandpa, sometimes when a plan sounds overly good, it’ll easily…”"
      },
      {
        "paragraph": "“Ms. Jones, I’ve never been unrealistic. This is not the first collaboration between Campos Corporation\nand Yule Corporation either. Everyone is clear on what kind of person I am, and I always keep my\npromises. After all, the success of the Campos family today did not come for free. ” Charlie raised his\neyebrows. “I understand that you have a grudge with my wife. However, it’s not the time to fuss about\nthose small grudges when it comes to bigger things.”"
      },
      {
        "paragraph": "What he really meant was that if Catherine did not agree to the plan, it would be because she could not\nstand Melanie."
      },
      {
        "paragraph": "Deep down, Catherine sighed. Melanie’s trick was a clever one. She had secretly egged Old Master Yule\non to come to the company and let him make the decision. If Catherine did not support his decision, she\nwould be offending him."
      }
    ]
  },
  {
    "title": "Chapter 815 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "However, Catherine still did not agree to the collaboration with Campos Corporation."
      },
      {
        "paragraph": "“Grandpa, I still think it’s better to inspect this matter thoroughly. For example, after the joint venture\nhas been established, who will provide the professional team? Who will be the managing director? Yule\nCorporation isn’t well versed in the finance sector, so we don’t have the necessary resources as well. If\nwe step into the sector rashly…”"
      },
      {
        "paragraph": "“What do you mean? Are you questioning my decision?” Old Master Yule’s expression darkened. “\nCatherine, I’ve been in the business world for tens of years. I’m more experienced than you. There’s no\nneed for you to meddle in the affairs of Yule Corporation any more.”"
      },
      {
        "paragraph": "“Grandpa, it’s not that I don’t believe in you. I just think that it’s better to discuss this when my dad\ncomes back…”"
      },
      {
        "paragraph": "Charlie said sarcastically, “Ms. Jones, are you saying that Old Master Yule isn’t as visionary as you\ndad?”"
      },
      {
        "paragraph": "Old Master Yule became upset when he heard that. “ I’ve managed Yule Corporation for tens of years.\nNo one knows the business world better than me. This matter has been decided. Catherine, since you\ndon’t know Yule Corporation well, you should come here less in the future.”"
      },
      {
        "paragraph": "He stood up after he spoke. “Okay, that concludes today’s meeting.”"
      },
      {
        "paragraph": "“Grandpa, I’ll send you home.” Melanie followed after him immediately. As she left, she cast a smug\nglance toward Catherine."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "The employees of the senior management gradually left. Not one of them cared about Catherine."
      },
      {
        "paragraph": "Charlie walked to her side with a smile and said, “ So what if you’re the successor of Yule Corporation?"
      },
      {
        "paragraph": "No one takes you seriously. I’d advise you to go back to where you came from.”"
      },
      {
        "paragraph": "“Charlie, I don’t believe you’re sincere in collaborating with Yule Corporation. After all, the Campos\nfamily was the one who took advantage of Hill Corporation. Didn’t all of you earn your fortune from\ncheating the Hill family? Now that the Campos family is the second wealthiest family in Australia, I\nguess you must really want to be in first place.”"
      },
      {
        "paragraph": "Catherine looked at Charlie coldly. To be honest, she had never understood Charlie."
      },
      {
        "paragraph": "At Melanie’s and his wedding three years ago, she always thought of him as a flirtatious, indecent,"
      },
      {
        "paragraph": "and greasy man. However, in just three years, Campos Corporation had unexpectedly become the\nsecond wealthiest family in Australia."
      },
      {
        "paragraph": "The Campos family was not simple. She had a feeling that there was a mysterious force helping the\nCampos family behind the scenes."
      },
      {
        "paragraph": "“You’re not wrong. I do want to be in the first place.”"
      },
      {
        "paragraph": "Charlie touched his chin. “Look, maybe we can collaborate with each other?”"
      },
      {
        "paragraph": "“Didn’t my grandpa agree to the collaboration between Yule Corporation and Campos Corporation\nalready?” Catherine frowned."
      },
      {
        "paragraph": "Charlie laughed. “ I meant the both of us. I heard some news lately. Isn’t Shaun trying to woo you? Are\nyou really fine with the fact that he abandoned you three years ago? Don’t you wish to trample over the\nscumbag that betrayed you before?”"
      },
      {
        "paragraph": "Catherine was astonished."
      },
      {
        "paragraph": "Shaun and Sarah had only just appeared on the news a few days ago, so all the wealthy families in\nAustralia thought that Shaun and Sarah had made up again. Yet, Charlie already found out that Shaun\nwas wooing her."
      },
      {
        "paragraph": "“Are you surprised? Actually, the Campos family is more powerful than you think.”"
      },
      {
        "paragraph": "Charlie reached his hand forward to touch her face as he smiled."
      },
      {
        "paragraph": "Catherine stopped him halfway. She looked at Charlie’s greasy face in contempt. “Brother-in- law, my\nstandards are very high. Normally, I won’t even turn my gaze toward a mediocre-looking guy like\nyours.”"
      },
      {
        "paragraph": "After that, she turned around, ignoring Charlie’s awful expression, and left without looking back."
      }
    ]
  },
  {
    "title": "Chapter 816 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Charlie looked at her pretty silhouette with a dark expression and wiped his lips hard."
      },
      {
        "paragraph": "Ha! So what if she looked down on him? He would surely teach her a lesson one day."
      },
      {
        "paragraph": "After returning to the office, Catherine’s head spun from looking at Yule Corporation’s documents for a\nwhile. Hence, she started playing games on her phone."
      },
      {
        "paragraph": "When she had finished one round of the game, a player called You’re In My Heart came to form a team\nwith her."
      },
      {
        "paragraph": "Once Catherine approved the request, both of them went onto the battlefield."
      },
      {
        "paragraph": "However, Catherine’s expression went dark just after playing for a while. That player had to be a newbie\nas he was nowhere to be found after parachuting."
      },
      {
        "paragraph": "She could not help but turn on her microphone and reminded, “Hey! Hey sister, stop running around."
      },
      {
        "paragraph": "You’ll trespass the border if you go any further and die.”"
      },
      {
        "paragraph": "“I’m a guy. Which way should I go?” The raspy voice of a man came from the game."
      },
      {
        "paragraph": "Catherine was almost captivated. That voice was too sexy, and it sounded a little familiar, but she was so\nfocused on the game that she could not recall. “ Open the map on the top right corner. Don’t run out of\nthe white circle. Meet me at my location.”"
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Not long after the man replied, he started to run toward her."
      },
      {
        "paragraph": "Catherine let out a sigh of relief. Luckily, that guy was not too stupid."
      },
      {
        "paragraph": "However, the system gave a reminder that the area of the map was about to shrink. He would surely get\nthem eliminated with that speed of his."
      },
      {
        "paragraph": "Catherine immediately found an off-road SUV and sped toward him. When she arrived, she found out\nthat guy was still empty-handed. She was utterly speechless."
      },
      {
        "paragraph": "“Brother, where are your weapons and equipment? You’ll get killed any time.”"
      },
      {
        "paragraph": "“…Where should I look for the equipment?” That man’s hesitant voice came over."
      },
      {
        "paragraph": "Catherine was exasperated. “Bro, is this your first time playing a game? How exactly did you find me?”"
      },
      {
        "paragraph": "“Mm, it’s my first time. I’m accompanying my girlfriend.” The man lowered his voice."
      },
      {
        "paragraph": "“Then, you should go look for your girlfriend. Why did you look for me instead?” Catherine looked at his\nID, You’ re In my Heart. Not many guys would set such a transparent game ID. That guy would have to\nbe an innocent, good man in real life."
      },
      {
        "paragraph": "He remained silent for a while before he said, “"
      },
      {
        "paragraph": "You’re my girlfriend.”"
      },
      {
        "paragraph": "“…What?”"
      },
      {
        "paragraph": "Catherine was stunned. She felt as if she was struck by lightning. Could people become couples just by\nplaying games?"
      },
      {
        "paragraph": "Wait, something was not right. That person’s voice was similar to a particular scumbag’s voice."
      },
      {
        "paragraph": "The next second, the man in the game said, “ I’m Shaun. Can’t you recognize my voice?”"
      },
      {
        "paragraph": "The speeding off-road SUV crashed into a tree with a bang."
      },
      {
        "paragraph": "Catherine fell from the car. Before she could even stand properly, someone suddenly shot her a few\ntimes from afar. Then, she just… died."
      },
      {
        "paragraph": "It was the quickest death in her gaming history."
      },
      {
        "paragraph": "Next, she saw Shaun being shot to the ground as well. He carried his wounded body and tried to crawl\ntoward her. They looked like a couple who were about to die together."
      },
      {
        "paragraph": "At that moment, she heard a certain someone’s chuckle from her phone. “Even if I die, I’ll die by your\nside.”"
      },
      {
        "paragraph": "The corners of Catherine’s mouth twitched. She was speechless."
      },
      {
        "paragraph": "Who would want to die with him? With that, she logged out of the game to look for Shaun’s contact and\ncalled him."
      },
      {
        "paragraph": "“Babe…” The same voice from the game came through."
      }
    ]
  },
  {
    "title": "Chapter 817 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Who’s your babe?” Catherine snapped. “Shaun, aren’t you a president? Do you have a lot of spare time\nto disturb me in my games?”"
      },
      {
        "paragraph": "“I’ve earned enough money. The most important thing right now is to pick up girls and get a girlfriend.”\nShaun’s reply was confident. “ It’s my duty to accompany my girlfriend to play games.”"
      },
      {
        "paragraph": "Catherine held her forehead. “How on earth did you find my account?”"
      },
      {
        "paragraph": "She remembered that she did not register her WhatsApp number in the game."
      },
      {
        "paragraph": "“ I noticed it when you were playing that game on the day we watched a movie,” Shaun said in a low\nvoice. “This is my first time playing games. I used t o think playing games is a waste of life, but now I\nunderstand that being in a game with the person I love is pretty romantic too.”"
      },
      {
        "paragraph": "Although they were on a call, Catherine got goosebumps from his flirting. She did not know how to\ncontinue the conversation."
      },
      {
        "paragraph": "“Good girl. What time are you getting off work this evening? I’ll pick you up.” Shaun continued flirting with\nher in a gentle voice."
      },
      {
        "paragraph": "“I drove myself today.”"
      },
      {
        "paragraph": "“ I know. I’ll ask Hadley to send me there. I’ll wait for you by your car.”"
      },
      {
        "paragraph": "In the end, Catherine told him the time."
      },
      {
        "paragraph": "In the evening."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine took her bag and walked into the private elevator."
      },
      {
        "paragraph": "The elevator stopped on the 25th floor, where Melanie looked at her smugly and was about to enter the\nelevator."
      },
      {
        "paragraph": "However, Catherine pressed the close doors button straight away, sandwiching Melanie between the\ndoors."
      },
      {
        "paragraph": "“Catherine, are you trying to murder me?” Melanie yelled. She was in a mess from being sandwiched\nbetween the doors."
      },
      {
        "paragraph": "“You think too much. ” Catherine pressed the open doors button again and pushed Melanie out. “ Didn’t\nyou see what’s written outside? It says ‘"
      },
      {
        "paragraph": "Director’s Private Elevator’. What right do you have to use this?”"
      },
      {
        "paragraph": "Melanie sneered. “Aren’t you just counting on the identity of a successor that Joel gave you? But now,\nI’m an important person who’s in charge of Yule Corporation’s future development. You may not know\nthis, but Grandpa has already approved the finance department to assign 12 billion dollars to me in order\nto develop the joint venture with Campos Corporation. You didn’t expect this, did you? You deliberately\nchased my father and me out before, so you must not have expected that we’ll be back so soon.”"
      },
      {
        "paragraph": "“I can see that you’ve been trying hard to please Grandpa and Granny at home recently. But Melanie,\nyou should remember that your last name is Yule. Don’t foolishly be a pawn for others. You have to\nunderstand this. Once you’re worth nothing to the Campos family, will that playboy, Charlie, still want"
      },
      {
        "paragraph": "you? Just like before. Didn’t you complain in the hospital that Charlie hit you when you were dismissed\nfrom your job?”"
      },
      {
        "paragraph": "Catherine tucked her hair behind her ear while she sneered. “Furthermore, Charlie even tried to flirt with\nme, his sister-in-law, at the conference room this morning. If you don’t believe me, you can check the\nsecurity footage yourself.”"
      },
      {
        "paragraph": "After she said that, she released her finger on the open doors button, and the elevator doors closed."
      },
      {
        "paragraph": "Melanie’s pretty face twisted in anger. She had initially wanted to get off work, but now, she went straight\nto the security room instead to get this morning’s footage of the conference room. That was when she\nsaw Charlie extending his hand to touch Catherine’s face. His movements were flirty."
      },
      {
        "paragraph": "A trace of anger swept across her eyes. ‘Charlie, you’re such a heartless bastard,’ she thought."
      },
      {
        "paragraph": "Meanwhile, Catherine arrived at the parking lot. Before she made it to her car, she could see Shaun\nleaning on the front of her sports car. He wore a pair of long white pants and a shirt with blue and white\nstripes. There was a pair of sunglasses hung a t the front of his shirt. He exuded a dashing and\nhandsome presence. His long legs, especially, were comparable to a top global male model’s legs."
      },
      {
        "paragraph": "Catherine stood there and studied him for a while. She felt like Shaun was getting younger as he aged.\nPeople might even believe that he was 25 years old."
      },
      {
        "paragraph": "“Cathy…”"
      },
      {
        "paragraph": "When Shaun saw her coming, he opened the passenger door immediately."
      },
      {
        "paragraph": "Catherine handed him the car keys and got in the car."
      },
      {
        "paragraph": "“I can do this myself.”"
      },
      {
        "paragraph": "As half of his body shadowed hers, she was overwhelmed by the cool, musky scent of a man that had a\nhint of intimacy to it. Catherine raised her head awkwardly."
      }
    ]
  },
  {
    "title": "Chapter 818 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Unexpectedly, the roof of the sports car was very low."
      },
      {
        "paragraph": "Shaun was directly above her head. So when she raised her head, he was lowering his body, and her\njuicy lips just so happened to brush his thin lips."
      },
      {
        "paragraph": "The air went still."
      },
      {
        "paragraph": "Shaun’s throat tightened. He felt as if sparks were thrown into a bunch of firewood and ignited a flame."
      },
      {
        "paragraph": "He stared at her. Looking closely, he realized that Catherine had very good skin. She did not have a pore\nnor a pimple. Yet under his gaze, a pink layer o f hue gradually tainted her milky-white skin, making her\nlook even more stunning."
      },
      {
        "paragraph": "“Go away.” Catherine pushed him away."
      },
      {
        "paragraph": "“I’ll go away after another kiss.” Shaun held his body still. Although it was just a light kiss, he could not\nforget the taste of it. It felt like he was finally liberated after tens of years of being a celibate."
      },
      {
        "paragraph": "“What do you mean by ‘another’? That was just an accidental touch. ” Catherine retorted awkwardly."
      },
      {
        "paragraph": "“I don’t think so.” There was a smile in Shaun’s eyes. “I won’t go if we don’t kiss.”"
      },
      {
        "paragraph": "“Shaun.” Catherine gritted her teeth. She never thought he would be so shameless."
      },
      {
        "paragraph": "“Oh, who is that over there?” Shaun suddenly pointed out of the window in surprise."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine immediately looked over, only to find that there was nothing at all. It was at that moment she\nrealized she was tricked. However, at that moment, Shaun’s thin lips swooped down and landed on her\nlips. His lips stayed there for two to three seconds before he withdrew quickly. He was"
      },
      {
        "paragraph": "all smiles and smug, like a cat who had stolen a fish."
      },
      {
        "paragraph": "She was speechless."
      },
      {
        "paragraph": "He had only broken up with Sarah not long ago, yet he made it seem as if he had not kissed a woman in\na long time."
      },
      {
        "paragraph": "As soon as Shaun got in the driver’s seat, he started the car and drove off. “Babe, what do you think of\nYule Corporation today?”"
      },
      {
        "paragraph": "“Nothing much.” Catherine’s eyebrows moved. “ Yule Corporation and Campos Corporation have already\ndecided to start a joint venture, and a lot of money has been invested. They are very ambitious."
      },
      {
        "paragraph": "I think the Campos family intends to start the largest finance company in Australia. I’m afraid the Hill\nCorporation’s finance subsidiaries might be pushed aside.”"
      },
      {
        "paragraph": "“Blame it all on my disappointing Second Uncle. The Hill family has not been making any progress i n the\nfinance sector these years.”"
      },
      {
        "paragraph": "Shaun put on his sunglasses. “But… The Yule family isn’t well versed in finance at all. Aren’t you afraid\nthat Yule Corporation will become the Campos family’s pawn if you enter the finance sector so rashly?”"
      },
      {
        "paragraph": "“I had the same thoughts too. But the shareholders have already had a taste of sweet success during\ntheir previous collaboration with Campos Corporation on e-commerce. Now, they are fooled and filled"
      },
      {
        "paragraph": "with ambition. Melanie even convinced m y grandpa to come out of retirement.”"
      },
      {
        "paragraph": "Catherine sighed. She had wasted so much energy going against Sarah for the past few weeks that it\nmade Melanie and her father resurface again."
      },
      {
        "paragraph": "“Although Old Master Yule has retired for many years, he still has some prestige in the Yule family, ”\nShaun said. “Your cousin isn’t that simple."
      },
      {
        "paragraph": "If Old Master Yule returns, it’ll be very troublesome. According to my grandpa, Old Master Yule is…\nslightly stubborn, foolish, and haughty. Strictly speaking, he’s someone who thinks he’s great but not that\ncapable in reality. However, no one can say that about him.”"
      },
      {
        "paragraph": "Catherine was ashamed. As expected, the older generation’s comments were straightforward and\nprecise. “What kind of person do you think Charlie is?”"
      },
      {
        "paragraph": "“He’s ambitious, and he can do whatever it takes to reach his goal. According to my understanding of the\nCampos family’s usual tactics, they’re not sincere in supporting Yule Corporation. They approached Yule\nCorporation these years because they think they can reap profits from them. Maybe the joint venture this\ntime will suck Yule Corporation dry.”"
      },
      {
        "paragraph": "Shaun rapped the steering wheel lightly and said, “ Only when he sucks Yule Corporation dry can he\ncompete with the Hill family without holding back.”"
      },
      {
        "paragraph": "Catherine was so shocked that she remained silent for a while."
      },
      {
        "paragraph": "Upon noticing her silence, Shaun thought she was worried. Hence, he chuckled and said, “Don’t think\ntoo much about it. Although you’re Yule Corporation’s successor, it only counts when Yule Corporation is\nin your hands. Your last name is Jones after all. In the eyes of the two stubborn elderly of the Yule family,\nyou’re still different compared to Melanie and Damien, whom they’ve brought up. ”"
      }
    ]
  },
  {
    "title": "Chapter 819 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“I know. That’s why I’m not too bothered about it. Since my grandpa is insistent on collaborating with the\nCampos family, then I won’t meddle in their affairs, lest I lose out on both sides.” Catherine shrugged her\nshoulders nonchalantly. “To be honest, I don’ t have any attachments to the Yule family and Yule\nCorporation.”"
      },
      {
        "paragraph": "“Mm, you don’t have to care much about Yule Corporation. Since you’ll be my wife in the future, and the\nwhole of Hill Corporation will be yours. ” Shaun suddenly grabbed her hand. “You have Australia’s\nwealthiest man in your hands.” 1"
      },
      {
        "paragraph": "“Forget it. After all, women have to rely on themselves. Perhaps… you’ll abandon me again. ”"
      },
      {
        "paragraph": "Catherine withdrew her hand. Her eyes were downcast to conceal the coldness in her eyes."
      },
      {
        "paragraph": "“It’s fine if you don’t believe me. I have plenty of time to prove it to you.” Shaun smiled calmly."
      },
      {
        "paragraph": "Catherine looked at his side profile, puzzled. “ Aren’t you worried that the Campos family will become the\nwealthiest family in Australia after they take over Yule Corporation?”"
      },
      {
        "paragraph": "“No. Hill Corporation has already invested a lot of funds into research and development for the past few\nyears. We’ve already achieved an important breakthrough as well. We’ll only climb higher in the future.”\nShaun smiled confidently. “The Campos family mainly earns money from the domestic market, while Hill\nCorporation targets the global market. They can never surpass us.”"
      },
      {
        "paragraph": "Catherine was taken aback. He still had the same handsome face, yet the confident gleam in his eyes a t\nthat moment strangely made her lose her voice."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Although that guy was a scumbag, she had to admit that he was a business prodigy."
      },
      {
        "paragraph": "A handsome and tall business prodigy. No woman would be able to resist being attracted to him."
      },
      {
        "paragraph": "Forty minutes later."
      },
      {
        "paragraph": "The car drove to a high-class restaurant by the seaside. The interior of the restaurant was very exotic."
      },
      {
        "paragraph": "Shaun had already booked an outdoor table. With the warm sea breeze, they could even smell the\nseawater. There was even someone playing the guitar on the beach nearby."
      },
      {
        "paragraph": "Catherine ordered a few seafood dishes."
      },
      {
        "paragraph": "Due to Shaun’s special identity, the kitchen had served the dishes very quickly. Every plate of seafood\nwas freshly cooked, and it was very delicious."
      },
      {
        "paragraph": "Catherine enjoyed the food very much. “ I noticed you guys are really good at picking places to eat."
      },
      {
        "paragraph": "The restaurant that Chase and Joseph brought me t o last time was quite good too.”"
      },
      {
        "paragraph": "Shaun’s expression instantly darkened. “Next time, you’re not allowed to go out for a meal alone with\npeople of the opposite gender, especially Joseph. ”"
      },
      {
        "paragraph": "“What’s wrong with Joseph? He’s my best friend.” Catherine sneered. “If it weren’t for him, Hudson\nCorporation would’ve been done for because of you.”"
      },
      {
        "paragraph": "Shaun was embarrassed. Fine, he could only blame himself for doing too many scummy things and\nunconsciously asking for trouble himself. “Ahem. What I meant was next time when Joseph comes… you\ncan bring me along. I’ll treat him to a meal to thank him for saving my little babe’s company.”"
      },
      {
        "paragraph": "“As long as you know that. Shell the crabs.” Catherine pushed the whole plate of crabs to him. “ Do you\nknow why women have boyfriends? It’s to have them do these kinds of stuff.”"
      },
      {
        "paragraph": "Shaun had a headache looking at the plate. He would usually never shell the crabs himself."
      },
      {
        "paragraph": "However, he was willing to do it to please her."
      },
      {
        "paragraph": "During the process, he even pricked his finger clumsily, and it bled."
      },
      {
        "paragraph": "“You’re really… clumsy.” Catherine grabbed his finger and looked at it for a while before she put it in her\nmouth."
      }
    ]
  },
  {
    "title": "Chapter 820 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun was startled."
      },
      {
        "paragraph": "At that moment, it was as if lava was about to erupt in his body."
      },
      {
        "paragraph": "His breaths became heavy as he stared at her fair, petite face with a heated gaze."
      },
      {
        "paragraph": "He suspected that she was intentionally flirting with him."
      },
      {
        "paragraph": "“Alright. It’s not bleeding anymore. ” Catherine’s lips left his finger. She was not oblivious to his scalding\ngaze. However, men had to be flirted with occasionally and given some benefits. If not, how would she\nleave a deep impression on him?"
      },
      {
        "paragraph": "Shaun looked indifferently at his finger that had stopped bleeding. After a moment, he picked up the crab\nand pricked another of his fingers. Then, he offered his finger to her. “It’s bleeding again.”"
      },
      {
        "paragraph": "Did he think she was blind? Did he not want his dignity anymore?"
      },
      {
        "paragraph": "“Waiter.” She raised her hand and waved at the waiter. “Please bring me some salt.”"
      },
      {
        "paragraph": "Shaun frowned. Why was it different from what he imagined? “Aren’t you going to take a look? More\nblood is flowing out.”"
      },
      {
        "paragraph": "“It’s okay. It’ll be fine once we sprinkle some salt on it later. ” Catherine smiled like a sly fox. “When the\nwind blows and the fire grills it, it can even be eaten as a sausage.”"
      },
      {
        "paragraph": "Shaun’s expression darkened at her words. “Why did you suck it for me before but not now?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Am I crazy? People will think I’m a lunatic if I keep sucking on your finger. Besides, don’t you have\ngerms on your hands?” Catherine lost her temper too."
      },
      {
        "paragraph": "Shaun immediately fell silent from being scolded."
      },
      {
        "paragraph": "Since he could not get away with it anymore, he could only stop the bleeding with the napkin."
      },
      {
        "paragraph": "“Forget it. Let me do it myself. My boyfriend is too useless. He can’t even shell a crab properly.”\nCatherine sighed and started shelling the crabs herself."
      },
      {
        "paragraph": "“I’m fine. I’ll do it.” Having received another blow, Shaun continued shelling the crabs for her obediently.\nHe felt like he was becoming more and more humble in front of Catherine."
      },
      {
        "paragraph": "However, when he recalled the scene of her sucking the blood from his finger, his heart fluttered."
      },
      {
        "paragraph": "Not long after, Chester brought Cindy over."
      },
      {
        "paragraph": "“Shaun, it really is you. I thought I was mistaken. ” Chester had his hands in his pockets. His gentlemanly\nface was filled with astonishment."
      },
      {
        "paragraph": "When they often had meals together in the past, Sarah always came along with Shaun, and Chester had\nonly seen Shaun putting food on Sarah’s plate a t most. He had never seen Shaun shelling crabs and\ntreating someone like a master."
      },
      {
        "paragraph": "Cindy was even more surprised. She knew how cold Shaun was during usual gatherings, so she had\nnever expected that he would treat Catherine so well."
      },
      {
        "paragraph": "Cindy secretly clenched her teeth in contempt. She thought Shaun would surely abandon Catherine. Yet,\nin the end, it was Sarah who was too useless, and she had wasted three years of her time pleasing\nSarah."
      },
      {
        "paragraph": "“Young Master Hill…” Cindy acted like she was in a dilemma. “I couldn’t believe it when I was watching\nfrom afar, but you… You’re accompanying Catherine. Does Sarah know about this? She’s still\nhospitalized. Isn’t this a bit inappropriate?”"
      },
      {
        "paragraph": "Shaun shot an icy glance at her."
      },
      {
        "paragraph": "Cindy shuddered, as if a swift blade had swept past her face. “I’m sorry. I… I may be meddling too much.\nPerhaps it’s because I have a good relationship with Sarah. She’s quite pitiful now. ”"
      },
      {
        "paragraph": "Catherine slowly took a sip of water. “I can see that your relationship with Sarah has always been very\ngood. Otherwise, how did you know that Shaun went back to Sarah’s place after every gathering three\nyears ago? You even saw the hickeys on her neck the next day.”"
      }
    ]
  },
  {
    "title": "Chapter 821 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Everyone’s expression changed. Chester’s deep-set eyes were focused on Cindy, and Shaun’s\nhandsome face had turned dark too. “When did I… leave hickeys on Sarah’s neck?”"
      },
      {
        "paragraph": "Shaun could not even touch Sarah at all. How could he leave hickeys?"
      },
      {
        "paragraph": "Cindy forced herself to stay calm and said, “ Catherine, I really don’t know what you’re talking about.”"
      },
      {
        "paragraph": "“Actually, I’m quite thankful to you,” Catherine said. “Back then, I was pregnant and put on house arrest\nby Shaun until I finally had to go and do a checkup. If it wasn’t for you, I wouldn’t have known that the\nmedia had spread the news about Freya getting hurt. And I wouldn’t even have known that Thomas had\npublicly announced that Freya was the one who seduced him. That infuriated me so much that I went\nback and smashed everything. I even quarreled with Shaun, which resulted in him pushing me to the\nground…”"
      },
      {
        "paragraph": "That was the time she lost the twins."
      },
      {
        "paragraph": "Shaun’s expression changed drastically."
      },
      {
        "paragraph": "Catherine seemed as if she had gone crazy that day. She even took a knife and tried to stab him. That\nmade him overlook how Catherine had found out about all that stuff."
      },
      {
        "paragraph": "It turned out that it was Cindy who told her."
      },
      {
        "paragraph": "If it were not for her big mouth, he might not have lost both of his children."
      },
      {
        "paragraph": "“So it was you.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "He stood up abruptly. He yanked Cindy’s arm and pressed her down on the table hard. “Who allowed\nyou to be so talkative? Is your tongue bothering you? If so, I’ll cut it off for you.”"
      },
      {
        "paragraph": "After he spoke, he took a knife from the table."
      },
      {
        "paragraph": "Cindy’s eyes widened in fear, and her whole body trembled. “I didn’t. I’m innocent. Chester, save me.”"
      },
      {
        "paragraph": "“Shaun.” Chester grabbed Shaun’s hand. “Please do me a favor.”"
      },
      {
        "paragraph": "“Do you know it was her mouth that made me lose my children?” Shaun’s eyes were cold."
      },
      {
        "paragraph": "“Forget it. Just don’t push the responsibility on others.”"
      },
      {
        "paragraph": "Catherine wiped her mouth with a napkin before she suddenly interceded for Cindy. “Cindy was just\ntelling me the truth. At that moment, I was really grateful. Otherwise, I would’ve been kept in the dark like\na fool. Now that the children are gone, it’s nobody else’s fault but ours.”"
      },
      {
        "paragraph": "Shaun’s body stiffened in embarrassment. He knew she wanted to say that losing the child was mainly\nhis fault. Thomas was the trigger, and he was the one who added insult to injury."
      },
      {
        "paragraph": "Chester took the knife away from Shaun and released Cindy from his grasp."
      },
      {
        "paragraph": "“ Shaun, we’ll head upstairs to have our meal. We won’t bother you.”"
      },
      {
        "paragraph": "Chester held Cindy’s hand and left. Cindy was still weak in the knees. She never thought Shaun would\nbe so creepy and terrifying. However, she was not at all grateful to Catherine for saving her just now. If"
      },
      {
        "paragraph": "Catherine had not said those words, she would not be taught a lesson by Shaun. She would not even…"
      },
      {
        "paragraph": "She secretly glanced at Chester’s unpredictable, handsome face, and an uneasy feeling grew in her."
      },
      {
        "paragraph": "When they entered a private room, Chester slammed the door shut and lit a cigarette. There was a trace\nof hostility on his gentlemanly face. “"
      },
      {
        "paragraph": "Cindy, that mouth of yours has been causing me a lot of trouble.”"
      },
      {
        "paragraph": "“Chester, I’m sorry. Catherine, Freya, and I are good friends. I just thought they were quite pitiful back\nthen, so I couldn’t help but tell the truth, ” Cindy explained with tears in her eyes."
      },
      {
        "paragraph": "“Forget it. Don’t take me as a fool.”"
      },
      {
        "paragraph": "Chester tapped her face lightly. He exuded a hint of coldness and hostility. “If you really care about them,\nwhy did you get so close to Sarah in the last three years? One moment, you’re feeling unfair for Sarah,\nand another, you say Catherine and Freya are your friends. Well, your heart goes out to so many\npeople.”"
      },
      {
        "paragraph": "His voice was calm, yet to Cindy, it sounded like stormy waves. It made her feel uneasy."
      }
    ]
  },
  {
    "title": "Chapter 822 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“If you weren’t useful to me, I would’ve broken up with a pretentious woman like you a long time ago.”\nChester warned her sternly, “You better stay put from now on and shut your mouth. If not, don’t even\nthink about being cast in a movie and making a comeback.”"
      },
      {
        "paragraph": "With a pale face, Cindy nodded her head obediently."
      },
      {
        "paragraph": "Catherine had utterly ruined her reputation the last time. Besides appearing in some variety shows in the\npast few months, she had yet received a casting offer for a new movie. As such, she was counting on\nChester."
      },
      {
        "paragraph": "“Chester, I have something to say… But I don’t know whether I should say it or not…” She stammered."
      },
      {
        "paragraph": "“If you think you shouldn’t, then shut your mouth,” Chester scolded."
      },
      {
        "paragraph": "“No. I just find it puzzling.” Cindy gritted her teeth. She had to finish her sentence. “Young Master Hill had\nhurt Catherine so cruelly in the past. He put her on house arrest and caused her to miscarry. He even\nsent her to the mental hospital. If I were a woman, I wouldn’t forgive him at all. But why is she suddenly"
      },
      {
        "paragraph": "… back together with him again? Doesn’t she feel uncomfortable?”"
      },
      {
        "paragraph": "“What are you trying to say?” Chester’s eyes narrowed."
      },
      {
        "paragraph": "Cindy was startled. “I’m afraid that Catherine is now trying to take revenge on Young Master Hill. This is\njust my instinct as a woman. I’m not trying t o frame her intentionally. I’m just scared that"
      },
      {
        "paragraph": "Young Master Hill will get hurt once he falls too deep in the relationship.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Go and order some food.” Chester shot her an icy glance."
      },
      {
        "paragraph": "“Okay.” Cindy nodded and ran out in a hurry to call the waiter."
      },
      {
        "paragraph": "Chester took a drag on his cigarette. He found it quite weird as well after Cindy mentioned it."
      },
      {
        "paragraph": "9:00 p.m."
      },
      {
        "paragraph": "A sports car was parked at the parking lot of Hackett Institute."
      },
      {
        "paragraph": "Catherine undid her seat belt. Just as she was about to get down the car, Shaun suddenly grabbed her."
      },
      {
        "paragraph": "His throat moved, but he did not know what to say."
      },
      {
        "paragraph": "They were having a good time during the meal. However, they became silent after Cindy came and\nmessed things up."
      },
      {
        "paragraph": "“Cathy, I’m sorry…” Shaun was filled with regret. If he knew that he would fall in love with her, he would\nnever have been so ruthless back then."
      },
      {
        "paragraph": "“Do you still hate me?”"
      },
      {
        "paragraph": "“It’d be a lie if I said I don’t hate you. ” Catherine’s eyes trembled. There was a hint of bitterness in her\neyes. “Whenever I think about those two children when I was overseas, I wanted to chew your meat off\ndesperately. When I came back, I was determined to make you guys suffer. But when you forced me to"
      },
      {
        "paragraph": "get a divorce, I realized I was still powerless to go against you guys. And now you’re here, wooing me. I\nfeel conflicted and anxious."
      },
      {
        "paragraph": "Sometimes I want to get back together with you again, but sometimes I’m really scared…”"
      },
      {
        "paragraph": "Shaun pulled her into his embrace before she could finish her sentence. He hugged her tightly. “It won’t\nhappen anymore. Trust me. I’ll never hurt you again. I screwed up last time, Cathy. Let’s have a pair of\ntwins again in the future, okay?”"
      },
      {
        "paragraph": "Catherine chuckled with her eyes downcast. She sounded helpless. “Do you think it’s that easy to have\ntwins?”"
      },
      {
        "paragraph": "“Then, we’ll have two kids. Our daughter will surely be as adorable as Suzie. ” Somehow, when Shaun\nsaid that, he suddenly longed to have a child that belonged to them both."
      },
      {
        "paragraph": "“Suzie…”"
      },
      {
        "paragraph": "Catherine found it hilarious. Suzie was his daughter from the start."
      },
      {
        "paragraph": "However, she would never let Shaun find out. A person like him did not deserve to be a child’s father."
      },
      {
        "paragraph": "“We’ll talk about this again next time.” She looked up. “You didn’t eat much tonight. Are you hungry? I\ncan go upstairs and make you some risotto.”"
      },
      {
        "paragraph": "Shaun’s eyes lit up. He thought remembering the past would make her upset. He, too, was very anxious,\nbut he did not expect her to still care for his stomach."
      },
      {
        "paragraph": "Especially when she invited him up on a night like that, he did not feel like going back."
      },
      {
        "paragraph": "Once they were upstairs, Catherine used yesterday’s leftover rice and made risotto for Shaun. There\nwere also ham, corn, and vegetables in it."
      },
      {
        "paragraph": "The whole room was filled with the fragrance of the food. Shaun devoured the whole plate of risotto. He\nused to complain that she made him risotto because she was too lazy to deal with him. However, he was\nnot picky at all that day. Having something to eat was good enough."
      }
    ]
  },
  {
    "title": "Chapter 823 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Babe, why is your cooking so delicious?” Shaun lamented again. “I want to eat it for the rest of my life.”"
      },
      {
        "paragraph": "“Yeah. You once had the chance to eat it for the rest of your life, but you drove me away.” Catherine got\nup and collected the plates. “Go back. It’s late.”"
      },
      {
        "paragraph": "When she turned around, Shaun came up from behind and tightened his arms around her waist."
      },
      {
        "paragraph": "“I don’t want to go back. I want to stay. I can sleep o n the sofa.”"
      },
      {
        "paragraph": "“Shaun, I’m not any other woman, ” Catherine said solemnly. “When I slept with you before, what I got in\nreturn was your disrespect and birth control pills. This time, I want to love myself more. I don’t want to\ngive myself away so easily.”"
      },
      {
        "paragraph": "Shaun was speechless. It was his fault for having done so many scummy things."
      },
      {
        "paragraph": "If he knew that this day existed, he would have gone back in time and punched himself a few times."
      },
      {
        "paragraph": "In the past, he had never cherished sleeping with her. Yet now, he could not even sleep with her even i f\nhe wanted to."
      },
      {
        "paragraph": "“Okay, I’ll go. But I want a kiss.” Shaun shamelessly turned her around and kissed her pink lips."
      },
      {
        "paragraph": "Catherine was a little resistant at first, but slowly, she held his waist."
      },
      {
        "paragraph": "Shaun’s kiss was long and hot."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "When the kiss ended, he was pushed out the door with his eyes still filled with lust. “Babe, I’ll bring you\nbreakfast tomorrow, okay?”"
      },
      {
        "paragraph": "“ Sure. ” Catherine then closed the door, rushed to the bathroom, and brushed her teeth, cleaning them\nthoroughly."
      },
      {
        "paragraph": "Just the thought of his mouth kissing Sarah before filled her with disgust."
      },
      {
        "paragraph": "Shaun was the opposite of her."
      },
      {
        "paragraph": "His mouth felt sweet as if he just ate honey."
      },
      {
        "paragraph": "Even after Hadley had driven over to pick him up, he kept relishing the taste in his mouth."
      },
      {
        "paragraph": "Unfortunately, the kiss was too short. It was only five or six minutes. It would have been better if it lasted\nlonger."
      },
      {
        "paragraph": "“President Hill, you look like you’re in a good mood.” Hadley could tell, so he teased boldly, “Like a young\nman who has just fallen in love.”"
      },
      {
        "paragraph": "“Like?” Shaun frowned in dissatisfaction. “When a m I not young?”"
      },
      {
        "paragraph": "As a man in love, he was very sensitive about his age, especially since Catherine was five or six years\nyounger than him."
      },
      {
        "paragraph": "“Uh, I misspoke. ” Hadley hurriedly apologized. “ What I meant is… you’ve changed a little, Eldest Young\nMaster. There was never this kind of feeling when you were dating Ms. Neeson.”"
      },
      {
        "paragraph": "“You’re right.”"
      },
      {
        "paragraph": "Shaun also realized it, but he could not understand. He had always remembered that he loved Sarah."
      },
      {
        "paragraph": "Though when he was with her, he was always unhappy."
      },
      {
        "paragraph": "Hadley’s lips moved. He originally wanted to suggest that Shaun was hypnotized, but then, he thought\nabout it. The doctor said that if he tried to recover, it might damage his brain and result in him becoming\na fool."
      },
      {
        "paragraph": "Forget it. He should just let it be. At least everything was going well."
      },
      {
        "paragraph": "At that moment, Chester called Shaun. “Is the date over? Come over for a chat.”"
      },
      {
        "paragraph": "Shaun looked at the time and agreed before he had Hadley send him to the bar Chester was at. When\nhe arrived, only Chester was there."
      }
    ]
  },
  {
    "title": "Chapter 824 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“That woman went back?” Shaun sat beside Chester. “Chester, are you going to keep tolerating that\nwoman? I’ve never had much of an impression of Cindy, but after tonight, I found that she really isn’t\ngreat. She’s not worthy of you.”"
      },
      {
        "paragraph": "“There are some things that can’t be helped.” Chester took a sip of wine. His eyes were deep. “ What\nabout you? Are you really getting back with Catherine?”"
      },
      {
        "paragraph": "“Yeah.” Shaun was in a good mood tonight. Of course, it might be better if he did not meet Cindy\nhalfway."
      },
      {
        "paragraph": "Chester looked at him worriedly. “Have you ever thought about whether Catherine sincerely wants to\nbe with you or… to get revenge on you?”"
      },
      {
        "paragraph": "The happy and handsome face immediately froze. Shaun put down his wine glass, and a frosty\nsharpness flashed in his eyes."
      },
      {
        "paragraph": "If it were anyone else, they might have been afraid. However, Chester had known him since they were\nchildren, so he understood him. He continued with a straight face, “Think about what you did to her in\nthe past because of Sarah. You put her on house arrest, forced her to divorce, pushed her down,\ncaused her to lose her children, sent her to the psychiatric hospital for treatment, and the list goes on.\nDo you think she can completely put aside the grudges in her heart until there’s no hatred left?”"
      },
      {
        "paragraph": "Shaun’s eyelids twitched with each thing Chester said. His chest felt like it was being whipped."
      },
      {
        "paragraph": "If Chester had not brought it up, he would not dare to recall that he had done so many things to hurt\nher."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“You think she’s trying to get back at me?” he said hoarsely after a long time."
      },
      {
        "paragraph": "“It’s not impossible.” Chester patted his shoulder. “ I’m just reminding you. Don’t go in too deep just to\nfind out that she’s toying with you, or maybe she has other ways to get revenge on you.”"
      },
      {
        "paragraph": "Barn."
      },
      {
        "paragraph": "The glass in his hand suddenly shattered, and bright red blood flowed out with the alcohol. Shaun’s\nhandsome face was cold. “ Impossible. She loves me. I can feel it. I didn’t love her last time and that\nwas why I went so far, but I’ll love her from now on. I’ll give her all of the best with all my heart.”"
      },
      {
        "paragraph": "“Well, if that’s what you think, then there’s nothing I can do. I’ve said what needs to be said. ”"
      },
      {
        "paragraph": "Seeing him like this, Chester snorted and handed him a tissue. “ Say, why do you and Rodney always\nbehave like that because of a woman? What’s the point? Fortunately, I’m not as terrible as you both.”"
      },
      {
        "paragraph": "“Ha! Well, who was the one who called us to go drinking the entire night when he found out that Charity\nwas having a tryst with another man.”"
      },
      {
        "paragraph": "“Don’t mention that woman to me.” Chester’s deep eyes flashed with disgust."
      },
      {
        "paragraph": "“Alright. Anyway, she’s already dead. There’s nothing to mention.” Shaun took the tissue and wiped off\nthe blood on his hands. “Have you heard about Rodney? How is he doing now?”"
      },
      {
        "paragraph": "“The failure of SKITTL’s acquisition was a blow to him, but we don’t know much about the cosmetics\nindustry, so we can’t help.” Chester sighed. “If I were to say, he should just go along with the marriage"
      },
      {
        "paragraph": "that Grandpa Derek has arranged, but he refuses. It’s probably because he wants to marry Sarah.”"
      },
      {
        "paragraph": "“I can’t compare with him when it comes to having feelings for Sarah.”"
      },
      {
        "paragraph": "Then, Shaun got up and said, “ I’m heading back. ” In the car, he leaned into the seat."
      },
      {
        "paragraph": "Would she get revenge on him? Was it possible?"
      },
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "Shaun brought breakfast over early. When Catherine came over to open the door, she was still wearing\na pink ice silk pajama and had a drowsy look on her face."
      },
      {
        "paragraph": "“Bro, it’s only 7 a.m. Why are you here so early?”"
      },
      {
        "paragraph": "“It’s not early. I got up at 6 a.m.” Shaun glanced at her chest, and his temples jumped, to which he\nimmediately walked in and closed the door."
      },
      {
        "paragraph": "He did not want other women to see her wearing nothing inside."
      },
      {
        "paragraph": "In the early morning, it was too hot and titillating for a young and vigorous man like him. “Go and\nchange your clothes. Don’t test my endurance.”"
      },
      {
        "paragraph": "Then, he turned his face and looked away."
      }
    ]
  },
  {
    "title": "Chapter 825 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine looked down, and the corners of her mouth raised. Although she should feel embarrassed, she\nhad used this trick before when they used to live in Melbourne together."
      },
      {
        "paragraph": "Heh. He acted as if he had never seen a woman before."
      },
      {
        "paragraph": "“Fine.”"
      },
      {
        "paragraph": "She half-bit her pink lips and went back to the bedroom to wash up. Then, she came out after she had\nchanged her clothes."
      },
      {
        "paragraph": "Shaun sat at the dining table with the breakfast he bought from a famous breakfast restaurant."
      },
      {
        "paragraph": "“ I asked the best chef in Forkful to cook you this breakfast. There are waffles, avocado toast, breakfast\nwrap, French toast… ” Shaun listed them one by one."
      },
      {
        "paragraph": "Catherine could tell they were delicious just by smelling the aroma."
      },
      {
        "paragraph": "Hence, she picked up a fork and started to eat. After eating for a while, she found that Shaun had not"
      },
      {
        "paragraph": "moved. “Aren’t you eating?”"
      },
      {
        "paragraph": "“I don’t have an appetite. ” Shaun was telling the truth. He was not very interested in anything other than\nher homemade food."
      },
      {
        "paragraph": "“That won’t do. You have to eat breakfast. I’ll feed you.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine raised her brows. Then, she put a piece of toast in her mouth and leaned towards him."
      },
      {
        "paragraph": "Shaun held his breath. She was so close to him that he could see her long eyelashes. She was… using\nher mouth to feed him."
      },
      {
        "paragraph": "Shaun originally had no appetite for these kinds of breakfast, but his Adam’s apple bobbed. He lowered\nhis head and bit on the other half."
      },
      {
        "paragraph": "“Is it tasty now?” The long-haired woman looked a t him with a smile. It was as if the morning sunlight\nwas shining in her eyes."
      },
      {
        "paragraph": "” It’s tasty.”"
      },
      {
        "paragraph": "Unable to resist, Shaun then pulled her to his lap and buried his face deep into her shoulder. He felt like\nCatherine was poisonous. They used to quarrel every day, so he had never noticed it. However, he now\nrealized that this woman was too good at teasing."
      },
      {
        "paragraph": "He clearly only began to like her a few days ago. Yet now, he liked her even more, or even… love."
      },
      {
        "paragraph": "It was as if he liked her a lot in the first place."
      },
      {
        "paragraph": "“Cathy, even if you want to get revenge on me, I still want to be with you.”"
      },
      {
        "paragraph": "He buried himself in the nook of her neck and murmured."
      },
      {
        "paragraph": "Catherine’s body stiffened, and she looked back at him. “What are you saying?”"
      },
      {
        "paragraph": "“I feel like I’ve done a lot of really bad and scummy things before.” Shaun cupped her small face. “"
      },
      {
        "paragraph": "Cathy, even if you hate me and want to take revenge on me, I won’t let you go.”"
      },
      {
        "paragraph": "“Shaun Hill, listen up. I do hate you, and I do want to take revenge on you. But I want to get back at\nSarah even more. I want to take you away and hold you firmly in my hand so that she will be miserable\nand unhappy.”"
      },
      {
        "paragraph": "Catherine then hugged his neck and said with calm eyes, “What do you think about my revenge method?\nIs it good?”"
      },
      {
        "paragraph": "For a moment, Shaun did not know what to say."
      },
      {
        "paragraph": "He actually hoped that Sarah would walk out of this sooner instead of living her life suffering."
      },
      {
        "paragraph": "Otherwise, he would feel bad."
      },
      {
        "paragraph": "“Forget it. I know that Sarah has been with you for twenty years. There’s no way I can compare.”\nCatherine suddenly leaned into his arms. She took the ends of her hair and swept it against his Adam’s\napple, acting like a vixen. “Of course, if it weren’t for Sarah, your illness wouldn’t have been cured. It’s\nnormal for you to feel guilty about her.” “Mmhm. ” Shaun’s throat was itching badly from her hair. He\ncould now fully understand why so many people in ancient times became muddle- headed when a\nwoman was in their arms."
      }
    ]
  },
  {
    "title": "Chapter 826 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“But…” Catherine changed the topic. “There’s someone I want to teach a lesson to. If you don’t let me\nvent my anger, I’ll have doubts about your feelings.”"
      },
      {
        "paragraph": "“Yael Chadwick.” Catherine slowly spat out the two words. Her tone sounded like she was gritting her\nteeth."
      },
      {
        "paragraph": "Shaun was shocked, but he immediately frowned. “ How did Yael offend you? Is it because I asked her to\nprotect Sarah…”"
      },
      {
        "paragraph": "“No.” Catherine glared at him with hatred. “The day you made me sign the divorce agreement, didn’t you\nlet Yael search for the marriage certificate on me? But she stripped my clothes in"
      },
      {
        "paragraph": "front of other Liona men. If Hadley hadn’t spoken u p, she would’ve stripped my pants. I will never forget\nthis shame.”"
      },
      {
        "paragraph": "Shaun’s black eyes were slightly cold. Things were very chaotic that day. All he remembered was that he\nhad gone out and only came in after hearing Hadley and Yael’s voices. However, he saw that Catherine\nwas well and fully clothed at that time…"
      },
      {
        "paragraph": "“What do you mean? You don’t believe me?” Catherine got out from his arms in anger. “I have nothing\nagainst Yael. Why would I falsely accuse a bodyguard? If you don’t believe me, you can ask Hadley and\nthe other Liona members who were there that day. If I, Catherine Jones, am lying to you, I won’t die an\neasy death.”"
      },
      {
        "paragraph": "“I won’t allow you to swear on such a vicious thing.” Shaun’s face changed as he warned."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“I have a clear conscience because I’m not lying, so I’m not afraid.” After Catherine spoke, she lost\ninterest in the breakfast on the table."
      },
      {
        "paragraph": "“Shaun, you’re the one who says you like me and won’t let go. But what do you like about me?"
      },
      {
        "paragraph": "Sleeping with me? You don’t have the slightest trust in me at all. I can’t even compare to a Liona\nmember.”"
      },
      {
        "paragraph": "Catherine began to lose her temper."
      },
      {
        "paragraph": "“ It’s not that I don’t believe you…” Although that was what his mouth said, his heart was not sure. Yael\nwas wary of Catherine because of Sarah, so it was not impossible that Catherine was doing this because\nof a personal grudge."
      },
      {
        "paragraph": "However, to Catherine, his hesitation added fuel to the fire."
      },
      {
        "paragraph": "“Shaun, why don’t you go and check it. I don’t want to listen to your perfunctory words.” Catherine\nsuddenly turned away and clenched her fists tightly. She had a look of restraint on her face. “I don’t want\nyou to coax me either. Just bring over Yael after you’ve investigated.”"
      },
      {
        "paragraph": "Then, she pulled him up from the chair and pushed him out."
      },
      {
        "paragraph": "Shaun’s head hurt. She was quite sweet just a while ago, and she even fed him toast with her mouth."
      },
      {
        "paragraph": "How did he get kicked out in the blink of an eye?"
      },
      {
        "paragraph": "He thought of the reason for the quarrel."
      },
      {
        "paragraph": "His eyes became cold, and he immediately called the two members of Liona who were there that day t o\nthe office."
      },
      {
        "paragraph": "Before long, the two members of Liona, Irving and Roy, showed up in his office. When they arrived, they\nsaw Hadley there too."
      },
      {
        "paragraph": "“Eldest Young Master, did you call us over for urgent matters?” Irving asked respectfully."
      },
      {
        "paragraph": "“I called all of you here today just to ask you one thing. ” Shaun tapped his desk with his hand. His calm\nvoice made the three people in the office uneasy. “You will answer me truthfully, right?”"
      },
      {
        "paragraph": "“Yes.” Irving and Roy immediately said, “Eldest Young Master Hill, as long as we are members of Liona,\nwe belong to Liona even if we die. We will only listen to you.”"
      },
      {
        "paragraph": "“Then, I’ll ask you. What happened that day when I asked Catherine Jones to sign the divorce papers?”\nShaun suddenly stood up. His eyes were intimidating. “What did Yael do?”"
      },
      {
        "paragraph": "Irving and Roy were similarly shocked. They were so nervous that they did not know what to do."
      },
      {
        "paragraph": "Shaun was the god of Liona, but Yael was Master Ziegler’s woman, so they just turned a blind eye to it.\nAfter all, Catherine was just a woman that Shaun did not want, but why was he suddenly asking about it\nnow? Could the rumors be true? Was Eldest Young Master Hill planning to get back with her?"
      },
      {
        "paragraph": "“Hadley, you speak first.” Shaun turned to Hadley. “ Did Yael take off Catherine’s clothes?”"
      }
    ]
  },
  {
    "title": "Chapter 827 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Hadley looked up in surprise. It seemed like Ms. Jones was settling her old scores. If it were him, he\nwould be unhappy as well. “ I can’t say either. That time, I saw Yael take off Ms. Jones’s coat, revealing\nthe straps inside. She lifted her clothes, and many areas were… exposed. I only stopped her when she\nwas about to take off Ms. Jones’s pants. But Yael thought I was doubting her for doing a bad job at\nsearching, so she wanted me to do it instead. That was when you came in.”"
      },
      {
        "paragraph": "Shaun clenched his fists and stared at Irving and Roy. “Tell the truth.”"
      },
      {
        "paragraph": "Irving was so scared that he blurted out, “ It is as Assistant Young says.”"
      },
      {
        "paragraph": "“ So… Yael was trying to take off Catherine’s pants?” Shaun narrowed his eyes."
      },
      {
        "paragraph": "Roy nervously choked on his saliva. “Yael said that she was afraid Catherine Jones was hiding it inside\nher pants…”"
      },
      {
        "paragraph": "Before he could finish, Shaun threw him a fierce punch."
      },
      {
        "paragraph": "Irving and Roy were beaten black and blue, but no one dared to fight back or make a peep."
      },
      {
        "paragraph": "“So you saw everything.” The veins in Shuan’s arms bulged. These people had seen his woman, and he\nwanted nothing more than to pluck their eyes out."
      },
      {
        "paragraph": "“We… We didn’t.” Irving and Roy were shaking. They did not dare to admit it even if it meant death."
      },
      {
        "paragraph": "“How could you not have seen her? You two were the ones holding her down. You must have seen it\nvery clearly.” Shaun stepped on their hands ruthlessly. “Why didn’t you say anything at that time? Even if\nI wanted to divorce Catherine, she was still my ex-wife. How dare you humiliate her?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“We’re sorry, Eldest Young Master. ” The two men knelt on the ground and bowed. “At that time, you\nwere very disgusted at Ms. Jones. We thought you hated and despised her, and since Yael is our\ncolleague, we thought we could… turn a blind eye.”"
      },
      {
        "paragraph": "Shaun’s blood boiled."
      },
      {
        "paragraph": "He knew they were telling the truth. It was because he looked down on Catherine that they dared to\nhumiliate her."
      },
      {
        "paragraph": "At the end of the day, it was because of the stupid things he did. When Catherine brought it up earlier, he\nwas skeptical. He thought that she wanted revenge on Yael because she was dissatisfied."
      },
      {
        "paragraph": "Now that he thought about it, he simply did not deserve to say that he liked her."
      },
      {
        "paragraph": "How many stupid things had he done to hurt her?"
      },
      {
        "paragraph": "On one hand, he said that his feelings for her were a s deep as the ocean, that he would change in the\nfuture and love her for the rest of her life. However, he did not believe in her at all. He did not even place\nher above a member of Liona."
      },
      {
        "paragraph": "It was no wonder she was so angry. He deserved it."
      },
      {
        "paragraph": "“Fine. ” The two people ran out quickly as if they were freed."
      },
      {
        "paragraph": "“Wait,” Shaun spoke out. “The two of you did something wrong this time, so go to Liona’s punishment\nroom to be punished of your own accord. In the future, you’ll be as respectful to Catherine as you are to\nme. She is my woman.”"
      },
      {
        "paragraph": "“Yes. We’ll go at once.”"
      },
      {
        "paragraph": "The two people were stunned. Yet, at the same time, they secretly complained. They originally thought\nSarah was the one, but it seemed they had been holding on to the wrong person. It was all Yael’s fault.\nShe was the one who caused this."
      },
      {
        "paragraph": "In the afternoon."
      },
      {
        "paragraph": "Catherine was in the office when Shaun called. “ Catherine, come down. I’m downstairs. I investigated it.\nI’ll bring you to Yael.”"
      }
    ]
  },
  {
    "title": "Chapter 828 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“You really investigated it?” Catherine scoffed. “ It seems like you really didn’t believe me.”"
      },
      {
        "paragraph": "Shaun could not find the words to reply to her."
      },
      {
        "paragraph": "He was exasperated. He completely understood what it meant to shoot himself in the foot."
      },
      {
        "paragraph": "“As expected. The internet said that if a dominant president falls in love with me, I can say anything, and\nhe’ll choose to believe me unconditionally. But it turns out to be false. ” Catherine sighed quietly. “ It’s\nunderstandable. You used to believe whatever Sarah told you, but you never believed anything I said. If it\nwere Sarah, everything would be different.”"
      },
      {
        "paragraph": "“I’m sorry…” Shaun’s heart moved."
      },
      {
        "paragraph": "Yes. Every time she fought with Sarah, he would always choose to believe Sarah unconditionally.\nHowever, after this time, he realized there were perhaps times that he had misunderstood her in the\npast."
      },
      {
        "paragraph": "Maybe Sarah lied as well. After all, he did not expect Yael to do something like this as he was right\noutside the door that day."
      },
      {
        "paragraph": "“I’m coming down. I’ll take my own revenge for that day,” Catherine suddenly said coldly."
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "Shaun waited downstairs for ten minutes before Catherine got into the car."
      },
      {
        "paragraph": "“Cathy, this is a gift I picked out for you on the way here.” Shaun handed her a box."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine opened it and saw that it was a pair of diamond drop earrings."
      },
      {
        "paragraph": "“I noticed you looked quite beautiful wearing earrings the last time,” Shaun explained tenderly."
      },
      {
        "paragraph": "“Is this an apology gift?” Catherine asked directly. “…Yes.” Shaun bit the bullet and answered honestly."
      },
      {
        "paragraph": "“ I don’t like diamond earrings. ” Catherine threw the box over. “I like gold. Diamonds are just polished\nstones, and they’re very common. It’s very sought after because some women say that diamonds\nrepresent love and loyalty. Ha! Love can’t be proven by something like that. Thinking about it, gold is still\nworth more. It can be exchanged globally, and it rises in value. Like what women often say, between men\nand money, money is more reliable.”"
      },
      {
        "paragraph": "Shaun was speechless."
      },
      {
        "paragraph": "He felt that he had deeply offended this woman today."
      },
      {
        "paragraph": "Though when he thought about it, it was Yael’s fault. Now, all he wanted was to teach Yael a lesson."
      },
      {
        "paragraph": "“Okay. I’ll give you gold in the future, ” he said helplessly after a while."
      },
      {
        "paragraph": "He would show her with his actions that between men and money, he was also quite reliable."
      },
      {
        "paragraph": "Before long, the car drove into a courtyard on Sherman Mountain."
      },
      {
        "paragraph": "Although it looked a bit old here, the sculptures on the corridor looked older."
      },
      {
        "paragraph": "Catherine looked around, and Shaun explained to her, “This is Liona’s headquarters.”"
      },
      {
        "paragraph": "She was slightly stunned. She did not expect Shaun t o bring her directly to Liona’s headquarters. For\nmany people, this was the most mysterious place in the country. It was said that many experts around\nthe world gathered here."
      },
      {
        "paragraph": "After the car was parked, Irving limped over and opened the door."
      },
      {
        "paragraph": "Catherine looked at him. Although the man’s face was bruised and swollen, she still recognized him as\none of the people who restrained her during the divorce. However, the man immediately said in fear, “Ms.\nJones, I was blind before. Please forgive me.”"
      }
    ]
  },
  {
    "title": "Chapter 829 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“It’s fine. I know you were just listening to orders.” Catherine glanced at Shaun. “Why did you beat him up\nlike that? Weren’t they just heeding your orders?”"
      },
      {
        "paragraph": "Shaun’s heart hurt from all the holding in, but he did not dare to say a word because she was right."
      },
      {
        "paragraph": "Irving looked at Shaun’s defeated expression, and his jaw almost fell to the ground in astonishment. This\nwas his first time seeing Eldest Young Master Hill so obedient to a woman. Not even Sarah had received\nthis kind of treatment before. It seemed like he had to respect Ms. Jones in the future."
      },
      {
        "paragraph": "“Eldest Young Master, Yael is in the punishment room. ” Roy also ran over, trembling. His bum was\nbeaten until it bled, and it was still hurting."
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "Shaun took Catherine and walked in."
      },
      {
        "paragraph": "In the punishment room."
      },
      {
        "paragraph": "Yael was brought here as soon as she was called back. Her phone was taken away immediately, and the\nuneasy feeling in her heart grew more and more."
      },
      {
        "paragraph": "“Get out of the way. I need to go to the hospital,” Yael said sternly to the people at the door. “The Eldest\nYoung Master has arranged for me to protect Ms. Neeson. Don’t waste my time here.”"
      },
      {
        "paragraph": "“No. You have to wait here. The Eldest Young Master will come in a while, ” the gatekeeper said in a low\nvoice."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Why did he call me here? I didn’t do anything wrong,” Yael yelled angrily."
      },
      {
        "paragraph": "“Is that so? Are you sure you didn’t do anything wrong?”"
      },
      {
        "paragraph": "Shaun kicked open the door and strode in with Catherine. His handsome face was cold."
      },
      {
        "paragraph": "“Eldest Young Master…” Yael had a bad feeling when she saw Catherine beside him. However, as his\nsubordinate, she did not dare to shout. She could only feel her heart ache for Sarah, who was alone in\nthe hospital."
      },
      {
        "paragraph": "After all, they were all women. She felt that the Eldest Young Master was really too heartless."
      },
      {
        "paragraph": "Then, Irving and Roy walked in, bruised and battered, and said with hints of resentment, “Yael, the\nEldest Young Master already knows what you did when we went to Ms. Jones to get her to sign the\ndivorce papers.”"
      },
      {
        "paragraph": "Yael’s pupils trembled. She had almost forgotten that incident and did not expect Catherine to remember\nit still. In an instant, her hatred of Catherine suddenly intensified. “What did I do? I don’t even know\nmyself. It was the Eldest Young Master who told me to search her.”"
      },
      {
        "paragraph": "“Yeah?” Catherine smiled. “Then, do you still remember when you said in my ear that you were going to\nstrip me bare and let this handsome guy take a good look at my naked body?”"
      },
      {
        "paragraph": "Shaun’s face changed abruptly. If looks could kill, Yael would have died countless times. “You said such\na thing?”"
      },
      {
        "paragraph": "“I didn’t. You’re slandering me, ” Yael denied loudly. “Ms. Jones, you can’t frame me like this just because\nI’m protecting Ms. Neeson. I’m also working according to Eldest Young Master’s orders.”"
      },
      {
        "paragraph": "Catherine chuckled and looked at Shaun. “She’s hinting to me that if I want to blame someone, I should\nblame you. It has nothing to do with her. ”"
      },
      {
        "paragraph": "“I’m not.” Yael got a fright and shook her head hard."
      },
      {
        "paragraph": "However, Shaun had also heard that. He stepped forward and kicked Yael hard. Yael fell to the ground\nand could not stand up due to the pain all over her body."
      },
      {
        "paragraph": "“Eldest Young Master, you can’t do this.” Yael lay o n the ground with a pale face and said, “It was you\nwho told me to search for the marriage certificate, and it was also you who asked me to protect Ms.\nNeeson. I didn’t do anything wrong. Ms. Jones clearly hasn’t liked me since the start. She can’t deal with\nMs. Neeson, so she’s causing trouble for m e instead. You’re acting out of line.”"
      },
      {
        "paragraph": "Shaun’s eyes narrowed, and the muscles of his body tensed up in anger."
      },
      {
        "paragraph": "Catherine’s delicate body suddenly leaned against him. She tilted her head up and smiled at him. “ Didn’t\nyou say that members of Liona are subservient to the person in charge of the Hill family? It seems that\nyour subordinate isn’t very good.”"
      },
      {
        "paragraph": "Shocked, Yael hurriedly defended herself, “Don’t be ridiculous. The Chadwick family has been loyal to\nthe Hill family since my grandfather’s generation. ”"
      }
    ]
  },
  {
    "title": "Chapter 830 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Well… I’m Shaun’s girlfriend. Isn’t your tone now disrespectful to me? Or is it because I’m not Sarah, so\nyou hate me and treat me with hostility. You even looked down on Elle for protecting me. Maybe you’ve\nprotected Sarah for so long that you now see her as your true master?” Catherine raised her eyebrows.\nShe had hit the nail on the head."
      },
      {
        "paragraph": "“No.” Yael’s face went pale."
      },
      {
        "paragraph": "In Liona, the most taboo act was disloyalty to the Hill family, and the consequences to that were very\nserious. “Ms. Jones, why are you slandering me like this? I have no grudge against you. I’m just a lowly\nbodyguard.”"
      },
      {
        "paragraph": "“You’re a member of Liona, so you’re not as simple as a bodyguard. You think too little of yourself.”\nCatherine smiled and asked Shaun, “May I be so bold as to ask you a question? How long has Yael\nprotected Sarah?”"
      },
      {
        "paragraph": "Shaun frowned. “ Including the time before Sarah disappeared, around seven or eight years.”"
      },
      {
        "paragraph": "“Seems like she has been protecting Sarah since she was very young.” Catherine pointed out."
      },
      {
        "paragraph": "Yael quickly understood her point. “Although I’ve protected Ms. Neeson for a long time, it has"
      },
      {
        "paragraph": "nothing to do with time. I obey Liona’s commands.”"
      },
      {
        "paragraph": "Shaun rubbed his brows. He suddenly realized that h e had been negligent. Since Sarah used to be the\nmost important person to him, he told Liona to arrange for the most attentive person to take care o f her.\nThat was Yael."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Later, after Sarah returned, he said he wanted to arrange a bodyguard for her. Sarah proposed the\nbodyguard to be Yael because she was familiar with her, and so, he agreed."
      },
      {
        "paragraph": "However, he had forgotten that the longer two people were together, the easier it was for them to\ndevelop their master-servant relationship. It was just like Elle and Aunty Yasmine with Catherine."
      },
      {
        "paragraph": "Yael had been with Sarah since she was as clean as a blank sheet of paper, so Sarah naturally meant\nmore to her than normal."
      },
      {
        "paragraph": "“Yael, that’s enough. It’s a fact that you hurt Catherine behind my back. You’ll have to accept Liona’s\npunishment, ” Shaun ordered coldly."
      },
      {
        "paragraph": "“Can I do it? I’m a girl, so I’m not used to seeing all those blood and injuries. I don’t like violence.”"
      },
      {
        "paragraph": "Catherine’s voice was soft and gentle. It made people want to listen to her."
      },
      {
        "paragraph": "“What do you want to do?” Shaun asked indulgently."
      },
      {
        "paragraph": "“Give her a taste of her own medicine.” Catherine looked at Yael, whose cheeks suddenly changed color.\n“Since she made others look at me that day, I’ll let her taste the same humiliation today. Some people\nwon’t be able to understand until they’ve experienced it for themselves.” Shaun was stunned but nodded\na moment later. “Do as you please.”"
      },
      {
        "paragraph": "“No.” Yael had a bad feeling about it. “Eldest Young Master, please just use Liona’s punishment. No\nmatter how many whips or how many canes you give, I can persevere.”"
      },
      {
        "paragraph": "“Yael, you would rather suffer physical pain than endure being stripped naked in full view of the public.\nThis shows that you understand this humiliation, so why did you humiliate me like that i n the first place?”\nCatherine sneered. “Don’t do unto others what you would not have them do unto you. Don’t you\nunderstand this truth?”"
      },
      {
        "paragraph": "“I didn’t do it. You’re falsely accusing me.” Yael glared at her. The hatred in her eyes could no longer be\nconcealed."
      },
      {
        "paragraph": "“Everyone has already confessed. You’re the only one not admitting to it. How interesting.” Catherine\ntraced Shaun’s palm with her fingers. “ What do you think?”"
      },
      {
        "paragraph": "“We’ll do as you say. Lock Yael up.”"
      },
      {
        "paragraph": "Then, Shaun turned around and walked out. “I’m not interested in watching."
      },
      {
        "paragraph": "“Me neither…” Irving and Roy were also about to slip away."
      },
      {
        "paragraph": "“Wait. ” Catherine stopped them with a grin. “You were very happy watching that day, which shows you\ndon’t hate watching women’s bodies. In that case, stay and have a look.”"
      },
      {
        "paragraph": "Irving and Roy immediately turned pale."
      },
      {
        "paragraph": "Shaun simply glanced at them coldly and went out."
      },
      {
        "paragraph": "Soon, Yael was tied to a pillar by Liona’s enforcers. No matter how she struggled, no one heeded her."
      },
      {
        "paragraph": "Catherine asked for a pair of scissors and slowly cut Yael’s clothes, piece by piece."
      },
      {
        "paragraph": "“Catherine Jones, I’ll never forgive you, ” Yael said in a low voice. Her gaze was hideous and twisted. “\nDon’t be complacent. Eldest Young Master just wants to play with you because he has an obstacle in"
      },
      {
        "paragraph": "that aspect. He can’t touch any other woman except for you. He’s only interested in you because o f that.\nDo you understand? You’re just a tool for him to satisfy his physical needs.”"
      }
    ]
  },
  {
    "title": "Chapter 831 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine froze, and surprise flashed in her eyes."
      },
      {
        "paragraph": "However, Yael thought that she was provoked, so she said viciously, “If it were possible with Ms."
      },
      {
        "paragraph": "Neeson, he wouldn’t even look for you. If you don’t believe me, you can secretly check it yourself. Once\nhe gets better, you’ll be of no value to him. You better save some face for me, or I won’t let you off.”"
      },
      {
        "paragraph": "“Is that so?” Catherine took a deep breath and nodded incredulously. “I’ll go ask Shaun later.”"
      },
      {
        "paragraph": "“Don’t you dare.”"
      },
      {
        "paragraph": "Yael was frightened. She had only wanted to provoke Catherine. If Shaun found out that she told\nCatherine such a thing, he would definitely kill her. After all, men cared about their pride a lot."
      },
      {
        "paragraph": "Catherine chuckled. Yael was afraid, which meant that what she said might be true."
      },
      {
        "paragraph": "She never expected that nothing happened between Shaun and Sarah despite them being together for\nso long."
      },
      {
        "paragraph": "Tsk. This was quite interesting."
      },
      {
        "paragraph": "His brain was hypnotized, but his body instinctively resisted?"
      },
      {
        "paragraph": "Somehow, her hatred for this man suddenly softened a little, and she was not as revolted by him as\nbefore."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Yael, you don’t understand why he’s only interested in me. It’s because he has me in his heart.”"
      },
      {
        "paragraph": "Catherine’s scissors slowly cut down her trousers."
      },
      {
        "paragraph": "Yael was no longer in the mood to talk to her because she was screaming out of shame."
      },
      {
        "paragraph": "“Come and take a good look. Don’t look away. I’ll tell Shaun if anyone dares to move away.”"
      },
      {
        "paragraph": "Catherine glared at the men on the side."
      },
      {
        "paragraph": "The group of tall men broke out in cold sweat and flushed red."
      },
      {
        "paragraph": "Sh*t. They had spent a lot of time in the punishment room before, but this was their first time\nencountering such a dilemma."
      },
      {
        "paragraph": "However, they had to admit that Yael had a good figure, and she was wearing something very sexy\nunderneath. They could not tell at all."
      },
      {
        "paragraph": "More than ten minutes later, Catherine came out of the room with a smile on her face."
      },
      {
        "paragraph": "Seeing her in a good mood, Shaun somehow loosened up a lot."
      },
      {
        "paragraph": "He strode over, and Catherine suddenly grabbed his hand. “Thank you. I feel much better.”"
      },
      {
        "paragraph": "“I’m sorry. It was my fault.” Shaun apologized sincerely. In the end, it was him who gave others the\nopportunity to hurt her."
      },
      {
        "paragraph": "Catherine looked at him with an odd gaze."
      },
      {
        "paragraph": "Frankly speaking, if Shaun could do it with other women as well, he might not have returned to her s o\neasily today."
      },
      {
        "paragraph": "“Why are you looking at me like that?” Shaun was puzzled by her look."
      },
      {
        "paragraph": "“Eldest Young Master Hill.”"
      },
      {
        "paragraph": "At that time, a tall and burly middle-aged man strode over. “I heard that Yael offended you?”"
      },
      {
        "paragraph": "“Yes. Master Ziegler, you should train Yael well so that she remembers who her true master is.”"
      },
      {
        "paragraph": "Then, Shaun pulled Catherine and walked away."
      }
    ]
  },
  {
    "title": "Chapter 832 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“This is…” Catherine could not help but turn around to look at the man."
      },
      {
        "paragraph": "Before she could get a good look, she was pulled back by a powerful force."
      },
      {
        "paragraph": "Shaun looked at her dominantly. “You’re not allowed to look at other men curiously.”"
      },
      {
        "paragraph": "Catherine was speechless. “I don’t have a hobby of liking middle-aged men. I just thought he had a\nstrong presence.”"
      },
      {
        "paragraph": "“He’s Liona’s master and one of Liona’s bosses. He only follows my orders.”"
      },
      {
        "paragraph": "Shaun explained to her, “To become a master in Liona, one’s skills have to be the top in the country. The\npeople who join Liona also have to undergo tons of obstacles, so it’s only natural that Master Ziegler’s\npresence is very strong.”"
      },
      {
        "paragraph": "“Oh.” Catherine nodded. “By the way, I cut up all of Yael’s clothes inside. I guess she’ll hate me a lot.”"
      },
      {
        "paragraph": "“She won’t dare.” A chilling coldness was seething i n Shaun’s eyes. “You’re my woman. Hating you is"
      },
      {
        "paragraph": "equivalent to hating me. Those who dare to turn their backs on me will die with nothing left of them."
      },
      {
        "paragraph": "Catherine secretly looked at Shaun. All those in power seemed to have a common fault — they thought\nno one would dare to betray them. They thought everyone should be loyal and afraid of them, but they\ndid not know that the human mind was the hardest to grasp."
      },
      {
        "paragraph": "“I’m just reminding you. Since Yael dared to humiliate me before your eyes, it means that between you\nand Sarah, she might care about Sarah more. Don’t get me wrong. I’m not deliberately targeting her"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "since I’ve already had my revenge earlier. I just hope you keep an eye out.”"
      },
      {
        "paragraph": "Catherine said frankly."
      },
      {
        "paragraph": "Shaun could not help but look at her and smile. “ Are you concerned about me?”"
      },
      {
        "paragraph": "“Duh. Not that I’m back with you, I don’t want you to get unlucky.” Catherine lowered her head and said."
      },
      {
        "paragraph": "“I won’t.” Shaun held her tightly. “Babe, in the future, I will protect you with my power.”"
      },
      {
        "paragraph": "Instead of being the one who always hurt her. Shaun made a promise in his heart."
      },
      {
        "paragraph": "In the punishment room."
      },
      {
        "paragraph": "Master Ziegler opened the door and saw Irving untying Yael."
      },
      {
        "paragraph": "Irving’s jacket was draped over Yael. Her upper body was covered, but the lower half was exposed."
      },
      {
        "paragraph": "Fabric was scattered all over the floor. It was clear at a glance that they were women’s clothes."
      },
      {
        "paragraph": "“Master…”"
      },
      {
        "paragraph": "Yael’s tears poured out as soon as she saw him. “ Catherine cut all my clothes off. They all saw me.”"
      },
      {
        "paragraph": "“What happened?” Master Ziegler’s face was dark. “ When did Liona come up with this kind of\npunishment?”"
      },
      {
        "paragraph": "He thought it would be two whips or a few strokes o f the cane at most."
      },
      {
        "paragraph": "Irving quickly explained, “ It was the Eldest Young Master’s orders. He said that Yael took off Ms."
      },
      {
        "paragraph": "Jones’s clothes in the past, so Ms. Jones was just giving her a taste of her own medicine."
      },
      {
        "paragraph": "Master Ziegler took off his coat and threw it at Yael. “Come with me.”"
      },
      {
        "paragraph": "Yael sobbed and followed Master Ziegler. Every step she took, she felt the people behind her looking at\nher weirdly."
      },
      {
        "paragraph": "It was not until Yael and Master Ziegler left that they started to discuss in the punishment room."
      },
      {
        "paragraph": "“It’s no wonder Yael could become Master Ziegler’s woman. I never realized before, but after she was\nstripped today, I found out that she’s really lewd.”"
      },
      {
        "paragraph": "“Keep your voice down. Hey, do you think we should tell the Eldest Young Master about Master Ziegler\nand Yael’s relationship?”"
      },
      {
        "paragraph": "“ I don’ t think that’s necessary. Master Ziegler’s relationship with Eldest Young Master isn’t ordinary.\nWhat if Eldest Young Master thinks we’re trying to sow discord? Besides, didn’t you see how annoyed\nMaster Ziegler was just now?”"
      }
    ]
  },
  {
    "title": "Chapter 833 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“That’s true. Yael is just a woman.”"
      },
      {
        "paragraph": "In the room."
      },
      {
        "paragraph": "Master Ziegler had just walked in."
      },
      {
        "paragraph": "Yael shut the door behind them and ripped off his jacket before she hugged him around the waist"
      },
      {
        "paragraph": "from behind. “Chance, I want to die! I can’t continue living in this life anymore.”"
      },
      {
        "paragraph": "Master Ziegler turned around. When he saw Yael’s unclothed appearance, a hint of grimness flashed in\nhis dark eyes."
      },
      {
        "paragraph": "“Don’t be ridiculous.” Chance Ziegler said coldly, “ I’ve warned you long ago that Sarah Neeson is just\nsomeone you protect. Why did you interfere in the personal fuel between her and Catherine Jones? All\nyou have to do is perform the task that Eldest"
      },
      {
        "paragraph": "Young Master arranged for you.”"
      },
      {
        "paragraph": "“But I was really falsely accused.” Yael sobbed.“ I was just following the Eldest Young Master’s orders to\nsearch her body, but Catherine secretly harbored"
      },
      {
        "paragraph": "a grudge against me. Why did she have to take it out on me because she has a grudge against Ms.\nNeeson? Eldest Young Master too. When he was on good terms with Ms. Neeson, he could pluck out the\nmoon from the sky, but when he’s with Catherine, all of his orders became our fault. It’s too hard to be\nsomeone else’s subordinate.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Yael, shut up.” Chance warned in a low voice."
      },
      {
        "paragraph": "“I’m just sad and can’t hold back. Chance, you don’t understand the feeling of being stripped naked in\nfront of so many men.”"
      },
      {
        "paragraph": "Yael burst into tears. “I can’t forget their look. They… They kept staring at me so disgustingly. I feel so\ndirty. I want to die.”"
      },
      {
        "paragraph": "After that, she turned and threw herself at the door. “Yael, don’t be ridiculous. You’re not dirty.”"
      },
      {
        "paragraph": "Chance immediately grabbed her and pulled her back into his arms tightly."
      },
      {
        "paragraph": "“Chance, don’t stop me. What should I do? I don’t deserve you.” Yael cried out as she fell into his chest."
      },
      {
        "paragraph": "“Don’t be silly. You’re the little girl I grew up watching.” Chance gently brushed her hair."
      },
      {
        "paragraph": "“Chance, hold me. Otherwise, I’ll feel so bad. ” Yael suddenly lowered her head and pulled the clothes on\nhis chest haphazardly."
      },
      {
        "paragraph": "Then, she kissed him."
      },
      {
        "paragraph": "Chance was a middle-aged man. Faced with her young and passionate body, he was soon unable to\nresist himself."
      },
      {
        "paragraph": "When it was over, Yael leaned into his chest and murmured with her eyes closed, “Chance, I feel so tired\nsometimes. I always have to listen to the Eldest Young Master. I’m living like… like a dog. ”"
      },
      {
        "paragraph": "“Don’t speak nonsense. We’re indebted to the Eldest Young Master. If not for the Hill family fostering us,\nwe wouldn’t be here today.”"
      },
      {
        "paragraph": "Chance gripped her shoulders. “You shouldn’t go to Sarah Neeson’s side for the time being.”"
      },
      {
        "paragraph": "Yael panicked. “But Ms. Neeson really needs…”"
      },
      {
        "paragraph": "“Yael, you have to remember that Sarah is only someone you’re protecting.” Chance reminded her. “If\nyou keep this up, you’ll easily be expelled from Liona. You know how painful the price of leaving Liona\nwill be.”"
      },
      {
        "paragraph": "A chill washed over Yael. If she left Liona, her muscles and tendons would have to be severed, she\nwould lose her martial arts, and her money would be confiscated too."
      },
      {
        "paragraph": "For people like them who practiced martial arts their entire lives, losing their martial arts would be\nequivalent to being crippled."
      },
      {
        "paragraph": "She gritted her teeth secretly as hatred overflowed from her eyes."
      },
      {
        "paragraph": "She would definitely take revenge for this."
      },
      {
        "paragraph": "In the evening, not long after Yael left, Chance received a call from Shaun again."
      },
      {
        "paragraph": "Shaun said directly, “I’ll give you two choices. One, transfer Yael out of the country. Two, expel Yael from\nLiona.”"
      },
      {
        "paragraph": "Chance’s face changed in horror. “Eldest Young Master, Yael only made a small mistake. I’ve already\ncriticized her. Isn’t it too serious for you to do that?”"
      }
    ]
  },
  {
    "title": "Chapter 834 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun’s voice was slightly cold. “Master Ziegler, don’t think I don’t know about your relationship with\nYael.”"
      },
      {
        "paragraph": "Chance was shocked. He always thought that Shaun did not know. “Eldest Young Master, I…”"
      },
      {
        "paragraph": "“ I understand. Yael is young and beautiful, but at your age, what kind of woman have you not seen?”\nShaun lowered his voice. “Yael is no longer completely loyal to me. I don’t trust her to remain in Liona.”"
      },
      {
        "paragraph": "Chance smiled bitterly. Yael was different as he had watched her grew up. When she grew from that little\ngirl into a graceful woman that loved him, something in him that had settled for many years suddenly\nseemed to come alive."
      },
      {
        "paragraph": "“Master Ziegler, are you sad?” Shaun suddenly asked."
      },
      {
        "paragraph": "“No, Eldest Young Master. She’s just a woman. However, I’m afraid that expelling her from Liona like that\nwill cause criticism from others. Let’s transfer her out of the country, ” Chance said cautiously. As a\nmaster of Liona, he was not allowed to be emotional."
      },
      {
        "paragraph": "“Okay, then I’ll go with your arrangement. Master Ziegler, I’m doing this out of respect for you.”"
      },
      {
        "paragraph": "Then, Shaun hung up the phone."
      },
      {
        "paragraph": "Chance tightened his grip on his phone. After a while, he called Yael. “Pack up and go to Country X for a\nmission. I’ll go see you when I have time.”"
      },
      {
        "paragraph": "Yael was shocked. “What do you mean? I don’t want to go to Country X. What do you mean you’ll come\nand see me when you have the time? Won’t I be able to come back anymore?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“It’s the Eldest Young Master’s orders. You’ve touched a nerve in him. The Eldest Young Master\nsuspects that you’re no longer loyal enough.” Chance smiled bitterly. “He wanted to expel you from Liona\nat first, but he gave me a choice, so I chose to let you leave the country. Yael, listen to m"
      },
      {
        "paragraph": "e. Country X’s science and technology are well- developed, and the environment there is also good. I t\nwon’t be tough going there to carry out your mission.”"
      },
      {
        "paragraph": "“I don’t want to go to such a faraway place, ” Yael said hysterically. “The Eldest Young Master has\nalready given me the harshest punishment. Why is he still treating me like this? Does the Chadwick\nfamily have to live like dogs for generations to be loyal to the Hill family?”"
      },
      {
        "paragraph": "“Shut up.” Chance warned. “I’ll bring you back after a few years when his anger subsides.”"
      },
      {
        "paragraph": "“It won’t. As long as Catherine Jones is around, she definitely won’t let me come back. Chance, I can’t\nbear to leave you.” Yael cried."
      },
      {
        "paragraph": "“…I’ll visit you often.” Chance hung up the phone, upset."
      },
      {
        "paragraph": "In the hospital."
      },
      {
        "paragraph": "Sarah was restless."
      },
      {
        "paragraph": "Ever since Yael was called away in the morning, she had not called once. This gave Sarah a bad feeling."
      },
      {
        "paragraph": "Rodney also did not come today, and he left as soon as he came yesterday. He was always in a hurry."
      },
      {
        "paragraph": "She used to be a delicate flower in everyone’s palm. Every moment, whether it was Shaun, Rodney, or\nChester, they all surrounded her. Yet now, only a caregiver was left."
      },
      {
        "paragraph": "“Ms. Neeson, I’ve peeled a plate of apples for you"
      },
      {
        "paragraph": ".” The caregiver fawningly handed over a plate."
      },
      {
        "paragraph": "“Get lost.” Sarah knocked over the plate angrily."
      },
      {
        "paragraph": "The caregiver also became angry. “Fine, I will. I’m a human too. I’m only taking care of you because\nyou’re paying me, but money can be earned anywhere. I don’t have to earn it from you. I’ve really had\nenough of your horrible temper. It’s no wonder Eldest Young Master Hill can’t stand you.”"
      },
      {
        "paragraph": "With that, she turned to pack her stuff and left."
      },
      {
        "paragraph": "“You’re all snobs.” Sarah cursed behind her, but the caretaker did not care about her at all. All of a\nsudden, she was the only one left in the ward."
      },
      {
        "paragraph": "She panicked and hurriedly dialed Shaun’s phone number. When it connected, she immediately cried. “\nShaun, hurry up and come over. I’m alone in the hospital. Yale was suddenly called away in the morning,\nand the caretaker bullied me and just left. I miss you so much…”"
      }
    ]
  },
  {
    "title": "Chapter 835 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Ms. Neeson, President Hill is in a meeting.” Hadley interrupted her."
      },
      {
        "paragraph": "“Assistant Young…” Sarah was stunned. “Then, once the meeting has ended, can you…”"
      },
      {
        "paragraph": "“Ms. Neeson, if the caretaker has left, I will arrange for another one to go there. But I hope you won’t lose\nyour temper at the other caretakers. They’re also human beings, and they’re all working hard for money.\nNo one is superior to another person.”"
      },
      {
        "paragraph": "Sarah’s eyes reddened with every word Hadley said. “Assistant Young, what do you mean by that? You\nare looking down at me too. I’m telling you, my position in Shaun’s heart is irreplaceable.”"
      },
      {
        "paragraph": "“Ms. Neeson, that’s all I have to say.” Hadley hung up after he finished speaking."
      },
      {
        "paragraph": "Sarah was so angry she almost smashed her phone."
      },
      {
        "paragraph": "Fortunately, it did not take long for Yael to come over. However, Yael burst out crying as soon as she saw\nher. “Ms. Neeson, Catherine Jones is too vicious. She then told Sarah what happened in Liona that\nafternoon."
      },
      {
        "paragraph": "Sarah’s whole body trembled. It was not that she felt bad for Yael, but rather, she did not expect that\nShaun would be so fond of Catherine in just a few days. He even brought her to Liona."
      },
      {
        "paragraph": "“Yael, I’m sorry. It’s because I got you involved. ” She shed tears of guilt. “ I’m useless. I can’t even\nprotect you. Now that I’ve lost my power and influence, I’m belittled and bullied.”"
      },
      {
        "paragraph": "“Ms. Neeson, don’t say that. I’ve never blamed you.” Yael hurriedly said, “But I can’t protect you\nanymore. Liona will send someone new over, but I predict that they’ll leave after you are discharged from"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "the hospital. The Eldest Young Master has really been bewitched by Catherine Jones this time. He’s a\nscumbag.”"
      },
      {
        "paragraph": "“Don’t say that, ” Sarah murmured. “Catherine dealing with you is only the first step. I’m afraid that she’ll\ncome to me next. She has always hated me for suggesting to send her to the mental hospital for\ntreatment. A vengeful person like her will never let me off.”"
      },
      {
        "paragraph": "“Yes. Young Master Snow also has his hands full.” Yael gritted her teeth. “Ms. Neeson, don’t worry. I\nwon’t go to Country X. I will secretly stay behind to protect you.”"
      },
      {
        "paragraph": "“But you…”"
      },
      {
        "paragraph": "“Actually, there’s something I haven’t told you. The master of Liona is my boyfriend.” Yael suddenly said\nshyly, “He loves me very much, so he’ll definitely help me to keep this secret.”"
      },
      {
        "paragraph": "“What? I didn’t know that.” An odd look flashed in Sarah’s eyes, but she calmly held Yael and said, “\nCongratulations, Yael. You’re happier than me.”"
      },
      {
        "paragraph": "“Not necessarily. ” Yael sighed. “In the end, we’re just the Eldest Young Master’s dogs. We always have\nto be careful when we’re together.”"
      },
      {
        "paragraph": "“It doesn’t matter. You’re so cute and kind, I’m sure that Master Ziegler will always like you.”"
      },
      {
        "paragraph": "Sarah coaxed Yael until she left."
      },
      {
        "paragraph": "Then, she lowered her head and let out a low chuckle."
      },
      {
        "paragraph": "She did not expect Yael to be Master Ziegler’s woman. How interesting."
      },
      {
        "paragraph": "If Shaun really did not return to her, she would not mind destroying someone she could not obtain."
      },
      {
        "paragraph": "However, now was not the time."
      },
      {
        "paragraph": "When she called Rodney again, her tone was soft. “ Rodney, what are you doing?”"
      },
      {
        "paragraph": "“Sarah, I’m waiting for Freya.” Rodney’s grumpy voice sounded. “Now, only Freya can help Osher, so I\nneed to get that damn woman back to the company.”"
      }
    ]
  },
  {
    "title": "Chapter 836 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Sarah’s blood boiled upon hearing him."
      },
      {
        "paragraph": "Shaun’s heart had been hooked by Catherine. Then now, even her backup plan, Rodney was\nsurrounding Freya all day."
      },
      {
        "paragraph": "She really lived up to the title of Catherine’s best friend. She was just as annoying and cheap."
      },
      {
        "paragraph": "“Rodney, I’m so annoyed.” Sarah sounded sad. “ I used to have Yael with me, but now, she has also\nbeen transferred away.”"
      },
      {
        "paragraph": "“Hasn’t she been protecting you all these while?” Rodney’s voice suddenly exploded."
      },
      {
        "paragraph": "“She’s just following Liona’s orders.” Sarah sighed bitterly. “The caretaker left too, saying that I have a\ntemper. I really didn’t expect that I would end up in this situation.”"
      },
      {
        "paragraph": "“F*ck. Shaun is ridiculous. ” Rodney did not expect Shaun to be so heartless. Even if he wanted to break\nup, did he have to be so impatient and transfer her personnel away? “Don’t think about it. I’ll come right\naway.”"
      },
      {
        "paragraph": "However, when he hung up the phone and turned around to leave, he saw Freya standing behind him.\nHe did not know how long she had been there."
      },
      {
        "paragraph": "She was wearing a white knitted dress and a white baseball cap on her head. With the faint smile at the\ncorner of her mouth, she looked beautiful and mysterious at first glance, like a low-profile celebrity."
      },
      {
        "paragraph": "“Hi, President Snow. How did you know I’ve moved to Brighton Gardens?” Freya grinned. “Did Eldest\nYoung Master Hill tell you?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Rodney became furious at the mention of that."
      },
      {
        "paragraph": "It was Chester who told him. He remembered that this was Shaun’s house, but he had transferred it to\nFreya."
      },
      {
        "paragraph": "Freya sighed faintly. “Eldest Young Master is too generous. I wanted to stay with Cathy, but he felt that I\nwas third-wheeling them, so he gave me this duplex. Living here alone is… just great.”"
      },
      {
        "paragraph": "“Have you said enough?”"
      },
      {
        "paragraph": "Along the way here, Rodney had told himself to control his temper. However, he found that whenever he\ncommunicated with this woman, his blood pressure would go up. He wanted nothing more than to cut her\nto pieces."
      },
      {
        "paragraph": "“ Sure. I’m done. Are you leaving?” Freya looked at him quietly."
      },
      {
        "paragraph": "“…Yeah. I’m leaving.” Rodney was frustrated when he said it. He had been waiting for her for so long, yet\nwhen she appeared, he promised Sarah that he would go over."
      },
      {
        "paragraph": "“Tsk. President Snow, you’re really blinded by love.” Freya admired. “In order to accompany Sarah, you\ndon’t even care about your own company. If you don’t work hard, I might"
      },
      {
        "paragraph": "collaborate with SE Group in the next few days. Not t o mention, I have a newly developed essence in\nmy hand. The effects are really good, and the raw materials aren’t expensive. President Hatch wants it\nvery badly.”"
      },
      {
        "paragraph": "Rodney thought about something, and he was just about to speak when Freya walked past him in her\nheels."
      },
      {
        "paragraph": "“Wait…” He hurriedly spoke out. “What? Aren’t you leaving? Aren’t you going to see Sarah?” Freya\nasked in surprise."
      },
      {
        "paragraph": "Rodney was embarrassed. How could he still be in the mood to see Sarah? “Freya Lynch, let’s talk. ”"
      },
      {
        "paragraph": "“Talk? There’s nothing to talk about. Every time you talk to me, you get angry and start yelling. I’ve been\npissed off recently, so I don’t want to argue with you.” Freya waved her hand with a helpless face."
      },
      {
        "paragraph": "Rodney’s beautiful face twisted in anger like he was constipated."
      },
      {
        "paragraph": "Damn it. She made it seem as if it was all his fault. She was the one who angered him. He was usually\nvery gentlemanly to other women."
      },
      {
        "paragraph": "“Freya, I know that I’ve gone too far before, but you found… those ugly women to torture me the last\ntime. You’ve ruined my reputation…”"
      },
      {
        "paragraph": "“What are you saying? You should be thanking me. I f not for me, your parents would force you to go on\nblind dates. But now, because of me, no one is willing to go on a blind date with you, so you can continue\nwaiting for your Sarah Neeson. Isn’t that great?”"
      },
      {
        "paragraph": "Freya immediately retorted, and ‘I’m doing this for your own good’ was written all across her proud face.\nRodney once again took a deep breath and exhaled. ”Okay, thank you. You’re my benefactor. Can I buy\nyou dinner, benefactor?”"
      }
    ]
  },
  {
    "title": "Chapter 837 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Freya shook her head. “ I don’t want to go out. I’ve been eating out every day recently, and my stomach\nisn’t feeling well, so I want to eat in. You can cook for me.”"
      },
      {
        "paragraph": "“What?” Rodney thought he was deaf."
      },
      {
        "paragraph": "“You don’t want to? If you don’t want to, then forget it. I thought we could take this meal to talk about it…”"
      },
      {
        "paragraph": "“I… I’ll do it. I’ll do it.”"
      },
      {
        "paragraph": "Rodney bit the bullet and chased after her."
      },
      {
        "paragraph": "He never thought there would come a day where he had to listen to Freya’s whims."
      },
      {
        "paragraph": "After going upstairs, Freya threw herself on the sofa. Then, she tore open the snacks on the table and\nstarted to eat. “Hurry up and cook. If it’s bad, then there’s no chance to talk. Also, don’t even think of\nasking someone for help. I’m the kind of person who likes sincerity.”"
      },
      {
        "paragraph": "Rodney opened the refrigerator with a grim face. There were many things inside, but they were only"
      },
      {
        "paragraph": "yogurt, milk, fruit, and cheese. There were no cooking ingredients. After searching for a long time, he\nfound three steaks, sashimi, and some frozen shrimp in the freezer."
      },
      {
        "paragraph": "He looked at the date. They would expire in two days."
      },
      {
        "paragraph": "He silently looked at the woman outside and could tell what kind of woman she was. She was definitely\nnot a virtuous woman, and no one wanted a woman like that."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Freya came in after eating a pack of potato chips and saw him defrosting the steak."
      },
      {
        "paragraph": "She had cooked it once before when she just bought it. However, since the steak was not marinated, it\ntasted particularly bad. The insides were raw too."
      },
      {
        "paragraph": "“You’re making steak? That’s hard to cook.” Out of the goodness of her heart, Freya reminded him, “\nWhy don’t you go downstairs and buy some vegetables to cook a few home dishes?”"
      },
      {
        "paragraph": "“No need.” Rodney gave her a deadpan look."
      },
      {
        "paragraph": "His expression made Freya think of her dog in Melbourne."
      },
      {
        "paragraph": "Then, she turned around and video-called her mother. “Mom, where’s Milo? I saw a guy who"
      },
      {
        "paragraph": "looked like Milo and suddenly missed her.”"
      },
      {
        "paragraph": "“What man?” Her mother laughed as she quickly brought over a fluffy brown puppy. “He must look quite\nstrange if he looks like our little Milo. Milo is a dog.”"
      },
      {
        "paragraph": "“It’s not strange. He’s just like a girl.”"
      },
      {
        "paragraph": "“Oh, are you talking about those effeminate men? Silly daughter, if you’re looking for a boyfriend, you\nshould look for the masculine ones. Don’t keep staying single. You should start dating.”"
      },
      {
        "paragraph": "In the kitchen, Rodney hated himself for having good hearing."
      },
      {
        "paragraph": "She saw a man who looked like a dog? That man was like a girl?"
      },
      {
        "paragraph": "He was effeminate?"
      },
      {
        "paragraph": "Rodney was 100% sure that Freya was talking about him."
      },
      {
        "paragraph": "This was simply an insult to him."
      },
      {
        "paragraph": "He tightened his grip on the kitchen knife and took a deep breath. He had to endure it."
      },
      {
        "paragraph": "After chatting with her mom for more than 40 minutes, a fragrant smell came from the kitchen, and she\nhung up the video call."
      },
      {
        "paragraph": "Before long, Rodney came out with plates of steak, sashimi, and fried… tempura. She was\ndumbfounded."
      },
      {
        "paragraph": "“Holy sh*t. You can actually cook?”"
      },
      {
        "paragraph": "Her eyes widened as if she had seen a ghost."
      }
    ]
  },
  {
    "title": "Chapter 838 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Rodney gritted his teeth. “Do you have to be so surprised? Is it strange that I can cook?”"
      },
      {
        "paragraph": "“Yeah. In my eyes, you’re just a useless, pampered young master who doesn’t know how to do anything\nother than follow Sarah’s orders and do her bidding every day.” Freya nodded without hesitation."
      },
      {
        "paragraph": "He should have put some poison in the dish earlier to end it all."
      },
      {
        "paragraph": "Freya cut a tiny piece of steak and tasted it. The taste was surprisingly… damn good. It was as authentic\nas the steak she had in Country F."
      },
      {
        "paragraph": "The tempura tasted like it was from Japan, and even the sashimi was especially tender and fresh. Ahem,\nof course, this had to do with her good ingredients."
      },
      {
        "paragraph": "“Did you really make this yourself?”"
      },
      {
        "paragraph": "She was curious. “You didn’t have your subordinates send it in from the kitchen window with a drone,\nright?”"
      },
      {
        "paragraph": "“No, I made it myself. I’ve liked to cook since I was young, okay?” Rodney really could not stand it."
      },
      {
        "paragraph": "“This is really unexpected. Shaun’s cooking is a disaster, so I never thought he’d have a friend like you. ”\nFreya sighed again. It was the first time she carefully observed Rodney."
      },
      {
        "paragraph": "The man’s features were handsome, and his peach eyes seemed like they could entice someone at any\ntime. His slender figure brought out the best in any clothing."
      },
      {
        "paragraph": "If he were to join the entertainment industry, he would definitely be the type that women go crazy for."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Why are you looking at me like that? I’m telling you. I won’t fall for you.” Rodney felt uncomfortable\nunder her gaze and quickly said, “"
      },
      {
        "paragraph": "Can we talk about the formula now?”"
      },
      {
        "paragraph": "“Sure. Go ahead.” Freya nodded."
      },
      {
        "paragraph": "Rodney said, “Rodney said, “I know you want to collaborate with SE Group, but I have to remind you that\nSE has always been a secondary association skincare brand in the country. It usually targets students.\nThe upper-class women look down on the"
      },
      {
        "paragraph": "brand. If you work with them, you’ll be lowering your stature.”"
      },
      {
        "paragraph": "“Secondly, SE Group has fewer outlets than us, whether it’s domestic or abroad. If you choose Osher\nCorporation, your products will have a chance to be popular worldwide. But if you choose S E, it can only\nbe sold in Australia at most. Besides, President Hatch is a stingy, extremely cruel, and merciless man…”"
      },
      {
        "paragraph": "“As if you’re not cruel and merciless too.” Freya mocked."
      },
      {
        "paragraph": "Rodney braced himself and said, “President Hatch has a habit of keeping women. He throws money to\nthe women outside but doesn’t give a single cent to his wife at home. Believe me."
      },
      {
        "paragraph": "“He’s so rich, but his wife and daughter still live in a two-bedroom house. Once this scandal breaks out,\nit’ll be a huge blow to SE. After all, SE earns money from women.”"
      },
      {
        "paragraph": "“Aren’t you afraid that I’ll tell President Hatch?” Freya raised her eyebrows."
      },
      {
        "paragraph": "“I’ve already sent all the evidence related to his cheating to his wife. She’ll probably make a scene soon.”\nRodney slowly and methodically cut his steak as he said, “Even if his wife doesn’t make a scene, I have\nthe ability to escalate it.”"
      },
      {
        "paragraph": "“ I believe you. Who doesn’t know that the Jewell family owns half of the country’s online media?” Freya\nlaughed. “President Snow, it seems like I’ve underestimated you.”"
      },
      {
        "paragraph": "“No, you didn’t underestimate me. You just overestimated SE Group.” Rodney shook his head.“ The\nremaining domestic brands aren’t big enough t o compete with Osher. Although we’ve had many\nunpleasant incidents before, you’re a smart person, Ms. Lynch. Why make it difficult for your money and\ncareer?”"
      },
      {
        "paragraph": "Freya sneered. “ If I hadn’t fought hard, my future would’ve been ruined by you guys. Rodney Snow, ask\nyour conscience. Have you ever felt guilty about me?” “That year, even if I didn’t get along with Sarah,\nyou could still come at me. Why did you have to be so ruthless at work?”"
      }
    ]
  },
  {
    "title": "Chapter 839 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“To you, I’m just an ordinary cosmetic chemist. But have you ever thought about how hard we work to\nclimb up to where we are?"
      },
      {
        "paragraph": "“When all you young masters were out drinking and playing, we were still burning the midnight oil i n the\nlaboratory. When you went out to play ball"
      },
      {
        "paragraph": "and go fishing, we stayed at home hitting the books.”"
      },
      {
        "paragraph": "Freya’s eyes could not help but redden as she spoke."
      },
      {
        "paragraph": "“Do you understand how desperate you made me when you shut me off back then? The incident with\nThomas Neeson coincidentally happened at the same time as well, and I was egged on at the\nsupermarket. I couldn’t find a job and couldn’t stay in the country, so I had to go overseas."
      },
      {
        "paragraph": "“As a newcomer, I was looked down upon overseas. I didn’t even go back to my apartment every day.\nOut of 365 days a year, I spent 350 days in the lab and fainted several times."
      },
      {
        "paragraph": "“There were two times I lay on the cold ground all night and woke up by myself to go to the hospital. I"
      },
      {
        "paragraph": "have thought of giving up, but I wanted to fight back and regain my lost self-esteem.”"
      },
      {
        "paragraph": "The more she thought about it, the sourer her heart felt, and her tears rolled down."
      },
      {
        "paragraph": "“Hey, don’t cry.”"
      },
      {
        "paragraph": "Rodney felt a little guilty as he listened, and he became at a loss seeing her cry."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "She made it seem as if he was really a scumbag."
      },
      {
        "paragraph": "“I’m sad and hurt, but you don’t even let me cry.” Freya’s tears fell down in large drops."
      },
      {
        "paragraph": "However, there was a saying that if a person was beautiful, they looked beautiful no matter how hard\nthey cried. It was like raindrops falling on flower petals."
      },
      {
        "paragraph": "“Okay, go on and cry. ” Rodney fell silent from her scolding."
      },
      {
        "paragraph": "“Rodney Snow, are you a man? I’m crying, but you still don’t know how to comfort me. It’s no wonder you\ncan’t find a girlfriend.” Freya threw the tissue that she had used to wipe her tears with at him."
      },
      {
        "paragraph": "“…Freya Lynch, you’re being a little unreasonable.” Rodney was exasperated."
      },
      {
        "paragraph": "“Women are always unreasonable.” Freya sniffled."
      },
      {
        "paragraph": "Her tear-stained delicate, petite, and fair face now had a reddish tint to it."
      },
      {
        "paragraph": "Looking at her, Rodney somehow thought that her skin was really good, and she actually looked a little\ncute after crying. 1"
      },
      {
        "paragraph": "“I’ve thought it over. We can cooperate.” Freya suddenly said, “The formula is 20 million dollars each. At\nthe same time, I also want lo percent of Osher Corporation’s shares. Every year, Osher will have to\ninvest 40 million dollars in developing new products. On top of that, I want to serve as the director of\nOsher’s R&D department.”"
      },
      {
        "paragraph": "Rodney was shocked. “The other conditions are fine, but you want 1o percent of the shares? That’s\ndaylight robbery.”"
      },
      {
        "paragraph": "“Think about it. If you don’t collaborate with me, I’ll still choose SE. Even if SE is plagued by negative\ngossip, why won’t I want to earn money? Besides, you should understand my strength. A talented\ncosmetic chemist like me can be discovered but not sought after. Whether you seize this opportunity or\nnot will depend on you.”"
      },
      {
        "paragraph": "Freya blew her nose and started to eat the steak gracefully."
      },
      {
        "paragraph": "That appearance made Rodney suspect that her crying earlier was just an illusion."
      },
      {
        "paragraph": "Rodney left after dinner, but Freya’s conditions were still on his mind. Hence, the first thing he did was\nhead to the company for a meeting."
      },
      {
        "paragraph": "It was not until 11:00 p.m. that Sarah called, and only then did he remember that he had forgotten to visit\nSarah in the hospital."
      },
      {
        "paragraph": "“I’m sorry, Sarah. I’ve been busy with meetings. I didn’t mean to.”"
      }
    ]
  },
  {
    "title": "Chapter 840 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Sarah was furious."
      },
      {
        "paragraph": "She never thought that Rodney, her backup plan, would one day have a meeting and forget her. In the\npast, she was always on his mind, and as long as she said the word, he would come as soon as possible\nno matter how busy or far away he was."
      },
      {
        "paragraph": "Let alone stand her up in the evening because of Freya Lynch."
      },
      {
        "paragraph": "However, she could not say that, so all she could do was pretend to be polite and generous. “It’s okay.\nHow did the talk go with Freya?”"
      },
      {
        "paragraph": "“The talk was settled, but she asked for 1o percent of Osher Corporation’s shares, ” Rodney said\nhelplessly. “So I went back to the company to discuss it with the executives. Everyone thinks this plan is\nfeasible. If we can tie Freya Lynch to Osher, it’s worth it.”"
      },
      {
        "paragraph": "“10 percent?” Sarah’s voice could not help but raise. “That’s daylight robbery, yet you guys are agreeing\nto it?”"
      },
      {
        "paragraph": "“There’s no choice. However, after our company packages the new products, I believe Osher’s market\nvalue will increase.”"
      },
      {
        "paragraph": "Sarah really wanted to call Rodney a stupid pig."
      },
      {
        "paragraph": "Nevertheless, she could only hold herself back while her insides were going to explode with anger."
      },
      {
        "paragraph": "After hanging up the phone, she immediately called Thomas."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Thomas clenched his teeth when he heard this. “ Has Young Master Snow been brainwashed by that b"
      },
      {
        "paragraph": "*tch Freya? She wants 1o percent of Osher’s shares? He might as well give them to you.”"
      },
      {
        "paragraph": "Snow Corporation’s market value was worth more than millions. When Thomas thought that Freya’s\nvalue was almost the same as his, he was very unhappy. To him, Freya was just an inferior woman who\ncame from a small place."
      },
      {
        "paragraph": "“Brother, I really can’t stand it. Find a chance to deal with Freya.” Sarah gritted her teeth and said, “ After\nthat, I’ll deal with Catherine.”"
      },
      {
        "paragraph": "“I don’t need you to tell me that. I also have no intention of letting Freya go. I plan to finish what I didn’t\ndo three years ago.” Thomas suddenly grinned. “That’s good. If she becomes a"
      },
      {
        "paragraph": "shareholder of Osher, I won’t lose anything by marrying her.”"
      },
      {
        "paragraph": "“You mean…” Sarah’s eyes lit up. “That’s a good idea. I heard that the Lynch family’s business has been\ngetting bigger and bigger in recent years, and they’ll surpass Neeson Corporation soon. If you marry her,\nit’ll kill two birds with one stone. But can you do it?”"
      },
      {
        "paragraph": "“Don’t worry. I have plenty of underhanded tricks.” Thomas laughed."
      },
      {
        "paragraph": "Sarah said with satisfaction, “But Shaun isn’t here to clean up after you anymore, so watch yourself.\nDon’t do anything illegal.”"
      },
      {
        "paragraph": "“I know what I’m doing, ” Thomas said. “By the way, how are you going to deal with Catherine?”"
      },
      {
        "paragraph": "“Heh, I have my own plan.”"
      },
      {
        "paragraph": "The next day, Freya received a phone call from Rodney. He agreed to her conditions."
      },
      {
        "paragraph": "That afternoon, Freya invited Catherine out for dinner in a good mood."
      },
      {
        "paragraph": "“You made the right decision. ” Catherine smiled heartily and toasted her. “After all, Osher is a big\ncompany in Canberra. This is an opportunity if you really want to have a foothold in the country.”"
      },
      {
        "paragraph": "Freya chuckled. “I’ll eventually deal with Thomas Neeson. If I enter Osher, Sarah’s blood will definitely\nboil.”"
      },
      {
        "paragraph": "“Definitely. ” Catherine tried to picture that scene and laughed too. “After all, she regards Rodney as her\nbackup plan.”"
      },
      {
        "paragraph": "“Forget it. I’m just afraid that she’s still thinking of Shaun. Since Rodney has been disqualified as the heir\nof the Snow family, I don’t believe Sarah will willingly marry him.” Freya shook her head and suddenly\nlamented, “Actually, Rodney is quite stupid. If I had a man like that who liked me whether I’m right or\nwrong, I might marry him. ”"
      },
      {
        "paragraph": "Catherine was so shocked that she choked on her water. “Don’t scare me. You don’t have a crush on\nRodney, do you?”"
      }
    ]
  },
  {
    "title": "Chapter 841 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Bah, no way. I’m just lamenting. Sarah actually has a good life sometimes, but she doesn’t know how to\ncherish it. I’ll be frank. Rodney’s cooking is really good. His steak and tempura are absolutely delicious.”\nFreya’s mouth watered a little as she thought about it."
      },
      {
        "paragraph": "“So, he’s not completely useless. There are very few men who can cook nowadays. Unlike Shaun…”\nCatherine’s expression was grim. “He only wants to eat my cooking all day long. I don’t want to win over\na man with my cooking skills. I, too, want a man to cook for me one day.”"
      },
      {
        "paragraph": "“Wesley can.” Freya winked."
      },
      {
        "paragraph": "Catherine fell silent all of a sudden. These days, Wesley had not been in contact with her at all because\nof her plan. She owed Wesley too much."
      },
      {
        "paragraph": "Halfway through the meal, Shaun called. “I’m done with dinner. Where are you?”"
      },
      {
        "paragraph": "Catherine looked at the time. It was only 7:00 p.m. “ So early?”"
      },
      {
        "paragraph": "“Yeah. I just had dinner with those bosses and left. I told Hadley to take them out for some fun.”"
      },
      {
        "paragraph": "“I’m out eating with Freya. You can head back yourself,” Catherine replied lazily."
      },
      {
        "paragraph": "Shaun’s face immediately darkened. “I want to be with you, but you just want to be with another\nwoman?”"
      },
      {
        "paragraph": "“Can’t I have a life other than work and you? I want to have delicious food too.”"
      },
      {
        "paragraph": "Catherine then hung up the phone. Why did she not realize that Shaun was so clingy before?"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "After dinner, she went to the beauty salon to get a facial with Freya."
      },
      {
        "paragraph": "Along the way, Shaun Hill kept sending her messages: [Why do you have to go to a salon to get a facial?\nJust wash your face at home.]"
      },
      {
        "paragraph": "Catherine shook her head, speechless. What was an insensitive man who did not understand women?\nHe was."
      },
      {
        "paragraph": "A moment later, she replied: [It’s not clean if I wash it myself. I require professional instruments and\ntechniques, understand?]"
      },
      {
        "paragraph": "Shauncierely Yours: [I don’t understand. Tell me the address. I’ll accompany you and pay the bill.]"
      },
      {
        "paragraph": "Catherine saw the words ‘pay the bill’ and sent him the address."
      },
      {
        "paragraph": "When they arrived at the beauty salon, two beautiful women came in to wash their faces. The room filled\nwith the scent of essential oil."
      },
      {
        "paragraph": "Soothing music was playing in the room, and Freya suddenly yawned. “I suddenly feel like sleeping."
      },
      {
        "paragraph": "That’s strange. I slept for nine hours yesterday.”"
      },
      {
        "paragraph": "“I’m a little sleepy too. Just sleep if you want to. ” Catherine rubbed her eyes. When she was prepared t o\ntake a nap, she suddenly realized that the woman washing her face had an odd look in her eyes. The air\nseemed to smell like…"
      },
      {
        "paragraph": "She suddenly sat up and knocked over the aroma diffuser in the corner before she quickly pulled Freya\nup."
      },
      {
        "paragraph": "“Huh? What’s wrong?” Just as Freya was about to sit up, she suddenly exclaimed, “What the f*ck, why\ndo I feel so weak?”"
      },
      {
        "paragraph": "The two employees ran out, and at the same time, four men who looked like ruffians charged in the door."
      },
      {
        "paragraph": "“Hey, it turns out to be two beautiful women. It’ll be enough for us to have a good time.” One of the men\nwith thick gold chains reached for Catherine’s face."
      },
      {
        "paragraph": "Catherine used her hand to shake him off but found that her whole body was weak."
      },
      {
        "paragraph": "“Who are you?” Freya strained to get up. She did not look great."
      },
      {
        "paragraph": "“We’re here to teach you a lesson.” The man waved his hand, and the remaining three men rushed up at\nonce."
      }
    ]
  },
  {
    "title": "Chapter 842 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "In no time, they were pinned down on the beds by the four men."
      },
      {
        "paragraph": "“Boss, this one is Freya Lynch.” One of the men pulled out a photo and pointed at Freya."
      },
      {
        "paragraph": "“Yep, take her away.” The man with the thick gold chains waved his hands before he stared at Catherine.\n“You guys go. I’ll stay here and have some fun.”"
      },
      {
        "paragraph": "“Bro, I want to have fun too.” The younger man on the side licked his lips as he stared at Freya. “He\ndidn’t say we couldn’t touch her.”"
      },
      {
        "paragraph": "“Fine.”"
      },
      {
        "paragraph": "“B*stards. ” Catherine and Freya went mad seeing the men pouncing on them and pulling their clothes."
      },
      {
        "paragraph": "At that moment, the door was kicked in."
      },
      {
        "paragraph": "Shaun barged in. When he saw Catherine’s half- ripped clothes, his eyes instantly turned cold and red.\n“How dare you touch her.”"
      },
      {
        "paragraph": "“Who… Who are you?” The four hoodlums were shocked by his intimidating aura."
      },
      {
        "paragraph": "“I’m the person who’s going to kill you tonight.” Shaun immediately beat them down and even broke their\nlegs."
      },
      {
        "paragraph": "After the beating, he quickly took off his clothes to wrap them around Catherine. When he saw the red\nmark on her milky-white skin, he turned back in anger and broke their hands too."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Bro, please let us go. We were just hired by someone. ” The man with the gold chain begged, “"
      },
      {
        "paragraph": "The other guy isn’t a small fish either. I suggest that you don’t offend him.”"
      },
      {
        "paragraph": "Shaun asked coldly, “Who was it?”"
      },
      {
        "paragraph": "“The president of SE Group, Eric Hatch.” “So it is that b*stard, Eric Hatch.” Freya cursed angrily."
      },
      {
        "paragraph": "“Yes. President Hatch learned that you’re collaborating with Osher Corporation and said that you fooled\nhim, so he wants to teach you a lesson.” The man with the gold chain looked at Shaun. “Bro, President\nHatch isn’t an ordinary person. You should just forget this matter today. I’ve also been o n the streets for\nmany years. Maybe we can be friends in the future.”"
      },
      {
        "paragraph": "“Friends?” Shaun laughed in a low voice. His smile was extremely cold. “Do you know who I am?”"
      },
      {
        "paragraph": "“Who are you?” “Shaun Hill.”"
      },
      {
        "paragraph": "Shaun narrowed his eyes and broke their hands too."
      },
      {
        "paragraph": "The small room echoed with the sound of screams. The men looked at Shaun like they were staring at\nthe devil. They did not expect that they would accidentally provoke the god on the top of Australia’s\npyramid."
      },
      {
        "paragraph": "After Shaun taught them a lesson, he picked Catherine up and went out."
      },
      {
        "paragraph": "“Wait, Freya…” Catherine took a deep breath. As he grabbed his collar, her tone was weak. “We can’ t\nleave her here alone.”"
      },
      {
        "paragraph": "Freya pitifully lifted her head and smiled bitterly. “ It’s okay. I’ll dial 000 and tell them to take me to the\nhospital.”"
      },
      {
        "paragraph": "Shaun said indifferently with a frown, “Hear that? She doesn’t need me to send her there.”"
      },
      {
        "paragraph": "“No.” Catherine said anxiously, “She’s my best friend. If anything happens to her, I’ll never forgive you.”"
      },
      {
        "paragraph": "Shaun was speechless and sullen. “Catherine Jones, get your facts straight. I just saved you.”"
      },
      {
        "paragraph": "“Come on. If you’re going to help someone then do it properly. See the job through. ” Catherine gently\nshook his collar. She had no strength, so her voice was so soft that it sounded coquettish."
      },
      {
        "paragraph": "Shaun’s blood rushed up at once. It was totally irresistible."
      },
      {
        "paragraph": "A moment later, he carried Catherine with his right hand and placed her on his shoulder before he picked\nup Freya with his other hand in disgust."
      },
      {
        "paragraph": "That was right. He just lifted her like he was carrying a plastic bag. Freya wanted to cry. “I need to hurry\nup and find a boyfriend. This is abuse.”"
      }
    ]
  },
  {
    "title": "Chapter 843 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Inexplicably amused, Catherine said to Shaun, “You don’t have to be like that. I’m not that petty.”"
      },
      {
        "paragraph": "Shaun glared at her. “ I can’t stand touching other women except you.”"
      },
      {
        "paragraph": "Catherine’s face flushed, and her heart unexpectedly skipped a beat."
      },
      {
        "paragraph": "Although the miserable Freya did not see their expressions, she suddenly felt like she had just witnessed\nthem showing public affection."
      },
      {
        "paragraph": "She felt depressed. Catherine was clearly holding the script of a revenge plot, but as a bystander, why\ndid she feel like they were in an idol drama?"
      },
      {
        "paragraph": "After opening the car door, Freya was thrown mercilessly onto the back seat. However, Catherine was\ncarefully placed onto the passenger seat with her seatbelt fastened."
      },
      {
        "paragraph": "Along the way, Shaun called Hadley. “Bring some people to me and seal up the beauty salon. Call the\ncops and reporters. I have a scandalous scoop for them. I want Eric Hatch from SE Group to be ruined"
      },
      {
        "paragraph": "within one day. Make sure no one involved with the beauty salon today gets away.”"
      },
      {
        "paragraph": "“Understood.”"
      },
      {
        "paragraph": "Hadley, who was on a date with a female companion, had no choice but to go over and work overtime at\nnight."
      },
      {
        "paragraph": "In the car, Shaun’s handsome face was cold from the start. It made him look like a god of wrath."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Freya and Catherine did not dare to speak, and neither did they have the energy to talk."
      },
      {
        "paragraph": "Once they arrived at the hospital, Freya was mercilessly thrown to the doctor while Shaun held Catherine\nin his arms, carefully letting the doctor draw blood from her."
      },
      {
        "paragraph": "When waiting for the blood test results, Shaun finally reprimanded her. “You’re not allowed to go t o the\nbeauty salon with Freya again. Next time, you can meet up with her to have a meal at most. Then, you\nhave to come back.”"
      },
      {
        "paragraph": "“Today was an accident…”"
      },
      {
        "paragraph": "“It was an accident, and it’s all because of your friend. ” Shaun said coldly, “She dragged you into it.”"
      },
      {
        "paragraph": "“Shaun Hill, that’s enough. Freya is my friend."
      },
      {
        "paragraph": "What do you mean by she dragged me into it? Have I ever blamed your friends before?”"
      },
      {
        "paragraph": "Catherine’s expression sank as she said with dissatisfaction, “Besides, in those three years we were\nabroad, we relied on each other. To me, she’s the same as family."
      },
      {
        "paragraph": "“Also, don’t forget that you threatened her with the Thomas Neeson incident three years ago. She gave u\np pursuing the case because of me and carried all the responsibility, which ruined her reputation."
      },
      {
        "paragraph": "Shaun was speechless."
      },
      {
        "paragraph": "He suddenly lost his voice."
      },
      {
        "paragraph": "He was especially afraid of her mentioning the incidents three years ago."
      },
      {
        "paragraph": "“I was wrong. This is all Rodney’s fault. If he hadn’t stirred things up, Freya wouldn’t have been targeted\nby Eric. ” Shaun immediately changed his words."
      },
      {
        "paragraph": "Catherine looked at him speechlessly. She really admired his nerve."
      },
      {
        "paragraph": "“Don’t look at me like that.” Shaun lowered his head. There was a trace of grievance in his handsome\nand innocent face. “ I’m still your savior tonight, and I’m also angry. As a man, it’s normal to be angry at\nthe thought of the woman I like being bullied.”"
      },
      {
        "paragraph": "Catherine did not speak. When she thought of the consequences, a chill ran down her spine."
      },
      {
        "paragraph": "She reached out and put her arms around the man’s neck."
      },
      {
        "paragraph": "Shaun lowered his head and kissed her softly."
      },
      {
        "paragraph": "On the other side of the curtain, Freya quickly turned her face away as her face flushed red. How\nshameless were they? There were other people around!"
      },
      {
        "paragraph": "Just as she was thinking about it, Rodney called her. “I just saw the news. I heard that Eric caused\ntrouble for you. Are you okay?”"
      },
      {
        "paragraph": "“You still have the nerve to ask that? I only confirmed the collaboration with you this morning. How did\nEric find out about it so quickly?” Freya snapped at him."
      },
      {
        "paragraph": "Rodney was awkwardly silent for a while before saying in a low voice, “I ran into Eric this afternoon, and I\naccidentally slipped my tongue…”"
      },
      {
        "paragraph": "The corners of Freya’s mouth twitched. “Was it accidental? You showed off on purpose because you\nwanted to strike him down, right?”"
      }
    ]
  },
  {
    "title": "Chapter 844 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Rodney did not know what to say."
      },
      {
        "paragraph": "“Damn you. Did I wrong you in my past life?” Freya could not hold back and cursed in a low voice, “ You’ll\nbe the death of me.”"
      },
      {
        "paragraph": "“What did they do?” Rodney became even more uneasy."
      },
      {
        "paragraph": "Freya was just about to speak when a large hand snatched her phone away."
      },
      {
        "paragraph": "Shaun said, “She’s in the hospital. Come here and send her home.”"
      },
      {
        "paragraph": "“Shaun…”"
      },
      {
        "paragraph": "“Negative press about Eric Hatch has broken out. How you seize this opportunity to get rid of your\nopponent will depend on you. On top of that, you should take this as a lesson. If you have someone\nwho’s a great advantage to the company, you should keep an eye out for their safety.”"
      },
      {
        "paragraph": "Shaun hung up the call and threw the phone at Freya before he turned around to accompany Catherine\nagain."
      },
      {
        "paragraph": "20 minutes later, the blood test report came out."
      },
      {
        "paragraph": "The doctor confirmed that they were fine and only needed to have a good night’s rest. They would be\nable to regain their strength tomorrow."
      },
      {
        "paragraph": "When Shaun heard that, he immediately picked Catherine up. “We’re going back.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine looked at Freya worriedly. “But she…”"
      },
      {
        "paragraph": "“I’m in the hospital. I’ll be fine. You two can go ahead first. Rodney should be coming soon. ” Freya\nwaved her hand. “If you’re here, Rodney might end up fighting with you again.”"
      },
      {
        "paragraph": "“Yeah. She’s right. I’m not in the mood to argue with him. ” Shaun did not want to face Rodney too."
      },
      {
        "paragraph": "“Then, be careful. If he doesn’t pick you up, call me.”"
      },
      {
        "paragraph": "As soon as Catherine finished speaking, Shaun carried her away."
      },
      {
        "paragraph": "Freya looked at them with a little sadness and envy."
      },
      {
        "paragraph": "She used to think that boyfriends were unnecessary, but now she felt like it was quite good to have one."
      },
      {
        "paragraph": "It took another 20 minutes before Rodney arrived. When he saw Freya lying in the hospital bed like a"
      },
      {
        "paragraph": "soft creature, with messy hair and wearing a patient gown, he felt a little guilty. “Where’s Shaun?”"
      },
      {
        "paragraph": "“He left. When Cathy and I were in the beauty salon, the room was lit with incense, and then a few men\ncame in. Fortunately, Shaun came because otherwise, we would have been finished.” Freya pulled her\ncollar, revealing her torn clothes and bruise marks inside. “Look.”"
      },
      {
        "paragraph": "Rodney frowned. He could imagine the scene at that time."
      },
      {
        "paragraph": "However, as a high and mighty man, he really could not lower his head and apologize to her. “That’s…\nYou can’t blame it all on me. Who told you to offend Eric? He isn’t a good person in the first place. Did\nyou promise him something before…”"
      },
      {
        "paragraph": "“Rodney Snow, shut your mouth. I offended him because of you.”"
      },
      {
        "paragraph": "“That’s because I gave you a big profit. I even gave you Osher Corporation’s shares.”"
      },
      {
        "paragraph": "“If you didn’t have such a big mouth, Eric wouldn’t have bothered me tonight. If I knew Eric already knew\nabout our collaboration, I would have kept an eye out. I wouldn’t have been a fool and almost got\nbullied.”"
      },
      {
        "paragraph": "“If you came here to lecture me, then you can leave.” Freya gasped for breath. She had no strength\nanyway. After she pointed at him, her fingers hung down weakly, and her deep facial features were a little\npale."
      },
      {
        "paragraph": "“Fine. Forget it. I won’t argue with a woman like you. I’ll send you back.”"
      },
      {
        "paragraph": "Rodney lifted her quilt and suddenly picked her up. However, he did not expect her to be so light."
      },
      {
        "paragraph": "Caught off guard, Freya subconsciously put her arms around his neck."
      },
      {
        "paragraph": "The intimate gesture made both of them a little uncomfortable, so she quickly put her hands down."
      },
      {
        "paragraph": "After Rodney glanced at her, he strode outside while holding her. With every step he took, the graceful\narm muscles outside his short-sleeved shirt bulged a little. Freya snorted. “I couldn’t tell that you had\nmuscles.”"
      }
    ]
  },
  {
    "title": "Chapter 845 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“ Shut up. I work out a lot, okay?” Rodney scoffed. On the way back, soft music was playing in the car.\nDue to the incense she had inhaled earlier, Freya could no longer hold up her eyelids any longer."
      },
      {
        "paragraph": "Once they arrived at Brighton Gardens, Rodney turned on the lights and turned around to find that she\nhad fallen asleep. Her thick long hair covered half her face, and the remaining half revealed her glazed\nwhite skin under the light. She was usually sharp-tongued, but at that moment, she was like a gentle and\nharmless kitten, delicate and soft."
      },
      {
        "paragraph": "He hesitated before he took out a blanket from the trunk to cover her. Then, he sat in the front to read the\nnews on his phone."
      },
      {
        "paragraph": "Hackett Institute."
      },
      {
        "paragraph": "Shaun put the sleeping Catherine on the large bed in the bedroom."
      },
      {
        "paragraph": "She could not keep her eyelids open and fell asleep on the way back."
      },
      {
        "paragraph": "After Shaun watched her quietly for a while, he turned to get a basin of water and gently took off her\nclothes. When he saw the scars on her body, his handsome face turned ashen. However, the further\ndown he went, his face could not help but turn slightly red."
      },
      {
        "paragraph": "Every time he was with her, he was impulsive and rash. He had never looked at her so carefully before."
      },
      {
        "paragraph": "She had a really good figure. She was small at places she needed to be small, and large at places\nwhere… Ahem…"
      },
      {
        "paragraph": "As a young and vigorous man, Shaun gulped unexpectedly, his eyes the color of Mars."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Once he had cleaned her, he dressed her in her pajamas and took a cold shower by himself."
      },
      {
        "paragraph": "He used her towel, which had the familiar scent of her body. It was very nice, and he did not feel\ndisgusted despite his mysophobia."
      },
      {
        "paragraph": "After a shower, he lay down and slept beside her on the same quilt. He was extremely satisfied smelling\nthe fragrance of her body."
      },
      {
        "paragraph": "Then, he could not resist holding her in his arms. Catherine did not wake up. However, she rubbed"
      },
      {
        "paragraph": "her little face against his chest and hugged him with her petite arms. The action was very natural. It was\nas if they had done this countless times before."
      },
      {
        "paragraph": "Shaun was so stunned that he looked at her from the side. This scene was extremely familiar, but he\ncould not remember it at all."
      },
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "Catherine slept until late in the morning."
      },
      {
        "paragraph": "When she opened her eyes, she was faced with solid honey-colored pectoral muscles. A familiar\nmasculine smell mixed with the shower gel she used wafted into her nose."
      },
      {
        "paragraph": "Did she hug Shaun the entire night?"
      },
      {
        "paragraph": "Completely unprepared, her cheeks became unwillingly hot."
      },
      {
        "paragraph": "She quickly got up, but the hand at her waist tightened and pulled her back."
      },
      {
        "paragraph": "“You’re awake?” Having just woken up, the man’s voice was low and deep like a cello, and it made her\nheart beat faster."
      },
      {
        "paragraph": "Catherine looked up and saw Shaun’s handsome and dazzling well-rested face. She bit her lips and"
      },
      {
        "paragraph": "said with annoyance, “Why are you sleeping in my bed?”"
      },
      {
        "paragraph": "“Babe, I’m not a gentleman. You were sleeping so heavily last night. If I didn’t take the opportunity to stay\nby your side, I’d be a fool.” Shaun gave a low chuckle. He had taken advantage of the situation yet was\nstill acting so righteous."
      },
      {
        "paragraph": "“Shameless.” Catherine cursed him. She sat up, but since she had not fully recovered, she instantly fell\nonto his chest again."
      },
      {
        "paragraph": "“You’re throwing your arms around me so quickly?” Suddenly, Shaun’s eyes burned as if they could set\npeople on fire. He stretched out his arms to hold her firmly."
      }
    ]
  },
  {
    "title": "Chapter 846 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“I’m not…”"
      },
      {
        "paragraph": "Catherine struggled for a long time but did not break free. Instead, she could feel the man’s gaze getting\nhotter and hotter."
      },
      {
        "paragraph": "She was more than familiar with the progression of events, and suddenly, she did not dare to breathe. “\nLet me go. Don’t do anything rash.”"
      },
      {
        "paragraph": "“ I really want to do something rash. How long do you want me to wait?” Shaun flipped her over, placing\nhis strong arms on her sides. His burning breath fell onto her face."
      },
      {
        "paragraph": "“How long have you waited? It has only been a few days. ” Catherine turned away in disapproval. She\nwas so flustered that she dared not look him in the eye."
      },
      {
        "paragraph": "However, she did not know that her posture was revealing her graceful and slender neck."
      },
      {
        "paragraph": "“Cathy, we’re an old married couple.”"
      },
      {
        "paragraph": "Shaun turned her face and dominantly kissed her red lips."
      },
      {
        "paragraph": "“No…”"
      },
      {
        "paragraph": "Catherine struggled."
      },
      {
        "paragraph": "Despite that, the man was extremely strong, and he knew her very well."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Besides, knowing from Yael that he had not done it with Sarah over the years, she was not as revolted\nby him."
      },
      {
        "paragraph": "Catherine, who originally intended to get up, was forced to give up that thought because of him."
      },
      {
        "paragraph": "Meanwhile."
      },
      {
        "paragraph": "When Freya opened her eyes after a satisfying sleep, she found herself lying in the back seat of the car\nwith a pillow below her head and a thin blanket over her body."
      },
      {
        "paragraph": "She was dazed and confused for a while before remembering the incident last night. When Rodney was\nsending her back, she could not hold on any longer and fell asleep in his car on the way back."
      },
      {
        "paragraph": "In other words, she was still in Rodney’s car. The blanket on her body was placed on her by Rodney, and\nthe pillow under her head was put there by Rodney too?"
      },
      {
        "paragraph": "A very strange feeling welled up in her heart."
      },
      {
        "paragraph": "Her image of Rodney had always been a nasty and despicable lowlife. Even if she was sleeping, she\nbelieved that Rodney would throw her out of the car or get someone to bully her."
      },
      {
        "paragraph": "Never did she expect that he had such an attentive side to him."
      },
      {
        "paragraph": "She sat up and saw the man leaning on the driver’s seat motionlessly. Hence, he leaned over to look at\nhim."
      },
      {
        "paragraph": "Rodney was resting with his eyes closed. He really was born with good skin. He had a tall nose, thin lips,\nclear skin, and eyelashes so long that they could be brushed with a comb. He had the face of those high\nand noble comical faces."
      },
      {
        "paragraph": "In the past, she thought that Patrick was the most handsome man."
      },
      {
        "paragraph": "However, Patrick paled in comparison to Rodney’s features."
      },
      {
        "paragraph": "At that moment, his eyelashes moved."
      },
      {
        "paragraph": "Freya hurriedly sat back. Rodney rubbed his eyes and woke up. When he turned around, the two pairs of\neyes met."
      },
      {
        "paragraph": "He suddenly did not feel sleepy at all. “You’re finally awake.”"
      },
      {
        "paragraph": "“Why didn’t you wake me up last night?” Freya pretended to be indifferent."
      },
      {
        "paragraph": "“Forget it. You were sleeping like a pig…”"
      },
      {
        "paragraph": "“Rodney Snow, do you know what you’re talking about?” Freya instantly exploded. “Is there a pig as\nbeautiful as me?”"
      },
      {
        "paragraph": "“Yeah. I saw one last night. She’s still in my car now.” Rodney narrowed his eyes and mocked."
      },
      {
        "paragraph": "“Get lost.” Freya snapped at him and opened the cardoor to leave."
      },
      {
        "paragraph": "Rodney lowered the window and said, “Don’t worry, Eric Hatch has been arrested. If you don’t"
      },
      {
        "paragraph": "have any more enemies, you can go out with peace o f mind. You should rest for two days before\nreturning to work at Snow Corporation.” “Give me the money first and then we’ll talk.” Freya glared at him\nbefore she went upstairs."
      },
      {
        "paragraph": "When she got home, she pulled up the news. The incident of Eric finding someone to attack her last\nnight made today’s headlines. [SE Group’s President Eric Hatch detained after finding"
      },
      {
        "paragraph": "someone to beat up Osher Corporation’s new R&D director.]"
      },
      {
        "paragraph": "[Eric Hatch, the leading cosmetics entrepreneur in Australia, abandoned his wife and daughters to keep\nseveral mistresses.]"
      },
      {
        "paragraph": "[Eric Hatch’s wife cried and accused Eric Hatch of not returning home for half a year and had not paid for\nliving expenses.]"
      },
      {
        "paragraph": "[Eric Hatch’s wife and daughter live in an old two- bedroom house, while his mistress lives in a luxury\nvilla worth hundreds of millions of dollars.]"
      },
      {
        "paragraph": "[SE Group’s share price plunges. Women announce that they are abandoning SE’s cosmetics.]"
      },
      {
        "paragraph": "Negative gossip about Eric Hatch in various aspects broke out, and even Eric’s wife was interviewed by\nthe media about his various scummy behaviors."
      },
      {
        "paragraph": "Eric angered the women across Australia. Women hated it when men cheated on their wives, and at that\nmoment, Eric was still under investigation at the police station."
      },
      {
        "paragraph": "As Freya read it, she secretly lamented at how quickly Shaun and Rodney acted. SE Group earned\nmoney from women but did not respect women. On top of that, Eric had used improper means to\nsuppress his peers. It would be difficult for SE Group to turn around."
      },
      {
        "paragraph": "She thought about it and made a phone call to Catherine."
      },
      {
        "paragraph": "The phone rang, but no one answered, and she did not return the call."
      },
      {
        "paragraph": "It was not until noon that Catherine finally called her. “Did Rodney send you home last night?”"
      },
      {
        "paragraph": "“You’re too much. I called you in the morning, but you’re only returning the call in the afternoon. I’m fine.\nDon’t tell me you just woke up.” Freya suddenly realized something and laughed. “Your voice sounds"
      },
      {
        "paragraph": "strange. It’s a little hoarse. Did you and Shaun… It was him, right?”"
      },
      {
        "paragraph": "“…What nonsense are you talking about? I’ve been asleep, okay?”"
      },
      {
        "paragraph": "Catherine glanced at the man on the bed and flushed red in shock. Damn it. Freya’s ears must be\npoisonous."
      },
      {
        "paragraph": "Then, she hurriedly dragged her sore legs and went out."
      },
      {
        "paragraph": "“Fine, I thought you guys…”"
      },
      {
        "paragraph": "“Can you not think so indecently?” Catherine interrupted her seriously."
      },
      {
        "paragraph": "“I’ve always been like this,” Freya was unashamed to admit. “I fell asleep in Rodney’s car last night and\naccidentally slept until morning.”"
      },
      {
        "paragraph": "Catherine was stunned. “He did not throw you out? He even let you sleep until the morning? Did you\ncatch a cold?”"
      },
      {
        "paragraph": "“Yeah. That’s what I thought too. I didn’t expect it either. He didn’t wake me up and even covered me with\na blanket, ” Freya said with mixed feelings."
      },
      {
        "paragraph": "“I couldn’t tell. He can cook, and he’s attentive. If it weren’t for his prejudice against us because of Sarah,\nRodney could be regarded as an excellent man. Unfortunately, he loved the wrong person. He has a bad\neye for people, ” Catherine said regretfully. “You don’t have a crush on him, do you?”"
      },
      {
        "paragraph": "“…Get lost.” Freya immediately scolded."
      },
      {
        "paragraph": "“Why are you so worked up?” Catherine clicked her tongue and reminded, “But I have to remind you. You\ncan’t fall in love with Rodney. Patrick has already made you suffer enough. If you fall for Rodney, you’ll\nsuffer like never before. That guy only has eyes for Sarah.”"
      },
      {
        "paragraph": "“You don’t have to tell me that. I know better than you.”"
      },
      {
        "paragraph": "Freya immediately hung up the call."
      },
      {
        "paragraph": "Catherine glanced at the phone, a little worried."
      },
      {
        "paragraph": "According to years of understanding each other like sisters, it was not good whenever Freya started to\npraise a man."
      },
      {
        "paragraph": "When she was distracted, a man’s arm came up from behind and held her tightly."
      },
      {
        "paragraph": "She gasped as Shaun bit her ear. “Rodney is an excellent man?”"
      },
      {
        "paragraph": "Catherine suddenly trembled and turned around, wanting to glare at him. However, Shaun sealed her\nlips. “Better than me?”"
      },
      {
        "paragraph": "“Shaun Hill. Are you done yet?” Catherine pinched his waist."
      }
    ]
  },
  {
    "title": "Chapter 847 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun hissed in pain, but his eyes and tone were bitter. “You praised another man.”"
      },
      {
        "paragraph": "Catherine was speechless. “Did I say anything wrong? I used to think that Rodney was useless except\nfor his looks, but it turns out he has strong points too.”"
      },
      {
        "paragraph": "“He has scolded you before…” Shaun gritted his teeth and reminded her. What was more depressing\nthan to wake up and hear the woman he liked praise another man?"
      },
      {
        "paragraph": "“Have you scolded me any less?” Catherine reminded him. “You better not say that others are bad, or I’ll\nbring up old scores again.”"
      },
      {
        "paragraph": "Shaun silently buried her handsome face in her neck. “Babe, I’m hungry.”"
      },
      {
        "paragraph": "Catherine chuckled. “What a coincidence. I’m hungry, too. I didn’t eat breakfast, and now my body is all\nweak.”"
      },
      {
        "paragraph": "“…I’ll cook for you.”"
      },
      {
        "paragraph": "Shaun resigned himself and rubbed her little face. “"
      },
      {
        "paragraph": "But it may not be as good as yours. Don’t shun it.”"
      },
      {
        "paragraph": "“ If you really can’t, then just cook eggs. I’ll teach you.” Catherine sighed helplessly."
      },
      {
        "paragraph": "Under Catherine’s guidance, they had a simple breakfast. However, since she was too hungry, she felt\nthat Shaun’s trash-like cooking could barely fill their stomachs."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "After they had eaten, Hadley called to ask about the company, to which Shaun said, “Bring some of my\nclothes to Hackett Institute. I’ll be sleeping here in the future.”"
      },
      {
        "paragraph": "Hadley replied, “Ahem. Okay.”"
      },
      {
        "paragraph": "Catherine, however, snatched the phone away. “No need.”"
      },
      {
        "paragraph": "Then, she hung up the call."
      },
      {
        "paragraph": "“Catherine Jones…” Shaun gritted his teeth."
      },
      {
        "paragraph": "“ I don’t want to live together for now. ” Catherine got up. “If there’s a need to spend the night, I’ll go to\nyour place. By the way, remember to hire a nanny. I don’t want to be your housekeeper.”"
      },
      {
        "paragraph": "Shaun’s face darkened, and Catherine grinned. “Did I say anything wrong? My place is small, and"
      },
      {
        "paragraph": "there’s no space for a nanny to live. If you move here, I’ll have to handle all your meals and clothes."
      },
      {
        "paragraph": "I’m sorry, but my status is much more valuable now, so I definitely won’t do anything that’ll hurt m y\ndelicate fingers. By the way, I have to enjoy whatever grand treatment Sarah used to enjoy.”"
      },
      {
        "paragraph": "Shaun’s expression was grim, and just as he was about to open his mouth, Catherine pressed her\nslender fingers on his lips. “Don’t talk to me about sacrificing for love. I can love you, but I want to love\nmyself more.”"
      },
      {
        "paragraph": "“Okay. We’ll do whatever you say.” Shaun did not know whether to laugh or cry. He had never intended\nto treat her badly. “ I’ll hire a nanny and a maid. I’ll call Aunty Yasmine over, so why don’t you come to my\nplace and stay?”"
      },
      {
        "paragraph": "“No. There should be some occasional distance between two people. We’ll get tired if we’re always\ntogether.”"
      },
      {
        "paragraph": "Catherine shook her head resolutely."
      },
      {
        "paragraph": "“Babe, I won’t get tired of you, ” Shaun coaxed softly."
      },
      {
        "paragraph": "Catherine looked at him weirdly. “No, I’ m saying I’ll get tired of you.”"
      },
      {
        "paragraph": "Shaun was at a loss for words."
      },
      {
        "paragraph": "What did she say? She would get tired of him?"
      },
      {
        "paragraph": "Were her feelings not supposed to grow stronger the more she was with him?"
      },
      {
        "paragraph": "Shaun took a deep breath. Having dealt a blow, his handsome face now looked extremely unpleasant,\nand he gritted his teeth. “Catherine Jones, I’ll give you one chance to rephrase your words.”"
      },
      {
        "paragraph": "“I didn’t say anything wrong… Ah…”"
      },
      {
        "paragraph": "Before Catherine could finish her sentence, she was turned around by Shaun and spanked on her butt\ntwice."
      },
      {
        "paragraph": "Although it was not heavy, she was still furious. “ Shaun Hill, how dare you hit me.”"
      }
    ]
  },
  {
    "title": "Chapter 848 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun was startled by the anger in her eyes. “I just gently patted…”"
      },
      {
        "paragraph": "“I don’t care. You hit me. You men just don’t know how to cherish others. I just slept with you in the\nmorning, and you bullied me in the afternoon. I’m ignoring you. Go away.” Catherine’s eyes were red.\nShe was originally just pretending, but after thinking about it, she felt aggrieved too."
      },
      {
        "paragraph": "The proud Shaun too became a little angry at being driven away like this, but when he saw her red eyes,\nhe immediately panicked and picked her up carefully. “Babe, I was wrong. Don’t be angry. You can hit me\nback, okay?”"
      },
      {
        "paragraph": "“I don’t want to hit your stinky *ss.” Catherine looked away. Her beautiful eyes were filled with tears, and\nher mouth pouted, making her look as cute as possible."
      },
      {
        "paragraph": "Shaun’s heart melted. He grabbed her hand and patted it on his face. “Is this okay?”"
      },
      {
        "paragraph": "“No, it’s too light.” Catherine lowered her eyes and snorted."
      },
      {
        "paragraph": "“Like this?” Shaun grabbed her hand again and heavily slapped himself twice."
      },
      {
        "paragraph": "If others saw this scene, their eyes would have fallen off. No one would expect that the high and mighty\nShaun Hill would coax a woman like this. Even Sarah would be shocked if she saw this."
      },
      {
        "paragraph": "“That’s more like it.” Catherine looked at the red mark on his face and smiled."
      },
      {
        "paragraph": "When Shaun saw the smile on her face, his heart fell to the ground."
      },
      {
        "paragraph": "He never thought that he would coax a woman like this one day. He coaxed her without a bottom line."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "He would not be like this even when facing Sarah in the past."
      },
      {
        "paragraph": "Of course, Sarah also sometimes acted spoiled, but comparing her with Catherine, he felt that he was\nonly instinctively indulging Sarah. It seemed his heart did not mean it."
      },
      {
        "paragraph": "As he thought about it, there did not seem to be moments where his heart would skip a beat when h e\nwas with Sarah. There was not much anger, but no lovey-doveyness either."
      },
      {
        "paragraph": "However, there was a voice in his head that dominated him. He loved Sarah, so he had to be good to\nher."
      },
      {
        "paragraph": "However… was that love? Did he really love Sarah?"
      },
      {
        "paragraph": "True love should be like this, where there was laughter and sweetness."
      },
      {
        "paragraph": "Even when she was angry, she was beautiful. Suddenly, there was a sharp pain in his head."
      },
      {
        "paragraph": "He drew a cold breath and let go of her, stumbling back two steps and holding his head."
      },
      {
        "paragraph": "“Shaun… ” Catherine was startled and quickly held him. “What’s wrong?”"
      },
      {
        "paragraph": "“My head suddenly hurt.” Shaun held his head."
      },
      {
        "paragraph": "Confusion flashed across Catherine’s eyes. “What were you thinking of?”"
      },
      {
        "paragraph": "“ I was thinking about… ” Shaun’s throat suddenly got stuck when he found that his brain was a little\nconfused. “I thought that it felt very sweet getting along with you like this now, and you looked very cute\nwhen you were angry.”"
      },
      {
        "paragraph": "“That’s all?” Catherine did not believe it. Last time, he also had a headache when he recalled something\nat McDonald’s. “Have you had headaches before?”"
      },
      {
        "paragraph": "“ I’ve had fewer headaches since Sarah helped me treat them.” Shaun froze. “It seems that every time I\nhave a headache, it’s with you. Should I consult a neuro…”"
      },
      {
        "paragraph": "“Are you afraid you have a tumor in your brain?” Catherine joked."
      },
      {
        "paragraph": "“Don’t talk nonsense. That won’t happen. I still want to be with you.” Shaun pinched her small face.\n“Cathy, sometimes, I feel like life is strange, but I can’t tell what’s strange about it… Right, I was just\nthinking that when I’m with Sarah, it’s like I’m not as satisfied with her as I am when I’m with you now\n“Stop.” Catherine suddenly covered his mouth."
      },
      {
        "paragraph": "Sarah hypnotized him, and Catherine consulted a good doctor about it before. For this kind of hypnosis,\nthe worst-case scenario was that one day, the patient broke the hypnosis himself and the chances of\nrecovering were slim. What was more likely would be that the reality and implanted memory would tangle\nup, and the patient would lose his mind."
      }
    ]
  },
  {
    "title": "Chapter 849 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“What’s wrong?” Shaun was puzzled."
      },
      {
        "paragraph": "“Nothing. I just don’t want to hear about Sarah and you.”"
      },
      {
        "paragraph": "Catherine turned her face away purposefully."
      },
      {
        "paragraph": "“Sorry.” Shaun turned her body and kissed her overbearingly and fondly. “Babe, I’m incredibly sure now. I\nlove you.”"
      },
      {
        "paragraph": "She was a little dazed by his kiss and hung her arms around his neck."
      },
      {
        "paragraph": "She originally planned to go to the company but did not make it in the end."
      },
      {
        "paragraph": "The next day, when Shaun drove her out, she made him stop at the door."
      },
      {
        "paragraph": "“What are you doing?” He glanced at her sideways. He had to say that women did need to be nourished\nsometimes. After yesterday, he felt as if she was even more beautiful and delicate, like a rose in full\nbloom."
      },
      {
        "paragraph": "“Buying something.”"
      },
      {
        "paragraph": "Catherine unfastened her seat belt and got out of the car, and went to the pharmacy. She asked for a\nbox of contraceptives and drank a glass of water before coming out."
      },
      {
        "paragraph": "“What did you buy?” Shaun suddenly stared at her, his handsome face slightly dark."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine blinked and took out the box of pills from her bag."
      },
      {
        "paragraph": "Shaun’s hands tightened on the steering wheel, even the veins were bulging. His expression was\nunpleasant. “Don’t eat it next time. I plan to spend the rest of my life with you. Children are also…”"
      },
      {
        "paragraph": "“The last time we were together, you threw me a box of birth control pills.” Catherine interrupted him. “I’m\na little scared now.”"
      },
      {
        "paragraph": "“That was because I…”"
      },
      {
        "paragraph": "“Also, the bad experience I had when I was pregnant before traumatized me. I’m not ready to experience\nthat kind of pain and fear again, for the time being, so please put yourself in my shoes and think about it.”\nCatherine said mercilessly."
      },
      {
        "paragraph": "“I’m sorry.” Shaun was chagrined."
      },
      {
        "paragraph": "Thinking about it, he hated his former self immensely. Why was he so cruel? Even if he did not love her\nback then, she was still pregnant with his children. Why was he not more caring?"
      },
      {
        "paragraph": "The more he thought about it, the more he felt that his past self was incredibly strange."
      },
      {
        "paragraph": "“Don’t take the medicine in the future. It’s not good for your health.” He sighed. “I’ll buy condoms.”"
      },
      {
        "paragraph": "“Okay.” Catherine nodded and did not refuse."
      },
      {
        "paragraph": "After arriving at Hudson Corporation, not long after she went upstairs, she received custom-made\nchocolate rose from Frrrozen Haute. Inside was a pink card: I’m sorry, babe. I’ll treat you well for the rest\nof my life. Love, Shaun."
      },
      {
        "paragraph": "Then, her WhatsApp rang."
      },
      {
        "paragraph": "Shaun sent message after message. [Cathy, I miss you.]"
      },
      {
        "paragraph": "[Cathy, are the chocolates good?]"
      },
      {
        "paragraph": "[Babe, what else do you want to eat? I’ll have it sent to you.]"
      },
      {
        "paragraph": "Catherine was speechless."
      },
      {
        "paragraph": "She looked at his WhatsApp messages and her lips twitched. This man was like a different person"
      },
      {
        "paragraph": "when dating. She never saw him like this before."
      },
      {
        "paragraph": "She bowed her head and replied, [No need. I have plans tonight.]"
      },
      {
        "paragraph": "Shaun. [The first message you sent is to send me away?] Followed by it was an emoji with an aggrieved\nface."
      },
      {
        "paragraph": "Catherine. [Be good. I’m busy. Don’t make a fuss.]"
      },
      {
        "paragraph": "Shaun. [Okay, I won’t make a fuss. I’ll listen to my wife.]"
      }
    ]
  }
]