
  [
    {
      "title": "Chapter 2000 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "Chester knew that Eliza would retreat, so he held her more tightly to keep her from doing so."
        },
        {
          "paragraph": "It was only until she started panting that he let go of her."
        },
        {
          "paragraph": "Chester rested his eyes on her slightly swollen red lips and crimson face. He could not get enough of\nthe kiss, but he found it strange at the same time. She was not very skillful in kissing. Also, given that\nshe was previously a kept woman, why was she still so shy?"
        },
        {
          "paragraph": "“Are you done?” Eliza asked calmly."
        },
        {
          "paragraph": "Only then did Chester notice her calm, indifferent gaze. She did not look like she had just experienced\na passionate kiss. Somehow, he felt annoyed deep down. “Eliza, don’t you feel anything after I kissed\nyou just now?”"
        },
        {
          "paragraph": "Eliza opened her mouth. She initially wanted to say, “I’m a little worried that I might be infected"
        },
        {
          "paragraph": "because of your dirty mouth.” On second thought, he was still of value, so she casually answered, “\nNothing much.”"
        },
        {
          "paragraph": "“ If you can’t feel anything, let me  kiss you  again.  I’ll make sure you feel  something  this  time.”\nChester approached her and draped his arm around her shoulders."
        },
        {
          "paragraph": "“Lizzie, this is the drink you wanted…” The assistant suddenly walked in. At the sight of the scummy\nChester who was pestering Eliza, she was so shocked that her hand trembled and the drink spilled\nonto the floor. “I’m s-sorry. My stomach hurts. I’ll place the drink here and leave first.”"
        },
        {
          "paragraph": "She promptly dashed out."
        },
        {
          "paragraph": "Eliza impassively pushed Chester’s hand away. “ Young Master Jewell, don’t be so shameless. You’ve\ntaken advantage of me, yet I haven’t gotten to meet Sarah and you continue  to push your  luck. You\ndon’t want to lose out, neither do I.”"
        },
        {
          "paragraph": "Chester asked curiously, “But you’ve already kissed me. If I’m not satisfied with your kiss, aren’t you\nafraid that I won’t take you to meet Sarah?”"
        },
        {
          "paragraph": "“It’s quite a pity, but I need to cut my losses early, ” Eliza answered coolly, “Considering that you work in\nthe business industry, you should know that sometimes it’s necessary to stop a business or it’ll incur\nmore losses.”"
        },
        {
          "paragraph": "“You’re right.” A smile spread across Chester’s"
        },
        {
          "paragraph": "face. He was good-looking and had a charming smile."
        },
        {
          "paragraph": "Eliza recalled being captivated by his smile when she was still the young and muddled Charity."
        },
        {
          "paragraph": "However, she did not have any strong feelings for him now because she knew that not every man who\nalways wore a smile was kind-hearted. For some people, the more they smiled, the more cold- hearted\nthey were."
        },
        {
          "paragraph": "“After you’re done with your IV drip, I’ll take you to meet Sarah.” Chester took out his phone. “Save my\nnumber. Call me when you’re done.”"
        },
        {
          "paragraph": "Chester stood up after Eliza saved his number. “I’m going  to do my rounds now. We’ll get  in touch\nlater.”"
        },
        {
          "paragraph": "As soon as Chester returned to the department of internal medicine, he personally asked the condition\nof the patients he had performed operations on. Then, he returned to his office and tapped open Eliza’s\nSnapchat. There was nothing much apart from pictures of her activities in the entertainment  industry\nas well as magazine photos."
        },
        {
          "paragraph": "He tapped open one of the pictures taken during an event she attended a few days ago. It seemed to\nbe an outdoor event. She was wearing a white maxi dress on her graceful body, revealing her beautiful\narms and shoulder blade."
        },
        {
          "paragraph": "With her good looks, she appeared very flirtatious even when the wind whipped her hair into a mess."
        },
        {
          "paragraph": "Undeniably, he had come across many beautiful ladies. Even so, he quietly appreciated Eliza for a\nwhile. It soon struck him that it was already winter now, yet she attended the event in such an outfit.\nShe had probably felt cold. It was no wonder she had a fever yesterday."
        }
      ]
    },
    {
      "title": "Chapter 2001 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "Chester immediately dialed Shedrick’s number. “ You’d better not let Eliza attend any outdoor events\nfor now.”"
        },
        {
          "paragraph": "“Why?” Shedrick was dumbfounded. “As far as I know, she has an outdoor event for a luxury brand\nnext week. We’ve already signed the contract.”"
        },
        {
          "paragraph": "“Turn it down. The weather is chilly, ” Chester said nonchalantly."
        },
        {
          "paragraph": "Shedrick was astounded. It felt as though pigs might fly. “Dude, if we turn it down, we’ll have to pay a\nfew million dollars for breaching the contract. Besides, it’ll destroy Eliza’s reputation.”"
        },
        {
          "paragraph": "“Well, tell the organizer to make sure the artists bundle up that day, ” Chester said after some thought."
        },
        {
          "paragraph": "Shedrick was speechless. “Don’t all female artists do that? When Cindy was your fiancée, you didn’t\nsay anything.”"
        },
        {
          "paragraph": "“Just do as I say.”"
        },
        {
          "paragraph": "Chester hung up the call."
        },
        {
          "paragraph": "Half an hour later, Eliza took the initiative to call him. “I’m done.”"
        },
        {
          "paragraph": "Chester happened to be discussing something with a patient’s family member. He told her the location\nand asked her to come over."
        },
        {
          "paragraph": "It took Eliza only five minutes to come over. Standing at the door with a mask, she watched Chester\ndiscuss the patient’s condition with the family member while he was in his white coat. It seemed that"
        },
        {
          "paragraph": "the patient was diagnosed with terminal cancer. After hearing Chester’s words, the family member was\nin tears and begged him to save the patient."
        },
        {
          "paragraph": "Chester comforted the patient gently."
        },
        {
          "paragraph": "After resting her eyes on the scene for a while, Skyler said, “I didn’t expect Young Master Jewell to be\nso kind when he’s on duty. He’s a good doctor.”"
        },
        {
          "paragraph": "Eliza remained quiet. Chester was a good doctor who treated his patients well. He used to treat Sarah\nand Cindy well too."
        },
        {
          "paragraph": "Even those women with whom he played around were paid well."
        },
        {
          "paragraph": "Only Eliza was not treated well."
        },
        {
          "paragraph": "After Chester was done, he walked over. “Let’s go. I’m going to take you to meet Sarah, but… you can’t\nact impulsively like Freya.”"
        },
        {
          "paragraph": "“Don’t worry. Rodney isn’t my husband, so I won’t have the urge to beat her up.” Deep down, Eliza just\nwanted to torture Sarah to death."
        },
        {
          "paragraph": "Chester was quite content with her reply."
        },
        {
          "paragraph": "Eliza tagged along with him to the inpatient unit. Sarah stayed in the VIP private ward at the farthest\nend. There was even a row of bodyguards outside the ward to ensure tight security."
        },
        {
          "paragraph": "Although Eliza had heard about  it long ago,  she could not help but feel sad for Freya at that moment."
        },
        {
          "paragraph": "Shortly after, the two of them were allowed to enter after a bodyguard saw Chester and informed Sarah\nabout it."
        },
        {
          "paragraph": "In the luxurious ward, Sarah was lying on the bed with her hands bandaged. Her face was red and\nswollen. Rodney was seated by the bed, peeling an apple."
        },
        {
          "paragraph": "When the two of them came in, Rodney looked up, his eyes flashing with astonishment. “Chester, have\nyou gotten together with Eliza?”"
        }
      ]
    },
    {
      "title": "Chapter 2002 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "Rodney did not have the audacity to claim that Eliza was Chester’s girlfriend. He knew that Chester\nhad always played around with women."
        },
        {
          "paragraph": "Eliza flatly denied it. “No. I’m just curious about what kind of a woman you prioritize over your wife and\nchild that you chose to abandon your family. ”"
        },
        {
          "paragraph": "Rodney was aware of her relationship with Freya. At that moment, many thoughts flashed across his\nmind. He quickly said, “Did Freya ask you to come and look for me? You’ve misunderstood me. I didn’t\nabandon my family. She has always misunderstood me and insists on divorcing me this time. She even\nbeat Sarah up so badly. If she hadn’t done that, I wouldn’t have to come here every day.”"
        },
        {
          "paragraph": "After making that remark, Eliza did not feel like talking to him anymore."
        },
        {
          "paragraph": "She could understand why Freya wanted to divorce him without giving him a chance. The reason was\nthat they were not on the same wavelength."
        },
        {
          "paragraph": "Besides, Rodney had been caring for another woman every day without thinking about his married\nstatus, which upset his wife."
        },
        {
          "paragraph": "Sarah said weakly, “Miss Robbins, are you Freya’s friend? Please talk her out of divorcing Rodney. I’ll\nbe going overseas next week.”"
        },
        {
          "paragraph": "“Next week?” Eliza asked, “Which country are you going to?”"
        },
        {
          "paragraph": "“Country B.” Sarah sighed. “ I probably won’t be coming back anymore.”"
        },
        {
          "paragraph": "“Country B has quite lovely sights. I heard it’s difficult for many rich people to emigrate there. ” Eliza\ngave a vague smile. “Mr. Snow must have spent a lot of money on your emigration.”"
        },
        {
          "paragraph": "Sarah’s face slightly paled. Upon sensing Eliza’s sarcasm, Rodney said with a frown, “Chester, why did\nyou bring her here?”"
        },
        {
          "paragraph": "Without answering him, Chester took out a cigarette and lit it. Then, he took a drag of it."
        },
        {
          "paragraph": "Rodney reminded, “Chester, this is a hospital. Smoking is prohibited. As a doctor, don’t you know that?”"
        },
        {
          "paragraph": "“ I know, that’s why I’ve been holding in my urge outside just now. I can finally do it here,” Chester\nresponded lazily as Eliza’s eyes swept over his triggering expression."
        },
        {
          "paragraph": "On the other hand, Sarah bit her lip when her eyes rested on Chester. “Chester, we grew up together\nsince young. I really hope we can be like how we used to be. Even if that’s not possible, I still hope that\nyou’ll be on good terms with Rodney.”"
        },
        {
          "paragraph": "“ Sarah, when you fled the last time, you shouldn’t have come back.” Chester slowly exhaled some\nsmoke. “Because of your return, all our friendships have soured.”"
        },
        {
          "paragraph": "Sarah’s eyes reddened, and Rodney could not tolerate the situation anymore. “As she said, she’ll be\nleaving next week. Considering that we’re friends, why do you have to shift the blame to her? She’s in\nagony too.”"
        },
        {
          "paragraph": "Chester snorted while staying quiet. Eliza then asked, “When will Miss Neeson be discharged? It\nseems like her injuries aren’t that severe.”"
        },
        {
          "paragraph": "“How are they not severe?” Rodney said furiously, “ Her hands will be scarred, and the scars won’t fade\nuntil a few years later. They hurt so much that she can’t sleep at night. She has to frequently receive IV\ninfusions in the hospital.”"
        },
        {
          "paragraph": "“I’ve never experienced any burns, so I’m not sure.” Eliza shrugged. “I’m going to the restroom. ”"
        },
        {
          "paragraph": "With that, she turned around and entered the restroom. Only after she locked the door did she  take out\na tube of salve. She squeezed some of it to put into the tub of toothpaste. After that, she pretended to\nflush the toilet before coming out."
        },
        {
          "paragraph": "“Let’s go.” Chester finished smoking  a cigarette.  He did not feel like staying here anymore mainly\nbecause he was sick of Sarah’s face. She was so skillful at acting that Rodney did not even know he\nwas being fooled by her."
        },
        {
          "paragraph": "“Miss Neeson, I actually came over as I was curious about your appearance and how you managed to\nsnatch my best friend’s man. I’ve finally seen you now, and it turns out that you’re just average.” After\nhumiliating Sarah, Eliza left with Chester regardless of Sarah’s grim expression."
        },
        {
          "paragraph": "However, as soon as she walked to the door, she bumped into Cindy, who was walking toward the\nward in a cashmere coat. From her haggard look, it seemed that Cindy had not been living well\nrecently. The moment she saw Chester, her eyes lit up. Nevertheless, her body stiffened awkwardly the\nminute she caught a glimpse of Eliza beside him."
        },
        {
          "paragraph": "As she had learned her lesson earlier, she stared at Chester’s handsome face with reddened eyes. “\nChester, when will you be free to return home for a meal? Your mom said that you’ve been very busy\nlately.” With a discreet smile, Chester said abrasively, “ You’re so skillful at speaking. We haven’t\ncontacted each other for such a long time. Don’t make it seem like there’s something going on between\nus.”"
        }
      ]
    },
    {
      "title": "Chapter 2003 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "“Chester, must  you be like this?” Embarrassed, Cindy broke  into tears.  “I’ve been having a hard time\nrecently. Are you planning to force me into a corner?”"
        },
        {
          "paragraph": "Chester shot a stony glance at her. “Why are you here?”"
        },
        {
          "paragraph": "“Actually… I asked her to accompany Sarah, ” Rodney said behind him, “She used to be very close to\nSarah. Now that Sarah has very few friends, I asked her to come have a chat with Sarah.”"
        },
        {
          "paragraph": "“Young Master Snow, how… understanding of you,” Eliza teased before leaving."
        },
        {
          "paragraph": "Chester was at a loss for words. “Rodney, if you had been so caring toward Freya, the two of you\nwouldn’t be divorcing.”"
        },
        {
          "paragraph": "Once he finished his sentence, he tried to catch up to Eliza."
        },
        {
          "paragraph": "Cindy watched him go after Eliza. When the two of them arrived at the elevator door, Chester clutched\nEliza’s shoulder."
        },
        {
          "paragraph": "The scene pierced Cindy’s eyes and made her consumed with jealousy."
        },
        {
          "paragraph": "She could not help but sob and ask Rodney, “Young Master Snow, Chester likes Eliza, doesn’t he?\nWhy does he like her? What’s so good about her?”"
        },
        {
          "paragraph": "Deep down, Rodney was still ruffled by Chester’s sarcastic remark. When he heard Cindy’s question,\nhe answered with impatience, “Even without Eliza’s presence, he’ll be with another woman. Chester\nwill never do something to keep a woman. To him, women are like clothes.”"
        },
        {
          "paragraph": "Cindy’s face paled."
        },
        {
          "paragraph": "Indeed, Chester was heartless."
        },
        {
          "paragraph": "However, she was fortunate that Chester only had a slight interest in Eliza. How long would his interest\nlast, though?"
        },
        {
          "paragraph": "Moreover, Cindy’s value was irreplaceable. Chester could never marry another woman except her."
        },
        {
          "paragraph": "“Please spend more time with Sarah. After all, I’m married, so I can’t possibly stay here all the time. ”\nRodney left after reminding Cindy in distress."
        },
        {
          "paragraph": "In the elevator."
        },
        {
          "paragraph": "Chester glanced at the watch on his wrist, only to realize that it was already 12:00 p.m."
        },
        {
          "paragraph": "“Let’s have lunch together. What do you want to eat?” He turned his eyes to the woman beside him. “\nWestern cuisine, Japanese cuisine, or hotpot?”"
        },
        {
          "paragraph": "“I don’t feel like eating anything. I want to go home and rest.” Eliza turned him down."
        },
        {
          "paragraph": "“Fine. I’ll go to your house and eat.” Chester placed his hands into the pockets of his trousers, looking\nhandsome and elegant in his white coat."
        },
        {
          "paragraph": "Eliza, who had just met Sarah, was not in the mood to entertain him. She directly said, “Young Master\nJewell, I mean that I want to go home alone and rest. I don’t want to eat with you. If you’re hungry, you\ncan get someone else to eat with you.”"
        },
        {
          "paragraph": "The elevator happened to arrive on the ground floor, so she walked out straight away."
        },
        {
          "paragraph": "Chester’s eyes narrowed while resting on her. He suddenly extended his hand to grab her. His elegant\nface revealed a hint of coldness. “Eliza, what do you mean? You’re planning to leave after taking\nadvantage of me, huh?”"
        },
        {
          "paragraph": "“Don’t make me seem so awful. I kissed you,  and you brought me to meet Sarah. So we don’t owe\neach other, nor were you taken advantage of.” Eliza exchanged glances with him impatiently. “What’s\nmore, this is the condition you set from the beginning, Young Master Jewell. Now, you even plan on\ncoming to my house for a meal. If I agree, I’ll be taken advantage of.”"
        },
        {
          "paragraph": "Chester liked and hated how sharp-tongued she was. “Do you have to be so calculating?”"
        },
        {
          "paragraph": "Eliza laughed. “You’re the one who has been calculating early on, so I have to be more cautious than\nyou.”"
        },
        {
          "paragraph": "“You can continue to set out your conditions. ” At this point, it dawned on Chester what it meant by\nshooting himself in the foot. “There’s nothing else I want. ” Eliza pushed him away before she turned\nand walked away."
        }
      ]
    },
    {
      "title": "Chapter 2004 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "Staring at Eliza’s slim figure, Chester was not really angry. Instead, he felt an itchy sensation."
        },
        {
          "paragraph": "If he had not experienced the kiss, he would not have felt so strongly about it."
        },
        {
          "paragraph": "At this point, he was just like a junkie. Not only did he want to get Eliza, but he also wanted to conquer\nher."
        },
        {
          "paragraph": "At night, Eliza took time out to have a meal with Director Lear."
        },
        {
          "paragraph": "Director Lear was merely an insignificant director. In fact, he was not qualified to eat with Eliza\nconsidering her status. However, it was Director Lear who shot Eliza’s first movie when she had just\njoined the entertainment industry. Therefore, she took their past relationship into consideration."
        },
        {
          "paragraph": "Director Lear took the initiative to pour her a cup of coffee. “Four years have flown by. At that time, you\nwere still studying. Who would’ve expected that a young girl like you would become a well-known\ncelebrity in the blink of an eye?”"
        },
        {
          "paragraph": "“Don’t say that. If it hadn’t  been for your guidance, I wouldn’t have come this far with my acting skills.”"
        },
        {
          "paragraph": "Eliza’s response was perfunctory. At this point, her soul was Charity, so she did not have any memories\nof what Eliza had done in the past. However, it was through the assistant that she learned that Director\nLear used to lend Eliza a hand."
        },
        {
          "paragraph": "“Eliza, I actually came here to ask you a favor.” Director Lear handed her his script. “This is the new\nmovie I spent three years preparing for. But with my status, I know there won’t be any good actors who\nwill be willing to work with me. I’m not begging you to be the female lead of this movie either. Having\nsaid that, you can take a look at it. If you’re happy with it, you can consider taking on the role.”"
        },
        {
          "paragraph": "“I’ll take a good look at it.” Eliza took over the script."
        },
        {
          "paragraph": "She was under no illusions that Director Lear was one of the very few honest directors in the industry,\nso she did not turn him down."
        },
        {
          "paragraph": "Even so… She had no idea if she was eligible to act in movies in the future."
        },
        {
          "paragraph": "Perhaps after tonight…"
        },
        {
          "paragraph": "Ding! She received a message on her phone. She tapped it open and realized that it was Tristan who\nsent the message. [We’ve intruded into the"
        },
        {
          "paragraph": "hospital. We’re ready to make a move.] She replied: [Be careful.]"
        },
        {
          "paragraph": "They finished the me-al at 8:30 p.m. Eliza drew a piece of tissue paper to wipe her mouth. She smiled\nand said politely, “Director Lear, I have something to attend to later. After I finish going through your\nscript, I’ll contact you again.”"
        },
        {
          "paragraph": "“Sure.”"
        },
        {
          "paragraph": "Considering her status, Director Lear was already grateful that she was willing to talk to him for over\ntwo hours."
        },
        {
          "paragraph": "After getting in the car, Eliza drove to an average neighborhood. When she arrived there, she received\na new message from Tristan. [I’ve taken her out. We’ll send her to the old place.]"
        },
        {
          "paragraph": "Eliza changed her clothes in the car. Soon, she drove an unlicensed black Toyota and headed out of\nthe city."
        },
        {
          "paragraph": "An hour later, she drove into a factory. A van was parked at the factory compound."
        },
        {
          "paragraph": "Upon noticing her arrival, Tristan got out of the van with two subordinates. “Miss Robbins, we’ve\nbrought the woman here.”"
        },
        {
          "paragraph": "He opened the trunk. Sarah was tied up with a cloth stuffed in her mouth. She was unconscious."
        },
        {
          "paragraph": "Eliza gazed at her silently with grim eyes. Her pretty face was impassive."
        },
        {
          "paragraph": "Tristan whispered, “ Sarah probably fainted on the bed because she used that tube of toothpaste. Even\nthe caretaker didn’t know about it and thought that she fell asleep. I entered the hospital by posing as a\ndoctor and knocked the caretaker unconscious."
        },
        {
          "paragraph": "When I came out, the bodyguards at the door were unaware of it. Having said that, I reckon I can’t hide\nthis for long. If I’m lucky, the bodyguards will find out about this issue at 6:00 a.m. or 7:0 a.m. tomorrow.\nThey might even find out in the wee hours.” “I got it. Thank you, Tristan.” Eliza took out a few cards\nfrom her purse and handed them to him. “You guys take the money and leave Australia tomorrow\nmorning. I’ve already settled the visas for you guys.”"
        }
      ]
    },
    {
      "title": "Chapter 2005 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "“Miss Robbins… ” Tristan was at his wit’s end. “If we leave, what will happen to you?”"
        },
        {
          "paragraph": "“Exactly. ” The chauffeur who had been working for Eliza walked over as well. “With Rodney’s\ncompetence, he’ll figure things out in less than two days.”"
        },
        {
          "paragraph": "“That’s why I’m asking you guys to leave. ” Eliza shot a look at Sarah. “ Since I’ve decided to do this,\nI’ve never thought about leaving this place safely. But it doesn’t matter.”"
        },
        {
          "paragraph": "She came back with the intention of taking revenge, did she not?"
        },
        {
          "paragraph": "At first, she thought that it was easy to take revenge since Sarah was currently in a miserable state.\nHowever, Rodney’s interference had made a lot of things troublesome."
        },
        {
          "paragraph": "She had thought of a more comprehensive plan before. Nevertheless, when she got to know from\nFreya regarding Sarah’s deeds, she did not want to endure it anymore."
        },
        {
          "paragraph": "Sarah had a beautiful dream."
        },
        {
          "paragraph": "She dreamed that Rodney married her, and she then became admired by many for being Young\nMadam Snow. She also dreamed that she often attended banquets where only the wealthiest nobles in\nthe world could join."
        },
        {
          "paragraph": "Catherine and Freya were like ants in front of her."
        },
        {
          "paragraph": "Before the dream could continue, she was splashed with cold water and woke up."
        },
        {
          "paragraph": "With such weather, she felt so cold that she immediately shrieked. The second she opened her eyes,\nshe was dazed to find herself in a dim spot. She thought that she had yet to wake up from her dream."
        },
        {
          "paragraph": "A woman in black sports attire walked over. The woman was wearing a creepy mask and looked like a\nghost in this place."
        },
        {
          "paragraph": "“Who are you? I must be dreaming. This isn’t real.” Sarah was so frightened that she yelled. Just as\nshe wanted to escape, she realized that her hands and legs were tied up. She was left on the floor.\nExcept for a few lamps on the wall, there was no other source of light."
        },
        {
          "paragraph": "Unable to believe it, she kept trying to wake up from her dream. She refused to believe that she ended\nup in this strange place after she woke up when she was sleeping in the hospital earlier."
        },
        {
          "paragraph": "“Stop struggling. I’m the one who kidnapped you here. You’re not dreaming, ” Eliza said with a fake\nvoice. As such, Sarah could not make out who she was. Her heart sank into an abyss right away."
        },
        {
          "paragraph": "“Who… Who are you?” After all, Sarah was kidnapped in the States once before and had encountered\nall kinds of dark incidents back then. She soon pulled herself together. “Are you Freya or Catherine?”"
        },
        {
          "paragraph": "Eliza snorted. “Who do you think I am?”"
        },
        {
          "paragraph": "Sarah said with a shudder,  “You’re Catherine, right? Don’t think that you can treat me this way just\nbecause you have Shaun defending you? This is illegal. I know you guys hate me, but you don’t have\nany evidence. If something happens to me, Rodney won’t let you off.”"
        },
        {
          "paragraph": "After pausing for a moment, she screamed loudly, “"
        },
        {
          "paragraph": "Shaun, are you hiding somewhere here? I admit that I hurt you before, but that’s all in the past. Now\nthat you’ve finally gotten back together with Catherine, why do you want to have a falling-out"
        },
        {
          "paragraph": "with Rodney because of those small matters? It won’t benefit you either. What’s more, I helped you\nrecover your memory. Let bygones be bygones, alright? I beg you guys.”"
        },
        {
          "paragraph": "Her voice echoed in the empty area, which scared Sarah out of her wits."
        },
        {
          "paragraph": "“Stop screaming. I’m not Freya or Catherine.” Eliza slowly bent down with a creepy mask. “Sarah\nNeeson, do you know how much energy I wasted just to get you here?”"
        },
        {
          "paragraph": "Sarah kept retreating. She had done too many bad deeds, and this unknown woman gave her the\nchills."
        },
        {
          "paragraph": "It took her a lot of effort to make Freya and Rodney go through a divorce. She even had a shot of\ngetting pregnant, but she never expected this incident to happen."
        },
        {
          "paragraph": "Who on earth was this woman? Sarah nearly went insane."
        },
        {
          "paragraph": "“Don’t be scared. In fact, your brother has been here too,” Eliza said with a smile, “You’ll like this place.\nWe have ample time to play.”"
        },
        {
          "paragraph": "Sarah shuddered. “Has Thomas provoked you? That’s none of my business. You can look for him. I’ve\nlong since lost touch with him. Please  let me go, okay? I can… I can pay you a lot of money.”"
        },
        {
          "paragraph": "”I don’t want money. I just want you to suffer a living hell.”"
        }
      ]
    },
    {
      "title": "Chapter 2006 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "Eliza rose to her feet and snapped her fingers. Tristan and a few others walked over shortly after."
        },
        {
          "paragraph": "“Throw her into that tank.” Eliza raised her chin a little."
        },
        {
          "paragraph": "Before Sarah could come to her senses, she was lifted and thrown into a huge tank. The tank gave off\na suffocating, awful smell, which nearly caused her to go crazy."
        },
        {
          "paragraph": "She took great pains to stick her head out. Her face and nose were covered in the nauseating dirty\nwater. How disgusting! There were also a lot of worms wriggling inside."
        },
        {
          "paragraph": "“Does it smell good?” Eliza rested her calm gaze on Sarah. “You enjoy throwing other people’s ashes\ninto the drain, right? Now, you try staying there and tasting the water. How’s it?”"
        },
        {
          "paragraph": "With that, she personally pressed Sarah’s head down. Then, she pulled her hair up and asked softly,\n“How does it feel?”"
        },
        {
          "paragraph": "“Who… Who the hell are you?” Sarah choked very badly and shivered all over. “Are you here to take\nrevenge on Jennifer’s behalf? You’re Freya, right?”"
        },
        {
          "paragraph": "“As I said, I’m neither of the two people you’re thinking about. Have you ever thought that I might be… \nyour  sister?”  Eliza said while  smiling vaguely."
        },
        {
          "paragraph": "Sister… Charity Neeson."
        },
        {
          "paragraph": "Sarah’s head almost exploded. She looked at Eliza with fear. “Impossible. That’s impossible. Charity is\ndead.”"
        },
        {
          "paragraph": "“Did you see her dead body with your own eyes? Sarah, don’t panic. As I said, this is just the\nbeginning.”"
        },
        {
          "paragraph": "Eliza laughed."
        },
        {
          "paragraph": "From the day she became Eliza, she never thought that she would get to laugh so heartily like today."
        },
        {
          "paragraph": "She admitted that she might have gone astray."
        },
        {
          "paragraph": "However, she did not mind. From the moment she sank into the sea bed, she was already a devil when\nshe returned."
        },
        {
          "paragraph": "At this moment, Sarah was really frightened."
        },
        {
          "paragraph": "She had done so many evil deeds, yet she had never been so frightened."
        },
        {
          "paragraph": "Although she had experienced the most terrifying thing in the States, she was not as frustrated as she\nwas at this moment."
        },
        {
          "paragraph": "She even wished that this woman was either Catherine or Freya because they would not be as\nterrifying as this woman."
        },
        {
          "paragraph": "In the hospital."
        },
        {
          "paragraph": "At 3:00 a.m."
        },
        {
          "paragraph": "The bodyguards at the door felt that the ward was unusually quiet today. Sarah would usually have\ndifficulty sleeping at night  due  to the pain caused by the burns, so they would always hear some"
        },
        {
          "paragraph": "sounds from inside."
        },
        {
          "paragraph": "Given that the bodyguards were Snowden members, they were particularly careful. A female\nbodyguard went in and glanced around, only to see that the caretaker was not there. After searching\naround, she discovered that the caretaker was lying on the bed while Sarah was nowhere to be found."
        },
        {
          "paragraph": "They instantly informed Rodney about it."
        },
        {
          "paragraph": "Rodney flew into a rage right away. “What were you guys doing? Didn’t I tell you to be more alert\nbecause Shaun might make a move one of these few days? You only realized she’s missing now?!”"
        }
      ]
    },
    {
      "title": "Chapter 2007 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "“We’re sorry, Young Master Snow. We thought Miss Neeson was asleep. I think something was wrong\nwith the doctor who came to check on her, ” the bodyguard said in distress."
        },
        {
          "paragraph": "“Investigate this issue and check the surveillance cameras right now.”"
        },
        {
          "paragraph": "Rodney was putting on his clothes while instructing the bodyguard. His mind flashed with many\nthoughts in a short period of time."
        },
        {
          "paragraph": "As soon as he hung up, he phoned Chester."
        },
        {
          "paragraph": "“Do you know what time it is now?” Chester asked a s he suppressed his anger after Rodney called\nhim."
        },
        {
          "paragraph": "“Chester, Sarah is missing. Did Shaun ask you to help him with this?” Rodney asked. “She was in your\nhospital, and there were bodyguards outside her ward. The bodyguards only realized it after she went\nmissing for a few hours. One of the bodyguards told me that something might be wrong with the doctor\nwho went in to check on Sarah earlier.”"
        },
        {
          "paragraph": "“Are you under the impression that Shaun and I banded together to take Sarah away?” Chester asked\ncoldly while rubbing his brows."
        },
        {
          "paragraph": "“I don’t mean to suspect you, but I can’t think of other reasons, ” Rodney said, frustrated. “Those\nbodyguards are Snowden members. Since Sarah was taken away under their watch, it means that\nthose people who took her away must be extraordinary. Also, Catherine and Shaun are the only people\nholding grudges against Sarah.”"
        },
        {
          "paragraph": "“I’m not sure about this.”"
        },
        {
          "paragraph": "Chester sounded indifferent. “Shaun has never mentioned it to me either.”"
        },
        {
          "paragraph": "“I don’t care if you’re really unsure about it. She went missing from your hospital, so you need to be\nresponsible.” Rodney’s patience had reached its limits. He had no illusions about Shaun’s cruelty.\nConsidering that Sarah had gone missing for such a long time, he wondered if she was still alive."
        },
        {
          "paragraph": "“Chester, I beg you. I owe Sarah too much, and she has suffered a lot as well. I already plan on\nsending her abroad. Why can’t you let bygones be bygones?”"
        },
        {
          "paragraph": "Rodney begged in agony, “ If anything happens to her, I’ll be drowning in guilt forever.”"
        },
        {
          "paragraph": "“I’ll have the surveillance unit investigate Sarah’s case. But let me make it clear that I don’t take part in\nthe affairs between you and Shaun.”"
        },
        {
          "paragraph": "Chester hung up the call impatiently. After that, he dialed Shaun’s number, but no one picked up the\ncall. He had no choice but to get the hospital staff to quickly investigate how exactly Sarah went\nmissing."
        },
        {
          "paragraph": "Meanwhile, Rodney took a group of people to the Hill family’s manor."
        },
        {
          "paragraph": "A row of cars traveled to Sherman Mountain in the wee hours."
        },
        {
          "paragraph": "In the large master bedroom, Shaun was sleeping soundly while hugging Catherine. The two adults\nhad mercilessly pushed Suzie and Lucas to the side. Luckily, there was a bed rail on the other side, so\nLucas would not fall down the bed."
        },
        {
          "paragraph": "At first, Suzie and Lucas were averse to their scummy dad’s act of pushing them to the side. Even so,\nno matter how they resisted it, they would surrender to their fate every time they woke up in the"
        },
        {
          "paragraph": "morning and saw their parents hugging each other in their sleep."
        },
        {
          "paragraph": "All of a sudden, a soft knock sounded on the door."
        },
        {
          "paragraph": "“Young Master Hill, Madam, there’s something urgent.”"
        },
        {
          "paragraph": "Shaun and Catherine woke up at the same time, but Catherine was too lazy to move. Before she fell\nasleep that night, Shaun had pestered her for a long time. The two of them ended up sleeping at 12:00"
        },
        {
          "paragraph": "a.m. At this moment, she was left with no energy."
        },
        {
          "paragraph": "Shaun caressed her head pitifully before he leaped to his feet. He opened the door and saw the\nhousekeeper standing outside."
        }
      ]
    },
    {
      "title": "Chapter 2008 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "The housekeeper whispered in a state of panic, “ Young Master Snow came with many Snowden\nmembers to barge into the manor. None of the Liona members is around tonight. You need to go out\nnow. It’s almost impossible to stop them at the gate.”"
        },
        {
          "paragraph": "Shaun’s expression changed."
        },
        {
          "paragraph": "After Catherine, who was on the bed, vaguely heard what the housekeeper said, her sleepiness"
        },
        {
          "paragraph": "vanished. She promptly dragged herself out of bed. “ Why does he want to barge into the manor?”"
        },
        {
          "paragraph": "“He said that… he wants you to hand Sarah over,” the housekeeper said with difficulty as he rested his\neyes on Shaun."
        },
        {
          "paragraph": "Shaun was dumbfounded, and a hint of vexation crossed his handsome face. Catherine was taken\naback. “Is Sarah missing?”"
        },
        {
          "paragraph": "“I think so, ” the housekeeper responded with a murmur."
        },
        {
          "paragraph": "“You stay here with the kids. I’ll go out for a while.” After Shaun reminded Catherine, he returned to his\nroom and put on a coat. Then, he headed to the gate."
        },
        {
          "paragraph": "By the time he arrived, the security guards at the gate could not stop the other party. The Snowden\nmembers directly drove in and destroyed the gate."
        },
        {
          "paragraph": "An SUV entered the compound. Rodney got out of the car with his handsome face laden with fury. “\nShaun, please hand Sarah over.”"
        },
        {
          "paragraph": "Shaun pulled a long face, and the veins on his forehead throbbed. “Are you out of your mind? You’ve\nbeen treating Sarah as your precious darling. I’ve never even seen her recently.”"
        },
        {
          "paragraph": "“Shaun, stop lying to me. Sarah went missing from the hospital last night. Who else is capable of doing\nthis except for you?” Rodney was not in the mood to argue with him. “I know you’ve been holding a\ngrudge against Sarah. You blame her for hypnotizing you and causing you to divorce Catherine. But\nshe has been punished, and moreover, you’ve recovered your memory. Why can’t you just let her off?”"
        },
        {
          "paragraph": "“I said I didn’t kidnap her.” Shaun was astonished. He did plan on making a move two days later, but\nSarah was already missing now. This was bizarre."
        },
        {
          "paragraph": "“Do you think I’ll trust you?” Rodney scoffed. “It’s normal that you’d deny it. After all, kidnapping is\nillegal. However, you’ve long since plotted to attack Sarah. There have been Liona members near the\napartment she was staying in. When she went to the hospital, those members were there to keep\nwatch on her too. If this isn’t your doing, it must be Catherine’s. Both of you must hand Sarah over\ntonight, or don’t blame me for being impolite.”"
        },
        {
          "paragraph": "“How impolite are you going to be?” Dressed in pajamas, Catherine walked up to Rodney under the\nstreetlights."
        },
        {
          "paragraph": "The cool night breeze whipped her black hair into minor disarray."
        },
        {
          "paragraph": "Shaun immediately went to her and warmed her cold hands in his palms. “ Didn’t I tell you to stay\ninside?”"
        },
        {
          "paragraph": "“I just want to see how far he’ll go in dealing with his good buddy for Sarah’s sake.” Catherine stared\nresentfully at Rodney. “You keep delaying your divorce with Freya, yet you’re kicking up a fuss here for"
        },
        {
          "paragraph": "the sake of another woman. Have you ever thought of Freya and your child?”"
        },
        {
          "paragraph": "“Catherine, stop evading the subject. I’ m telling you one last time to hand Sarah over! ” Rodney roared\nimpatiently. “Don’t force me.”"
        },
        {
          "paragraph": "The frostiness in Shaun’s eyes grew deeper bit by bit. “Are you really planning to have a falling-out with\nme because of Sarah?”"
        },
        {
          "paragraph": "“Sarah is a miserable woman. I said I’ll send her abroad safely, and I’ll do as I promised. This is what I\nowe her. ” Rodney stared into Shaun’s eyes, not planning to give in at all."
        },
        {
          "paragraph": "“Well, I’ll say this to you one last time as well. Sarah isn’t here, ” Shaun said."
        },
        {
          "paragraph": "“Fine. Since you refuse to tell me, I’ll look for her myself.”"
        },
        {
          "paragraph": "Once Rodney waved his hand, the Snowden members tried to barge into the manor."
        }
      ]
    },
    {
      "title": "Chapter 2009 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "A grave look washed over Shaun’s face. “ Rodney, you can’t simply barge into the manor.”"
        },
        {
          "paragraph": "“Shaun, you might have Titus and my uncle as your biggest support. Even so, Titus has gone abroad\nand my uncle isn’t your uncle.” Rodney glared at Shaun furiously. “I don’t wish to be on bad terms with\nyou either, but you forced me to do this.”"
        },
        {
          "paragraph": "“I forced you?” Shaun was thoroughly disappointed in him."
        },
        {
          "paragraph": "The Snowden members rummaged through the cupboards in the manor. Even Old Madam Hill and Old\nMaster Hill woke with a start in the middle of the night."
        },
        {
          "paragraph": "“Rodney, what’s going on? It’s the middle of the night.” Old Master Hill fixed his eyes on Rodney coldly.\nAt this moment, he still did not know what was happening."
        },
        {
          "paragraph": "“Nothing, Grandpa.” After Shaun said to him, the Liona members finally arrived."
        },
        {
          "paragraph": "The members of Snowden and Liona began to fight each other in the manor."
        },
        {
          "paragraph": "After the police were notified about it, they hurried over and settled the matter."
        },
        {
          "paragraph": "However, Rodney accused Shaun and Catherine of kidnapping."
        },
        {
          "paragraph": "Catherine was exasperated by Rodney’s behavior. “ Rodney, you abandoned Freya for Sarah. Are you\nalso planning to lose Shaun, your buddy, because of her too?”"
        },
        {
          "paragraph": "She was not worried about Rodney accusing them in front of the police because they did not do it.\nEven if the police investigated the matter, the two of them would not be found guilty. However, if the\nincident became severe, it would tarnish Hill Corporation’s reputation. Previously, Wesley hollowed out"
        },
        {
          "paragraph": "half of Hill Corporation. Things had finally begun to look up. If the company was negatively impacted\nagain, it would be very troublesome."
        },
        {
          "paragraph": "This was also why Catherine and Shaun had been putting up with Sarah before this."
        },
        {
          "paragraph": "Nevertheless, no one expected Rodney to go so far for Sarah."
        },
        {
          "paragraph": "“If you hand Sarah over, I’ll take our friendship into account and pretend that nothing happened.”\nRodney clenched his fists. He held back and gave Shaun the last chance."
        },
        {
          "paragraph": "“ She’s not here, so I can’t hand her over to you. ” Shaun had nothing much to say to Rodney, his\nformer good friend."
        },
        {
          "paragraph": "“Fine. Since you guys insist on not handing her over, don’t blame me for being abrasive once I find the\nevidence.”"
        },
        {
          "paragraph": "Rodney’s eyes flashed with utter despair. He turned around and got in his car. Then, the car drove out\nof view."
        },
        {
          "paragraph": "He headed to the hospital. After spending one night investigating the case, there had been significant\nprogress on it."
        },
        {
          "paragraph": "Only after Rodney left the manor did Shaun return to his bedroom. He picked up his phone, only to\nrealize that Chester had tried calling him a few times."
        },
        {
          "paragraph": "He immediately called Chester back. After he got through, Chester said, “I heard Rodney brought his\npeople to kick up a fuss in the Hill family’s manor. ”"
        },
        {
          "paragraph": "“Mm. He even destroyed the manor’s gate.” Shaun asked with a frown, “What on earth happened to\nSarah?”"
        },
        {
          "paragraph": "”It’s really not your doing?” Chester said in a serious tone, ”We’re buddies. Please be honest with me.”"
        }
      ]
    },
    {
      "title": "Chapter 2010 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "Shaun shook his head. “I  can tell you that I intended to attack the day Sarah went to the airport. Her\ndisappearance today has nothing to do with me.”"
        },
        {
          "paragraph": "Chester believed him. “It’s obvious. If you had done something, you would’ve expected Rodney to bring\nhis men over for a search. Based on your character, you would’ve carefully assigned people early on.\nHe wouldn’t have had a chance to barge into the Hill family’s manor.”"
        },
        {
          "paragraph": "Shaun sighed. He smiled bitterly. “You understand me best.”"
        },
        {
          "paragraph": "It was unfortunate that Rodney understood Shaun less despite knowing him for so long."
        },
        {
          "paragraph": "“Rodney understands you too, but… He always becomes irrational when it comes to matters that\ninvolve Sarah.” Chester’s voice sounded helpless too."
        },
        {
          "paragraph": "“Say no more. Actually, there’s already no more trust between Rodney and me, ” Shaun said\nmockingly, “But I’m curious about who kidnapped Sarah.”"
        },
        {
          "paragraph": "“Maybe she has other enemies she has offended.” Chester took a drag of the cigarette. “I did some\ninvestigation in the hospital. Here’s what I think happened. At g:oo p.m. last night, someone disguised\nas a doctor examined Sarah. After that person went in, they knocked out Sarah and the caregiver.\nThen, they tied Sarah outside the window and someone took Sarah away using a rope from the\nrooftop.”"
        },
        {
          "paragraph": "Shaun was astonished. “Was there no commotion at all when Sarah and the caregiver were knocked\nout in the ward?”"
        },
        {
          "paragraph": "“That’s the weird thing.” Chester was thinking about it too. “However, the caregiver said Sarah went to\nsleep very early last night. I suspect that Sarah must’ve been knocked out beforehand, but I’m not sure"
        },
        {
          "paragraph": "how that happened.”"
        },
        {
          "paragraph": "“Maybe someone tampered with her medications or everyday items.” Shaun guessed. “The person"
        },
        {
          "paragraph": "who did it was quite meticulous too. I don’t know whether the motive is to kidnap or get revenge on\nSarah. If it was for revenge, Sarah might not even be alive now.”"
        },
        {
          "paragraph": "“Don’t worry. Since she went missing in my hospital, I’ ll investigate this thoroughly for you."
        },
        {
          "paragraph": "Rodney won’t be able to blame you even if he files a police report.”"
        },
        {
          "paragraph": "At the hospital, Chester put down his phone. He stood in front of the window, looking at the sky that\nwas starting to turn bright."
        },
        {
          "paragraph": "Not long after, his subordinate came in. “Young Master Jewell, I’ve asked that caregiver. Sarah said\nshe was tired very early last night. But for the past few days, Sarah’s wounds would hurt and she would\nonly sleep at 1:00 or 2:00 a.m. She was most probably drugged. However,  there’s no problem with\nSarah’s IV drip yesterday. Her meals were arranged by Young Master Snow. The caregiver also said\nthat Sarah had an upset stomach last night and did not eat much. The only possibility would be…”"
        },
        {
          "paragraph": "Chester raised his eyebrows. “Go on.”"
        },
        {
          "paragraph": "His subordinate walked to Chester’s front and spoke in a low voice, “The toothpaste. I squeezed some\nof Sarah’s toothpaste and did a test. There are traces of drugs in it. It’s a drug that’ll make people\ndrowsy even if only a little of it comes into contact with the mouth cavity.”"
        },
        {
          "paragraph": "Chester’s pupils constricted. He recalled something all of a sudden. He had brought Eliza to Sarah’s\nward yesterday. Eliza had gone to the bathroom too. Therefore, it was very possible that she tampered"
        },
        {
          "paragraph": "with the toothpaste."
        },
        {
          "paragraph": "He pulled his subordinate over. “Where’s that toothpaste?”"
        },
        {
          "paragraph": "“It’s still in the bathroom. But it’s likely that only the front bit of the toothpaste has been tampered with.\nIf we don’t say anything, Young Master Snow won’t find out about it,” the subordinate said carefully. “I\nremember your words. If it was Young Master Hill who did this, we should erase as much evidence as\npossible stealthily. Therefore, I didn’t inform Young Master Snow anything.”"
        },
        {
          "paragraph": "“Don’t say a word about this anymore.” Chester asked in a low voice, “Who has gone into Sarah’s ward\nyesterday?”"
        },
        {
          "paragraph": "“Not many. Just Rodney, the caregiver, Cindy, Miss Eliza, and you…” After the subordinate spoke, his\ngaze became different."
        },
        {
          "paragraph": "“Is there any progress on Rodney’s side?” Chester asked all of a sudden."
        },
        {
          "paragraph": "“Yes. Snowden’s people acquired the hospital’s security footage at dawn. Sarah was taken away\nthrough the rooftop. As long as a suspicious person is found entering the rooftop at that hour, it won’t\ntake long for them to find the culprit, ” the subordinate said. “The other party definitely took Sarah away\nin a car. If the  car can be found, it’ll be easy to investigate this matter.”"
        }
      ]
    },
    {
      "title": "Chapter 2011 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "After pausing for a moment, the subordinate muttered, “Actually, the other party shouldn’t have made a\nmove at this time. There are security cameras everywhere in the hospital. It’s easy to leave traces\nbehind.”"
        },
        {
          "paragraph": "Chester took a long drag of his cigarette."
        },
        {
          "paragraph": "That was right. They should not have taken action at this time. It was too hasty."
        },
        {
          "paragraph": "Even Shaun did not make a move."
        },
        {
          "paragraph": "“Okay, I got it. You can go out. Keep an eye on the progress on Rodney’s side. Inform me immediately\nif any situation arises.”"
        },
        {
          "paragraph": "After the subordinate left, Chester dialed a number. “Find out Eliza’s movements last night. I need the\ninformation in detail as soon as possible. No matter what method you use, give it to me within 20\nminutes.”"
        },
        {
          "paragraph": "During that period, Chester kept standing in front of the window. Many incidents flashed across his\nmind."
        },
        {
          "paragraph": "For example, when he went to the club two days ago, he saw Freya and Eliza drinking there. The\nbartender said Eliza had crushed a wine glass with her hands."
        },
        {
          "paragraph": "He recalled Eliza taking the lead and kissing him yesterday in order to meet Sarah."
        },
        {
          "paragraph": "After meeting Sarah, Eliza was eager to avoid Chester again."
        },
        {
          "paragraph": "Chester laughed coldly."
        },
        {
          "paragraph": "About ten minutes later, his men gave him a call. “ Young Master Jewell, Eliza had a meal with Director\nLear until after 8:oo p.m. last night. After that, her car went into a nearby neighborhood. Her car is still\nin the neighborhood, but she’s not there. Her phone can’t be contacted as well. I checked the security\nfootage of the neighborhood. Within five minutes after Eliza’s car entered, another car without a car\nplate exited. Afterward, that car went onto the federal highway and turned into a newly constructed\nroad. There are no security cameras there, so the current situation is unknown.”"
        },
        {
          "paragraph": "“Assign people to go there and search along the newly constructed road for suspicious cars at the\nhouses or factories nearby.”"
        },
        {
          "paragraph": "After giving his orders, Chester quickly took his white coat off."
        },
        {
          "paragraph": "Doctor Jenkins, who was in the same department as Chester, had just arrived for work. Chester threw\nhis car keys to him. “Where did you park your car? Let’s swap cars for a day.”"
        },
        {
          "paragraph": "After being stunned for a few seconds and looking a t the keys to a Maybach in his hands, Dr. Jenkins\nimmediately passed his Volvo car keys to Chester."
        },
        {
          "paragraph": "“Don’t  tell anybody else about  us swapping cars. ”"
        },
        {
          "paragraph": "Chester left quickly. When he was about to arrive at the official residence, he called Freya’s number. “\nMiss Lynch, I’m Chester. I have an important matter to tell you. Please come out. I’ll wait for you at the\ndoor.”"
        },
        {
          "paragraph": "Freya was brushing her teeth. She was confused when she received Chester’s call. Was she close to\nChester? “Can’t you just talk about it over the phone? Rodney can’t possibly be in your car, right?”"
        },
        {
          "paragraph": "“If you want to save Eliza, quickly change your clothes and come out. Don’t tell anyone about this.\nDoing so will only harm Eliza.” Chester urged Freya coldly."
        },
        {
          "paragraph": "Freya was shocked. Although she was not clear about what was happening, she wiped her face in a\nhurry and ran out after simply putting on clothes."
        },
        {
          "paragraph": "At the garden, she bumped into Ryan, who had just returned from jogging. He was wearing a set of\nwhite sportswear. Looking at Freya’s frantic expression, he frowned. “It’s so early in the morning.\nWhere are you going? Has Dani woken up yet?”"
        },
        {
          "paragraph": "“Dani is still sleeping. Something urgent came up. If Aunty Loretta can’t handle her, please take care of\nDani for me.”"
        },
        {
          "paragraph": "Freya hurriedly ran toward the gates after speaking."
        },
        {
          "paragraph": "A Volvo was parked under a nearby oak tree. Chester opened the car door. Freya ran over and got in\nthe car. “What happened to Eliza?”"
        },
        {
          "paragraph": "“How well do you know your friend?” Chester turned his head and looked at Freya. His gaze was deep\nand sharp."
        },
        {
          "paragraph": "Freya was stunned. Actually, she did not know Eliza really well because Eliza was different from her.\nShe liked to share all of her thoughts while Eliza would hide hers in her heart."
        }
      ]
    },
    {
      "title": "Chapter 2012 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "“It seems like you don’t really understand your friend, ” Chester said sarcastically."
        },
        {
          "paragraph": "“ I admit that I don’t know Eliza well, but at least I understand that she’s not a two-faced person."
        },
        {
          "paragraph": "Although she’s a person of few words, she definitely prioritizes friendship. I’m willing to sacrifice\nanything for her too. ” Freya was anxious."
        },
        {
          "paragraph": "She did not want to beat about the bush anymore. “ Just be honest with me. If not, I can call Eliza and\nask her myself.”"
        },
        {
          "paragraph": "“You won’t be able to contact her now.” One of Chester’s hands rested on the steering wheel. He said\ncalmly, “Did Catherine tell you about Sarah’s disappearance?”"
        },
        {
          "paragraph": "Freya widened her eyes. “Sarah has gone missing?”"
        },
        {
          "paragraph": "Chester understood when he saw her expression. “ Sarah went missing last night. It looks like\nCatherine didn’t tell you because she didn’t want to disturb your sleep. Last night, it was as if Rodney\nhad gone insane. He brought Snowden’s men to the Hill family’s manor and created a stir. He thought it"
        },
        {
          "paragraph": "was Shaun who kidnapped Sarah. It has nothing to do with Shaun, but Rodney doesn’t believe it. He\nhas already made a police report. He’s currently at the hospital to investigate the matter. When I came\nout, it seemed like he had already found traces of the kidnapper.”"
        },
        {
          "paragraph": "It might be because Freya did not expect so many things would happen in one night that she could not\nsay anything for a long time."
        },
        {
          "paragraph": "She did not know whether she felt disheartened, disappointed, or angry."
        },
        {
          "paragraph": "Although she knew that Sarah was important to Rodney from the start, everything Rodney had done for\nSarah still surprised her."
        },
        {
          "paragraph": "The more it happened, the more she felt that her marriage with Rodney was ridiculous."
        },
        {
          "paragraph": "They were not divorced yet but Rodney was already going to such lengths for Sarah. Had he even\nconsidered Freya and the child’s feelings?"
        },
        {
          "paragraph": "Forget it. There was already an answer to that question long ago. Rodney could risk everything,\nbecome insane, and even break off friendships for Sarah."
        },
        {
          "paragraph": "Freya and the child were just extras."
        },
        {
          "paragraph": "“Rodney can investigate it all he wants.” Freya sneered. “Does this have anything to do with Eliza?”"
        },
        {
          "paragraph": "“Yes.” Chester looked toward her. “I did my investigation. Eliza was the one who kidnapped Sarah.”"
        },
        {
          "paragraph": "It was like Freya’s head had exploded. She was in shock and could not come back to her senses for a\nlong time. “It’s impossible. Could it be… Is Eliza avenging me? Why is she so foolish? Although I hate\nSarah, it’s not worth it.”"
        },
        {
          "paragraph": "After she spoke, she sobbed. She did not expect Eliza to do something so crazy for her."
        },
        {
          "paragraph": "If she were a guy, she would just get married to Eliza."
        },
        {
          "paragraph": "Chester was speechless for a moment. Did all women have such rich, self-flattering imaginations?"
        },
        {
          "paragraph": "“You’re overthinking. Eliza and Charity were childhood friends. She must’ve been close to Jennifer as\nwell.” Chester revealed the truth. “It might be because you told her something when you were drinking"
        },
        {
          "paragraph": "with her that day.”"
        },
        {
          "paragraph": "Freya, who was initially feeling touched, was speechless now. “        ”"
        },
        {
          "paragraph": "Fine, it turned out that she was overthinking."
        },
        {
          "paragraph": "However, she was surprised that Eliza and Charity were childhood friends. Why did she not hear Eliza\nmention that before?"
        },
        {
          "paragraph": "No wonder Eliza lost control and crushed the wine glass that day."
        },
        {
          "paragraph": "She must have been furious at that time."
        },
        {
          "paragraph": "However, Freya thought she and Catherine were also Charity’s good friends. Although they wanted to\navenge Charity, they could not go to such great lengths as Eliza. Freya suddenly felt ashamed. “ Young\nMaster Jewell, what can I do to help Eliza? Just tell me.”"
        }
      ]
    },
    {
      "title": "Chapter 2013 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "Chester closed the car’s windows and glanced at the time. “ Sarah has gone missing for a whole night.\nRodney is very anxious. I reckon within half an hour, Rodney will be able to locate Eliza.”"
        },
        {
          "paragraph": "Freya’s heart skipped a beat upon hearing that. “He cares about Sarah so much. If something happens\nto Sarah…”"
        },
        {
          "paragraph": "“Eliza’s whole life will be ruined, ” Chester continued. His voice was icy. “One entire night is enough for\nEliza to do many things to her. Sarah will definitely not be in one whole piece. If so, Eliza will only be\nsafe if you bear the accusation in her place.”"
        },
        {
          "paragraph": "Freya went silent in astonishment. However, she quickly calmed down from the shock."
        },
        {
          "paragraph": "Chester said, “Firstly, you have an ulterior motive. Secondly, Rodney owes you and the child. He won’t\nsend you to prison. Moreover, you have Ryan and his family backing you. You can get out of this\nunscathed.”"
        },
        {
          "paragraph": "Freya pulled her hair as her mind was in a mess. “"
        },
        {
          "paragraph": "Young Master Jewell, are you overestimating me? I think I don’t even amount to a strand of Sarah’s\nhair in Rodney’s heart. He might even kill me.”"
        },
        {
          "paragraph": "“He won’t. I’m his friend. I know him quite well. He likes you, but… Sarah’s tricks are more superior."
        },
        {
          "paragraph": "She’s like a knot in his heart that he can’t let go.”"
        },
        {
          "paragraph": "Chester spun his lighter. He saw that Freya’s lips were trembling, and she was panicking. Therefore, he\nsaid calmly, “It’s your choice. I won’t force you. I can’t reach Eliza now. Moreover, even if I contact her\nand let her escape beforehand, Rodney will keep investigating this matter if he can’t catch the"
        },
        {
          "paragraph": "culprit who kidnapped Sarah. If I could find out that"
        },
        {
          "paragraph": "the culprit is Eliza, it’s just a matter of time before Rodney finds out too. He won’t be suspicious only if\nyou appear and take the blame. He’ll stop investigating this matter then. It all boils down to whether\nyou’re willing to make such a sacrifice for Eliza.”"
        },
        {
          "paragraph": "‘Whether I’m willing or not…’"
        },
        {
          "paragraph": "Freya’s scalp tingled. She had only known Eliza for a short time, but she sincerely treated Eliza as a\ngood friend. Moreover, Eliza did this for Charity."
        },
        {
          "paragraph": "Whether from a logical or emotional perspective, Freya should help Eliza."
        },
        {
          "paragraph": "“Of course, I’m willing to help…” Freya turned her head and stared at Chester. “However, Young Master\nJewell, as long as you do something, you can protect Eliza too.”"
        },
        {
          "paragraph": "“I can protect her, but in my heart, Eliza isn’t worth me fighting with Rodney.” Chester shrugged his\nshoulders. His handsome face was heartless. “ Things will become troublesome afterward.”"
        },
        {
          "paragraph": "“I know. Young Master Jewell, you’ve always loved yourself most. Businessmen will always be\nbusinessmen. You fear losses the most. ” Freya was furious. Chester must have just wanted to have\ns*x with Eliza. Freya should be content that such a selfish man would come over to inform her of the\nsituation."
        },
        {
          "paragraph": "Chester did not comment on her words. “Suit yourself. If you agree, I’ll bring you there right now.\nActually, it’s beneficial  to you too. After this incident, Rodney will definitely divorce you.”"
        },
        {
          "paragraph": "“… Okay.” Freya nodded. She could not just watch as Eliza got into trouble. “Send me there. Do you\nknow where Eliza is now?”"
        },
        {
          "paragraph": "“I know the approximate location, but I’ll have to wait for my subordinates to find the exact location.\nLet’s go over first before Rodney does.”"
        },
        {
          "paragraph": "Chester started the car. He stepped on the accelerator and drove at high speed."
        },
        {
          "paragraph": "On the way, his men found a suspicious factory."
        },
        {
          "paragraph": "At the same time, his people at the hospital sent him information. “Young Master Jewell, Young Master\nSnow has found the car that took Sarah away last night. He’s currently heading toward your location. I\nthink he’ll arrive soon.”"
        },
        {
          "paragraph": "“Mm.”"
        },
        {
          "paragraph": "Chester immediately increased the speed to the maximum."
        },
        {
          "paragraph": "Freya did not stop him as she was worried about Eliza. She simply held the handle of the car. She felt\nnauseous."
        },
        {
          "paragraph": "She did not expect Chester to have such a wild driving style with his elegant appearance."
        },
        {
          "paragraph": "Moreover, looking at his agility, she would believe it if he used to be a race car driver."
        },
        {
          "paragraph": "In the factory."
        }
      ]
    },
    {
      "title": "Chapter 2014 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "Sarah was already barely alive from being tortured. She lay on the ground like a corpse, and blood had\npooled underneath her."
        },
        {
          "paragraph": "She only had one thought. She would rather die. “Please… I beg you. Kill me…”"
        },
        {
          "paragraph": "Sarah begged in despair."
        },
        {
          "paragraph": "She regretted it at that moment. She should not have come back after she escaped from Australia back\nthen."
        },
        {
          "paragraph": "She had been tortured for too long. She could not endure it anymore. She blacked out and fainted."
        },
        {
          "paragraph": "Eliza looked at the time. It should be daylight outside."
        },
        {
          "paragraph": "She could not delay any longer. Although she wanted to continue torturing Sarah slowly, she reckoned\nthat with Rodney’s abilities, he would be arriving soon."
        },
        {
          "paragraph": "It was okay if she was caught. She was already prepared for the worst."
        },
        {
          "paragraph": "However, she had to take Sarah’s life."
        },
        {
          "paragraph": "Eliza took out a knife that she had prepared. The gleam of the blade reflected her fierce, reddened\neyes that were behind the mask."
        },
        {
          "paragraph": "If possible, she did not want to go this far either. However, she could not tolerate Sarah going\nunpunished by the law. She had to resolve some grudges herself."
        },
        {
          "paragraph": "Eliza closed her eyes with the knife in her hands. She was about to strike."
        },
        {
          "paragraph": "Bang! The iron door outside was kicked open."
        },
        {
          "paragraph": "When Chester and Freya, who barged in, saw the scene in the basement, they felt chills all over."
        },
        {
          "paragraph": "Especially Freya. She could not believe that the woman wearing the scary mask was the shining\ncelebrity in her heart, Eliza."
        },
        {
          "paragraph": "“Eliza, stop.” Freya rushed over."
        },
        {
          "paragraph": "Eliza’s hands were trembling. She did not expect that the people who arrived first would be Chester\nand Freya. Freya was her best friend. Moreover, she was wearing a mask but Freya still recognized\nher."
        },
        {
          "paragraph": "She did not wish for Freya to see her like this. She was born with a grim fate. Her parents were dead,\nand her siblings who were alive were evil. Friends were everything to her. They were the only sunlight\nin her life too."
        },
        {
          "paragraph": "While Eliza was in a daze, Freya took the opportunity and snatched the knife from her hands. When\nshe saw Sarah lying on the ground, she was stunned."
        },
        {
          "paragraph": "Was that still Sarah? Dirt stuck to Sarah from head to toe. She was utterly filthy. There were even\ndisgusting maggots wiggling on her head."
        },
        {
          "paragraph": "That was not the most shocking scene. What surprised Freya the most was that Sarah’s limbs were\nsmeared with blood…"
        },
        {
          "paragraph": "When Freya was stunned, Eliza returned to her senses and snatched the knife back."
        },
        {
          "paragraph": "“Eliza, stop.” At that time, Chester rushed over and restrained her wrists. At the same time, he yanked\nthe mask away and revealed Eliza’s pretty yet cold face."
        },
        {
          "paragraph": "Eliza’s gaze made Chester’s heart tremble. He had never seen a woman with a gaze so cold as if she\nwas a demon from hell."
        },
        {
          "paragraph": "“Eliza, it’s really you.” Freya’s last hope in her  heart was gone. However, she was not angry. Seeing\nEliza in that state made Freya feel more sorry for her."
        },
        {
          "paragraph": "Let me go, Mr. Hill By Shallow South Chapter 2019"
        },
        {
          "paragraph": "Sarah was already barely alive from being tortured. She lay on the ground like a corpse, and blood had\npooled underneath her."
        },
        {
          "paragraph": "She only had one thought. She would rather die. “Please… I beg you. Kill me…”"
        },
        {
          "paragraph": "Sarah begged in despair."
        },
        {
          "paragraph": "She regretted it at that moment. She should not have come back after she escaped from Australia back\nthen."
        },
        {
          "paragraph": "She had been tortured for too long. She could not endure it anymore. She blacked out and fainted."
        },
        {
          "paragraph": "Eliza looked at the time. It should be daylight outside."
        },
        {
          "paragraph": "She could not delay any longer. Although she wanted to continue torturing Sarah slowly, she reckoned\nthat with Rodney’s abilities, he would be arriving soon."
        },
        {
          "paragraph": "It was okay if she was caught. She was already prepared for the worst."
        },
        {
          "paragraph": "However, she had to take Sarah’s life."
        },
        {
          "paragraph": "Eliza took out a knife that she had prepared. The gleam of the blade reflected her fierce, reddened\neyes that were behind the mask."
        },
        {
          "paragraph": "If possible, she did not want to go this far either. However, she could not tolerate Sarah going\nunpunished by the law. She had to resolve some grudges herself."
        },
        {
          "paragraph": "Eliza closed her eyes with the knife in her hands. She was about to strike."
        },
        {
          "paragraph": "Bang! The iron door outside was kicked open."
        },
        {
          "paragraph": "When Chester and Freya, who barged in, saw the scene in the basement, they felt chills all over."
        },
        {
          "paragraph": "Especially Freya. She could not believe that the woman wearing the scary mask was the shining\ncelebrity in her heart, Eliza."
        },
        {
          "paragraph": "“Eliza, stop.” Freya rushed over."
        },
        {
          "paragraph": "Eliza’s hands were trembling. She did not expect that the people who arrived first would be Chester\nand Freya. Freya was her best friend. Moreover, she was wearing a mask but Freya still recognized\nher."
        },
        {
          "paragraph": "She did not wish for Freya to see her like this. She was born with a grim fate. Her parents were dead,\nand her siblings who were alive were evil. Friends were everything to her. They were the only sunlight\nin her life too."
        },
        {
          "paragraph": "While Eliza was in a daze, Freya took the opportunity and snatched the knife from her hands. When\nshe saw Sarah lying on the ground, she was stunned."
        },
        {
          "paragraph": "Was that still Sarah? Dirt stuck to Sarah from head to toe. She was utterly filthy. There were even\ndisgusting maggots wiggling on her head."
        },
        {
          "paragraph": "That was not the most shocking scene. What surprised Freya the most was that Sarah’s limbs were\nsmeared with blood…"
        },
        {
          "paragraph": "When Freya was stunned, Eliza returned to her senses and snatched the knife back."
        },
        {
          "paragraph": "“Eliza, stop.” At that time, Chester rushed over and restrained her wrists. At the same time, he yanked\nthe mask away and revealed Eliza’s pretty yet cold face."
        },
        {
          "paragraph": "Eliza’s gaze made Chester’s heart tremble. He had never seen a woman with a gaze so cold as if she\nwas a demon from hell."
        },
        {
          "paragraph": "“Eliza, it’s really you.” Freya’s last hope in her  heart was gone. However, she was not angry. Seeing\nEliza in that state made Freya feel more sorry for her."
        }
      ]
    },
    {
      "title": "Chapter 2015 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "“Give me the knife.” Eliza did not want to hide anymore.“ I’m doing what I have to do. Let me take\nSarah’s life.”"
        },
        {
          "paragraph": "“Eliza, you can’t kill her. You’ll go to jail. Once you’re in prison, the rest of your life will be ruined,” Freya\ndissuaded her anxiously. “Sarah is hateful. I desperately want her to die as well."
        },
        {
          "paragraph": "However, the law will punish her. She’s not worth you using the rest of your life to get revenge on her.”"
        },
        {
          "paragraph": "“I want her to be punished by the law too, but there’s no evidence. If possible, I don’t want to go this far\neither.” Eliza’s eyes were filled with determination. No one understood her pain."
        },
        {
          "paragraph": "“We can slowly collect evidence,” Freya shouted at Eliza. “You’re my best friend. I can’t just stand by\nand watch as you ruin your life for such a scumbag. C’mon, let’s leave quickly.”"
        },
        {
          "paragraph": "“Leave?” Eliza laughed. Where could she go?"
        },
        {
          "paragraph": "She had nowhere to go. As long as Rodney kept investigating, he would easily find her."
        },
        {
          "paragraph": "Rather than have that happen, it would be better if she killed Sarah first."
        },
        {
          "paragraph": "“Even if I leave, I have to kill her before I go.” Eliza tried to escape Chester’s grasp, but that man’s\nhands were like handcuffs."
        },
        {
          "paragraph": "She could not hold it in anymore and pushed Chester. “Chester, let go. This is my own business. ”"
        },
        {
          "paragraph": "Moreover, if it were not for the man in front of her, she would not have to go that far. Her parents would\nnot have died either."
        },
        {
          "paragraph": "Chester did not waste any more time talking to Eliza. He raised his hand and knocked her out."
        },
        {
          "paragraph": "Eliza’s body fell toward the ground. Chester immediately caught her."
        },
        {
          "paragraph": "Freya was flustered. “Why did you…”"
        },
        {
          "paragraph": "“Would she leave if we don’t knock her out?”  Chester took the car keys from Eliza’s pocket and tossed\nthem to Freya. “If you want Rodney not to suspect Eliza, remember what I told you before. The car\noutside is yours, and you were  the one who hired the people who kidnapped Sarah. When Rodney\ncomes, you mustn’t let him suspect anything.”"
        },
        {
          "paragraph": "Freya, who had to bear such a huge crime, panicked. However, looking at Eliza’s pale face, she held it\nin and clenched the car keys tightly. “I know. Take her and leave.”"
        },
        {
          "paragraph": "Chester carried Eliza. As he left, he glanced at Freya. “Hang in there. I’ve already contacted Catherine\nand Shaun. They’re on their way here.”"
        },
        {
          "paragraph": "After he spoke, he left with Eliza in his arms."
        },
        {
          "paragraph": "Freya stood there alone for a while. She found the surroundings smelly and creepy."
        },
        {
          "paragraph": "She crept toward Sarah and checked for her breath. Sarah was still breathing. Luckily, she had not died\nyet."
        },
        {
          "paragraph": "Freya was actually very frightened. Chester said Rodney would let her off the hook, but she did not\nreally believe him. Sarah was so important to Rodney. When Rodney saw Sarah’s state later, Freya did\nnot know whether he would kill her on impulse or not."
        },
        {
          "paragraph": "However, Freya did not regret it. If Eliza stayed back, the chance of her dying was 1oo percent. At\nleast, Freya still had a 50 percent chance of living."
        },
        {
          "paragraph": "Nevertheless,  the other 50 percent  made  her think of Dani. She became terrified."
        },
        {
          "paragraph": "At that moment, Freya’s phone rang. The word ‘ Ryan’ on the screen was like a lifeline in the darkness."
        },
        {
          "paragraph": "She picked up the call immediately. Her voice was trembling. “R-Ryan…”"
        },
        {
          "paragraph": "“Freya, where did you go? I’m on the federal highway. Tell me the location.” Ryan’s anxious voice came\nthrough the phone."
        },
        {
          "paragraph": "“What highway?” Freya reacted half a beat later. She almost cried. “Is it the place that I passed through\njust now? I’m  inside this factory…”"
        }
      ]
    },
    {
      "title": "Chapter 2016 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "Before Freya finished speaking, sounds of gunshots came from upstairs."
        },
        {
          "paragraph": "Freya was startled, and her hand jolted. The phone fell to the ground."
        },
        {
          "paragraph": "Before she could pick it up, a group of people marched in. The person leading them was Rodney. He\nwas wearing navy blue pajamas. She remembered that she had bought that set of pajamas for him\nwhen she was shopping some time ago."
        },
        {
          "paragraph": "Rodney was wearing the pajamas that Freya had bought to save another woman."
        },
        {
          "paragraph": "The lamps on the walls faintly illuminated the gloomy scene."
        },
        {
          "paragraph": "Rodney instantly saw Freya, who was standing there. Her clear, big eyes were staring straight at him."
        },
        {
          "paragraph": "At that moment, it was as if Rodney’s head had exploded."
        },
        {
          "paragraph": "When his gaze traveled to Sarah, who was in a terrible state beside Freya’s feet, his eyes widened in\nanger and viciousness."
        },
        {
          "paragraph": "“Sarah…” Rodney rushed forward and carried Sarah gently. He was afraid of hurting her as her body\nwas covered in wounds."
        },
        {
          "paragraph": "Freya thought Sarah was dirty and smelly. She had the urge to wash her hands even after touching her\nfor a second just now. However, Rodney did not care at all. He carried Sarah as if he was carrying a\nbeloved treasure he had gotten back after losing it."
        },
        {
          "paragraph": "“ Sarah, what’s wrong? Wake up, ” Rodney shouted anxiously. Sarah did not react at all. He checked\nher limbs. Then, he raised his head. His bloodshot eyes were glaring at Freya furiously."
        },
        {
          "paragraph": "“You cut the tendons of her hands and legs?” Freya’s legs trembled under his gaze."
        },
        {
          "paragraph": "She had never seen Rodney so angry before. In the past, she had not seen him that way no matter\nhow badly they fought. She even sensed a hint of murderous intent."
        },
        {
          "paragraph": "Though she was scared, she found it ridiculous."
        },
        {
          "paragraph": "Chester said she could not let Rodney be suspicious. In fact, Rodney would not be suspicious at all. He\nhad already determined that she was the one who did everything without even asking."
        },
        {
          "paragraph": "It was evident that he did not understand her at all."
        },
        {
          "paragraph": "However, it was fine that way. A lot of trouble could be avoided."
        },
        {
          "paragraph": "“She… She deserves it…”"
        },
        {
          "paragraph": "Freya stammered. Before she could finish talking,"
        },
        {
          "paragraph": "Rodney kicked her hard in the chest. Her petite body hit against the wall behind her. She crumpled on\nthe ground in pain. All her organs felt twisted."
        },
        {
          "paragraph": "Actually, her self-defense skills were decent. She had learned some skills from Catherine when she\nwas overseas. However, she probably did not expect the man who shared a bed with her to attack her."
        },
        {
          "paragraph": "“Freya, you’ve disappointed me. I never thought you were such an evil person. ” Rodney walked to\nFreya’s front. He looked down at her as if he was looking at an enemy. “If you were dissatisfied about\nsomething, you could’ve come looking for me. Why did you have to hurt Sarah? Her whole life is ruined\nbecause of you.”"
        },
        {
          "paragraph": "Freya could listen no more. She retorted weakly, “ What comes around goes around…”"
        },
        {
          "paragraph": "“ Shut up!” Rodney was like a beast that had gone crazy. He stepped on her chest. “The truly evil\nperson is you. I was blind to have actually fallen in"
        },
        {
          "paragraph": "love with you in the past. You can’t compare to Sarah at all. Marrying you was the biggest mistake of\nmy life, you vicious woman!”"
        },
        {
          "paragraph": "Freya’s chest hurt so much that she could not say a word."
        },
        {
          "paragraph": "She simply glared at Rodney with her bloodshot eyes. “What a coincidence. Getting married to you was\nthe greatest mistake of my life too.”"
        },
        {
          "paragraph": "Rodney was worried about Sarah. He did not have any more energy to confront Freya."
        }
      ]
    },
    {
      "title": "Chapter 2017 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "Rodney turned around and gave his orders. “Call the police. Capture this woman and send her to the\npolice station.”"
        },
        {
          "paragraph": "After giving out instructions, he carried Sarah and hurriedly headed out."
        },
        {
          "paragraph": "He turned back after walking a few steps. He looked at Freya coldly. “You brought everything upon\nyourself. You have to bear the responsibilities since you broke the law. You’d better pray that Sarah\ndoesn’t die. If not, I’ll make you compensate with your life.”"
        },
        {
          "paragraph": "He left afterward."
        },
        {
          "paragraph": "Freya got up groggily. Before she could properly stand on her feet, both of her arms were restrained."
        },
        {
          "paragraph": "She was taken outside. With each step, her abdomen hurt from getting kicked by Rodney. Even her\nribs were hurting. The pain made her face pale, and she was swaying as she walked."
        },
        {
          "paragraph": "Those people did not care about Freya’s condition. Seeing that she could not walk properly, they simply\ndragged her toward the car."
        },
        {
          "paragraph": "When she was about to get dragged into the car, a black off-road SUV sped over. Then, Ryan’s sturdy\nfigure got out of the car."
        },
        {
          "paragraph": "The moment Freya saw him, it was as if she had seen a ray of hope. Tears glinted in her eyes."
        },
        {
          "paragraph": "Ryan came."
        },
        {
          "paragraph": "Freya did not know what was happening recently. Whenever she was in despair, Ryan would descend\nfrom the sky like an angel."
        },
        {
          "paragraph": "Rodney turned around and gave his orders. “Call the police. Capture this woman and send her to the\npolice station.”"
        },
        {
          "paragraph": "Ryan’s gaze focused on the hands that were grabbing Freya’s arms. A dark, icy gleam flashed across\nhis eyes, and he walked over. There was aggressiveness on his usually elegant face. “Let her go.”"
        },
        {
          "paragraph": "The people who were grabbing Freya’s arms were Snowden’s people. They recognized Ryan."
        },
        {
          "paragraph": "After exchanging glances with each other, the subordinate who had the largest build said, “Young\nMaster Ryan, I’m afraid I can’t do that. Young Master Snow ordered me to send her to the police\nstation.”"
        },
        {
          "paragraph": "Ryan turned his sharp gaze to him. “Landon, you’re a member of Snowden. The Snow family"
        },
        {
          "paragraph": "painstakingly nurtured all of you. You don’t belong to Rodney alone. You have to understand that if my\ngrandpa and uncle were here, they wouldn’t let you take Freya away either. Freya is still a member of\nthe Snow family. She’s also the prime minister’s goddaughter.”"
        },
        {
          "paragraph": "Landon kept silent."
        },
        {
          "paragraph": "Instead, another subordinate stammered,  “But Freya barely kept Sarah alive. Young Master Snow is\nfurious. If we let you take her away, Young Master Snow won’t let us off the hook…”"
        },
        {
          "paragraph": "“ Is it all thanks to Rodney that the Snow family is able to achieve its position today? No.”"
        },
        {
          "paragraph": "Ryan watched the people in front of him coldly. “ I admit that all of you have been obedient following\nRodney’s words lately. It also appears as if Snowden belongs to him now. However, let me remind you\nof one thing. Without my father, Snowden wouldn’t be thriving as it is now. If the elites that the Snow\nfamily nurtured end up belonging to a single"
        },
        {
          "paragraph": "person, there’s no need for Snowden to exist anymore."
        },
        {
          "paragraph": "“Besides, even if Snowden dissolves in the future, it’s not happening now.”"
        },
        {
          "paragraph": "Ryan was usually a gentle person. However, once he was angered, he exuded the same aura as\nNathan, which made the members of Snowden feel fear."
        },
        {
          "paragraph": "Ryan reached out his hand and pulled Freya into his embrace from their arms."
        },
        {
          "paragraph": "Freya’s body was swaying. She could not even straighten her back. Her pretty mixed-race-like face\ngrimaced in pain as well."
        },
        {
          "paragraph": "Ryan carried her and placed her on the passenger seat gently. He fastened the seat belt for her and\ntold the members of Snowden behind him, “You don’t have to report this to the police. Let this matter\nend here.”"
        },
        {
          "paragraph": "After he spoke, he got in the driver’s seat. He started the car and drove away."
        },
        {
          "paragraph": "In the car, Freya was clutching her stomach in pain. She said strenuously, “Can you… give Shaun a\ncall? He and Catherine… are coming over here too.”"
        },
        {
          "paragraph": "After glancing at her with a frown, Ryan called Shaun. “You guys don’t have to come anymore. I’ve\nalready taken Freya away… But I think she has to go to the hospital… No, we’re not going to the Jewell\nfamily’s hospital. We’re heading to Militaire Hospital…”"
        }
      ]
    },
    {
      "title": "Chapter 2018 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "After informing Shaun, Ryan’s hand moved toward Freya’s stomach."
        },
        {
          "paragraph": "If it were before, Freya would definitely push him away. However, she was in too much pain to bother.\nTherefore, she let his fingers press down on her stomach."
        },
        {
          "paragraph": "“What happened?” Ryan’s brows were knitted together in such a tight frown. “Did someone kick you?”"
        },
        {
          "paragraph": "Freya did not say a word. She just lowered her head. Her eyelashes cast shadows below her eyelids.\nNot long after, there were tears on her eyelashes."
        },
        {
          "paragraph": "“Who did it?” Ryan asked coldly. “Rodney?”"
        },
        {
          "paragraph": "Freya bit her lip. It seemed like all of her pain and grievances were brought upon by Rodney. She felt\nlike crying, but she did not let herself break down. However, when she spoke, her throat was hoarse. “\nSarah was badly hurt. He kicked me twice. Do you think I’m an evil person?”"
        },
        {
          "paragraph": "“You wouldn’t have done this kind of thing, ” Ryan said without hesitation. “During this period, we’ve\nbeen staying in the official residence and saw each other every morning and night. Where would you\nhave the brain and guts to plan a kidnapping?"
        },
        {
          "paragraph": "Although I don’t understand why you showed up here, we can still prove your innocence by finding\nevidence.”"
        },
        {
          "paragraph": "Freya did not even cry when her body was in extreme pain. However, hearing Ryan’s unconditional\ntrust for her, she broke down and cried."
        },
        {
          "paragraph": "She had not interacted much with Ryan. Nevertheless, the person who understood her best was not\nher husband but Ryan, her brother in name."
        },
        {
          "paragraph": "He trusted her character firmly."
        },
        {
          "paragraph": "On the other hand, Rodney thought she was an evil woman."
        },
        {
          "paragraph": "Ryan did not expect that Freya would cry so hard. He quickly stopped the car and handed tissues to\nher to wipe her tears. “Don’t cry. It’s not worth crying for people who don’t believe in you.”"
        },
        {
          "paragraph": "“You’re right. ” Freya sobbed. She looked at him, her vision blurry from her tears. “I’m just touched that\nyou trust me so much.”"
        },
        {
          "paragraph": "Her petite face was tear—streaked. Her hair was messy, and her clothes were dirty. However, Ryan’s\nheart went utterly soft. Even his tone became more gentle. “Of course, I believe you.”"
        },
        {
          "paragraph": "“Thank you.” Freya sniffed. “But… I have my reasons. I have to take responsibility for this matter. It can\nonly be me who kidnapped Sarah. ”"
        },
        {
          "paragraph": "Ryan went silent. After looking at her with a complicated gaze for a while, he said, “If Sarah is badly\nwounded, Rodney won’t just let this matter slide.”"
        },
        {
          "paragraph": "“Then let him send me to prison, ” Freya said hopelessly."
        },
        {
          "paragraph": "Ryan sighed. “Don’t talk nonsense. No matter what reasons you have, I’ll help you anyway.”"
        },
        {
          "paragraph": "Freya was touched. Her throat felt bitter. “Ryan, I’m sorry. I’m troubling you again.”"
        },
        {
          "paragraph": "“I’m happy to be troubled by you,” Ryan said softly."
        },
        {
          "paragraph": "The atmosphere was strangely silent for a few seconds."
        },
        {
          "paragraph": "Weirdly, Freya’s heartbeat sped up a little. She wanted to get up to look at Ryan, but her ribs were\nsuddenly throbbing in pain. Cold sweat broke out on her forehead as well."
        },
        {
          "paragraph": "“Don’t move. I’ll send you to the hospital immediately.” Ryan drove the car and stepped harder on the\naccelerator."
        },
        {
          "paragraph": "Upon arriving at the hospital, Freya was already in so much pain it felt like she was giving birth. Even\nwalking was strenuous for her."
        },
        {
          "paragraph": "Ryan carried her to the emergency room in a hurry."
        }
      ]
    },
    {
      "title": "Chapter 2019 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "Then, Ryan accompanied Freya to undergo body check-ups. When the results of her chest X-ray were\nout, the doctor confirmed that she had a broken rib."
        },
        {
          "paragraph": "Freya did not expect Rodney’s kick to be so ruthless. He kicked her until she broke a rib on the spot."
        },
        {
          "paragraph": "No wonder she was in so much pain. She even had difficulty breathing."
        },
        {
          "paragraph": "“Doctor, with my condition… How long do I need to recover?” Freya could not conceal the worry in her\neyes. “I still have to raise a kid…” She had to breastfeed too."
        },
        {
          "paragraph": "“About one month. With your condition, you can’t even carry your child, not to mention take care of the\nchild. You have to be careful too. Don’t ever catch a cold. Once you catch a cold, you’ll get a chest\ninfection easily. ” After the doctor reminded her, he glanced at Ryan. “You’re her husband, right? Take\ncare of the child more often. You can only wean the baby as well.”"
        },
        {
          "paragraph": "Ryan’s face heated up. A hint of awkwardness flashed across his face."
        },
        {
          "paragraph": "Freya quickly explained, “He’s not my husband. He’s my… younger brother…”"
        },
        {
          "paragraph": "“Your brother?” The doctor gazed at both of them. Usually, doctors were busy people. They would not\nhave any leisure time to chat with patients."
        },
        {
          "paragraph": "However, the woman was beautiful, and the man was handsome. Doctors could not help but pay more\nattention whenever they saw pleasant- looking people. “You two don’t look alike. You look like you’re\nthe same age too.”"
        },
        {
          "paragraph": "There was no doubt that they did not look alike. Ryan was Freya’s godbrother."
        },
        {
          "paragraph": "“Doctor, please treat her wounds as soon as possible. She looks like she’s in a lot of pain.” Ryan urged\nthe doctor."
        },
        {
          "paragraph": "The doctor then told him to pay the bill."
        },
        {
          "paragraph": "Not long after, Catherine and Shaun rushed over. When Catherine saw Freya sitting on the bed stiffly"
        },
        {
          "paragraph": "with her chest wrapped in gauze, she was exasperated. “What on earth happened?”"
        },
        {
          "paragraph": "Catherine did not have a good rest after Rodney disturbed them last night. When she could finally rest\nat dawn, she received Chester’s call telling her to rush over to a location to save Freya. She dragged\nShaun along. When they were halfway there, Ryan informed her that Freya had been sent to the\nhospital."
        },
        {
          "paragraph": "Freya leaned on the pillow. Her body did not move at all. An IV tube was attached  to the back of her\n hand. Every part of her body hurt. “Rodney kicked me.”"
        },
        {
          "paragraph": "“You were the one who kidnapped Sarah?” Shaun raised his eyebrows. His gaze was strange."
        },
        {
          "paragraph": "Catherine immediately rolled her eyes at him. “ You’re overestimating Freya. With her mere abilities, I\nreckon she doesn’t even have the contact number of the kidnappers.”"
        },
        {
          "paragraph": "Freya smiled sheepishly and sighed. She said to Ryan and Shaun, “Can you guys go out for a few\nmoments? I have something I want to discuss with Cathy privately.”"
        },
        {
          "paragraph": "“Okay. I’ll go and buy some breakfast. What do you want to eat?” Ryan asked gently."
        }
      ]
    },
    {
      "title": "Chapter 2020 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "Freya felt pretty hungry upon hearing Ryan mentioning breakfast. However, she was in too much pain\nand did not have much of an appetite. “ The doctor told me to eat soft foods…”"
        },
        {
          "paragraph": "“Okay. I understand. ” Ryan nodded and went out with Shaun. As he left, he closed the door as well."
        },
        {
          "paragraph": "Catherine looked at Freya with a straight face. “ Freya, do you know the person who kidnapped\nSarah?”"
        },
        {
          "paragraph": "“As expected, you know me best.” Freya laughed bitterly. She said with complicated feelings, “The\nperson who kidnapped Sarah was Eliza.”"
        },
        {
          "paragraph": "“…”"
        },
        {
          "paragraph": "Catherine’s pretty face carried a shocked expression."
        },
        {
          "paragraph": "“It’s shocking, right? I had the same reaction  as you when I found out.” Eliza’s cold gaze from before\nflashed across Freya’s mind. She could not help but shiver. “It was Chester who found out about it first.\nHe contacted me. When we rushed over, Eliza was about to kill Sarah. However, I stopped her. I was\nafraid things would be difficult to deal with if she really killed Sarah. Besides, when I checked on Sarah,\nEliza had cut the tendons to her limbs. Chester said that Rodney could surely figure out it was Eliza\nwho did it if he continued investigating the matter. The only way was for me to stay at the scene. With\nconcrete evidence, Rodney would not be suspicious as I do have an ulterior motive.”"
        },
        {
          "paragraph": "Catherine understood quickly. “So Rodney was the one who hurt you?”"
        },
        {
          "paragraph": "Freya nodded. Her eyes were filled with mockery. “ Rodney arrived after Chester took Eliza away.\nSarah is really very important to him. I’ve never seen him so furious before. If he wasn’t in a hurry to\nsend Sarah to the hospital, he probably would’ve killed me there and then. He initially wanted to send"
        },
        {
          "paragraph": "me to the police station, but Ryan came over and took me away. Nevertheless, Rodney surely won’t sit\nstill and do nothing.”"
        },
        {
          "paragraph": "“Rodney has truly gone mad.” Catherine clenched her fists out of anger. “Sarah has done so many bad\nthings. She’s just receiving retribution for them. ”"
        },
        {
          "paragraph": "“But Rodney doesn’t think so. In his heart, Sarah has gone through a lot.” Freya sighed. “Actually, it’s\ngood that I stayed back instead of Eliza. I don’t dare to imagine what would’ve happened if Rodney\nknew the culprit was Eliza. He would’ve killed Eliza on the spot.”"
        },
        {
          "paragraph": "“Did Eliza agree to you taking the blame for her?” Catherine asked."
        },
        {
          "paragraph": "“No. Chester knocked her out and brought her away.” Freya recalled the situation. She frowned. “ Eliza\nwas in a crazy, extreme state. Actually, we all despise Sarah, but I think Eliza hates her more."
        },
        {
          "paragraph": "Chester said Eliza and Charity were best friends from childhood…”"
        },
        {
          "paragraph": "“We were Charity’s best friends too, but we’ve never gone that far just because of our grudges. ”\nCatherine was ashamed. However, she felt something was strange at the same time."
        },
        {
          "paragraph": "“That’s right, ” Freya said bleakly. “Ever since Charity left, we haven’t done anything for her. Think\nabout it. When Charity went to jail back then, Shaun and Rodney played a role in putting her there.\nAlthough they were deceived, some things are still facts. I just took the blame after thinking about it.\nThis way, I can protect Eliza and avenge Charity at the same time.”"
        },
        {
          "paragraph": "“Mm.” Catherine’s heart grew heavy upon hearing it. She was upset. She was living happily, but she felt\nas if she was living on stolen happiness when she thought about Charity sometimes."
        },
        {
          "paragraph": "Charity would be their regret for the rest of their lives."
        },
        {
          "paragraph": "“Cathy, I’m only telling this  to you.  I  hope  you don’t tell anyone else about this, including Shaun. After\nall, it’s better not to have so many others in the loop.” Freya reminded Catherine."
        },
        {
          "paragraph": "“I won’t. Rodney might not let things slide, but don’t worry. I won’t let you go to jail. Even if it means…\ncontacting my mother and asking her to pressure the prime minister…”"
        },
        {
          "paragraph": "Freya’s pale lips moved. She stammered, “Ryan said he’ll solve this problem…”"
        },
        {
          "paragraph": "Catherine was stunned upon hearing that. She gave Freya an astonished and ambiguous gaze. “He\ntreats you pretty well, huh? By the way, if it weren’t for him getting there in time today, you would’ve\nbeen at the police station now.”"
        },
        {
          "paragraph": "“I’m his sister, okay?” Freya’s heart warmed all over. At that time, her whole body was in pain. She was\nscared and helpless. However, after Ryan showed up, she suddenly did not feel scared anymore. It felt\nlike she had someone to lean on."
        }
      ]
    },
    {
      "title": "Chapter 2021 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "“Sister? Aren’t you a few months older than him?” Catherine teased playfully. “Oh well. Unfortunately,\nhe wasn’t the one you slept with back then. His character is much better than Rodney.”"
        },
        {
          "paragraph": "Freya was stunned. She would not argue with Ryan, nor would they turn against each other. Moreover,\nRyan was quite attentive and warm. If it had been him…"
        },
        {
          "paragraph": "Hold on. What on earth was she thinking?"
        },
        {
          "paragraph": "Ryan was Rodney’s cousin. She should not even think about such a thing at all."
        },
        {
          "paragraph": "“Don’t talk nonsense.” Freya quickly glared at Catherine. “He’s my godbrother and Rodney’s cousin.\nYour thoughts are ludicrous.”"
        },
        {
          "paragraph": "She spoke so hastily that she became agitated. Her chest hurt, and she was a little short of breath."
        },
        {
          "paragraph": "“Fine, fine. I was just saying. Why are you so agitated?” Catherine promptly comforted Freya. “ Since\nI’ll be accompanying you in the hospital these few days, I asked Shaun to find out Sarah’s condition.”"
        },
        {
          "paragraph": "She went out to search for Shaun and spotted him talking on the phone at the staircase."
        },
        {
          "paragraph": "Only after Shaun saw Catherine did he say, “Keep a close eye on her. If there’s anything, just give me\na call.” After hanging up, he said, “Elle just informed me that Sarah is in the emergency room. Her\nactual condition is still unknown, but it seems very serious.”"
        },
        {
          "paragraph": "“Where’s Rodney?” Catherine changed the subject anxiously."
        },
        {
          "paragraph": "“He’s waiting outside the emergency room.” Then, he saw Catherine furrowing her brows, and he\nimmediately pulled her to him. “What did Freya say? Who actually kidnapped Sarah?”"
        },
        {
          "paragraph": "“ Stop probing into this matter… You can take it as Freya’s doing. Don’t pursue it anymore. The only\nthing we can do is prevent Freya from going to jail.” Catherine held his hands tightly. The anger on her\nface was apparent. “I hope Rodney is humane enough to not make this a big deal, considering that\nFreya gave birth to his child.”"
        },
        {
          "paragraph": "“Don’t worry. When I went to meet Old Master Snow, everyone in the Snow sided with Freya. Let’s all\npressure Rodney. I believe he won’t be bold enough to turn against everyone in the Snow family for the\nsake of Sarah,” Shaun said with a smile. “ Frankly speaking, if it were Freya’s doing, I would really\nadmire her.”"
        },
        {
          "paragraph": "“Alright. Go on over to the Snow family’s house. I need to stay here and look after Freya. I won’t go\nhome these few days.” Catherine pushed him slightly."
        },
        {
          "paragraph": "At the thought that he would not be able to hug Catherine to sleep for so many days, he felt a little\nreluctant to leave her. “You should inform the Lynches. She needs a caretaker.”"
        },
        {
          "paragraph": "“We’ll hire a caretaker, but there’s no need to inform the Lynches. If Freya’s parents find out that\nRodney kicked and broke one of her ribs, they’ll definitely be worried.”"
        },
        {
          "paragraph": "After Catherine saw Shaun off and returned to the ward, Ryan was already back. He was feeding Freya\nsoup by the side of the bed. He blew on every spoonful to cool it down before feeding her."
        },
        {
          "paragraph": "At the scene, a hint of strangeness crossed Catherine’s mind."
        },
        {
          "paragraph": "She knocked on the door and asked with a smile, “Do you need me to feed you?”"
        },
        {
          "paragraph": "“You’re still here, eh?” Ryan was surprised."
        },
        {
          "paragraph": "Freya swallowed the soup weakly before she quickly said, “Cathy, why don’t you go home first? Ryan\nsaid that he had found a caretaker for me. After all, you need to look after your kids…”"
        },
        {
          "paragraph": "“It’s fine. Shaun will look after them. I’ll stay here so that you won’t be bored.” Catherine walked up to\nher with a grin."
        },
        {
          "paragraph": "After some thought, Ryan passed the soup to Catherine. “Alright, then. After all, I’m a man. It can be\ninconvenient at times.”"
        },
        {
          "paragraph": "Catherine touched the bowl that was filled with boiling soup and glanced at Ryan in admiration."
        },
        {
          "paragraph": "Regardless of his intentions, it would be bad for Freya’s reputation if she got too close with a man\nbefore she got a divorce. In this regard, Ryan was quite educated."
        },
        {
          "paragraph": "“Freya, rest well in the hospital. I’ll take care of Dani for you.” Ryan turned around and said softly, “ I’ve\nalso arranged for someone to guard the door so that nobody will barge in.”"
        },
        {
          "paragraph": "“Thank you…”"
        },
        {
          "paragraph": "Freya was at ease knowing that he had done all she could think of."
        },
        {
          "paragraph": "“ I haven’t told my parents about this issue, so I’m going to the Lodge to discuss it with them. You don’t\nhave to worry. ” Ryan reminded her before leaving."
        }
      ]
    },
    {
      "title": "Chapter 2022 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "Catherine replaced Ryan by sitting in his seat. She learned to blow on the soup as he did. However,\nwhen the food entered Freya’s mouth, Freya grumbled softly, “Cathy, it’s hot. Are you trying to burn my\ntongue?”"
        },
        {
          "paragraph": "Catherine was speechless. “But it wasn’t hot when Ryan fed you just now, huh?”"
        },
        {
          "paragraph": "“He cooled it down first.”"
        },
        {
          "paragraph": "Fine. Did that mean Catherine was not attentive as a man?"
        },
        {
          "paragraph": "Outside the emergency room."
        },
        {
          "paragraph": "Rodney wrapped his hands around his head and waited outside for two hours before the doctor finally\ncame out."
        },
        {
          "paragraph": "He promptly dashed toward the doctor. “Doctor, how’s the patient?”"
        },
        {
          "paragraph": "“She’s in a bad condition. Her face… is disfigured."
        },
        {
          "paragraph": "Her muscles and tendons are broken due to excessive blood loss, the delay in sending her here, and\nher infected wounds. Although we’ve fixed her tendons through the surgery, her nerves have certainly\nbeen injured. It’s uncertain whether she can walk in the future. As for her hands… After a few months\nof treatment,  it’ll be good enough if she can eat with her hands.”"
        },
        {
          "paragraph": "As soon as the doctor finished speaking, Rodney tottered and struggled to keep his footing. By the time\nhe came to his senses, he grabbed the doctor’s collar and roared, “What do you mean? Are you saying\nthat she’ll be paralyzed even up to her arms? In that case, won’t she be a disabled person?”"
        },
        {
          "paragraph": "“Mr. Snow, we’ve really tried our best. It’s good enough that we managed to save her life.” Rodney’s\nroar made the doctor’s heart palpitate. Even so, the doctor continued reluctantly, “Also…”"
        },
        {
          "paragraph": "Rodney widened his eyes and looked at the doctor anxiously."
        },
        {
          "paragraph": "“The patient… had a miscarriage, ” the doctor stammered."
        },
        {
          "paragraph": "“Miscarriage?” Rodney froze. “What nonsense are you talking about? How could she have gotten\npregnant?”"
        },
        {
          "paragraph": "“It’s true. She got pregnant about half a month ago. However, her miscarriage was probably caused by\nbeing in the dirty water for too long. On top of excessive blood loss, getting traumatized, and not\nsending her to the hospital in time, it has taken a huge toll on her body. I’m afraid she might have\ntrouble getting pregnant in the future.”"
        },
        {
          "paragraph": "“Half… Half a month?” Rodney was in a daze."
        },
        {
          "paragraph": "Sarah had been in the apartment the entire time. With his men keeping an eye on her, she had not\ngone anywhere. How could she have been pregnant?"
        },
        {
          "paragraph": "Could one of the Snowden bodyguards have gotten her pregnant?"
        },
        {
          "paragraph": "No. Half a month ago, there was one night when Rodney got drunk and stayed in the apartment\novernight."
        },
        {
          "paragraph": "Could it have been that night… That was impossible."
        },
        {
          "paragraph": "Rodney’s head almost exploded."
        },
        {
          "paragraph": "He had never thought of cheating. Moreover, why did Sarah not tell him?"
        },
        {
          "paragraph": "Did she hide it from him because she did not want to spoil his marriage?"
        },
        {
          "paragraph": "At that instant, Rodney felt extremely guilty toward Sarah."
        },
        {
          "paragraph": "If this was the reason, he would have to bear a huge responsibility to her if she got pregnant  in the\nfuture. What was more, she would most probably be paralyzed from now on. With the condition of her\nhands, she might be able to eat, but it would be impossible for her to go to work."
        }
      ]
    },
    {
      "title": "Chapter 2023 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "Rodney could never be able to fully compensate Sarah in this life."
        },
        {
          "paragraph": "He was so guilty that his eyes reddened."
        },
        {
          "paragraph": "He had never thought Freya would be so cruel. She used to be quite a nice person, but to think she\nwas cruel enough to kidnap Sarah and even break her limbs."
        },
        {
          "paragraph": "How wicked of her."
        },
        {
          "paragraph": "Why did he marry such a wicked woman as his wife? She even gave birth to his child."
        },
        {
          "paragraph": "If Rodney had not witnessed it with his own eyes, he would not have believed it."
        },
        {
          "paragraph": "What tormented him more was that he had no idea how to face Sarah."
        },
        {
          "paragraph": "After the doctor left, Landon from Snowden walked up to Rodney and reported, “I’m sorry, Young\nMaster Snow. We wanted to send Young Madam to the police station as per your instruction, but after\nyou left, Little Young Master Snow came to take her away.”"
        },
        {
          "paragraph": "Rodney pulled Landon over. From his eyes, he looked as though he was going to eat Landon up. “\nEven with so many of you, Ryan managed to take her away. What’s the point of paying you guys?”"
        },
        {
          "paragraph": "Landon’s thin lips twitched. In the end, he said powerlessly, “Little Young Master Snow is also a\nmember of the Snow family. What’s more, he’s the prime minister’s son. We…”"
        },
        {
          "paragraph": "“But Snowden is under my care. He’s in no position to have a hand in it.” Rodney yelled angrily,  “If\nyou’re not clear about who your superior is, you can leave Snowden. Do you understand?”"
        },
        {
          "paragraph": "At the thought of Ryan’s words, Landon became frustrated. “Young Master Snow, we didn’t have a\nchoice. Little Young Master Snow warned us that Snowden doesn’t only belong to you, or there’s no\npoint in its existence. When we were on our way back, Old Master Snow also gave us a call and told us\nnot to act against Young Madam…”"
        },
        {
          "paragraph": "“Do you think I want  to act against  Freya? If possible, I wouldn’t want to do it either, but she tortured\nSarah so badly. I need to do something about it. ” Rodney yelled in rage,  “ Since  you  guys are\nstopping me, I’ll call the police and let  them settle everything. Whoever committed a crime will be\npunished according to the laws.”"
        },
        {
          "paragraph": "“How dare you think of sending your wife to jail.”"
        },
        {
          "paragraph": "All of a sudden, Wendy’s reproaching voice came from behind all of a sudden."
        },
        {
          "paragraph": "Rodney turned his head around, only to see Wendy and Jessica walking toward him."
        },
        {
          "paragraph": "“Mom…” Rodney’s eyes instantly reddened.  “I don’t want to do so, but did you see how badly Sarah\nwas tortured? Not only is she paralyzed and disfigured, but she also has a miscarriage. She can never\nget pregnant again. It’s all Freya’s fault. You guys shouldn’t defend her anymore.”"
        },
        {
          "paragraph": "“Pregnant?” Wendy was appalled. “Was she pregnant with your child?”"
        },
        {
          "paragraph": "“I think so…” At this moment, Rodney was still in a daze. “I drank too much the other day…”"
        },
        {
          "paragraph": "Slap."
        },
        {
          "paragraph": "Wendy slapped his face violently. She was really mad. “Why did I give birth to a son like you? You\nswore to us that you’d send her overseas and that both of you weren’t romantically involved. Yet, it"
        },
        {
          "paragraph": "turned out that she was pregnant with your child. I can finally understand why Freya did that to Sarah,\nand you can’t blame her. Sarah deserves it.”"
        },
        {
          "paragraph": "“Mom, how could you say such a thing?” Extremely disappointed, Rodney covered his face. “I only got\nto know of Sarah’s pregnancy today. She didn’t even plan to tell me, nor did she plan to spoil my\nmarriage. If this incident hadn’t happened, I would be sending her overseas next week.”"
        },
        {
          "paragraph": "Jessica’s mouth twitched slightly, her beautiful face full of sarcasm. “You’re too naive. She didn’t tell\nyou because she was worried that you’d make her use contraceptives. By the time she’s overseas, her\nbaby bump will become bigger. Or perhaps after she gives birth to the baby, there would be nothing\nyou can do about it anymore. You would have no choice but to be responsible to her. Once Freya\nlearns about it, your marriage would be a lost cause.”"
        },
        {
          "paragraph": "“Your sister is right. Can you wake up? Sarah isn’t even a good woman.” Wendy was so close to\nbegging him."
        },
        {
          "paragraph": "“Drop it. You guys are just biased against Sarah. ” Rodney was in total disbelief. “All you guys do is\ndefend Freya, and you can’t tell right from wrong. I think Freya dares to become so wild and wicked\nonly because you always rush to her defense.”"
        },
        {
          "paragraph": "Wendy was so furious that she started to suffer from blackouts."
        }
      ]
    },
    {
      "title": "Chapter 2024 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "The most furious moment in Wendy’s life was caused by her son."
        },
        {
          "paragraph": "Jessica held Wendy’s shoulder. Then, she turned around and said to Rodney frostily, “Rodney, no\nmatter how stubborn you are, don’t think of turning against the whole Snow family. You should be clear\nabout the consequences. Don’t end up losing everything for the sake of Sarah. You might not care\nabout it, but Shaun is targeting Sarah too. If you hadn’t been keeping a close watch on Sarah, he\nwould’ve done away with her. If you offend the Snow family behind you, how are you going to protect\nSarah?”"
        },
        {
          "paragraph": "“Who on earth is your biological child now? Freya or I?” Rodney was infuriated that they took\nadvantage of his Achilles heel."
        },
        {
          "paragraph": "“Firstly, Freya is Dani’s mom, so your grandpa won’t allow anything shameful to happen to his\ngrandchild’s mom. Secondly, this is your uncle’s order, ” Jessica enunciated each word coldly. “Don’t\nalways think about Sarah. You should be considerate toward your child too.”"
        },
        {
          "paragraph": "“Hah. I hope so too, but has Freya been considerate toward Dani?” Rodney flew into a rage. “Well, she\nhas no right to get Dani’s custody. A woman like her will only lead the child astray. As my family, you\nshould help me get my child back.”"
        },
        {
          "paragraph": "“Get your child back?” Wendy took a deep breath.“ Are you sure you want to divorce her?”"
        },
        {
          "paragraph": "“I don’t wish to take it this far as well, but she forced my hand.” After Rodney finished speaking, he felt\na lump in his throat. “She’s too wicked. She doesn’t deserve to be my wife.”"
        },
        {
          "paragraph": "What was more, if he did not divorce Freya, he would be too ashamed to face Sarah at this point."
        },
        {
          "paragraph": "Wendy was at a loss for words."
        },
        {
          "paragraph": "Although she approved of Freya and Rodney’s divorce, she would not wish her son to get a divorce.\nShe believed that there was still a glimmer of hope a s long as they were married and Rodney refused\nto get a divorce."
        },
        {
          "paragraph": "Unfortunately…"
        },
        {
          "paragraph": "“Suit yourself. I don’t care about you anymore.” Wendy was thoroughly disappointed."
        },
        {
          "paragraph": "Previously, she kicked Rodney out of the family in hopes that he would change his ways."
        },
        {
          "paragraph": "However, she realized that he had been bewitched by Sarah. The more worried she was, the worse\nthings became."
        },
        {
          "paragraph": "“Rodney, listen to me. Just drop it. ” After Jessica warned him, she held Wendy’s hand and left."
        },
        {
          "paragraph": "The moment they started to walk away, Rodney punched the wall, producing a deep sound."
        },
        {
          "paragraph": "In the affordable luxury bedroom, the breeze blew on the thick curtains with elegant patterns."
        },
        {
          "paragraph": "When Eliza opened her eyes, her neck and head hurt."
        },
        {
          "paragraph": "After her mind went blank for a minute, she recalled what happened before she passed out."
        },
        {
          "paragraph": "She was supposed to be in the factory, but why was she here instead?"
        },
        {
          "paragraph": "Where was this place?"
        },
        {
          "paragraph": "Eliza sat up and realized that she had changed into a clean red pajama set."
        },
        {
          "paragraph": "Who had changed it for her? Where was Sarah?"
        }
      ]
    },
    {
      "title": "Chapter 2025 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "Where was Freya?"
        },
        {
          "paragraph": "Eliza had too many questions."
        },
        {
          "paragraph": "She tried to dash out the door barefoot without caring much about anything. She was not even\nbothered to search for her slippers as she rushed toward the door in her barefoot."
        },
        {
          "paragraph": "Creak."
        },
        {
          "paragraph": "Suddenly, the room door opened from outside."
        },
        {
          "paragraph": "Chester entered the room, dressed in a light gray shirt and a pair of black casual pants. He was tall and\ngraceful, and his face handsome and exquisite."
        },
        {
          "paragraph": "He was holding a tray with a glass of milk and a sandwich on it. His movement exuded a sense of\nelegance and nobility."
        },
        {
          "paragraph": "“It’s you?” Eliza instantly realized what had happened. “You’re the one who brought me here. Where’s\nFreya?”"
        },
        {
          "paragraph": "“Have some breakfast.” Chester placed the tray on the television cabinet at the side."
        },
        {
          "paragraph": "Eliza grabbed hold of him, her eyes filled with agitation. “You made her stay there, didn’t you?”"
        },
        {
          "paragraph": "“She voluntarily stayed there. You have such a good buddy.” Chester fixed his eyes on the wrinkled\npart of his shirt that she was holding. His tone was indifferent. “You should thank me. If I hadn’t\npersuaded her to go over, you probably would’ve lost your life.”"
        },
        {
          "paragraph": "“B*stard, my affairs are none of your business. I had no intention to live from the moment I kidnapped\nSarah. You shouldn’t have dragged Freya into the mess.” Hating Chester to the core, Eliza turned\naround to dash out."
        },
        {
          "paragraph": "“Where are you going?” Chester gripped onto her arm.  “Are you going  to look for Rodney? Don’t\nworry. Freya didn’t get arrested. The Snows are protecting her,  so Rodney  can’t  do anything  to her.”"
        },
        {
          "paragraph": "Eliza froze. Only then did she turn around and look a t Chester. “Where  is she now? Did Rodney  hurt\nFreya after he saw how badly injured Sarah was?”"
        },
        {
          "paragraph": "“Eliza, you’re actually quite smart and calm. How could you have thought of doing such a ridiculous\nthing?” Chester raised his brows. His deep eyes were filled with curiosity."
        },
        {
          "paragraph": "“ So Rodney actually hurt Freya, didn’t he?” Eliza quickly grasped the hidden meaning behind his\nwords."
        },
        {
          "paragraph": "Chester’s lower lip twitched before he said nonchalantly, “Rodney kicked her and injured one of her\nribs. Ryan has since sent her to the hospital, where she’s currently being treated. Having said that, this\nis the best outcome…”"
        },
        {
          "paragraph": "“This isn’t the best outcome at all. Why did you drag her into the mess? She’s innocent.”  Eliza’s eyes\nwere bloodshot. She was no longer able to stay calm, seemingly like a little beast that was going to\nexplode."
        },
        {
          "paragraph": "“Chester Jewell, you’re such a busybody.” Chester snickered."
        },
        {
          "paragraph": "He then tightened his grip on her arm."
        },
        {
          "paragraph": "At one point, he had an overwhelming urge to do away with her."
        },
        {
          "paragraph": "“Eliza, don’t be ungrateful. Freya is Rodney’s wife, and she has given birth to his child. However, he\nalmost sent her to jail, seeing how badly injured Sarah was. If he had known that you were involved in\nthe matter, he might’ve shot you dead on the spot.”"
        },
        {
          "paragraph": "He exposed the truth mercilessly. “And let me remind you that you’re an artist under my company.\nYou’ve signed a contract for over ten advertisements and two television series. A movie shooting is\nalso about to begin. If something happens to you, you’ll have to bear a compensation of seven to eight\nhundred million dollars for the breach of contract. It’s fine if you die, but are you trying to drive your\nmom into a corner?”"
        },
        {
          "paragraph": "Mom…"
        },
        {
          "paragraph": "That was Eliza’s biological mother but not hers."
        },
        {
          "paragraph": "Nevertheless, it was Mrs. Robbins who gave birth to the body she was currently using."
        },
        {
          "paragraph": "Eliza was caught in a daze for a moment and admitted that she had acted impulsively in this incident."
        }
      ]
    },
    {
      "title": "Chapter 2026 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "However, Eliza was the sort who would seek vengeance. From the moment she learned of Jennifer’s\ndeath, she had lost her composure."
        },
        {
          "paragraph": "She even felt that her only goal of living was to take revenge."
        },
        {
          "paragraph": "As she was occupying someone else’s body, her life had been meaningless."
        },
        {
          "paragraph": "Eliza’s eyes slowly turned red with pain. She tried to hold back the tears in her eyes."
        },
        {
          "paragraph": "It was Chester’s first  time seeing her in such a state. He felt as though a stone was thrown into his\nheart, creating layers of ripples."
        },
        {
          "paragraph": "He stretched out his hands, wanting to hug her."
        },
        {
          "paragraph": "However, Eliza retreated and pushed him away. “ Chester, thank you for hiding the issue for me\nyesterday, but the only feeling I have for you is gratitude. You sacrificed Freya to help me, so it’s\nimpossible for me to feel touched.”"
        },
        {
          "paragraph": "Chester fixed his cold gaze at her. “Eliza, why must you be so realistic?” “You’re the real one.”"
        },
        {
          "paragraph": "Eliza stared calmly into his eyes. He was very good- looking and always exuded a brilliant aura, but\nshe would never have feelings for him. She would not feel grateful for him either. “In fact, you could’ve\nsettled the issue for me last night. Unfortunately, I reckoned you contemplated it and didn’t think it was\nworth risking to help me, so you dragged Freya into the mess. This way, you were able to help me and\nstay out of it at the same time. You and Rodney will remain good buddies, and you’ll get a good name\nfor saving me. How wonderful.”"
        },
        {
          "paragraph": "“Eliza, do you know what I like about you?” Her stare made Chester uncomfortable, considering that he\nwas usually the one casting knowing gazes at other women."
        },
        {
          "paragraph": "Nevertheless, a woman saw through him today, which made him feel exasperated."
        },
        {
          "paragraph": "Chester reached out to pinch Eliza’s chin. “I like how smart and calm you are. However, these are also\nthe qualities I hate about you. You’re right. I haven’t slept with you, so I don’t want you to die. Even so, I\nwon’t have a falling-out with Rodney just because of you.”"
        },
        {
          "paragraph": "“Thank you for being so frank.”"
        },
        {
          "paragraph": "Eliza pushed his hand away and nodded confidently. “That’s why I said I’m grateful to you, and that’s\nthe only feeling I have for you. Thank you for your help. I’ll bring more money to your company in the\nfuture. I need to visit Freya in the hospital today.”"
        },
        {
          "paragraph": "Chester did not stop her. Instead, he followed behind her, and his tone sounded like he was mocking\nher. “Are you sure you’re going out in this outfit? If the reporters catch a picture of you, you’ll make it to\nthe top searches tomorrow — The Rising Star Came Out of Her Boss’s Apartment in Improper\nClothing.”"
        },
        {
          "paragraph": "“Will someone who’s willing to risk her life care about the top searches?”"
        },
        {
          "paragraph": "After Eliza argued serenely, she walked to the door and needed to change her shoes. However, she\nrealized that none of her shoes were there."
        },
        {
          "paragraph": "She hesitated for a few seconds. Left with no choice, she wore a pair of slippers and prepared to leave\nstraight away."
        },
        {
          "paragraph": "“ Stop there. You’re wearing my slippers, ” Chester reminded her lazily."
        },
        {
          "paragraph": "Eliza tossed the slippers aside without hesitation and left barefoot."
        },
        {
          "paragraph": "Chester tugged her shirt and pointed at it. “Excuse me. I’ve thrown your shirt away earlier because it\nwas too dirty. The pajama shirt you’re wearing now is mine as well.”"
        },
        {
          "paragraph": "No matter how much Eliza hated him, she could not walk out naked."
        },
        {
          "paragraph": "She stopped and glared at the man in front of her. “ How much did this pajama shirt cost? I’ll pay you\nten times the price when I’m home, okay?”"
        },
        {
          "paragraph": "“ I don’t want your money. Money is something I need the least.” Chester took a cigarette pack from the\nshoe rack, drew a cigarette, and held it in his mouth. “I didn’t sleep last night because of you. No matter\nhow realistic I am, it’s a fact that I helped you last night. You can’t deny it, right?”"
        },
        {
          "paragraph": "Eliza pulled a long face, waiting for him to continue."
        }
      ]
    },
    {
      "title": "Chapter 2027 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "With a smile, Chester suddenly moved closer to Eliza’s ears and said nastily, “Eliza, you wanted to\nsend a few of your subordinates overseas before this, right? I don’t think I’ve told you that they haven’t\nbeen able to leave the country…”"
        },
        {
          "paragraph": "Eliza suddenly lifted her head, her eyes pretty and clear. She glared at him in shock. “What did you\ndo?”"
        },
        {
          "paragraph": "“Nothing much. All I did was refuse their visas. With their names and identities exposed, they can’t go\noverseas for now. As you know, they might be in danger being in the country too. Having said that, I\ncan easily do something to ensure their safety.”"
        },
        {
          "paragraph": "Chester covered the cigarette in his mouth while lighting it. As usual, his remarks were harsh, but he\nsaid it with a gentle smile on his handsome face, like an elegant young man."
        },
        {
          "paragraph": "However, his behavior was far from gentlemanly. Eliza instantly grasped his meaning."
        },
        {
          "paragraph": "Her right hand was shivering with anger. She had an urge to slap him."
        },
        {
          "paragraph": "“You want to slap me, huh?” Chester raised his brows. “Sure you can. But do think about the\nconsequences.”"
        },
        {
          "paragraph": "Eliza snorted coldly. “ I finally understand what it means to care too much about the gains ahead\nwithout being aware of the dangers behind. You’re brilliant, Young Master Jewell. Freya, Rodney,\nSarah, and I probably became your pawns that night, and you’re the ultimate winner. People like you\nwho excel at scheming are doomed to be lonely. No one will fall for you because you’re too cold-\nblooded.”"
        },
        {
          "paragraph": "“It’s alright. I don’t need love. All I want is you, ” Chester mocked in a light-hearted manner."
        },
        {
          "paragraph": "Eliza scoffed, her eyes filled with endless hatred. “ You think too highly of me. I’m no different from the\nwomen you’ve interacted with in the past. They have what I have. Or… are you obsessed with having\ntwo good friends to serve you? Sadly, Charity is dead. Otherwise, the two of us could occasionally\naccompany you at the same time. That must be interesting to you.”"
        },
        {
          "paragraph": "His Achilles’ heel was exposed once again. A hint of grimness flashed across his eyes."
        },
        {
          "paragraph": "Nevertheless, he shrugged indifferently after a while. “Don’t provoke me. It’s no use. From the moment\nI made up my mind, I’ve decided to live in such a selfish, casual manner. It doesn’t matter even if I go\nto hell after I die.”"
        },
        {
          "paragraph": "He paused for a moment before caressing her smooth face. “Well, you’ve exposed your weakness\nthrough this incident, Eliza. I can see that it’s pointless to threaten you since you’re not afraid of death.\nBut before the incident, you made some arrangements for your subordinates, which means that you\nstill care about them. Anyway, it’s your choice. If you want to save them, be my woman."
        },
        {
          "paragraph": "Otherwise, I’ll have them captured. Putting aside Sarah’s kidnap, your subordinates have probably\ncommitted quite a lot of crimes when they worked for you. If they’re under investigation, I guess their\nlives will be at stake.”"
        },
        {
          "paragraph": "Eliza raised her head and looked at his handsome face."
        },
        {
          "paragraph": "At that moment, she wished she could stab him to death."
        },
        {
          "paragraph": "However, Chester was not Sarah. She was incapable of doing it to him."
        },
        {
          "paragraph": "She felt that Chester was just like a devil, regardless of whether it was when she lived in her own body\nor Eliza’s body."
        },
        {
          "paragraph": "What evil deeds had she done in her previous life to cross paths with this man time and time again in\nthis life?"
        },
        {
          "paragraph": "“ It’s up to you to decide. I’m hungry. Because of you, I haven’t had breakfast.”"
        },
        {
          "paragraph": "Chester sat down slowly on the chair. The delicate breakfast on the dining table was still warm."
        },
        {
          "paragraph": "He used a knife and fork to cut the fried egg."
        },
        {
          "paragraph": "Eliza took a deep breath and closed her eyes. When she opened them again, they were as still as\nwater."
        },
        {
          "paragraph": "She walked up to him and asked dejectedly, “How long do I have to be your woman?”"
        },
        {
          "paragraph": "“Until I’m sick of you.” Chester held her hands and put them on his thighs. He draped his arm around\nher shoulders and muttered with a masculine voice a s if she was his most intimate lover, “Come and\neat this egg I fried. It’s not bad.”"
        },
        {
          "paragraph": "Eliza turned her eyes to the egg white he forked. After staying quiet for two seconds, she lowered her\nhead and forked the egg into her mouth."
        },
        {
          "paragraph": "As she bent over, Chester stared at the back of her neck, which was as thin and fair as a swan’s neck."
        },
        {
          "paragraph": "He had forgotten how long it had been since he admired a woman so carefully."
        }
      ]
    },
    {
      "title": "Chapter 2028 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "“Good…”"
        },
        {
          "paragraph": "Chester lifted Eliza’s chin softly before he leaned over to kiss her."
        },
        {
          "paragraph": "Eliza subconsciously resisted him."
        },
        {
          "paragraph": "“Did you forget what I said?” Chester nibbled her lips and stared at her. Their long eyelashes almost\ntangled together."
        },
        {
          "paragraph": "Eliza was filled with despair. Ultimately, she had no choice but to surrender to her fate. She opened her\nlips slightly and accepted his kiss."
        },
        {
          "paragraph": "She was still not done eating the egg, so the taste was still in her mouth. If this had happened in the\npast, Chester would have been disgusted. However, he found the egg particularly delicious today."
        },
        {
          "paragraph": "He kissed her so passionately that it was as though he was going to eat her up."
        },
        {
          "paragraph": "Only until he kissed Eliza’s neck did she dodge him. “I didn’t rest well last night. I’m exhausted.”"
        },
        {
          "paragraph": "“Okay. I’ll let you rest for two days.” Chester was not in a hurry, and he stroked her long hair."
        },
        {
          "paragraph": "“I want to go to the hospital to visit Freya this afternoon. No matter what, I need to thank her,” Eliza said\nlethargically with her head down, as if she had surrendered."
        },
        {
          "paragraph": "“Okay. I’ll come with you.” Chester nodded. “No need. Can you respect my dignity?” Eliza’s tone\nsounded despondent. “Being your woman is a disgrace to them. Isn’t your main goal to sleep with me?\nSo fulfilling your goal should be enough. Do you need to go as far as trampling my dignity?”"
        },
        {
          "paragraph": "“Lizzie, you shouldn’t think of it this way. Do you know how many women in the same industry  as you\nwant to be with me?” Chester looked down and called her by her nickname. Those unaware of the\nsituation would think that he was talking to someone he deeply loved."
        },
        {
          "paragraph": "Nevertheless, his words had long since made Eliza numb. She would not be moved."
        },
        {
          "paragraph": "No one understood Chester more than she did. He had always been like this. When he wanted to get a\nwoman, he would be as gentle to her as a prince, as if she was the only person he loved in this world."
        },
        {
          "paragraph": "Yet when he was sick of her, he would be as cruel as a devil."
        },
        {
          "paragraph": "“But I’m not like them.” Eliza looked up and exchanged looks with him. His gentle face was reflected in\nher dark eyes."
        },
        {
          "paragraph": "Chester stared at her in a daze, feeling as though he had returned to his youth."
        },
        {
          "paragraph": "Back then, he was very close with a woman. From her eyes, he could also see himself."
        },
        {
          "paragraph": "However, later on…"
        },
        {
          "paragraph": "He felt his heart being twisted. All of a sudden, he uncontrollably kissed her eyes and thin lips\nafterward."
        },
        {
          "paragraph": "Only after a long time did he say, “Okay.”"
        },
        {
          "paragraph": "In the afternoon, Eliza’s manager, Hailey, came to the duplex apartment."
        },
        {
          "paragraph": "After she rang the doorbell, Chester opened the door."
        },
        {
          "paragraph": "She came in, carrying some clothes. When she saw Eliza eating on the couch in a pajama set, she was\noverwhelmed with mixed feelings."
        },
        {
          "paragraph": "“Hailey, you’re finally here with the clothes.” Eliza rose to her feet and took the clothes over. Then, she\nwent upstairs to get changed."
        }
      ]
    },
    {
      "title": "Chapter 2029 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "“Young Master Jewell… ” Hailey looked at Chester, not knowing what to do. “You and Eliza…”"
        },
        {
          "paragraph": "“It’s what you see. She’ll stay here more often from now on, so please buy her more clothes and send\nthem over. Also, don’t set too tight of a schedule for her. Don’t let her go too far as well. I don’t want my\nwoman to be  too busy. Do you  understand?” Chester ordered."
        },
        {
          "paragraph": "“I got it.”"
        },
        {
          "paragraph": "Given that Hailey had been in this industry for over ten years, she had encountered  this kind of\nsituation a lot. It did not take her long to pull herself back together."
        },
        {
          "paragraph": "After Eliza got changed, she was ready to leave. At that moment, Chester suddenly clutched her arm\nand pointed at his thin lips."
        },
        {
          "paragraph": "That behavior made Hailey look away quickly. She was filled with dread."
        },
        {
          "paragraph": "Although she was not too familiar with Chester, she had heard from other managers that he was\nalways"
        },
        {
          "paragraph": "cold and distant toward women. Even before he was engaged to Cindy, he would give her the cold\nshoulder during the occasional company events, let alone asking a woman to kiss him of his own\naccord."
        },
        {
          "paragraph": "Without much thought, Eliza kissed Chester numbly before she left."
        },
        {
          "paragraph": "Only after getting into the van did Hailey let out a sigh of relief. “Lizzie, it’s really not up to us to stop\nYoung Master Jewell from having any woman he wants. But let me remind you not to fall head over\nheels with him as you did with Monte previously.”"
        },
        {
          "paragraph": "It had been a long while since Eliza last heard the name ‘Monte’."
        },
        {
          "paragraph": "She zoned out for an instant."
        },
        {
          "paragraph": "Hailey added, “Relationships are the most difficult issue for women to overcome. When Monte got\nengaged, I saw you broke down and even attempted to kill yourself. Therefore, I hope you won’t repeat\nthe same mistake again. Chester is a more charming man than Monte. As you can see, many female\ncelebrities are devastated because of him. But having said that, not everyone can dream of having a\nman like him. His affection is temporary. I’ve come across such a situation a lot in this industry.”"
        },
        {
          "paragraph": "“Don’t worry, Hailey. I’ll never fall for anyone again. ” A sincere smile spread across Eliza’s face. She\nknew that Hailey was offering her such advice for her own good."
        },
        {
          "paragraph": "“That’s good. Why don’t you take this opportunity to gain more openings from Young Master Jewell?”"
        },
        {
          "paragraph": "Eliza shrank absentmindedly into her seat. Openings?"
        },
        {
          "paragraph": "She did not give much thought to it."
        },
        {
          "paragraph": "In fact, her life was supposed to have ended yesterday."
        },
        {
          "paragraph": "It felt like she was barely alive today."
        },
        {
          "paragraph": "Sarah was still alive, and moreover, she was being threatened by Chester."
        },
        {
          "paragraph": "A sense of hatred and disgust was hidden in the depths of her heart. However, she felt powerless."
        },
        {
          "paragraph": "In truth, she did not want to be alive because living was making her unhappy."
        },
        {
          "paragraph": "Upon arriving at Militaire Hospital, she found Freya’s ward with some things in her hands."
        }
      ]
    },
    {
      "title": "Chapter 2030 - Let Me Go, Mr. Hill!",
      "sub_title": "test",
      "reading_time": 0.0,
      "content": [
        {
          "paragraph": "Freya just woke up from her nap. Since she could not move, she watched television with Catherine."
        },
        {
          "paragraph": "The minute she saw Eliza come in, she was both surprised and pleased. “Eliza, it’s good to know that\nyou’re fine.”"
        },
        {
          "paragraph": "Staring at the bandage in front of Freya’s chest, a mix of feelings welled up in Eliza. “Chester said that\nyour rib is broken…”"
        },
        {
          "paragraph": "“It’s no big deal. The doctor said I’ll be fine after a while. ” Freya said with a grin, “Cathy and I were\ntalking about you just now. We’re really thankful that you helped us take revenge against Sarah. I’ve\nlong since hated her.”"
        },
        {
          "paragraph": "Eliza was disconcerted by Freya’s laugh. She turned around, only to meet Catherine’s curious and\nconfused gaze."
        },
        {
          "paragraph": "“Lizzie, I didn’t know you were friends with Charity. You’ve  never mentioned it.” Catherine bent over to\npour a cup of hot coffee for her. “Take a seat. I hope the three of us can have a talk.”"
        },
        {
          "paragraph": "“There’s nothing much to talk about. Well… Charity and I had known each other since we were young\nand before she stepped into the Neeson family. I knew Aunty Jennifer too.”"
        },
        {
          "paragraph": "Eliza took over the cup and let the coffee warm her cold heart. “After hearing what Freya said the other\nday, I was pissed. In fact, I acted too impulsively…”"
        },
        {
          "paragraph": "“You’re not an impulsive person.” Catherine’s gaze was calm. She had contemplated the issue and felt\nthat it was unreasonable of Eliza to risk her life to take revenge no matter how good her relationship\nwith Charity was."
        },
        {
          "paragraph": "What was more, Eliza did not only risk her life but her reputation and status in the entertainment\nindustry that she had been striving for as well."
        },
        {
          "paragraph": "Furthermore, when Catherine was with Charity back then, she had never heard Charity mention Eliza."
        },
        {
          "paragraph": "Eliza began to feel distressed. She knew that Catherine was suspecting her, but she could not tell them\nthat her soul belonged to Charity."
        },
        {
          "paragraph": "“Perhaps you took me for a wonderful person. I had a very loving relationship with Charity, really.”"
        },
        {
          "paragraph": "Eliza bit the bullet and said, “Everyone has their own secrets. All you need to know is that I did that for\nthe sake of Charity and Aunty Jennifer. I just wanted to do something for them. Freya, I’m grateful to\nyou as well. I never thought of dragging you into the mess. I— ”"
        },
        {
          "paragraph": "“Drop it. I think I did it right.”"
        },
        {
          "paragraph": "Freya interrupted Eliza, “When something happened to Charity, Cathy and I were too weak to do\nanything. We could only watch her being sentenced. I had also promised Aunty Jennifer to put Charity\nin the clear, but she was dead before she was proven innocent. We felt very guilty. As much as we\nwanted to take revenge on behalf of Charity’s family, we… weren’t as courageous as you. We’ re very\nthankful to you. Thank you for doing something we didn’t dare to do.”"
        },
        {
          "paragraph": "“I guess Charity would be very grateful  to you guys if she were still alive.”"
        },
        {
          "paragraph": "Eliza’s eyes reddened slightly, but she smiled. “She surely wouldn’t want you guys to take revenge for\nher. Perhaps she would hope for you guys to live a good life.”"
        },
        {
          "paragraph": "“Charity surely wouldn’t want you to risk your life and take revenge for her sake too.”"
        },
        {
          "paragraph": "Catherine held Eliza’s hands. “Lizzie, you rarely share your stuff with us. But from your eyes, I can\nsense a lot of sadness and coldness. We can’t help you with whatever happened in the past, but you\nhave to treasure your life from now on. You only live once. You shouldn’t ruin yourself for anyone. We\ncan slowly take revenge against Sarah. I hope we can find evidence and have her captured. This way,\nthe public will know the evil deeds she has done, and no one will be able to save her.”"
        },
        {
          "paragraph": "“Exactly. If you kill her, you need to sacrifice your life, which is not worth it. We can risk our lives to save\nsomeone, but why should we risk death for the sake of a b*tch?”"
        },
        {
          "paragraph": "Aggrieved, Freya began to moan, “Look. Sarah spoiled my marriage, snatched my husband away, and\ncaused my child to lose her dad. Rodney even kicked me and broke my rib for the sake of that woman,\nyet I’ m still hopeful. I thought to myself that I couldn’t be sad because of Sarah. It’s not worth it. I must\nlive better.”"
        },
        {
          "paragraph": "“You deserve someone better.” Eliza was heartbroken by Freya’s words."
        },
        {
          "paragraph": "She knew full well how it felt like being trampled by someone she loved. “By the way, how’s the incident\nwith Rodney later?”"
        },
        {
          "paragraph": "“Don’t worry. The Snows are all on my side. Rodney won’t report it to the police. ” Freya forced a smile.\n” It’s over. ”"
        }
      ]
    }
  ]


