[
  {
    "title": "Chapter 950 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Oh, I really sympathize with you. You just had to provoke the richest man in the country.” Freya sighed.\n“Not only can’t you get rid of him and only he can want you, but you also can’t reject him.”"
      },
      {
        "paragraph": "A deep disgust flashed in Catherine’s eyes as she listened."
      },
      {
        "paragraph": "She hated men who did not know how to cherish others like Shaun Hill the most."
      },
      {
        "paragraph": "If she could do it all over again, she really did not want to meet him again."
      },
      {
        "paragraph": "11:00 a.m."
      },
      {
        "paragraph": "The relatives of the Lyons family came one after another to see the bride."
      },
      {
        "paragraph": "Catherine put on her high heels and stood up, and saw Sonya Lyons, Ethan Lowe, and Tracy Steele\nwalk in together."
      },
      {
        "paragraph": "Thinking about it, it had been several years since Ethan and she saw each other. That year, when she\nleft Melbourne, Ethan had to make Tracy his girlfriend in order to help the Lowe family, and they had\nbeen together ever since."
      },
      {
        "paragraph": "“Catherine, it’s been a long time.” Ethan looked at her with a complicated gaze."
      },
      {
        "paragraph": "After not having seen her for three years, she had become more beautiful, especially today. With a snow-\nwhite wedding dress and her stunning small face touched up by an artist, she looked as beautiful as a\nfairy."
      },
      {
        "paragraph": "When he was young, he used to fantasize countless times about getting married to her, but he never\nthought that she would marry his own uncle one day."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Ethan, this is your wife, right? She’s very pretty. ” Catherine smiled faintly and nodded at Tracy."
      },
      {
        "paragraph": "“Hello, Aunty. ” Tracy nodded. Of course, she knew that her husband had always been attached to his\nex-girlfriend, but unfortunately, Catherine was about to get married to Wesley. She did not have a\nfavorable impression of Catherine, but there was no malice either."
      },
      {
        "paragraph": "Catherine was stunned at the address."
      },
      {
        "paragraph": "She could not help but think of her old self. She often fantasized about Rebecca calling her Aunty."
      },
      {
        "paragraph": "Tsk, unexpectedly, Rebecca and Ethan broke up."
      },
      {
        "paragraph": "“Sonya, this is the bride, right? How beautiful.”"
      },
      {
        "paragraph": "Some of the Lyons family’s relatives suddenly gathered around Sonya and spoke."
      },
      {
        "paragraph": "Sonya glanced at Catherine with slight contempt. “ She is indeed beautiful, but it’s a shame that she’s\nsecond-hand goods.”"
      },
      {
        "paragraph": "The relatives’ expressions were all different. “Why is Wesley marrying someone who was married\nbefore? Our Wesley is one of the top entrepreneurs in the country and a young nobleman. Women like\nher aren’t worthy.”"
      },
      {
        "paragraph": "“Oh, it couldn’t be helped. Wesley was bewitched by her.” Sonya sighed long and hard."
      },
      {
        "paragraph": "Some relatives of the Lyons family instantly cast contemptuous glances at Catherine."
      },
      {
        "paragraph": "Catherine frowned slightly when she heard them. Sonya had always disliked her and still does."
      },
      {
        "paragraph": "Freya was furious and about to speak up when Ethan looked at his mother unhappily, saying, “ Mom,\nwhy would Catherine be unworthy of Uncle? She’s the chairman of Hudson Corporation and has a net"
      },
      {
        "paragraph": "worth of billions, not to mention her status as a global top designer, and her father is Mr. Joel"
      },
      {
        "paragraph": "Yule. If I had to say, it’s Uncle who gets a social climb by marrying her.”"
      },
      {
        "paragraph": "“Wow, this bride is quite amazing. ” The relatives’ eyes when they looked at Catherine suddenly changed\nagain."
      },
      {
        "paragraph": "“No one will think you’re mute if you don’t speak.”"
      },
      {
        "paragraph": "Sonya glared at Ethan fiercely."
      },
      {
        "paragraph": "“Mom, hurry up and go greet the guests. There are many relatives outside.” Ethan reminded her\nunceremoniously, somewhat chasing away the woman. “Finally, peace and quiet. Ethan Lowe, you finally\nlearned how to do something good.” Freya chuckled."
      }
    ]
  },
  {
    "title": "Chapter 951 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South] Chapter 953"
      },
      {
        "paragraph": "“Oh, I really sympathize with you. You just had to provoke the richest man in the country.” Freya sighed.\n“Not only can’t you get rid of him and only he can want you, but you also can’t reject him.”"
      },
      {
        "paragraph": "A deep disgust flashed in Catherine’s eyes as she listened."
      },
      {
        "paragraph": "She hated men who did not know how to cherish others like Shaun Hill the most."
      },
      {
        "paragraph": "If she could do it all over again, she really did not want to meet him again."
      },
      {
        "paragraph": "11:00 a.m."
      },
      {
        "paragraph": "The relatives of the Lyons family came one after another to see the bride."
      },
      {
        "paragraph": "Catherine put on her high heels and stood up, and saw Sonya Lyons, Ethan Lowe, and Tracy Steele\nwalk in together."
      },
      {
        "paragraph": "Thinking about it, it had been several years since Ethan and she saw each other. That year, when she\nleft Melbourne, Ethan had to make Tracy his girlfriend in order to help the Lowe family, and they had\nbeen together ever since."
      },
      {
        "paragraph": "“Catherine, it’s been a long time.” Ethan looked at her with a complicated gaze."
      },
      {
        "paragraph": "After not having seen her for three years, she had become more beautiful, especially today. With a snow-\nwhite wedding dress and her stunning small face touched up by an artist, she looked as beautiful as a\nfairy."
      },
      {
        "paragraph": "When he was young, he used to fantasize countless times about getting married to her, but he never\nthought that she would marry his own uncle one day."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South] Chapter 953"
      },
      {
        "paragraph": "“Ethan, this is your wife, right? She’s very pretty. ” Catherine smiled faintly and nodded at Tracy."
      },
      {
        "paragraph": "“Hello, Aunty. ” Tracy nodded. Of course, she knew that her husband had always been attached to his\nex-girlfriend, but unfortunately, Catherine was about to get married to Wesley. She did not have a\nfavorable impression of Catherine, but there was no malice either."
      },
      {
        "paragraph": "Catherine was stunned at the address."
      },
      {
        "paragraph": "She could not help but think of her old self. She often fantasized about Rebecca calling her Aunty."
      },
      {
        "paragraph": "Tsk, unexpectedly, Rebecca and Ethan broke up."
      },
      {
        "paragraph": "“Sonya, this is the bride, right? How beautiful.”"
      },
      {
        "paragraph": "Some of the Lyons family’s relatives suddenly gathered around Sonya and spoke."
      },
      {
        "paragraph": "Sonya glanced at Catherine with slight contempt. “ She is indeed beautiful, but it’s a shame that she’s\nsecond-hand goods.”"
      },
      {
        "paragraph": "The relatives’ expressions were all different. “Why is Wesley marrying someone who was married\nbefore? Our Wesley is one of the top entrepreneurs in the country and a young nobleman. Women like\nher aren’t worthy.”"
      },
      {
        "paragraph": "“Oh, it couldn’t be helped. Wesley was bewitched by her.” Sonya sighed long and hard."
      },
      {
        "paragraph": "Some relatives of the Lyons family instantly cast contemptuous glances at Catherine."
      },
      {
        "paragraph": "Catherine frowned slightly when she heard them. Sonya had always disliked her and still does."
      },
      {
        "paragraph": "Freya was furious and about to speak up when Ethan looked at his mother unhappily, saying, “ Mom,\nwhy would Catherine be unworthy of Uncle? She’s the chairman of Hudson Corporation and has a net"
      },
      {
        "paragraph": "worth of billions, not to mention her status as a global top designer, and her father is Mr. Joel"
      },
      {
        "paragraph": "Yule. If I had to say, it’s Uncle who gets a social climb by marrying her.”"
      },
      {
        "paragraph": "“Wow, this bride is quite amazing. ” The relatives’ eyes when they looked at Catherine suddenly changed\nagain."
      },
      {
        "paragraph": "“No one will think you’re mute if you don’t speak.”"
      },
      {
        "paragraph": "Sonya glared at Ethan fiercely."
      },
      {
        "paragraph": "“Mom, hurry up and go greet the guests. There are many relatives outside.” Ethan reminded her\nunceremoniously, somewhat chasing away the woman. “Finally, peace and quiet. Ethan Lowe, you finally\nlearned how to do something good.” Freya chuckled."
      }
    ]
  },
  {
    "title": "Chapter 952 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Suzie bit her lips and could not help but cry."
      },
      {
        "paragraph": "Lucas looked at her, and his cold face revealed a rare softness. “What’s wrong? You can’t bear to let\nMommy go? Don’t worry, Mommy will still love us a s much as before.”"
      },
      {
        "paragraph": "“Don’t lie to me. Mommy and Uncle Wesley will definitely make younger siblings for us in the future.\nMommy won’t love us as much then.”"
      },
      {
        "paragraph": "Suzie sniffled and muttered in a low voice, feeling very uncomfortable."
      },
      {
        "paragraph": "Although Uncle Wesley was very good to her, he was not her real Daddy."
      },
      {
        "paragraph": "It was all scummy dad’s fault. Why was he so stupid? She already hinted at him, but he still had not\ncome."
      },
      {
        "paragraph": "Forget it, Mommy was already married. She had to accept the reality."
      },
      {
        "paragraph": "“That won’t happen. ” Lucas pursed his thin lips and grabbed her small hand. “ Mommy isn’t that kind of\nperson and you’ll always be my little sister."
      },
      {
        "paragraph": "I’ll dote on you.”"
      },
      {
        "paragraph": "“Lucas…” Suzie cried again. After living for three years, this was the first time Lucas said such warm\nwords."
      },
      {
        "paragraph": "After the ceremony, the reporter posted those beautiful wedding photos online."
      },
      {
        "paragraph": "Wesley also held Catherine’s hand and took a photo of them wearing their wedding rings, and posted it\non Facebook. [Holding your hand, till death do us part. I’ve been waiting for you since the first day I met"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "you. 12S7 days. I’m glad I didn’t give up.]"
      },
      {
        "paragraph": "As the president of Golden Corporation, he rarely posted socially. He had always been a private person\nin the eyes of the public, so this rare post caused a sensation."
      },
      {
        "paragraph": "[Oh my God, President Lyons. You either don’t share at all or you share something shocking.]"
      },
      {
        "paragraph": "[President Lyon’s wife must have saved the galaxy in her previous life. She’s so blessed. President"
      },
      {
        "paragraph": "Lyons is a business leader who’s handsome and rich and low-key. Men like him are hard to find.]"
      },
      {
        "paragraph": "[Don’t you know yet? The media already released photos of the bride earlier. Wesley Lyon’s bride is\nCatherine Jones.]"
      },
      {
        "paragraph": "[Which Catherine Jones? Is it the same one I’m thinking about? That can’t be.]"
      },
      {
        "paragraph": "[It’s her, Shaun Hill’s ex-wife and ex-girlfriend.]"
      },
      {
        "paragraph": "[I… I think I’m delusional. How did Wesley end up with Catherine? They even got married in a flash. Wtf\nwtf.]"
      },
      {
        "paragraph": "[It’s definitely true. Many reporters already took pictures at the wedding. Catherine is really a winner in\nlife. Shaun Hill is still stupidly waiting for her, but she turned around and married a pharmaceutical big\nshot. Awesome.”"
      },
      {
        "paragraph": "[What’s awesome about that? Catherine is beautiful and talented. Who wouldn’t want to marry her? She\ndeserves to be loved.]"
      },
      {
        "paragraph": "[It’s no wonder Wesley has never had a scandal with women before, and I’ve never heard of him having\na girlfriend. So it’s because he’s been waiting for someone that’s been residing in his heart. Good men\nlike him are rare.]"
      },
      {
        "paragraph": "[Catherine might have been deeply hurt by Shaun and turned around to see that Wesley has always\nbeen silently waiting for her. She must have been finally moved.]"
      },
      {
        "paragraph": "[I wonder if Eldest Young Master Hill knows about this matter. He even posted on Facebook that he’ll\nwait for Catherine for the rest of his life.]"
      },
      {
        "paragraph": "[He’s probably hiding in a corner and crying right now. It’s his fault for not knowing how to cherish her.\nServes him right.]"
      },
      {
        "paragraph": "The hot discussion among the netizens instantly pushed this small wedding ceremony to the top of the\ntrending news."
      },
      {
        "paragraph": "In the private jet."
      },
      {
        "paragraph": "Shaun kept checking his phone. It was already 11:50 a.m."
      },
      {
        "paragraph": "His heart seemed to be seized all the way, and he had to take deep breaths constantly."
      },
      {
        "paragraph": "He kept reassuring himself that it was just his own wild guess."
      },
      {
        "paragraph": "How would Catherine get married to Wesley? They had not crossed paths since three years ago, and\never since Catherine returned, he never saw them in contact before. It was impossible for them to\nsuddenly get married."
      },
      {
        "paragraph": "He took a big gulp of water, only to find that his hand was shaking badly."
      },
      {
        "paragraph": "Chester suddenly called him, and he answered annoyed. “ If you have something to say then spit it out\nquickly.”"
      },
      {
        "paragraph": "“…Where are you now?” Chester asked after a moment of silence."
      },
      {
        "paragraph": "“On a plane to Melbourne.” Chester sighed. “You still haven’t heard?”"
      }
    ]
  },
  {
    "title": "Chapter 953 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Heard about what?”"
      },
      {
        "paragraph": "Shaun’s heart hitched, frightened by Chester’s voice."
      },
      {
        "paragraph": "Yes, he was afraid. It was the second time he experienced the same kind of fear again. The first time\nwas when he pushed Catherine down who was then pregnant. It was the same fear he felt when he sent\nher to the hospital."
      },
      {
        "paragraph": "It was like he was slowly losing something precious to him."
      },
      {
        "paragraph": "“Catherine and Welsey got married in Melbourne,” Chester said helplessly. “The wedding is completed.\nWesley has already publicly admitted it and the reporters already took photos of the scene. If you don’t\nbelieve me, just look up the top trending search. Everyone already knows.”"
      },
      {
        "paragraph": "Shaun rubbed his temples and laughed hoarsely. “ You’re lying to me. Today is April Fool’s, right?”"
      },
      {
        "paragraph": "“No, Shaun. Catherine really got married. Snap to your senses and come back. Rodney and I will drink\nwith you.”"
      },
      {
        "paragraph": "“Shut up. She can’t get married. It’s not even 12 now.” He roared, refusing to believe the fact."
      },
      {
        "paragraph": "“No one stipulates that a marriage must be after 12.” Chester persuaded. “Calm down. You could divorce\nand break up with Catherine in the past. In fact, your feelings for her aren’t that deep. Maybe it’s just\nbecause you didn’t get…”"
      },
      {
        "paragraph": "“Barn.”"
      },
      {
        "paragraph": "Shaun hung up the phone."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "His feelings for Catherine were only because he did not get her?"
      },
      {
        "paragraph": "He loved her."
      },
      {
        "paragraph": "Although this love came too late and too suddenly, he just fell in love with her."
      },
      {
        "paragraph": "He wanted to have children with her. He wanted to be with her for the rest of his life."
      },
      {
        "paragraph": "Yes, he once hurt her, but he regretted it."
      },
      {
        "paragraph": "Lately, all that he had done was feeling remorse. He could not even sleep at night because of his regrets."
      },
      {
        "paragraph": "His head was blank for a long time until he finally turned on his phone and tapped on the news."
      },
      {
        "paragraph": "He did not need to search at all. The news of Catherine and Wesley’s wedding was discussed by\nnetizens all over the country."
      },
      {
        "paragraph": "The Internet was full of photos from their wedding. She wore a snow-white wedding dress and a sweet\nsmile. He knew that she was beautiful, but he did not expect that she would be even more beautiful in a\nwedding dress."
      },
      {
        "paragraph": "He scrolled down. There were photos of Wesley and her exchanging rings, and photos of Wesley kissing\nher."
      },
      {
        "paragraph": "Every photo was like a stab to his heart. The pain was suffocating."
      },
      {
        "paragraph": "His whole body froze and his eyes flooded with uncontrollable tears."
      },
      {
        "paragraph": "How could she do this?"
      },
      {
        "paragraph": "They had only separated for a few days, but she married someone else in the blink of an eye."
      },
      {
        "paragraph": "He knew he was in the wrong. Why did she not give him a chance?"
      },
      {
        "paragraph": "His eyes suddenly turned red, like a beast about to lose control."
      },
      {
        "paragraph": "No. No, she was his woman. He would never let her belong to someone else."
      },
      {
        "paragraph": "So what if she was married? She could only be his."
      },
      {
        "paragraph": "He would make whoever dared to take her away from him live a life worse than death."
      },
      {
        "paragraph": "He looked up sharply and roared at the captain. “ How long till we reach Melbourne?”"
      },
      {
        "paragraph": "He could no longer wait."
      },
      {
        "paragraph": "“T… Ten minutes.” The captain trembled with fear a t his look."
      },
      {
        "paragraph": "“Get me to the hotel at the fastest speed.”"
      },
      {
        "paragraph": "Shaun ordered and dialed Chance’s number. “Call everyone available to Melbourne as soon as\npossible.”"
      },
      {
        "paragraph": "So what if Catherine was married? Since he had his eye on her, he would take her away no matter what."
      }
    ]
  },
  {
    "title": "Chapter 954 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "At the wedding reception."
      },
      {
        "paragraph": "Catherine changed into a red gown. The dress accentuated all the right curves and a beautiful diamond\nnecklace adorned her neckline."
      },
      {
        "paragraph": "There was no doubt that as the bride today, she was the fairest of them all."
      },
      {
        "paragraph": "“Uncle, A-… Aunt. Congratulations.”"
      },
      {
        "paragraph": "At another table of friends and family, Ethan raised a toast with mixed emotions."
      },
      {
        "paragraph": "“Thank you.” Catherine was just about to drink when Wesley reminded her gently. “Don’t drink so much.\nA gentle sip is fine.”"
      },
      {
        "paragraph": "“Wow, the groom is so caring for the bride.”"
      },
      {
        "paragraph": "Someone from the Lyons family yelled with a smile. “The bride can drink less, but the groom has to drink\nthree glasses.”"
      },
      {
        "paragraph": "“Uncle, don’t give Wesley a hard time.” Catherine smiled helplessly. “We have an afternoon flight for our\nhoneymoon later this afternoon.”"
      },
      {
        "paragraph": "“Tsk tsk, Wesley, look at how protective your bride is. Shouldn’t you drink more?” The man did not back\ndown and instead became more aggressive."
      },
      {
        "paragraph": "“Okay.” Wesley looked at Catherine affectionately. “ Don’t worry, I can hold my drink, I’ll be fine.”"
      },
      {
        "paragraph": "“But…”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“I’m already very happy that you’re so concerned about me. ” Wesley was elated from the bottom of his\nheart."
      },
      {
        "paragraph": "Catherine looked at him smiling like a child, and her heart flooded with a trace of pain. She vowed that\nshe would treat him better in the future."
      },
      {
        "paragraph": "At that moment, there was a sudden rumbling sound from outside."
      },
      {
        "paragraph": "Someone yelled, “Who is it? They actually flew a helicopter here.”"
      },
      {
        "paragraph": "“It must be some big shot.”"
      },
      {
        "paragraph": "Catherine’s expression changed slightly. She remembered that Shaun had a private jet, and Hadley said\nthat he should arrive around this time."
      },
      {
        "paragraph": "Oddly he still had the guts to come even after the news of her wedding was known to everyone."
      },
      {
        "paragraph": "Wesley also noticed it and subconsciously gripped her hand. “Don’t worry, I arranged for people to guard\noutside. Melbourne is our territory. I don’t believe that Shaun would dare to steal someone else’s wife in\nfront of everyone else.”"
      },
      {
        "paragraph": "Catherine’s thin lips trembled."
      },
      {
        "paragraph": "If it were someone else, they might not do it, but Shaun was not an average person. He was crazy. No\none knew what he would do."
      },
      {
        "paragraph": "“Wesley, I think we’d better go first.” She said uneasily."
      },
      {
        "paragraph": "“ … Okay. ” Wesley frowned. It was not the time to get forceful with Shaun yet."
      },
      {
        "paragraph": "However, just as he took Catherine’s hand and was about to leave, a cold black figure walked in from the\nmain entrance of the banquet hall. The man had an incomparably handsome face, and even if he was"
      },
      {
        "paragraph": "wearing an ordinary black shirt, his unparalleled and noble aura was enough to crush the people present."
      },
      {
        "paragraph": "The wind fluttered his shirt, and at that moment, the man’s darkness was like a demon from hell. His\neyes were red and bloodshot, and even his handsome face was filled with grim destruction."
      },
      {
        "paragraph": "Everyone drew a cold breath."
      },
      {
        "paragraph": "The hostility emanating from the young man filled the hall with fearful apprehension."
      },
      {
        "paragraph": "Liam stroked his forehead. It seemed there was no way this meal could continue on peacefully anymore."
      },
      {
        "paragraph": "“Uncle…” Suzie stood up excitedly, but the light in her eyes disappeared quickly."
      },
      {
        "paragraph": "Forget it. Scummy dad was too late. Uncle Wesley and Mommy were already married."
      },
      {
        "paragraph": "“Shaun Hill…” Ethan frowned and revealed the man’s identity."
      },
      {
        "paragraph": "The crowd was in an uproar. He was Shaun Hill?"
      },
      {
        "paragraph": "The most distinguished man in the country, Shaun Hill?"
      }
    ]
  },
  {
    "title": "Chapter 955 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Mom, that’s Shaun Hill. He’s so handsome. He’s more handsome than the photos on the Internet.”"
      },
      {
        "paragraph": "“I thought that Wesley was handsome, but compared to Shaun, Shaun is more handsome.”"
      },
      {
        "paragraph": "“Shut up, you little brat.”"
      },
      {
        "paragraph": "A group of young ladies chattered, and Wesley’s handsome face could not help but sink."
      },
      {
        "paragraph": "He instinctively stood in front of Catherine."
      },
      {
        "paragraph": "Shaun caught a glimpse of Catherine in the crowd. She easily stood out in the crowd with the red gown\nand her snow-white skin made her look breathtaking."
      },
      {
        "paragraph": "That was his woman."
      },
      {
        "paragraph": "However, at that moment, Wesley was actually holding her hand, and she hid behind Wesley like a little\nwoman."
      },
      {
        "paragraph": "A cold chill swept up."
      },
      {
        "paragraph": "With big strides, Shaun headed towards them."
      },
      {
        "paragraph": "His gloomy face had daggers in his eyes, and no one would think that he had come to congratulate\nthem."
      },
      {
        "paragraph": "“Eldest Young Master Hill, if you’re here to congratulate us, then I welcome you, but if you’re here to ruin\nthe wedding, I can only tell you that you’re too late. Cathy is now my wife.”"
      },
      {
        "paragraph": "Wesley looked at Shaun solemnly. “Please stop harassing my wife.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Your wife?”"
      },
      {
        "paragraph": "Shaun let out a low laugh, but the laugh was desolate and tragic."
      },
      {
        "paragraph": "Once, she was his wife."
      },
      {
        "paragraph": "He was the one who personally had someone press her down and force her to sign the divorce papers."
      },
      {
        "paragraph": "If only there was a time machine. If only there was a medicine for regret."
      },
      {
        "paragraph": "He wanted to go back and punch his former self. What kind of woman did he lose because of Sarah\nNeeson?"
      },
      {
        "paragraph": "It hurt so much that he wanted to die. “It’s just a wedding ceremony. Have you registered?” He sneered."
      },
      {
        "paragraph": "Wesley looked at him without any change in expression. “We have. We registered yesterday at noon.\nShaun Hill, I’m different from you. If I want to marry a woman, I’ll register the marriage, and I’ll also give\nher a wedding. “"
      },
      {
        "paragraph": "The last ray of hope in Shaun’s eyes was completely annihilated."
      },
      {
        "paragraph": "There seemed to be something unbearable coming up his throat, and he almost could not stand upright."
      },
      {
        "paragraph": "He never expected that in just a few days, she had already registered her wedding with another man."
      },
      {
        "paragraph": "Shaun looked at the wedding site. Joel, Suzie, Liam, and everyone else knew. Only he was kept in the\ndark."
      },
      {
        "paragraph": "“Shaun, go.” Catherine looked at his miserable pale face and frowned. “I’ve made it very clear between\nyou and me. We ended a long time ago.”"
      },
      {
        "paragraph": "“We ended a long time ago?” Shaun gave a low laugh until tears seeped from his eyes. “We only ended\na few days ago. Had it been longer than half a month? Half a month ago, you were still lying in my bed.”"
      },
      {
        "paragraph": "His voice was very loud, and the guests started talking, looking at Catherine with eyes full of disdain."
      },
      {
        "paragraph": "Wesley’s parents grew so angry their faces turned red, but they were helpless. After all, their son liked\nthat woman."
      },
      {
        "paragraph": "Catherine’s eyes were full of anger. “Yes, I used to be with you. But when I was with you, I never did\nanything behind your back. I only got together with Wesley after thoroughly breaking up with you.”"
      },
      {
        "paragraph": "“Shaun Hill, you don’t need to stir up trouble.” Wesley held Catherine’s shoulder as his eyes deepened. “I\nalready know about you and Cathy. Of course, I have to thank you. If you hadn’t done such things, Cathy\nwouldn’t have accepted me so quickly.”"
      },
      {
        "paragraph": "Shaun was once again viciously stabbed."
      },
      {
        "paragraph": "What did that mean? He hurt her by helping Sarah, so she completely gave up on him and thought that\nWesley was better?"
      }
    ]
  },
  {
    "title": "Chapter 956 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Everyone at the wedding was staring at Shaun."
      },
      {
        "paragraph": "He was the most distinguished man in the country, but at that moment, he looked miserable like a big\nboy who lost something beloved. His face was painted with uncertainty and helplessness."
      },
      {
        "paragraph": "However, a moment later, he laughed darkly. It was cold, eerie, and frightening."
      },
      {
        "paragraph": "“Wesley Lyons, don’t you know what kind of person I am? She’s my woman. She’s mine for life. So what\nif she’s married? It’s just a piece of paper.”"
      },
      {
        "paragraph": "Shaun stepped forward coldly, his handsome face written with madness."
      },
      {
        "paragraph": "Wesley and Catherine were horrified. They seemed to have underestimated Shaun’s shamelessness."
      },
      {
        "paragraph": "“Shaun Hill, get over it. I stopped loving you long ago.” Catherine could not help but yell. She had told\nhim this many times already."
      },
      {
        "paragraph": "“It doesn’t matter as long as I love you.” Shaun reached out to grab her hand, but Wesley punched him\nimmediately."
      },
      {
        "paragraph": "After exchanging a few punches, Wesley was at a disadvantage."
      },
      {
        "paragraph": "“Uncle, I’ll help you.” Ethan jumped up immediately, and the men from the Lyons family also gathered\naround quickly to help."
      },
      {
        "paragraph": "The crazy Shaun took them all down and they were writhing in pain and were not able to get up."
      },
      {
        "paragraph": "“Guards!” Wesley gripped his chest and shouted to the outside of the hall while struggling to get up."
      },
      {
        "paragraph": "His call for help fell on deaf ears. The people who came in were a group of burly strangers."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Eldest Young Master, all the people outside have been cleaned up.” The man leading the pack said to\nShaun respectfully."
      },
      {
        "paragraph": "“Good job.”"
      },
      {
        "paragraph": "Shaun nodded in appreciation."
      },
      {
        "paragraph": "Catherine looked at Shaun like he was the devil."
      },
      {
        "paragraph": "Joel could not hold back and warned angrily, “ Shaun Hill, enough is enough. Yes, with your ability, you\ncan take Cathy away, but have you thought of the reputation of your family and Hill Corporation? Their\nnames would be ruined. You’re stealing someone else’s wife when there are"
      },
      {
        "paragraph": "reporters present. Your behavior is too rampant. If news spreads, your family and you will be spurned by\nthe whole of Australia.”"
      },
      {
        "paragraph": "“Yes, Shaun, stop it already.” Liam also stood up in a hurry to dissuade him. “Grandpa and Grandma will\nfaint from anger.”"
      },
      {
        "paragraph": "“I’ve said this before. No one can stop me today. ” There was no warmth in Shaun’s eyes. He only looked\nat Catherine."
      },
      {
        "paragraph": "Catherine took one look at him and ran towards the backdoor."
      },
      {
        "paragraph": "However, she was wearing a gown and high heels, and Shaun quickly caught up with her. He knocked\nher out and picked her up."
      },
      {
        "paragraph": "“Cathy…” Wesley quickly rushed over, but a member of Liona stopped him and started fighting."
      },
      {
        "paragraph": "When he passed Wesley’s parents, he gave a grim warning. “If any of you dare to call the police\nregarding this matter, I don’t mind making the leading pharmaceutical company in the country disappear\ncompletely.”"
      },
      {
        "paragraph": "He carried Catherine and went straight to the helicopter on the lawn, and left."
      },
      {
        "paragraph": "Wesley’s parents could not help but shiver thinking about the cold look in his eyes earlier."
      },
      {
        "paragraph": "Mr. Lyons lost his temper at Wesley. “I told you not to marry that woman, but you insisted. Look now. You\njust married but your wife got taken away.”"
      },
      {
        "paragraph": "Wesley’s gentle face was distorted with anger."
      },
      {
        "paragraph": "He never expected that Shaun would be so rampant as to steal his wife in public. That was simply\nstepping on his face to the ground."
      },
      {
        "paragraph": "Whenever he faced Shaun, he was always like an ant."
      },
      {
        "paragraph": "Originally, today was supposed to be his wedding night, but Catherine ended up with Shaun."
      },
      {
        "paragraph": "When he thought about what might happen between the two, he was so angry he wanted to vomit blood."
      },
      {
        "paragraph": "‘Shaun Hill, I will never let you off.’ He angrily took out his phone."
      },
      {
        "paragraph": "Sonya grabbed it. “Are you insane? Didn’t you hear his warning? You can’t call the police. Our Lyons\nfamily is no match for Shaun Hill.”"
      }
    ]
  },
  {
    "title": "Chapter 957 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Yes, you can’t call the police.” Mr. Lyons said furiously. “You can’t have that woman either. Divorce her\nas soon as she comes back.”"
      },
      {
        "paragraph": "“This is my business. Stay out of it.” Wesley left with a deadpan face."
      },
      {
        "paragraph": "Suzie and Lucas glanced at each other, and they both looked at Liam at a loss for words."
      },
      {
        "paragraph": "“Uncle, what should we do? Scummy dad actually took Mommy away.” Suzie shivered. Scummy dad\nwas really scary just now."
      },
      {
        "paragraph": "Lucas was also anxious. “Uncle, will Mommy be"
      },
      {
        "paragraph": "fine?” \n“Don’t worry. Shaun just doesn’t want your mommy to be with Wesley.”"
      },
      {
        "paragraph": "Although that was what Liam said, his heart shivered."
      },
      {
        "paragraph": "Shaun was not a normal person. He was mentally ill. Who knew when he would act up? It was not like he\nnever hurt Catherine in the past. Hopefully, he"
      },
      {
        "paragraph": "could calm down this time."
      },
      {
        "paragraph": "“The consequences of this matter are too severe. I have to hurry back to the Hill family.” Liam sighed.\nShaun’s actions completely ruined the Hill family’s name. In the future, the Hill family would be scorned\nwherever they went."
      },
      {
        "paragraph": "Back in the hotel suite, Wesley quickly dialed a number. “Transfer the people to me. I want Shaun Hill to\ndie.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Not now.” The person said in a low voice. “Calm down. If you want to achieve great things, then you\nhave to bear it. You’ve already endured it for so many years. It’s just a little more.”"
      },
      {
        "paragraph": "“But my wife was taken away.” Wesley roared. “ Who knows what Shaun will do to her.”"
      },
      {
        "paragraph": "“Then, have you ever thought of how Catherine Jones will look at you if you bring so many people over?\nShe’ll suspect you, and Shaun Hill will also be suspicious.”"
      },
      {
        "paragraph": "The person said coldly, “If Catherine Jones finds out that you were behind what happened to Logan Law,\ndon’t you think she’ll hate you?”"
      },
      {
        "paragraph": "Wesley felt like a pail of cold water was poured on"
      },
      {
        "paragraph": "him ."
      },
      {
        "paragraph": "He could not say anything for a long time."
      },
      {
        "paragraph": "He just tightened his grip on the phone and veins were seen bulging on the back of his hand."
      },
      {
        "paragraph": "The person continued, “Besides, it’s not the first time Shaun slept with her. Just endure it a little longer.\nAfter that, I’ll let you handle Shaun however you want. When that time comes, you can crush"
      },
      {
        "paragraph": "him to death like an ant. Make him suffer as much a s the rampage he had caused today.”"
      },
      {
        "paragraph": "The person then ended the call."
      },
      {
        "paragraph": "Wesley smashed the phone on the spot."
      },
      {
        "paragraph": "Fine. He would endure it. He would endure for one more month."
      },
      {
        "paragraph": "“Shaun Hill, in one month, you’ll be greeted by hell’s gate.”"
      },
      {
        "paragraph": "His ferocious face reflected in the mirror on the wall."
      },
      {
        "paragraph": "In the helicopter."
      },
      {
        "paragraph": "Shaun greedily stared at Catherine’s lustrous and"
      },
      {
        "paragraph": "limpid face."
      },
      {
        "paragraph": "He gently touched her little face. She looked quiet and gentle after fainting."
      },
      {
        "paragraph": "If only she would be like this forever. Why did so many hurtful words have to come out of her mouth?"
      },
      {
        "paragraph": "“I’m sorry, forgive me. I’ll use the rest of my life to make it up to you.”"
      },
      {
        "paragraph": "Shaun forcefully wiped off the lipstick on her lips. Wesley had kissed her like that before, so he wanted to\nerase all traces."
      },
      {
        "paragraph": "After wiping it clean, he lowered his head and kissed her moist lips."
      },
      {
        "paragraph": "He tainted it with his breath. Lea, Old Master Hill, and Old Madam Hill took turns to call him but he did\nnot answer. After a long kiss, he dialed Hadley’s number. “I’m bringing Cathy to the villa on my private\nisland. Get the people there to arrange a small wedding banquet immediately. I’ll hold a wedding with\nCathy tonight.”"
      }
    ]
  },
  {
    "title": "Chapter 958 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Hadley was at his wit’s end. He even had an overwhelming urge to kill himself."
      },
      {
        "paragraph": "News that Shaun took Catherine away had spread throughout Australia."
      },
      {
        "paragraph": "It was drawing heavy criticisms all over the internet at this point."
      },
      {
        "paragraph": "The netizens were lashing out at Eldest Young Master Hill on Hill Corporation’s official website, yet he\nstill insisted on holding a wedding."
      },
      {
        "paragraph": "Hadley felt like reminding him that the woman he wanted to marry had already married someone else."
      },
      {
        "paragraph": "‘Eldest Young Master Hill, is your illness being triggered again?’"
      },
      {
        "paragraph": "For the sake of Eldest Young Master Hill’s dignity, Hadley dared not say it. He agreed to the man’s idea\nreluctantly."
      },
      {
        "paragraph": "Five hours later."
      },
      {
        "paragraph": "The helicopter landed on a private island. In the middle of the entire island was a manor."
      },
      {
        "paragraph": "At this moment, the servants in the manor were busy decorating the manor with roses."
      },
      {
        "paragraph": "Shaun placed Catherine lightly on the bed in the master bedroom."
      },
      {
        "paragraph": "Outside the French window was the azure ocean stretching to the horizon."
      },
      {
        "paragraph": "This place was so serene that Shaun was less cranky than before. He could even look at Catherine"
      },
      {
        "paragraph": "silently like she was his beloved wife. Nobody would come here to destroy their relationship."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "When his gaze settled on Catherine’s wedding dress, his eyes narrowed in annoyance."
      },
      {
        "paragraph": "“Butler, bring the bridal gown here.”"
      },
      {
        "paragraph": "A brand new white wedding dress was soon brought to Shaun. He personally changed the dress for her.\nShortly after, Catherine sat up while pressing on her aching neck."
      },
      {
        "paragraph": "She looked around the strange room, feeling dazed."
      },
      {
        "paragraph": "When she lowered her head, she found herself wearing a wedding dress that she had never seen\nbefore. The dress was embedded with many tiny"
      },
      {
        "paragraph": "pearls. At first glance, she thought she had turned into a mermaid."
      },
      {
        "paragraph": "Anyway, why was she here? Where was this place?"
      },
      {
        "paragraph": "She remembered Shaun barging in and even knocking her unconscious during her wedding with Wesley."
      },
      {
        "paragraph": "Her expression changed. She glanced out of the window and realized that the sky had darkened."
      },
      {
        "paragraph": "At this moment, Shaun came in with a tray. He was wearing a pair of black trousers with a white shirt and\na black vest. The hair on his forehead was combed up and gelled a little, revealing his bright forehead.\nHe looked outstanding and strikingly handsome."
      },
      {
        "paragraph": "“You’re awake. Have some desserts.”"
      },
      {
        "paragraph": "Shaun gently put the tray on the bedside table."
      },
      {
        "paragraph": "“Shaun, you madman, where is this place?! ” Catherine struggled to get up. While barefoot, she made a\nrun to the door without bothering about him."
      },
      {
        "paragraph": "Before she could dash out, however, Shaun clutched her arm. He took a pair of clean slippers and put\nthem in front of her. “Wear them.”"
      },
      {
        "paragraph": "“I’m not wearing them.” Unable to pull herself together, Catherine kicked the slippers away. “If you don’t\nwear them, I won’t let you out.” Shaun tightened his grip on her arm, but his tone remained soft. “Come\non, or you’ll hurt your feet.”"
      }
    ]
  },
  {
    "title": "Chapter 959 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Somehow, being faced with Shaun who was behaving like this gave Catherine nothing but goosebumps."
      },
      {
        "paragraph": "How could he have been so frightening during the wedding earlier yet act completely different at this\nmoment?"
      },
      {
        "paragraph": "Was he suffering from schizophrenia?"
      },
      {
        "paragraph": "Catherine thought that it would not be appropriate for her to be barefoot if she wanted to run away later.\nAfter hesitating for a moment, she wore the slippers."
      },
      {
        "paragraph": "Once Shaun let go of her, she rushed out like a madwoman."
      },
      {
        "paragraph": "It was a strange place that was as large as a castle. With the walls being decorated with roses, ribbons,\nand streamers, the scene gave off a joyful atmosphere. Seemingly, a grand wedding had just been held\nand now was the time for the couple to spend their first night together."
      },
      {
        "paragraph": "The servants who walked past Catherine were blacks and whites. All of them grinned at her and greeted\nher from time to time, “Hi, Madam.”"
      },
      {
        "paragraph": "Catherine found it creepy, so she ran even more quickly."
      },
      {
        "paragraph": "However, she dashed out of the manor only to find another manor outside."
      },
      {
        "paragraph": "After spending a long time running, she ran into a strange forest. Nevertheless, all she could see\nafterward was the boundless ocean."
      },
      {
        "paragraph": "She was dumbfounded."
      },
      {
        "paragraph": "Was she not in Australia anymore?"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "She did not have her phone with her either."
      },
      {
        "paragraph": "A sense of fear that she had not experienced for a long time crept into her mind."
      },
      {
        "paragraph": "She heard some footsteps behind her. When she turned around, Shaun was walking toward her on the\nbeach. His eyes were dark like the vast sky above him."
      },
      {
        "paragraph": "She went completely insane. “Shaun, you’re such a lunatic! Where on earth is this? Do you understand\nthat I’ve married Wesley and it’s illegal to snatch someone else’s wife?”"
      },
      {
        "paragraph": "“It’ll only be considered illegal if Wesley calls the"
      },
      {
        "paragraph": "police. Since he hasn’t called the police, you can’t call it illegal.” Shaun shoved his hands into the\npockets of his trousers, his thin lips curving into a casual smile."
      },
      {
        "paragraph": "Catherine was stunned. Had Wesley not called the police after Shaun took her away?"
      },
      {
        "paragraph": "“Did you threaten Wesley again?” Catherine lifted her head and glared at him with burning eyes."
      },
      {
        "paragraph": "“ Since he let himself be threatened, it shows that you’re actually not that important to him. ” Shaun\nlowered his head and gazed at her. The breeze had messed up her long thick and flowing hair."
      },
      {
        "paragraph": "He could not help but stretch out his hand to tidy up her hair. However, before he could touch her, she\nsmacked his hand away."
      },
      {
        "paragraph": "Catherine gave a cold laugh and gazed at him. “ What else could you have used to threaten him aside\nfrom his company? If you were in his shoes, you wouldn’t let go of your company as well.”"
      },
      {
        "paragraph": "“I would, ” Shaun answered without a second"
      },
      {
        "paragraph": "thought."
      },
      {
        "paragraph": "Perhaps he would not have done so back then, but he had come to realize that she was the most\nimportant thing to him now. “Cathy, I can still make money if I lose it, but it’ll be unbearably"
      },
      {
        "paragraph": "painful to lose you.”"
      },
      {
        "paragraph": "“Shut up.” Catherine did not believe him at all. She fell into a state of agitation and argued, “You’re\nalways like this! Your words are always so sweet, but who was the one who hurt me the most during the\nlast few years? Shaun Hill, I chose Wesley because I don’t want to live the kind of life where I have\nhopes for you yet they’re shattered the next minute. It’s tiring. I can’t even have faith in you. We won’t be\nhappy this way.”"
      },
      {
        "paragraph": "“We will. I’ll believe in whatever you say in the future.”"
      },
      {
        "paragraph": "Shaun placed his hand on her shoulder in agony. “It finally hit me now that I should love and tolerate the\nperson I love unconditionally regardless of whether she’s wicked, bad, or good.”"
      },
      {
        "paragraph": "“Hah! It didn’t just hit you. You’ve long since known this, at least from Sarah. No matter how wicked she\nis, you still like her, ” Catherine screamed at him."
      },
      {
        "paragraph": "“I… I didn’t know.” Shaun gave a bitter smile. “ I knew her since I was young, and I had no idea when she\nchanged. Cathy, I have nothing to do with her anymore. I’ve blocked her WhatsApp contact and number.\nIf anything happens to her in the future, I won’t bother anymore— ”"
      },
      {
        "paragraph": "“Enough. Drop it. We can never get back together. I’ve long since stopped loving you. I just want to live\nan ordinary life with Wesley in the future."
      },
      {
        "paragraph": "Please let me return.”"
      },
      {
        "paragraph": "Catherine shook her head. “I really don’t love you anymore. You don’t hold a place in my heart anymore.\nOtherwise, I wouldn’t be marrying Wesley.”"
      }
    ]
  },
  {
    "title": "Chapter 960 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "A look of frustration washed over Shaun’s face."
      },
      {
        "paragraph": "Catherine had told him many times that she was not in love with him, and he knew that she meant it."
      },
      {
        "paragraph": "He actually made a woman stop loving him. Haha."
      },
      {
        "paragraph": "“It doesn’t matter if you don’t love me. You loved me back then, and now, it’s my turn to love you and\ntime for you to torture me. It’s fair now.”"
      },
      {
        "paragraph": "As soon as Shaun finished speaking, he held her arm and pulled her into his embrace."
      },
      {
        "paragraph": "“What are you doing? Let me go, Shaun. By doing this, you’ re not making me torture you. Instead,\nyou’re torturing me again.” Catherine struggled furiously and even attacked him."
      },
      {
        "paragraph": "It was Logan who taught her martial arts. However, she was soon defeated."
      },
      {
        "paragraph": "Shaun forcefully carried her to the manor. The butler walked up to him and said, “Eldest Young Master\nHill, everything in the church is ready.”"
      },
      {
        "paragraph": "Catherine had a sinking feeling. After she was taken to the church, she had a bad premonition when she\nsaw the decorations at the venue. It looked like a wedding ceremony was being held. “What are you\ntrying to do? I already had a wedding ceremony with Wesley this afternoon.”"
      },
      {
        "paragraph": "“Forget about it. Today is our wedding.” Shaun dragged her to the priest by force. “We can now begin the\nceremony.”"
      },
      {
        "paragraph": "“Alright.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "The priest asked Shaun with a grin, “Shaun Hill, do you take Catherine Jones to be your lawful wife and\nlive with her according to God’s ordinance? Will you live together with her in holy marriage and promise\nfrom this day onward to love her, honor her, comfort her, and treasure her until death parts both of you?”"
      },
      {
        "paragraph": "Shaun curled his lips into a smile. “I do.”"
      },
      {
        "paragraph": "The priest shifted his gaze to Catherine. “Catherine Jones, do you take Shaun Hill to be your lawful\nhusband and live with him according to God’s ordinance? Will you live together with him in holy marriage\nand promise from this day onward to love him, honor him, comfort him, and treasure him until death parts\nboth of you?”"
      },
      {
        "paragraph": "Catherine snorted. “I don’t—”"
      },
      {
        "paragraph": "“She does. ” Shaun covered her mouth before she could finish her sentence."
      },
      {
        "paragraph": "In a fit of fury, she stepped on Shaun’s foot. However, he did not seem to feel the pain at all. He lifted her\nfinger. The moment he saw the diamond ring on her finger, his eyes narrowed. He took off the ring and\nimmediately threw it away. After that, he took a pink ring from his pocket and placed it on her finger."
      },
      {
        "paragraph": "The priest smiled and said, “The groom may now kiss the bride.”"
      },
      {
        "paragraph": "Catherine widened her limpid eyes. Before she could come to her senses, Shaun had locked her lips\nwith his in an overbearing manner."
      },
      {
        "paragraph": "She kept biting him, yet he did not stop kissing her. She even tasted the blood from his mouth."
      },
      {
        "paragraph": "The kiss lasted for a long time. After all, Catherine was a woman who was easily embarrassed. At the\nthought of the priest’s presence, her pretty face turned crimson."
      },
      {
        "paragraph": "After Shaun let go of her, he smirked at the sight of her embarrassed face."
      },
      {
        "paragraph": "The priest said while smiling, “I now pronounce"
      },
      {
        "paragraph": "you husband and wife. Congratulations.”"
      },
      {
        "paragraph": "“Mm.”"
      },
      {
        "paragraph": "Shaun acknowledged the priest’s words with a deep voice. Then, he carried Catherine again and headed\nto the main building."
      },
      {
        "paragraph": "When Catherine entered the master bedroom on the second floor again, she noticed that the blanket had\nbeen changed to a white one with a heart shape formed by roses at the center."
      },
      {
        "paragraph": "She instantly felt terrible. At the same time, she was gripped by guilt deep down."
      },
      {
        "paragraph": "Wesley had prepared a newlywed room like this in Melbourne too. Nevertheless, Shaun had captured\nher here tonight."
      },
      {
        "paragraph": "Not being able to go back tonight was awful enough. If she continued to stay here with Shaun,"
      },
      {
        "paragraph": "her relationship with Wesley would certainly sour."
      },
      {
        "paragraph": "Given that Wesley treated her so well, she did not want to hurt him anymore."
      },
      {
        "paragraph": "What was more, she had planned on living a sweet and peaceful life after marrying Wesley."
      }
    ]
  },
  {
    "title": "Chapter 961 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Cathy, this is our room. Do you like it?” Shaun placed Catherine on the bed and leaned over to kiss her."
      },
      {
        "paragraph": "“Shaun, don’t come over.” Catherine, who was on the verge of breaking down, pushed his body away.\nShe was so anxious that tears welled in her eyes."
      },
      {
        "paragraph": "“Of course, I have to come over. I’m your husband. Tonight is our first night as a married couple.”"
      },
      {
        "paragraph": "Shaun forced his handsome, noble body on her. His knee pressed on the bed, and an aura of\nmasculinity surrounded Catherine right away."
      },
      {
        "paragraph": "“You’re not my husband. My husband is Wesley Lyons!” Catherine yelled uncontrollably, “Even if you’ve\nheld a wedding with me and made a vow, so what? Even with this newlywed room, it won’t erase the fact\nthat I’m already married to Wesley. Since I’ve registered my marriage with him, our marriage is legal.”"
      },
      {
        "paragraph": "“Shut up!”"
      },
      {
        "paragraph": "Shaun suddenly pushed her and used his right hand to cover her mouth. His deep —set eyes were filled\nwith grimness."
      },
      {
        "paragraph": "He had been trying his best not to recall it, but why did she always have to provoke him by reminding\nhim?"
      },
      {
        "paragraph": "With the way his blood was boiling, he felt as though he was going to lose his temper. He exerted his\nutmost strength to control himself for fear that his illness would be triggered just like before. When his\nillness was triggered, he might hurt her."
      },
      {
        "paragraph": "Unable to speak, Catherine could only widen her eyes and look at him imploringly with tears in her eyes."
      },
      {
        "paragraph": "If she spent the night with Shaun today, she would hate him forever as she would be viewed as"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "indecent because of him. She would never be able to bring herself to face Wesley."
      },
      {
        "paragraph": "“Don’t cry.” Shaun lowered his head and gently wiped away the tears on her face. He was heartbroken\ntoo, but he just wanted her to remember that this day belonged to the two of them instead of Wesley and\nher."
      },
      {
        "paragraph": "“Shaun, if you do this, I’ll hate you forever. I’ll never forgive you in my lifetime, ” Catherine enunciated\nevery word in agony."
      },
      {
        "paragraph": "“It’s good even if you hate me. At least you’ll remember me forever and ever.”"
      },
      {
        "paragraph": "Shaun pulled his tie off and forcefully tied up her disobedient hands."
      },
      {
        "paragraph": "When he saw her feeling lost and choking with tears, his heart ached so much that it almost broke."
      },
      {
        "paragraph": "However, what else could he do? He just wanted her to be pregnant with his child so that she would\nleave Wesley and come back to him."
      },
      {
        "paragraph": "“Cathy, I’m sorry. I love you.”"
      },
      {
        "paragraph": "He spent the whole night mumbling beside her ear until her eyes slowly became dull and filled with\nfrustration. In the end, her eyes were filled with nothing but endless resentment."
      },
      {
        "paragraph": "She was so tired that she fell asleep on a pillow. It was only then Shaun took the mini video camera on\nthe TV which was placed right opposite the bed in the room. He extracted a segment of the video and\nsent it to Wesley."
      },
      {
        "paragraph": "No man would be able to tolerate his wife sleeping with another man on their wedding night."
      },
      {
        "paragraph": "‘Wesley Lyons, once you watch this video, I don’t believe that you can pretend as if nothing has\nhappened and accept Catherine.’"
      },
      {
        "paragraph": "He admitted that he was despicable, yet he would lose Catherine forever if he did not behave so."
      },
      {
        "paragraph": "He did not want to lose Catherine. He never wanted it to happen."
      },
      {
        "paragraph": "4-00 a.m."
      },
      {
        "paragraph": "Melbourne."
      },
      {
        "paragraph": "Wesley was not sleeping but standing on the balcony like a statue. His eyes were bloodshot as a result\nof staying up. The ashtray beside him was already stuffed with cigarette butts."
      },
      {
        "paragraph": "Behind him was a bed."
      },
      {
        "paragraph": "It was supposed to be Catherine and his first night tonight after their wedding, yet Shaun had snatched\nher away."
      },
      {
        "paragraph": "Where was she? What was she doing now?"
      },
      {
        "paragraph": "Wesley was so perturbed that he could not pull himself together."
      }
    ]
  },
  {
    "title": "Chapter 962 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Suddenly, there was a ding from Wesley’s phone. He received a strange message."
      },
      {
        "paragraph": "He clicked it open and there was a short video."
      },
      {
        "paragraph": "In the video, the lights were not switched on but he could clearly see the two silhouettes on the bed. He\nrecognized the coquettish voice that belonged to Catherine."
      },
      {
        "paragraph": "All of a sudden, he felt as if his chest had burst open."
      },
      {
        "paragraph": "Wesley was not a fool. He could tell what they were doing."
      },
      {
        "paragraph": "However, he did not want to believe it. He dreaded thinking about it…"
      },
      {
        "paragraph": "Tonight was supposed to be his first night with her. He had anticipated this day for what seemed like an\neternity."
      },
      {
        "paragraph": "Ever since he met Catherine in Melbourne, he had fallen for her."
      },
      {
        "paragraph": "When she agreed to his proposal, he had indeed been delighted. Even though they only held a small-\nscale wedding, he had put a lot of effort into the decorations."
      },
      {
        "paragraph": "Little did he expect that his woman would end up being with Shaun on this night."
      },
      {
        "paragraph": "“Shaun Hill, I’ll make you suffer a living hell sooner or later.”"
      },
      {
        "paragraph": "Wesley kicked the coffee table in front of him. His elegant, handsome face became extremely ferocious."
      },
      {
        "paragraph": "“Also, Catherine Jones, why… Why are you treating me this way?”"
      },
      {
        "paragraph": "His gaze carried traces of rage."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "He used to hold a grudge against her, but his love for her was much stronger."
      },
      {
        "paragraph": "She was supposed to be his fiancée three years ago. Nevertheless, he knew that she only planned to\nmarry him just because he had saved her."
      },
      {
        "paragraph": "After he returned from the States three years later, h e learned that she wanted to seduce Shaun. He still\ntolerated her behavior bitterly. After all, she had"
      },
      {
        "paragraph": "not promised to be with him, but it was a different story now."
      },
      {
        "paragraph": "As his wife, she actually slept in another man’s arms on their wedding night."
      },
      {
        "paragraph": "‘Catherine Jones, have you no shame at all? Even if Shaun had forced you, couldn’t you have\nthreatened him with your life?’"
      },
      {
        "paragraph": "Wesley clenched his fists. He hated both Shaun and Catherine."
      },
      {
        "paragraph": "His eyes were grim for a long time. He immediately called his secretary. “Regina, are you asleep? Come\nt o my room now.”"
      },
      {
        "paragraph": "“President Lyons…” Regina Trent was both delighted and surprised. She wondered why President Lyons\nwas calling her over to his room at such a late hour. It was unlikely he wanted to talk about work with her."
      },
      {
        "paragraph": "She used to do everything she could to seduce Wesley, yet he would always keep a distance from her."
      },
      {
        "paragraph": "If Catherine had not been snatched away by Shaun, Wesley would not have been in a foul mood and\nasked her to accompany him."
      },
      {
        "paragraph": "Indeed, it was a golden opportunity for Regina to make her move on him tonight."
      },
      {
        "paragraph": "“Alright, President Lyons. I’m coming over right now.”"
      },
      {
        "paragraph": "Ten minutes later, Regina showed up in Wesley’s"
      },
      {
        "paragraph": "room in a white bathrobe. With an ulterior motive, she deliberately revealed much of her skin."
      },
      {
        "paragraph": "Wesley walked toward her with a somber, handsome face. Regina lifted her head and looked at him, her\nheart racing madly."
      },
      {
        "paragraph": "She had been in love with him for a long time. Not only was this man handsome and elegant, but he was\nalso young and capable. She would be at his beck and call even if she was asked to do something\ndisgraceful."
      },
      {
        "paragraph": "“President Lyons…” She blinked her eyes affectionately. Before she could come to her senses, Wesley\nroughly pulled her into his arms and kissed her passionately."
      },
      {
        "paragraph": "After being dazed for a moment, Regina was ecstatic."
      },
      {
        "paragraph": "She had not expected this. It was really beyond her expectations."
      },
      {
        "paragraph": "The bed tonight turned out to be for her."
      },
      {
        "paragraph": "In the manor on the island."
      }
    ]
  },
  {
    "title": "Chapter 963 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "The orange sun slowly rose above the horizon on the sea."
      },
      {
        "paragraph": "Only when it was noon did Catherine slowly open her tired eyes."
      },
      {
        "paragraph": "When she got up, she was alone on the messy bed with rose petals all over."
      },
      {
        "paragraph": "As the sea breeze blew, the curtains on the windows moved."
      },
      {
        "paragraph": "Her eyes were dazed. She never thought she would betray Wesley."
      },
      {
        "paragraph": "She had tried to resist Shaun with all her might last night, but that man was so stubborn and acted like a\nmadman. Her body was still aching even now."
      },
      {
        "paragraph": "She lifted the blanket and hid beneath it. She was curled up into a ball."
      },
      {
        "paragraph": "She did not dare to imagine herself facing the affectionate Wesley even if she could run away from this\nplace."
      },
      {
        "paragraph": "She did not deserve him. She truly did not."
      },
      {
        "paragraph": "All of a sudden, the door to the room was pushed open. A woman in her 40s came in with a pile of neat\nclothes. “Madam, you’re awake. Here are the clothes for you to get changed into. Do you want to take a\nshower—”"
      },
      {
        "paragraph": "“Get lost!” catherine swept everything off the tray on the bedside table like a lunatic. She wrapped her\nhands around her head with a pale look, while her disheveled hair fell over her shoulders."
      },
      {
        "paragraph": "The woman was so shocked that she retreated and bumped into someone."
      },
      {
        "paragraph": "When she turned around and took a look, she nervously called out, “ Eldest Young Master Hill.”"
      },
      {
        "paragraph": "let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Pass the clothes to me and go out.” Shaun walked to the bed while holding the clothes."
      },
      {
        "paragraph": "As soon as Catherine saw him, she picked up the petals and threw them onto his face. Her pretty face\nwas heavy with resentment."
      },
      {
        "paragraph": "“Are you done?” Shaun’s gaze remained gentle. “ Are you sure you want me to get lost? Don’t you want\nto put on the clothes? Or are you planning to stay in bed forever?”"
      },
      {
        "paragraph": "Upon being reminded, Catherine realized that she was naked. Also, the wedding dress she wore"
      },
      {
        "paragraph": "yesterday was torn. If she did not want the clothes, she would have nothing to put on."
      },
      {
        "paragraph": "“Since you don’t want the clothes, it’s fine.” Shaun raised his brows. He feigned helplessness and let out\na sigh. “Actually, I quite like how you look when you’re naked.”"
      },
      {
        "paragraph": "This nasty hooligan…"
      },
      {
        "paragraph": "Catherine was so furious that her face flushed."
      },
      {
        "paragraph": "Upon noticing that he was going to leave, she had no choice but to say in annoyance, “Stop right there.\nGive me the clothes.”"
      },
      {
        "paragraph": "“Okay, wifey.” Shaun gave a slight smile. He turned around and immediately passed her the clothes."
      },
      {
        "paragraph": "“Who’s your wife? You’re mistaken. I’m Wesley’s wife.” Catherine scoffed. She did not forget to irritate\nhim."
      },
      {
        "paragraph": "Shaun’s gentle gaze froze for a moment before it became soft again. “Cathy, I’m not pissed. I used to\ntorture you, so now it’s your turn to torture me. As long as you’re happy and you can vent out your anger,\nit’s fine.”"
      },
      {
        "paragraph": "Catherine could not help but fly into a temper. “ I don’t want to torture you. I just want to stay away"
      },
      {
        "paragraph": "from you. I hate you.”"
      },
      {
        "paragraph": "“Yeah, you hate me, but I wonder who pleased you last night?” Shaun narrowed his eyes."
      },
      {
        "paragraph": "Catherine’s pretty face turned crimson in an instant. She wished she could scratch his face."
      },
      {
        "paragraph": "“Cathy, no matter how much you mention hating m e and not loving me anymore, your body is still used\nto me. ” Shaun lowered his head and kissed her on her thin lips."
      },
      {
        "paragraph": "Catherine did not dodge but said indifferently, “It’s just my physical needs. I behave like this when I’m\nwith Wesley too. What’s more, I think you can’t be compared to him…”"
      },
      {
        "paragraph": "“Try and say that again.”"
      },
      {
        "paragraph": "Shaun squeezed her cheeks, his eyes revealing a strong sense of annoyance. Soon, her face reddened."
      },
      {
        "paragraph": "Catherine glowered at him willfully. “I’ve been in a relationship with him for some time now. Isn’t it normal\nfor us to have slept together by now?”"
      },
      {
        "paragraph": "“Cathy, why must you force me? I don’t want to hurt you.” Shaun felt his anger simmering within him."
      },
      {
        "paragraph": "The way Shaun was behaving at this point filled Catherine with dread again. All of a sudden, she"
      },
      {
        "paragraph": "regretted it a little. Back then, he had hurt her so terribly that she was sent to the hospital in the middle of\nthe night. That incident was still a nightmare that haunted her."
      }
    ]
  },
  {
    "title": "Chapter 964 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Shaun… Shaun Hill, you’ve said that you won’t hurt me again. Are you going to go back on your word?”\nCatherine said anxiously, “Well, you’ve never fulfilled any of your promises anyway.”"
      },
      {
        "paragraph": "All of a sudden, Shaun’s angry figure froze as if he had been paralyzed."
      },
      {
        "paragraph": "He lowered his eyes while the woman gazed at him sarcastically."
      },
      {
        "paragraph": "“I… I’m not going back on my word.” Three seconds later, he straightened his body. His heart was filled\nwith misery and bitterness. “Having said that… Cathy, don’t trigger me. I treat you as my woman.\nAlthough I was in a relationship with Sarah, I’ve never touched any other woman except for you.”"
      },
      {
        "paragraph": "Catherine was stunned before she mocked, “Don’t deceive me by treating me as a fool. You’ve been in a\nrelationship with Sarah for over ten years. It’s impossible that you’ve never slept with her at all. I don’t\nbelieve it, considering that both of you have been together for such a long time.”"
      },
      {
        "paragraph": "“ She was still young back then. Later, I was busy managing Hill Corporation, so I wasn’t concerned\nabout that kind of stuff. After that, she studied abroad in the States and went missing. I’ve only done it\nwith you.” Shaun himself found it miraculous as well after he finished speaking."
      },
      {
        "paragraph": "In fact, he had not told Catherine something— namely that he did not have any sexual urges nor arousal\nwhen he was with Sarah."
      },
      {
        "paragraph": "He did not understand it in the past, but now, he gradually made sense of it."
      },
      {
        "paragraph": "When he kept protecting Sarah regardless of everything else, it did not mean that he loved her. He\nmerely treated her as his family or the only gleam of light in the dark."
      },
      {
        "paragraph": "He used to believe that Sarah was kind and wonderful, forgetting the fact that people changed."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Only when he met Catherine did he realize what an unforgettable love was. Being with her made him feel\nextremely relaxed, sweet, and happy."
      },
      {
        "paragraph": "When he did not see her, he would miss her. When he ate the food she made, it tasted like the most\ndelicious food in the world."
      },
      {
        "paragraph": "No matter what state she was in, he would still"
      },
      {
        "paragraph": "think that she was the most beautiful person."
      },
      {
        "paragraph": "“The clothes are here. After you put them on, I’ll prepare breakfast for you.”"
      },
      {
        "paragraph": "With that, Shaun turned around. He closed the door and left."
      },
      {
        "paragraph": "After spacing out on the bed for a moment, Catherine slowly dragged herself out and took a shower."
      },
      {
        "paragraph": "When the hot water splashed over her body, she still could not believe it."
      },
      {
        "paragraph": "Shaun’s first time had been with her?"
      },
      {
        "paragraph": "It was unbelievable."
      },
      {
        "paragraph": "After taking her shower, she wore a new pair of"
      },
      {
        "paragraph": "jeans and a white T-shirt. Although the outfit was not from luxurious brands, it was comfortable."
      },
      {
        "paragraph": "However, she could not hide the hickeys on her neck and collarbones."
      },
      {
        "paragraph": "After some thought, she did not mind exposing the hickeys since she did not know anyone else on the\nisland."
      },
      {
        "paragraph": "In a desperate situation like this, she had to find out where she was and contact someone outside."
      },
      {
        "paragraph": "She was too ashamed to contact Wesley, so she"
      },
      {
        "paragraph": "could only contact Logan and Austin."
      },
      {
        "paragraph": "After she walked out of the room, she happened to come across a black female servant who was walking\ntoward her. She tried to borrow a phone from her, but she noticed that there was a language barrier\nbetween them. Considering that the servant was unable to speak English, Catherine felt so helpless that\nshe used gestures to communicate."
      },
      {
        "paragraph": "When the servant finally took out her phone from her pocket, Catherine was dumbfounded. There were\npeople who still used such ancient phones? Displayed on the screen were words that she had never\nseen before. She could not understand anything, much less use the phone to download the social media\napps she was familiar with."
      },
      {
        "paragraph": "She asked a few other servants afterward but it was all the same."
      },
      {
        "paragraph": "She eventually sank into despair. Where the hell was this?"
      },
      {
        "paragraph": "After she walked down the stairs in dejection, Shaun brought the breakfast out of the kitchen while\nwearing an apron."
      },
      {
        "paragraph": "She glanced at the breakfast. There were poached eggs, oat milk, sandwiches, avocado salad, and\ndifferent kinds of fresh fruits on the table."
      },
      {
        "paragraph": "“You used to capture my stomach and heart with your cooking, so now, I’ll use my cooking to win your\nheart again.”"
      },
      {
        "paragraph": "Shaun removed the apron and put it aside. Today, h e wore a white T-shirt that was similar to hers and a\npair of jeans as well. With some of his hair over his forehead, he looked like a young boy who was less\nfierce than usual."
      },
      {
        "paragraph": "Catherine was at a loss for words. Was he wearing a matching outfit with her?"
      },
      {
        "paragraph": "If she had another set of clothes, she would have taken off all her clothes straight away."
      }
    ]
  },
  {
    "title": "Chapter 965 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Forget about it. With your poor cooking, I don’t believe that you made all this food.” Catherine snorted."
      },
      {
        "paragraph": "“I really made it myself. A few days ago, I learned how to cook from a chef. Since you were the one who\ncooked for me back then, I’ll be cooking for you from now onward. If you don’t believe it, you can look at\nmy hands… ” Shaun stretched out all his fingers."
      },
      {
        "paragraph": "His originally neat fingers were now scarred. There were also calluses on his palms."
      },
      {
        "paragraph": "“It hurts.” Shaun blinked at her with his dark lashes. Coupled with his strikingly handsome face, any\nwoman would probably sway at this sight of him."
      },
      {
        "paragraph": "However, Catherine did not sway at all. “As a man, you’re grumbling about a little pain. Have you no\nshame? Wesley wouldn’t do this.”"
      },
      {
        "paragraph": "Shaun was speechless."
      },
      {
        "paragraph": "His good mood was completely ruined after he heard the word ‘Wesley’."
      },
      {
        "paragraph": "Catherine immediately started eating the breakfast without bothering to look at his stiff expression."
      },
      {
        "paragraph": "Despite harboring a grudge against him, she would not torture her stomach. If she got a stomach illness\nas a result of hunger, she would not be able to enjoy delicious food anymore."
      },
      {
        "paragraph": "“Does it taste good?” Shaun immediately asked with a look of anticipation."
      },
      {
        "paragraph": "Catherine nonchalantly glanced sideways at him. “ It’s just average. It’s not as good as Wesley’s\ncooking.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun’s face darkened, and he warned severely, “I don’t want to hear the word ‘Wesley’ coming out from\nyour mouth again.”"
      },
      {
        "paragraph": "“What if I say it?” Catherine sneered at him. “Why? You want to hurt me again, huh? Sure enough, your\npromises are a bunch of bullsh*t.”"
      },
      {
        "paragraph": "Shaun gnashed his teeth. She was taking advantage of his weakness and going overboard."
      },
      {
        "paragraph": "“I won’t hurt you.” His sharp eagle-like eyes settled on her mouth. “But if you keep mentioning Wesley, I\nhave no choice but to lock your lips.”"
      },
      {
        "paragraph": "As soon as he was done speaking, he suddenly leaned his body over and kissed her on the lips when\nshe was still deep in thought."
      },
      {
        "paragraph": "As she had just finished drinking the oat milk, a faint scent of milk and sweetness still lingered on her\nlips."
      },
      {
        "paragraph": "Initially, he just wanted to make her shut her mouth, but he could not resist kissing her after that."
      },
      {
        "paragraph": "Annoyed, Catherine tried to push him away violently, but he did not move one bit."
      },
      {
        "paragraph": "In a fit of fury, she grabbed the fork on the table and stabbed him in the back."
      },
      {
        "paragraph": "She felt his body shudder for a moment. Subsequently, she was met with an even more passionate kiss."
      },
      {
        "paragraph": "The kiss lasted until she nearly suffocated."
      },
      {
        "paragraph": "“Let’s see if you dare mention that man again.” Shaun rose to his feet and fixed his grim gaze on her\nswollen mouth."
      },
      {
        "paragraph": "Catherine wiped her mouth hard before she glared a t him. Nevertheless, she did not dare say anything\nelse for fear that he would kiss her again."
      },
      {
        "paragraph": "“You can eat first.” With that, he turned around."
      },
      {
        "paragraph": "Only then did Catherine notice a pool of blood on the back of Shaun’s white T-shirt near his shoulder."
      },
      {
        "paragraph": "She lowered her head and glanced at the fork in her hand. The fork was stained with a lot of blood."
      },
      {
        "paragraph": "She gasped."
      },
      {
        "paragraph": "What a lunatic he was! Although she had stabbed his body, he could continue kissing her for so long. Did\nthe pain not matter to him?"
      },
      {
        "paragraph": "Shaun took off his T-shirt upstairs. When he turned around and looked into the mirror, he noticed four\nholes on the back of his shoulder where blood was oozing."
      }
    ]
  },
  {
    "title": "Chapter 966 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "The butler’s expression changed when he came in with a first aid kit. “Eldest Young Master Hill, you’re\nvery badly injured. You must get a professional doctor to treat you.”"
      },
      {
        "paragraph": "“ It’s fine. Just get me some gauze and I’ll bandage my wound myself.”"
      },
      {
        "paragraph": "Shaun spoke deeply and indifferently."
      },
      {
        "paragraph": "After his wound was bandaged, he went downstairs only to find that Catherine was not there anymore.\nAfter he asked a servant, he learned that she had gone to the study."
      },
      {
        "paragraph": "He headed to the study and found that she was trying to switch on the computer."
      },
      {
        "paragraph": "The moment Catherine heard his footsteps, she glared at him vigilantly."
      },
      {
        "paragraph": "“Don’t bother switching it on. I’ve had all the network cables unplugged. ” Shaun calmly walked over to\nher. “You don’t need to borrow the servants ‘ phones either. They’re not even Australians. The language\nbarrier is one thing, but their phones can only be used to contact people from their own country.”"
      },
      {
        "paragraph": "“Where the hell is this?” Catherine sank into despair upon hearing him. “ Shaun, if you have the guts, you\ncan lock me up forever. You took me away in public, so it’s considered kidnapping. My dad can definitely\nreport it to the police and have them arrest you.”"
      },
      {
        "paragraph": "“ I’ve talked to your dad. I told him he should not call the police if he’s concerned about your safety. ”"
      },
      {
        "paragraph": "Shaun caressed her face affectionately. Those who were unaware of the situation would think that they\nwere a loving couple. “After all, I’m mentally ill. If I get desperate, I could do anything crazy.”"
      },
      {
        "paragraph": "With the most gentle tone, he told Catherine about how he had threatened her father. She shuddered\nand smacked his hand away."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun then smiled and said, “Of course, I can’t possibly stop him from seeing you forever. After all, your\ndad might still do something about it. I told him that I’ll allow you to return one month later to make him\nfeel better. I just want to spend some time with you in our little world and make you fall for me again.”"
      },
      {
        "paragraph": "“I won’t fall for someone who kidnapped me."
      },
      {
        "paragraph": "Dream on!” Catherine bellowed furiously, “I’m going to make sure we split for good once I leave this\nplace.”"
      },
      {
        "paragraph": "“Are you sure you can make a clean break from me?” Shaun bit his lip thoughtfully."
      },
      {
        "paragraph": "Catherine found it strange at first, yet she grasped the meaning in no time and shuddered."
      },
      {
        "paragraph": "Why would he want to make her stay here with him for a month? If they slept together for this one month,\nshe might get pregnant with his baby."
      },
      {
        "paragraph": "“Shaun Hill, you’re really despicable ! I’d rather die than get pregnant with your child,” she hysterically\nyelled at him."
      },
      {
        "paragraph": "“Cathy, you were once pregnant with my children, which means that our bodies are still fine. If I\naccompany you every night for this one month, it’s likely that you’ll get pregnant.”"
      },
      {
        "paragraph": "As Shaun talked about it, the blood inside him began to boil."
      },
      {
        "paragraph": "Their children did not manage to survive back then, but this time, he would make sure they would be\nsafely delivered. “Suzie’s very cute, right? We can certainly give birth to a child as cute as Suzie.”"
      },
      {
        "paragraph": "“I can’t be bothered to entertain you.”"
      },
      {
        "paragraph": "Catherine was almost going insane because of him. “Stop dreaming! Even if I get pregnant with your\nchild, I’ll abort it.”"
      },
      {
        "paragraph": "“If you insist on having an abortion, I’ll have no choice but to keep you here until you give birth to our\nchild.”"
      },
      {
        "paragraph": "Shaun gazed at her indifferently. “Believe me, I can afford to do this. Soon, Hill Corporation is going to\ninvent a type of microchip that’ll bring upon a change in the global market this time. Not only will Hill\nCorporation continue to be the most excellent company in Australia, but I’ll also be one of the top five\nentrepreneurs in the world. No one in this world can get in my way.”"
      },
      {
        "paragraph": "Catherine was astounded."
      },
      {
        "paragraph": "Never had she thought that the development of Hill Corporation would reach this extent."
      },
      {
        "paragraph": "If what Shaun said was true, even the prime minister would not be able to do anything to him."
      },
      {
        "paragraph": "“As long as you give birth to our child, regardless whether it’s a daughter or a son, all my assets will\nbelong to them.” Shaun cupped her face softly. “ Cathy, I was preoccupied with my career development\nbefore this to make Hill Corporation soar high. But ever since I fell for you, I realized that it’s completely\npointless to make so much money. I just want to be with you. Let’s enjoy some quality time together here\nduring this period.”"
      },
      {
        "paragraph": "He gently kissed her on the lips. Catherine looked dazed."
      },
      {
        "paragraph": "She had underestimated Shaun. She regretted returning to Australia and offending Shaun."
      },
      {
        "paragraph": "Back then, she had focused her mind on taking revenge on Sarah. However, she overlooked how crazy\nthis man could be."
      },
      {
        "paragraph": "“This island is beautiful. Let me take you out for a walk.” Shaun hugged her stiff body while walking out."
      }
    ]
  },
  {
    "title": "Chapter 967 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "When Shaun almost reached the gate, the butler approached him with a pill and a glass of water."
      },
      {
        "paragraph": "“Take it.” Shaun passed the pill to Catherine."
      },
      {
        "paragraph": "“What’s this?” Catherine shuddered deep down. She did not dare take it."
      },
      {
        "paragraph": "“A contraceptive pill, ” Shaun explained with darkened eyes, “I slept with you last night, but you were in\nMelbourne a few nights before, so you might have done it with Wesley. I must make sure that you won’t\nget pregnant with Wesley’s child.”"
      },
      {
        "paragraph": "Catherine did not know what to say. She had not done anything with Wesley, but this pill might at least\nprevent her from getting pregnant after doing i t last night."
      },
      {
        "paragraph": "As such, she took the pill without hesitation."
      },
      {
        "paragraph": "After swallowing it, she was plunged into deep thought."
      },
      {
        "paragraph": "Considering that she would most likely get pregnant in the next few days, she had to think of a way to\navoid it."
      },
      {
        "paragraph": "After Catherine took a shower at night, she slashed herself across the back leg with a sharp object."
      },
      {
        "paragraph": "Then, she stained her panties with blood."
      },
      {
        "paragraph": "As soon as she finished doing this, she said to Shaun, “Do you have sanitary pads? I’m having my\nperiod.”"
      },
      {
        "paragraph": "“What a coincidence.” Shaun raised his brows. Clearly, he did not believe her at all. “You’re trying to find\nan excuse to avoid getting pregnant, huh?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“I’m not lying. If you don’t believe it, you can check yourself.”"
      },
      {
        "paragraph": "Once Catherine finished her sentence, Shaun pushed her onto the bed."
      },
      {
        "paragraph": "Shaun checked and realized that she was actually bleeding."
      },
      {
        "paragraph": "He frowned grimly, but his frown soon faded."
      },
      {
        "paragraph": "Since he planned to keep her here for a month, she would still have her period anyway. When she got it\nwould not make a difference."
      },
      {
        "paragraph": "“I’ll ask a servant to get you some pads.” Shortly after, the servant passed her the pads."
      },
      {
        "paragraph": "After Catherine put on a sanitary pad, Shaun carried her to the bed."
      },
      {
        "paragraph": "She was wrapped in his arms the whole night."
      },
      {
        "paragraph": "The next day, she woke up to his kiss, which became an everyday routine."
      },
      {
        "paragraph": "Catherine still had to be very cautious. Every day, she squeezed blood out of her wound and stained the\npad with the blood. She was worried that the servant who took out the trash would notice something\nunusual."
      },
      {
        "paragraph": "On the seventh day."
      },
      {
        "paragraph": "Shaun took a bikini and walked to Catherine. “Babe, your period is over now. I’m taking you to the\nseaside to go swimming today.”"
      },
      {
        "paragraph": "Catherine looked at the pink bikini, which was pretty and sexy."
      },
      {
        "paragraph": "If she wore it, Shaun would definitely notice the wound on her back leg. She had a feeling that Shaun\nwould certainly sleep with her tonight. As such, she had to quickly conceal the wound or he would"
      },
      {
        "paragraph": "suspect her."
      },
      {
        "paragraph": "“No, I don’t like swimming.” She looked away. “Go"
      },
      {
        "paragraph": "ahead if you want to but I’m not joining.”"
      },
      {
        "paragraph": "“ If you’re not swimming, what’s the point of me swimming alone? ” Shaun hugged her and placed her on\nhis thighs."
      },
      {
        "paragraph": "Catherine did not resist him. After all, no matter how hard she tried resisting him during this period, she\nwas not as strong as him. As time passed, she could not be bothered to waste her energy anymore."
      },
      {
        "paragraph": "“Fine, then. I’ll stroll along the seaside with you.” He comforted her gently. Struck by an idea, Catherine\nnodded a moment later. “Okay, but I want to go upstairs and change into a long dress.”"
      }
    ]
  },
  {
    "title": "Chapter 968 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "After hearing this, Shaun’s handsome face became gentle."
      },
      {
        "paragraph": "Throughout the past week, Catherine always looked indifferent and resentful no matter how hard he tried\nto please her."
      },
      {
        "paragraph": "Now, she was willing to change into a dress and stroll along the seaside with him. Did this mean that she\nhad slowly come to terms with reality?"
      },
      {
        "paragraph": "“Go ahead.”"
      },
      {
        "paragraph": "After exhorting her lightly, he suddenly regretted bringing too few dresses for her."
      },
      {
        "paragraph": "He called Hadley at once. “Choose a few more dresses and send them over here. I want those that are\nsuitable to be worn at the beach and in my wife’s size.”"
      },
      {
        "paragraph": "The corners of Hadley’s mouth twitched. ‘Your wife?"
      },
      {
        "paragraph": "‘Have you no shame?"
      },
      {
        "paragraph": "‘She’s actually Wesley’s wife.’"
      },
      {
        "paragraph": "“Eldest Young Master Hill, please return to the office if you’re available.” Hadley added helplessly,\n“Recently, Hill Corporation has been receiving a lot of flak. Old Master Hill and Old Madam Hill are so\npissed that they’re close to falling sick. The Hills and the company’s shareholders come to the office\nevery day to look for me. The public has been attacking us, and the share prices of Hill Corporation keep\ndeclining.”"
      },
      {
        "paragraph": "“Isn’t it normal for share prices to rise and decline?” Shaun responded in a light-hearted manner, “Ask\nChester to release news regarding some celebrities’ moral degeneracy. Everyone will slowly forget about"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "this incident.”"
      },
      {
        "paragraph": "Hadley was speechless. ‘Aren’t you putting Young Master Jewell in a difficult position by doing this? In\nterms of moral degeneracy, nobody can beat you.’"
      },
      {
        "paragraph": "“As for Old Master Hill and Old Madam Hill, if they ask about me, just tell them that I’m helping the Hill\nfamily produce grandchildren. Ask them not to worry about me. Those shareholders won’t be bothered\nabout it as long as they have enough money to spend. I’m the decision-maker of Hill Corporation.\nAnyone who’s not happy about the decision I made can get lost.”"
      },
      {
        "paragraph": "As soon as Shaun finished speaking, he hung up the phone."
      },
      {
        "paragraph": "He raised his head only to see Catherine walking down the stairs in a long red dress with a polka dot\npattern on it. Despite not wearing any makeup, she looked like a seductive vixen with her pretty face and\nsnowy skin."
      },
      {
        "paragraph": "Shaun went forward. Then, he locked his arms around her waist and hugged her. With a hoarse voice,\nhe said, “You look beautiful.”"
      },
      {
        "paragraph": "Catherine could immediately sense the change in him. As his body grew tense, she seriously wondered\nif this man had actually evolved from a wild animal. Why did such a change in him occur when she had\nmerely changed into a dress?"
      },
      {
        "paragraph": "“It seems like you’ll never get tanned no matter how you expose yourself to the sun.” Shaun caressed\nher shoulders. They seldom went out over the last few days, but the blazing sun at the seaside had\ntanned his skin. However, she was still as fair as before."
      },
      {
        "paragraph": "Catherine looked down and ignored him."
      },
      {
        "paragraph": "Shaun did not mind. He walked out of the manor with his hands wrapped around her waist."
      },
      {
        "paragraph": "The beach here was very clean. Catherine lifted her head and looked into the distance. If Shaun had not"
      },
      {
        "paragraph": "captured her here, she would think that this place was a wonderful tourist attraction."
      },
      {
        "paragraph": "“I’m tired.”"
      },
      {
        "paragraph": "After walking for a while, she sat under a coconut tree on the beach. “I’m thirsty. I want to drink some\ncoconut water.”"
      },
      {
        "paragraph": "“Alright.”"
      },
      {
        "paragraph": "Shaun was very pleased that she was making a request of her own accord. “Wait for me here. I’m going\nto fetch it for you.”"
      },
      {
        "paragraph": "He was not at all worried that Catherine would flee, given the vast sea and absence of boats here. Not\neven a single stranger could be found on this island."
      },
      {
        "paragraph": "After Catherine noticed that he had left, she rose to her feet and climbed onto the reef near the sea."
      },
      {
        "paragraph": "She deliberately hurt herself where her existing wound was on the reef. When she saw Shaun coming,\nshe pretended to slip from the reef and fell into the sea."
      },
      {
        "paragraph": "“Cathy…” Shaun happened to catch sight of this scene. He was so shocked that he jumped into the sea\nwithout hesitation. He swam toward her and swiftly lifted her from the sea. “Are you okay?”"
      },
      {
        "paragraph": "“I’m okay… ” After Catherine finished her sentence with a frown, a slashing sound was heard."
      },
      {
        "paragraph": "Shaun hurriedly carried her to the shore and checked her wound. He realized that the back of her leg\nhad been grazed. Seemingly, there was a part of her skin that was slashed by a sharp rock and resulted\nin a deep wound."
      },
      {
        "paragraph": "“Let me bring you back and bandage it.”"
      }
    ]
  },
  {
    "title": "Chapter 969 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun carried Catherine and ran into the manor without a second thought."
      },
      {
        "paragraph": "The butler soon brought the doctor over. Considering her deep wound, Catherine needed to get a shot to\nreduce inflammation."
      },
      {
        "paragraph": "Catherine kept enduring the pain. The pain was nothing as long as Shaun did not find out about it."
      },
      {
        "paragraph": "On the other hand, Shaun was heartbroken and blamed himself. “When you go to the seaside next time,\nI’ll make sure to be with you at all times so that you won’t do anything dangerous again.”"
      },
      {
        "paragraph": "Catherine did not utter a word. She had been living a life as if she was in jail these days. Whether he\nkept an eye on her or not, it did not matter."
      },
      {
        "paragraph": "At night, Catherine curled up on the balcony couch and spaced out."
      },
      {
        "paragraph": "She was bored to death. Here, she could not play with her phone, watch television, or shop around. She\ndid not know anyone else here either. Apart from occasionally reading, she could only stare into space\nevery day."
      },
      {
        "paragraph": "“Are you bored?” Shaun came out of the bathroom. His heart ached at the sight of her glum look."
      },
      {
        "paragraph": "“Sleep with me since you’re bored.”"
      },
      {
        "paragraph": "As soon as he finished his sentence, he carried her to the master bedroom and placed her on the bed.\nHe then extended his hands to take off her pajamas."
      },
      {
        "paragraph": "Aware of his intention, Catherine naturally resisted him. “Shaun, my leg is injured and it hurts. Can’t you\nleave me alone?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun’s eyes flashed with guilt, and he said reluctantly, “I’ve asked the doctor. He said that women are\nmost likely to get pregnant in the next few days after their period is over. I can’t miss any of these days.\nAnyway, don’ t worry, I won’t touch your wound.”"
      },
      {
        "paragraph": "With that, he locked his lips with hers in an overbearing yet gentle manner."
      },
      {
        "paragraph": "Catherine was too weak to overpower him even before she was injured. Now that she was injured, there\nwas nothing she could do to stop him."
      },
      {
        "paragraph": "She knew that this man was dead set on doing it. Although those few days when she would most"
      },
      {
        "paragraph": "likely get pregnant were over, it did not mean that she was completely safe."
      },
      {
        "paragraph": "The minute she imagined herself becoming pregnant with his child, she was consumed with fear."
      },
      {
        "paragraph": "“Shaunny, please don’t treat me this way.”"
      },
      {
        "paragraph": "She suddenly begged him while clutching his arm."
      },
      {
        "paragraph": "Shaun’s body froze. As far as he remembered, she had never addressed him as Shaunny. However, the\nword somehow rang a bell when it came out of her mouth. It just seemed to be a matter of course when\nshe addressed him this way."
      },
      {
        "paragraph": "“Cathy, you can blame and hate me all you want now. I don’t mind. I just want to get you pregnant with\nmy child.” He repeatedly kissed her lips dejectedly but determinedly at the same time. “I swear that I’ll\ntreat you and the baby well in the future.”"
      },
      {
        "paragraph": "‘Sorry, Cathy. I just don’t know how to keep you by"
      },
      {
        "paragraph": "my side."
      },
      {
        "paragraph": "‘I admit that I’m despicable, but I’ll go insane if I lose you.’"
      },
      {
        "paragraph": "Canberra."
      },
      {
        "paragraph": "Liam walked into a uniquely designed coffee house."
      },
      {
        "paragraph": "“Second Young Master, your father is waiting for you upstairs.” The server took him to the third floor."
      },
      {
        "paragraph": "When Liam pushed the door open, he noticed that besides Mason, Charlie and his second uncle,\nMaurice Campos, were also here."
      },
      {
        "paragraph": "“Dad, I thought you only called me over here. It turns out that Second Uncle and Charlie are here too. ”\nLiam found it strange. Even so, he still got a chair and sat down on it. “Dad, why did you ask me to come\nhere? What’s the matter?”"
      },
      {
        "paragraph": "Mason seemed to turn a deaf ear to his question and focused on pouring the coffee."
      },
      {
        "paragraph": "After Maurice and Charlie exchanged glances, Maurice asked with a smile, “Do you know what\nhappened to Shaun?”"
      },
      {
        "paragraph": "“ I don’t. He hasn’t contacted us.” Liam frowned. “ Second Uncle, just cut to the chase.”"
      }
    ]
  },
  {
    "title": "Chapter 970 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "A meaningful smile crossed Maurice’s face. “I heard Team Clifton is close to succeeding in developing\nPurdue Microchip.”"
      },
      {
        "paragraph": "Liam’s eyes narrowed and he sighed deeply. ‘Sure enough…’"
      },
      {
        "paragraph": "Charlie had brought up this matter to Liam a few times, but Liam did not expect that Maurice would show\nup in person this time. Even Mason…"
      },
      {
        "paragraph": "Liam’s gaze revealed mixed feelings. He used to think that Mason was an elegant person who merely\ndevoted his attention to art without being concerned about what was going on in the outside world. He\nused to believe that Mason exposed Shaun’s mental illness three years ago merely for the sake of the\nCampos family."
      },
      {
        "paragraph": "By the look of things now, however, Liam felt that his father was far from simple."
      },
      {
        "paragraph": "“ Second Uncle, I’ve told Charlie before that Shaun doesn’t allow me to be involved in the matters\nregarding the laboratory, ” Liam explained in a low voice."
      },
      {
        "paragraph": "“That was before,” Charlie said with a smile, “Now, it’s different since Shaun isn’t in Australia. Once the\nproduct is developed, all kinds of advertisements need to be underway. As the general manager of Hill\nCorporation, you’re to approve the formalities. As such, you can easily obtain information about the\nmicrochip.”"
      },
      {
        "paragraph": "Liam took the coffee cup. He lowered his head and lightly sipped on it. His actions hid the glint in his\neyes."
      },
      {
        "paragraph": "To be frank, he was very disappointed in the Campos family."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Overlooking the fact that the Campos family had been treating him as an outsider these days, they were\nbeing too greedy. As the second most influential family in Australia, the Camposes had been trying to\nfind a way to steal the product that someone else had spent a great deal of money and effort on rather\nthan improve their company’s products with their own abilities. How shameful their behavior was!"
      },
      {
        "paragraph": "Of course, Liam admitted that he was not a noble person either. In the past, he had used underhand\nmeans to secure his position in Hill Corporation. Even so, he had his limits."
      },
      {
        "paragraph": "After realizing that Liam was not uttering a word, Maurice said softly, “Liam, your last name might be Hill,\nbut your dad’s last name is Campos. You’re a member of the Campos family. It’s just a matter of the last\nname. After all, the Hills are considered outsiders. Think about how the Hill family has been treating you\nthese years. Shaun got everything even though you’re Lea’s son as well. 1"
      },
      {
        "paragraph": "“You might be the general manager of Hill Corporation, but you’re merely in charge of the section in the\ncompany that doesn’t pay you well. Are you content with this? Are you planning to continue living in a\ndaze? Here’s the chance for you to make it big.”"
      },
      {
        "paragraph": "“Dad…” Liam shifted his gaze to Mason in spite of himself."
      },
      {
        "paragraph": "He did not believe Maurice’s words no matter how glib the man was. After all, the Camposes often\noffered false hopes."
      },
      {
        "paragraph": "Mason leaned back a little, his eyes darkening.“ Liam, there’s one thing that I’ve been keeping you in the\ndark about. I have 6o percent of the shares in Campos Corporation.”"
      },
      {
        "paragraph": "Liam was taken aback. Never had he thought that his father would hide this fact so well."
      },
      {
        "paragraph": "6o percent of the shares was equivalent to a considerable amount of wealth. However, the public was\nunaware of it."
      },
      {
        "paragraph": "Hismother wasprobably ignorantof it too."
      },
      {
        "paragraph": "As Liam was thinking it through, he found his father to be quite scary."
      },
      {
        "paragraph": "Meanwhile, Charlie topped up Liam’s coffee. “In fact, I decided to restrain myself in front of the public\npreviously to avoid the Hill family from learning about this. Think about it. You’re Eldest Uncle’s only son.\nWho else will take over the shares of Campos Corporation except you? Campos Corporation will be ours\nsooner or later.”"
      },
      {
        "paragraph": "Liam was totally perplexed. He did not say anything for a while."
      },
      {
        "paragraph": "Indeed, if Mason owned 6o percent of the shares, those shares would go to Liam since he was Mason’s\nson."
      },
      {
        "paragraph": "If the Campos family became the most influential family in the future, Liam would be able to destroy\nShaun."
      },
      {
        "paragraph": "Mason gave him a profound gaze and said gently, “ Liam, I know you’re very surprised. But as the eldest\nson of the Campos family, I just have to bear"
      },
      {
        "paragraph": "with certain things. If I don’t do so, the Camposes wouldn’t be who they are today. As a man, don’t you\nwant to build a successful career? No matter how great your mom is, Hill Corporation is still considered\nher own venture. I can never have a hand in it. What’s more, the Hills have looked down on me from the\nvery beginning. Every time I see you being oppressed by Shaun, I feel upset as your dad. Well, I’m\nexperiencing the same situation as well. Once you’ve weathered the storm, I’ll give you everything I\nhave.” 1 Liam jerked. After some time, he answered with mixed feelings, “Let me think about it, Dad.”"
      }
    ]
  },
  {
    "title": "Chapter 971 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“There’s nothing to think about—” Charlie leaped to his feet in a huff."
      },
      {
        "paragraph": "“Charlie, give him some time, ” Mason interrupted him with an admonishing voice. “Think carefully, Liam.\nOnce Hill Corporation’s microchip successfully launches into the market, Hill Corporation will become the\nmost powerful enterprise in the world. Shaun is going to receive all the glory, while you’ll still be a poor\ngeneral manager. You don’t even own any shares in Hill Corporation and you have to rely on your mom\nto give you the shares in the future."
      },
      {
        "paragraph": "“What’s more, your mom and Shaun’s relationship seem to have improved a lot these days, ” Maurice\nadded grimly, “I wonder how many shares Lea will pass to you by then? But your dad is different."
      },
      {
        "paragraph": "You’re his only son.”"
      },
      {
        "paragraph": "Liam’s eyes flashed with a complicated feeling. For a long time, he remained silent."
      },
      {
        "paragraph": "Mason glanced at him and laughed. “I’m waiting to hear good news from you.”"
      },
      {
        "paragraph": "As soon as Mason finished his sentence, he was ready to leave."
      },
      {
        "paragraph": "“Dad… ” Liam suddenly turned around and asked, “ Aren’t you afraid that… Mom will be upset after she\nfinds out?”"
      },
      {
        "paragraph": "Lea had sacrificed so much for Mason, yet Mason’s ultimate goal was to destroy Hill Corporation. How\ndepressed Lea would feel if she learned about this?\nA startled look crossed Mason’s face. “Liam, I’ll make it up to your mom after that. Sometimes, you’re\nonly given one chance on your path to success. Moreover, your mom wouldn’t be who she i s today\nwithout the Hill family’s support. Even when she depends on a husband like me and a son like you in the\nfuture, her noble status will remain.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Liam, if I were you, I wouldn’t hesitate at all. Remember that every son takes their father’s last name, so\nCampos should be your last name, ” Charlie reminded Liam sternly."
      },
      {
        "paragraph": "Liam furrowed his brows deeply as he felt torn."
      },
      {
        "paragraph": "He did not even notice that Charlie and the rest had left."
      },
      {
        "paragraph": "Mason, Maurice, and Charlie got into a black car after they reached downstairs."
      },
      {
        "paragraph": "Charlie asked, “Eldest Uncle, do you think Liam will help us?”"
      },
      {
        "paragraph": "“It doesn’t matter.” Mason’s gentle expression from when he was upstairs disappeared. He lit a cigarette\nwhile looking impassive."
      },
      {
        "paragraph": "Maurice chuckled. “Brother, you’re really heartless toward your biological son.”"
      },
      {
        "paragraph": "Narrowing his eyes, Mason continued to light the cigarette."
      },
      {
        "paragraph": "Heartless?"
      },
      {
        "paragraph": "Ha! He could be heartless because Liam was not his son."
      },
      {
        "paragraph": "Liam was Lea and Brennan’s son."
      },
      {
        "paragraph": "That night, Lea was drunk and had slept with Brennan instead of Mason. However, Mason came after\nBrennan left."
      },
      {
        "paragraph": "Lea happened to be pregnant at that time, so Mason only followed along and married her."
      },
      {
        "paragraph": "Throughout the years, he had been putting up with Lea and Liam, these fools."
      },
      {
        "paragraph": "As for Liam and Shaun, Mason could not wait to see these two biological brothers fighting with each\nother."
      },
      {
        "paragraph": "They would never discover the truth! Although Mason owned 6o percent of the shares in Campos\nCorporation, he would never give them to Liam."
      }
    ]
  },
  {
    "title": "Chapter 972 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Liam stayed upstairs for a long time."
      },
      {
        "paragraph": "Indeed, Mason’s words had come as a huge blow to him."
      },
      {
        "paragraph": "He was wavering, but Lea would be very depressed i f he helped Mason. Even his grandparents would\nbe disappointed in him."
      },
      {
        "paragraph": "He often found them treating him unfairly and was dissatisfied with it, but sometimes, he had to admit\nthat Shaun was more capable than him."
      },
      {
        "paragraph": "Having said that, he did not wish to play second fiddle to Shaun forever."
      },
      {
        "paragraph": "In Shaun’s eyes, Liam was just someone whom he could banish anytime."
      },
      {
        "paragraph": "Amid his agonizing dilemma, Suzie suddenly gave him a call."
      },
      {
        "paragraph": "“Daddy, why haven’t you come to pick me up? Many kids have already left.”"
      },
      {
        "paragraph": "He abruptly came to his senses, only to find that it was nearly 5:00 p.m. “Okay, I’ll be there in a moment.”"
      },
      {
        "paragraph": "On his way there, he received a call from Old Madam Campos."
      },
      {
        "paragraph": "By the time he arrived at the preschool, it was already 5:30 p.m. With a pout, Suzie got into his car."
      },
      {
        "paragraph": "“Uncle Liam, Mommy still hasn’t contacted me. Where did my scummy dad bring her? Am I not going to\nsee Mommy anymore? I miss her so badly.” The little kid was about to tear up as she spoke."
      },
      {
        "paragraph": "“No. Shaun must’ve taken your mom away to live i n their own little world.” Liam could not help but think\nit over and continue, “Perhaps your mom will come back with a baby brother or sister for you.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“That’s unlikely.” Suzie was shocked to hear that. “ My mommy has already married Uncle Wesley. If\nshe’s pregnant with my scummy dad’s children… I don’t think it’ll be good.”"
      },
      {
        "paragraph": "Liam coughed lightly. Of course, that would not be a good thing. However, it was possible for Shaun to\ndo such a thing considering his mental illness."
      },
      {
        "paragraph": "“Anyhow, don’t worry. Shaun loves your mommy, so he won’t hurt her.”"
      },
      {
        "paragraph": "Only then did Suzie feel at ease. “Uncle Liam, where"
      },
      {
        "paragraph": "are we going? This doesn’t seem like the way back to the manor.”"
      },
      {
        "paragraph": "“We’re going to have dinner in the Campos family’s house, ” Liam explained, “Your great-grandma called\nme and told me that she wants us to have dinner there.”"
      },
      {
        "paragraph": "“Ah, I don’t want to!” Suzie immediately shook her head. “I don’t want to go there. Please send me back\nto the manor first.”"
      },
      {
        "paragraph": "“Suzie, you’ll be fine. All of them think that you’re my daughter. Also, your great-grandpa and great-\ngrandma are there.” Liam reassured her in a soft tone."
      },
      {
        "paragraph": "“No.” Suzie pouted. “They don’t like me. Every time I go there, they ignore me. Last time, it was Jill who\npushed me first, but Great-grandma told me off and didn’t scold Jill at all. She even said that the"
      },
      {
        "paragraph": "Hill family didn’t teach me well and called me ill- bred.”"
      },
      {
        "paragraph": "Liam found it unbelievable. Jill was the daughter of Mason’s cousin, and she always played around in the\nCampos family’s house."
      },
      {
        "paragraph": "Suzie supposedly shared closer ties to the Campos family. Nevertheless, why did Old Madam Campos\nfavor her relative’s granddaughter instead? She"
      },
      {
        "paragraph": "went too far with those remarks."
      },
      {
        "paragraph": "“Suzie, could there be a misunderstanding?”"
      },
      {
        "paragraph": "“There isn’t any misunderstanding. I even overheard Jill asking the other kids in the Campos family not to\nplay with me. They like to play with Benny. They even said that I’m annoying.”"
      },
      {
        "paragraph": "Suzie said angrily, “They thought I didn’t hear it, but I have good hearing. I heard it all.”"
      },
      {
        "paragraph": "“Who’s Benny?”"
      },
      {
        "paragraph": "Suzie’s words bewildered Liam further. There were a lot of relatives, servants, and children in the\nCampos family. However, he had never heard of anyone named Benny."
      },
      {
        "paragraph": "“I don’t know. I’ve never seen him.” Suzie shook her head. “Also, whenever I go to the Campos family’s\nhouse, Great-grandma won’t allow me to touch the things there. I can feel that they don’t like me.”"
      },
      {
        "paragraph": "As Liam listened to what Suzie said, he felt increasingly upset."
      },
      {
        "paragraph": "He was not upset with Suzie but with the Camposes."
      },
      {
        "paragraph": "Although Suzie was not his biological daughter, she was his niece, after all. He was fond of her because\nshe was clever and cute. Upon knowing that his grandmother treated Suzie this way, he was\noverwhelmed with disappointment."
      },
      {
        "paragraph": "At the same time, Suzie’s words seemed like a bucket of cold water that was poured over him."
      }
    ]
  },
  {
    "title": "Chapter 973 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "It was weird. Throughout these years, the treatment the Campos family gave Liam was not as good\ncompared to how they treated their other nephews. They were treating Suzie the same way as well."
      },
      {
        "paragraph": "Although Mason said 6o percent of the shares of Campos Corporation would be his sooner or later, it\nwas obvious through the attitude of the Campos family toward him and Suzie that they did not like him\nvery much."
      },
      {
        "paragraph": "Could it be…"
      },
      {
        "paragraph": "Did Mason simply say those words to deceive him?"
      },
      {
        "paragraph": "When he carefully thought about it, Mason had not cared about him at all in all these years. He was\nindifferent toward his granddaughter, Suzie, as well."
      },
      {
        "paragraph": "Would Mason really give the shares to him?"
      },
      {
        "paragraph": "Liam started to have deep suspicions, especially because Mason seemed to be very good at hiding\nthings. Who knew if he would have other women outside of the family in the future or an illegitimate son?"
      },
      {
        "paragraph": "Illegitimate son?"
      },
      {
        "paragraph": "By the way, who exactly was Benny? Liam had never heard of him before."
      },
      {
        "paragraph": "The more he thought about it, the colder his heart grew."
      },
      {
        "paragraph": "“Suzie, can you do me a favor?” Liam said in a low voice, “You’re so clever, so when you go to the\nCampos family later, help me find out who Benny is through Jill. I’ll treat you to chocolates tonight.”"
      },
      {
        "paragraph": "“Fine, I’ll do it for the sake of chocolates. ” Suzie nodded reluctantly."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“But don’t let the adults notice you, ” Liam reminded her."
      },
      {
        "paragraph": "“Okay, I know. It’s a small matter. With Jill’s low IQ she can’t even compare to me at all.” Suzie had a\nhaughty expression."
      },
      {
        "paragraph": "When they arrived at the Campos family, Liam went to chat with his grandfather and grandmother while\nSuzie went to play with Jill."
      },
      {
        "paragraph": "Although Jill was the granddaughter of Old Master Campos’ younger sister, the two houses’ courtyards\nwere connected."
      },
      {
        "paragraph": "When Suzie went over to find Jill, Jill was irritated upon seeing her."
      },
      {
        "paragraph": "“Why did you come again? I said I don’t like you and I don’t want to play with you.”"
      },
      {
        "paragraph": "Suzie quickly looked around. She saw there were no adults around, so she whispered, “But I’m so bored.\nCan you play with me for a little while? Sister Jill, are you the one who’s solving this jigsaw puzzle?\nYou’re amazing!”"
      },
      {
        "paragraph": "Jill was only four years old, after all. She was smug after getting complimented by Suzie. “Of course. ”"
      },
      {
        "paragraph": "“Sister Jill, why are you here alone today? Where’s that… Benny?’ Suzie pretended to ask casually."
      },
      {
        "paragraph": "“Brother Benny has to study. He’s in primary school,” Jill said as she continued solving her puzzle\nseriously."
      },
      {
        "paragraph": "“Wow, he’s so great. I’m still in preschool. ” Suzie asked, “But why haven’t I met him before? Does he live\nnearby? Sister Jill, you’re so lucky that you have a brother to play with you. I don’t have one and I’m so\nbored being alone.”"
      },
      {
        "paragraph": "“Brother Benny came over yesterday too. He was the one who taught me how to solve jigsaw"
      },
      {
        "paragraph": "puzzles.” Jill was smug after she heard Suzie’s words. “Mm, that’s right. He just lives near here. ”"
      },
      {
        "paragraph": "“Wow, is he the neighbor’s child?” Suzie acted delighted and asked."
      },
      {
        "paragraph": "“No, he’s Great-uncle’s child…”"
      },
      {
        "paragraph": "Jill covered her mouth all of a sudden after she said that."
      },
      {
        "paragraph": "“What’s wrong?” Suzie pretended to be ignorant and looked at her while blinking her eyes."
      },
      {
        "paragraph": "“It’s all your fault.” Jill glared at Suzie angrily. “My mom said to me that this matter can’t be told to\nanyone.”"
      },
      {
        "paragraph": "“Why can’t it be told to anyone? Is there a problem?” Suzie had a puzzled expression."
      },
      {
        "paragraph": "“I don’t know either.” Jill had a regretful expression on her face. “But my dad and mom told me that\nBrother Benny is a secret.”"
      }
    ]
  },
  {
    "title": "Chapter 974 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Oh, won’t it be fine as long as I don’t say anything about it?” Suzie pretended to be obedient and\ninnocent. “Sister Jill, I’ll listen to you from now on a s long as you’re willing to play with me.”"
      },
      {
        "paragraph": "“Okay, I don’t have any friends now, so I can play with you.” Jill nodded. She thought Suzie was silly and\ncould be her lackey."
      },
      {
        "paragraph": "However, Jill did not know that once Suzie finished her dinner and walked out of the Campos family’s\ndoor, she immediately told Liam all the information she obtained from Jill."
      },
      {
        "paragraph": "“Great-uncle’s child…”"
      },
      {
        "paragraph": "Liam’s expression changed once he heard that."
      },
      {
        "paragraph": "The great-uncle that Jill spoke of could only be Maurice or Mason. Maurice had two children, the elder\none being Charlie and the younger one being Maddie. Maddie was studying overseas now."
      },
      {
        "paragraph": "Therefore, Benny was most probably his father’s or Maurice’s illegitimate son."
      },
      {
        "paragraph": "However, Maurice’s wife was a fierce woman. If her husband had an illegitimate son outside, she would\ndefinitely not tolerate Maurice bringing him back to the Campos family."
      },
      {
        "paragraph": "Benny was most likely Mason’s illegitimate son."
      },
      {
        "paragraph": "Liam’s heart felt cold. No wonder Mason did not care much about him. It was because he had another\nson outside."
      },
      {
        "paragraph": "Mason had even said he was his only son that day and he was almost won over by his words."
      },
      {
        "paragraph": "His father seemed to be even scarier when he thought about it."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Lea had sacrificed so much for Mason. She even took out tens of billions of dollars in funds for Campos\nCorporation three years ago, yet Mason had another woman and an illegitimate son outside."
      },
      {
        "paragraph": "Lea might go crazy from anger if she knew about it."
      },
      {
        "paragraph": "Luckily, Suzie’s words made Liam calm down. If he really leaked Hill Corporation’s microchip, the\nCampos family might become the most powerful family in Australia. However, he would only be Mason’s\nstepping stone."
      },
      {
        "paragraph": "The thing was, how was he supposed to tell Lea about it?"
      },
      {
        "paragraph": "“Suzie, don’t tell anybody about this for now,” Liam reminded her. He was afraid Lea could not take the\nshock."
      },
      {
        "paragraph": "At night, Liam gave Mason a call."
      },
      {
        "paragraph": "“Dad, I can’t do what you asked of me this evening. I think we have to use the proper means to win."
      },
      {
        "paragraph": "Actually, Campos Corporation is already developing well. Why do you have to be so fixated on the\nrankings?”"
      },
      {
        "paragraph": "“Liam, you make me so disappointed.” Mason’s low tone had a trace of heartlessness."
      },
      {
        "paragraph": "“Dad, as people, we have to know the limits.” Despite feeling sad, Liam tried to dissuade him. “ You\nalready have enough. Besides, if it weren’t for Hill Corporation’s support, the Campos family wouldn’t\nhave gotten this far— ”"
      },
      {
        "paragraph": "“Shut your mouth! It’s impossible to be successful if you’re so soft-hearted. No wonder you won’t be able\nto win against Shaun in this lifetime. You can only be like this forever.”"
      },
      {
        "paragraph": "Mason hung up straight away."
      },
      {
        "paragraph": "Liam was filled with bitterness. He had a feeling that Mason would try other methods after failing to use\nhim. He had to keep an eye on the employees of the company."
      },
      {
        "paragraph": "Far away at an island overseas."
      },
      {
        "paragraph": "Catherine was counting the days. Before she knew it, half a month had already passed."
      },
      {
        "paragraph": "Although she did not have to do anything as Shaun was taking good care of her by serving her good\nfood and drinks, she still grew thinner in half a month."
      },
      {
        "paragraph": "It was mainly because her days were too depressing. Another reason was that she was already married,\nyet she was together with Shaun every day. She felt guilty for Wesley."
      },
      {
        "paragraph": "On that day, Shaun brought her out to the sea to fish."
      },
      {
        "paragraph": "“Cathy, look at this codfish I caught. I’ll make deep"
      },
      {
        "paragraph": "-fried codfish for you tonight, okay?” Shaun brought a fat and tender fish over. His face was full of smiles\nas he tried to please her."
      },
      {
        "paragraph": "“Anything will do. I’m not interested.”"
      }
    ]
  },
  {
    "title": "Chapter 975 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine stood up and walked to another side. Her attitude was cold."
      },
      {
        "paragraph": "Shaun sighed as he watched her from behind. At that moment, his phone rang."
      },
      {
        "paragraph": "It was Clifton who called. His voice was trembling with excitement as he said, “Eldest Young Master Hill,\nthe research and development of Purdue Microchip has succeeded.”"
      },
      {
        "paragraph": "“Is it?” Shaun nodded calmly. “You did well.”"
      },
      {
        "paragraph": "Clifton was shocked. “Eldest Young Master Hill, aren’t you excited at all? You’ve invested more than ten\nbillion dollars into this tiny microchip."
      },
      {
        "paragraph": "Moreover, this is the world’s top microchip. No other company can surpass this. I reckon Hill\nCorporation’s market value will triple at the very least.”"
      },
      {
        "paragraph": "“Okay, ” Shaun replied calmly, “You can let out the news that the microchip has been successfully\ndeveloped and hold a press conference half a month later. I’ll attend it when the time comes.”"
      },
      {
        "paragraph": "“When are you coming back?” Clifton said in a hurry, “When the news goes out, it’ll surely attract the top\ncompanies all over the world in other industries to collaborate with us. The company desperately\nrequires your presence. Besides, this is a very important matter. It’s better for you to be personally\ninvolved in everything from the marketing to the collaborations.”"
      },
      {
        "paragraph": "Shaun looked at Catherine who was nearby with complicated feelings. He lowered his voice and said, “I\ndon’t have time now. The company spent so much money to hire those senior managers. It’s time for\nthem to do their jobs.”"
      },
      {
        "paragraph": "“Alright.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Clifton had no choice. His boss was a man in love, after all. “The information related to the microchip"
      },
      {
        "paragraph": "“I’ll have Chance assign some people to protect the laboratory. You should stay at the lab these few\ndays, ” Shaun ordered."
      },
      {
        "paragraph": "After all, this matter could draw the attention of the whole world. There might even be some extreme\ncompetitors who would want to hurt Clifton."
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "After ending the call with Clifton, Shaun gave Chance a call. He did not deliberately hide from Catherine."
      },
      {
        "paragraph": "There were only both of them at the seaside. As he gave Chance orders, his voice traveled to\nCatherine’s ears as well."
      },
      {
        "paragraph": "She felt more shocked as she continued listening."
      },
      {
        "paragraph": "She did not think that Hill Corporation’s advanced microchip would be developed so soon. She did not\nknow how much Hill Corporation’s market value would spike after this microchip was launched. No one in\nAustralia, or even in the whole world, could compete against Shaun then."
      },
      {
        "paragraph": "Her heart was in despair."
      },
      {
        "paragraph": "Could she not escape nor hide from this man forever?"
      },
      {
        "paragraph": "“Cathy, you’re about to become the wife of the wealthiest man in the world. ” Shaun hugged her from\nbehind all of a sudden. His hand rested on her lower abdomen. “Our children will be nobler than princes\nand princesses.”"
      },
      {
        "paragraph": "Catherine glanced at him helplessly. “Do you think I care about all this?”"
      },
      {
        "paragraph": "“Cathy, I just want to tell you that leaving me and"
      },
      {
        "paragraph": "returning to Wesley’s side is an impossible matter. What does Wesley have to compete against me?"
      },
      {
        "paragraph": "Crushing him is as easy as crushing an ant to me.”"
      },
      {
        "paragraph": "Shaun forcefully turned her shoulders around. He lowered his head and bit on her soft lower lip."
      },
      {
        "paragraph": "Catherine had no words."
      },
      {
        "paragraph": "Sometimes, she thought maybe she should just accept her fate. With her capabilities, she really could\nnot escape this man anyway."
      },
      {
        "paragraph": "Nevertheless, she still felt resentful."
      },
      {
        "paragraph": "In the blink of an eye, ten days passed. On the big messy bed in the morning."
      },
      {
        "paragraph": "Shaun woke up first. The woman beside him was still fast asleep. Last night’s activity had made her\nexhausted."
      },
      {
        "paragraph": "He properly tucked her in with the blanket. When he got up, he realized there were bloodstains on his\nleg…"
      }
    ]
  },
  {
    "title": "Chapter 976 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "At first, Shaun thought he got hurt somewhere."
      },
      {
        "paragraph": "However, he panicked when he found no wounds on his leg. If it was not his blood, then it was\nCatherine’s."
      },
      {
        "paragraph": "He lightly lifted the covers. He noticed that the back of her underwear was stained."
      },
      {
        "paragraph": "Although he had not experienced menstruation before, he knew that Catherine was definitely on her\nperiod."
      },
      {
        "paragraph": "However, did she not have her period less than 20 days ago? Why was she on her period again?"
      },
      {
        "paragraph": "He realized something in an instant."
      },
      {
        "paragraph": "If she did not actually have her period the last time, then according to estimations, she would have been\nfertile during that period."
      },
      {
        "paragraph": "Could it be that her period had never come at all previously?"
      },
      {
        "paragraph": "Where did the blood come from, then?"
      },
      {
        "paragraph": "He suddenly recalled that among the wounds she"
      },
      {
        "paragraph": "sustained when she fell from the reef at the seaside last time, one of them was very deep."
      },
      {
        "paragraph": "He understood everything in an instant. She had been lying to him all along."
      },
      {
        "paragraph": "After Catherine woke up, she quickly noticed the discomfort her body was in."
      },
      {
        "paragraph": "Her period came. According to the date, it was about time it came."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "She could feel that her underwear was stained. She hoped Shaun would not notice."
      },
      {
        "paragraph": "However, this could not be hidden for long. How could she explain it to him? Should she say that her\nperiod came early because she was under tremendous stress?"
      },
      {
        "paragraph": "Forget it. She decided to take a bath first."
      },
      {
        "paragraph": "She sat up. Suddenly, she saw a towering figure sitting on the sofa in the room with his long legs\nelegantly crossed. There was a cigarette between the man’s fingers. The smoke blurred his handsome\noutline."
      },
      {
        "paragraph": "However, Catherine’s heart skipped a beat. She had a bad feeling."
      },
      {
        "paragraph": "She looked at him, and Shaun extinguished the cigarette. His clear eyes were like icy shards. “You\nslashed your leg so that you could pretend you were having your period. In order to conceal the wound,\nyou deliberately fell off the reef. You’ve put in a lot of effort for this.”"
      },
      {
        "paragraph": "Catherine’s thick eyelashes were downcast. Since he had guessed everything, there was no need for her\nto defend herself."
      },
      {
        "paragraph": "“Cathy, are you simply taking advantage of my love and pampering?” Shaun stood up and walked to the\nbedside. “Do you believe that from now on, I’ll have sex with you even if you’re on your period?”"
      },
      {
        "paragraph": "Catherine shuddered. After a while, she sneered."
      },
      {
        "paragraph": "“Not touching me during my period is your love"
      },
      {
        "paragraph": "and pampering? Don’t make me laugh. gg percent of the men in this world wouldn’t have sex with\nwomen during their period. Firstly, they find it"
      },
      {
        "paragraph": "dirty. Secondly, they’re afraid of hurting the"
      },
      {
        "paragraph": "woman’s body."
      },
      {
        "paragraph": "“ Shaun, this is something all men would do. Don’t make it seem as if you’re so great."
      },
      {
        "paragraph": "“I don’t know in what way you’ve pampered me. What you’re doing now is treating me like a pet. I don’t\nhave freedom at all. I can’t even fight back"
      },
      {
        "paragraph": "when you want me to become pregnant, and you can have sex with me as you like.”"
      },
      {
        "paragraph": "As she continued talking, she started trembling out of anger."
      },
      {
        "paragraph": "She could be losing control of her emotions because of her period, or maybe the frustrations had been\npent up inside her for too long."
      },
      {
        "paragraph": "She yelled hysterically at him while crying, “This love of yours is too scary! I’d rather not have your love\nat all. Why didn’t you love Sarah like this in the past, yet you’re loving me this way now? Do you know\ndays like these really make me feel like I’m in a living hell? I always think of just jumping into the sea to\ndrown myself.”"
      },
      {
        "paragraph": "If it were not for Lucas and Suzie, she might have jumped long ago."
      },
      {
        "paragraph": "In the end, she still felt bad for those two children. They would be too pitiful if their father was a sc* mbag\nand they lost their mother."
      }
    ]
  },
  {
    "title": "Chapter 977 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Don’t you dare.”"
      },
      {
        "paragraph": "Shaun gritted his teeth and warned Catherine fiercely. There was coldness, confusion, and a sense of\nloss in his eyes."
      },
      {
        "paragraph": "Her words were like knives."
      },
      {
        "paragraph": "In the past days, her obedience and silence made him think she had gotten used to it and come around.\nHe finally understood that it was his wishful thinking all along."
      },
      {
        "paragraph": "When he thought about the possibility of her leaving this world, his mind was overwhelmed with fear. He\ndid not even think before speaking."
      },
      {
        "paragraph": "“Catherine Jones, if you dare end yourself, I’ll make all your friends and family die along with you.”"
      },
      {
        "paragraph": "“You madman! You’re a demon! ” Catherine cursed viciously, “I curse you that sooner or later, all of your\nfriends and family will leave you. There’ll be nobody by your side. Everyone will hate and despise you.\nYour company will go bankrupt, and you’ll be left with nothing.”"
      },
      {
        "paragraph": "“ Scold me all you want. No matter how viciously you scold me, I’ll never let you go.” Shaun suppressed\nthe bitterness in his heart. He warned, “ Since you didn’t get pregnant this time, then we’ll try again. If\none month doesn’t work, then two months… I’ll make sure you get pregnant. I have ample time.”"
      },
      {
        "paragraph": "He walked out with long strides after he spoke."
      },
      {
        "paragraph": "When he left, he heard the sound of things being smashed and the cries of the woman."
      },
      {
        "paragraph": "He was filled with bitterness, and even tears welled up in his eyes."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "The woman he loved had cursed him. Hah! He had thought of letting her go too."
      },
      {
        "paragraph": "However, whenever he saw her together with"
      },
      {
        "paragraph": "Wesley, he would rather go to hell with her."
      },
      {
        "paragraph": "In the study, Shaun sat on the table and downed glass after glass of wine."
      },
      {
        "paragraph": "In the past, he did not like to drink nor smoke. However, only those things could numb him at the\nmoment."
      },
      {
        "paragraph": "His phone rang. When he picked it up, Hadley’s anxious voice sounded."
      },
      {
        "paragraph": "“Eldest Young Master Hill, there’s trouble. Landell Group was ahead of us and launched their newest\nmicrochip today. However, their microchip’s data is exactly the same as the data of our Purdue\nMicrochip. What’s even worse is that our microchip’s data in the laboratory is all gone.”"
      },
      {
        "paragraph": "“What did you say?”"
      },
      {
        "paragraph": "Shaun stood up abruptly. He broke the wine glass with his bare hands, shouting, “Didn’t I ask the\nmembers of Liona to guard the lab? How did the data go missing? What a bunch of fools! ”"
      },
      {
        "paragraph": "“We don’t know. We’re in the middle of investigating it, ” Hadley muttered, “However, the lab has indeed\nbeen heavily guarded these days."
      },
      {
        "paragraph": "Only a few of Hill Corporation’s senior managers could enter the lab."
      },
      {
        "paragraph": "“Young Master Hill, ever since Landell Group’s microchip was launched this morning, our company’s\nshares have plummeted. We’re suffering a loss of 2oo billion dollars. I reckon it’ll drop more tomorrow.\nThe situation will be dire if this continues. The company is in a mess now. You have to come back\nimmediately.”"
      },
      {
        "paragraph": "“Okay, I’ll go back right away.”"
      },
      {
        "paragraph": "Shaun hung up with a heavy heart. He quickly went to the master bedroom."
      },
      {
        "paragraph": "Catherine was bathing inside. Suddenly, the bathroom door was pushed open."
      },
      {
        "paragraph": "She almost screamed at the sight of Shaun standing at the door. “What are you doing? I’m bathing now.\nGet out!”"
      },
      {
        "paragraph": "Although she had sex with him multiple times, she still could not accept him watching her bathe."
      },
      {
        "paragraph": "Shaun stared at her in confusion."
      },
      {
        "paragraph": "Previously, he thought he could lead Hill Corporation to be the top in the world with the microchip. That\nway, no one could take Catherine away from him."
      },
      {
        "paragraph": "However, Hill Corporation was under an unprecedented attack."
      },
      {
        "paragraph": "They had been caught off guard."
      },
      {
        "paragraph": "Shaun had a feeling that this would be the most challenging time in his whole life. He did not know\nwhether he had the confidence to keep her or not."
      },
      {
        "paragraph": "“Cathy…” He went under the shower and kissed her wet lips hard."
      },
      {
        "paragraph": "Water poured on them both. Catherine could barely open her eyes, but she still pushed him away"
      },
      {
        "paragraph": "furiously. ”Shaun, knock it off! You can’t even leave me alone when I’m having my period.”"
      }
    ]
  },
  {
    "title": "Chapter 978 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“cathy, cathy…”"
      },
      {
        "paragraph": "It was as if Shaun could not hear Catherine. He kept kissing her greedily as if it was their final kiss before\nseparating."
      },
      {
        "paragraph": "Catherine felt scared, and she was at a loss from his kiss."
      },
      {
        "paragraph": "He only let her go when she almost suffocated and then hugged her tightly."
      },
      {
        "paragraph": "“Cathy, I have to leave due to some matters, ” Shaun said hoarsely by her ear."
      },
      {
        "paragraph": "Catherine was taken aback. Her whole body relaxed, and her tone was cold. “Great, quickly leave. I don’t\nwant to see you every day anyway.”"
      },
      {
        "paragraph": "“ I’ll come back as soon as possible.” Shaun bit her ear lightly."
      },
      {
        "paragraph": "She felt as if electricity was running through her, but she could not push him away at all."
      },
      {
        "paragraph": "“Wait for me.”"
      },
      {
        "paragraph": "Shaun let her go. After staring at her with his deep-set eyes for more than ten seconds, he turned around\nand left the bathroom."
      },
      {
        "paragraph": "Catherine stood under the shower, still stunned."
      },
      {
        "paragraph": "She did not know what was wrong with that man. He was just leaving for a while. Did he have to make it\nlook like they were going to be separated forever?"
      },
      {
        "paragraph": "Six hours later, Shaun’s private airplane landed in Canberra."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "He immediately rushed toward Hill Corporation. Although it was already 9:00 p.m., not even one\nshareholder of Hill Corporation had left."
      },
      {
        "paragraph": "What happened today was the biggest crisis ever since Hill Corporation was established."
      },
      {
        "paragraph": "Old Master Hill, Lea, Spencer, Liam, and the others were waiting in the conference room."
      },
      {
        "paragraph": "When the door of the conference room opened, everyone swarmed over."
      },
      {
        "paragraph": "“ Shaun, you must give us an explanation for this matter. Hill Corporation has lost more than 200 billion\ndollars in a day. Even the companies that signed a contract with us before are suing us for breach of\ncontract. They want a sky-high amount of compensation from us.”"
      },
      {
        "paragraph": "“That’s right. Our company vowed that this would be the world’s one and only top microchip when we\nsigned the contract. However, after the contract"
      },
      {
        "paragraph": "was signed, Landell Group launched a similar microchip. The problem is, although we want to sue\nLandell Group for plagiarizing our microchip, all the related information in the lab has been deleted.”"
      },
      {
        "paragraph": "“If this matter isn’t solved, the whole company will be forced to stop operating after having to pay the\nhuge amount of compensation for the breach of contract. Moreover, most of the company’s funds have\nbeen used to invest in the research and development of the laboratory. Hill Corporation may go\nbankrupt.”"
      },
      {
        "paragraph": "The shareholders in the board of directors voiced their distress and anger."
      },
      {
        "paragraph": "When they heard that the company might go bankrupt, some shareholders started scolding loudly. “\nShaun, this is all your fault! You were the one who insisted on wasting so much money to develop a\nmicrochip. Now, you’ve screwed all of us over.”"
      },
      {
        "paragraph": "“That’s right. You have to carry the biggest responsibility in this matter! Besides, the company’s\nreputation has been utterly ruined because you snatched Wesley’s wife. Not only did"
      },
      {
        "paragraph": "you not step out to solve the problem, but you even hid during the company’s crucial times. As the\ncompany’s director, you should’ve handled the launching of the microchip personally.”"
      },
      {
        "paragraph": "“Old Master Hill, the Hill family must give us, the shareholders, an explanation today.”"
      },
      {
        "paragraph": "Old Master Hill’s face changed from being surrounded by the shareholders. Valerie then spoke furiously."
      }
    ]
  },
  {
    "title": "Chapter 979 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Why are all of you hovering around my dad? My dad is already so old and he’s fretting over this matter\ntoo. Besides, do you think you’re the only ones who are worried? We’re losing our position as the most\npowerful family.”"
      },
      {
        "paragraph": "“ Stop quarreling. ” Lea raised her voice and coldly stopped them. “The most important matter now is to\nfind the mole in the company. We have to figure out who’s the one who leaked the laboratory’s data.”"
      },
      {
        "paragraph": "“What use is there even if we catch the mole? Even if we catch that person, the reputation of Hill\nCorporation will still be tarnished.”"
      },
      {
        "paragraph": "A shareholder said bitterly, “The bosses of the companies who signed contracts with us will look for us\nwith the contracts in hand tomorrow morning. We can’t avoid compensating them. If we don’t pay up,\nwe’ll have to take this to court. Doing so will cause the company’s reputation to hit rock bottom. Who will\ndare to collaborate with us in the future? What will happen to the company after we compensate the\nmoney? Will we go bankrupt?”"
      },
      {
        "paragraph": "“Are you done talking?”"
      },
      {
        "paragraph": "Shaun walked to the front with long strides. The white lights on top shone on his handsome, upright\nbody. His cool aura was filled with the dominance of someone who had sat in the top position for a long\ntime."
      },
      {
        "paragraph": "“Hill Corporation won’t go bankrupt. I’ll investigate the matter regarding the leaked data thoroughly. From\nnow on, every senior manager in the company might be the mole. If I find out who the mole is, I’ll make\nthat person’s life a living hell.”"
      },
      {
        "paragraph": "Director Owens suddenly sneered and said, “I think Liam must be the mole.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Lea and Liam’s expressions changed. Lea said furiously, “Director Owens, please do not simply accuse\nothers. Liam is my son. His last name is Hill as well. He’ll never do anything to betray the Hill family.”"
      },
      {
        "paragraph": "“Hah! His last name may be Hill, but his father’s last name is Campos, ” Director Owens said angrily,\n“About half a month ago, my wife saw Liam, Mason, Maurice, and Charlie in a coffee house.”"
      },
      {
        "paragraph": "Liam’s heart sank. He had a bad feeling. He did not think that someone had spotted him that time."
      },
      {
        "paragraph": "“Director Owens, it’s perfectly normal for me to have coffee with my dad and uncle. We frequently meet\nwhenever I go to the Campos family— ”"
      },
      {
        "paragraph": "“Forget it, Liam. Stop defending yourself.”"
      },
      {
        "paragraph": "Director Owens said angrily, “Just today, I received some information. The mysterious shareholder"
      },
      {
        "paragraph": "who holds 6o percent of the shares of Campos Corporation is your dad, Mason Campos."
      },
      {
        "paragraph": "“And here’s another thing. Just an hour ago, Landell Group made a statement. They’re already\ncollaborating with Campos Corporation and handed over the microchip’s copyright in Australia to them.\nIn other words, if any company in Australia wishes to use Landell Group’s microchip, they’ll have to look\nfor Campos Corporation.”"
      },
      {
        "paragraph": "“That’s impossible.”"
      },
      {
        "paragraph": "Many shareholders were shocked. The expressions of the Hill family members were awful as well."
      },
      {
        "paragraph": "Lea, in particular, was completely shocked."
      },
      {
        "paragraph": "“This is impossible! How can Mason possibly be the largest shareholder in Campos Corporation?”"
      },
      {
        "paragraph": "“You all are too stupid! ” Director Owens scolded. “ Mason is an ambitious person. He’s better at hiding\nthan his brother Maurice and Charlie. He’s the"
      },
      {
        "paragraph": "mastermind behind the scenes. He’s only revealing himself today because the Campos family is about to\nreplace the Hill family as the most powerful"
      },
      {
        "paragraph": "family in Australia. He has nothing to worry about anymore.”"
      },
      {
        "paragraph": "“That Mason is too scary.”"
      },
      {
        "paragraph": "Valerie muttered to herself. Spencer sucked in a breath too, saying, “More than 2o years ago, the\nCampos family was just a small family that wasn’t well-known in Canberra. They weren’t more than ants\nin the eyes of the Hill family. They’re actually surpassing the Hill family now.”"
      },
      {
        "paragraph": "Old Master Hill closed his eyes. He let out a long sigh upon realizing it was too late for them to do\nanything now."
      },
      {
        "paragraph": "The Campos family had already risen back then,"
      },
      {
        "paragraph": "and they had been laying out their plans carefully in the past three years."
      },
      {
        "paragraph": "“Liam is Mason’s son. The shares of Campos Corporation will be his in the future. Helping Mason is\nequivalent to helping himself.” Valerie cast a furious stare at Liam. “Liam, you leaked the company’s\nconfidential data. Are you trying to destroy the Hill family?”"
      }
    ]
  },
  {
    "title": "Chapter 980 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“I didn’t.” Liam shook his head. He looked at everybody, flustered. However, he only saw everyone in the\nconference room glaring at him with resentment and anger. Their gazes look as if they wanted to gobble\nhim up."
      },
      {
        "paragraph": "“I didn’t betray Hill Corporation, ” Liam explained again, “Yes, my dad did look for me before, but I\nrefused him.”"
      },
      {
        "paragraph": "Lea’s body trembled. “Your dad asked you to leak to him the data of the company’s microchip?”"
      },
      {
        "paragraph": "Facing his mother’s gaze of disbelief, Liam could only nod his head. “Yes, he told me he’s the largest\nshareholder in Campos Corporation. He also tried to convince me by saying Campos Corporation would\nb e mine in the future, but I disagreed.”"
      },
      {
        "paragraph": "Lea almost lost her footing."
      },
      {
        "paragraph": "Although she had already sensed that Mason was gradually becoming cold toward her and he often did\nnot come back home, she never thought the person sleeping beside her would be so terrifying."
      },
      {
        "paragraph": "Three years ago, she gave him so much money to help Campos Corporation. After finding out that she\nhad been tricked, she resented him. Especially when she recalled all the times she helped Campos\nCorporation in those tens of years. She never once thought her husband would be so ambitious. People\ncould be ambitious, but they should have a conscience and know their limits as well."
      },
      {
        "paragraph": "What kind of man had she fallen in love with?"
      },
      {
        "paragraph": "Was Mason never a gentle and talented man? Just how well had he hidden his true colors?"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“ Sis, what kind of man did you fall in love with?” Valerie scolded, “Because of this man, you insisted o n\ndivorcing Brennan back then. You invited trouble by helping Campos Corporation. You even let Mason’s\nson steal the microchip’s data! ”"
      },
      {
        "paragraph": "Lea’s face was pale, and she could not utter a word."
      },
      {
        "paragraph": "She used to be the pride of the Hill family, yet she was now responsible for the destruction of Hill\nCorporation. Yes, she was stupid. She was unbelievably stupid for falling in love with such a bad man."
      },
      {
        "paragraph": "She was blind!"
      },
      {
        "paragraph": "“Aunty Valerie, let me repeat this. I didn’t do it. ”"
      },
      {
        "paragraph": "Three years ago, she gave him so much money to help Campos Corporation. After finding out that she\nhad been tricked, she resented him. Especially"
      },
      {
        "paragraph": "when she recalled all the times she helped Campos Corporation in those tens of years. She never once\nthought her husband would be so ambitious. People could be ambitious, but they should have a\nconscience and know their limits as well."
      },
      {
        "paragraph": "What kind of man had she fallen in love with?"
      },
      {
        "paragraph": "Was Mason never a gentle and talented man? Just how well had he hidden his true colors?"
      },
      {
        "paragraph": "“ Sis, what kind of man did you fall in love with?” Valerie scolded, “Because of this man, you insisted o n\ndivorcing Brennan back then. You invited trouble by helping Campos Corporation. You even let Mason’s\nson steal the microchip’s data! ”"
      },
      {
        "paragraph": "Lea’s face was pale, and she could not utter a word."
      },
      {
        "paragraph": "She used to be the pride of the Hill family, yet she was now responsible for the destruction of Hill\nCorporation. Yes, she was stupid. She was unbelievably stupid for falling in love with such a bad man."
      },
      {
        "paragraph": "She was blind!"
      },
      {
        "paragraph": "“Aunty Valerie, let me repeat this. I didn’t do it. ”"
      },
      {
        "paragraph": "Liam gritted his teeth."
      },
      {
        "paragraph": "“You didn’t?” Valerie stared at him with contempt. “Liam, you’re my nephew. I don’t want to suspect you\neither, but I don’t believe you’re innocent."
      },
      {
        "paragraph": "You’ve always been dissatisfied playing second fiddle to Shaun. Your dad is the major shareholder of\nCampos Corporation. Why wouldn’t you take action for such a big piece of cake? Campos Corporation\nwill be yours sooner or later.”"
      },
      {
        "paragraph": "“That’s right, Liam. Don’t take us as fools. You’re just a general manager in Hill Corporation. There’s still\nShaun above you. On the other hand, in Campos Corporation, you’re Mason’s one and only son. You\nhave a motive. Furthermore, Shaun hasn’t been in the company these days. You, as the general"
      },
      {
        "paragraph": "manager, are in charge of all the publicity matters i n Hill Corporation. You also went in and out of the\nlaboratory. It can’t be anyone else if not you.”"
      },
      {
        "paragraph": "“Say no more. Call the police.”"
      },
      {
        "paragraph": "As the shareholders discussed, the more they hated Liam."
      },
      {
        "paragraph": "Someone even went forward and pushed him."
      },
      {
        "paragraph": "The vice general manager stepped up as well, saying, “Liam, I’ve been suspecting you for a long time.\nYou were so enthusiastic about taking charge"
      },
      {
        "paragraph": "of all the signing procedures of Purdue Microchip. You didn’t allow us to meddle in a lot of the matters as\nwell. You said you wanted to do it yourself and even reminded us to keep an eye on the people working"
      },
      {
        "paragraph": "below us to avoid the company’s data from being leaked. Actually, you were just trying to cover up your\ndeeds by pushing the blame to others, right?”"
      },
      {
        "paragraph": "“Vice General Manager Hayes, is what you said true?” Shaun cast a sharp glance at the man."
      },
      {
        "paragraph": "“Director Hill, it’s absolutely true,” Vice General Manager Hayes said, “Liam didn’t let us senior managers\nhandle the matters related to the microchip these days. He even said he’s the one in charge since you\nweren’t here.”"
      },
      {
        "paragraph": "Liam’s expression changed drastically. Just as he was about to say something, a resounding slap landed\non his face."
      },
      {
        "paragraph": "He turned his head and saw Spencer’s angry face. His heart felt bitter. “Second Uncle— ”"
      },
      {
        "paragraph": "“Liam, you’re the sinner of the Hill family.” Spencer pointed at him, trembling. “You’re the same as your\ndad, always thinking of harming others. If you have a bit of conscience left, reveal this matter to the\npublic.”"
      },
      {
        "paragraph": "”How can I reveal it if I didn’t do it?”"
      }
    ]
  },
  {
    "title": "Chapter 981 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Liam shouted angrily. He looked at everybody, and all of them were looking at him with gazes of distrust.\nEven Old Master Hill, Valerie, Shaun, and Lea were suspicious of him."
      },
      {
        "paragraph": "“Mom, you don’t believe me as well?” Liam had an expression of despair. “I’m a part of the Hill family. I\nwon’t do anything to betray Hill Corporation.”"
      },
      {
        "paragraph": "“Liam… ” Lea gazed at him. She was at a loss. She had realized that she could not see through\nanybody. She had previously confidently said that Mason was innocent, but reality slapped her in the\nface."
      },
      {
        "paragraph": "“ Send him to the police station. ” Shaun suddenly coldly ordered Chance who was standing behind him.\n“Liam, I’ll investigate this matter to the end. I f I find out you were the one who did this, I’ll make your life\na living hell.”"
      },
      {
        "paragraph": "Liam felt cold all over. Before he knew it, Chance and a few members of Liona were bringing him out."
      },
      {
        "paragraph": "That mess finally came to an end."
      },
      {
        "paragraph": "However, everybody’s expressions were still down."
      },
      {
        "paragraph": "Shaun glanced at them and said with a dry voice, “ It’s late. You all should go back and rest.”"
      },
      {
        "paragraph": "Director Owens smiled bitterly. “How can we sleep when something so serious has happened?”"
      },
      {
        "paragraph": "Shaun pressed his lips together. “All these years, Hill Corporation has experienced ups and downs as\nwell as many challenges. However, Hill Corporation has always emphasized trustworthiness. Since Hill\nCorporation has breached the contracts. I won’t pay a cent less compensation to our business partners."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "If there’s not enough money, I’ll pay the remaining amount myself. If Hill Corporation really can’t hold on\nanymore, I’ll take all the blame and resign.”"
      },
      {
        "paragraph": "He turned around and left after he spoke."
      },
      {
        "paragraph": "However, he did not leave the company. He went to the office on the top floor straight away."
      },
      {
        "paragraph": "Not long after he sat down, Hadley rushed in and said, “Eldest Young Master Hill, Old Master Hill fainted\nafter he walked out of the conference room.”"
      },
      {
        "paragraph": "Shaun’s gaze darkened. He immediately stood up and went to the hospital."
      },
      {
        "paragraph": "At the hospital, after saving Old Master Hill, the doctor said he had been overstimulated, which"
      },
      {
        "paragraph": "caused cerebral venous thrombosis. He’ll be paralyzed in the future."
      },
      {
        "paragraph": "This was undoubtedly equivalent to adding insult to injury for the Hill family."
      },
      {
        "paragraph": "Valerie was furious and started fighting with Lea on the spot. “It’s all your fault, Lea! Look at what you’ve\ndone. At first, you found a traitorous husband. Then, the two sons you gave birth to are problematic as\nwell. One of them stole the company’s secrets, while the other snatched another person’s wife. Dad\nhasn’t been in a good mood these days. When he went fishing, he was mocked by others who said the\nHill family is uneducated. Now, he’s even paralyzed after getting angry at you guys.”"
      },
      {
        "paragraph": "Spencer crouched at the side lifelessly. He let them fight all they wanted, while he was in a daze."
      },
      {
        "paragraph": "Lea let Valerie hit her too. Her mind was buzzing. Valerie’s scoldings were like whips landing on her, and\nshe felt as if her whole life was a joke."
      },
      {
        "paragraph": "As a wife, she chose the wrong husband and harmed the Hill family. As a mother, she did not educate\nher sons properly."
      },
      {
        "paragraph": "She covered her face and cried in agony."
      },
      {
        "paragraph": "Shaun put out his hand and stopped Valerie’s arm. “"
      },
      {
        "paragraph": "Enough, this is the hospital. If you keep being loud and noisy, I can ask the security guards to bring you\nout of here.”"
      },
      {
        "paragraph": "“Shaun, what right do you have to interfere? You’re about to become nothing at all. Australia’s wealthiest\nman? The favored one? Haha, Liam is about to be the one in charge. Oh, by the way, he might change\nhis name to Liam Campos, haha.”"
      },
      {
        "paragraph": "Valerie started crying and scolding hysterically. Shaun pressed his lips tightly together. Suddenly, Yvette\nrushed over in tears. “It’s bad. Willie was caught! ”"
      }
    ]
  },
  {
    "title": "Chapter 982 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Spencer was shocked when he heard that. “What happened to Willie?”"
      },
      {
        "paragraph": "Yvette cried as she said, “He went to the bar to have fun at night and met Ivan Campos’ wife. He got\ndrunk and tried to molest her. As a result, he was taken away by Ivan.”"
      },
      {
        "paragraph": "Spencer stumbled a few steps backward. Willie was his only son."
      },
      {
        "paragraph": "Valerie scolded, “ Second Brother, how exactly did you educate your son? A serious issue has occurred i\nn the Hill family, yet Willie was in the bar"
      },
      {
        "paragraph": "molesting another person’s wife?”"
      },
      {
        "paragraph": "Spencer was at a loss. “This is impossible. It’s true that Willie was silly before and did many bad things.\nHowever, after returning from Melbourne three years ago, he has changed a lot. He even had a proper\ngirlfriend some time ago.”"
      },
      {
        "paragraph": "“It’s the Campos family, ” Yvette said chokingly, “It must be the Campos family’s trap. Otherwise, how\ncould Willie have met Ivan’s wife so coincidentally?”"
      },
      {
        "paragraph": "Her words reminded everybody in the Hill family. Ivan was Charlie’s cousin."
      },
      {
        "paragraph": "“Does the Campos family have a grudge with us?” Spencer was infuriated. “Not only did they steal the\ndata of Hill Corporation’s microchip, but they even want to harm my son now. This isn’t just being\nungrateful, they’re literally a bunch of animals.”"
      },
      {
        "paragraph": "“ Stop yelling! Saving Willie is the priority now. ” Yvette was choked with tears. “Willie was drenched in\nblood from getting hit. He’s heavily wounded. I’m worried he won’t be able to hold on if we delay too long.\nShaun, I’m begging you. Quickly ask the members of Liona to check where Willie was brought to.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Aunty Yvette, don’t worry. I’ll have someone find out now.”"
      },
      {
        "paragraph": "Shaun’s head was about to explode. The company’s problems had not been solved yet and Old Master\nHill might become paralyzed. Old Master Hill had not come out from the emergency room yet, but\nsomething had happened to Willie. 1"
      },
      {
        "paragraph": "Things were happening one after another as though there was an invisible power targeting the Hill family\nbehind the scenes."
      },
      {
        "paragraph": "Shaun was exhausted. However, he knew that only he alone could support the Hill family at that\nmoment."
      },
      {
        "paragraph": "Soon, the members of Liona found out that Willie had been brought to Ivan’s villa."
      },
      {
        "paragraph": "Shaun brought some men and rushed over. When they arrived at the villa, Willie was already lying\nunconscious on the ground. His whole head and face were covered in blood."
      },
      {
        "paragraph": "“I’m sorry, Eldest Young Master Hill. You came too late.”"
      },
      {
        "paragraph": "Ivan smiled ambiguously as he took out a pile of cash and threw it on Willie’s body. “Hey, this is for the\nmedical fees. I didn’t want to compensate you a t first, but I’m a person who abides by the laws. I know\nthat I have to compensate for beating a person up. 200,000 dollars should be enough to treat him.”"
      },
      {
        "paragraph": "“ Ivan, how dare you speak to Eldest Young Master Hill this way? You must have a death wish.” Chance\ngrabbed Ivan with a cold expression."
      },
      {
        "paragraph": "However, a large group of people quickly came in from the outside and surrounded Shaun, Chance, and\nthe rest."
      },
      {
        "paragraph": "“Eldest Young Master Hill, you can’t hit my cousin.”"
      },
      {
        "paragraph": "Charlie walked in from the outside. He had a smug expression as he said, “ It was Willie who molested\nmy sister-in-law first. Besides, didn’t Willie sully many good women before in Canberra? He deserves it\neven if this issue gets out.”"
      },
      {
        "paragraph": "“Willie turned over a new leaf long ago. You must’ve been the ones who set him up. ” Shaun’s\nexpression was utterly dark."
      },
      {
        "paragraph": "In the past, Charlie was nothing but a clown to Shaun. Ivan was even someone Shaun would not give a\nproper glance. Now, these people were starting to bully the people of the Hill family."
      },
      {
        "paragraph": "“You’re saying we set him up but do you have evidence?”"
      },
      {
        "paragraph": "Charlie said as he smiled, “Everyone knows that you, the people of the Hill family, have a bad habit of\nmolesting women. Aren’t you like that as well, Young Master Hill? You forcefully snatched away another\nperson’s wife. Tsk, is another person’s wife better? This is indeed a bad habit.”"
      },
      {
        "paragraph": "“Catherine has always been my woman.”"
      },
      {
        "paragraph": "Shaun’s towering figure walked toward Charlie step by step. His dark eyes were filled with gloominess. A\nt the same time, an invisible, fierce aura enveloped him."
      },
      {
        "paragraph": "Some people were born with nobility. Charlie was not equipped with that kind of aura."
      }
    ]
  },
  {
    "title": "Chapter 983 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "When Shaun went over, Charlie instinctively took two steps back. He let the security guards shield him\nfrom the front."
      },
      {
        "paragraph": "“Shaun, what are you trying to do? I’m warning you, the Hill family isn’t what it used to be. From now\nonward, the top family in Australia is us, the Campos family. The Hill family isn’t even in second place or\nthe third. Hah, you might even become the most inferior family in Canberra. Do you really"
      },
      {
        "paragraph": "think you’re still the eldest young master who can do anything as you wish?”"
      },
      {
        "paragraph": "Charlie mocked him loudly, “Besides, the fact that you snatched another person’s wife is against the law.\nHow long more do you think you can stand here and continue being haughty?”"
      },
      {
        "paragraph": "Shaun’s eyebrows twitched."
      },
      {
        "paragraph": "At that moment, a large group of police entered the door."
      },
      {
        "paragraph": "A police officer studied the situation in the house. After that, he went straight to Shaun. “Shaun, Wesley\nand Joel have reported you for kidnapping"
      },
      {
        "paragraph": "Catherine Jones. Please return to the police station with us for investigation.”"
      },
      {
        "paragraph": "“Hah, what I said turns out to be true, huh?” Charlie gloated at Shaun’s circumstances. “ Australia’s\nyoung master? This will soon change as well.”"
      },
      {
        "paragraph": "Shaun glanced at Charlie expressionlessly. Suddenly, he understood something. “What’s your\nconnection with Wesley?”"
      },
      {
        "paragraph": "“There’s not much of a connection between us. It’s just that we share the same enemy.” Charlie raised\nhis brows. “Besides, if he doesn’t take this chance to get his wife back, then he’s a fool.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun pressed his lips together. Although what Charlie said was logical, he felt that it was not that\nsimple. At this moment, it was as if he had fallen into a whirlpool."
      },
      {
        "paragraph": "“ Shaun, follow us.” The police handcuffed him. “ You kidnapped Catherine in plain sight in the hotel and\nnobody could contact Catherine after that."
      },
      {
        "paragraph": "There are sufficient witnesses and evidence. You should come to the police station immediately and tell\nus about Catherine’s whereabouts.”"
      },
      {
        "paragraph": "“Eldest Young Master Hill…” Chance looked at Shaun worriedly."
      },
      {
        "paragraph": "“Send Willie to the hospital immediately.”"
      },
      {
        "paragraph": "Shaun glanced at Willie who was lying in a pool of blood. He was worried that Willie would not be like\nnormal with all the blood he lost even after waking up."
      },
      {
        "paragraph": "When Shaun walked past Charlie, he shot him an icy glare. “Charlie Campos, the person behind you is\nMason, right? I won’t let you all off the hook.”"
      },
      {
        "paragraph": "That glance made Charlie frightened, but he soon felt relieved."
      },
      {
        "paragraph": "The Hill family was utterly done for. There was no way to turn the situation around even if Shaun\npersonally took action."
      },
      {
        "paragraph": "Next, the Campos family only needed to compete against Liona."
      },
      {
        "paragraph": "Chance quickly sent Willie to the Jewell family’s hospital. Spencer and his wife rushed over in a hurry."
      },
      {
        "paragraph": "After Willie was rescued, the doctor said helplessly, “The patient is no longer in critical condition."
      },
      {
        "paragraph": "However, his head was severely injured and he lost too much blood. He was also sent to the hospital too\nlate. He’ll be… mentally retarded in the future. ”"
      },
      {
        "paragraph": "“Men-Mentally retarded?” Yvette fainted right away out of shock."
      },
      {
        "paragraph": "Spencer was stunned too. He did not expect his only son to become retarded."
      },
      {
        "paragraph": "Lea’s heart was cold as well. “Spencer—” “Shut your mouth!”"
      },
      {
        "paragraph": "Spencer slapped her hard across her face. He was"
      },
      {
        "paragraph": "going crazy from anger."
      },
      {
        "paragraph": "“It’s all your fault. You were the one who insisted on supporting the Campos family back then. You were\nthe one who wanted to get married to Mason. You were the one who supported that traitorous family until\nthis day. You harmed our Willie too! I don’t have a sister like you.”"
      }
    ]
  },
  {
    "title": "Chapter 984 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Spencer’s eyes were bloodshot. He was not even as furious or sad when the microchip’s data was\nleaked."
      },
      {
        "paragraph": "“What grudge does my Willie have with the Campos family? Why do they want to make him mentally\nretarded? I only have him as my son.”"
      },
      {
        "paragraph": "Spencer started sobbing as he said, “Great, Willie is retarded, Dad is paralyzed, and Shaun was taken\naway by the police. The Hill family is done for."
      },
      {
        "paragraph": "We’re done for. Everything has been destroyed in your hands.”"
      },
      {
        "paragraph": "Lea looked at him, her eyes reddening from agony too."
      },
      {
        "paragraph": "It was her. It was her stupidity that harmed the Hill family."
      },
      {
        "paragraph": "‘Mason, how could you be so ruthless and vicious?!’"
      },
      {
        "paragraph": "What grudge did she have with him in her past life?"
      },
      {
        "paragraph": "Lea stumbled as she headed outside. She wanted to find Mason. She needed to clarify things with him.\nJust how many lies had he told her?"
      },
      {
        "paragraph": "Chance, who watched the scene from afar, had an annoyed expression."
      },
      {
        "paragraph": "He did not expect the Hill family to become like this in just a few days."
      },
      {
        "paragraph": "When he came out of the hospital, Yael immediately walked over and hooked her arm on his. “Brother\nChance, what will we do in the future?”"
      },
      {
        "paragraph": "“We’ll wait until Young Master Hill makes the arrangements.” Chance sighed."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“No, what I mean is… The Hill family’s collapse is inevitable, ” Yael said hesitantly, “With your abilities, do\nyou want to be Eldest Young Master Hill’s subordinate forever?”"
      },
      {
        "paragraph": "“Yael, do you know what you’re saying?” Chance warned, his expression changing."
      },
      {
        "paragraph": "“Brother Chance, what I’m saying is the truth. People have to move forward. Besides, it’s not only me\nwho thinks like this. Many skilled people in Liona have the same thought too. It’s true that our ancestors\nwere indebted to the Hill family in the past. We’ll take care of the future generations of the Hill family too.\nBut the Hill family is crumbling."
      },
      {
        "paragraph": "There’s no reason for us to keep following them.”"
      },
      {
        "paragraph": "Yael tried to convince Chance, saying, “Look, there’ll gradually be people leaving Liona. Other families\nwill headhunt some members too. After all, the Hill family no longer has the resources to maintain Liona.”"
      },
      {
        "paragraph": "Chance’s face changed."
      },
      {
        "paragraph": "He knew what Yael said was true."
      },
      {
        "paragraph": "“Brother Chance, I think you should consider our future as well.” Yael pouted. “You’re already over 40\nyears old. I’m not that young either. Eldest Young Master Hill doesn’t like me and he keeps wanting to\nmake me leave Australia. But I really want to get married to you. Let’s quit Liona.”"
      },
      {
        "paragraph": "Chance’s expression changed slightly. “You want me to leave Eldest Young Master Hill at a time like\nthis? No, I can’t bring myself to do such an ungrateful thing.”"
      },
      {
        "paragraph": "“Can Eldest Young Master Hill save the situation even if you stay with him?”"
      },
      {
        "paragraph": "Yael sighed. “That’s impossible. The Hill family has lost their power. Tomorrow morning, Hill\nCorporation’s shares will continue to drop. Young Master Hill is still at the police station. Even if he\ncomes out, he’ll have to compensate the companies"
      },
      {
        "paragraph": "for breaching the contracts. His reputation is at rock bottom now, and the Campos family is oppressing\nthem from above. It’s impossible for"
      },
      {
        "paragraph": "them to rise again unless a miracle happens. Besides"
      },
      {
        "paragraph": "She touched her stomach and whispered, “You have to think about our child.”"
      },
      {
        "paragraph": "“What? You’re pregnant?” Chance was shocked."
      },
      {
        "paragraph": "“Yes, it’s been a little over a month. ” Yael smiled sweetly. “That’s why I don’t want you to go against the\nCampos family. I’m afraid our baby will not have a father in the future. Just quit.”"
      },
      {
        "paragraph": "“…Let me consider it.”"
      },
      {
        "paragraph": "Chance was in a dilemma. He was shocked and happy at the same time. He was happy because he\nfinally had a child at his old age, but he was sad because he had to think for the child’s sake."
      }
    ]
  },
  {
    "title": "Chapter 985 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "At the police station."
      },
      {
        "paragraph": "When Shaun was taken in by the police, he saw Mason bringing Liam out from the inside."
      },
      {
        "paragraph": "The three of them met each other. Liam was surprised when he saw Shaun entering."
      },
      {
        "paragraph": "“I didn’t expect you to be bailed out of jail so quickly.” Shaun glanced at Liam who was unscathed. Then,\nhe looked at Mason, who was well"
      },
      {
        "paragraph": "-dressed beside Liam, and smiled."
      },
      {
        "paragraph": "“Mason, so you don’t intend to hide now?”"
      },
      {
        "paragraph": "“There’s no need for that.” Mason’s eyes were calm. “ I’m taking Liam away. We won’t return to the Hill\nfamily anymore. You can sue him if you have evidence. Unfortunately, you’re merely accusing him of\nstealing without any evidence.”"
      },
      {
        "paragraph": "“You both really are father and son.” Shaun shot an icy glance at Liam. “Liam, although I hated you\nbefore, I thought you still had some feelings toward Hill Corporation. It looks like it was just my wishful"
      },
      {
        "paragraph": "thinking. You’re exactly the same as your father.”"
      },
      {
        "paragraph": "Liam gritted his teeth. Just as he was about to defend himself, Mason chuckled. “Of course, he’s on the\nsame side as me. He should change his name to Liam Campos in the future too. I only have this one\nson. I’ve been dissatisfied for a long time"
      },
      {
        "paragraph": "seeing you bully him for so many years."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“ Shaun, things are different now. Be more polite when you see Liam in the future. Otherwise, I won’t let\nthe Hill family members off the hook. Willie is an example.”"
      },
      {
        "paragraph": "Shaun’s veins throbbed out of anger."
      },
      {
        "paragraph": "Liam could not find any more excuses. Mason looked back and gave him a gentle glance, saying, “ Let’s\ngo, Liam. Let’s return to the Campos family.”"
      },
      {
        "paragraph": "“Just wait, Liam. I won’t let you off the hook! ” Shaun’s cold, bloodthirsty gaze swept across Liam."
      },
      {
        "paragraph": "Liam shuddered. He understood Shaun well. He knew that Shaun was serious in making a move against\nhim."
      },
      {
        "paragraph": "If it were not for Mason’s words earlier, Shaun might not hate him so much."
      },
      {
        "paragraph": "Liam followed Mason to the parking lot. Mason threw the car keys to him and ordered"
      },
      {
        "paragraph": "coldly, “Drive the car.”"
      },
      {
        "paragraph": "Liam looked at Mason confusedly. The man was facing him with an indifferent expression. Mason was\nnot like this in front of Shaun just now. In an instant, Liam understood everything."
      },
      {
        "paragraph": "“Dad, I’m your son.”"
      },
      {
        "paragraph": "Liam smiled pitifully. “Why did you say those words in front of Shaun just now? I didn’t do anything at all,\nyet your words made them even more convinced that I was the one who stole the microchip’s data.”"
      },
      {
        "paragraph": "“Did I say anything wrong?” Mason looked at him indifferently. “You’re my son. If not, why would I\npersonally come to bail you out?”"
      },
      {
        "paragraph": "“You didn’t bail me just because I’m your son, right?”"
      },
      {
        "paragraph": "Liam suddenly yelled at Mason agitatedly."
      },
      {
        "paragraph": "“From the beginning till the end, you’ve been setting me up! You asked me to meet up with you at the\ncoffee house where Director Owens’ wife would coincidentally see us there. Yesterday, you revealed\nyourself as the major shareholder of Campos Corporation and made everybody suspect me."
      },
      {
        "paragraph": "“Not only do I have the motive, but my dad is also"
      },
      {
        "paragraph": "the major shareholder of Campos Corporation. Hence, I’m to inherit his business in the future. However,\nthat isn’t the case. You don’t only have me as your son. I’m not the one who will inherit Campos\nCorporation.”"
      },
      {
        "paragraph": "Mason’s cold eyes narrowed. “Do you know what you’re saying?”"
      },
      {
        "paragraph": "Liam laughed with reddened eyes. “Do you think I don’t know anything? You have another"
      },
      {
        "paragraph": "illegitimate son called Benny. He’s in primary school now. You’ll bring that son back to the Campos family\nevery weekend."
      },
      {
        "paragraph": "“No wonder you never cared much about me since I was young and why everyone in the Campos family\ntreats me coldly. Second Uncle even treats Ivan better than he treats me. Actually, everyone in the\nCampos family is wary of me. To you all, I’m just a sacrifice. No, in fact, you all don’t like me because I’m\nLea’s son! ”"
      },
      {
        "paragraph": "Mason squinted his eyes and lit a cigarette. His expression looked cunning."
      }
    ]
  },
  {
    "title": "Chapter 986 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Liam continued shouting, “You don’t love my mom at all. For more than 20 years, you just treated her like\na tool. That’s why you don’t love me, your son, either.”"
      },
      {
        "paragraph": "“Continue talking.” Mason took a drag on the cigarette indifferently and slowly blew out the smoke."
      },
      {
        "paragraph": "However, Liam felt a chill in his bones when he saw that. “You must have an informant in Hill\nCorporation. It was that person who leaked the data of Hill Corporation’s microchip. To cover for that\nperson, you averted Shaun’s attention and made him believe that I was the one who betrayed Hill\nCorporation. In other words, you wanted to drive a wedge between me and the Hill family.”"
      },
      {
        "paragraph": "“As expected of my son, you’ve guessed correctly. ”"
      },
      {
        "paragraph": "Mason ashed his cigarette. “Liam, you made me very disappointed this time. However, since you’re my\nson, I can give you another chance. Follow me and work for Campos Corporation from now on."
      },
      {
        "paragraph": "You’ll get your share of Campos Corporation in the future.”"
      },
      {
        "paragraph": "“Hah, forget it. Not many of your words are true anyway. Although you’re my dad, I have to admit that I’ve\nnever seen such a cold-blooded, despicable man like you in this lifetime."
      },
      {
        "paragraph": "“Mom has done so much for you all her life, but you, the one who sleeps by her side, are the one who\nhas hurt her deepest. I’ll never forgive you.” Liam glared at him with a gaze of contempt."
      },
      {
        "paragraph": "Mason laughed when he heard that. His laugh was full of sarcasm."
      },
      {
        "paragraph": "“Do I need your forgiveness? Liam, you’ve overestimated yourself. Since you don’t want to stand by my\nside, you can do whatever you like. You’re not my only son anyway.”"
      },
      {
        "paragraph": "After he spoke, he opened the car door and got in the car."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "The car started, and the window slowly rolled down. Mason looked at Liam with a cold expression. “\nUnfortunately, even if you cut ties with me, the Hill family won’t want you either.”"
      },
      {
        "paragraph": "The car left, leaving behind a trail of exhaust gas. Liam was at a loss."
      },
      {
        "paragraph": "In just a night, he had become the person who betrayed Hill Corporation. Everyone in the Hill family did\nnot believe him, and his father had an illegitimate son outside the family. It looked like he had lost\neverything."
      },
      {
        "paragraph": "Hah!"
      },
      {
        "paragraph": "He pitifully fell back on a flowerbed. He did not know why his life had become like this."
      },
      {
        "paragraph": "In the past, at least he was the second young master of the Hill family. From this day onward, he was\nnothing at all."
      },
      {
        "paragraph": "Mason drove to Campos Corporation’s main entrance."
      },
      {
        "paragraph": "When he arrived at the door, someone called out to him."
      },
      {
        "paragraph": "“Mason.”"
      },
      {
        "paragraph": "Mason looked back, and Lea’s frail, pale face was reflected in his eyes."
      },
      {
        "paragraph": "Lea used to be an unrivaled beauty in Canberra. She was the Hill family’s precious daughter, so there\nwere many men who had tried to pursue her."
      },
      {
        "paragraph": "However, the series of shocking events had made her look as if she was a few years older. Even her"
      },
      {
        "paragraph": "features looked contorted now."
      },
      {
        "paragraph": "A blatant hint of disdain flashed across Mason’s clear eyes. “What are you doing here?”"
      },
      {
        "paragraph": "Lea stumbled. If she were not seeing it with her own eyes, she would not believe that the man who used\nto coax her and pamper her would show such a disdainful look. It was as if he was looking at a dirty\nthing."
      },
      {
        "paragraph": "Lea, who was prideful, could not resist yelling, “ I came here to ask you why you’re treating the Hill family\nand me this way? Was it you who stole the information on Hill Corporation’s microchip?”"
      },
      {
        "paragraph": "“ I don’t know what you’re talking about.” Mason turned his head and left."
      },
      {
        "paragraph": "“Stop right there!” Lea grabbed his arm. It was as if she had gone crazy. “How has the Hill family ever\nmistreated you? If it weren’t for me back then— ”"
      },
      {
        "paragraph": "“Shut up!” Mason could not tolerate it anymore and shook her off."
      },
      {
        "paragraph": "Lea lost her footing and fell to the ground. She raised her head and looked up at the cold, heartless man.\nThere was a gleam of despair in her eyes."
      }
    ]
  },
  {
    "title": "Chapter 987 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "At that moment, Lea heard someone sweetly calling out, “Hubby…”"
      },
      {
        "paragraph": "Then, Mason turned his head. He had a gentle expression on his face."
      },
      {
        "paragraph": "Lea looked over as well. A young, beautiful woman walked over while holding the hand of a seven or\neight-year-old little boy. The little boy ran over and threw himself into Mason’s embrace. “Dad… ”"
      },
      {
        "paragraph": "Lea felt as if her head was split open by lightning. She gazed at that woman and child with widened\neyes. She almost could not breathe."
      },
      {
        "paragraph": "If she was not mistaken, this woman was the Holt family’s daughter, Joanne Holt. Joanne was quite close\nto Sarah. Lea had even met Joanne a few times before during some corporate events in Canberra."
      },
      {
        "paragraph": "“Aunty Lea.” Joanne glanced at her. “I’m sorry, Mason and I have been in love with each other for a long\ntime now. This is our child.”"
      },
      {
        "paragraph": "Lea almost wanted to spit out blood due to anger. Joanne’s words were like a slap across her face."
      },
      {
        "paragraph": "“Mason Campos, you b*stard!”"
      },
      {
        "paragraph": "She could no longer tolerate it. She raised her hand t o slap Mason’s elegant face."
      },
      {
        "paragraph": "However, she was pushed to the ground by Mason before she could touch him."
      },
      {
        "paragraph": "“Lea Hill, I’ve tolerated you long enough.” Mason stared at her mercilessly. “I’ve had enough of your\ntemper. You want me to listen to everything you say. If it weren’t for the Hill family behind you, do you\nthink I would’ve tolerated you for more than 20 years?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“So you were just using me from the beginning till the end? Your love for me was fake too. ” Tears of\ndespair rolled down Lea’s eyes."
      },
      {
        "paragraph": "“What else could it be? I find a remarried woman like you who even has a child with another man dirty.”"
      },
      {
        "paragraph": "Mason’s words were as sharp as knives. “Now that the Hill family is crumbling, you’re not good enough\nfor me anymore. I’ll find someone to send the divorce papers to you. You’d better sign them\nimmediately.” “Sc*mbag.”"
      },
      {
        "paragraph": "Lea’s blood was boiling from anger. Her pretty eyes"
      },
      {
        "paragraph": "were blazing with flames of hatred. “After using the Hill family, you want to kick me away and make way\nfor this woman, right? In your dreams, Mason!"
      },
      {
        "paragraph": "I’ll reveal your disgusting true colors to the public.”"
      },
      {
        "paragraph": "“Reveal it, then. Currently, Campos Corporation has the access rights to Landell Groups’ microchip for\nAustralia in our hands. Any company that wants the microchip will need to collaborate with us."
      },
      {
        "paragraph": "Which company will dare to publish my scandal?”"
      },
      {
        "paragraph": "Mason sneered, “But I have to remind you of this. You should be considerate of the others in the Hill\nfamily such as Shaun, Spencer, and Valerie."
      },
      {
        "paragraph": "Squashing them is as easy as squashing an ant for me.”"
      },
      {
        "paragraph": "Lea felt chills all over her body."
      },
      {
        "paragraph": "He was using her family members to threaten her."
      },
      {
        "paragraph": "How exactly did she get involved with a demon like Mason in this lifetime?"
      },
      {
        "paragraph": "“Aunty Lea, do sign the papers as soon as you can. I can’t wait to sit in the position of Madam Campos.”\nJoanne looked at her smugly and circled Mason’s arm. They walked into Campos Corporation’s building\ntogether."
      },
      {
        "paragraph": "Lea looked at them from behind."
      },
      {
        "paragraph": "She felt like she had been a joke for over 20 years."
      },
      {
        "paragraph": "In the past, she actually thought Brennan was coveting the Hill family’s wealth, so she thought of every\nway to divorce him."
      },
      {
        "paragraph": "For all those years, she was strict with Shaun. However, it turned out that the one who really coveted the\nHill family was the gentle Mason."
      },
      {
        "paragraph": "It was too terrifying. That man kept acting pitifully in front of her. He disguised himself as an artist who\nwas not interested in worldly stuff and just loved painting and calligraphy. It turned out to all be a lie."
      },
      {
        "paragraph": "He even had a child with another woman outside. She was stupid. She was really stupid."
      },
      {
        "paragraph": "She had always thought Shaun was stupid for falling in love with Sarah before. However, as his mother,\nshe was not any better either."
      }
    ]
  },
  {
    "title": "Chapter 988 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "At the police station."
      },
      {
        "paragraph": "6:00 a.m. \nChester came over with his lawyer and met both Joel and Wesley in the lobby."
      },
      {
        "paragraph": "When Joel saw him, he said with a heavy expression, “Chester, I know you’re here to bail Shaun out, but\nI’m reminding you, it won’t be easy to get him out. You’d better advise him and tell us where he’s hiding\nCathy.”"
      },
      {
        "paragraph": "“I’ll try my best, Uncle Joel.” Chester rubbed his eyebrows and glanced at Wesley."
      },
      {
        "paragraph": "He had never crossed paths with Wesley before, but he had read about him in magazines."
      },
      {
        "paragraph": "Golden Corporation rose rapidly in recent years and became the leading pharmaceutical group all thanks\nto Wesley’s efforts. \nHe was gentle and elegant when he was interviewed, but currently, he was dressed in a black suit. His\nelegant features were covered with a layer of cold rage in the cool light."
      },
      {
        "paragraph": "Chester had a feeling that Wesley was not a simple man."
      },
      {
        "paragraph": "However, a moment later, Chester looked away and walked inside."
      },
      {
        "paragraph": "Five minutes later, Shaun was brought to the interrogation room. Chester sat opposite him."
      },
      {
        "paragraph": "Their eyes met, and Chester sighed when he saw Shaun’s bloodshot eyes. “Shaun, do you know how\nmuch effort I spent before I could meet you here?”"
      },
      {
        "paragraph": "“Is the Campos family exerting pressure from above?” Shaun asked in a gloomy voice."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Yeah, the Campos family has become the number one family in the country, and even I don’t dare to go\nhead-to-head against them anymore. I had to rely on the connections of the Snow family to be able to\nmeet you.”"
      },
      {
        "paragraph": "Chester’s tone was very solemn. “If you don’t cooperate with me, I can’t bail you out.”"
      },
      {
        "paragraph": "“Does cooperating with you mean that I have to reveal Catherine’s location?” Shaun laughed bitterly."
      },
      {
        "paragraph": "“You took away Catherine in front of everyone’s eyes. Wesley, Joel, and the top management of Hudson\nCorporation haven’t been able to contact her.” Chester sighed again. “Your action can be regarded as\nkidnapping. They didn’t call the police before, but the Hill family now has both internal and external\nproblems. Now that Wesley and Joel have joined forces, they aren’t afraid of you at all.”"
      },
      {
        "paragraph": "Shaun pursed his thin lips. He had already anticipated as much when he was on the island."
      },
      {
        "paragraph": "That was why he had kissed her before leaving. He was afraid that he would never be able to kiss her\nagain."
      },
      {
        "paragraph": "“Shaun, just spit it out. Catherine has been missing for a month. You can’t hide her for life. You’ll be\nharming her that way. Also… you stayed with Catherine for a month after she got married. Do you think\nthat her relationship with Wesley can return to the same as before?”"
      },
      {
        "paragraph": "Chester shook his head. “We’re all men. This will be a thorn in Wesley’s heart. Even if he doesn’t say\nanything, the people on the internet will laugh at him.”"
      },
      {
        "paragraph": "Shaun’s gaze softened slightly, and Chester immediately took the chance to strike. “You have to think\nabout Hill Corporation as well. Hill Corporation is in a mess now. Your grandfather is paralyzed, Liam was\ndriven out of the company, Willie became a fool, and your mom is divorcing"
      },
      {
        "paragraph": "Mason Campos. Is everyone supposed to count on Valerie and Spencer? You should know how capable\nthey are.”"
      },
      {
        "paragraph": "“…Fine, I’ll talk.”"
      },
      {
        "paragraph": "Shaun closed his eyes and clenched his fists. He finally spoke with difficulty."
      },
      {
        "paragraph": "Chester sighed with relief. “It’s good that you understand. As long as Catherine is alive, you can get her\nback, but you need to keep Hill Corporation going. Otherwise… you won’t be able to fight with Wesley.”"
      },
      {
        "paragraph": "Shaun’s handsome face appeared to be at a loss."
      },
      {
        "paragraph": "He had always thought he was smart and everything was in his power."
      },
      {
        "paragraph": "In the incident this time with the chip, success was clearly just around the corner. However, it suddenly\nbecame the fuse that destroyed everything."
      },
      {
        "paragraph": "He also did not know what went wrong. Was it Liam?"
      },
      {
        "paragraph": "Should he not have been merciful toward Liam back then? Should he have gotten rid of Campos\nCorporation by any means possible as soon as he learned that Mason was not a simple person?"
      },
      {
        "paragraph": "On the island. Shaun had been away for a day."
      }
    ]
  },
  {
    "title": "Chapter 989 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Logically speaking, Catherine should be able to have a good night’s sleep since she did not have to be\nwrapped up in that man’s arms at night anymore."
      },
      {
        "paragraph": "However, she kept tossing and turning, unable to sleep."
      },
      {
        "paragraph": "She felt restless as if something bad was going to happen."
      },
      {
        "paragraph": "She remembered Shaun’s eyes when he left last night. He looked very strange and left in a hurry. Had\nsomething happened?"
      },
      {
        "paragraph": "With his current position, who else could threaten him?"
      },
      {
        "paragraph": "At 8:00 a.m., she sat in the dining room to eat breakfast. The chef made a lot of good food, but she lost\nher appetite after two bites."
      },
      {
        "paragraph": "After breakfast, she went out for a walk until noon when a helicopter suddenly flew over a distance away."
      },
      {
        "paragraph": "She thought it was Shaun who came back, but she did not expect him to come back so quickly."
      },
      {
        "paragraph": "However, when the helicopter landed on the grassy area, Wesley soon charged in with a group of\npeople."
      },
      {
        "paragraph": "He was wearing a white shirt, and his short black hair was slightly ruffled by the strong wind. When his\ndark eyes saw her, all kinds of complicated emotions flashed in the depths of his eyes before being\nreplaced by joy."
      },
      {
        "paragraph": "“Cathy, I finally found you. ” He strode toward her. Catherine was stunned. Was she dreaming?"
      },
      {
        "paragraph": "When she was first brought here, she had dreamed that Wesley found her."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Then, she gave up hope. She did not expect Wesley to find her anymore."
      },
      {
        "paragraph": "However, before he could approach him, the housekeeper stood in front of Catherine."
      },
      {
        "paragraph": "“Stop, this is our young madam. Outsiders aren’t allowed to approach her.” The housekeeper stared a t\nWesley warningly."
      },
      {
        "paragraph": "“Young Madam?”"
      },
      {
        "paragraph": "Wesley clenched his fists tightly when he heard the words and sneered, “She’s my wife. You’d best get\nout of the way. Your master, Shaun Hill, has been arrested.”"
      },
      {
        "paragraph": "The housekeeper was stunned. Before he could react, Wesley already called his men to subdue them."
      },
      {
        "paragraph": "“Cathy, I missed you so much.” Wesley quickly walked over to Catherine and touched her face gently."
      },
      {
        "paragraph": "He had not been able to sleep for a whole month. Every day, it was like a million insects were gnawing at\nhim, and he could only numb himself by drinking."
      },
      {
        "paragraph": "However, she looked different. Her skin was softer than usual, and there was even baby fat on her\ncheeks now. She must have eaten and dressed well."
      },
      {
        "paragraph": "A deep hatred spread from the depths of Wesley’s heart."
      },
      {
        "paragraph": "When his life was worse than death, she had been living a divine life with Shaun on this island."
      },
      {
        "paragraph": "‘Catherine, oh Catherine, how could you be so fickle? How could you be so shameless?’"
      },
      {
        "paragraph": "She was clearly his wife."
      },
      {
        "paragraph": "However, Wesley did not reveal any of that. He only held her in his arms tightly."
      },
      {
        "paragraph": "Catherine felt pleasantly surprised, but also guilty."
      },
      {
        "paragraph": "She felt that she was too dirty for Wesley now."
      },
      {
        "paragraph": "A very uncomfortable feeling rose up in her, especially when she was being held by him like this."
      },
      {
        "paragraph": "“Wesley, I’m sorry…” Her face was full of pain. “ How did you find your way here? Right, you said that\nShaun was arrested. What happened?”"
      },
      {
        "paragraph": "“Are you worried about him?” Wesley’s eyes became cold as he stared intently at her."
      }
    ]
  },
  {
    "title": "Chapter 990 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“No.”"
      },
      {
        "paragraph": "Catherine was startled by Wesley’s eyes. She had never seen him look at her with such eyes before."
      },
      {
        "paragraph": "“I’m sorry, I scared you. ” Wesley realized that he was being too rash and immediately hugged her tightly\nagain, his tone filled with pain."
      },
      {
        "paragraph": "“Cathy, I don’t want to be like this either. For the past month, I’ve been worried and anxious. I hated my\nuseless self. I let Shaun take you away, but I resented that you were with him every day. Will you divorce\nme if you’ve fallen in love with him again?”"
      },
      {
        "paragraph": "The more Catherine listened, the more guilty and heartbroken she was. “No, Wesley, I should be the one\napologizing. I…”"
      },
      {
        "paragraph": "Thinking of how she had slept with Shaun every day these days, she wanted nothing more than to dig a\nhole and crawl into it. She was too ashamed to face Wesley."
      },
      {
        "paragraph": "She had even slept with Shaun on their wedding night."
      },
      {
        "paragraph": "The more she thought about it, the paler her face became. She could not speak at all."
      },
      {
        "paragraph": "“Stop talking. Let’s get out of here. Your dad is also very worried about you.”"
      },
      {
        "paragraph": "Wesley wrapped his arm around her and headed to the helicopter."
      },
      {
        "paragraph": "After getting on the helicopter, Catherine still felt muddle-headed."
      },
      {
        "paragraph": "She had been saved by Wesley, but it was too late. She could not pretend that nothing had happened."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“By the way, Wesley, can you tell me what exactly is going on outside? How did you find me? Where a m\nI now?” she asked, bewildered."
      },
      {
        "paragraph": "“This is a small island on the Pacific Ocean. It’s an island that Shaun bought while he was abroad, and i t\nwasn’t registered under his name, so we weren’t able to find out. I only managed to find you because I\ncalled the police and said he kidnapped my wife.”"
      },
      {
        "paragraph": "Wesley explained to her patiently, “Cathy, I actually wanted to call the police long ago, but when Shaun\ntook you away, he threatened me saying that he’d ruin my family if I dared to report it. I don’t care what\nhappens to me, but I have to think about my parents.”"
      },
      {
        "paragraph": "Catherine sucked in a cold breath. “I didn’t expect Shaun to be so cruel. He even used your family to\nthreaten you.”"
      },
      {
        "paragraph": "“Yes.” A light flashed in Wesley’s eyes, and he said in a low voice, “Otherwise, I would’ve called the\npolice long ago.”"
      },
      {
        "paragraph": "“But why did you report it to the police now? You’re not afraid of him anymore?” Catherine asked\nsuspiciously. “Shaun told me last time that Hill Corporation’s chip will be entering the market, and it\nseems like it’ll be the top microchip in the world. I n the future, his status will definitely be— ”"
      },
      {
        "paragraph": "“Hill Corporation’s microchip failed to hit the market.”"
      },
      {
        "paragraph": "Wesley interrupted her, “I heard that it was a foreign company called Landell Group that launched a more\npowerful chip first. Hill Corporation was caught off guard and their stocks have been falling since\nyesterday. Hill Corporation’s market value shrunk by more than 80 billion dollars.”"
      },
      {
        "paragraph": "Catherine was stunned. 8o billion dollars? How hard had the stocks fallen? It was no wonder Shaun left\nin such a hurry."
      },
      {
        "paragraph": "“How did they fall so badly?” “It’s because Hill Corporation said that the Purdue Microchip they were\ndeveloping was the world’s number one chip. This attracted a lot of large domestic and foreign\ncompanies who paid high deposits. When Landell’s microchip came out, the partner companies all\nthought they had been cheated."
      },
      {
        "paragraph": "“Hill Corporation caused great losses to the partner companies. According to the contract, Hill\nCorporation has to pay an exorbitant amount of compensation which might lead to their bankruptcy.”"
      },
      {
        "paragraph": "Catherine was shocked."
      },
      {
        "paragraph": "All along, Shaun had been like a deity standing at the top of the pyramid."
      },
      {
        "paragraph": "She never expected Hill Corporation to suddenly fall after getting caught off guard."
      },
      {
        "paragraph": "Others might not understand, but she knew Shaun."
      },
      {
        "paragraph": "Shaun had never been a braggart, and the people in Liona constantly worked hard. It was impossible\nthat they did not know Landell had successfully developed the world’s number one microchip."
      }
    ]
  },
  {
    "title": "Chapter 991 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine felt that it was strange. Shaun was defeated too suddenly. It was as if someone was\ndeliberately targeting Hill Corporation."
      },
      {
        "paragraph": "“Then… I guess the Hill family is no longer the top family in the country?” She could not help but ask i n a\nlow voice."
      },
      {
        "paragraph": "“Yes. Now, Hill Corporation’s market value is even lower than my company’s.”"
      },
      {
        "paragraph": "Wesley said, “There’s no telling what will happen tomorrow. If Shaun doesn’t compensate those\ncompanies, Hill Corporation’s reputation will hit rock bottom and no company will dare to cooperate with\nthem in the future."
      },
      {
        "paragraph": "“If he pays, Hill Corporation may become a company on their last legs. They can forget about coming up\nwith the money to invest in labs to develop microchips in the future. If no new chips are launched, Hill\nCorporation will be eliminated from this market.”"
      },
      {
        "paragraph": "Catherine understood."
      },
      {
        "paragraph": "In short, Shaun had met a dead end this time."
      },
      {
        "paragraph": "The number one family in the country was going to disappear."
      },
      {
        "paragraph": "“Cathy, Shaun will no longer be able to threaten us in the future.” Wesley suddenly reached out and held\nher tightly in his arms. “I’ll never let him off for stealing my wife away.”"
      },
      {
        "paragraph": "Catherine looked up and saw the hatred in his eyes. She was shocked. “Wesley…”"
      },
      {
        "paragraph": "“Cathy, don’ t you want to take revenge?” Wesley bowed his head and looked at her with a complicated\ngaze. “As a man, my wife was taken away in public during our wedding. Should I pretend that nothing"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "happened? Besides, you were locked up on that island and must have suffered a lot. It’s time to settle\nthe scores.”"
      },
      {
        "paragraph": "Catherine’s eyelashes drooped. It was normal for Wesley to have those thoughts. Any man would hate\nsuch a thing."
      },
      {
        "paragraph": "Even yesterday, she had hated Shaun incomparably. She even cursed for him to lose everything."
      },
      {
        "paragraph": "However, now that such a day had actually arrived, she did not feel happy at all."
      },
      {
        "paragraph": "It was as if… she actually… did not want to get revenge on Shaun. How could that be?"
      },
      {
        "paragraph": "Could it be that she had gotten numb after being tormented by Shaun and developed masochistic\ntendencies?"
      },
      {
        "paragraph": "Catherine shivered as she felt bad."
      },
      {
        "paragraph": "“Wesley, what are you going to do?” she murmured. “Of course, I’m going to accuse him of kidnapping, ”\nWesley said in a low voice, “You’re the person he kidnapped. As long as you tell the police that he locked\nyou up, restricted your personal freedom, and… harmed you, he’ll be sentenced.”"
      },
      {
        "paragraph": "Harm?"
      },
      {
        "paragraph": "Catherine was horrified, and her face grew hot due t o embarrassment."
      },
      {
        "paragraph": "After a long time, her voice was squeezed out of her throat. “Wesley, what… do you mean by that?”"
      },
      {
        "paragraph": "Wesley’s dark pupils flashed with a trace of pain, but he smiled bitterly a moment later. “Cathy, we’re all\nadults. Frankly speaking, I don’t believe that Shaun didn’t touch you after he took you away. But you’re\nmy wife. As long as you didn’t consent to it, his behavior is a crime.”"
      },
      {
        "paragraph": "Catherine could not lift her head out of embarrassment."
      },
      {
        "paragraph": "After half a minute of silence, she withdrew her hand from his and left his embrace. She walked to the\nwindow. She needed some time to digest this matter."
      },
      {
        "paragraph": "“Cathy, since I came to find you, I won’t be hung up about all that.”"
      },
      {
        "paragraph": "Wesley said with deep affection behind her, “I know you were forced. I was useless. If I had come earlier,\nyou wouldn’t have encountered all this. But you have to admit that Shaun is crazy. He should get the\npunishment he deserves for the evil deeds he committed.”"
      }
    ]
  },
  {
    "title": "Chapter 992 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Wesley’s words were like cannonballs, hitting Catherine’s head one after another."
      },
      {
        "paragraph": "Yes."
      },
      {
        "paragraph": "Shaun had done something illegal. She never consented to any of it."
      },
      {
        "paragraph": "People ought to be sentenced if they broke the law, right?"
      },
      {
        "paragraph": "Why was she hesitating?"
      },
      {
        "paragraph": "Even if Shaun went to jail and Hill Corporation fell, it had nothing to do with her."
      },
      {
        "paragraph": "“Cathy, I understand that it’s hard for you to mention such things to the police, but it’s hard for me too, ”\nWesley said bitterly, “But we can face it together in the future. I, Wesley Lyons, will never give up on\nyou.”"
      },
      {
        "paragraph": "The more he spoke, the guiltier Catherine felt."
      },
      {
        "paragraph": "The better Wesley treated her, the heavier the boulder in her heart was."
      },
      {
        "paragraph": "Five hours later."
      },
      {
        "paragraph": "The helicopter landed on the Yule residence’s lawn. Both Joel and Lucas had been waiting there for a\nlong time."
      },
      {
        "paragraph": "Lucas, who had been unable to contact Catherine for so long, ran over and jumped directly into\nCatherine’s arms."
      },
      {
        "paragraph": "“Mommy… ” Lucas hugged Catherine tightly with red eyes. “I missed you so much.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Lucas, were you worried about me these days?” Catherine kissed his forehead as her heart ached. “I’m\nfine. I’m back. I’ll never leave you in the future.”"
      },
      {
        "paragraph": "“Mommy, I hate him.” Lucas looked up, his eyes full of hatred."
      },
      {
        "paragraph": "He would never forget that Shaun Hill knocked his Mommy out and made her disappear from his world."
      },
      {
        "paragraph": "When he was in kindergarten these few weeks, he would occasionally hear the teachers talking about\nMommy. Everyone said that since Mommy had been taken away by Shaun and definitely tainted, Uncle\nWesley would divorce her. No man in the world would be able to accept Mommy anymore."
      },
      {
        "paragraph": "When he heard that, there was an unspeakable panic in his heart."
      },
      {
        "paragraph": "He only wanted his mommy to be happy, but it was all ruined by his selfish scummy dad, Shaun Hill."
      },
      {
        "paragraph": "Catherine was shocked to see the hatred in her son’s eyes. “Lucas…”"
      },
      {
        "paragraph": "Her lips moved slightly. She could hate Shaun, but she did not want her son and daughter to hate their\nbiological father. After all, this was between Shaun and her. She did not want her children to fall into the\nshadows."
      },
      {
        "paragraph": "However, Wesley and Joel were around, so she could not say too much."
      },
      {
        "paragraph": "“It’s good that you’re back. You must not have eaten anything all day. I’ll tell the kitchen to prepare some\ndelicious food.” Joel led them into the villa."
      },
      {
        "paragraph": "She went upstairs first to change her clothes. Her mobile phone and other belongings were on the\ndresser. She quickly entered the password."
      },
      {
        "paragraph": "Countless missed calls showed up on the screen."
      },
      {
        "paragraph": "She called Freya first. “I’m back.” “My dear lady, you’re finally back! ” Freya was so emotional she was\nabout to cry. “I thought you’d only come back after getting knocked up by Shaun.”"
      },
      {
        "paragraph": "Catherine,”….” Freya’s words had indeed almost come true."
      }
    ]
  },
  {
    "title": "Chapter 993 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“You’re not… pregnant with Shaun’s child again, right?” Freya suddenly asked nervously."
      },
      {
        "paragraph": "“No.” Catherine was exasperated. She took the phone and walked out to the balcony."
      },
      {
        "paragraph": "“Oh, then did you sleep with Shaun?” Freya continued to gossip."
      },
      {
        "paragraph": "Catherine felt upset and gritted her teeth. “Are you done? Can you ask about something else?”"
      },
      {
        "paragraph": "“I’ve always been more interested in these kinds of things. They’re more exciting.” Freya chuckled."
      },
      {
        "paragraph": "“Bullsh*t.” Catherine could not hold back. “My conscience has been tortured day and night for the past\nmonth, okay?”"
      },
      {
        "paragraph": "“Don’t think like that. You were forced by him.” Freya comforted her. “You didn’t mean to have an\nextramarital affair.”"
      },
      {
        "paragraph": "“Shut up.”"
      },
      {
        "paragraph": "The words ‘extramarital affair’ triggered"
      },
      {
        "paragraph": "Catherine’s heart."
      },
      {
        "paragraph": "“Well…” Freya changed the subject. “Anyway, Shaun Hill won’t be able to do anything to you in the\nfuture.”"
      },
      {
        "paragraph": "Catherine pursed her lips and asked with a complicated feeling, “Is Hill Corporation’s predicament now\nreally that serious?”"
      },
      {
        "paragraph": "“Yeah, but I heard from Rodney that Shaun intends to compensate those partners. In fact, he has to pay\nthem. Those companies are all global enterprises and have plenty of money to engage in lawsuits."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Once he pays them, Hill Corporation won’t have much money left. Sigh, to be honest, Shaun got really\nunlucky this time. But there’s nothing he can do. It was Liam who betrayed Hill Corporation.”"
      },
      {
        "paragraph": "“Liam betrayed Hill Corporation?” Catherine could not digest this."
      },
      {
        "paragraph": "“Don’t you know yet?” Freya said, “I heard this gossip from Osher’s senior management."
      },
      {
        "paragraph": "Apparently, Landell stole the data of Hill Corporation’s Purdue Microchip. It’s exactly the same. “An\ninsider sneaked into Hill Corporation’s lab and deleted all the data so that they would have no grounds to\nsue Landell for plagiarism."
      },
      {
        "paragraph": "“Landell handed over all the rights to use the chip in Australia to the Campos family. The Campos\nfamily’s status has risen and they’ve become the number one family in the country. To put it bluntly, the\nCampos family and Landell teamed up against Hill Corporation.”"
      },
      {
        "paragraph": "Catherine was shocked. “The Campos family is too despicable. Competition in the market is normal, but\nthey can’ t plagiarize to achieve their goal. By the way, what does this have to do with Liam?”"
      },
      {
        "paragraph": "“Liam’s father, Mason Campos, is the largest shareholder of Campos Corporation. Mason is now the\nchairman of Campos Corporation. Mason also publicly announced that Liam Hill’s name will be officially\nchanged to Liam Campos.”"
      },
      {
        "paragraph": "Freya clicked her tongue. “It’s obvious. With Campos Corporation coming to power, the one who will gain\nthe most out of it is Liam. In the future, the assets in Mason’s hands will be his son’s. It’s also said that\nthe Hill family called the police and sent Liam to the station the day before yesterday, but Mason\nimmediately released him on bail. Who else do you think could have done it besides Liam?”"
      },
      {
        "paragraph": "Catherine’s head buzzed as she listened. Liam was her friend and someone who had saved her before.\nHe was also Suzie’s ‘father’."
      },
      {
        "paragraph": "“I don’t believe that he’s such a person,” Catherine said in a low voice, “Since Liam saved me back then,\nit shows that he has a conscience. He’s not someone who would cut ties with his family for power and\nstatus.”"
      },
      {
        "paragraph": "“I’m afraid you’re the only one who would say that now.” Freya sighed. “Others think differently. Liam has\na motive. He’s been suppressed by Shaun all these years and the Hill family doesn’t value him. Shaun\neven beat him in public a few months ago. When the incident spread throughout the whole city, everyone\nlaughed at him."
      },
      {
        "paragraph": "“Liam is a man, so he definitely would feel resentful. Furthermore, a few days before the incident, I heard\nthat Liam, Mason, and Maurice met up at a coffeehouse to conspire together.”"
      },
      {
        "paragraph": "“I’ll call Liam and ask. I miss Suzie anyway.” Catherine became more uneasy the more she listened."
      },
      {
        "paragraph": "Freya said, “Go ahead. Many people in the Hill family have gotten involved in one incident or another\nrecently. I also wonder if there’s anyone taking care of Suzie right now.”"
      },
      {
        "paragraph": "“What happened?”"
      },
      {
        "paragraph": "“Old Master Hill got a stroke from anger and is paralyzed; Willie got beaten up by the Campos family and\nis now mentally retarded.”"
      }
    ]
  },
  {
    "title": "Chapter 994 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine felt like her brain had just exploded."
      },
      {
        "paragraph": "After leaving the island, she had received too much shocking news."
      },
      {
        "paragraph": "Although Old Master Hill was old, she had met him before and knew he was in good health."
      },
      {
        "paragraph": "As for Willie, although he had targeted her in Melbourne, she got over that grudge when she stripped his\nclothes in the toilet."
      },
      {
        "paragraph": "He even helped her when she went to Hill Manor for the first time after arriving in Canberra. She did not\nexpect him to be mentally retarded now."
      },
      {
        "paragraph": "“Didn’t the Hill family report it to the police?” She could not help but ask."
      },
      {
        "paragraph": "“What are they supposed to report? The Campos family insisted that Willie tried to molest Ivan Campos’\nwife and Ivan brought him to the villa. By the time Shaun arrived, it was already too late. Ivan threw a\nstack of money at him saying that it was for the medical expenses. Even if Shaun went to the police, the\nCampos family would just have to pay compensation."
      },
      {
        "paragraph": "“To the Campos and Hill families, the last thing they care about is money. Moreover, Wesley reported that\nShaun kidnapped you, so Shaun was helpless as well as he was brought to the police station. It was\nChester and Rodney who found a way to bail him out.”"
      },
      {
        "paragraph": "Catherine took a long time to digest the words before finally sighing. “The Campos family is too ruthless.\nNo matter what, without the strong support of the Hill family back then, the Campos family wouldn’t be\nwhere it is today.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“It’s human nature to be greedy. Mason Campos was the one who did too good of a job hiding. After\nrevealing his true colors, the first thing he did was abandon his wife who no longer had any value to him.\nHe thinks nothing of people now.” Freya sighed.\n“Although I hate Shaun and I’m happy that he has become like this, I think that people should do things\nproperly. It’s really dishonorable to backstab and trick people."
      },
      {
        "paragraph": "“I think so too.”"
      },
      {
        "paragraph": "Catherine felt the same way."
      },
      {
        "paragraph": "After the call, she hurriedly called Liam."
      },
      {
        "paragraph": "The phone rang for a long time before an unfamiliar man’s voice sounded. “Hello, are you a friend of the\nowner of this phone?”"
      },
      {
        "paragraph": "Catherine was stunned and responded, “Yeah”."
      },
      {
        "paragraph": "The person said, “Your friend has drunk too much at our bar. Can you come and pick him up?”"
      },
      {
        "paragraph": "“Okay, tell me the address. I’ll be right there.”"
      },
      {
        "paragraph": "Catherine hung up the phone and hurriedly changed her clothes before going downstairs."
      },
      {
        "paragraph": "“Cathy, I was just about to go upstairs to call you down for dinner, ” Wesley said with a smile."
      },
      {
        "paragraph": "Catherine hesitated for a moment but decided to tell the truth. “Wesley, I called Liam earlier but the bar\nstaff answered and said that he’s drunk too much…”"
      },
      {
        "paragraph": "“Are you going to pick him up? I’ll go with you,” Wesley immediately said. “If he has drunk too much, then\na woman like you won’t be able to carry him alone.”"
      },
      {
        "paragraph": "“…Okay.”"
      },
      {
        "paragraph": "Catherine originally thought that he would be a little upset. After all, Liam was a member of the Hill family,\nbut after seeing his calm face, her heart was relieved."
      },
      {
        "paragraph": "Unexpectedly, Joel was unhappy about this. “ Although Liam helped you before, I can’t understand that\nperson now. Cathy, I suggest you keep a distance from those people. Mason is a ruthless man, and Liam\nis his son. He’s definitely not a simple person.”"
      },
      {
        "paragraph": "“Okay, but I’ll send him back first. After all, I owe him.”"
      },
      {
        "paragraph": "Catherine answered vaguely and hurried to the bar with Wesley."
      },
      {
        "paragraph": "When they got there, Liam was already a drunken mess. There were many empty beer bottles on the\ntable. He was holding a bottle and pouring it down his throat. “Liam, stop drinking. I’ll send you home.”\nCatherine took away his beer bottle."
      }
    ]
  },
  {
    "title": "Chapter 995 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Home?”"
      },
      {
        "paragraph": "Liam laughed in a low voice with a flushed face, and there were tears in his eyes. “Where is my home? I\ndon’t have a home.”"
      },
      {
        "paragraph": "The Hill family did not let him go back, and in the Campos family, Mason already had a wife and son."
      },
      {
        "paragraph": "Wherever he went, he was an unnecessary person. “Let’s find a hotel for him to stay in first.”"
      },
      {
        "paragraph": "Wesley helped Liam into the car, and Liam threw up, causing the car to smell bad."
      },
      {
        "paragraph": "Cathy hurriedly opened the window with an embarrassed expression. After all, this was Wesley’s car.\n“Wesley, I’m sorry…”"
      },
      {
        "paragraph": "“Don’t be silly. You’re my wife. What are you saying sorry for?” Wesley gave her a strange look. “ To be\nhonest, Liam helped me help you before, so I have a good impression of him.”"
      },
      {
        "paragraph": "Catherine was surprised. “I heard Freya talk about the Hill family. Do you think Liam— ”"
      },
      {
        "paragraph": "“There are some rumors that shouldn’t be listened to. Whether or not Liam stole the data, you have to\ntalk to him and understand him before you can judge,” Wesley interrupted her and said gently, “No matter\nwhat, he’s still Suzie’s father in name. We shouldn’t turn our backs on him.”"
      },
      {
        "paragraph": "Catherine was touched. She did not expect that after such an incident, Wesley would still be so open-\nminded and wise. He even considered Suzie."
      },
      {
        "paragraph": "She really wanted to work on this marriage with Wesley, but unfortunately… the incident on their wedding\nday had made it impossible."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "After sending Liam to a nearby five -star hotel, she quickly left with Wesley."
      },
      {
        "paragraph": "She decided to look for him again tomorrow after he sobered up. She had to talk to him about Suzie as\nsoon as possible. She missed Suzie very much and wanted to see her."
      },
      {
        "paragraph": "By the time Wesley drove them back to the Yules’ residence, it was already 9:00 p.m."
      },
      {
        "paragraph": "Joel asked the kitchen to reheat the food for the two of them to eat. After eating, he said, “ It’s getting\nlate. Wesley, just stay here for the night.”"
      },
      {
        "paragraph": "Catherine’s body froze and she subconsciously wanted to refuse."
      },
      {
        "paragraph": "“Okay, I’ll be troubling you then, Dad.” Wesley smiled softly."
      },
      {
        "paragraph": "“No problem. We’re family, after all.” Joel was quite satisfied with Wesley as the man was handsome and\npromising."
      },
      {
        "paragraph": "Even after Golden Corporation became the leading pharmaceutical company, he did not become\narrogant. It was a quality that many wealthy aristocrats did not have."
      },
      {
        "paragraph": "When his daughter was kidnapped by Shaun, Wesley did not care about work and looked all over for her.\nHe did not despise her at all when she was found."
      },
      {
        "paragraph": "He did not want his daughter to miss out on this person."
      },
      {
        "paragraph": "Catherine was instantly silent. When they finished eating and Joel went upstairs, she hesitantly looked at\nWesley. “Wesley, I’m sorry. I want to sleep with Lucas tonight. I haven’t been with him for a long time.”"
      },
      {
        "paragraph": "“Okay, I can understand. I’ll sleep in the guest room.” Wesley nodded."
      },
      {
        "paragraph": "Catherine bit her lip and finally made up her mind to say, “Wesley, let’s… find a time to get divorced.”"
      },
      {
        "paragraph": "Wesley’s gentle and elegant face immediately became ugly. “Cathy, is it because… you still can’t forget\nabout Shaun?”"
      },
      {
        "paragraph": "“No.” Catherine smiled bitterly and shook her head calmly. “Wesley, I don’t want to lie to you. When I was\ntaken captive by Shaun, we… did it. He wanted me to conceive his child so that I wouldn’t leave, but I\nhad my period and he didn’t succeed."
      },
      {
        "paragraph": "“I know I’ve let you down. I don’t deserve you, and your family won’t approve of me either. You’ll also be\nlaughed at by the outside world. You deserve better.”"
      }
    ]
  },
  {
    "title": "Chapter 996 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Wesley lowered his head and gently took a sip of tea, hiding the dark glint in his eyes."
      },
      {
        "paragraph": "When he looked up again, his eyes were soft and distressed. “Cathy, let me ask you. Did you voluntarily\nhave sex with him?”"
      },
      {
        "paragraph": "“Of course not.” Catherine immediately denied it."
      },
      {
        "paragraph": "“Then that’s that.” Wesley gently held her hand. “Cathy, I read something before. If your wife gets\nkidnapped by gangsters, as a man, do you want"
      },
      {
        "paragraph": "your wife to resist with her life or obey to save her life? If it were me, I would choose the latter."
      },
      {
        "paragraph": "Nothing is more important to me than my wife’s safety and life.”"
      },
      {
        "paragraph": "“Wesley…” Catherine’s heart trembled, and her eyes could not help but become red."
      },
      {
        "paragraph": "“I’m not the type to get hung up about a woman’s first time. I already knew it when I chose to marry you.”\nWesley continued, “The day of the wedding, you were taken away by Shaun. Why would I blame you? I\ncan only blame myself for being a powerless husband. I didn’t even dare to call the police for the"
      },
      {
        "paragraph": "sake of my family’s safety. In fact, I’ve been uneasy these days because I’m afraid that you’ll despise m y\nincompetence after coming back.”"
      },
      {
        "paragraph": "“No.” Catherine shook her head. “I can understand you. If it were me, I would probably do the same. It’s\nShaun who’s too despicable.”"
      },
      {
        "paragraph": "“Yes, he’s despicable and forced you. He thought that even if I saved you, I’d definitely despise you, but\nhe underestimated me. My love for you trumps over everything else. I could accept your children back\nthen, and this time, just getting you back is enough for me.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Pain welled up in Wesley’s eyes. “Cathy, why is it so hard for us to be together? After so many twists and\nturns, I waited and waited before finally getting you to agree to marry me. But you got involved in another\nincident. If you really feel guilty, then make it up to me in the future.”"
      },
      {
        "paragraph": "Catherine’s heart was moved the more she listened."
      },
      {
        "paragraph": "On the way back earlier, she had decided to separate from Wesley, but after hearing his words, she was\nshaken again."
      },
      {
        "paragraph": "Wesley had such deep feelings for her that if she left him, it would hurt him. At the same time, Shaun’s\nplans would succeed."
      },
      {
        "paragraph": "“Stop thinking about it.” Wesley hugged her gently. “I won’t sleep here tonight. You just came back, so\nmaybe your mind is in a mess now. Rest well these few days and handle Hudson Corporation’s affairs.\nI’ll pick you up in two days and then we’ll go back to our villa.”"
      },
      {
        "paragraph": "“…Okay.”"
      },
      {
        "paragraph": "Catherine eventually nodded. She breathed a sigh of relief that Wesley would be leaving tonight. She\nwas grateful for his kindness and understanding in not forcing her."
      },
      {
        "paragraph": "To be honest, she had just slept with Shaun the day before yesterday. If she slept with Wesley tonight,\neven if it was just lying on the same bed, she would feel very awkward and uncomfortable."
      },
      {
        "paragraph": "After his car left the Yule family’s villa…"
      },
      {
        "paragraph": "Wesley’s warm and elegant expression was gradually replaced by gloomy indifference."
      },
      {
        "paragraph": "Catherine wanted to divorce him. Hah, how could he easily agree?"
      },
      {
        "paragraph": "Besides, he did not believe that she had not been willing. When Shaun sent the video, her voice\nsounded so charming. It did not sound as if she was unwilling at all."
      },
      {
        "paragraph": "He would slowly pay her back for this shame."
      },
      {
        "paragraph": "After returning to the villa, Regina Trent, who was wearing a rose-colored nightdress, seductively\nwrapped her arms around him. “President Lyons, I thought you wouldn’t come back anymore.”"
      },
      {
        "paragraph": "“Where would I go if I don’ t come back? ” Wesley glanced at the woman’s charming and enchanting\nfigure. Although she did not have Catherine’s temperament, at least this woman was obedient to him and\ntried every possible way to please him. It gave him great satisfaction."
      },
      {
        "paragraph": "“Miss Jones is back…” Regina leaned on his shoulder and caressed his chest coquettishly. “I was\nworried that you would accompany her. After all, she’s your wife in name, but…”"
      },
      {
        "paragraph": "“But what?” Wesley narrowed his eyes."
      }
    ]
  },
  {
    "title": "Chapter 997 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Regina pretended to be scared and said in a low voice, “But the people in the company are all wondering\nif she’s pregnant with Shaun’s child after disappearing for so long.”"
      },
      {
        "paragraph": "Wesley’s dark eyes instantly filled with a bloodthirsty chill. He squeezed Regina’s chin hard, and his\nelegant face became slightly sinister. “ Regina, I didn’t expect you would play mind games with me.”"
      },
      {
        "paragraph": "Regina was frightened and shuddered. “P-President Lyons, I’m… I’m telling the truth.”"
      },
      {
        "paragraph": "“It is the truth, but the nature of it is different since you’re deliberately telling me this, ” Wesley sneered\nsharply."
      },
      {
        "paragraph": "Regina’s face turned pale. She did not expect the rational Wesley to have eyes like the devil’s now."
      },
      {
        "paragraph": "However, it was not surprising. Other people did not know this, but as his secretary, she knew that he\nworked closely with Campos Corporation. He was a s unfathomable as Mason Campos."
      },
      {
        "paragraph": "“Be good and do what you’re told. Don’t try playing tricks with me.” Wesley gently patted her face. “ If you\nknow your place, I might give you the chance to conceive a child. Although you’ll never be able to sit in\nthe position of Mrs. Lyons, I’ll give you everything you need in life.”"
      },
      {
        "paragraph": "“…Thank you, President Lyons.” Regina was overjoyed."
      },
      {
        "paragraph": "She did not care about the position of Mrs. Lyons. What she cared about were Wesley and his power."
      },
      {
        "paragraph": "“Then serve me well tonight.”"
      },
      {
        "paragraph": "Wesley directly picked her up and went upstairs."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "He was full of rage. When he thought about Catherine’s appearance upon seeing her at the island today,\nthe jealousy in his heart had almost destroyed him. However, he could only endure it and put on the\nappearance of a modest gentleman. Now that he did not have to hide his true colors anymore, he let it all\nout."
      },
      {
        "paragraph": "After it was over, Regina was curled up on the other side of the bed like a deflated balloon. Tonight,\nWesley was as terrible as he had been on his wedding night. She felt like she was merely a tool for him\nto vent on."
      },
      {
        "paragraph": "However, when she saw the man lean against the headboard smoking, his charming figure made her\nbreathing hitch."
      },
      {
        "paragraph": "“Wesley…” She acted coquettishly and snuggled up to him."
      },
      {
        "paragraph": "Wesley did not push her away and looked down at her. “Move out tomorrow and get someone to clean\nthis place. Catherine will be moving here in two days.”"
      },
      {
        "paragraph": "“Okay.” Regina was a little smug. She did not expect that Wesley would let Catherine live in this villa."
      },
      {
        "paragraph": "For the past month, she had been making love with Wesley here every day."
      },
      {
        "paragraph": "‘Hah, in the end, the great Catherine Jones will be sleeping with the man I slept with and in the bed I\nslept in.’ In a five-star hotel."
      },
      {
        "paragraph": "Liam woke up dizzy with a hangover and remembered that he had been drinking at a bar last night. Who\nsent him here?"
      },
      {
        "paragraph": "Just as he was about to take out his phone, the door to his room was violently kicked open."
      },
      {
        "paragraph": "Chance barged in with two people. “Second Young Master, the eldest young master wants to see you.”"
      },
      {
        "paragraph": "Liam looked at their stance and his handsome face darkened. He sneered, “If I go, will I be able to come\nback in one piece?”"
      }
    ]
  },
  {
    "title": "Chapter 998 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Chance calmly looked at him. “If you don’t go, there’s no chance for you to be in one piece.”"
      },
      {
        "paragraph": "Liam gave a bitter laugh."
      },
      {
        "paragraph": "Fine. Shaun would not let the matter go. He already knew that."
      },
      {
        "paragraph": "Anyway, he wanted to find a chance to talk with Shaun too. He did not want to have the label of a\nbetrayer tacked onto him for the rest of his life."
      },
      {
        "paragraph": "Soon, Chance brought him into the hall in Liona where memorial tablets of the Hill family’s elders were\nplaced."
      },
      {
        "paragraph": "Shaun sat on the chair by the side. His handsome face was indifferent, and his true emotions could not\nbe seen at all."
      },
      {
        "paragraph": "“Eldest Young Master Hill, I’ve brought him over.” Chance kicked Liam’s ankle hard."
      },
      {
        "paragraph": "Liam was caught off guard and fell to his knees. He tried to get up, but Chance forcefully pressed him\ndown."
      },
      {
        "paragraph": "He gritted his teeth and stared defiantly at Shaun. “ I didn’t do anything wrong, nor did I betray the\ncompany. Shaun, you must’ve realized that I haven’ t gone to Campos Corporation at all these days. I’ve\nalready cut ties with my dad.”"
      },
      {
        "paragraph": "“You’ve already cut ties with him but you’re still calling him your dad. You haven’t gone over only\nbecause you feel uncomfortable at the fact that Mason Campos has an illegitimate child and another\nwoman. You feel as if you’ve been deceived by him, right?” Shaun walked up to him, speaking i n a low\nand cold voice."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Liam was indignant. “Stop jumping to your own conclusions. I knew that my dad had an illegitimate child\na while ago. Yes, I was tempted to make a move against the Hill family because I’ve always resented\nhow I was being suppressed, but after I learned that he has an illegitimate child, I gave up the idea of\nbetraying Hill Corporation. You might not know this, but my dad… He doesn’t really care about me. Even\nif I go to the Campos family, I’d just be an outsider. I also hate that Mason Campos betrayed my mom. I\ndespise him.”"
      },
      {
        "paragraph": "“ If he doesn’t care about you, why did he come to bail you out after you were sent to the police station\nby me?” Shaun sneered, “Right, he also made a public declaration that you’ve changed your last name.\nI’ll have to call you Liam Campos in the future.”"
      },
      {
        "paragraph": "“That’s his ploy to sow discord between the Hill family and me, ” Liam explained with a growl. “He’s a\nsinister man.”"
      },
      {
        "paragraph": "“I know he’s a sinister man. I know even without you telling me.” Shaun mercilessly stepped on his back."
      },
      {
        "paragraph": "Liam was suddenly being trampled on the ground. His eyes were red and he clenched his fist with\nresentment, hammering it on the ground. “I didn’t do it! Shaun, why won’t you believe me? I’ve always\ndared to admit to the things I’ve done.”"
      },
      {
        "paragraph": "“I want to believe you too.” Shaun’s heart inexplicably seized when he saw Liam’s expression."
      },
      {
        "paragraph": "He had always thought he hated Liam’s existence, but for some reason, when he saw Liam like this, he\nfelt inexplicably annoyed."
      },
      {
        "paragraph": "Maybe he did not hate Liam as much. The grievances between their elders had nothing to do with them.\nAfter all, they could not choose their families."
      },
      {
        "paragraph": "Originally, he wanted to give Liam the position of president of Hill Corporation in a few years. After all, he\nwas Lea’s son. Even though they had different fathers, they were brothers who had the same mother."
      },
      {
        "paragraph": "“Liam, I checked the laboratory’s monitoring system. I had wanted to clear your name as well, but the\ntime when the data was deleted is about the same time as when you entered the laboratory. If you say\nthat it wasn’t you, who else could it be?” Shaun pressed his foot down harder. His voice was filled with\ndisappointment and anger. “Can you face our ancestors? It took the Hill family more than a hundred\nyears to get to where we are now, but thanks to you, it’s now completely destroyed.”"
      },
      {
        "paragraph": "“How… How…” Liam was at a loss."
      },
      {
        "paragraph": "The time the data was deleted was surprisingly the same time as when he entered the lab."
      },
      {
        "paragraph": "It had clearly been deliberately arranged by someone."
      },
      {
        "paragraph": "However, the person who deleted the data worked for Mason. Why was Mason framing him like this? He\nwas innocent. He was Mason’s son!"
      },
      {
        "paragraph": "Tears of despair streamed down his cheeks."
      },
      {
        "paragraph": "“Yes, how? I want to know why our Hill family has become like this today as well.” Shaun laughed with\ngreat sadness. “I spent so much money to develop"
      },
      {
        "paragraph": "the microchip, but you gave it to others. Never mind being the number one family in the country… Now,\nHill Corporation has fallen out of the top loo enterprises in Australia. We no longer have any liquid\nassets. All this is thanks to you. Liam, I want to kill you, do you know that? Grandma hates you, Grandpa\nhates you, everyone in the Hill family hates you. You’re the same as the Campos family. You’re all a\nbunch of ingrates."
      },
      {
        "paragraph": "“If you were jealous of me and hated me, you could’ve competed with me fairly. Why did you use such\ndespicable means?”"
      }
    ]
  },
  {
    "title": "Chapter 999 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "The more Shaun spoke, the angrier he became. He suddenly pulled Liam up and punched him\nmercilessly."
      },
      {
        "paragraph": "Liam had a hangover and was no match for Shaun at all. Coupled with the mental blows he had been\ndealt, his whole person became muddle-headed."
      },
      {
        "paragraph": "He was beaten by Shaun until he spat out blood."
      },
      {
        "paragraph": "He lay on the ground and started to laugh. He laughed so hard that tears welled up in his eyes."
      },
      {
        "paragraph": "What… had he done wrong?"
      },
      {
        "paragraph": "He had not done anything. Why was everyone blaming him?"
      },
      {
        "paragraph": "“Hit me, Shaun. Beat me to death if you can!” Liam roared at him with red eyes."
      },
      {
        "paragraph": "“I won’t beat you to death, but I want to make you unable to take over Campos Corporation for the rest of\nyour life. Mason Campos is a vicious man. Do you think he’ll want a crippled son?”"
      },
      {
        "paragraph": "Shaun picked up an iron pipe and hit Liam’s leg hard."
      },
      {
        "paragraph": "Liam heard the crack that came from the joints in his leg. His eyes widened and he fell to the ground\nimmediately. Holding his leg, he curled up into a ball. He almost fainted from the pain."
      },
      {
        "paragraph": "Shaun looked down at him. His hand that was holding the iron pipe was slightly shaking. After struggling\nfor a long time, he turned his head to Chance and said, “Throw him out. I never want to see this person\nin my life again.”"
      },
      {
        "paragraph": "Chance glanced at him, and the members of Liona dragged Liam out."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Liam glared at him the whole time with reddened eyes. His gaze was hidden with deadly hatred."
      },
      {
        "paragraph": "After he left, the hall was so quiet that even the sound of a pin falling to the ground could be heard."
      },
      {
        "paragraph": "The members of Liona had just seen the two brothers of the Hill family fight. None of them dared to\nbreathe too loudly."
      },
      {
        "paragraph": "Then, the phone that Liam had dropped to the ground suddenly rang."
      },
      {
        "paragraph": "Shaun bent down to pick it up and saw the word ‘ Cathy’ on the screen."
      },
      {
        "paragraph": "His throat bobbed. The phone rang for more than ten seconds before he answered it."
      },
      {
        "paragraph": "“Hey, Liam. Are you awake yet? I’ll reach your hotel in around ten more minutes.” Catherine’s voice was\nheard."
      },
      {
        "paragraph": "Shaun’s heart felt bitter. After coming back, she would rather keep in contact with Liam but never thought\nabout contacting him."
      },
      {
        "paragraph": "“Liam, why aren’t you talking? Are you still drunk? I want to ask you about Su— ”"
      },
      {
        "paragraph": "“Liam isn’t here, ” Shaun interrupted her gruffly. Catherine was shocked. It was Shaun’s voice."
      },
      {
        "paragraph": "She had almost revealed Suzie’s identity."
      },
      {
        "paragraph": "“Why is Liam’s phone with you?” She suddenly remembered that the Hill family thought that Liam was a\nthief and had a bad feeling in her heart. “ What did you do to Liam?”"
      },
      {
        "paragraph": "Shaun said in a low voice, “He’s the traitor who ruined Hill Corporation. What do you think I did to him?”"
      }
    ]
  }
]