[

  {
    "title": "Chapter 1600 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Because… Because when you signed the contract with Felix Media, there was a clause that all your\nbusiness and film contracts have to be approved by the company. If you break the contract, you’ll have\nto pay compensation.”"
      },
      {
        "paragraph": "The manager said bitterly, “Young Master Jewell was so strongly promoting you before, so this rule\nnever applied to you. What on earth did you do to piss him off?”"
      },
      {
        "paragraph": "“L-Let me calm down first.” Cindy hung up the phone as her eyes reddened."
      },
      {
        "paragraph": "Mrs. Jewell hurriedly asked, “What happened?”"
      },
      {
        "paragraph": "“Chester stopped all of my work. Ms. Jones got a Hollywood director to cooperate with me, but the\ncompany refused to let me take the role and scared the director away.”"
      },
      {
        "paragraph": "Cindy wept bitterly. “It must be because I told you about the Costner family. But I only did it for his own\ngood.”"
      },
      {
        "paragraph": "“Chester is too foolish. Don’t worry, I’ll help you with this matter.”"
      },
      {
        "paragraph": "Right after Mrs. Jewell finished speaking, Michael’s car drove in from outside."
      },
      {
        "paragraph": "He got out of the car angrily and slammed the door. “That b*stard Chester actually fired Dean Reid."
      },
      {
        "paragraph": "He’s basically slapping me in the face.”"
      },
      {
        "paragraph": "“Dean Reid? Who’s that?” Mrs. Jewell was puzzled."
      },
      {
        "paragraph": "“He’s the one who took in the Costner family’s bodyguards. I was the one who talked to Dean Reid, but\nI didn’t expect Chester to fire him without a word. The reason Chester gave was that Dean Reid didn’t"
      },
      {
        "paragraph": "listen to him. Isn’t that the same as slapping my face?” Michael was completely infuriated. “He’s not\nshowing me any respect at all.”"
      },
      {
        "paragraph": "Cindy’s face paled slightly. She did not expect Chester to be so cruel."
      },
      {
        "paragraph": "He did not call her or scold her, but he quietly gave a vicious lesson to those who helped her."
      },
      {
        "paragraph": "“That’s outrageous. Call him and tell him to come back. How can he do this to our family?”"
      },
      {
        "paragraph": "Mrs. Jewell called Chester’s phone, but nobody answered."
      },
      {
        "paragraph": "She was furious and called Chester’s assistant instead. “Tell Chester that I’m not feeling well and"
      },
      {
        "paragraph": "tell him to come home at once. Otherwise, he might see my corpse instead.”"
      },
      {
        "paragraph": "When it got dark."
      },
      {
        "paragraph": "Chester leisurely returned to the Jewell family."
      },
      {
        "paragraph": "As soon as he entered the door, Michael picked up a cup and flung it at Chester."
      },
      {
        "paragraph": "Chester raised a hand to catch it as a lazy smile spread on his handsome face. “Tsk, tsk. Dad, you’re\nreally old now. Even when you throw a cup, it’s powerless.”"
      },
      {
        "paragraph": "“You…”"
      },
      {
        "paragraph": "Michael glared at him in anger."
      },
      {
        "paragraph": "He was powerless? He clearly wanted to smash it on Chester."
      },
      {
        "paragraph": "He was so angry that he picked up the remaining cups and threw them at Chester."
      },
      {
        "paragraph": "Chester avoided the cups with his hands in his pockets. None of the cups hit him, but Michael was\nalready panting from the exertion."
      },
      {
        "paragraph": "“Dad, your physical strength really isn’t good. You should stay at home and do some exercise. Spend\nmore time with Mom or something.” Chester sat down on the sofa as spoke, pulling out a cigarette. His\narrogant attitude made Michael want to punch him."
      },
      {
        "paragraph": "However, there was nothing on the table that he could throw anymore."
      },
      {
        "paragraph": "He admitted that his son was very agile. Even if he continued to throw things at Chester, it would just\nbe a waste of energy."
      },
      {
        "paragraph": "“Chester, you’ve gone too far.” Mrs. Jewell looked at her son angrily. “He’s still your dad. You’re too\ndisrespectful to him. As for Cindy, she’s your future wife. Everything she does is for your own good.”"
      },
      {
        "paragraph": "“Dad, you didn’t respect me as well. I had just given out the order to the hospital, but you immediately\njumped out and slapped me in the face. How will I have any dignity left in Jewell Corporation in the\nfuture?”"
      }
    ]
  },
  {
    "title": "Chapter 1601 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Chester gently exhaled a mouthful of smoke, and his voice gradually turned cold. “ It’s not like you don’t\nknow what kind of person I am. I hate people disobeying my orders the most. My father is no exception.\nThere can only be one voice in a company. Only then will the company be able to go further.”"
      },
      {
        "paragraph": "“Bullsh*t. The Jewell family’s ancestors were the ones who laid down the foundation for the company,\nand I was the one who left the company to you. If it weren’t because you were lucky enough to be born\nin this family, would Jewell Corporation b e yours?” Michael said with a cold voice."
      },
      {
        "paragraph": "Chester did not get angry and said calmly, “Do I have to mention just what kind of state Jewell\nCorporation was in when I took over? When it was in your hands, the Jewell family’s position in\nCanberra was ranked in the tens.”"
      },
      {
        "paragraph": "“Yes, the Jewell family can’ t be considered a rich family in the country, nor is it comparable to a large\nmountain like the Snow family. However, the people inside the company know clearly just how much\nJewell Corporation makes and earns. It’s just that I’m suppressing the people below and not letting\nthem show off, but you should know better than anyone.”"
      },
      {
        "paragraph": "Michael scoffed. “But that doesn’t erase the fact that it was me who gave you the company. You had a\nbigger advantage compared to others."
      },
      {
        "paragraph": "Furthermore, I’m your father. You’re simply being unfilial.”"
      },
      {
        "paragraph": "“Dad, you have to learn how to be content. If it weren’t for me, you wouldn’t be living such a\ncomfortable life right now. Everywhere you go, people respectfully greet you as Chairman Jewell, and\neven President Snow is polite to you. You have all of that because I earned them for you.”"
      },
      {
        "paragraph": "Chester leisurely crossed his long legs. “Also, I want to remind you that the Jewell family’s position in\nthe entertainment circle is all thanks to my effort. It has nothing to do with you.”"
      },
      {
        "paragraph": "“You…”"
      },
      {
        "paragraph": "Chester raised a finger. “After sitting in a high position for a long time, I only want to hear my own voice.\nIf an unnecessary voice tries to criticize or give orders, even if that voice belongs to my own father, I\ncan tolerate it once… but I’ll be fed up with it if it happens twice.”"
      },
      {
        "paragraph": "His voice was cold. Coupled with that handsome and gentle face, it made people shiver when they\nlooked at him. Even Michael and his wife felt a chill running down their spine, much less Cindy."
      },
      {
        "paragraph": "“As for how unfilial I am…”"
      },
      {
        "paragraph": "Chester’s eyes rested on Cindy’s face as undisguised disgust flashed in his eyes. “Mom, look at that\nwoman beside you. In terms of looks, can she compare to Shaun or Rodney’s wives?"
      },
      {
        "paragraph": "“To be honest, her looks aren’t good enough for me. As for her character, she plagiarizes, copies\nothers, isn’t a virgin, and has a bunch of other problems. I feel revolted just looking at her, but for the\nsake of getting you a mobile blood bank, I endured it. I was even willing to sacrifice my own happiness,\nbut you call me unfilial. I feel very unhappy about that.”"
      },
      {
        "paragraph": "Mrs. Jewell was stunned."
      },
      {
        "paragraph": "Cindy was also extremely embarrassed."
      },
      {
        "paragraph": "Chester had snubbed her in front of his parents. Her face went from blue to white, and she finally cried\nout in anger, “Chester, how can you say that about me? I know that you’re angry about today, but I— ”"
      },
      {
        "paragraph": "“Do you know what I loathe the most about you?”"
      },
      {
        "paragraph": "Chester slowly stood up, his tall body instantly exuding an oppressive aura."
      },
      {
        "paragraph": "“What I hate most is how you always turn a deaf ear to my words.”"
      },
      {
        "paragraph": "Chester’s dark eyes were like ice. “I warned you that I didn’t like Rebecca, but you still continued to\nkeep in contact with her— ”"
      },
      {
        "paragraph": "“ Son, Rebecca’s identity isn’t ordinary. She’s the Costner family’s daughter,” Mrs. Jewell said."
      },
      {
        "paragraph": "“So what? Am I a person who plays up to those in power like you?”"
      },
      {
        "paragraph": "“Insolent! How dare you mock your parents! ” Michael could not stand it any longer."
      },
      {
        "paragraph": "However, Chester snapped his fingers as if he did not hear him."
      },
      {
        "paragraph": "A group of bodyguards immediately rushed in."
      },
      {
        "paragraph": "This made Michael and the others uneasy. “ Chester, what are you doing?”"
      },
      {
        "paragraph": "“You’re my dad. What can I do to you?” Chester smiled indifferently and jerked his chin at the leader of\nthe bodyguards."
      },
      {
        "paragraph": "The bodyguards came over and immediately dragged Cindy down from the chair."
      },
      {
        "paragraph": "She was wearing a skirt, so when she fell to the floor, her skirt rode up and revealed her snow- white\nlegs."
      }
    ]
  },
  {
    "title": "Chapter 1602 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "There were many men in the room, so Cindy was frightened. She hurriedly covered her legs and\nscreamed. “You can’t do this to me. Chester, let me go! I won’t dare to do it again! ”"
      },
      {
        "paragraph": "“I’ve heard you say those words many times already, but every time I scold you, you turn around and\nforget about it. Maybe I look too easy to fool. ”"
      },
      {
        "paragraph": "Chester did not even look at her. He waved his hand. “Throw her into the pool.”"
      },
      {
        "paragraph": "Soon, Cindy was dragged out."
      },
      {
        "paragraph": "Mrs. Jewell panicked. “Chester, what are you doing? If anything happens to her, what about my blood?\nDo you want me to die too?”"
      },
      {
        "paragraph": "“You beast, stop this right now! ” Michael blocked them furiously."
      },
      {
        "paragraph": "“Go outside and watch. It’ll be fun.”"
      },
      {
        "paragraph": "Chester smiled and walked out with his long legs."
      },
      {
        "paragraph": "Cindy was thrown into the swimming pool. She tried to climb out, but her head was pressed down"
      },
      {
        "paragraph": "again, making her choke several times."
      },
      {
        "paragraph": "Mrs. Jewell’s heart chilled at the sight. Michael looked at his son, but all he saw was a pleasant smile\non his handsome face. It was as if he was watching an interesting show instead of his bodyguards\ntorturing Cindy."
      },
      {
        "paragraph": "It was his first time seeing this side of his son. A chill rose in his heart."
      },
      {
        "paragraph": "“Hurry up and stop. Stop it!” Mrs. Jewell was anxious. Her voice was almost hoarse from screaming."
      },
      {
        "paragraph": "“Mom, why are you so anxious? Even if she dies, I’ll save her last breath and drain all her blood and\nsave it for you.” Chester took another drag of his cigarette."
      },
      {
        "paragraph": "When his icy voice reached Cindy’s ears, she almost broke down."
      },
      {
        "paragraph": "She had completely underestimated Chester’s ruthlessness."
      },
      {
        "paragraph": "This man never had a heart. Her little tricks were useless against him. It was all a joke."
      },
      {
        "paragraph": "She was truly afraid. This man was the devil."
      },
      {
        "paragraph": "She was so stupid to have provoked this devil for Rebecca."
      },
      {
        "paragraph": "How ridiculous!"
      },
      {
        "paragraph": "She regretted it. If she could turn back time, she would never have chosen to help Rebecca."
      },
      {
        "paragraph": "After offending Chester, she would not even be able to enjoy her life, much less find international fame."
      },
      {
        "paragraph": "She felt like she was on death’s door. Finally, she could not take it anymore and passed out."
      },
      {
        "paragraph": "The bodyguard then dragged her out of the water."
      },
      {
        "paragraph": "Chester looked at her in disgust. “Get the doctor to wake her up and lock her in the room upstairs for\nhalf a month before releasing her. I don’t want to see an eyesore like her anymore.”"
      },
      {
        "paragraph": "Then, he turned around and looked at his parents. “"
      },
      {
        "paragraph": "Mom, if you want to plead for her, then you can stay with her. However, after the door is locked, you\nwon’t be able to come out and look for me anymore.”"
      },
      {
        "paragraph": "After speaking, he left."
      },
      {
        "paragraph": "Mrs. Jewell looked at his cold back and felt her legs go weak."
      },
      {
        "paragraph": "Was this really the son she gave birth to? He was like a cold-blooded and ruthless devil."
      }
    ]
  },
  {
    "title": "Chapter 1603 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "At night."
      },
      {
        "paragraph": "Matthew lay in bed, his mind echoing with what Catherine had told him during the day."
      },
      {
        "paragraph": "She said that Jeffery and Sally were not good people. Sally pushed his grandmother down the stairs."
      },
      {
        "paragraph": "She also said that Rebecca was best at pretending to be weak and kind."
      },
      {
        "paragraph": "Matthew felt like his head was about to explode."
      },
      {
        "paragraph": "Why were there so many things going on in the Jones family? How annoying."
      },
      {
        "paragraph": "Logically, he should choose to believe Rebecca. After all, Rebecca was his sister."
      },
      {
        "paragraph": "However, Sheryl gave Rebecca hundreds of billions instead of her son. He was not jealous of Rebecca,\nbut he thought that Catherine was right. Sheryl had never given him that much money. How long had\nSheryl known Rebecca?"
      },
      {
        "paragraph": "It had only been less than three months."
      },
      {
        "paragraph": "Sheryl had always been a shrewd and prudent person. She was always very strict with him. Matthew\nwas not a fool, so he naturally sensed that Rebecca was not a simple person."
      },
      {
        "paragraph": "Maybe he could not completely convince himself of Catherine’s words, but at the very least, he\nbelieved that he had to be cautious of Rebecca."
      },
      {
        "paragraph": "Matthew suddenly sat up on his bed."
      },
      {
        "paragraph": "It seemed like he had to sneak back to Melbourne for another investigation."
      },
      {
        "paragraph": "He could not let Sheryl or Rebecca find out about this."
      },
      {
        "paragraph": "Otherwise, they would definitely be unhappy."
      },
      {
        "paragraph": "After having this idea, Matthew finished breakfast and left the Costner villa on the pretext of going to\nthe company."
      },
      {
        "paragraph": "He had to go to Melbourne."
      },
      {
        "paragraph": "He did not even tell Titus about this."
      },
      {
        "paragraph": "He only brought one of his men with him. Matthew first went to Summit’s old building."
      },
      {
        "paragraph": "However, Summit had been bought over by another company. It was a bigger renovation and\nconstruction company."
      },
      {
        "paragraph": "Matthew and his aide went in and pretended to look for the construction team. The person who\nreceived them was Joey from the sales department."
      },
      {
        "paragraph": "Joey saw that Matthew was young, but his clothes and watch were all brand names, so he tried his\nbest to please Matthew. “Mr. Costner, how big a villa do you want to renovate?”"
      },
      {
        "paragraph": "“Around 300 square feet. I don’t know which renovation company is good,” Matthew spoke with an\naccent. He looked around the show units on the left and right. “Your company is quite large. When I\nwas abroad, I heard that there was a good interior design company in Melbourne called Summit\nBuilding Design…”"
      },
      {
        "paragraph": "“That was years ago. Summit Design closed down long ago.” Joey smiled. “This building used to\nbelong to Summit, but our company bought it over.”"
      },
      {
        "paragraph": "“Really? ” Matthew pretended to be surprised. “I thought business was good for them. It was an\nestablished company, after all.”"
      }
    ]
  },
  {
    "title": "Chapter 1604 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“The boss was horrible.” Joey waved his hand. “He often cut corners, and his project manager even\nreplaced a customer’s wires from a reputable brand with low-quality wires from a random brand. It\ncaused the customer’s hotel to catch on fire. They even went to court because of it.”"
      },
      {
        "paragraph": "“No way, it was that blatant?” Matthew pretended to be surprised. “What happened next?”"
      },
      {
        "paragraph": "“The project manager went to jail after that. But everyone knows that the project manager is the\nnephew of the chairman’s wife, so Summit’s reputation was ruined. ” Joey shook his head while clicking\nhis tongue."
      },
      {
        "paragraph": "“In other words, Summit’s chairman isn’t a good man?” Matthew said deliberately."
      },
      {
        "paragraph": "“Not only was he not a good man, but he also went to jail later with his wife. I heard that they wanted to\nembezzle their sister company’s shares. They even changed the will left by the chairman’s mother. The\nchairman’s wife pushed her mother-in-law down the stairs as well. The mother-in-law died because of it\nand the couple went to jail.” Joey was quite gossipy while talking about these old stories."
      },
      {
        "paragraph": "Matthew was a little stunned. Jeffery and Sally had mentioned all these things before, but they said that\nit was Catherine who did it."
      },
      {
        "paragraph": "Joey was not an insider, so he only knew about the gossip. Matthew was not sure who was right and\nwho was wrong."
      },
      {
        "paragraph": "“You know quite a lot.” Matthew looked at Joey meaningfully."
      },
      {
        "paragraph": "“Hehe, I’ve worked as an interior designer in Melbourne for almost six years, so that’s natural.”"
      },
      {
        "paragraph": "Right after Joey finished speaking, he saw Matthew take out a wad of cash from his pocket and put it\non the table. “Tell me more and this money is yours.”"
      },
      {
        "paragraph": "Joey was stunned. Only then did he realize that this man was not really here to renovate his house but\nto ask about the Jones family."
      },
      {
        "paragraph": "He would be a fool not to earn money."
      },
      {
        "paragraph": "“I want to hear the truth. Just tell me everything that you know. The money is all yours.” Matthew\ngestured with his chin."
      },
      {
        "paragraph": "Joey sighed in relief. Since he could get all the money, there was no need to make up extra stories."
      },
      {
        "paragraph": "“What do you want to know?”"
      },
      {
        "paragraph": "“About the Jones family. Such as… Rebecca Jones, or Catherine Jones. Do you know who Rebecca\nused to date?”"
      },
      {
        "paragraph": "Joey paused. “Now that you mention it, I think I remember. The incident was quite humiliating."
      },
      {
        "paragraph": "Back then, Rebecca’s boyfriend was from the Lowe family. The Lowe family was pretty reputable, but\non the day of the engagement, Catherine made a fuss and said that the guy was actually her boyfriend\nand Rebecca snatched him away. The engagement party became a joke in the city.”"
      },
      {
        "paragraph": "Matthew narrowed his eyes. “Was it true?”"
      },
      {
        "paragraph": "“ I think so. I wasn’t there, but I heard people talk about it. After that, Young Master Lowe was removed\nfrom his position in the company. Not long after, the Jones family took the initiative to break off the\nengagement with him and quickly distanced themselves from Young Master Lowe. It caused Young"
      },
      {
        "paragraph": "Master Lowe to curse Rebecca publicly on Facebook. Well, that’s the way it is. If I were Young Master\nLowe, I would be unhappy too. When I had money and power, that family tried to cling to me. But after I\nfell from my position of power, they quickly distanced themselves from me."
      },
      {
        "paragraph": "There are many people like that, but it’s still better to stay away from that kind of woman.”"
      },
      {
        "paragraph": "Matthew’s face darkened. In other words, Rebecca was someone who relied on powerful people to\nclimb up the social ladder."
      },
      {
        "paragraph": "“What else? Did Rebecca date anyone else later? ”"
      },
      {
        "paragraph": "Joey’s eyeballs shifted about as he said in a low voice, “ I’m not too sure, but previously when I was\nrenovating a villa, I overheard a few people who were talking over drinks. I seemed to vaguely hear that\nRebecca dated the young master of the Campbell family. However, a powerful person from Canberra\nappeared and Young Master Campbell ditched his girlfriend for that person. Hehe, one was willing to let\nhis girlfriend accompany another man, and the other was happy to accompany the other man too.\nApparently, there were many people who saw the video. They all said that Rebecca is a little sl*t.”"
      },
      {
        "paragraph": "Matthew crushed the paper cup in his hand, revealing his bulging blue veins."
      },
      {
        "paragraph": "Joey was frightened by his appearance. “These are all the things I heard. I don’t know if they’re true or\nnot.”"
      },
      {
        "paragraph": "“What about Catherine Jones?” Matthew asked. “Catherine? She used to be the chief designer of\nSummit but then she left. Have you seen that landmark, Culture and Technology Center? In order to\nget that project, the construction companies in Melbourne competed tooth and nail for it."
      },
      {
        "paragraph": "Catherine was exposed for plagiarizing Summit’s designer at the bidding site."
      },
      {
        "paragraph": "“Later, Catherine suffered a torrent of abuse and even came to our company to apply for a job, but our\nboss didn’t dare to take her in. He said that the Jones family had given orders saying that anyone who\ndared to accept her would be going against the Jones family. Summit was still quite powerful at that\ntime.”"
      }
    ]
  },
  {
    "title": "Chapter 1605 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Did she really plagiarize?” Matthew could not help but ask."
      },
      {
        "paragraph": "“I don’t know.”"
      },
      {
        "paragraph": "Joey lamented, “In any case, Catherine went to Talton Design and became quite a famous designer\nthere. However, she later left Melbourne. I’ve seen her designs, and they’re really quite good. Oh, by\nthe way, she’s quite famous now. Everyone knows who she is. She’s Shaun Hill’s ex-wife, and she’s\nalso the most famous architect in the country."
      },
      {
        "paragraph": "Could an incompetent person plagiarize their way to the top? Foreigners aren’t fools either.”"
      },
      {
        "paragraph": "“Okay, this money is yours.” Matthew nodded and got up to leave."
      },
      {
        "paragraph": "It was not until he got out of the building that he asked the assistant beside him, “You asked about\nRebecca and Catherine’s information here before. Why was the information you retrieved different from\nwhat Joey just said?”"
      },
      {
        "paragraph": "The assistant hurriedly explained, “I only asked the people around the old Jones residence. What they\nsaid matched what Ms. Rebecca said. Ms. Rebecca said that her reputation in Melbourne is bad\nbecause of what Catherine did, but I didn’t expect it to be this bad…”"
      },
      {
        "paragraph": "Matthew also did not expect it to be this bad."
      },
      {
        "paragraph": "Previously, he empathized with Rebecca and thought that she was the victim."
      },
      {
        "paragraph": "However, it was a fact that Summit closed down. Jeffery said that Catherine harmed Summit’s\nreputation which caused it to close down, but others in the industry said that it was because Summit cut\ncorners."
      },
      {
        "paragraph": "Not only that, but Rebecca also stole Catherine’s boyfriend."
      },
      {
        "paragraph": "Then, after the fiancé’s fall from grace, the Jones family hurriedly distanced themselves from him and\nbroke off the engagement."
      },
      {
        "paragraph": "After that, Rebecca had another boyfriend but slept with a young master who came from the capital."
      },
      {
        "paragraph": "Rebecca did that?"
      },
      {
        "paragraph": "For some reason, Mathew suddenly found it odd when he thought about Rebecca."
      },
      {
        "paragraph": "His assistant said, “Why don’t we look for Rebecca’s ex-fiancé?”"
      },
      {
        "paragraph": "“Catherine told me to ask Rebecca’s ex-boyfriends too. What if she did something behind the scenes?”\nMatthew had his suspicions."
      },
      {
        "paragraph": "“You don’t have to go to the person himself. You can just ask the people in his company. There should\nbe someone who knows about it.”"
      },
      {
        "paragraph": "Matthew nodded. “Go and find out who that Lowe guy is. We’ll go in the afternoon.”"
      },
      {
        "paragraph": "He sat in a cafe for a while, and it did not take long for his assistant to find something out. “Rebecca’s e\nx-fiancé was Ethan Lowe, the eldest son of the Lowe family. Chairman Lowe has two sons and another\nyoung son that was born out of wedlock. Lowe Corporation was passed on to his youngest son. As for\nEthan… he died in a car accident not long ago.”"
      },
      {
        "paragraph": "“He died?” Matthew was slightly stunned. “Okay. Let’s go to the Lowe family.”"
      },
      {
        "paragraph": "“We’re not familiar with the Lowe family. They won’t let us in,” the assistant muttered, “And it’s\nimpossible for a small company like Lowe Corporation to know of the Costner family’s reputation.”"
      },
      {
        "paragraph": "“ I’m not trying to meet the direct members of the family. I can just meet those who cleaned and cooked\nfor the family.”"
      },
      {
        "paragraph": "The assistant nodded."
      },
      {
        "paragraph": "More than 40 minutes later, the two of them appeared near the Lowe family’s villa."
      },
      {
        "paragraph": "Matthew waited in the car for half an hour before his assistant brought a woman in her 50s over."
      }
    ]
  },
  {
    "title": "Chapter 1606 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "However, the woman was suspicious and refused to get in the car."
      },
      {
        "paragraph": "Matthew opened the door and stepped out. When the woman saw his handsome face and how well-\ndressed he was, her vigilance reduced."
      },
      {
        "paragraph": "“Young Master, this is the lady who cooks for the Lowe family.” His assistant introduced her. “ I saw her\ngo out to buy groceries, so I called her over. She has been working for the Lowe family for five years.”"
      },
      {
        "paragraph": "“Aunty, don’t worry. I just want to ask about Ethan Lowe.” Matthew handed her a wad of cash."
      },
      {
        "paragraph": "“Why are you asking about him?” The woman breathed a sigh. “Eldest Young Master Lowe passed\naway a long time ago.”"
      },
      {
        "paragraph": "“I know. I heard that he had a fiancée called Rebecca Jones…”"
      },
      {
        "paragraph": "“Oh, her.” The woman’s expression was disdainful. “Yes, back then, she always came to the Lowe\nfamily. Anyone with a discerning eye could tell that"
      },
      {
        "paragraph": "she was interested in the eldest young master, but Old Master Lowe and Old Madam Lowe didn’t like\nher. After all, she was trafficked to the countryside before. How could her upbringing and temperament\ncompare to Catherine?”"
      },
      {
        "paragraph": "“Catherine?” Matthew became interested. “I heard that she dated Ethan before. Is that true?”"
      },
      {
        "paragraph": "The woman pursed her lips, not quite willing to say anything about it. “Why are you asking about all of\nthis? Eldest Young Master is no longer here.”"
      },
      {
        "paragraph": "“I just want to understand what the Jones sisters are like. I have no other intention.” Matthew\nexpressed his intention frankly."
      },
      {
        "paragraph": "“I see.” The woman nodded. “I didn’t want to talk about it because these matters aren’t actually\nhonorable to the young master. He’s already dead, so there’s no need to mention it. But since you want\nto know about the Jones family, I can tell you about them. The eldest young master was childhood\nsweethearts with Catherine and they got along quite well. When I cooked for the Lowe family, I often\nheard the old master talk about their marriage. Everyone was very happy about their marriage, but\neverything changed after Rebecca appeared."
      },
      {
        "paragraph": "“For some reason, Young Master Ethan started dating Rebecca and I often heard the Lowe family\nbadmouthing Catherine during mealtimes. They would talk about how bad she is and how she had\nchanged, but I think it was all fake.”"
      },
      {
        "paragraph": "Matthew’s heart thumped. “Why do you say that?”"
      },
      {
        "paragraph": "“I once heard Madam Lowe tell Young Master Ethan that the heir of the Jones family was Rebecca, so\nthere was no benefit in him marrying Catherine. Rebecca also just so happened to like him, so it was\nbetter for him to marry Rebecca.”"
      },
      {
        "paragraph": "“Then why didn’t they end up marrying?” Matthew asked deliberately."
      },
      {
        "paragraph": "“Sigh, it’s because Young Master Ethan seemed to have offended his uncle. His uncle is quite powerful.\nHe’s the chairman of a listed company. After the falling out, Old Master Lowe passed the succession to\nSecond Young Master. When the Jones family saw that Eldest Young Master had no more potential,\nthey proposed to break off the engagement. It was fine if they just broke it off, but they wanted to keep\ntheir reputation and deliberately let the media take photos of Eldest Young Master meeting privately\nwith Catherine, making it seem like the"
      },
      {
        "paragraph": "engagement was canceled because Eldest Young Master had an affair.”"
      },
      {
        "paragraph": "At this point, the aunty sneered disdainfully. “The Jones family aren’t good people. They deserved to go\nto jail. After all, they even pushed down their mother for the sake of money.”"
      },
      {
        "paragraph": "“That really happened?” Matthew asked in shock."
      },
      {
        "paragraph": "“The court already ruled that the evidence was conclusive. How can it be false? Besides, Old Madam\nJones had been living with her son and daughter-in-law since she fell ill. Who else could have done it?”"
      },
      {
        "paragraph": "“Thank you, Aunty. There’s one last thing I want to ask. Have you met Catherine before? What do you\nthink of her?”"
      },
      {
        "paragraph": "“She’s a pretty girl. Every time she came to the Lowe family, she would only say sweet things and she\nnever put on airs.” The aunty smiled."
      },
      {
        "paragraph": "“Thank you.” Matthew gave her a wad of money and got into the car."
      },
      {
        "paragraph": "The assistant drove the car and looked at the silent Matthew behind him from time to time. “Young\nMaster, were we tricked?”"
      },
      {
        "paragraph": "Matthew’s handsome face was extremely grim."
      },
      {
        "paragraph": "Not only had he been tricked, but he suspected that he had fallen into Rebecca, Jeffery, and Sally’s\ntrap."
      }
    ]
  },
  {
    "title": "Chapter 1607 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "The more Matthew dwelled on the matter, the more he fumed over it."
      },
      {
        "paragraph": "At this point, he refused to acknowledge the terrible Rebecca as his sister."
      },
      {
        "paragraph": "Hang on. Catherine’s claim that Rebecca was not his sister could be true."
      },
      {
        "paragraph": "How would a noble, handsome man like him have such a disgusting sister? Sheryl could not have\ngiven birth to a daughter of such character either."
      },
      {
        "paragraph": "Having said that, what about the DNA test results?"
      },
      {
        "paragraph": "Amid his confusion, the assistant slammed the brakes."
      },
      {
        "paragraph": "“Do you know how to drive?” Matthew lost his temper."
      },
      {
        "paragraph": "“I’m sorry, Young Master. An old lady came out of nowhere just now, and I almost hit her. Let me get off\nand take a look.” The assistant hurriedly unfastened his seat belt and got out of the car."
      },
      {
        "paragraph": "A gray-haired old lady was lying on the floor. The"
      },
      {
        "paragraph": "assistant promptly went to help her up. “Madam, are you okay…”"
      },
      {
        "paragraph": "Before he could finish his sentence, a knife gleamed and stabbed him in his chest."
      },
      {
        "paragraph": "With his back facing Matthew, the assistant’s mind went blank in an instant. He wanted Matthew to run\naway quickly, yet he could not utter any words."
      },
      {
        "paragraph": "“ Is everything alright?” Matthew got off, only to see his assistant bending over. After moving a few\nsteps closer to the assistant, he suddenly noticed some blood stains by the latter’s feet."
      },
      {
        "paragraph": "Suddenly, Matthew had a sense of foreboding. At this very instant, something flung at him from behind."
      },
      {
        "paragraph": "Matthew tilted his body to one side and shunned it. After that, he rapidly fled in the other direction."
      },
      {
        "paragraph": "However, two black cars sped and stopped him soon after. Subsequently, eight people leaped out of\nthe cars with knives in their hands."
      },
      {
        "paragraph": "Matthew was mobbed from all directions."
      },
      {
        "paragraph": "“Who are you guys?” Matthew’s expression was cold."
      },
      {
        "paragraph": "Despite having encountered a lot of danger since young, he always had his most astute bodyguard by\nhis side. It was his first time facing this kind of situation."
      },
      {
        "paragraph": "Instead of answering his question, that bunch of people directly attacked him."
      },
      {
        "paragraph": "Although Matthew was skillful, he did not have any weapons with him, after all. Considering that he was\nfacing so many people, there was nothing he could do. Soon, his body, legs, and arms were seriously\ninjured. In the end, he was defeated when someone sneakily knocked him unconscious from behind."
      },
      {
        "paragraph": "After he passed out, those people threw him into the car straight away, and the leader instantly dialed a\nnumber. “President Lyons, we’ve dealt with him.”"
      },
      {
        "paragraph": "“Hide right now. Don’t let anyone find you guys,” Wesley said flatly."
      },
      {
        "paragraph": "“Alright.”"
      },
      {
        "paragraph": "Once he hung up, Wesley swiftly called Rebecca. “"
      },
      {
        "paragraph": "Matthew has started suspecting you.”"
      },
      {
        "paragraph": "“What?” Rebecca was shocked. With a low voice, she said, “Catherine must have told him something.”"
      },
      {
        "paragraph": "“Matthew came to Melbourne today to find out about your matters. Quite a lot of people are aware of\nthe stupid things you did back then. Luckily, I prepared for it and planted a spy in Melbourne in\nadvance. I’ve just caught Matthew, and his assistant is dead.”"
      },
      {
        "paragraph": "Rebecca finally let out a sigh of relief. She enjoyed working with Wesley precisely because he was\nvicious. “President Lyons, you’re capable. But why are you keeping Matthew alive? It’s safer to kill him.\nIn that case, I can shift the blame onto Catherine and Shaun.”"
      },
      {
        "paragraph": "“ Sheryl may be muddle —headed due to the drug, but are you under the impression that Titus is\nstupid? He’s smart. If Sheryl’s condition persists, he’ll soon be aware of it, and you’re the first one he’ll\nsuspect. If both of us want a way out, we must keep Matthew with us to protect our lives,” Wesley\nreplied coldly."
      },
      {
        "paragraph": "Rebecca instantly grasped his point."
      },
      {
        "paragraph": "“But…” Wesley suddenly laughed. “Indeed, you can frame Catherine and Shaun regarding Matthew’s\ndisappearance. Sheryl is losing control, and Catherine is brutal. If Sheryl hurts anyone around\nCatherine, Catherine will hate her even though she’s her biological mother. Let’s leave the two of them\nto kill each other.”"
      },
      {
        "paragraph": "“You’re really brutal.” Rebecca tutted."
      },
      {
        "paragraph": "“So are you. Think of ways to squeeze Sheryl’s funds out in the shortest time possible, or better still,\nextract all the petroleum from Soromon Island. ” Wesley reminded her, “ Of course, before you can\nobtain all these, you need to make Sheryl feel as though everyone has abandoned her. Then, she’ll\nhave a blazing row with Titus.”"
      },
      {
        "paragraph": "“This is possible. Sheryl and Titus have already been sleeping in separate rooms. Matthew’s issue can\nadd fuel to it.”"
      },
      {
        "paragraph": "Soon, an idea sprang to Rebecca’s mind."
      }
    ]
  },
  {
    "title": "Chapter 1608 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "In the Hill family’s manor."
      },
      {
        "paragraph": "Catherine was wearing an apron, cooking some pork ribs in the kitchen."
      },
      {
        "paragraph": "Since Shaun did not go to work today, he accompanied the kids to complete some puzzles in the living\nroom."
      },
      {
        "paragraph": "“This is wrong. The wing is supposed to be here…” “You’ve put it in the wrong place, you dummy.”"
      },
      {
        "paragraph": "“Daddy, Lucas is bullying me again. He even called me a dummy.” Suzie pouted and complained to\nhim. “He’s just stupid. This piece should be right here.”"
      },
      {
        "paragraph": "Shaun’s head hurt in the face of his daughter’s grumble. Suzie did put it wrongly, but she had started\nweeping. Once she wept, she would be considered right about everything in the world. “ Okay, okay.\nYou’re right. You’re not a dummy. Let’s leave it here.”"
      },
      {
        "paragraph": "“Look. Even Daddy said I’m right.” Suzie instantly stopped crying and became smug about it."
      },
      {
        "paragraph": "Lucas was speechless. “This is boring. I don’t want to play with you guys, or it’ll lower my IQ.”"
      },
      {
        "paragraph": "“Pfft. I don’t want to play with you either. ” Suzie grimaced."
      },
      {
        "paragraph": "Shaun was at a loss for words."
      },
      {
        "paragraph": "When Catherine brought the pork ribs to the table, she caught a glimpse of Shaun’s conflicted look."
      },
      {
        "paragraph": "She chuckled before she waved and said, “Get ready for dinner.”"
      },
      {
        "paragraph": "“Yay! It’s finally time for dinner.” Having washed their hands of their own accord, Suzie took a pork rib\nand ate it with relish while Lucas peeled a crayfish."
      },
      {
        "paragraph": "After Shaun sat down, he had some pork ribs with his daughter."
      },
      {
        "paragraph": "Lucas glanced at him and subsequently turned to look at Suzie. All of a sudden, he said disdainfully, “ I\nfinally know whom Suzie takes after.”"
      },
      {
        "paragraph": "Catherine chuckled while Shaun was speechless. “ Suzie and I share similar tastes in terms of food. ”"
      },
      {
        "paragraph": "“Suzie, he’s looking down on you because of your IQ ” Lucas teased."
      },
      {
        "paragraph": "“No.” Shaun’s head began to hurt."
      },
      {
        "paragraph": "“Why didn’t you say Suzie takes after you in everything instead?” Lucas kept a cool face while trying to\nput Shaun into trouble."
      },
      {
        "paragraph": "Shaun did not know what to say."
      },
      {
        "paragraph": "Luckily, his phone rang at this moment, which saved him out of the two little devils’ clutches."
      },
      {
        "paragraph": "After seeing the incoming call notification, he hesitated for two seconds before he answered the call.\n“Second Uncle…”"
      },
      {
        "paragraph": "“Shaun, have you had dinner?” Spencer asked, “Are you available tonight?”"
      },
      {
        "paragraph": "“What’s the matter?”"
      },
      {
        "paragraph": "“Your aunt and I are going to bring Willie to Country Y to treat his illness, and we’re not sure when we’ll\nreturn. There’s something here that we’d like you to pass to your grandparents. I wanted to pass it to\nthem personally at first, but they’ve refused to meet me recently, ” Spencer said with a hoarse voice."
      },
      {
        "paragraph": "“What’s that? I’ll ask Hadley to collect it…”"
      },
      {
        "paragraph": "“It’s the Hill family’s heirloom that your grandpa gave me. You should pick it up yourself because it’s\nvery valuable, ” Spencer responded."
      },
      {
        "paragraph": "“Okay, I’ll come over in a while.” Shaun put down his phone."
      },
      {
        "paragraph": "“Where are you going?” Catherine asked."
      },
      {
        "paragraph": "“Second Uncle has asked me to go over to his place to collect something. You can stay at home with\nthe kids.”"
      },
      {
        "paragraph": "After finishing his dinner, Shaun stood up and left the house."
      }
    ]
  },
  {
    "title": "Chapter 1609 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Only after the sports car left Hill family’s manor did Shaun contact Elle. “Have some people secretly\nambush my second uncle’s house and act on signals later.”"
      },
      {
        "paragraph": "Elle was taken aback. “Are you suspecting that something happened at Second Master Hill’s house?”"
      },
      {
        "paragraph": "“Mm.” Shaun did not elaborate on it. “If I don’t contact you within half an hour, you can barge in straight\naway.”"
      },
      {
        "paragraph": "“Okay.” Elle could sense how careful Shaun was from his tone. “Do you need me to call the police?”"
      },
      {
        "paragraph": "“No need. I suspect Willie has been kidnapped.”"
      },
      {
        "paragraph": "Shaun made this guess based on Spencer’s words that were full of loopholes. Although Spencer was\nOld Master Hill’s only son, the family heirloom had never been passed on to him."
      },
      {
        "paragraph": "Since Spencer wanted him to go over so suddenly, it was most likely that he was threatened."
      },
      {
        "paragraph": "In fact, Shaun could already guess who had threatened Spencer."
      },
      {
        "paragraph": "40 minutes later, Shaun drove into his second uncle’s villa."
      },
      {
        "paragraph": "Standing in the courtyard, Yvette and Spencer curved their mouths discreetly. Spencer was the first to\nsay, “Shaun, sorry for making you come at such a late hour.”"
      },
      {
        "paragraph": "Shaun glanced at Spencer so indifferently that Spencer shuddered deep down. “ Second Uncle, now\nthat you’ve deceived me into coming here, it’s about time you tell me the real reason.”"
      },
      {
        "paragraph": "Spencer’s lips quivered embarrassedly. Yvette glared at Shaun and said with gritted teeth, “Yeah. We\ndeceived you into coming here. After all, our family was dragged into the mess all because of you and"
      },
      {
        "paragraph": "Catherine. Poor Willie. He’s already a fool, yet they still won’t let him go.”"
      },
      {
        "paragraph": "Sure enough…"
      },
      {
        "paragraph": "Shaun finally got the picture. “Who did it?” “W-Wesley says he wants to see you.” Spencer gestured at\nthe living room with his chin. “Don’t worry. He didn’t bring anyone else here. Only his female secretary\nis with him. Shaun, I really don’t know what he’s planning to do, but you must save Willie. That b*stard\ntricked Willie into leaving when I was in the States to buy something with your aunt.”"
      },
      {
        "paragraph": "Shaun frowned."
      },
      {
        "paragraph": "He was unsure of Wesley’s intention. If Wesley wanted to deal with him, how could he have brought\nonly one person here?"
      },
      {
        "paragraph": "What on earth was Wesley plotting?"
      },
      {
        "paragraph": "“You must save Willie. Wesley came to look for us all because of you. ” Upon realizing that Shaun had\ngone silent, Yvette hurriedly shouted, “I’m assuming all he wants is to discuss something with you. Just\npromise whatever he requests. Willie is your cousin. Now that he’s already a fool, he can’t lose his life.”"
      },
      {
        "paragraph": "“Enough. Drop it.” Spencer stopped her."
      },
      {
        "paragraph": "“I’m doing this for the sake of Willie. If something happens to Willie, we might as well kill ourselves. I’m\nfed up with cr*p like this from the Hill family.” Yvette bellowed, “Ask him to take out his phone. ”"
      },
      {
        "paragraph": "Spencer looked ashamed. He wished he could bury himself in a hole. “Shaun, Wesley’s afraid that\nyou’ll record your conversation with him, so he wants you to take out your phone.”"
      },
      {
        "paragraph": "Shaun’s thin lips curled up grimly. Why was Wesley afraid of being recorded? He was clearly afraid that\nShaun would ask for help."
      },
      {
        "paragraph": "Upon noticing that Shaun remained still, Spencer began to panic. “ Shaun, I’m really not lying. Only\nWesley and his secretary are inside, I swear. He said that if you don’t follow his instructions, Willie will\nnever come back.”"
      },
      {
        "paragraph": "The aged Spencer was on the verge of tears."
      },
      {
        "paragraph": "“Second Uncle, I admit that Wesley threatened Willie all because of me. But this is the last time I’m\ngoing to save him. I can’t possibly protect him forever.”"
      },
      {
        "paragraph": "Shaun tossed his phone into Spencer’s hand. Although he had no idea what Wesley intended to do,\nElle would barge in after 2o minutes even if he did not have his phone with him. Since 1o minutes had\npassed, he should be able to deal with ten or so people considering his skills."
      },
      {
        "paragraph": "Once he finished speaking, he strode toward the villa with his long legs. The moment he stepped into\nthe building, all the lights went out all of a sudden. Even the windows were shut tightly without any light\npenetrating in."
      },
      {
        "paragraph": "He turned around, only to find the door behind him slammed shut."
      },
      {
        "paragraph": "Fury flashed across Shaun’s eyes. How audacious of Spencer and Yvette."
      },
      {
        "paragraph": "He previously thought that they took away his phone to prevent him from contacting anyone outside.\nHowever, by the look of things, they wanted to keep him from using the flashlight on the phone."
      },
      {
        "paragraph": "So what if he could not see anything? He could still discern Wesley based on his voice."
      },
      {
        "paragraph": "“Wesley Lyons, casting your meanness aside, you don’t even dare to leave the lights on. Are you too\nashamed to meet me because of those dirty deeds you’ve done?”"
      }
    ]
  },
  {
    "title": "Chapter 1610 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun stood frozen to the spot, his tone filled with provocation and contempt."
      },
      {
        "paragraph": "However, his question was met with silence. All of a sudden, a piece of strange music rang in the villa.\nHe had no idea which music this country was from, but it seemed like a Sanskrit song. Although he did\nnot understand it, he somehow found it familiar."
      },
      {
        "paragraph": "He seemed to have heard it somewhere before."
      },
      {
        "paragraph": "He listened to the music for a while, trying to recall it. Nevertheless, his head began to hurt all of a\nsudden."
      },
      {
        "paragraph": "Then, a flash of light that resembled a star suddenly appeared on the second floor."
      },
      {
        "paragraph": "As Shaun walked toward the light, another flash of light lit up at the side. The two lights were blinking\nnon-stop, and he started to zone out."
      },
      {
        "paragraph": "Upon realizing what was happening, Shaun closed his eyes."
      },
      {
        "paragraph": "Subsequently, a woman’s flat voice sounded from the second floor. “ Shaun, remember that Sarah is\nthe woman you love most. The woman you love most…”"
      },
      {
        "paragraph": "This voice…"
      },
      {
        "paragraph": "Shaun’s head hurt even more. It was as if something was buzzing in his head, which felt like it was\nabout to explode."
      },
      {
        "paragraph": "No, it was not. Catherine was the woman he loved the most. No."
      },
      {
        "paragraph": "“Sarah Neeson, is this your doing?” Shaun followed the direction of the voice and tottered forward in\nthe dark."
      },
      {
        "paragraph": "However, he could not seem to find his way. He even slipped on something."
      },
      {
        "paragraph": "The flat voice continued, “The person you hate the most is Catherine. It’s Catherine. She’s the one who\nseduced you. She seduced you, seduced you…”"
      },
      {
        "paragraph": "Something appeared to trigger his memory. Shaun’s head began to ache excruciatingly. Due to the\npain, his handsome face paled."
      },
      {
        "paragraph": "With his limited sense, he was vaguely aware of Wesley’s actual intention."
      },
      {
        "paragraph": "As much as he refused to listen to the voice, it made its way into his ears like the devil’s voice."
      },
      {
        "paragraph": "On top of that, many of his own voices popped out in his head."
      },
      {
        "paragraph": "These voices in his memory were familiar yet strange."
      },
      {
        "paragraph": "“You can divorce me, but you need to cook for me for three years, and I’ll accept your request.”"
      },
      {
        "paragraph": "“Catherine, did you truly love me?”"
      },
      {
        "paragraph": "“Even if you don’t care, I do. Cathy, I know you hate me, but what can I do? I feel like you’ve fooled me,\nbut I can’t bear to let you go. I’ve been poisoned by a type of poison called Catherine.”"
      },
      {
        "paragraph": "Who was speaking?"
      },
      {
        "paragraph": "No. He could not let the voices continue."
      },
      {
        "paragraph": "As Shaun continued to stagger toward the direction of the voice in the dark, he missed his footing and\nrolled down the stairs."
      },
      {
        "paragraph": "The voices stopped ringing as well."
      },
      {
        "paragraph": "In the manor."
      },
      {
        "paragraph": "Catherine was telling the kids stories when her left eye suddenly twitched. She spaced out for a\nmoment until she heard Suzie’s voice. ”Mommy, go on with the story. ”"
      }
    ]
  },
  {
    "title": "Chapter 1611 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Oh, okay. ” Catherine flipped to the next page. “ The wolf followed the footprints. Suddenly, he saw a\npond in front— ”"
      },
      {
        "paragraph": "Before she could finish the story, her phone that was on the bed rang."
      },
      {
        "paragraph": "Elle was calling her."
      },
      {
        "paragraph": "“Miss Jones, something happened to Young Master Hill. I’ve just sent him to the hospital.”"
      },
      {
        "paragraph": "Upon hearing Elle’s anxious voice, Catherine’s heart skipped a beat. “What happened to him? Didn’t he\ngo to his uncle’s house tonight?”"
      },
      {
        "paragraph": "“Something happened to him at Second Master Hill’s house. Please come to the Jewell family’s\nhospital.” In a state of panic, Elle hung up after giving a brief reply."
      },
      {
        "paragraph": "“Mommy, what’s wrong with Daddy?” Suzie was so frightened that her face turned ghastly."
      },
      {
        "paragraph": "Lucas’s cool face looked grave as well. “Mommy, take us with you.”"
      },
      {
        "paragraph": "“ It’s too late now. I won’t have the energy to look after you guys later, so you should stay at home. Let\nme go there and find out what’s going on. If your dad’s condition is serious, I’ll get Hadley to send you\nboth over. Otherwise, you can visit him the next morning.”"
      },
      {
        "paragraph": "Looking at the two little kids, Catherine forced herself to calm down."
      },
      {
        "paragraph": "“Mommy, we…”"
      },
      {
        "paragraph": "“Listen to me.” Catherine’s pretty face looked anxious yet stern."
      },
      {
        "paragraph": "Seeing that, Lucas and Suzie pursed their lips and kept quiet."
      },
      {
        "paragraph": "Catherine promptly started the car and rushed to the hospital. On her way there, she informed Brennan\nand Lea about the matter."
      },
      {
        "paragraph": "When she arrived at the hospital, Elle, Spencer, and Yvette were waiting outside the emergency room\nwith somber looks on their faces. As soon as Spencer and Yvette saw Catherine, their eyes flashed\nwith unease."
      },
      {
        "paragraph": "“Elle, what on earth happened?” Catherine asked Elle without looking at Spencer and Yvette."
      },
      {
        "paragraph": "Before Elle answered, Spencer said guiltily, “ Sorry, it’s all our doing. Wesley kidnapped Willie and said\nhe’d kill Willie if we didn’t deceive Shaun into coming to our villa.”"
      },
      {
        "paragraph": "With her lips quivering, Yvette said, “We didn’t mean to hurt him. Wesley said he just wanted to have a\nchat with Shaun. Besides, he didn’t bring anyone with him, so we have no idea what happened to\nShaun. Hey, don’t glare at us. After all, we were dragged into this mess because of you guys. We don’t\neven know Wesley well. If it hadn’t been for the trouble you guys caused, why would Willie be\nkidnapped? He’s already a fool. Do you guys want him to lose his life as well?”"
      },
      {
        "paragraph": "“Your son’s life matters, but doesn’t Young Master Hill’s life matter too?” Elle could not tolerate Yvette’s\nwords."
      },
      {
        "paragraph": "Catherine found Yvette’s remarks nasty as well. Back then, she neither hated nor liked Spencer and\nYvette. Her impression of them was at least better than that of Valerie."
      },
      {
        "paragraph": "However, with these recent happenings, she came to realize that this couple was jealous and selfish."
      },
      {
        "paragraph": "Shaun had already let them go when the couple sold Hill Corporation off to their enemy. Yet now that\nShaun was in danger, all they wanted to do was shift the blame."
      },
      {
        "paragraph": "Yvette said with dissatisfaction, “We didn’t expect something to happen to Shaun either. Given his\nskills, who knew he would fail to deal with Wesley?”"
      },
      {
        "paragraph": "“Shut up.”"
      },
      {
        "paragraph": "Catherine’s grim eyes swept over to her."
      },
      {
        "paragraph": "For some reason, the icy aura that surrounded Catherine filled Yvette with dread. When Yvette came to\nher senses, she shouted in a huff, “Who gives you the right to make me shut up? I’m your elder.”"
      }
    ]
  },
  {
    "title": "Chapter 1612 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“But why does an elder like you have no shame at all?” Fury was written all over Catherine’s face. “ I’m\nnot in the mood to argue with you. I just want to ask you something. Have you guys called the police\nregarding this matter? Has Willie returned yet? Where’s Wesley? How did the accident happen to\nShaun?”"
      },
      {
        "paragraph": "Yvette was stunned at the questions she was bombarded with."
      },
      {
        "paragraph": "Spencer then muttered, “Willie is back. When we sent Shaun to the hospital, our housekeeper called\nme and said Willie came back by himself. After our housekeeper asked him, Willie said someone took\nhim out to play hide and seek. In this case… It’s inappropriate for us to report it to the police since he\nwas only missing for one afternoon.”"
      },
      {
        "paragraph": "Catherine understood the situation. All Wesley did was trick Willie with his little game. Considering that\nWillie was only missing for less than 24 hours, the police would not accept the case. “Wesley must’ve\nbeen there at the scene when something happened to Shaun, right?”"
      },
      {
        "paragraph": "Spencer opened his mouth in agony, not knowing how to explain."
      },
      {
        "paragraph": "Elle said in a low voice, “When the accident happened, Wesley was moon gazing on the top floor. The\ntwo of them did not meet each other.”"
      },
      {
        "paragraph": "Catherine could go insane at that moment. “So what the hell happened to Shaun?”"
      },
      {
        "paragraph": "Elle forced a smile. “In fact, Young Master Hill had already guessed that Willie was kidnapped when he\nheaded to Second Master’s house. That was why he had me ambush outside the house with some of\nour men. He said if I didn’t hear from him within half a n hour, we could barge in. But when we barged"
      },
      {
        "paragraph": "in, the lights in the house weren’t on. I found Young Master Hill lying on the floor unconscious with his\nforehead covered in blood. That was when I sent him to the hospital. On my way here, I checked his"
      },
      {
        "paragraph": "injuries, but none of them were fighting-related. The only part he injured is his forehead, and it’s not\nvery serious.”"
      },
      {
        "paragraph": "Upon hearing it, Catherine did not let out a sigh of relief. Instead, she found the incident strange. “ Why\nweren’t the lights in the house on?”"
      },
      {
        "paragraph": "Elle turned her eyes to Spencer and Yvette."
      },
      {
        "paragraph": "Spencer responded embarrassedly, “I’m really not sure about it. Wesley asked us to enter the house\nand closed all the curtains. Since it was just the two of them, I thought it wouldn’t be difficult for Shaun\nto deal with them.”"
      },
      {
        "paragraph": "“Two of them?”"
      },
      {
        "paragraph": "“Wesley and his female secretary.” Yvette added, “ Catherine, please don’t tell our grandparents about\nit since Shaun is just slightly injured. Tomorrow, we’re going to bring Willie overseas to treat his illness,\nand we won’t be involved in all your vendettas anymore.”"
      },
      {
        "paragraph": "Deep down, Catherine was simmering with anger."
      },
      {
        "paragraph": "She admitted that the couple had nothing to do with Wesley and were in the mess because of Shaun\nand her."
      },
      {
        "paragraph": "Nevertheless, as Shaun’s second uncle and aunt, they were too selfish."
      },
      {
        "paragraph": "“Take Willie away, then. I don’t want to see you guys anymore. We’ll go our separate ways from now\non. Also, don’t contact Shaun anymore, ” Catherine said indifferently."
      },
      {
        "paragraph": "She wished that Shaun would have nothing to do with the two of them. When something good\nhappened, they would approach him. Yet now that he was in trouble, they were the first to run away."
      },
      {
        "paragraph": "Losing such relatives would not matter."
      },
      {
        "paragraph": "“You…” Yvette was put off by Catherine’s words."
      },
      {
        "paragraph": "“Fine. Let’s go.” Spencer dragged his wife away. After all, he was the one who dragged Shaun into this\nincident."
      },
      {
        "paragraph": "When they were leaving, Catherine even heard Yvette’s voice echoing from the corridor. “Shaun only\ninjured his forehead a little. Why is she making a big deal out of it?”"
      },
      {
        "paragraph": "“She has gone too far.” Elle clenched her fists in exasperation."
      },
      {
        "paragraph": "“Fine. It’s common to have awful relatives.” Catherine sighed."
      },
      {
        "paragraph": "“Don’t worry, Miss Jones. Young Master Hill will be fine,” Elle consoled her."
      },
      {
        "paragraph": "“Hopefully.” Despite saying that, Catherine was actually feeling anxious."
      },
      {
        "paragraph": "Wesley had put so much effort into getting Shaun there just to make him fall down the stairs?"
      }
    ]
  },
  {
    "title": "Chapter 1613 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Elle, go to the scene and have a look. Hopefully, you can find some of Wesley’s incriminating\nevidence, ” Catherine said."
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "Shortly after Elle left, Lea and Brennan rushed to the hospital."
      },
      {
        "paragraph": "After hearing the ins and outs of the incident, Brennan could not resist telling Lea off, “Why are the Hills\nso selfish? As Shaun’s uncle, has he no shame? His son’s life matters to him, but other people’s lives\ndon’t, huh?”"
      },
      {
        "paragraph": "His criticism made Lea feel ashamed, but she could not refute it."
      },
      {
        "paragraph": "At the sight of the scene, Catherine said, “Uncle, Aunty, stop quarreling. Let’s wait for Shaun to come\nout first.”"
      },
      {
        "paragraph": "It did not take long before the door of the emergency room opened."
      },
      {
        "paragraph": "Chester, who personally took charge of the emergency operation this time, came out of the room.\n“Don’t worry. I’ve performed a full body checkup for Shaun, including a CT scan of his head. He has\nonly suffered from a mild concussion, and he’s generally fine.”"
      },
      {
        "paragraph": "Only after the crowd heard it did they sigh in relief. Catherine asked, “When will he be awake?”"
      },
      {
        "paragraph": "“He should be awake after a few hours.”"
      },
      {
        "paragraph": "After that, Shaun was arranged to stay in a VIP ward."
      },
      {
        "paragraph": "Catherine advised Brennan and Lea to go home to rest, but none of them left. They insisted on waiting\nfor Shaun to wake up."
      },
      {
        "paragraph": "After waiting for an hour or so in the hospital, Catherine’s phone rang. It was a call from Wesley."
      },
      {
        "paragraph": "As much as she loathed this person, she still answered the call for the sake of Shaun."
      },
      {
        "paragraph": "“Wesley, I won’t let you get away for hurting Shaun tonight.” Catherine’s face looked cold."
      },
      {
        "paragraph": "“Cathy, don’t accuse me. I didn’t even meet Shaun tonight. When he came in, I was talking to Senator\nMead over the phone on the top floor. How could I have possibly dealt with Shaun while talking to\nsomeone else? Even if you report it to the police, I have the call log in my phone.” Wesley grinned."
      },
      {
        "paragraph": "“You may not have done it yourself, but it doesn’t mean you didn’t get someone else to do it. Didn’t you\nenter the house with another female secretary? Also, why did the lights in Spencer’s house go out?\nYou should know better than anyone else.”"
      },
      {
        "paragraph": "“ It’s perfectly normal for my secretary to arrange some files for me. But if she were to deal with Shaun,\nshe’d be biting off more than she could chew. With Shaun’s skills, no one could approach him even in\nthe dark. As to why the lights in Spencer’s house went out, you need to find out from Spencer. What a\nlow-quality circuit he used. ”"
      },
      {
        "paragraph": "She could hear how smug Wesley was from his tone. “I just wanted to tell you not to waste any more\ntime on Shaun. I’ll be here waiting for your return, darling.”"
      },
      {
        "paragraph": "After that, he hung up. Catherine was so furious that she wished she could tear his face apart."
      },
      {
        "paragraph": "However, she was deeply suspicious of the matter. The matter was just bizarre."
      },
      {
        "paragraph": "As such, she dared not walk away from Shaun at all."
      },
      {
        "paragraph": "At 11:00 p.m., the man on the bed finally woke up."
      },
      {
        "paragraph": "“Shaunny, are you okay?” Catherine promptly held his hands."
      },
      {
        "paragraph": "The man’s thick lashes fluttered, and he slowly opened his dazed, pure eyes."
      },
      {
        "paragraph": "After blinking his eyes, Shaun suddenly jerked backward and withdrew his hands."
      },
      {
        "paragraph": "“What’s wrong? You can’t recognize me after suffering from a concussion, huh?” Catherine asked\nnervously."
      },
      {
        "paragraph": "“Aunty, who are you?” Shaun curled up into a ball. His originally hoarse voice had turned into a kid’s\ncute voice."
      }
    ]
  },
  {
    "title": "Chapter 1614 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Aunty…"
      },
      {
        "paragraph": "Catherine was stupefied. Did Shaun call her Aunty?"
      },
      {
        "paragraph": "“Shaun, what’s wrong with you?” Lea and Brennan"
      },
      {
        "paragraph": "immediately approached him."
      },
      {
        "paragraph": "“No. Don’t come closer. I don’t know you guys.” Shaun used the blanket to cover himself and curled his\ntall figure into a ball. He was trembling."
      },
      {
        "paragraph": "Catherine’s heart sank. Lea and Brennan were dejected as well."
      },
      {
        "paragraph": "Brennan anxiously stripped the blanket away. “ Shaun, I’m your dad.”"
      },
      {
        "paragraph": "“Go away. You look scary.” Frightened, Shaun began to bawl like a baby. “I don’t want to stay here. I\nwant to go home.”"
      },
      {
        "paragraph": "“Shaun, we’re your parents.” Lea held his hand with worry."
      },
      {
        "paragraph": "“No, you guys aren’t. My daddy and mommy aren’t so old. You guys can be… my grandpa and granny.”"
      },
      {
        "paragraph": "Shaun pouted and kept his hands to himself to stop them from approaching him."
      },
      {
        "paragraph": "Grandpa and Granny… Brennan and Lea were riveted."
      },
      {
        "paragraph": "Unable to watch on anymore, Catherine quickly gave Chester a call."
      },
      {
        "paragraph": "Upon learning the news, Chester, who had not returned home, hurried to the room. At the sight of\nShaun, he was dumbfounded."
      },
      {
        "paragraph": "When Shaun saw Chester, he began to blubber in fear. “I don’t want to see the doctor. Doctors are\nscary…”"
      },
      {
        "paragraph": "Although Shaun could not recognize anyone, he held onto Catherine’s skirt, considering she looked\npretty and gentle. “Aunty, I don’t want injections. ”"
      },
      {
        "paragraph": "Seeing Shaun’s handsome, tear-filled face, Catherine realized that his behavior could compare to\nSuzie’s. As much as she felt like killing herself, she had no choice but to endure the situation."
      },
      {
        "paragraph": "“Alright. No injections for you. The doctor just wants to take a look at your head.” She forced herself to\ncalm Shaun down gently."
      },
      {
        "paragraph": "“Uh… There’s nothing wrong with my head. I don’t want an injection.” Shaun shook his head violently,"
      },
      {
        "paragraph": "looking frightened."
      },
      {
        "paragraph": "“Be good. I promise I won’t give you an injection. Let me play a little game with you.” Chester tried to\nput up with Shaun’s behavior and treated him like a kid."
      },
      {
        "paragraph": "They spent some time talking Shaun into it. When they finally managed to calm Shaun down, a few\nneurologists came and took turns examining Shaun’s condition. At last, a neurologist said, “ Aside from\nthe minor concussion, everything else is fine. It’s our first time encountering such a condition. If it’s not\ncaused by internal factors, I’m afraid it’s due to external stimulation that took place before he was\ninjured.”"
      },
      {
        "paragraph": "“External stimulation…”"
      },
      {
        "paragraph": "After Catherine and Chester exchanged glances, their hearts thumped, and something crossed their\nminds."
      },
      {
        "paragraph": "Lea was so unsettled that her eyes reddened. “ Doctor, is it possible to cure him?”"
      },
      {
        "paragraph": "“We’ll try our best, but we’re not confident about it because there’s nothing wrong with his brain.” The\ndoctor forced a smile. “ Based on my preliminary analysis, his intellectual capacity has regressed to the\nstage of a two-year-old.”"
      },
      {
        "paragraph": "“Two years old?” Catherine smiled ruefully. In this case, his intellectual capacity was even worse than\nSuzie’s."
      },
      {
        "paragraph": "“Let’s hope that his intellectual capacity will improve. If it doesn’t, it’ll be really troublesome.” The doctor\nsighed."
      },
      {
        "paragraph": "After the doctor left, Catherine glanced at Shaun who was sucking his finger on the bed. Then, she said\ngloomily, “I finally understand Wesley’s motive for fooling him into showing up. It must be Sarah’s\ndoing.”"
      },
      {
        "paragraph": "“Sarah forcibly evoked Shaun’s tangled memories to cure him, but she made him lose his sanity\ninstead. ” Chester clenched his fists so tightly that they cracked. “That woman has become so vicious.\nIf I had known this earlier, I would’ve killed her.”"
      },
      {
        "paragraph": "“A cure? His memory can’t be restored at all. She obviously meant to make him go insane. I’ve always\nbeen cautious not to let him recall the past, yet he still ended up in this state.” Catherine’s eyes\nreddened as she felt extremely upset."
      }
    ]
  },
  {
    "title": "Chapter 1615 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "With that, Catherine told Brennan and Lea what Sarah did to Shaun during his treatment three years\nago."
      },
      {
        "paragraph": "At first, Catherine and Shaun planned to put that incident behind them, but they never thought that\nSarah would collude with Wesley."
      },
      {
        "paragraph": "The news astounded Lea. “No wonder Shaun suddenly insisted on divorcing you and marrying Sarah\nback then. I thought he still had feelings for Sarah…”"
      },
      {
        "paragraph": "“It was all my fault. I shouldn’t have gotten Sarah to treat his illness.” Chester greatly regretted it."
      },
      {
        "paragraph": "“Don’t say that. It’s not entirely your fault. If I had fulfilled my duty as a mother back then, Sarah\nwouldn’t have been able to take advantage of Shaun.” Lea was annoyed at herself. “That woman used\nto claim that she loved Shaun, but I think it was all fake. If she truly loved him, how would she be so\nwicked as to make him a fool?”"
      },
      {
        "paragraph": "“I’ll have people hunt her down right away, ” Brennan said with a grim look on his face."
      },
      {
        "paragraph": "“Uncle Brennan, we have no proof. Nobody saw Sarah in Second Uncle’s house last night. I suspect\nshe was the one who pretended to be Wesley’s secretary. The lights went out and the curtains were\ndrawn so that they could force hypnosis onto Shaun. Besides, Wesley has Senator Mead as his alibi.”\nCatherine regretted not going there with Shaun that night."
      },
      {
        "paragraph": "“What should we do now? Is there nothing we can do?” No matter how good-tempered Brennan was,\nhe could not help but lose his temper there and then. “We just leave Shaun as a fool forever, huh?”"
      },
      {
        "paragraph": "He subconsciously raised his voice. Shaun, who was sucking his finger, saw Brennan’s exasperated\nlook and blubbered in fear once again. “Boo-hoo."
      },
      {
        "paragraph": "Grandpa is scary.”"
      },
      {
        "paragraph": "“Don’t be scared. I’m here. Grandpa won’t hurt you. He’s just angry with some bad people.” Catherine\npromptly patted Shaun on the back while calming him with her soft tone."
      },
      {
        "paragraph": "Brennan was speechless with his identity changed from a father to a grandfather."
      },
      {
        "paragraph": "His blood began to boil."
      },
      {
        "paragraph": "“Uncle Brennan, I’ll have a meeting with the top neurologists and psychologists to discuss this matter.\nShaun is my buddy, and I’ll certainly go all out to help him,” Chester said."
      },
      {
        "paragraph": "“Chester, you must find a way to cure him. Shaun is such a smart… and arrogant person. He can’t be\nlike this.” Lea could not help but burst into tears."
      },
      {
        "paragraph": "One of her sons had gone missing in the sea, while the other had become a fool."
      },
      {
        "paragraph": "She could not bring herself to accept this fact."
      },
      {
        "paragraph": "However, Shaun did not seem to notice their sorrow. After weeping for a while, he lifted his big, pure\neyes and said to Catherine, “Aunty… I’m hungry.”"
      },
      {
        "paragraph": "Catherine felt like crying for being called an aunty. Nevertheless, she had no choice but to ask gently, “\nWhat would you like to eat?”"
      },
      {
        "paragraph": "“I want milk…” Shaun pursed his thin lips with tears in his eyes. He looked just like Suzie when she\nsaid she was hungry."
      },
      {
        "paragraph": "Catherine almost choked."
      },
      {
        "paragraph": "She would find it normal if Suzie and Lucas said that they wanted milk. However, Shaun was an adult…"
      },
      {
        "paragraph": "Forget it. He only had a mental age of two."
      },
      {
        "paragraph": "“Alright. I’ll get you some milk.” Catherine forced a smile. When she stood up, Shaun tugged at the hem\nof her skirt."
      },
      {
        "paragraph": "“Aunty, don’t leave. I’m scared…” As soon as he finished speaking, he glanced at Brennan and Lea\nfearfully."
      },
      {
        "paragraph": "Lea smiled wryly. “Alright. You can stay here and accompany him. I’ll buy the milk.” The convenience\nstore was just located downstairs. After Lea bought a packet of milk and returned, Shaun started\ndrinking the milk with relish."
      }
    ]
  },
  {
    "title": "Chapter 1616 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "The situation made Lea and Brennan heartbroken. After they exchanged looks, Lea walked up to\nCatherine. “Catherine, we have no idea when Shaun will recover. Perhaps he’ll forever be…”"
      },
      {
        "paragraph": "“Aunty Lea, don’t make such a discouraging comment, ” Catherine interrupted her even though she\nwas actually at her wits’ end."
      },
      {
        "paragraph": "Shaun’s brain was not injured. In fact, he was just like a computer whose programs were jumbled up,\nthus contributing to his intellectual disability."
      },
      {
        "paragraph": "Chester said he would do his best to cure Shaun, but Catherine knew the chances of success were\nvery slim. If it was so easy to cure the illness, Shaun might have recovered those jumbled memories a\nlong time ago."
      },
      {
        "paragraph": "Lea gazed at Catherine sadly. “You and Shaun have gone through so much to come this far. We’re\nactually happy to see that you’ve made peace with Shaun and given birth to his children. At this\nmoment, I’m glad that you haven’t remarried Shaun. Although you guys are already together, you’re not\nhis wife yet. You don’t have an"
      },
      {
        "paragraph": "obligation to him. On the contrary, he’s our responsibility, given that we’re his parents.”"
      },
      {
        "paragraph": "“Aunty Lea, what are you trying to say?” Catherine asked despite having guessed it."
      },
      {
        "paragraph": "“Catherine, if you’re tired and feel like leaving, feel free to do so. We won’t force you to take care of\nShaun. Now that he’s become a fool, no one knows how long this condition will persist. It could take a\nfew years or even forever.”"
      },
      {
        "paragraph": "As Lea was speaking, she lowered her head and wiped the tears from the corners of her eyes. “ You’re\nstill young.”"
      },
      {
        "paragraph": "“Aunty Lea, don’t say that. I can’t leave with Shaun’s current condition. Of course, I have no idea how\nlong I can hold on for, but I won’t leave now. I’ll stay here and take care of him.”"
      },
      {
        "paragraph": "Looking at Shaun drinking milk, Catherine said with a low voice, “Yes, he might be a fool now, but his\nintellectual capacity might grow. Whether he’s normal or a fool, I’ll try my best and make him fall for me\nagain. Even if we don’t have a future together, I won’t regret it.”"
      },
      {
        "paragraph": "Lea was stunned, and there was a sense of appreciation in her eyes. “Thank you. It’s Shaun’s blessing\nto have met you in his life.”"
      },
      {
        "paragraph": "“You and Uncle Brennan… can go home and rest, ” Catherine said."
      },
      {
        "paragraph": "“No. You can go home. Suzie and Lucas must be waiting for you. Tonight, I’ll accompany—” Before\nBrennan could finish his sentence, Shaun pouted in fear when he saw Brennan approaching him."
      },
      {
        "paragraph": "Suddenly, Brennan felt helpless."
      },
      {
        "paragraph": "“Forget it. Since he’s so afraid of you, I’ll accompany him. Suzie and Lucas are quite worried about him\ntoo, so can you please bring them here tomorrow?” Catherine gave a wry laugh. She could not bear to\nsee Shaun in this state."
      },
      {
        "paragraph": "Brennan was headstrong. “How can we let the kids see him in this state?”"
      },
      {
        "paragraph": "“But there’s no other way. The kids are worried about him, and we can’t hide it from them for long\nanyway.” Catherine felt helpless."
      },
      {
        "paragraph": "Only after Catherine convinced those two adults into leaving did Shaun relax."
      },
      {
        "paragraph": "He looked at Catherine and yawned. “Aunty, I need to… pee.”"
      },
      {
        "paragraph": "Catherine stumbled and almost fell. When she finally regained her footing, she felt awkward. “You can\ngo to the restroom on your own. It’s over there.”"
      },
      {
        "paragraph": "“I don’t want to move, and I don’t know how to take off my pants.” Shaun squirmed and pouted."
      },
      {
        "paragraph": "Words could not explain Catherine’s expression. Luckily, Shaun was good-looking, which made her feel\na little less awkward."
      },
      {
        "paragraph": "“Carry me… ” Shaun stretched out his hands to her childishly."
      },
      {
        "paragraph": "Catherine was at a loss for words. How could she possibly carry him?"
      },
      {
        "paragraph": "“No need. Just use this. ” Catherine weakly took a bedpan from the bed. “What’s this? It looks fun.”\nShaun’s pure eyes glowed as though he saw an interesting toy."
      }
    ]
  },
  {
    "title": "Chapter 1617 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“This isn’t a toy. It’s for peeing.”"
      },
      {
        "paragraph": "Deep down, Catherine felt glad that she had two children. At least she had an idea on how to deal with\nShaun in his current state."
      },
      {
        "paragraph": "“Oh.” Shaun’s eyes were filled with curiosity. “I can’t hold it anymore. Help me take off my pants…”"
      },
      {
        "paragraph": "Catherine was speechless."
      },
      {
        "paragraph": "Looking at the man on the bed who was much taller than her, Catherine felt like asking whether he was\ntrying to take liberties with her…"
      },
      {
        "paragraph": "However, even if she asked him, he would not understand her question."
      },
      {
        "paragraph": "All Catherine could do was surrender to her fate by going to him and helping him."
      },
      {
        "paragraph": "Although they had lived together like a married couple, she could not help but blush with\nembarrassment when she met Shaun’s pure eyes."
      },
      {
        "paragraph": "When he was finally done, she said to Shaun earnestly, “From now on, don’t call me Aunty. Just call\nme Cathy.”"
      },
      {
        "paragraph": "“Cathy?” A dazed look crossed Shaun’s face. “But you’re… a lot older than me.”"
      },
      {
        "paragraph": "Catherine did not have it in her to tease him. How dare this old man say she was a lot older than him\nwhen he was already in his 30s. “May I know how old you are?”"
      },
      {
        "paragraph": "Shaun counted with his fingers seriously, but he could not work it out even after some time. At last, he\nanswered with a pout, “I’m… one year old.”"
      },
      {
        "paragraph": "Catherine pressed her temples as she reminded herself to get used to it."
      },
      {
        "paragraph": "“ Shaunny, it’s late. It’s time to sleep. ” Catherine tucked him under the blanket."
      },
      {
        "paragraph": "“Are you calling me Shorty?” Shaun pouted. “I don’t like it. It sounds like I’m short.”"
      },
      {
        "paragraph": "Catherine found it funny. “It’s Shaunny. Your name is Shaun Hill. Remember that.”"
      },
      {
        "paragraph": "“Shaun Hill. I’m Shaun Hill. Shaun Hill.” Shaun nodded seriously, trying to remember his name."
      },
      {
        "paragraph": "Catherine was slightly swayed. She noticed that Shaun was not actually stupid even though he had a\nmental age of two. As long as she provided him with the right guidance, his intellectual capacity would\ngradually increase."
      },
      {
        "paragraph": "“Be good. Sleep now.”"
      },
      {
        "paragraph": "“I’m scared. ” Shaun clutched her. “I want a hug.”"
      },
      {
        "paragraph": "Catherine pictured herself hugging Suzie to sleep. Then, she shuddered when she pictured herself\nhugging Shaun’s long body. In the end, she lay on the bed with one hand around Shaun’s head and the\nother patting him on the back. Only then did she manage to coax him into sleeping."
      },
      {
        "paragraph": "While Shaun was sound asleep, Catherine was awake as she could not fall asleep at all."
      },
      {
        "paragraph": "She only fell asleep at 2:00 a.m. but woke up at 6:00 a.m."
      },
      {
        "paragraph": "She softly let go of Shaun and took her phone, only to find three unknown missed calls."
      },
      {
        "paragraph": "After some thought, she did not return the calls in the end."
      },
      {
        "paragraph": "At 8:00 a.m., Lea brought Suzie and Lucas over to visit Shaun."
      },
      {
        "paragraph": "“Daddy, are you okay?” Worried, Suzie walked to his bedside. “Do you still remember me?”"
      },
      {
        "paragraph": "After looking at Suzie in confusion, he tilted his head. With a pout, he screamed, “Sister…”"
      },
      {
        "paragraph": "Suzie was shocked to hear her scummy dad call her Sister. Boo—hoo…"
      },
      {
        "paragraph": "“She’s not your sister.” Lucas fixed his eyes on Shaun with a frown."
      }
    ]
  },
  {
    "title": "Chapter 1618 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun scratched the back of his head in a daze. “ You’re… Brother?”"
      },
      {
        "paragraph": "Lucas was speechless."
      },
      {
        "paragraph": "Although Lucas and Suzie had heard about Shaun’s condition from their grandmother on their way to\nthe hospital, they still found it hard to accept even after they saw it with their own eyes."
      },
      {
        "paragraph": "Catherine gently patted the two kids on their shoulders. “Your daddy is slightly injured, so you guys\nneed to take care of him, okay?”"
      },
      {
        "paragraph": "“Mommy, will Daddy be like this for the rest of his life?” Suzie was despondent."
      },
      {
        "paragraph": "Worry flashed in Catherine’s eyes. Even so, she said to the kids, “Uncle Chester and I will contact\nsome doctors overseas to cure him soon.”"
      },
      {
        "paragraph": "“Mm. Alright. ” Suzie gasped. “I’ll just take him as my younger brother then.”"
      },
      {
        "paragraph": "Just as Catherine was helpless, her phone suddenly rang. It was an unknown caller."
      },
      {
        "paragraph": "She took her phone and walked out. “Hi. Who are you looking for…”"
      },
      {
        "paragraph": "“I’m Titus Costner.” A cold voice sounded from the other end of the phone."
      },
      {
        "paragraph": "Catherine was stunned for a moment before she furrowed her brows. “Mr. Costner, what’s the matter?”"
      },
      {
        "paragraph": "“Matthew went missing yesterday. ” Titus’s tone was harsh. “And I still can’t reach him now. I can’t\nreach his assistant as well. After checking his call log, I realized that you were the last person he\ncalled. Does his disappearance have something to do with you?”"
      },
      {
        "paragraph": "Catherine’s head began to hurt."
      },
      {
        "paragraph": "So many things had happened since last night, and she had yet to get over them."
      },
      {
        "paragraph": "Yet now, Titus claimed Matthew had gone missing. From his tone, Catherine could tell that he was\nsuspecting her."
      },
      {
        "paragraph": "“I’ve only received a call from him the night before yesterday, and we haven’t contacted each other\nsince then.” Catherine said honestly, “Mr. Costner, I have my hands full at the moment. How would I\nhave the time to make Matthew go missing?”"
      },
      {
        "paragraph": "“You even dared to injure my bodyguard, what more Matthew. Matthew went out with his assistant\nyesterday morning. It’s all too easy for Liona members to deal with him.” Titus could no longer contain\nthe rage inside him."
      },
      {
        "paragraph": "Titus was usually very strict with Matthew. Since Matthew was his only son, he placed high hopes on\nhim."
      },
      {
        "paragraph": "Moreover, he could not believe that someone had the audacity to attack Matthew in Australia."
      },
      {
        "paragraph": "This had struck Titus’s nerve."
      },
      {
        "paragraph": "“Catherine Jones, you should know I’m calling you because you have a hidden agenda.”"
      },
      {
        "paragraph": "Deep down, Catherine gasped. How could she have done something to Matthew? Matthew was her\nbiological brother. Yet, of course, Titus would not believe it even if she told him that."
      },
      {
        "paragraph": "“Mr. Costner, if it was my doing, I’d own up. I’d even threaten to kill Matthew if you refuse to leave\nAustralia with Sheryl and Rebecca and promise to return Hill Corporation to us. However, I didn’t"
      },
      {
        "paragraph": "kidnap him, so I can’t threaten you.”"
      },
      {
        "paragraph": "Catherine added in a low voice, “Also, you can go around and find out what happened to Shaun last\nnight. He has become a fool. How would I have the time to do something to Matthew?”"
      },
      {
        "paragraph": "Titus was dumbfounded. “Shaun is now a fool?”"
      },
      {
        "paragraph": "“Do you think I’ll lie to you regarding this matter?” Catherine was annoyed. However, as she grew\nannoyed, all she could do was tell herself to calm down."
      },
      {
        "paragraph": "“Fine. But tell me why Matthew looked for you the night before yesterday. Catherine, we don’t have any\nother enemies in Australia apart from you and Shaun.”"
      },
      {
        "paragraph": "After thinking it over, Catherine asked, “Mr. Costner, are you alone now?”"
      },
      {
        "paragraph": "“Yes.”"
      },
      {
        "paragraph": "Catherine decided to be frank with him. “I told Matthew that Rebecca, Jeffery, and Sally are bad\npeople. You might think that I’m trying to tear you guys apart, but as outsiders, you’ve only heard most\nof the things from them. Probably all of them are about how bad I am, which is why Matthew didn’t\nbelieve me. In that case, I asked him to head to Melbourne to ask about Rebecca’s character. To be\nhonest, many wealthy people in Melbourne know about the evil deeds that Rebecca has done back\nthen. I guess Matthew went there to find out about it.”"
      },
      {
        "paragraph": "“I’ll investigate whether Mathew went to Melbourne. Having said that, if I find out that you’re involved in\nthis matter, I’ll make the whole of Australia pay the price.” Titus’s icy tone was filled with wrath."
      }
    ]
  },
  {
    "title": "Chapter 1619 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine chuckled indifferently, “Suit yourself. Anyway, my life has been screwed over ever since your\nfamily appeared. However, now I wish Matthew didn’t head to Melbourne…”"
      },
      {
        "paragraph": "“What do you mean?”"
      },
      {
        "paragraph": "“If he headed to Melbourne and went missing there, it would surely mean that he had found out\nsomething. There might be some people who want to stop him from bringing back the truth. But I’m to\nblame for that, too. I should’ve asked him to bring along a few more people to investigate the matter. I\njust didn’t expect he would really go to Melbourne. I thought he didn’t believe me.”"
      },
      {
        "paragraph": "Titus pursed his thin lips grimly. “Are you hinting that this matter has to do with Rebecca?”"
      },
      {
        "paragraph": "“Mr. Costner, may I know if your wife and Rebecca performed the DNA test earlier with hair?”"
      },
      {
        "paragraph": "“What are you trying to say?” Titus asked with indifference."
      },
      {
        "paragraph": "“ I suspect Wesley gave Rebecca my hair instead. ”"
      },
      {
        "paragraph": "Titus chuckled. “Are you trying to say that you’re Sheryl’s daughter?”"
      },
      {
        "paragraph": "“Yes. Perhaps you guys won’t believe it because it sounds absurd, but you’re a smart person, Mr.\nCostner. Considering that Rebecca isn’t your biological daughter, you can view this matter from the\nperspective of an outsider. You probably don’t like nor hate Rebecca. But after spending some time\nwith her, what do you think of her?”"
      },
      {
        "paragraph": "In the face of Catherine’s question, Titus’s brows furrowed angrily."
      },
      {
        "paragraph": "To be frank, he was not fond of Rebecca."
      },
      {
        "paragraph": "Of course, he could not point out her limitations as she had always been nice and obedient to him."
      },
      {
        "paragraph": "Nevertheless, ever since he came to Melbourne, his relationship with Sheryl had begun to fall apart. On\nthe other hand, Sheryl had been pampering Rebecca a lot."
      },
      {
        "paragraph": "She even gave Rebecca a few hundred billion dollars to acquire Hill Corporation without informing him\nabout it."
      },
      {
        "paragraph": "As Sheryl’s husband, he could sense a greater distance and conflict between Sheryl and him."
      },
      {
        "paragraph": "They had both been married for over 20 years and were always very loving. Their relationship had\nnever been in their current state before."
      },
      {
        "paragraph": "Upon realizing that Titus went silent, Catherine reckoned that he was in conflict with his family. “Mr.\nCostner, I really am Sheryl’s biological daughter. You guys might not believe me because I haven’t\ndone a DNA test. I was once married to Wesley. Only after I married him did I learn that he was a\nhypocrite who had been conspiring with Rebecca in a lot of crimes since three years ago, and I was\nkept in the dark. After we married, I lived in his house. Since I dried and combed my hair every day, he\nhad access to a lot of my hair. I’m very certain that you guys didn’t personally pluck the hair off\nRebecca’s head for the DNA test.”"
      },
      {
        "paragraph": "Titus rubbed his brows. Since Matthew was the one who had the DNA test done, who knew how he\nobtained the hair?"
      },
      {
        "paragraph": "“Let’s get back to business.”"
      },
      {
        "paragraph": "Knowing that she did not have proof, Catherine did not expect him to be convinced just like that. “As I\nsaid just now, Rebecca and Wesley are colluding with each other. Furthermore, Melbourne is the Lyons"
      },
      {
        "paragraph": "family’s roots. Since Rebecca came back, she has helped Wesley to play up to Senator Mead by taking\nadvantage of your status."
      },
      {
        "paragraph": "“At this point, his status in Australia has surpassed Shaun’s. Since those wealthy people in Melbourne\nact based on the situation, it’s unsurprising to know that some of them have secretly gone and sought\nhelp from the Lyons family. If Matthew had gone to inquire about Rebecca at this time, he would’ve\neasily alerted Wesley’s mole. After all, it won’t benefit Wesley if Rebecca’s true colors are exposed. I\nguess Matthew is missing because of him.”"
      },
      {
        "paragraph": "“Why should I believe in your words?” Titus asked coldly. This matter was far more complicated than he\nimagined."
      }
    ]
  },
  {
    "title": "Chapter 1620 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“It’s because I understand Wesley and Rebecca the most. You don’t have to worry too much. I think\nMatthew is still alive. They’re probably keeping Matthew with them as a way of protecting themselves\nfor fear that you’ll discover the truth.”"
      },
      {
        "paragraph": "After pausing for a moment, Catherine added, “Mr. Costner, sometimes what a person says may not be\ntrue. If you want to understand a person, you should spend time with them and feel it. Given that you’ve\nbeen in the business industry for so many years, can’t you be more sensible in seeing a person’s true\ncolors?”"
      },
      {
        "paragraph": "Titus was slightly swayed. “I’ll have this matter investigated. Hopefully, what you said is true.”"
      },
      {
        "paragraph": "Catherine sighed in relief. She knew Titus did not treat her words as nonsensical. “I guess Rebecca will\ntry her best to frame Shaun and me regarding this matter in front of you and your wife. I’m not bothered\nabout how your wife will think about it, but I hope you’ll stay rational and won’t be taken advantage of.”"
      },
      {
        "paragraph": "“None of the Joneses is to be taken lightly,” Titus teased."
      },
      {
        "paragraph": "“ Suit yourself. By the way, I’d like to remind you that Rebecca had once undergone plastic surgery to\nimpersonate someone else to take care of Shaun. She drugged Shaun’s food and made him…\nmentally ill. Consequently, it ruined my relationship with Shaun. I hope you’ll take note of this.”"
      },
      {
        "paragraph": "Once she finished speaking, she hung up. Upon hearing her last sentence, Titus froze."
      },
      {
        "paragraph": "He thought that he knew Sheryl very well. Despite that, Sheryl had become grumpier and more\nirrational recently."
      },
      {
        "paragraph": "He was under the impression that the unresolved matters with the Jones family had stressed her out."
      },
      {
        "paragraph": "However… What if that was not the case? Tutus suddenly shuddered."
      },
      {
        "paragraph": "All of a sudden, Sheryl knocked on the door of his study before she dashed in."
      },
      {
        "paragraph": "“Titus Costner, who were you talking to on the phone while hiding here? Let me ask you. How’s the\ninvestigation into Matthew’s disappearance? Why has he gone missing out of the blue?”"
      },
      {
        "paragraph": "“I’ve had someone investigate this matter.”"
      },
      {
        "paragraph": "Staring at Sheryl who was yelling in front of him, Titus spaced out a little. The Sheryl he knew back\nthen had fought alongside him. Although she was a woman, her capability and calmness could\ncompare to his when it came to dealing with business. “ Sheryl, simmer down.”"
      },
      {
        "paragraph": "“My son, Matthew, is missing. How can I simmer down?” Sheryl said in exasperation, “Catherine and\nShaun must be the ones who kidnapped him."
      },
      {
        "paragraph": "They’re our only enemies in Canberra.”"
      },
      {
        "paragraph": "“I’ll investigate it,” Titus said softly."
      },
      {
        "paragraph": "“What’s there to investigate about? Clearly, it was Catherine’s doing. She was the last person Matthew\ncontacted. This woman is really wicked.” Sheryl said furiously, “I’ll arrange for our men to be sent here.\nNo matter what, we must kill Catherine and Shaun this time. If they don’t return Matthew to us, I’ll make\nthem pay back with interest.”"
      },
      {
        "paragraph": "“Mom, don’t do that.” At this moment, Rebecca rushed into the room and said, “We must believe in\nUncle Titus.”"
      },
      {
        "paragraph": "Titus’s eyes darkened as he darted a glance at her. Then, he asked, “Rebecca, what do you think of\nthis matter?”"
      },
      {
        "paragraph": "Rebecca was stunned as she did not expect Titus to ask for her opinion. She clenched her teeth and\nsaid, “I think… me acquiring Hill Corporation recently has driven Catherine and Shaun mad. Let me talk\nto Catherine. It’s my fault anyway. Matthew wouldn’t have gone missing if it weren’t for taking revenge\non my behalf.”"
      }
    ]
  },
  {
    "title": "Chapter 1621 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“How can I blame you for this?” Sheryl quickly held Rebecca’s hands and consoled her, “After all, we’ve\nunderestimated Catherine’s brutality, or rather, we shouldn’t have given her the chance in the first\nplace.”"
      },
      {
        "paragraph": "A look of annoyance washed over Rebecca’s face. “I just can’t figure out why Matthew left without\nsaying a thing. Could Catherine have tricked him into leaving?”"
      },
      {
        "paragraph": "“That’s possible. ” Upon hearing it, Sheryl glared at Titus. “You guys have been in contact with\nCatherine from the beginning. Matthew is particularly innocent, but Catherine is cunning. He could’ve\nbeen deceived by her.”"
      },
      {
        "paragraph": "“ Sherry, now is not the time to quarrel. Let’s find Matthew first, ” Titus said with a low voice. Even his\nposture was lowered."
      },
      {
        "paragraph": "Rebecca bit her lip. “I’m afraid Catherine will deny it.”"
      },
      {
        "paragraph": "Provoked by her words, Sheryl said furiously, “ If she denies it, I’ll personally look for Minister Snow."
      },
      {
        "paragraph": "But if he doesn’t deal with Catherine and Shaun, I don’t mind severing Australia’s shipping routes.”"
      },
      {
        "paragraph": "Titus frowned, and his lips twitched. In the end, he did not utter a word."
      },
      {
        "paragraph": "He just stared at Sheryl and Rebecca silently. His distant eyes rested on Rebecca’s face for one to two\nseconds."
      },
      {
        "paragraph": "In the past, he was not unconcerned about Rebecca’s scheming mind. He just considered her as\nSheryl’s daughter at that time, so he let her be for the sake of his marriage with Sheryl."
      },
      {
        "paragraph": "Everyone had a scheming mind."
      },
      {
        "paragraph": "However, Rebecca would be a bit too presumptuous if she tried to tear him and Sheryl apart right in\nfront of him."
      },
      {
        "paragraph": "If Titus were a fool, he would not have attained his current status."
      },
      {
        "paragraph": "On the surface, Rebecca seemed like she was advising him and Sheryl. However, she was actually\ndropping a hint to them that it was Catherine’s doing."
      },
      {
        "paragraph": "If he had not had a deep conversation with Catherine just now, he might have let Rebecca lead him by\nthe nose."
      },
      {
        "paragraph": "In fact, he would not be so worried if Matthew was with Catherine."
      },
      {
        "paragraph": "Nevertheless, if what Catherine said turned out to be true, then that would be troublesome."
      },
      {
        "paragraph": "After lighting a cigarette, Titus immediately asked his subordinates to investigate the issue in\nMelbourne."
      },
      {
        "paragraph": "At noon, his subordinates brought him some news. “Mr. Costner, we saw Willard’s dead body in\nMelbourne Police Station, but Young Master Costner is still nowhere to be found.”"
      },
      {
        "paragraph": "Willard was Matthew’s personal assistant."
      },
      {
        "paragraph": "Titus’s breathing hitched, and Sheryl had already leaped to her feet in agitation. “What else have you\nfound out?”"
      },
      {
        "paragraph": "“The police noticed signs of fighting at the scene. I assume Young Master Costner and Willard were\nattacked. Since Young Master Costner is quite skillful, he must’ve been mobbed by a group of people.”"
      },
      {
        "paragraph": "“Young Master Costner is very skillful, and Willard’s skills aren’t bad either. However, one of them is\nmissing, while the other is dead. In that case, they must’ve encountered a powerful master.” Rebecca’s\neyes reddened as she covered her lips. “It’s all my fault. If I hadn’t brought a group of bodyguards to\nHill Corporation, they wouldn’t have been beaten so badly by the Liona members. In that case,\nMatthew wouldn’t have had to bring only an assistant along.”"
      },
      {
        "paragraph": "Slightly moved by her words, Sheryl roared, “This must be Catherine’s plot. She injured all our\nbodyguards so that she could deal with Matthew alone.”"
      },
      {
        "paragraph": "After glancing at Sheryl’s agitated look, Titus could not help but say, “You might be right. I’ll immediately\nsend some people from Neah Bay over. I’ll visit the executive council now to pressure Nathan.”"
      },
      {
        "paragraph": "“What’s the point of pressuring him? By the time our people are here, it’ll be too late. I suggest we ask\nNathan to arrest Catherine straight away.” Sheryl was unhappy with Titus’s decision."
      },
      {
        "paragraph": "Titus opened his mouth for a while before he replied, “Alright. I’ll see if Nathan is willing to do that. It’s\nall my fault. You should just wait at home and don’t go anywhere for the sake of your safety. ”"
      },
      {
        "paragraph": "“Uncle Titus, are you worried that Catherine will harm Mom?” Rebecca asked worriedly."
      },
      {
        "paragraph": "“How dare she.” Sheryl scoffed. “If she dares attack me, I won’t let her out no matter how many people\nshe comes with.”"
      },
      {
        "paragraph": "Titus directly strode out with his long legs without saying anything."
      }
    ]
  },
  {
    "title": "Chapter 1622 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "After getting in the sedan, the passenger seat’s"
      },
      {
        "paragraph": "door opened. Titus’s assistant, Samuel Light, got in. “ President Costner, are we going to the prime\nminister’s office now?”"
      },
      {
        "paragraph": "Titus glanced at Samuel. “How long will it take for our bodyguards to recover?”"
      },
      {
        "paragraph": "Samuel was taken aback. “They’ve hurt their muscles and bones, so it’ll take two to three months at the\nvery least.”"
      },
      {
        "paragraph": "“Two to three months?” Titus’s head began to hurt. “I didn’t think I’d be fooled to this extent. ”"
      },
      {
        "paragraph": "“President Costner, I think Young Master Costner should be safe. Maybe Catherine and the others just\nwant to threaten you,” Samuel consoled him."
      },
      {
        "paragraph": "“You also think Catherine is the one who did it?” Titus faked a smile and asked."
      },
      {
        "paragraph": "“Is… Is it not her?” Samuel was shocked."
      },
      {
        "paragraph": "“Of course not. However, you can’t mention this in front of Sheryl.”"
      },
      {
        "paragraph": "Titus lit a cigarette. If he previously had 4o percent of trust in Catherine, he now had as much as 8o\npercent of trust in her."
      },
      {
        "paragraph": "He did not believe that Sheryl would give birth to such a hateful daughter like Rebecca."
      },
      {
        "paragraph": "“Don’t we still have two bodyguards? Ask them to monitor Sheryl closely. If she wants to do something,\ninform me immediately. But remember, don’t rouse Sheryl and Rebecca’s suspicions, ” Titus ordered."
      },
      {
        "paragraph": "Samuel was startled. “Monitor… Monitor the madam?”"
      },
      {
        "paragraph": "“Mm.”"
      },
      {
        "paragraph": "In the villa."
      },
      {
        "paragraph": "After Titus left, Sheryl stood up, and she suddenly felt dizzy."
      },
      {
        "paragraph": "“Mom, what’s wrong?” Rebecca quickly supported her."
      },
      {
        "paragraph": "“Perhaps it’s because I was worrying about Matthew last night and didn’t sleep well,” Sheryl said in\nannoyance."
      },
      {
        "paragraph": "“ I understand. You love Matthew a lot.” Rebecca sighed. “ I’m very worried about him too. But… But\nI’m afraid Prime Minister Snow won’t target Catherine. Prime Minister Snow’s nephew and Shaun are\ngood brothers. It was with Shaun’s help that Prime Minister Snow managed to assume the position\nearlier than expected too.”"
      },
      {
        "paragraph": "“You’re right.” Sheryl’s pretty face darkened."
      },
      {
        "paragraph": "“I’m afraid if we delay this longer, Matthew will be in grave danger.” Rebecca gritted her teeth. “Since\nthey dared to kidnap your son and kill your men, let’s just…”"
      },
      {
        "paragraph": "“Just what?” Sheryl asked hastily."
      },
      {
        "paragraph": "“I know… Catherine has a pair of fraternal twins,” Rebecca whispered."
      },
      {
        "paragraph": "Sheryl was stunned. “You’re asking me to kidnap those two kids…”"
      },
      {
        "paragraph": "“We can just kidnap them and not hurt them. We’ll threaten Catherine and ask her to hand Matthew\nover. Of course, if she doesn’t hand him over, we can’t hurt the children too. The children are innocent.\nHowever, Catherine surely cares about her children. Perhaps she’ll…” Rebecca said hesitantly."
      },
      {
        "paragraph": "Sheryl quickly understood, but she had never done that kind of thing before."
      },
      {
        "paragraph": "“Mom, I’m also worried that Matthew… will die if we keep delaying this.” Rebecca bit her lips and said,\n“Think about it. Willard is dead. When Matthew fought them, he must’ve gotten hurt too. What matters\nis whether he has been gravely injured or not…”"
      },
      {
        "paragraph": "At that moment, Sheryl’s ongoing headache hurt even more intensely from Rebecca’s words. It was as\nif someone was squeezing her heart. She blurted, “ Okay, let’s do as you said. But we don’t have any\nmore people in our hands…”"
      }
    ]
  },
  {
    "title": "Chapter 1623 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“As long as there’s money, is there anything we can’t do? Mom, don’t worry. I’ll make sure they don’t\nhurt the children.” Rebecca guaranteed it again."
      },
      {
        "paragraph": "At the hospital."
      },
      {
        "paragraph": "Catherine was also thinking about the matter regarding Matthew. She was slightly worried."
      },
      {
        "paragraph": "Feeling uneasy, she gave Chase a call. Only then did she find out that Matthew had gone missing in\nMelbourne and that his assistant was dead too."
      },
      {
        "paragraph": "“Rin, how is this Matthew related to you?” Chase was very curious."
      },
      {
        "paragraph": "“He’s my brother from a different father.” Catherine sighed. “ I suspect it’s Wesley’s doing. How is the\nLyons family’s influence in Melbourne?”"
      },
      {
        "paragraph": "“You’re talking about the Lyons family?” Chase tutted. He was slightly pissed off. “Originally, we, the\nHarrison family, were considered the big boss in Melbourne. However, who could have thought that\nGolden Corporation would be on a roll? Now, more than go percent of the people in power here are\nsupporting Wesley, and he even wants to win over the Harrison family. Even so, I’m not interested in\nthat dude. The Lyons family has been obstructing us a lot anyway. If it weren’t for…”"
      },
      {
        "paragraph": "“If it weren’t for?” Catherine asked in a hurry."
      },
      {
        "paragraph": "Chase said dejectedly, “If it weren’t for our collaboration with Forrest, the Harrison family might’ve not\nbeen able to stay in Melbourne. Some time ago, I was even thinking of going to Canberra to develop\nmy career. However, I gave up on that idea when I saw Shaun’s situation. I didn’t want to give you guys\nmore trouble.”"
      },
      {
        "paragraph": "“Why didn’t you tell us about this?” Catherine was annoyed that she did not notice Wesley’s power\nexpansion in Melbourne. If not, she would have reminded Matthew to be stealthy."
      },
      {
        "paragraph": "Matthew must not have expected it too. He went to Melbourne for investigation overtly, only for the\nnews to reach Wesley’s ears."
      },
      {
        "paragraph": "“You and Shaun have been facing a lot of troubles, so I didn’t want to disturb you guys.” Chase said in\nannoyance, “That b*stard, Wesley, is like a cockroach that won’t die. He’s so annoying. You guys have\nto be careful.”"
      },
      {
        "paragraph": "Catherine smiled bitterly. She did not tell Chase that Shaun had become a fool."
      },
      {
        "paragraph": "At that moment, a nurse called from behind. “ Shaun’s family, please come over quicHy…”"
      },
      {
        "paragraph": "“I’ll talk to you again next time.” Catherine rushed back to the ward, where she saw Shaun crying out\nloud. “I don’t want to get an injection. I don’t want an injection…”"
      },
      {
        "paragraph": "The nurse watched as a handsome guy cried with tears and snot rolling down his face. She looked\nweirded out. “Miss Jones, you have to persuade him. If he doesn’t get on the IV, his injuries will\nbecome inflamed.”"
      },
      {
        "paragraph": "“Okay, I’ll persuade him now.”"
      },
      {
        "paragraph": "Catherine did not care that there were people at the scene. She quickly hugged Shaun and coaxed\nsoftly, “ Shaunny, if you don’t get injected, you’ll have a headache and fever. If that happens, you’ll\nhave to stay in the hospital for a long, long time and get injections every day. Are you willing to do\nthat?”"
      },
      {
        "paragraph": "“But… injections are painful. ” Shaun pouted while whining."
      },
      {
        "paragraph": "“Why don’t we do it this way? As long as you be a good boy and take your injections, I’ll get candies"
      },
      {
        "paragraph": "for you, okay?” Catherine had no choice but to use her trump card. Anyway, he was an old man who\nwas over 3o years old, so it was okay to eat more sweets."
      },
      {
        "paragraph": "“…I want to watch cartoons too.” After some thought, Shaun added with a sobbing voice."
      },
      {
        "paragraph": "“Okay.” Since Shaun was an old man, she could let him be even if he turned blind. Catherine did not\nhave to worry about that at all."
      },
      {
        "paragraph": "Finally, Catherine managed to coax that little master. The nurse glanced at her sympathetically."
      },
      {
        "paragraph": "It was not easy being a wife and a mom."
      },
      {
        "paragraph": "Although Shaun whined for a while again during the injection, he stopped crying when Catherine\nplayed some cartoons for him to watch."
      },
      {
        "paragraph": "After that, Catherine asked Elle to go downstairs to get some snacks as Hadley had no children and did\nnot know what to buy. Catherine had Elle buy some chocolates and cookies that Suzie loved to eat."
      }
    ]
  },
  {
    "title": "Chapter 1624 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "After Elle brought the snacks to the ward, Shaun ate the chocolates with gusto."
      },
      {
        "paragraph": "Hadley could cry upon seeing that. “I finally know whose likings the Little Miss took after.”"
      },
      {
        "paragraph": "Why did he not realize before that Young Master Hill liked eating chocolates?"
      },
      {
        "paragraph": "Catherine thought, ‘Shaun was abused by his nanny when he was young, so he always restrained\nhimself. After that, he was sent to the mental hospital. How would he have chocolates to eat?’"
      },
      {
        "paragraph": "She just took it as returning Shaun his happy childhood by treating him better from now on."
      },
      {
        "paragraph": "In the evening, Chester, Rodney, and Freya came over."
      },
      {
        "paragraph": "Shaun was resting against the bed, watching PAW Patrol intently. He even had a chocolate cookie in\nhis hands and a serious expression on his face. He did not notice those who had come in at all."
      },
      {
        "paragraph": "“F*ck, Shaun. How did you end up like that?” Rodney was heartbroken. “You’re even eating chocolates\nand watching PAW Patrol. Are you still the Shaun that I know?”"
      },
      {
        "paragraph": "Rodney went on talking for a long while, yet Shaun still paid him no attention. The latter even took a\nbite of the chocolate cookie, looking satisfied."
      },
      {
        "paragraph": "Freya lifted the milk and Dove chocolates in her hands. She smiled bitterly and said to Catherine, “ I\nfinally understand why you told me to buy these and bring them over.”"
      },
      {
        "paragraph": "“Put them here.” Catherine took the stuff from Freya’s hands."
      },
      {
        "paragraph": "Freya patted Catherine on the shoulder. She really sympathized with her best friend. “Are you okay? I\nrealize that… you and Shaun have too many obstacles. Why don’t you just leave him?”"
      },
      {
        "paragraph": "“Freya, what are you talking about?” Rodney was unhappy with her words. “Don’t you see how pitiful\nShaun is now?”"
      },
      {
        "paragraph": "“He’s pitiful, but isn’t our Cathy pitiful as well? She’s still so young. Who knows when Shaun will\nrecover?” Freya was pissed off. “In my opinion, a problematic person like Shaun isn’t suited to have a\nwife at all. Besides, if it weren’t for him getting deceived by Sarah back then, there wouldn’t be so many\nf*cking problems now.”"
      },
      {
        "paragraph": "Rodney opened his mouth. His beautiful face looked conflicted. “That… That’s not possible, right?\nDoes Sarah have such capabilities?”"
      },
      {
        "paragraph": "“I told you that Shaun was hypnotized by Sarah, yet you didn’t believe me. Otherwise, why do you think\na perfectly fine person would suddenly end up like that?” Chester said helplessly, “It’s as if there’s a\nbomb in Shaun’s head, and Sarah lit it up.”"
      },
      {
        "paragraph": "Rodney was confused. He did not understand why Sarah became so evil?"
      },
      {
        "paragraph": "“Young Master Jewell, have you consulted those psychologists and neurologists? How’s your research\ngoing?” Catherine asked."
      },
      {
        "paragraph": "Chester stared at her with a complicated look in his eyes. “Top psychologists have heard of that\nhypnotic skill before. It’s a forbidden skill that has been banned in Country Y for more than 1oo years.\nSo far, there is no news of recovery cases after being hypnotized. However, I’ve already requested the\npsychologists in Country Y to investigate the related historical documents. Let’s hope they can find a\nclue from there.”"
      },
      {
        "paragraph": "“Okay. ” Catherine sighed. It was better than having no hope at all."
      },
      {
        "paragraph": "Rodney miserably walked up to Shaun’s side and"
      },
      {
        "paragraph": "tried to please him. “Shaun, can you give me some of your chocolate cookies?”"
      },
      {
        "paragraph": "Shaun glanced at him. Then, he glanced at the tempting cookie in his hand before he quickly stuffed it\ninto his mouth and finished it with a crunch."
      },
      {
        "paragraph": "Although Shaun only had the mental age of two, he was still so mean."
      },
      {
        "paragraph": "Chester laughed. “It seems like his intelligence is improving.”"
      },
      {
        "paragraph": "“That’s right.” Catherine could sense it too. “He’s just like a baby now. There are many things that I\nhave to teach him hands-on, but he’s able to learn all of them quickly.”"
      }
    ]
  },
  {
    "title": "Chapter 1625 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rodney nodded his head thoughtfully. “Then I can teach Shaun to date. Soon, you’ll be in a relationship\nwith Shaun again.”"
      },
      {
        "paragraph": "Speechless, Freya roasted him, “Shaun only has the intelligence of a two-year-old right now. He simply\ntreats Cathy as an aunty. You can teach him to date, but do you think he’ll date an aunty?”"
      },
      {
        "paragraph": "Catherine felt like she was stabbed in the heart."
      },
      {
        "paragraph": "Freya added, “Besides, you were single for 30 years. Do you think you can teach Shaun how to date\nwith those abilities of yours? Forget it. Don’t mislead him.”"
      },
      {
        "paragraph": "Rodney’s temple throbbed. “ Freya Lynch, no one will think you’re a mute even if you don’t speak. ”"
      },
      {
        "paragraph": "Freya glanced at him, unimpressed. “You can’t get angry just because I told the truth. Men should be\nmore big-hearted.”"
      },
      {
        "paragraph": "Rodney glanced at Freya’s huge belly. He took a deep breath and did not say a word in the end."
      },
      {
        "paragraph": "Instead, he took his phone out and opened a game. He went to Shaun’s side. “Come here, ol’ Shaun.\nI’ll teach you to play mobile games, okay?”"
      },
      {
        "paragraph": "Shaun’s handsome brows frowned. “I’m not old. ”"
      },
      {
        "paragraph": "“Oh, I misspoke. I’ll call you Shaunny too, okay?” Rodney smiled and said, “Watching cartoons isn’t\ninteresting. This game is very fun…”"
      },
      {
        "paragraph": "Before he could finish his sentence, Chester took his phone away."
      },
      {
        "paragraph": "“Chester, what are you doing?” Rodney was not happy. “He’s not really a kid anyway. What’s wrong\nwith playing some games?”"
      },
      {
        "paragraph": "“If you have so much time to play games, why don’t you read him some books, watch television with\nhim, or teach him how to read? What he urgently needs right now is to level up his mental age of two.”\nChester disapproved of Rodney’s actions. “Looking at you, I’d suggest you don’t meddle in your child’s\neducation. Your wife is right. You’re misleading people.”"
      },
      {
        "paragraph": "“Did you hear that? Even your brother supports me. ” Freya was smug after hearing Chester. She even\ndid not mind how Chester used the words “your wife” to describe her."
      },
      {
        "paragraph": "Rodney pouted. With that, he had no choice but to put away his phone."
      },
      {
        "paragraph": "Luckily, Shaun was not curious about it, and he quickly immersed himself in the cartoon’s plot again."
      },
      {
        "paragraph": "After half an hour, Rodney and Freya stood up and left."
      },
      {
        "paragraph": "Catherine saw them out."
      },
      {
        "paragraph": "“By the way, Titus went to see my uncle today.” Rodney suddenly said, “I don’t know what they talked\nabout.”"
      },
      {
        "paragraph": "Catherine’s heart skipped a beat. However, she quickly got over it. Worse things had already happened\nanyway, so she had nothing to fear."
      },
      {
        "paragraph": "“Young Master Jewell, please find out Sarah’s whereabouts for me.” Catherine said, “Even if I don’t\nhave evidence to prove that she’s involved with this matter, I don’t want her to have a good life.”"
      },
      {
        "paragraph": "“She has gone to the US to attend a discussion forum held by psychologists,” Chester said."
      },
      {
        "paragraph": "“That’s too much of a coincidence, ” Freya muttered."
      },
      {
        "paragraph": "“ She has gone to hide first. ” Catherine sneered. “ We’ll talk about this again when she returns. Let’s\nsee if she can stay away forever. Young Master Snow, if you want to save her, we can only be\nenemies.”"
      },
      {
        "paragraph": "“I’ve already ended things with her a long time ago. Shaun is my brother, so I’m also very upset to see\nhim like that. I won’t help Sarah anymore.” Rodney quickly cut all his connections with Sarah."
      },
      {
        "paragraph": "Freya glanced at him coldly. “If you dare help Sarah again, I’ll disable your d*ck.”"
      },
      {
        "paragraph": "“Are you crazy?” Rodney shuddered. The woman’s gaze made him feel like she was not joking at all."
      },
      {
        "paragraph": "In the evening, Catherine took Shaun to undergo a series of tests again. When they returned to the\nward, it was already nighttime."
      },
      {
        "paragraph": "Lea brought the two children over and sent dinner. Suzie and Lucas sat on the bed, accompanying\nShaun to eat."
      },
      {
        "paragraph": "“Shaunny, watch. This is how you hold the spoon to eat.” Suzie became a little teacher. “Don’t drop the\nnoodles.”"
      }
    ]
  },
  {
    "title": "Chapter 1626 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Just as Suzie said it, Shaun accidentally dropped some noodles from the fork, making a mess on the\ntable."
      },
      {
        "paragraph": "“Stupid, ” Suzie scolded. Her tone sounded the same as when Lucas used to mock her."
      },
      {
        "paragraph": "Shaun blinked his eyes. Then, he pouted in Catherine’s direction and started crying. “ Cathy, I’m not\nstupid…”"
      },
      {
        "paragraph": "“Alright, you’re not stupid. Shaunny is the smartest. ” Catherine quickly hugged his head and secretly\nswept a glance at Suzie."
      },
      {
        "paragraph": "“Mommy, that was how you taught me, and I learned it right away,” Suzie said as she pouted."
      },
      {
        "paragraph": "“Are you sure you learned it right away?” Lucas roasted her."
      },
      {
        "paragraph": "“…No matter what, seeing Daddy in this state, teaching him is my responsibility.”"
      },
      {
        "paragraph": "The corners of Catherine’s mouth twitched. “ Enough, you guys should quickly eat. I’ll feed him.”"
      },
      {
        "paragraph": "After she spoke, she held the bowl and started feeding Shaun spoon by spoon."
      },
      {
        "paragraph": "Suzie felt aggrieved. “Mom, when I was two years old, you were very strict with me eating by myself. ”"
      },
      {
        "paragraph": "Lucas rolled his eyes at her. “That’s her husband. She loves him. Don’t be a busybody.”"
      },
      {
        "paragraph": "Suzie harrumphed. “I finally understand. I’m not as important to Mommy as Daddy.”"
      },
      {
        "paragraph": "Catherine could not stand it. Suzie was even jealous of Shaun."
      },
      {
        "paragraph": "“Okay, quickly finish your food and go back to the manor with Granny. Remember to be punctual at\npreschool tomorrow,” Catherine said tiredly."
      },
      {
        "paragraph": "The two children obediently finished their meal. When Suzie was about to leave, she even took the box\nof Dove chocolate from the table. “Mommy, this isn’t good for the teeth. I’ll take this away for you.\nLeaving it here is a waste of space.”"
      },
      {
        "paragraph": "Shaun began to cry when he saw that. “No, no. Cathy, she… she took my… candies away…”"
      },
      {
        "paragraph": "Suzie said with a serious expression, “Shaunny, your teeth will be bitten by bugs if you eat too many\nchocolates. By then, you’ll look very ugly, your teeth will hurt, and there’ll be lots of bugs in your\nstomach. Cathy won’t like you anymore.”"
      },
      {
        "paragraph": "“I want Cathy to like me…”"
      },
      {
        "paragraph": "Shaun was so startled that there were still teardrops on his eyelashes. That pitiful look almost made\nCatherine’s heart melt."
      },
      {
        "paragraph": "“Suzie, you can only take one chocolate. Your daddy’s friend gave it to him.” Catherine said to her\ndaughter, “Don’t scare him. He has the body of an adult, so eating some chocolates is fine.”"
      },
      {
        "paragraph": "Suzie stomped her feet. “Hmph. Mom, you’re just spoiling him.”"
      },
      {
        "paragraph": "“Alright, your daddy is still sick. Granny will buy them for you.” Lea found it hilarious, and she quickly\ncarried her little granddaughter."
      },
      {
        "paragraph": "Catherine’s head hurt. “Aunty Lea, don’t buy so many candies for her.”"
      },
      {
        "paragraph": "“Mom, don’t worry. I’ll control Sis properly, ” Lucas said sternly."
      },
      {
        "paragraph": "“Thank you, Lucas.” Catherine was relieved. At least there was still a sensible person."
      },
      {
        "paragraph": "As soon as the ward fell silent, Shaun suddenly let out a hmph. “Cathy, I don’t like… that… Sister.”"
      },
      {
        "paragraph": "‘Dude, that’s not your sister. She’s your daughter,’ Catherine thought."
      },
      {
        "paragraph": "“Shaunny, Suzie’s right. You can eat chocolates, but you can’t have too many. Having too many\nchocolates will make you fat. By that time, you won’t be as handsome as you are now, and I like\nhandsome men,” Catherine said seriously."
      },
      {
        "paragraph": "Shaun was taken aback. He fell into a dilemma.“"
      },
      {
        "paragraph": "But I’m not a man. I’m a baby.”"
      }
    ]
  },
  {
    "title": "Chapter 1627 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“But I don’t want to… become a fatty. I want to be… handsome. I want you to like me.” Shaun raised\nhis head, his clear eyes looking very serious."
      },
      {
        "paragraph": "Catherine’s pretty face was reflected in his eyes."
      },
      {
        "paragraph": "Catherine’s heart was doused in honey from his gaze."
      },
      {
        "paragraph": "Although Shaun was acting silly now, his hair had been shaved into a crew cut after he got hurt. His\nchiseled, good-looking face was utterly handsome."
      },
      {
        "paragraph": "In the past, he was very handsome when he had a stern expression."
      },
      {
        "paragraph": "However, his naive look at that moment was very cute too."
      },
      {
        "paragraph": "“Mm, I like you a lot now.” Catherine could not resist it. She lowered her head and kissed Shaun on the\nlips."
      },
      {
        "paragraph": "Shaun blinked his thick eyelashes. Then, he kissed her back on the lips as well. “Cathy, I like you\ntoo…”"
      },
      {
        "paragraph": "Although Catherine clearly knew that what he had for her was pure adoration and definitely not"
      },
      {
        "paragraph": "romantic feelings, her heart still could not help but start to throb."
      },
      {
        "paragraph": "She lowered her head and kissed him again. “ Shaunny, open your mouth.”"
      },
      {
        "paragraph": "Shaun was confused."
      },
      {
        "paragraph": "He did not think too much and simply listened to Catherine’s words."
      },
      {
        "paragraph": "“Shaunny, close your eyes…”"
      },
      {
        "paragraph": "“Oh.”"
      },
      {
        "paragraph": "Shaun quickly closed his eyes obediently."
      },
      {
        "paragraph": "He thought that Catherine’s lips were soft and sweet. He liked them very much."
      },
      {
        "paragraph": "After kissing for a long time, Shaun felt his body becoming hotter."
      },
      {
        "paragraph": "However, Catherine pulled away at that moment."
      },
      {
        "paragraph": "Shaun pressed his lips together. “Cathy… Your mouth… is more delicious than chocolate.”"
      },
      {
        "paragraph": "Catherine’s face heated up from feeling awkward. She felt like she was an indecent hoodlum. Shaun\nwas so innocent right now, yet she did not even spare him. “Shaunny, you must remember this."
      },
      {
        "paragraph": "Only I can kiss you the way I did just now. Other people can’t kiss you like that.”"
      },
      {
        "paragraph": "“Why?” Shaun was puzzled."
      },
      {
        "paragraph": "“Because… Because this part of you is mine. Do you know that?” Catherine tapped his delicate-looking\nlips."
      },
      {
        "paragraph": "“ Oh, I’m yours… ” Shaun nodded, but he seemed like he did not fully understand her. Then, he smiled\ngoofily."
      },
      {
        "paragraph": "His smile was like the bright sun."
      },
      {
        "paragraph": "Catherine’s heart was about to melt. She quickly changed the topic. “Come, I’ll feed you.”"
      },
      {
        "paragraph": "Shaun obediently ate a bowl of rice."
      },
      {
        "paragraph": "After he finished eating, Catherine had some food too. Then, she rolled up her sleeves. “You have to\ntake a bath today. I’ll prepare your clothes for you. ”"
      },
      {
        "paragraph": "After everything was prepared, Catherine brought Shaun to the bathroom."
      },
      {
        "paragraph": "He had a wound on his head and it could not be in contact with water, so he could only take a shower."
      },
      {
        "paragraph": "Catherine went on her tiptoes and helped Shaun to unbutton his hospital garment. She was familiar\nwith his body, but it was her first time helping him bathe. Catherine’s small face flushed hot due to\nawkwardness."
      },
      {
        "paragraph": "Shaun innocently looked at her and let himself be moved around by Catherine. However, as he was\nshowering, he suddenly felt that his body was having a weird reaction. When he spoke, his throat was\nvery hoarse. “Cathy, I… I feel uncomfortable.”"
      },
      {
        "paragraph": "Catherine was dumbfounded."
      },
      {
        "paragraph": "Did Shaun not injure that part of his body after getting stabbed in prison last time? After they got back\ntogether, they never really had sex before. He had even looked for andrologists for medical\nconsultations previously."
      },
      {
        "paragraph": "Catherine knew that Shaun had always been uncomfortable about this. She could only encourage him\nin silence."
      },
      {
        "paragraph": "However… How did he suddenly recover?"
      },
      {
        "paragraph": "F*ck, he had the intelligence of a two-year-old with a perfectly healthy body."
      },
      {
        "paragraph": "The heavens might have shut his doors, but they opened a window for him as well."
      }
    ]
  },
  {
    "title": "Chapter 1628 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine was on the verge of crying. Were the heavens playing a prank on her?"
      },
      {
        "paragraph": "“Cathy…” Shaun lowered his head and looked at Catherine. Due to the steam from the hot shower, his\ndark eyes looked as though he was about to cry."
      },
      {
        "paragraph": "Catherine gazed at his thin, red lips. She suppressed her embarrassment and circled his neck. She\nkissed him softly. “Good boy. It’s okay. I’m right here…”"
      },
      {
        "paragraph": "After bathing, it was 8:00 p.m."
      },
      {
        "paragraph": "Catherine had made do and bathed with Shaun as well. After changing into a new set of clothes,"
      },
      {
        "paragraph": "Shaun lay down on the bed with a satisfied expression."
      },
      {
        "paragraph": "On the other hand, Catherine still felt a little awkward and dumbfounded."
      },
      {
        "paragraph": "She was thinking about whether to call Chester to ask him why the problem of Shaun’s sexual\ndysfunction had suddenly recovered. However, she thought that such matters were very awkward to\ntalk about, so she just let it slide."
      },
      {
        "paragraph": "After she woke up the next day, she was still in a blur. Shaun came close and kissed her again. “ Cathy,\nI feel uncomfortable again.”"
      },
      {
        "paragraph": "Catherine felt that she was doomed."
      },
      {
        "paragraph": "What happened to Shaun having the intelligence of a two-year-old? Why did she feel like he was\nimproving tremendously in that area and was even better than before?"
      },
      {
        "paragraph": "Of course, not long after, someone knocked on the door outside."
      },
      {
        "paragraph": "Catherine quickly pushed him away. “The doctor is here. Be good. You can’t be like this anymore.”"
      },
      {
        "paragraph": "“Why?” Shaun pouted. He had an unwilling expression."
      },
      {
        "paragraph": "“Because we can only kiss in private. I’ll feel embarrassed if someone sees us. If you don’t listen to me,\nI won’t care about you anymore. ” Catherine had no choice but to threaten him."
      },
      {
        "paragraph": "Shaun looked unsure of what she meant, but he was afraid that Cathy would ignore him. Therefore, he\nnodded his head obediently."
      },
      {
        "paragraph": "Catherine took a blanket to cover his body. She only went to open the door after tidying up a little."
      },
      {
        "paragraph": "It was Chester and two other doctors who were experts in neurology and psychology respectively."
      },
      {
        "paragraph": "“We’re here to visit Shaun.” Chester raised his eyebrows. “Did you just wake up? It’s already 8:30 a.m.”"
      },
      {
        "paragraph": "“… I was too tired, so I overslept, ” Catherine replied. She could not possibly say that she and Shaun\nhad already woken up, just that they were ‘ lying in bed’."
      },
      {
        "paragraph": "“We came to have a look at Shaun’s condition today, ” Chester explained, “If his injury has recovered,\nyou guys can be discharged as soon as possible.”"
      },
      {
        "paragraph": "Catherine nodded. She wanted to go back as soon as possible as well. Staying at home was definitely\nmore comfortable."
      },
      {
        "paragraph": "The neurologist walked to the bedside and asked Shaun, “Does your head still hurt today?”"
      },
      {
        "paragraph": "Shaun gazed at the doctor’s white robe. He shook his head in fear. “I’m not getting an injection.”"
      },
      {
        "paragraph": "“Don’t be scared. There won’t be an injection, but you have to stay still.” The doctor examined"
      },
      {
        "paragraph": "Shaun’s head. He asked again, “Do you feel uncomfortable anywhere? You have to reply honestly,\nokay?”"
      },
      {
        "paragraph": "After thinking about it seriously for a while, Shaun lifted the blanket and pointed to a spot near his\nwaist. He said aggrievedly, “It’s uncomfortable here.”"
      },
      {
        "paragraph": "Catherine had the urge to dig a hole and bury herself in it. She pretended that she was blind and could\nnot see what was going on."
      },
      {
        "paragraph": "“Ahem, Shaun has recovered?” Chester recovered from the shock. He held a fist to his mouth and\ncoughed twice."
      },
      {
        "paragraph": "“That’s right. Why did he suddenly recover? I just found out about it too.” Catherine acted shocked and\ninnocent with a flushed face. She quickly went over and covered Shaun with the blanket."
      },
      {
        "paragraph": "The doctors calmed down. One of them cleared his throat and said kindly, “This is normal. Hmm… I\nthink he can be discharged tomorrow.”"
      },
      {
        "paragraph": "“Really?” Catherine was delighted."
      },
      {
        "paragraph": "“Mm, there’s not much problem with his external injury. This is a problem with the internal part of his\nbrain. His recovery can’t be hastened.” The doctors then left."
      },
      {
        "paragraph": "When Chester was about to leave, he smiled ambiguously and said, “It seems like I don’t have to go\noverseas to look for an andrologist for Shaun anymore. This is surprising. He just miraculously\nrecovered.”"
      }
    ]
  },
  {
    "title": "Chapter 1629 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“That’s right. I didn’t expect it either.” After some time, Catherine showed a rueful look."
      },
      {
        "paragraph": "Chester gave her a profound glance. He did not say anything else about that matter and just said, “You\nshould bring him to the andrology unit for a check- up today just in case, so you can confirm whether\nit’s just temporary or if he has really recovered. I’ll inform Doctor Leonard, who has been following up\non his case.”"
      },
      {
        "paragraph": "“Thank you.”"
      },
      {
        "paragraph": "“No need. Shaun is my friend after all.” A hint of sadness flashed across Chester’s eyes."
      },
      {
        "paragraph": "He and Shaun had known each other for a long time. Shaun was probably the person who knew him\nthe best. He did not expect that things would turn out like this in the end."
      },
      {
        "paragraph": "Catherine saw everything. Even though Chester would not make a good husband or boyfriend, he was\nabsolutely amazing as a brother and a friend."
      },
      {
        "paragraph": "After having lunch in the afternoon, Catherine brought Shaun to the andrology unit."
      },
      {
        "paragraph": "There were not many people around at this time, so they did not have to worry that someone would\nspot them."
      },
      {
        "paragraph": "Doctor Leonard had been entrusted with this important task by Chester, so he stayed back and worked\novertime."
      },
      {
        "paragraph": "At first, Shaun was not really willing to follow Doctor Leonard into the examination room. Hence,\nCatherine tried hard to persuade him. She used chocolates and the television to coax him. Finally, she\nmanaged to get him to go inside."
      },
      {
        "paragraph": "However, not long after Shaun went in, his cries were heard from inside the room. “You can’t take it\noff… You’re not allowed to take it off! Cathy said that no one is allowed to take off my pants except her.”"
      },
      {
        "paragraph": "Catherine pretended to be deaf. That was right, she did not hear anything."
      },
      {
        "paragraph": "Doctor Leonard came out of the examination room resignedly. “Miss Jones, please come in and lend a\nhand to persuade him. He’s strong. There’s nothing else I can do.”"
      },
      {
        "paragraph": "Catherine felt embarrassed, but she could only bite the bullet and enter the room."
      },
      {
        "paragraph": "Inside the room, Shaun was holding tightly onto his pants. His eyebrows, nose, and mouth were almost\nbunched together. He looked as though he would rather die than surrender."
      },
      {
        "paragraph": "Catherine walked to his side. She bent over and patted his short, dark hair. “Shaunny, listen to the\ndoctor. He wants to examine you.”"
      },
      {
        "paragraph": "Shaun pouted his pink lips confusedly. “But you said… I can’t let anyone else take off my pants. Only\nyou can do that.”"
      },
      {
        "paragraph": "“Ahem.” Doctor Leonard, who was lowering his head and drinking water, quickly used the cup to block\nhis face. He pretended as though he had not heard a thing."
      },
      {
        "paragraph": "Catherine desperately wanted to dig a hole and bury herself in it. However, at that moment, she could\nonly bite the bullet and say, “This doctor can do it too. He just wants to check whether you’re healthy or\nnot. Just this once. Be good, okay?”"
      },
      {
        "paragraph": "“Mm, okay…” Shaun agreed reluctantly."
      },
      {
        "paragraph": "After finally persuading that little master, Catherine headed outside, relieved."
      },
      {
        "paragraph": "Behind her, Shaun said to the doctor, “Okay, you can take off my pants, but you… Can’t simply touch\nme. Catherine said that only she can touch it.”"
      },
      {
        "paragraph": "Catherine stumbled and almost fell."
      },
      {
        "paragraph": "After finally finding her balance, she quickly ran out."
      },
      {
        "paragraph": "Her entire face went red."
      },
      {
        "paragraph": "She was still too embarrassed to raise her head even after Doctor Leonard and Shaun came out."
      },
      {
        "paragraph": "“Can the patient’s family come over?” Doctor Leonard waved his hand. “I’ve conducted a check-up.\nHe’s very healthy.”"
      },
      {
        "paragraph": "Catherine asked awkwardly, “Then why was he like that before…”"
      },
      {
        "paragraph": "“Actually, I’ve already conducted many examinations on him before this. Although he was injured, his\nwound was already gradually recovering. I’ve told him before that it might be due to psychological\nreasons that he was unable to recover. Some men would have trauma after getting hurt.” Doctor\nLeonard smiled and said, “His mind is just like a plain sheet of paper right now. He"
      },
      {
        "paragraph": "doesn’t know that he was injured before, so he doesn’t feel any pressure. Maybe this is why he went\nback to normal.”"
      },
      {
        "paragraph": "Catherine understood."
      },
      {
        "paragraph": "However, it was still unknown whether this was misfortune or luck."
      }
    ]
  },
  {
    "title": "Chapter 1630 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "]"
      },
      {
        "paragraph": "“Alright, don’t worry too much. ” Doctor Leonard held a fist to his mouth and coughed. He smiled and\nsaid, “Your teachings are very precise. You can keep improving them.”"
      },
      {
        "paragraph": "Catherine was embarrassed."
      },
      {
        "paragraph": "She yanked Shaun and left the andrology unit with a flushed face."
      },
      {
        "paragraph": "“Cathy, your face is very red.” Shaun looked at her with a dumb expression. “Are you… having a fever\n“No.”"
      },
      {
        "paragraph": "Catherine realized that Shaun’s speech ability was improving tremendously. He was way better than\nother two-year-olds in this aspect."
      },
      {
        "paragraph": "After returning to the ward, Catherine gazed at Shaun with a serious expression. “Shaunny, in the\nfuture, you mustn’t say the words I’ve said to you out loud when there are outsiders around, okay?”"
      },
      {
        "paragraph": "The reply she got was Shaun’s dazed handsome face."
      },
      {
        "paragraph": "Catherine bit the bullet and gave an example. “For instance, what I said in private about how you can’t\nlet other people take off your pants, the parts that you can’t let others touch except me, or things like\nI’m the only one who can kiss your mouth… Don’t tell other people about these things.”"
      },
      {
        "paragraph": "Shaun blinked his eyes. After thinking hard about it, he said, “That won’t do. What if… What if someone\nwants to kiss me—”"
      },
      {
        "paragraph": "“You can just tell them ‘Please don’t kiss me’ and that they can’t touch that area, ” Catherine interrupted\nhim. “You don’t have to bring up our conversations to others.”"
      },
      {
        "paragraph": "]"
      },
      {
        "paragraph": "“ .. Oh.” Shaun nodded his head in a blur. “Why?” “Because… Because I’ll feel embarrassed.”"
      },
      {
        "paragraph": "Catherine looked straight into his eyes. “Moreover, I don’t treat you as a little baby.”"
      },
      {
        "paragraph": "“Then do you treat me like a big baby?” Shaun’s watery eyes glinted."
      },
      {
        "paragraph": "Catherine could not help but curse him in silence."
      },
      {
        "paragraph": "‘You’re not even a big baby. You’re already an old baby, okay?’"
      },
      {
        "paragraph": "“No, I treat you as the person I love.” Catherine rested her face on Shaun’s chest. “You don’t\nunderstand it now. But in the future, I’ll slowly teach you about love.”"
      },
      {
        "paragraph": "“Oh, I know. It’s just like how I love chocolates and cartoons.” Shaun nodded his head firmly."
      },
      {
        "paragraph": "Catherine laughed bitterly. What the hell could he possibly know?"
      },
      {
        "paragraph": "Forget it. She would teach him slowly."
      },
      {
        "paragraph": "5:00 p.m."
      },
      {
        "paragraph": "Catherine suddenly received a call from Aunty Yasmine."
      },
      {
        "paragraph": "“Catherine, we’re in trouble. Suzie has been kidnapped. ” Aunty Yasmine’s flustered voice came from\nthe phone. “ I just picked Suzie and Lucas up from preschool. On the way back to the manor, Suzie\nsaid she wanted to buy something to eat. I accompanied her down. Just as I was counting the money,\nshe was yanked onto a motorcycle by the rider and taken away. The driver and bodyguards chased\nafter the motorcycle with Lucas but it drove onto a mountain road. The car couldn’t go after it. ”"
      },
      {
        "paragraph": "“What?” The glass Catherine was holding fell to the floor and shattered."
      },
      {
        "paragraph": "Shaun was startled. He quickly sat up and looked at Catherine in a daze. “Cathy, what’s wrong?”"
      },
      {
        "paragraph": "Catherine had no time to care about him. She asked hastily, “Have you called the police?”"
      },
      {
        "paragraph": "“I have. I’ve also informed Elle and Madam Hill about it.” Aunty Yasmine started sobbing as she spoke,\n“Eldest Young Master Hill has gotten into an accident and Hill Corporation is in trouble as well. I’m\nworried that this is the doing of the Hill family’s enemies. Their intention isn’t to blackmail us. They just\nwant to get revenge.”"
      },
      {
        "paragraph": "If it were blackmailing and kidnapping, they did not have to be worried about Suzie’s safety."
      },
      {
        "paragraph": "However, if it was pure revenge… Catherine almost lost her footing."
      },
      {
        "paragraph": "“Mom, we must save Suzie.” Aunty Yasmine’s voice switched to Lucas’ voice all of a sudden. Usually,\nhe was such an indifferent boy. However, his voice was wavering as well now. “I’m sure this has\nsomething to do with Wesley and Rebecca. For Suzie’s safety, you should mobilize every member of\nLiona. No matter the result, we have to subdue both of them first.”"
      }
    ]
  },
  {
    "title": "Chapter 1631 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Don’t worry, Lucas. I’ll definitely rescue Suzie.” Catherine could only try her best to console Lucas."
      },
      {
        "paragraph": "Even without Lucas’ reminder, she knew that the kidnapping definitely had something to do with\nWesley and Rebecca."
      },
      {
        "paragraph": "She immediately dialed Elle’s number. “Do you know where Wesley and Rebecca are?”"
      },
      {
        "paragraph": "“Wesley has gone to Melbourne while Rebecca is in the Costner family’s villa.” Elle had been informed\nof the incident as well. She was very worried. “ I’ve noticed that there are many police and guards at\nthe Costner family’s villa lately. Maybe Prime Minister Snow mobilized them to protect the Costner\nfamily after something happened to Matthew.”"
      },
      {
        "paragraph": "Catherine’s face was pale."
      },
      {
        "paragraph": "Wesley had gone to Melbourne. Even if she risked everything to catch him, it would be too late."
      },
      {
        "paragraph": "“Elle, ask Hadley to come to the hospital to take care of Shaun. I’ll go to the Costner family’s villa.”"
      },
      {
        "paragraph": "Even if it was a lion’s den, Catherine had to capture Rebecca today."
      },
      {
        "paragraph": "“Miss Jones, I’ll go along with you,” Elle said."
      },
      {
        "paragraph": "Catherine hung up. She turned around and said to Shaun, “Shaunny, I’m heading out for a while. Stay\nin the ward and don’t go anywhere. Hadley will come over later.”"
      },
      {
        "paragraph": "Shaun was flustered upon hearing that. “I want to follow you.”"
      },
      {
        "paragraph": "“Be a good boy. Suzie is missing. I have to find her. Be obedient, Shaunny. If you dare run around, I\nwon’t care about you anymore. ” Catherine could not be bothered anymore. She simply turned around"
      },
      {
        "paragraph": "and left."
      },
      {
        "paragraph": "Elle’s car soon arrived. After Catherine got in, there were five or six cars behind her. The skilled\nmembers of Liona were inside the cars."
      },
      {
        "paragraph": "“I’ve brought all the remaining people in Liona. A small number of them have already gone to look for\nSuzie’s kidnapper, ” Elle explained."
      },
      {
        "paragraph": "“How’s the investigation going?” Catherine asked."
      },
      {
        "paragraph": "“There’s some progress. The kidnapper seems to be related to Big Boss Davis, who was just let out of\njail a week ago. Big Boss Davis committed all sorts of crimes in Canberra a few years back. After that,\nhe was caught due to a case. He knows quite a lot of gangsters. Usually, he’s involved in assaults,\nfights, and blackmailing. As long as there is money involved, he’ll do anything.”"
      },
      {
        "paragraph": "“Then it should have something to do with Rebecca. She’s been short of people recently, so she\nmust’ve spent money to hire these people.” Catherine clenched her fists. “I just don’t know the reason\nwhy Rebecca kidnapped Suzie. I’d rather she do it to threaten me.”"
      },
      {
        "paragraph": "Catherine was really afraid that after Rebecca had those people kidnap Suzie, they would kill her right\naway."
      },
      {
        "paragraph": "As she kept thinking about it, she became more afraid."
      },
      {
        "paragraph": "Suzie was her life. If she could save Suzie, she was willing to even give up her life."
      },
      {
        "paragraph": "On the way over, Catherine called Rodney. “Even if the police shoot me, I have to get into the Costner\nfamily’s villa today for Suzie’s sake.”"
      },
      {
        "paragraph": "“F*ck, Rebecca must be crazy. She won’t even spare a child. ” Rodney gasped when he heard about\nthe incident. “If there’s a confrontation when you arrive there, try to buy some time. I’ll come over\nimmediately. As long as I’m there, the security guards won’t dare to shoot.”"
      },
      {
        "paragraph": "“Thank you.” Catherine was grateful."
      },
      {
        "paragraph": "No matter how much she hated Rodney before, she was sincerely thankful to the people who were\nwilling to help her and Shaun during this period. “ Don’t tell Freya about this in case she comes over\nwith her big belly. It’s not safe.”"
      },
      {
        "paragraph": "“Okay, I know.” 50 minutes later."
      },
      {
        "paragraph": "A row of cars stopped at the villa’s entrance."
      },
      {
        "paragraph": "Catherine got down from the car. A row of security guards at the gate blocked Catherine. “Who are you\npeople?”"
      },
      {
        "paragraph": "“ I want to meet Rebecca and Sheryl. ” Catherine’s expression was cold."
      },
      {
        "paragraph": "The security guards glanced at the people behind her. One of them asked coldly, “Do you have an\nappointment?”"
      }
    ]
  },
  {
    "title": "Chapter 1632 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "The guard was met with silence. He said coldly, “ It’s obvious that you’re here to create a ruckus by\nbringing so many people here. Leave immediately. We have distinguished guests inside. If you want to\nbarge in, then I have no choice but to take my gun out.”"
      },
      {
        "paragraph": "There were more than ten security guards behind him."
      },
      {
        "paragraph": "Catherine felt as though her chest was about to burst from anger. However, she could only hold it in.\nShe could not lose her life due to recklessness. If that happened, she would not be able to rescue\nSuzie. “I want to meet Titus.”"
      },
      {
        "paragraph": "“President Costner isn’t here.”"
      },
      {
        "paragraph": "“I have to go in today no matter what. I suspect that the people inside kidnapped my child. She’s in\ndanger.” Catherine met the security guard’s gaze with red eyes."
      },
      {
        "paragraph": "The guard frowned. “Our duty is to protect the people inside. I can’t let you go in.”"
      },
      {
        "paragraph": "Catherine did not expect the guards of the Costner family’s villa to be so strict."
      },
      {
        "paragraph": "She took a deep breath and restrained herself. She took her phone out and called Titus."
      },
      {
        "paragraph": "The phone rang for more than ten seconds. When the call was connected, she said hastily, “Mr.\nCostner, I beg you. Please let me into your villa. I want to meet Rebecca. My child is missing. I’m sure\nthat it’s Rebecca who kidnapped her…”"
      },
      {
        "paragraph": "“Mom… ” Suzie’s voice sounded through the phone all of a sudden."
      },
      {
        "paragraph": "Catherine was stunned. She thought she had misheard it. “Suzie…”"
      },
      {
        "paragraph": "“Mom, it’s so scary. A bad guy kidnapped me. They even wanted to throw me into a pond. It was this\nuncle who saved me.” Suzie cried as she said, “ Mom, I miss you so much. I won’t go and buy candy\nanymore. It’s too scary.”"
      },
      {
        "paragraph": "Catherine’s heart almost cracked upon hearing Suzie’s words. “ Suzie, let me talk to the uncle who\nsaved you.”"
      },
      {
        "paragraph": "The voice on the other end of the call quickly changed to Titus’. “Wait there. I’ll come over soon. Your\nchild is okay.”"
      },
      {
        "paragraph": "“Thank you, Mr. Costner, ” Catherine said as she sobbed."
      },
      {
        "paragraph": "Titus’ heart felt uncomfortable hearing that. He exuded a dark and chilly aura."
      },
      {
        "paragraph": "He lowered his head and looked at the little girl in his arms, whose face was tear-streaked. Her small\nface was pink and round. She was wearing a pink princess dress. She was so cute that it could even\nmake a cold man like him go soft-hearted."
      },
      {
        "paragraph": "However, there was someone who was cruel enough to harm this child."
      },
      {
        "paragraph": "That person even wanted to take her life. Moreover, that person was his wife."
      },
      {
        "paragraph": "Titus found it unbelievable. Why did Sheryl, who was so lovely in the past, become like this?"
      },
      {
        "paragraph": "“Don’t cry, you’re okay now. I’ll bring you to where your mom is.” Titus patted Suzie’s head. He secretly\nplaced his hand at the back of her head and plucked a few strands of hair."
      },
      {
        "paragraph": "“It hurts.” Suzie hugged her head."
      },
      {
        "paragraph": "“I’m sorry. Grandpa’s hand was caught in your hair.” Titus calmly put the hair into his pocket."
      },
      {
        "paragraph": "“Grandpa?” Suzie widened her eyes. She even forgot she was crying. “Uncle, you’re so handsome.\nYou’re as handsome as my dad. Your eyes are blue too. Calling you ‘Grandpa’ would make you seem\ntoo old.”"
      },
      {
        "paragraph": "Titus was amused by her words. “According to seniority, you do have to call me ‘Grandpa’.”"
      },
      {
        "paragraph": "“Then I’ll call you ‘Handsome Grandpa’,” Suzie said as she lifted her gaze."
      },
      {
        "paragraph": "“Okay.” Titus pinched her pinkish little face. He had never interacted with a little girl before. He\nunconsciously asked, “Do you want to have candy?” Suzie shuddered, her face turning pale. “No, no. I\ndon’t dare to eat candy anymore. If I hadn’t wanted to eat candy, I wouldn’t have gotten kidnapped. I\nwouldn’t have been almost hit by a car last time either.”"
      }
    ]
  },
  {
    "title": "Chapter 1633 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Hit by a car?” Titus narrowed his eyes."
      },
      {
        "paragraph": "“Mm.” When Suzie recalled that incident, fear flashed across her petite face. “It was also because… I\nwanted to have cake. Then… Then a car came flying"
      },
      {
        "paragraph": "… because someone hit it. Luckily, Dad was amazing. He saved Lucas and me…”"
      },
      {
        "paragraph": "“Who hit the car?” Titus’ brows were knitted together in a tight frown."
      },
      {
        "paragraph": "“Lucas said it’s Meanie Wesley,” Suzie said angrily, “He’s a bad guy.”"
      },
      {
        "paragraph": "“Meanie Wesley?” Titus raised his eyebrows."
      },
      {
        "paragraph": "“Mm.” Suzie nodded her head firmly. Her fists were flying around as she was outraged. “In the past…\nhe was nice to us. But… It was all fake. Hmph, he’s a liar. He even beat Mom up. He also had an\naffair… Disgusting! ”"
      },
      {
        "paragraph": "“How does a little kid like you know so much?” Titus asked. “Your dad and mom told you these things?”"
      },
      {
        "paragraph": "“Lucas told me.” Suzie pouted. “He’s just older than me by a few minutes, but… he knows just a little bit\nmore than me…”"
      },
      {
        "paragraph": "Titus finally understood."
      },
      {
        "paragraph": "Catherine must have given birth to a pair of twins— a boy and a girl. Lucas must be her brother. “He\nknows quite a lot then.”"
      },
      {
        "paragraph": "“Just so-so.” Suzie was not very convinced. “He’s also a little stupid sometimes. He was tricked badly\nby Meanie Wesley. He even… wanted him… to be our dad.”"
      },
      {
        "paragraph": "Suzie was stammering, but Titus understood her words."
      },
      {
        "paragraph": "That Meanie Wesley she was talking about must be Wesley Lyons."
      },
      {
        "paragraph": "Children would not lie. Moreover, Catherine had not taught her children to say these things. It was also\na pure coincidence that he rescued Suzie today. There was no way Catherine and Shaun had planned\nto talk about these things in front of the children beforehand."
      },
      {
        "paragraph": "There was only one possibility—everything Suzie said was true."
      },
      {
        "paragraph": "“Suzie, where’s your dad?” Titus’ azure eyes looked gentle."
      },
      {
        "paragraph": "“Daddy…” Suzie’s eyes suddenly reddened. She sniffled and said, “He became stupid. He’s even\ncalling me his sister now.”"
      },
      {
        "paragraph": "Titus asked, “What happened?”"
      },
      {
        "paragraph": "“ I don’t know. ” Suzie lowered her head. She was clearly upset."
      },
      {
        "paragraph": "Titus rubbed her head and pressed his lips tightly together."
      },
      {
        "paragraph": "Half an hour later."
      },
      {
        "paragraph": "A car arrived at the gate of the Costner family’s villa."
      },
      {
        "paragraph": "The door of the sedan opened, and Suzie ran out of the car. She flung herself into Catherine’s embrace\nwhile crying. “Mommy, I was so scared.”"
      },
      {
        "paragraph": "“It’s okay, darling.” Catherine hugged Suzie tightly, her heart throbbing in pain. “Mommy’s here. Let me\nhave a good look at you.”"
      },
      {
        "paragraph": "She let go of Suzie and checked her body nervously."
      },
      {
        "paragraph": "Luckily, aside from her dress that got slightly dirty, and her braids that were a little messy, Suzie was\nnot hurt. However, the marks on her hands and legs showed she had been tied up with a rope."
      },
      {
        "paragraph": "“Tell me what happened. ” Catherine’s voice could not help but waver slightly."
      },
      {
        "paragraph": "“Mommy, those bad guys…put me into a bag. It was so scary.” Suzie appeared terrified as she cried.\n“They said… they’d throw me into a pond.”"
      },
      {
        "paragraph": "Catherine’s heart trembled. She could not imagine what would have happened if Titus had been slightly\nlate. Her child would have been thrown into a pond and drowned alive."
      },
      {
        "paragraph": "That image made her incomprehensibly angry. Had those people lost all of their humanity?"
      },
      {
        "paragraph": "What made her more disappointed was knowing the person behind the scenes who gave the orders."
      }
    ]
  },
  {
    "title": "Chapter 1634 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine desperately wanted Rebecca to die. She hated Sheryl too."
      },
      {
        "paragraph": "Although Sheryl was her biological mother, she still hated her."
      },
      {
        "paragraph": "It was okay for Sheryl not to like Catherine. It was forgivable that she was deceived and instigated by\nRebecca. However, if she condoned Rebecca kidnapping Catherine’s child, Catherine would never\nforgive her."
      },
      {
        "paragraph": "That was because it would mean that Sheryl was evil by nature."
      },
      {
        "paragraph": "“Suzie, I’m sorry. I didn’t protect you well. I’ll never let anything happen to you again in the future.”\nCatherine looked at her daughter intently and added silently, ‘Even if I have to risk going to jail, I must\nsend Rebecca, Wesley, and Sarah to jail.’"
      },
      {
        "paragraph": "That way, her children would be able to grow up safely."
      },
      {
        "paragraph": "Even if she had to lose her freedom for the rest of her life and be unable to stay by Shaun’s side, she\nhad to protect her children."
      },
      {
        "paragraph": "Titus looked at the mother and daughter with complicated feelings."
      },
      {
        "paragraph": "He was someone who had walked on both the bright and dark paths before, especially in places like\nNeah Bay. He had taken many lives with his hands, but he would never hurt innocent women and\nchildren."
      },
      {
        "paragraph": "He had also taught his son that men should be magnanimous."
      },
      {
        "paragraph": "However, at that moment, he felt like he was a murderer."
      },
      {
        "paragraph": "Their appearance had caused Catherine’s perfect family to be in distress every day."
      },
      {
        "paragraph": "“Thank you, Mr. Costner. ” Catherine carried Suzie and looked at Titus, who had a large build."
      },
      {
        "paragraph": "“There’s no need to thank me,” Titus said as his indifferent glance swept across the security guards."
      },
      {
        "paragraph": "He had asked Nathan to send these people over to protect them. Initially, he was worried that the\nmastermind behind the scenes would harm Sheryl. He did not expect that these guards would become\nRebecca’s shield instead."
      },
      {
        "paragraph": "Catherine noticed Titus’ gaze. She took a deep breath and said, “You’re right. However, while I’m\nthankful, I’m curious how you got to know about this matter and was able to save my daughter in time.”"
      },
      {
        "paragraph": "Titus’ dark gaze set on Catherine."
      },
      {
        "paragraph": "Catherine bit her lip and said, “I’m not suspecting you. I’m just wondering if it were the people on your\nside who did it?”"
      },
      {
        "paragraph": "“Go back.” Titus did not reply to her and headed inside."
      },
      {
        "paragraph": "However, Catherine blocked him. “Mr. Costner, I must go in today. Suzie might be okay now, but what\nabout tomorrow or the day after tomorrow? I have two children, and the person I love has become a\nretard now. I’m the only one who can protect them. You have a family too. You should understand my\nfeelings.”"
      },
      {
        "paragraph": "Titus halted his steps. He lowered his head and gazed at the woman in front of him."
      },
      {
        "paragraph": "He was too tall, making Catherine appear very short. Her frame was petite, and her beautiful, stunning\nface had become a lot more gaunt recently. However, she was standing upright, which reminded"
      },
      {
        "paragraph": "people of a sail. Even if she was weak, she would still send the people she loved to their destination."
      },
      {
        "paragraph": "Catherine added, “Since you rescued Suzie, that means you believe in the words I said before. To be\nhonest, I’m not sure how deeply you love your wife. Maybe you’re accepting of Rebecca because of\nSheryl. However, love should not be used as a blade to side with evil.”"
      },
      {
        "paragraph": "Titus frowned."
      },
      {
        "paragraph": "He only managed to save Suzie in time today because he had bodyguards keeping an eye on Sheryl\nand Rebecca."
      },
      {
        "paragraph": "When he heard from the bodyguards that Sheryl had agreed with Rebecca to hire people to kidnap the\nchild, he was shocked."
      },
      {
        "paragraph": "However, as her husband, he did not believe that Sheryl would become such a person all of a sudden."
      },
      {
        "paragraph": "“It’s not that I don’t want to help…”"
      },
      {
        "paragraph": "“Titus, why are you talking to that woman at the gate?”"
      },
      {
        "paragraph": "Sheryl suddenly walked out with Rebecca."
      },
      {
        "paragraph": "They were separated by an automatic gate. When Catherine saw Sheryl’s cold expression, a fire\nignited in her heart."
      }
    ]
  },
  {
    "title": "Chapter 1635 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Sheryl and Rebecca saw Suzie, who was in Catherine’s arms."
      },
      {
        "paragraph": "One of them frowned deeply, while the heart of the other person skipped a beat."
      },
      {
        "paragraph": "Rebecca had clearly told those people to finish off Suzie. Why was Suzie still alive and well? No\nwonder Big Boss Davis could not be contacted all of a sudden."
      },
      {
        "paragraph": "However, it was impossible that Catherine could find Suzie that quickly."
      },
      {
        "paragraph": "Rebecca started racking her brain. She quickly said, “Uncle Titus, we knew from the start that\nCatherine was making a fuss at the entrance. She even brought a lot of people with her. I was afraid\nthat she would hurt Mom, so I didn’t let her in. What are you and Catherine talking about? She can’t\npossibly be begging you to let her in, right?”"
      },
      {
        "paragraph": "“Titus, get inside right now.”"
      },
      {
        "paragraph": "Sheryl was talking to him in a commanding tone in front of everyone, and it made Titus’ face look awful."
      },
      {
        "paragraph": "“Did you hear me? Is this woman seducing you again?” Sheryl was filled with hatred when she saw\nCatherine’s face that looked like hers when she was young."
      },
      {
        "paragraph": "Catherine looked at Sheryl and laughed sarcastically. “Mr. Costner, is this your wife? No offense, but\nshe seems undeserving of you.”"
      },
      {
        "paragraph": "“What did you say?” Sheryl was exasperated. She had been well-regarded all her life, and everyone\ntreated her respectfully. No one dared to provoke her like this. “You don’t mean that you’re deserving of\nhim, right? Who do you think you are? You don’t even have the right to be my maid.”"
      },
      {
        "paragraph": "“Mom, don’t be angry. Uncle Titus loves you so much. He surely won’t be seduced by Catherine. ”\nRebecca coaxed Sheryl."
      },
      {
        "paragraph": "However, Sheryl could not keep her rationality and cool despite listening to Rebecca’s words. “Titus\nCostner, if you don’t come in, we don’t have to be husband and wife anymore.”"
      },
      {
        "paragraph": "Titus’ handsome expression became frosty out of anger."
      },
      {
        "paragraph": "He thought that Sheryl’s words were a humiliation to him."
      },
      {
        "paragraph": "He was already keeping a distance from Catherine, not to mention that Catherine was much younger\nthan him. However, Sheryl and Rebecca’s words made it sound as though he was a heartless and\nshameless person."
      },
      {
        "paragraph": "“Uncle Titus, let me go in.” Catherine looked at him. The way she addressed him had already changed\nto ‘Uncle Titus’."
      },
      {
        "paragraph": "Titus glanced at her with complicated feelings. Then, he waved his hand and coldly ordered, “Open the\ngate.”"
      },
      {
        "paragraph": "The security guards opened the gate. Catherine brought her people with her and walked inside. Sheryl\nwent insane due to anger."
      },
      {
        "paragraph": "“Titus, why did you let her in? Are you thinking of killing me while Shaun isn’t here and because this is\nAustralia?” Sheryl’s glare was filled with wariness and iciness. “I’m warning you. If something happens\nto me in Australia, the elders on the island will immediately end all collaborations with the Costner\nfamily. Neah Bay will lose its peace.”"
      },
      {
        "paragraph": "“Sherry, I really can’t understand. We’ve been husband and wife for 20 years. When did I become so\nevil in your heart?”"
      },
      {
        "paragraph": "Titus’ eyes were filled with sadness. “ I love you so much. I knew from the start that you had a child\nbefore, but I never minded it. But you think I’ll love someone else and kill you?”"
      },
      {
        "paragraph": "The agony in the man’s eyes made Sheryl’s body stiffen."
      },
      {
        "paragraph": "Her heart was in pain. When she thought about it, her head suddenly felt a swelling pain."
      },
      {
        "paragraph": "A lot of scenes flashed through her head."
      },
      {
        "paragraph": "There was the scene of Titus and Catherine"
      },
      {
        "paragraph": "behaving intimately and drinking coffee in the cafe."
      },
      {
        "paragraph": "There was the scene of Titus and Catherine hugging each other."
      },
      {
        "paragraph": "There was also the scene of Titus and Catherine making out."
      }
    ]
  },
  {
    "title": "Chapter 1636 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Every one of those scenes almost made Sheryl go crazy."
      },
      {
        "paragraph": "“You’ll definitely do that. All men are horrible ! It’s not like you didn’t have any ex-girlfriends before\nmeeting me.” Sheryl glared at Titus furiously."
      },
      {
        "paragraph": "“Mom, don’t quarrel with Uncle Titus…”"
      },
      {
        "paragraph": "Before Rebecca finished her sentence, Catherine stepped forward and slapped her hard."
      },
      {
        "paragraph": "“Rebecca!” Sheryl was shocked. When she came back to her senses, she immediately raised her hand\nto slap Catherine too."
      },
      {
        "paragraph": "However, Catherine quickly grabbed Sheryl’s hand and gazed at Sheryl’s face."
      },
      {
        "paragraph": "This was the face she used to think about countless times in her memories."
      },
      {
        "paragraph": "Her heart was in pain as though someone was squeezing it."
      },
      {
        "paragraph": "Catherine asked coldly, “ If you weren’t my mother or my elder, I’d slap you too.”"
      },
      {
        "paragraph": "Sheryl sneered. “Don’t think I don’t know about your intentions. You want to be my daughter because\nthere are plenty of benefits to reap."
      },
      {
        "paragraph": "Unfortunately, how could I possibly have given birth to such an evil daughter like you?”"
      },
      {
        "paragraph": "“Hah.” Catherine laughed coldly as though she had heard a joke. She even laughed until there were\ntears in her eyes. “I’m evil? Can my evilness compare to yours? Let me ask you, did you know about\nRebecca kidnapping Suzie? Or were you the one who planned this?”"
      },
      {
        "paragraph": "“That’s right. I was the one who asked her to kidnap your daughter. You’d better hand over my son right\nnow.” Sheryl had already lost all rationality from being stimulated. She blurted out, “ Otherwise, this will\njust be the start. I want to toss your whole family into the pits of hell.”"
      },
      {
        "paragraph": "Catherine was so heartbroken that tears started streaming down her face."
      },
      {
        "paragraph": "“Sherry, ” Titus scolded in a low voice. He went forward and pulled Sheryl away."
      },
      {
        "paragraph": "“How dare you yank me? Titus, I want a divorce! ” Sheryl used her fists to hit his chest out of anger."
      },
      {
        "paragraph": "“Sheryl, can you get a hold of yourself?” Titus yelled, “The Sheryl I know isn’t a woman who’ll harm a\nchild.”"
      },
      {
        "paragraph": "“I am that kind of woman. I’ve always been this evil.” It was as if Sheryl had gone insane. “She caused\nmy mom’s death and harmed my daughter. I want to let her have a taste of my agony too.”"
      },
      {
        "paragraph": "Titus raised his hand straight away. He knocked Sheryl out and carried her."
      },
      {
        "paragraph": "“Mom!” Rebecca was shocked and had a bad feeling. “Uncle Titus, are you really betraying Mom?\nShe’s only like this because she loves you too much.”"
      },
      {
        "paragraph": "Titus coldly stared at her."
      },
      {
        "paragraph": "Right after this woman appeared, his once lovely family was about to be shattered."
      },
      {
        "paragraph": "Initially, he wanted to pretend like he did not know anything and slowly investigate Matthew’s\nwhereabouts. He would deal with Rebecca later."
      },
      {
        "paragraph": "However, he knew that if he kept tolerating this, it would only worsen his relationship with Sheryl. At the\nsame time, it would hurt more people as well."
      },
      {
        "paragraph": "“Rebecca, do you think I’m easy to fool?” Titus’ bottomless gaze swept across Rebecca. Her heart\nwent cold. She felt pressured and suffocated."
      },
      {
        "paragraph": "“Uncle Titus, I don’t know what you’re talking about—ugh.”"
      },
      {
        "paragraph": "Before Rebecca finished her sentence, Titus strangled her."
      },
      {
        "paragraph": "“You’re not related to me in any way.” Titus’ handsome face was hostile. “I don’t care how you usually\nplease Sheryl, but you can’t fool me as though I’m an idiot. I’ve met many women like you. You like\nmoney, yet you act like you don’t care. When you see money and valuables, there’s greed in your eyes,\nbut you fake a nonchalant expression. You’re clearly aiming for Sheryl’s money, but you pretend as\nthough having her as your mom is enough. When Sheryl and I quarrel, you look as though you’re trying\nto stop us on the surface but in reality, you’re making it worse. Do you think I know nothing at all?”"
      }
    ]
  },
  {
    "title": "Chapter 1637 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“I didn’t, I didn’t…. ”"
      },
      {
        "paragraph": "Rebecca denied it repeatedly. She was shaking like a leaf."
      },
      {
        "paragraph": "Recently, she had been trying to please Titus,Matthew, and Sheryl. She thought she could deceive\neveryone by being careful."
      },
      {
        "paragraph": "She was even secretly pleased with herself, even thinking that these people were too easy to fool\nUnexpectedly, her schemes had not been able to escape Titus’ eyes."
      },
      {
        "paragraph": "This man was too terrifying."
      },
      {
        "paragraph": "“You didn’t?” Titus sneered coldly. “Do you know why I never said anything before? It’s because I\nthought you were Sheryl’s daughter. I knew that she owed you and is trying to make things up to you,\nso I turned a blind eye. After all, I’ve seen too many people like you in the Costner family. You want\nmoney, but that’s fine since I have money. It’s harmless to give you a little more, but it’s obvious that\nyou want more.”"
      },
      {
        "paragraph": "“Uncle Titus, you’ve really misunderstood me. Did Catherine say something to you? Don’t be deceived\nby her.” Rebecca continued to struggle."
      },
      {
        "paragraph": "Catherine could not bear to listen anymore. “"
      },
      {
        "paragraph": "Rebecca Jones, do you know what your fatal flaw is?”"
      },
      {
        "paragraph": "She went forward step by step. “You want to stand at the top of the pyramid. You think that everyone\nwill be deceived by your hypocritical acting skills. You think that your tricks will work on everyone since\nyou deceived Ethan like that before, but you forgot something. No matter how well you hide your"
      },
      {
        "paragraph": "background, upbringing, and true nature, they can’t be concealed from the eyes of insightful people. To\nthem, you just look like a buffoon.”"
      },
      {
        "paragraph": "“Catherine, stop trying to sow discord. You’re clearly the hypocrite here! ” Rebecca argued loudly,\nshowing an extremely aggrieved and sorrowful expression. “It’s always like this. I’m clearly the victim,\nbut people are always tricked by you.”"
      },
      {
        "paragraph": "Catherine laughed. “Didn’t Wesley inform you who you’re trying to get close to? Titus Costner is the\nhead of the Costner family. He’s lived for more than four decades. He always makes decisive decisions\nand is always right. He’s incredibly knowledgeable. When you were born, he was already a formidable\nperson whom the people in Neah Bay were in awe of. What kind of person hasn’t he met or\nencountered before? If he doesn’t have any skills, how did he secure the position he has today? Did\nyou think you could hide your little schemes from him?”"
      },
      {
        "paragraph": "“She’s right.”"
      },
      {
        "paragraph": "Titus gave Catherine an admiring look. Then, he said, “Rebecca, you encouraged Sherry to kidnap\nSuzie, didn’t you? I don’t believe that she would do something like that on her own.”"
      },
      {
        "paragraph": "Rebecca hurriedly argued, “Yes, Suzie’s kidnapping is related to us. But I specifically told the\nkidnappers not to hurt her. I only wanted to force Catherine to hand Matthew over.”"
      },
      {
        "paragraph": "“Enough, stop pretending,” Catherine interrupted her. “Matthew fell into the hands of Wesley and you.”"
      },
      {
        "paragraph": "“That’s ridiculous! ” Rebecca quickly looked at Titus. “Matthew is my brother. I’m supposed to protect\nhim. How could I have harmed him instead? Uncle Titus, don’t believe her.”"
      },
      {
        "paragraph": "A trace of disgust flashed across Titus’ defined features. “I’ve already caught those kidnappers. I’ll have\nthem sent to the police station.”"
      },
      {
        "paragraph": "When Rebecca heard this, her heart calmed down. However, she did not dare to reveal anything in her\nexpression and continued to shake her head desperately. “I didn’t do it. I’m really innocent.”"
      },
      {
        "paragraph": "“Take her away and send her to the station.” Titus jerked his chin at Catherine."
      },
      {
        "paragraph": "Elle was overjoyed. She never expected that they would be able to capture Rebecca so easily today. It\nwas too unexpected. However, just as she was about to go forward, Catherine suddenly stopped her."
      },
      {
        "paragraph": "“Wait.”"
      },
      {
        "paragraph": "“What’s wrong?” Elle was confused. “The police will find out that Rebecca is the mastermind once they\ninterrogate the other kidnappers. The evidence is conclusive.”"
      },
      {
        "paragraph": "“I’m afraid that the kidnappers won’t say that she’s the mastermind.” Catherine’s eyes were cold. “What\nif they say that the person who instructed them was Sheryl?”"
      },
      {
        "paragraph": "Rebecca was shocked. She did not expect Catherine to guess that."
      },
      {
        "paragraph": "The next second, Titus’ large hand once again choked Rebecca. “Very well, then. Men, lock her up.”"
      },
      {
        "paragraph": "”You can’t do this. ” Rebecca panicked. ”If my mom finds out, she won’t forgive you. ”"
      }
    ]
  },
  {
    "title": "Chapter 1638 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“That’s only if you’re really her daughter.” Titus’ sharp eyes seemed to penetrate Rebecca. “Take her\naway.”"
      },
      {
        "paragraph": "“Of course, I am. The DNA test is the best proof, ” Rebecca said. “Titus, you’re clearly having an affair\nwith Catherine. You’re in cahoots with her to deceive Mom. You hypocrite! ”"
      },
      {
        "paragraph": "As she cursed, Titus’ expression darkened with anger. Someone finally dragged Rebecca away to lock\nher up."
      },
      {
        "paragraph": "“Go.”"
      },
      {
        "paragraph": "Titus picked Sheryl up and turned around to walk out. He got into the car and left."
      },
      {
        "paragraph": "Catherine stood frozen in place. Her mind echoed with Titus’ words earlier. ‘That’s only if you’re really\nher daughter’."
      },
      {
        "paragraph": "It seemed that Titus was already suspecting that Rebecca was a fake."
      },
      {
        "paragraph": "However, even if he believed that, Sheryl would not."
      },
      {
        "paragraph": "Catherine’s mouth curled in self-deprecation. Actually, it no longer mattered to her who Sheryl’s\ndaughter was anymore."
      },
      {
        "paragraph": "When she thought of the malicious words Sheryl had said to her and how Sheryl had helped the enemy\nagain and again, she was a little disgusted by her. She hated Sheryl, and she hated having a mother\nlike her."
      },
      {
        "paragraph": "She did not want to acknowledge Sheryl as her mother at all."
      },
      {
        "paragraph": "“Miss Jones, where’s Mr. Costner taking his wife?” Elle asked curiously."
      },
      {
        "paragraph": "“She’s unconscious, so probably to the hospital.” Catherine picked Suzie up. “Go to the police station\nand find out about the kidnappers. Ask how the interrogation went. I don’t believe that Rebecca will be\naccused of a crime that easily.”"
      },
      {
        "paragraph": "“Understood.”"
      },
      {
        "paragraph": "Catherine carried Suzie to the car."
      },
      {
        "paragraph": "Suzie sat in her arms the whole way. “Mommy, did that granny get someone to kidnap me? She’s so\nbad.”"
      },
      {
        "paragraph": "“… Yeah, she’s really bad. We don’t like her.”"
      },
      {
        "paragraph": "Catherine hugged Suzie’s little head. “ I’ll buy you your favorite chocolate later…”"
      },
      {
        "paragraph": "“No. ” Suzie shuddered. “I’ll never eat candy again. Something always happens when I buy candy. I\ndon’t wanna eat sweets anymore. I don’t wanna go anywhere. I just wanna hold Mommy.”"
      },
      {
        "paragraph": "Catherine looked at Suzie’s fragile and pale little face. She knew that the child was traumatized."
      },
      {
        "paragraph": "Suzie was so young, but she had already encountered several life -and-death crises. Anyone would be\nafraid."
      },
      {
        "paragraph": "They went all the way back to Hill Manor."
      },
      {
        "paragraph": "As soon as Lucas saw Suzie, he rushed over and quickly hugged her. His handsome eyes were red."
      },
      {
        "paragraph": "Although they often quarreled and fought, Suzie was more important than anything else to Lucas."
      },
      {
        "paragraph": "When Suzie was taken away in front of Lucas, the memory was deeply engraved in him."
      },
      {
        "paragraph": "“Lucas, I thought I’d never see you again. I was so scared.” Suzie hugged him and started to sob\nloudly."
      },
      {
        "paragraph": "“It’s okay. I swear that I’ll protect you in the future.” Lucas clenched his fists seriously."
      }
    ]
  },
  {
    "title": "Chapter 1639 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“How are you going to protect me? You’re just as small as I am,” Suzie sniffed and said."
      },
      {
        "paragraph": "“I’ll get up every morning to run and practice martial arts. I’ll learn martial arts from Uncle Brennan. ”\nLucas’ eyes were full of determination."
      },
      {
        "paragraph": "He wanted to protect his sister, mother, and father."
      },
      {
        "paragraph": "He had been too negligent in the past. After this incident, he realized just how useless he was."
      },
      {
        "paragraph": "He had always said he would protect the people around him, but not once was he able to do it."
      },
      {
        "paragraph": "“Lucas, don’t put too much pressure on yourself.” Catherine was a little worried when she saw Lucas’\nexpression."
      },
      {
        "paragraph": "“Mommy, don’ t say anymore. Without pressure, there’s no motivation. I’ve lived too comfortably this\nwhole time. Now that something has happened to Daddy, you have to shoulder everything in the family.\nI’ll work hard to grow up and share the burden.” Lucas raised his determined little face."
      },
      {
        "paragraph": "Catherine was stunned. In addition to the warmth in her heart, there was also a trace of heartache."
      },
      {
        "paragraph": "It was good for children to care about their parents, but Lucas was only three years old. This was the\nage where children should be carefree, but she was unable to let them lead comfortable lives."
      },
      {
        "paragraph": "“Lucas, don’t overdo yourself. Mommy doesn’t want you to get too tired, ” Catherine said gently. “\nRebecca has been locked up as well, so she won’t be able to do anything for the time being.”"
      },
      {
        "paragraph": "“She’s locked up?” Lea was surprised. “Did the police find evidence that she’s behind the kidnapping?”"
      },
      {
        "paragraph": "“Not yet.” Catherine shook her head. “She was locked up by Titus. The police caught the kidnappers,\nbut I think that they’ll say that Sheryl is the one behind the kidnapping.”"
      },
      {
        "paragraph": "Brennan frowned. “Is… Sheryl involved in it?”"
      },
      {
        "paragraph": "“Don’t be ridiculous.” Lea glared at him. “After all, she’s Cathy’s mother. How could she do such a— ”"
      },
      {
        "paragraph": "“It’s possible that she’s involved.” Catherine interrupted Lea’s words and said expressionlessly, “ She\nknows about it and even agreed to it.”"
      },
      {
        "paragraph": "Lea was suddenly speechless, but a fire ignited in her heart the next moment. They were all capable\nwomen in the business world. Even though Lea was also cold and ruthless when treating her\nsubordinates, she was not black-hearted enough to allow someone to kidnap a child."
      },
      {
        "paragraph": "“Mommy, I’ll never acknowledge her as my grandmother. Never ever, ” Lucas suddenly said in a\ndecisive manner."
      },
      {
        "paragraph": "“Same with me.” Suzie echoed."
      },
      {
        "paragraph": "“Yes, don’t acknowledge her. I won’t either.” Catherine was already completely disillusioned by the\nword ‘mother’. “Are you hungry? Let’s eat together…”"
      },
      {
        "paragraph": "Just as she spoke, Hadley suddenly called her. “Miss Jones, I heard that you’ve rescued Suzie.”"
      },
      {
        "paragraph": "“Yeah, she’s fine.” Catherine asked, “How’s Shaun?”"
      },
      {
        "paragraph": "Hadley was silent for two seconds before saying, “ Not good. He’s not talking to me and isn’t willing to\neat. He doesn’t even want sweets, nor does he want to watch cartoons.”"
      },
      {
        "paragraph": "Catherine was having a bit of a headache. She originally wanted to tuck the children into bed before\ngoing over."
      },
      {
        "paragraph": "“ I’ll come over later. Watch him and don’t let him run around.”"
      },
      {
        "paragraph": "After hanging up the phone, two pairs of eyes were fixed on her."
      },
      {
        "paragraph": "“Mommy, go to Daddy. I’ll stay with Suzie,” Lucas said sensibly."
      },
      {
        "paragraph": "“Alright, go ahead. Daddy is only two years old now. He’s younger than me, ” Suzie also said. She was\nindeed disappointed, but there was no helping it. Her daddy was even more clingy than her now."
      },
      {
        "paragraph": "“Go on. We’ll watch them for you.” Lea picked Suzie up. “Grandma will sleep with you tonight.”"
      },
      {
        "paragraph": "Suzie pouted and asked pitifully, “Then will Grandpa accompany us too?”"
      },
      {
        "paragraph": "Lea,“..”"
      }
    ]
  },
  {
    "title": "Chapter 1640 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Brennan was also instantly embarrassed. If one added up his and Lea’s age, it would be almost a\nhundred. Even so, his face could not help but grow hot."
      },
      {
        "paragraph": "Catherine, who was standing at the side, almost burst out laughing. However, she held back and did\nnot say anything. She was actually looking forward to them reconciling."
      },
      {
        "paragraph": "“Suzie, that won’t do.” Lea stiffly refused her request in a gentle voice."
      },
      {
        "paragraph": "“Why not? My preschool friend said that her grandpa and grandma sleep with her sometimes, ” Suzie\nsaid with conviction."
      },
      {
        "paragraph": "“Your grandma and I are divorced,” Brennan explained in a low voice."
      },
      {
        "paragraph": "“My daddy and mommy are also divorced but they still sleep together every day, ” Suzie said with an\ninnocent face."
      },
      {
        "paragraph": "Catherine, who was suddenly dragged into this, “..” “Um, I’ll go now.” Catherine waved, wanting to hurry\nup and extricate herself from this awkward situation."
      },
      {
        "paragraph": "As for the little imp Suzie, she would let Lea and Brennan take care of her."
      },
      {
        "paragraph": "She kissed the two children and ran away."
      },
      {
        "paragraph": "Brennan and Lea exchanged a rare tacit glance. They also wanted to run away but could not."
      },
      {
        "paragraph": "Since something had happened to their son, taking care of their grandchildren was their duty."
      },
      {
        "paragraph": "“Let’s sleep together, okay?” Suzie grabbed her grandparents with one hand each and said sadly, “\nActually, I want Daddy and Mommy to accompany me, but they don’t have time now.”"
      },
      {
        "paragraph": "Suzie sniffed, looking like she was about to cry."
      },
      {
        "paragraph": "Lea’s heart ached when she saw it and quickly said, “Lucas, hurry up and comfort Suzie.”"
      },
      {
        "paragraph": "“Grandma, I’m not the one who made her cry.” Lucas looked as though he was completely uninvolved\nin the matter. “Grandma, your son is really lacking. He was deceived by a woman and then divorced my\nmom. After going through so much trouble to get back together with Mommy, he"
      },
      {
        "paragraph": "fell into someone’s trap again. Now, he has the IQ of a two-year-old and even snatched Mommy away\nfrom us. I originally thought that by coming here, I’ll get a daddy along with a mommy, but now even\nMommy isn’t around anymore.”"
      },
      {
        "paragraph": "Brennan and Lea were even more embarrassed by the child’s words."
      },
      {
        "paragraph": "There was nothing wrong with what Lucas said."
      },
      {
        "paragraph": "Lea did not want to talk anymore and looked at Brennan. “You explain it.”"
      },
      {
        "paragraph": "Brennan’s expression was complicated. What could he say? It was indeed Shaun’s fault. He was\ntricked by Sarah time and again. Now, he even wanted Catherine to give up spending time with her\nchildren to accompany him."
      },
      {
        "paragraph": "In the end, the ones who were suffering the most were the children."
      },
      {
        "paragraph": "However, to ask him to sleep with Lea…"
      },
      {
        "paragraph": "Brennan felt conflicted. When he miserably left the country back then, his hatred for her had long\nsurpassed his love."
      },
      {
        "paragraph": "These decades, it was not like there were no women who threw themselves at him. However, he was\nbent on revenge and had no other thoughts."
      },
      {
        "paragraph": "After he came back and got revenge, he learned that Lea had also gotten tricked by Mason. Hence, he\ncould not retaliate against her."
      },
      {
        "paragraph": "He never thought about getting back together with her."
      },
      {
        "paragraph": "However, too many things have happened recently. Due to this son and grandchildren, he became\nmore entangled with the Hill family."
      },
      {
        "paragraph": "“Okay, Grandpa and Grandma will accompany you.” Brennan suddenly opened his mouth after a long\ntime."
      },
      {
        "paragraph": "Lea looked back at him in shock."
      },
      {
        "paragraph": "Under the moonlight, she could see that there were fine lines at the corners of his eyes. Even so, he\nhad taken good care of his appearance. His handsome and cold outlines had become more mature\nand reserved with the passage of time. His figure was still tall and upright, as though he was a glass of\nfine wine that grew more and more mellow as time passed."
      },
      {
        "paragraph": "She was already in her middle age, but her heart suddenly skipped a few beats like when she was\nyoung."
      },
      {
        "paragraph": "When they were married, her heart had been touched by Brennan before, so it was actually easy to\nrevive that feeling again."
      }
    ]
  },
  {
    "title": "Chapter 1641 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "As Catherine drove to the hospital, she silently sympathized with Brennan and Lea."
      },
      {
        "paragraph": "She felt that Suzie and Lucas were about to trick them again."
      },
      {
        "paragraph": "However, that was fine. Although Brennan was very cold toward Lea, he had not remarried for decades\nand there was no woman around him. Maybe he really had not let go of Lea."
      },
      {
        "paragraph": "It was almost 8:00 p.m. by the time she reached the hospital."
      },
      {
        "paragraph": "Catherine hurried into the ward, where Shaun was curled up in a ball with his back to the door. The\npale light fell on his figure, giving him an air of loneliness."
      },
      {
        "paragraph": "Hadley stood up and shrugged at her helplessly. Catherine nodded and walked over."
      },
      {
        "paragraph": "Shaun’s handsome and clean face was full of grievances, sadness, and loneliness. His eyes were\ntinged red as though tears were about to fall yet he was desperately enduring it. His lips were also"
      },
      {
        "paragraph": "pressed together tightly, making him look like a poor child who was refusing to cry even though he was\nsuffering."
      },
      {
        "paragraph": "Catherine’s heart almost melted."
      },
      {
        "paragraph": "She really could not stand seeing a big man like him show such an adorable expression."
      },
      {
        "paragraph": "She walked over, sat on the bed, and rubbed his head. “Why aren’t you eating? Aren’t you hungry?”"
      },
      {
        "paragraph": "When Shaun saw her, his dark eyes instantly brightened as though there were countless stars twinkling\nin them."
      },
      {
        "paragraph": "If there was a tail behind him, it would definitely be wagging rapidly now."
      },
      {
        "paragraph": "“Cathy, you’re back.”"
      },
      {
        "paragraph": "“Yeah, ” Catherine repeated her question, “Why aren’t you eating?”"
      },
      {
        "paragraph": "“ I don’t want to eat if you’re not around. ” Shaun pouted and glanced at Hadley. “I don’t like him."
      },
      {
        "paragraph": "He’s not as good-looking as you.”"
      },
      {
        "paragraph": "Hadley, “….”"
      },
      {
        "paragraph": "He wanted to cry. ‘Young Master Hill, you’re so biased when it comes to your woman. I didn’t notice it\nbefore.’"
      },
      {
        "paragraph": "“A person can’t survive on their looks alone, ” Catherine said gently, “Plus, Hadley cares about you very\nmuch.”"
      },
      {
        "paragraph": "“I don’t want him to care about me. I just want you.” Shaun looked at her with his clear and beautiful\neyes."
      },
      {
        "paragraph": "Catherine’s face heated up at his stare. However, too many things had happened today and she was a\nlittle tired. Hence, she did not have the strength to be affectionate with him. “I’ll feed you, okay?”"
      },
      {
        "paragraph": "“Okay.” Shaun nodded hard."
      },
      {
        "paragraph": "Hadley quickly brought over the takeaway box. “It’s still warm.”"
      },
      {
        "paragraph": "“Thank you, Hadley. You should go back and rest, ” Catherine said."
      },
      {
        "paragraph": "“But…” Hadley saw her tired appearance and could not bear to leave."
      },
      {
        "paragraph": "“It’s fine. He’s much easier to deal with than Suzie.” Catherine joked."
      },
      {
        "paragraph": "Hadley sighed in his heart before leaving. She took the spoon and fed Shaun the stew."
      },
      {
        "paragraph": "Shaun was actually hungry but he did not want to eat without seeing her first. Now that she was back,\nhe immediately ate the stew with gusto."
      },
      {
        "paragraph": "After eating for a while, he suddenly asked, “Did… you find Suzie?”"
      },
      {
        "paragraph": "“Yeah, ” Catherine said."
      },
      {
        "paragraph": "Shaun nodded and said seriously, “ She must have run around. She’s naughty.”"
      },
      {
        "paragraph": "Catherine smiled silently."
      },
      {
        "paragraph": "She could not explain to him that Suzie was kidnapped."
      },
      {
        "paragraph": "Sometimes, she thought that it was good that Shaun was in this state now. He no longer needed to\nface many things."
      },
      {
        "paragraph": "However, she felt very tired. Sometimes, she wanted someone to rely on, but when Suzie disappeared,\nshe did not even have the right to cry."
      }
    ]
  },
  {
    "title": "Chapter 1642 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Although Shaun had a low IQ now, he could still sense that Catherine had suddenly become unhappy."
      },
      {
        "paragraph": "He quickly said, “D-Don’t worry. I’ll… I won’t run around. I won’t… let you worry.”"
      },
      {
        "paragraph": "“Mhm, good boy.” Catherine touched his head. “ But Suzie didn’t run around. She was kidnapped. You\nhave to be a good boy and stay with me, or you might get taken away by bad people. If that happens,\nyou’ll never see me again.”"
      },
      {
        "paragraph": "“Bad people… They’re terrible. ” Shaun furrowed his brows in anger. “I’ll be good… I won’t run around.\nToday… you told me not to leave, so I didn’t leave.”"
      },
      {
        "paragraph": "“Yeah, you did a great job.”"
      },
      {
        "paragraph": "Catherine scooped up a spoonful of food."
      },
      {
        "paragraph": "Shaun pushed it to her mouth. “Cathy, you eat too.”"
      },
      {
        "paragraph": "“Okay.” Catherine’s heart felt slightly better after feeling his concern for her."
      },
      {
        "paragraph": "Fortunately, even after he became stupid, he still cared about her. Plus, she was hungry too—\nextremely hungry."
      },
      {
        "paragraph": "After they finished eating, Catherine was exhausted and helped him wipe his body before lying down\non the bed to watch cartoons with him."
      },
      {
        "paragraph": "She fell asleep soon after."
      },
      {
        "paragraph": "Shaun looked at her. From his line of sight, he thought that Cathy looked really pretty."
      },
      {
        "paragraph": "Her face was small and beautiful as a fairy, while her skin was fairer than snow. Her long eyelashes…\nwere like… the feathers in cartoons."
      },
      {
        "paragraph": "Also, her pink lips were like jelly."
      },
      {
        "paragraph": "Shaun still remembered the taste of them. Cathy tasted very sweet, but of course, the inside of her\nmouth was sweeter."
      },
      {
        "paragraph": "As he thought about it, his body suddenly heated up. He also did not know what was happening and\nonly felt very uncomfortable."
      },
      {
        "paragraph": "He did not want to wake Catherine up at first, but his tall and slender body could not help but toss and\nturn in bed. In the end, his breathing got more and more urgent."
      },
      {
        "paragraph": "Catherine opened her eyes and saw his flushed face."
      },
      {
        "paragraph": "She was shocked, thinking it was an after-effect after falling down the stairs. “What’s wrong? Are you\nfeeling uncomfortable?”"
      },
      {
        "paragraph": "“Yeah, I don’t know why it suddenly happened. ” Shaun grabbed her hand and shoved it under the\ncovers with an innocent face."
      },
      {
        "paragraph": "Catherine, “…”"
      },
      {
        "paragraph": "What the hell. This guy had the IQ of a two—year— old but his body was giving a completely different\nreaction."
      },
      {
        "paragraph": "“How did this suddenly happen?” She was truly puzzled."
      },
      {
        "paragraph": "“I don’t know either.” Shaun looked at her pitifully. “Can you help me?”"
      },
      {
        "paragraph": "“Sorry, but sometimes you can do it yourself.” Catherine pushed both his hands under the covers. “ I’m\ntired, so help yourself.”"
      },
      {
        "paragraph": "Shaun, “…. ”"
      },
      {
        "paragraph": "He was very disappointed."
      },
      {
        "paragraph": "However, when he saw Catherine’s tired appearance, he could not bear to force her and was afraid\nthat she would be angry. Hence, he had no choice but to quietly settle it himself."
      },
      {
        "paragraph": "In Militaire hospital."
      },
      {
        "paragraph": "After Titus sent Sheryl here, he immediately had the doctor give Sheryl a full examination."
      },
      {
        "paragraph": "In less than three hours, all the data was laid out in front of him."
      },
      {
        "paragraph": "“There’s nothing wrong with her organs and brain. In fact, her health is very good.” The doctor paused\nand took out a report. “However, we found traces of an illegal drug in her bloodstream. Does she\nusually take any medicine?”"
      },
      {
        "paragraph": "Titus’ thin lips immediately pursed, making him look eerily cold. “As far as I know, no. As you said,\nshe’s in good health. Even when she was abroad, she seldom caught colds. She exercises every day\nas well.”"
      },
      {
        "paragraph": "“That’s weird, ” the doctor said, “The illegal drug I mentioned is generally taken by patients after\nsurgery or those suffering from long-term mental illness. This kind of drug can’t be taken for an\nextended period of time…”"
      }
    ]
  },
  {
    "title": "Chapter 1643 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“What happens if a normal person takes it?” Titus suddenly interrupted the doctor with an unpleasant\nexpression."
      },
      {
        "paragraph": "The doctor paused. “Then it’ll be a little troublesome. As you know, it’s a drug. At first, the person will\nsuffer from insomnia and fatigue. Later on, there’ll be a decline in memory and intelligence. The\nperson’s temper will become irate, their mind will become sluggish, and their mood will become\nrestless. In serious cases, the person might hallucinate and even become addicted.”"
      },
      {
        "paragraph": "“Addicted?” Titus clenched his fists, veins fiercely throbbing on the back of his hands."
      },
      {
        "paragraph": "The symptoms that the doctor listed were very much in line with Sheryl’s current state."
      },
      {
        "paragraph": "It was all his fault for being too negligent lately. He only thought that Sheryl was simply jealous and in a\nbad mood because of Catherine, which was why she kept arguing with him."
      },
      {
        "paragraph": "If not for Catherine’s reminder, he would never have brought Sheryl for a full check-up."
      },
      {
        "paragraph": "“Yes, it’s just like taking drugs, ” the doctor said seriously, “If she doesn’t continue to take it, she’ll\nbecome even more agitated. If she suddenly stops taking it, her mood swings will get worse. In serious\ncases… she’ll go crazy.”"
      },
      {
        "paragraph": "Titus suddenly stood up."
      },
      {
        "paragraph": "When a tall man like him flew into a rage, it was enough to make the doctor terrified."
      },
      {
        "paragraph": "“Can she be cured?” Titus asked."
      },
      {
        "paragraph": "“Of course, it’s just a matter of time. However, we still don’t know what kind of drug she’s been taking. I\nwas only able to extract one ingredient of the drug from her blood, but as you know, there are many\nkinds of ingredients in drugs. Different kinds of drugs have different kinds of ingredients too. ”"
      },
      {
        "paragraph": "The doctor hesitated before saying, “The examinations we did earlier were when she was unconscious,\nbut there are some parts of the neurological examination that must be done when she’s awake. We’ll\nneed her to cooperate…”"
      },
      {
        "paragraph": "Titus became antsy."
      },
      {
        "paragraph": "With Sheryl’s current mood, she would never let the doctor examine her without kicking up a fuss. It\nwould be good enough if she did not demand a divorce immediately after waking up."
      },
      {
        "paragraph": "If only Matthew were around, he would be able to persuade her."
      },
      {
        "paragraph": "The decisive Titus Costner would probably only feel this conflicted when it came to his wife."
      },
      {
        "paragraph": "If possible, he wanted to take Sheryl back to Neah Bay for treatment. However, what about Matthew?\nWas he just supposed to abandon his son?"
      },
      {
        "paragraph": "“What if I can find that drug?” Titus asked in a low and cold voice."
      },
      {
        "paragraph": "“Then the scope of treatment will be much narrower. Even if she doesn’t cooperate with the treatment,\nwe’ll be more confident about it. ” The doctor nodded thoughtfully."
      },
      {
        "paragraph": "“Please look after her for me for now. Try to let her sleep as much as possible.” Titus frowned and\nmade the arrangements."
      },
      {
        "paragraph": "The doctor shook his head. “That won’t do. If we give her an injection to put her to sleep, it’ll only make\nthings worse, which is not conducive for her treatment.”"
      },
      {
        "paragraph": "“Then I’ll have someone keep guard of the ward and not let her out for the time being,” Titus gritted his\nteeth and said ruthlessly."
      },
      {
        "paragraph": "“Understood.”"
      },
      {
        "paragraph": "Titus walked out with his long legs."
      },
      {
        "paragraph": "After taking the elevator to the parking lot and getting into the car, he pulled out a paper bag from his\npocket. There were a few strands of hair inside."
      },
      {
        "paragraph": "“Arrange for the injured bodyguards to be sent back to Neah Bay for treatment,” Titus said to his\nassistant. “And take this back with you too. Get these samples to one of our hospitals and have a DNA\ntest done as soon as possible.”"
      },
      {
        "paragraph": "The assistant froze and quickly took the paper bag. “This is…”"
      },
      {
        "paragraph": "“The Madam and Suzie’s hair, ” Titus said, “ I don’t trust the hospitals in Australia to do the DNA test. ”"
      },
      {
        "paragraph": "The assistant understood."
      },
      {
        "paragraph": "Although Mr. Costner somewhat believed in Catherine, he still had to be vigilant."
      }
    ]
  },
  {
    "title": "Chapter 1644 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "After all, who would have thought that they would discover Rebecca’s vicious nature after coming to\nAustralia?"
      },
      {
        "paragraph": "“Go back to the villa now. I want to interrogate Rebecca.” Titus’ eyes were chilling, and his brows were\nfurrowed."
      },
      {
        "paragraph": "He had never been played by a woman like this in his whole life."
      },
      {
        "paragraph": "He thought that Rebecca was just money-loving, greedy, and a phony. However, he never thought that\nshe would dare to drug Sheryl."
      },
      {
        "paragraph": "He hated her so much that he wanted to skin her alive."
      },
      {
        "paragraph": "However, before that, he had to find out why Rebecca gave Sheryl that drug."
      },
      {
        "paragraph": "He remembered that Sheryl had always been good to her. Maybe Sheryl found out about Rebecca’s\nintentions but Sheryl had already acknowledged Rebecca as her daughter. Sheryl once told him that\nshe owed her daughter and wanted to make it up to"
      },
      {
        "paragraph": "her, so why did Rebecca need to do something so desperate like drugging her?"
      },
      {
        "paragraph": "The car sped to the villa."
      },
      {
        "paragraph": "Right after he got out of the car, he noticed that several guards in the front yard were missing."
      },
      {
        "paragraph": "“Mr. Costner, b-bad news.” The overwhelmed butler trotted over with a pale and chubby face. “\nRebecca… Rebecca fell from the building.”"
      },
      {
        "paragraph": "Titus stiffened, and his assistant was shocked. “ How did that happen? Is she still alive?”"
      },
      {
        "paragraph": "“ She’s dead, ” the butler shuddered and said, “You told us to lock her up, so we locked her up on the\nthird floor. The door was locked so she probably tried to escape from the window, but she accidentally\nslipped and fell onto the concrete floor head first. Her skull was split open.”"
      },
      {
        "paragraph": "“Useless!”"
      },
      {
        "paragraph": "Titus snapped and strode over immediately."
      },
      {
        "paragraph": "In the open space of the backyard, a group of bodyguards had gathered around."
      },
      {
        "paragraph": "Next to the corner of the wall was Rebecca’s body covered with a white cloth."
      },
      {
        "paragraph": "When the guards saw Titus coming, they immediately made way for him."
      },
      {
        "paragraph": "Titus went over and lifted the cloth. When he saw Rebecca’s face, he laughed in anger."
      },
      {
        "paragraph": "“I told you to watch over her, yet you let this happen?” Titus’s icy eyes swept toward the guards."
      },
      {
        "paragraph": "All of the guards were elites, but when faced with Titus’ height of two meters, they felt oppressed by\nhim."
      },
      {
        "paragraph": "In the end, it was the captain who stepped forward. “W-We’re sorry. We wanted to seal the windows but\nthere were no boards in the villa that we could board the windows up with, so I thought that we’d seal\nthem tomorrow. It was dark in the courtyard at night and there were no pipes on the walls that she\ncould use to escape. Our men were also standing guard under the windows, so we didn’t think that she\nwould escape.”"
      },
      {
        "paragraph": "“Yes, we were also shocked when we suddenly heard a crash.” Another guard also stepped forward\nand said, “Mr. Costner, although you told us to watch over her, we were also sent by the prime minister"
      },
      {
        "paragraph": "to protect you. If word of this woman’s sudden death gets out, the consequences will be hard to deal\nwith. After all, she’s not a real criminal and there’s no evidence of her crime.”"
      },
      {
        "paragraph": "Titus glanced at the man coldly. The man’s heart thumped, but he still puffed out his chest and said, “\nI’m telling the truth.”"
      },
      {
        "paragraph": "Titus’ face grew cold as he went silent for a moment. Then, he reached out to his assistant. “ Bring me\na pair of gloves.”"
      },
      {
        "paragraph": "The assistant hurriedly found a pair of gloves from the villa and handed them to him."
      },
      {
        "paragraph": "Titus personally went over and crouched to examine Rebecca’s corpse. Then, he looked back at the\ngroup of guards, saying to the captain, “Take her away. You should know how to handle it. Keep a low\nprofile.”"
      },
      {
        "paragraph": "Then, he went upstairs and left the group of guards to stare at each other."
      },
      {
        "paragraph": "The assistant followed behind him. When they entered the study, he asked in a low voice, “Mr. Costner,\nhow did she suddenly die?”"
      },
      {
        "paragraph": "“She was pushed down from the room, ” Titus lit up a cigarette and said indifferently."
      }
    ]
  },
  {
    "title": "Chapter 1645 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "The assistant was shocked. “That can’t be.”"
      },
      {
        "paragraph": "Then, he suddenly realized that after Titus took Sheryl to the hospital today, only two bodyguards were\nleft in the hospital. They were still keeping guard outside her ward."
      },
      {
        "paragraph": "Besides the butler and servants, only the security guards were left in the villa."
      },
      {
        "paragraph": "If a housekeeper or servant wanted to push Rebecca down, the woman would definitely scream and\nresist. However, none of the guards knew about it and thought that she fell to her death from the\nwindow because she tried to escape."
      },
      {
        "paragraph": "It was too bizarre."
      },
      {
        "paragraph": "“President Costner, are you suspecting that… ” That it was someone from the security team who killed\nRebecca?"
      },
      {
        "paragraph": "When the assistant said that, Titus gave him a warning look and spoke in a voice that only the two of\nthem could hear, “She has bruises on her back and arms, which she probably got when grappling with\nanother person.” The assistant fell silent."
      },
      {
        "paragraph": "Titus was the head of the Costner family."
      },
      {
        "paragraph": "Although the Costner family was fiercely competitive, Titus had climbed up from the bottom step by\nstep. Hence, he was experienced."
      },
      {
        "paragraph": "“President Costner, the people protecting us outside were assigned by Nathan Snow. Do you think he\n—”"
      },
      {
        "paragraph": "“No. ” Titus shook his head. “Nathan just rose to his position. It’s impossible for him to control the entire\ncountry at once, and it’s impossible to make everyone loyal to him. There’ll always be people who act\nfor the sake of profits. They’ll think differently from him."
      },
      {
        "paragraph": "The assistant was a little alarmed. “President Costner, why don’t we… leave Australia first? Any other\ncountry would be safer than Australia now. ”"
      },
      {
        "paragraph": "Titus snorted a laugh. “ I’ve experienced all sorts of things and even been to war-torn battlefields. Do\nyou think I’d be scared of this?”"
      },
      {
        "paragraph": "The assistant smiled wryly. ‘That was when you were still young.’"
      },
      {
        "paragraph": "“But we can’t stay here either. Who knows which ones of those guards are the good ones? They might\neven try to harm you.”"
      },
      {
        "paragraph": "“Don’t worry, they won’t dare to touch me, and they won’t dare to let me die while I’m in Australia either.\nThey only killed Rebecca to silence her.” Titus sneered. “I’m now go percent sure that she’s not\nSheryl’s daughter at all.”"
      },
      {
        "paragraph": "The assistant was shocked, and his scalp tingled. “ She’s really bold for daring to scheme with you\naround. However, in Madam’s current state, she won’t believe us. If she finds out that Rebecca is dead,\nshe might even…”"
      },
      {
        "paragraph": "Titus took a deep drag of the cigarette, his unfathomable eyes overflowing with annoyance. “ That’s\nwhy we have to cure her illness as soon as possible. Conceal this matter from her first. She mustn’t\nfind out about it.”"
      },
      {
        "paragraph": "The assistant thought about it. “Now that Rebecca is dead, we can’t ask her what drug she gave\nMadam. Why don’t I search her room…”"
      },
      {
        "paragraph": "“Go ahead, but I don’t think you’ll be able to find anything. It was definitely taken away by someone.”\nTitus did not have much hope. The people around him had already killed Rebecca, so there was no\nway they would leave the drug behind."
      },
      {
        "paragraph": "The assistant went to look for the drug anyway, but in the end, nothing was found."
      },
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "Chester brought a doctor to examine Shaun, who determined that Shaun could be discharged from the\nhospital."
      },
      {
        "paragraph": "Catherine immediately ran downstairs to go through the discharge formalities."
      },
      {
        "paragraph": "After confirming that he no longer needed to stay in the hospital, Shaun was overjoyed. “That’s great. I\nwant to go to the playground.”"
      },
      {
        "paragraph": "Catherine, “….”"
      },
      {
        "paragraph": "She pictured an image of a 3o- year- old man playing in the sandbox and was a little unsure of how to\nrefuse his request."
      },
      {
        "paragraph": "Elle cleared her throat. “Well… Young Master Hill, you can’t wear your patient gown out. You have to\nchange first.”"
      },
      {
        "paragraph": "“Elle, I already said that my name isn’t Young Master Hill. That’s such an ugly name. Just call me\nShaunny.” Shaun rolled his eyes at her and revealed a look of disdain."
      },
      {
        "paragraph": "Elle was distressed. How would she dare to call Young Master Hill ‘Shaunny’? She did not have the\nguts to."
      }
    ]
  },
  {
    "title": "Chapter 1646 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Elle was afraid that Shaun would strangle her to death when he recovered."
      },
      {
        "paragraph": "“Go and change.” Catherine saw Elle’s embarrassed look and took out a set of men’s casual clothes\nfrom the closet. The clothes would make him look like a man with a sunny disposition. It was a pair of\njeans and a denim shirt. She thought that Shaun would definitely look good in them."
      },
      {
        "paragraph": "However, Shaun took one look at the clothes and frowned. “I don’t like them. They’re ugly.”"
      },
      {
        "paragraph": "“They’re not ugly. They look good. You’ll look like someone with a sunny disposition if you wear these\nclothes.” Catherine coaxed him."
      },
      {
        "paragraph": "“I don’t want to wear these.” Shaun twisted his body. His spoiled attitude made Elle have goosebumps\nall over. She really did not know how Catherine could face Young Master Hill when he was acting like\nthis. It was indeed true love."
      },
      {
        "paragraph": "“Then what do you want to wear?” Catherine sighed and asked in resignation."
      },
      {
        "paragraph": "Shaun grinned, his white teeth flashing brightly. “ The PAW Patrol shirt Lucas wore last time looks really\nnice. I like it.”"
      },
      {
        "paragraph": "Catherine, “….”"
      },
      {
        "paragraph": "Shaun continued, “Also, that brother in the corridor from yesterday… His Ultraman shirt also looks\ngood.”"
      },
      {
        "paragraph": "Elle’s sweat dripped. If Young Master Hill dressed like that, it would definitely turn heads."
      },
      {
        "paragraph": "“But I want to see you in these clothes more.” Catherine’s eyes suddenly overflowed with deep\ndisappointment. “I thought that Shaunny would look more handsome in these clothes, so I specially\nchose them for you. I guess you don’t like what I chose.”"
      },
      {
        "paragraph": "Then, her stunning eyelashes slightly drooped, making her look incredibly crestfallen."
      },
      {
        "paragraph": "Shaun immediately panicked and quickly waved his hand. “No, no, I like them. Cathy, don’t be sad. I’ll\nwear them.”"
      },
      {
        "paragraph": "Then, he hurriedly grabbed the clothes."
      },
      {
        "paragraph": "“Thank you, Shaunny. ” Catherine looked up and revealed a happy expression."
      },
      {
        "paragraph": "Shaun grinned from ear to ear."
      },
      {
        "paragraph": "Elle could not bear to look at this scene and quickly went out the door."
      },
      {
        "paragraph": "Sure enough, as long as Young Master Hill and Miss Jones were together, it did not matter if he was a\nfool. They always showed off how affectionate they were."
      },
      {
        "paragraph": "Catherine helped Shaun take off his patient gown and said in a low voice, “Shaunny, you have to learn\nhow to wear your own clothes. You can’t expect me t o help you all the time. Look, this is how you\nbutton your shirt.”"
      },
      {
        "paragraph": "“Oh, but I’m just a kid. I don’t wanna move,” Shaun said matter-of-factly."
      },
      {
        "paragraph": "“All kids have to learn how to dress themselves. Suzie and Lucas can already put on their clothes by\nthemselves.” Catherine persuaded him."
      },
      {
        "paragraph": "“But they’re older than me.”"
      },
      {
        "paragraph": "Older her *ss! Just how shameless was he?"
      },
      {
        "paragraph": "“But you’re much taller than them,” Catherine said seriously, “You’re as tall as me. Aren’t you\nembarrassed?”"
      },
      {
        "paragraph": "“Nope.” Shaun shook his head."
      },
      {
        "paragraph": "There was no point in continuing this conversation."
      },
      {
        "paragraph": "Catherine felt like she had to go dig up the old picture books she previously bought for Lucas and Suzie\nthat showed kids how to do day-to-day tasks by themselves."
      },
      {
        "paragraph": "After changing his clothes, Catherine took Shaun’s hand and prepared to go home."
      },
      {
        "paragraph": "However, right after opening the door, they saw a foreign man in a suit standing outside. He was talking\nwith Elle."
      },
      {
        "paragraph": "When the man saw Catherine, he came forward. “"
      },
      {
        "paragraph": "Hello, Miss Jones. I’m President Costner’s assistant, Warren Morse. President Costner wishes to meet\nwith you. He’s waiting for you in the parking lot.”"
      }
    ]
  },
  {
    "title": "Chapter 1647 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine remembered seeing this person beside Titus before."
      },
      {
        "paragraph": "Titus had helped her yesterday, so she could not refuse. “Okay.”"
      },
      {
        "paragraph": "She wanted to go to the parking lot anyway. They took the elevator down."
      },
      {
        "paragraph": "Shaun leaned on the glass elevator like a curious baby. The glass was transparent, so he could see the\ncrowd on the first floor below."
      },
      {
        "paragraph": "“Wow! Look, Cathy. There are so many people.”"
      },
      {
        "paragraph": "Warren could not help but glance over. He had seen Shaun Hill’s powerful appearance in the news, so\nhis behavior seemed… odd."
      },
      {
        "paragraph": "Catherine did not explain anything to him. After reaching the parking lot, she persuaded Shaun to wait\nin Hadley’s car first."
      },
      {
        "paragraph": "“No, I wanna go with you. ” Shaun held her hand tightly."
      },
      {
        "paragraph": "“Okay. ” Catherine had no choice but to take him along."
      },
      {
        "paragraph": "Titus was sitting in a Rolls-Royce sedan."
      },
      {
        "paragraph": "Catherine opened the door and saw Titus in the backseat. After hesitating, she let Shaun get in first\nbefore sitting by the door."
      },
      {
        "paragraph": "“Hello, Mister, ” Shaun smiled politely and called out sweetly when he saw Titus."
      },
      {
        "paragraph": "He remembered Cathy saying that it was important to be polite to elders."
      },
      {
        "paragraph": "“Mister, you’re so tall.” Shaun saw that Titus’ head was almost touching the roof of the car. “But Cathy\nsaid that as long as I eat more, I’ll definitely be as tall as you.”"
      },
      {
        "paragraph": "His words made Catherine a little embarrassed."
      },
      {
        "paragraph": "Seeing his silly behavior, Titus frowned and jerked his head at Catherine. “He’s… really like this now?”"
      },
      {
        "paragraph": "“Yeah.” Catherine nodded."
      },
      {
        "paragraph": "“How did he become like this?” Titus asked."
      },
      {
        "paragraph": "“ It was Wesley,” Catherine said, not caring about whether he would believe her or not. “Uncle Titus,\nwhat did you call me here for?”"
      },
      {
        "paragraph": "Titus looked at her. She was even calling him ‘Uncle Titus’ now, so it seemed they were no longer as\ndistant toward each other."
      },
      {
        "paragraph": "He had no problems with it. After all, it was possible that she was Sheryl’s daughter, so they might be a\nfamily in the future."
      },
      {
        "paragraph": "“Rebecca is dead.”"
      },
      {
        "paragraph": "His thin lips moved as he spat out a piece of explosive news."
      },
      {
        "paragraph": "“What?” Catherine was completely shocked as her eyes widened. “You… You’re joking, right?”"
      },
      {
        "paragraph": "Titus observed her expression and confirmed that she really did not know anything about it. Frankly\nspeaking, he had been a little worried that she called Nathan and got the guard to kill Rebecca."
      },
      {
        "paragraph": "It seemed that he was too paranoid."
      }
    ]
  },
  {
    "title": "Chapter 1648 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“She’s dead. I went back too late last night, and when I came back, it turned out Rebecca had fallen\nfrom the balcony and died. The guard said that she fell to her death when she was trying to escape.\nHer body has already been sent to the funeral home. ”"
      },
      {
        "paragraph": "Catherine was stunned."
      },
      {
        "paragraph": "She was a little dumbfounded."
      },
      {
        "paragraph": "She had always regarded Rebecca as an indestructible cockroach. How did she suddenly die like that?"
      },
      {
        "paragraph": "She had painstakingly made up one lie after another and became Sheryl’s daughter just so she could\nget revenge on Catherine and Shaun. She was completely fine before this, so how did she suddenly\ndie?"
      },
      {
        "paragraph": "Catherine felt like she was dreaming."
      },
      {
        "paragraph": "“How could Rebecca die so easily?” Catherine muttered. “Is she faking it?”"
      },
      {
        "paragraph": "“It’s true.” Titus nodded and made light of the matter. “It’s just a dead person. What’s the big deal?”"
      },
      {
        "paragraph": "Catherine smiled wryly. “You might not know this, but I’ve been fighting Rebecca for several years."
      },
      {
        "paragraph": "Every time I think that I’m about to win, she’s somehow able to turn the tides. In any case, she made\nthe lives of me and my friends quite miserable. I never even expected to beat her, so I thought that I\nwould take her down with me.”"
      },
      {
        "paragraph": "Titus looked at her deeply and could tell that Rebecca had truly pushed her to the edge. Of course, part\nof the reason was because of Sheryl and his involvement too."
      },
      {
        "paragraph": "“I checked Rebecca’s body. She was pushed off the building. That day, besides the butler and the\nservants, only the security guards were in the villa.”"
      },
      {
        "paragraph": "Catherine paused and thought for a few seconds before saying, “It’s probably one of the guards who\ndid it. If the butler or servants had tried to push her down, it would definitely attract the attention of the\nguards. It has to be one of the guards.”"
      },
      {
        "paragraph": "“We have the same thoughts.”"
      },
      {
        "paragraph": "Titus revealed an expression of approval. “I’ve already informed Prime Minister Snow about this matter.\nHe was also very surprised and has started secretly investigating it.”"
      },
      {
        "paragraph": "Catherine nodded. “Uncle Nathan just became the prime minister, so he might not have settled the\nformer cabinet from Prime Minister Zeller’s time. The government dignitaries on Uncle Nathan’s side\nare also rising. Some people may start to become disloyal after rising in status.”"
      },
      {
        "paragraph": "“You’re very smart.” Titus raised his eyebrows. He was more and more certain that Catherine was\nSheryl’s daughter. Sheryl also used to be this calm and wise. Unfortunately…"
      },
      {
        "paragraph": "“Actually, there’s one person I’m suspicious of,” Catherine said, “Gavin Mead. He was previously\nSenator Mead and is now currently Minister Mead. He’s very close to Wesley now. Wesley was\nprobably afraid that Rebecca would rat him out, so he asked the Mead family to silence her.”"
      },
      {
        "paragraph": "“As far as I know, that person is Nathan Snow’s left and right hand.” Titus’ eyes flickered. “It seems\nWesley is only familiar with him because of the bridge built by Rebecca. They haven’t known each\nother for long.”"
      },
      {
        "paragraph": "“You don’t understand Wesley. He’s very shrewd and much more powerful than Rebecca. I think that\nRebecca was just a pawn for him to use. Now, Golden Corporation is expanding rapidly and can’t be\ncompared to how it was before. Wesley has taken"
      },
      {
        "paragraph": "over the medical industry in Country Y. Gavin Mead looked down on Wesley before this because he\nwas not qualified, but it’s different now. Everyone wants to earn money and get more benefits. To put it\nbluntly, a businessman and politician share very complementary relationships.”"
      },
      {
        "paragraph": "Catherine smiled. “I’ve been to the Meads’ residence before and met his daughter a few times before.\nHis daughter is quite arrogant and even looked down on Nathan’s goddaughter. You can tell the\ncharacter of someone by how they’ve raised their children. I think Minister Mead must’ve become more\nambitious after rising in position."
      },
      {
        "paragraph": "People are like that. The more they own, the more they want."
      },
      {
        "paragraph": "“What you said is quite interesting.”"
      },
      {
        "paragraph": "Titus expressed his approval. “If it’s really him, then it’ll be troublesome. I don’t think Nathan will be\nwilling to have a fallout with Gavin.”"
      },
      {
        "paragraph": "“Yes. He just rose to his position. If he cuts off his right-hand man, Gavin Mead, it’ll be detrimental to\nhim. Although Uncle Nathan usually treats us well, that’s only on the premise that it doesn’t affect his\nposition.” Catherine was very self-aware. “He’ll probably try to act as a peacemaker in this matter.”"
      },
      {
        "paragraph": "“Cathy, what are you talking about? You’re making my head spin.” Shaun, who was squeezed between\nthe two, suddenly pouted and complained."
      },
      {
        "paragraph": "“Sorry, Shaunny. Uncle Titus and I will finish talking soon.” Catherine comforted him warmly and said to\nTitus, “Thank you for bringing me this news today. If there’s nothing else, I’ll…”"
      },
      {
        "paragraph": "“I brought Sheryl to the hospital for a check—up yesterday. Your suspicions were right. Rebecca had\ndrugged her meals,” Titus interrupted her and said."
      }
    ]
  },
  {
    "title": "Chapter 1649 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine’s gentle face stiffened bit by bit."
      },
      {
        "paragraph": "After Suzie’s kidnapping, she had lost all affection she had for Sheryl and even hated her."
      },
      {
        "paragraph": "However, she was still surprised to hear that Rebecca had drugged Sheryl’s meals."
      },
      {
        "paragraph": "She only brought it up before because Shaun had reminded her, but she was not sure that Rebecca\nwould do something like that to Sheryl."
      },
      {
        "paragraph": "Titus looked at her and said in a heavy voice, “The doctor said that they found traces of an illegal drug\nin her bloodstream, which is usually taken by patients after surgery or patients suffering from mental\nillness. If she takes it for a long time, she’ll suffer from insomnia, mental decline, mood swings,\nemotional restlessness, and even hallucinations. She’ll be addicted too. I’ve put her in the hospital for\nnow.”"
      },
      {
        "paragraph": "Catherine was stunned. She pursed her lips and rubbed Shaun’s head. “When Rebecca was by\nShaun’s side as his caretaker before this, she had also used a similar drug, but he was suffering from"
      },
      {
        "paragraph": "mental illness back then. Later on, his condition grew more serious and he forgot many things. He even\nbecame paranoid and got hallucinations.”"
      },
      {
        "paragraph": "“Then? Was he cured?” Titus asked eagerly."
      },
      {
        "paragraph": "“He was cured by a famous psychiatrist abroad. That person is Sarah Neeson. She’s indeed capable,\nbut Sarah is his ex-girlfriend. She’s a scheming woman. Not only did she tamper with his memory, but\nshe also left him with a huge after-effect that caused him to become like how he is now.” Catherine’s\neyes became filled with hatred when she mentioned this."
      },
      {
        "paragraph": "Titus was silent for a while. He rubbed his eyebrows and said, “You have a lot of enemies.”"
      },
      {
        "paragraph": "“What I mean is that Sarah is really famous in the field of psychology. But if someone recommends her\nto you, don’t look for her. I think she’s already working with Wesley.” Catherine reminded him."
      },
      {
        "paragraph": "“Okay. I know better psychologists anyway, ” Titus said faintly, “But Sheryl doesn’t have an illness."
      },
      {
        "paragraph": "She only became like this because of the drug. Unfortunately, Rebecca’s death has made it impossible\nfor us to find out what drug she gave Sheryl. The doctor said that she can be treated sooner if they\nknow what drug she ingested.”"
      },
      {
        "paragraph": "Catherine hummed and said nothing in response. Her expression was indifferent. It put an end to the\ntopic of Sheryl."
      },
      {
        "paragraph": "Titus was a little conflicted. Sheryl did feel guilty toward this child, but unfortunately, fate got in the way\nand Rebecca took advantage of it."
      },
      {
        "paragraph": "Now, her real daughter bore a grudge against her."
      },
      {
        "paragraph": "“Do you hate Sheryl? Actually, you haven’t been in contact with her much. Her real character isn’t\nanything like how she’s been behaving recently."
      },
      {
        "paragraph": "She was like you when she was young—smart, wise, and calm. That’s why I fell in love with her."
      },
      {
        "paragraph": "There were women who pursued me before, but she never hit or scolded them. She always had a way\nto make them back off.”"
      },
      {
        "paragraph": "Titus said with a complicated expression, “ She’s not a vicious person. She was instigated by Rebecca\nand was convinced by her because the drug affected her brain.”"
      },
      {
        "paragraph": "“Uncle Titus, is she really smart, wise, and calm? Sorry, but I don’t think so. She couldn’t even notice\nthat the woman beside her had ulterior motives. If a stupid person fell into a trap, I wouldn’t say\nanything. But she was used by others like a tool."
      },
      {
        "paragraph": "She ruined a person’s life and she almost killed a child. I can’t forgive such a person.”"
      },
      {
        "paragraph": "Catherine’s beautiful and delicate face was very cold. “She crossed the line when she kidnapped\nSuzie.”"
      },
      {
        "paragraph": "Her words were very unpleasant to hear but Titus did not get angry. “How do you know that she didn’t\nrealize Rebecca’s intentions? I believe that she did. However, she had just acknowledged Rebecca as\nher daughter, so she couldn’t try to correct Rebecca’s problems from the start. Many things have to be\ndone step by step. Besides, she really did feel indebted to her daughter. Back then when she was\nrescued at sea, she had lost her memories but still tried to find her family. She searched all over the\nworld for years but didn’t find any news."
      },
      {
        "paragraph": "“Then, Matthew appeared with Rebecca and said that they looked alike. A DNA test was also done,\nwhich said they were a perfect match. Rebecca talked about Sheryl’s history and knew about her past,\nfamily, and siblings. When we investigated, we found that she was indeed Sheryl Jones. After coming\nback to Australia, Sheryl’s brother and sister-in-law also appeared. Everyone said that Rebecca was\nher daughter.”"
      }
    ]
  }
]