[



  {
    "title": "Chapter 1200 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“No.” Brennan fiercely punched his fist against the wall, making blood seep out. “That b*stard Mason\nCampos! He’s too vicious.”"
      },
      {
        "paragraph": "“Yes, he’s vicious. ” Shaun suddenly raised his red eyes. “Dad, there’s someone who knows Liam’s last\nlocation. I’ll get the person over and interrogate them.”"
      },
      {
        "paragraph": "He originally did not want to touch Yael, but for Liam, he had no choice but to act in advance."
      },
      {
        "paragraph": "In an unremarkable neighborhood in Canberra. Chance called out, “Food’s ready.”"
      },
      {
        "paragraph": "Yael came out from inside with a slightly bulging belly."
      },
      {
        "paragraph": "However, when Chance saw the delicate makeup on her face, his expression became ugly. “Yael, the\ndoctor said that women can’t use makeup when they’re pregnant. Cosmetics are harmful to the skin, but\nyou applied such thick makeup. Can’t you think about the baby?”"
      },
      {
        "paragraph": "“I’m already thinking about the baby. I didn’t even use eyeliner.”"
      },
      {
        "paragraph": "Yael said in an unpleasant tone, “Besides, if it weren’t for the pregnancy, would my face have grown\nspots? I’m only trying to cover the spots on my face.”"
      },
      {
        "paragraph": "“You— ”"
      },
      {
        "paragraph": "“Chicken soup again? I’m tired of drinking that. ” Yael complained."
      },
      {
        "paragraph": "Chance held back his anger and pursed his lips."
      },
      {
        "paragraph": "Before he lived with Yael, she was a sunny and lively girl in his heart. However, after he left Liona to be\nwith her, he realized that his character was completely incompatible with Yael. Even if he treated her like"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "a goddess, she was still nitpicky."
      },
      {
        "paragraph": "However, Yael was pregnant with his baby. As a man, he had to take responsibility."
      },
      {
        "paragraph": "Chance shut his eyes and took a step back, saying gently, “Tell me what you want to eat later. I’ll buy it\nfor you this afternoon.”"
      },
      {
        "paragraph": "“Okay.” Only then did Yael sit down to eat."
      },
      {
        "paragraph": "Her phone suddenly let out a ding. It was a WhatsApp message from Ivan. Ivan was Charlie’s cousin and\nthe current GM of Campos Corporation. He was handsome and majestic. Then, she looked at the 4o-\nyear-old Chance across from her."
      },
      {
        "paragraph": "Her heart flooded with disgust."
      },
      {
        "paragraph": "In the past, she used to think that Chance was very handsome and powerful. However, after leaving\nLiona, Chance no longer had the formidable aura that he used to have as the master of Liona. He\nimmediately lost his charm. Furthermore, Chance was a generation older than her, making her dislike\nhim more and more."
      },
      {
        "paragraph": "She did not want the baby in her belly anymore. If only she did not have this baby…"
      },
      {
        "paragraph": "Just as she thought about it, she suddenly felt light- headed and fainted on the table."
      },
      {
        "paragraph": "Chance paled and was just about to check on her when he felt himself getting dizzy too. In his\ndissipating consciousness, he vaguely saw the door open and someone coming in…"
      },
      {
        "paragraph": "When he woke up again, Chance found himself in a strange wooden house. He was tied to a pillar by a\nchain."
      },
      {
        "paragraph": "By the window, Shaun, who was dressed in black, was sitting on a wooden chair. He played with a\ndagger in his hands. His handsome face was indifferent without any emotion."
      },
      {
        "paragraph": "“Shaun, it’s you…”"
      },
      {
        "paragraph": "Before he could speak, Yael, who was tied up next to him, screamed. “Why did you tie us up?!”"
      },
      {
        "paragraph": "Shaun threw a look at Elle, who was standing by the side."
      }
    ]
  },
  {
    "title": "Chapter 1201 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Elle walked up to Yael and slapped her across the face, making half of her face swell up."
      },
      {
        "paragraph": "“Argh, Elle, you b*tch! ” Yael screamed. “How dare you hit me? I’ll make your life worse than death. I’m\ntelling you, Shaun Hill isn’t the same as before. If you’re smart, you’d better leave him. Otherwise, I’ll kill\nyou! ”"
      },
      {
        "paragraph": "“You talk too much.” Elle slapped the other side of her face to make it balanced."
      },
      {
        "paragraph": "Yael’s mouth buzzed. She was in so much pain that she could not speak. She could only look at Chance\nfor help."
      },
      {
        "paragraph": "“That’s enough.”"
      },
      {
        "paragraph": "Chance yelled for them to stop. “Eldest Young Master Hill, Yael is right. We already left Liona and have\nnothing to do with Liona. What are you trying to do now? I worked like a slave for Liona, but now you’re\nbullying my woman. You can’t be that shameless.”"
      },
      {
        "paragraph": "“Shameless?”"
      },
      {
        "paragraph": "Shaun smiled as if he had heard a joke. “Chance, you have indeed done a lot for Liona, but Liona hasn’t\ntreated you badly in these years either. From"
      },
      {
        "paragraph": "these years, you’ve accumulated at least hundreds of billions of dollars in your hand. The Hill family gave\nyou power, status, and money, but in the end, you became the person who deceived me the most.”"
      },
      {
        "paragraph": "Chance immediately broke out into goosebumps. “… I didn’t. This is slander…”"
      },
      {
        "paragraph": "“Slander?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun smiled again and glanced at Elle. Elle slapped Yael again."
      },
      {
        "paragraph": "“Elle… Shaun…. You won’t… die natural deaths…” Yael cursed them while enduring the pain."
      },
      {
        "paragraph": "“ Stop! ” Chance yelled in agitation. “ Shaun, don’t hurt her. She’s carrying my baby.”"
      },
      {
        "paragraph": "“You deceived me so unscrupulously because she’s carrying your baby?” Shaun suddenly aimed the\nknife at Yael’s stomach. “As long as I push it down gently, your child will be fine.”"
      },
      {
        "paragraph": "Chance’s face turned pale. “No, Eldest Young Master Hill, I’m begging you.”"
      },
      {
        "paragraph": "“Then I want to know the whole truth about the day Liam disappeared. You can choose not to speak, but\nyou only get one chance,” Shaun said faintly. Yael was frightened. “I don’t know what you—mmh"
      },
      {
        "paragraph": "Before she could finish speaking, Elle stuffed her mouth with a dirty rag."
      },
      {
        "paragraph": "Chance looked at Shaun’s expressionless face and bowed his head with a bitter smile. “I’m sorry, Eldest\nYoung Master Hill. I lied to you. After I tossed Liam out that day, I called the Campos family. The Campos\nfamily bought me off a long time ago. I’ve let you down.”"
      },
      {
        "paragraph": "Yael’s agitated and struggling body suddenly stopped as she looked at Chance in a daze."
      },
      {
        "paragraph": "“I didn’t expect someone of your age to shoulder all the responsibility in order to protect a woman.”\nShaun smiled faintly and took a step back."
      },
      {
        "paragraph": "Elle opened a box filled with all kinds of silver needles. Chance and Yael were once from Liona and\nquickly recognized that they were Liona’s most cruel torture tools. If they were pricked by those needles,\nthey would feel a pain that was worse than death. Even so, there would be no scars left on the body."
      },
      {
        "paragraph": "Elle took out the silver needles and pricked them into Yael’s body."
      },
      {
        "paragraph": "Yael was in so much pain that tears and snot flowed out. Her whole body convulsed violently."
      },
      {
        "paragraph": "“Shaun Hill…” Chance roared."
      },
      {
        "paragraph": "Shaun lit a cigarette indifferently. “Chance, I’m very busy. I don’t have the time to dally with you here. I\nwant to hear the truth. Don’t wait until all the needles are pricked into Yael before telling me. She’ll be\ngone by then.”"
      },
      {
        "paragraph": "“I’ll talk. I’ll talk, Eldest Young Master Hill, so stop it,” Chance said agitatedly, “I took Yael along with m e\nthat day, but I didn’t expect that Liam would go missing. I only found out when you told me to look into it.\nI didn’t say anything in order to protect Yael. I’m sorry.”"
      }
    ]
  },
  {
    "title": "Chapter 1202 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“So it was Yael who colluded with the Campos family, and it was also her who stole the microchip data\nand framed Liam, right?” Shaun asked aggressively."
      },
      {
        "paragraph": "“I don’t know.” Chance shook his head blankly and painfully."
      },
      {
        "paragraph": "“No, you do know.” Shaun took out the rag in Yael’s mouth."
      },
      {
        "paragraph": "Yael was in so much pain her face was devoid of blood. When she saw the needle in Elle’s hand, her\nwhole body trembled with fear. “N-No, he’s lying. I t was Chance who colluded with the Campos family.\nI’m innocent. Everything was done by Chance. He was bribed by the Campos family.”"
      },
      {
        "paragraph": "Chance froze and stared at Yael with wide eyes. He did not expect that the woman he loved would end\nup pushing all the blame to him."
      },
      {
        "paragraph": "Shaun glanced at Chance and took out Yael’s phone. He opened up her WhatsApp and showed the\nscreen to Chance. “You might not know her well enough. When you were eating together earlier, she was\nflirting with Ivan Campos.”"
      },
      {
        "paragraph": "Chance read the ambiguous and explicit words, his eyes flaring in anger. “Yael, you b*tch!”"
      },
      {
        "paragraph": "“That’s a lie. I didn’t do it.” Yael was pale with fear and kept defending herself."
      },
      {
        "paragraph": "“Oh, right. There’s still more above. She said she wanted to find a time to get rid of your baby because\nshe hates that you’re so old.” Shaun chuckled in a low voice."
      },
      {
        "paragraph": "Chance’s muscles trembled, and even his eyes were red with pain. After a long time, he hung his head\nwith grief and remorse. “Eldest Young Master Hill, I’m sorry. I was wrong. I betrayed you for this woman. I\ndeserve to die. Please kill me.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“I want to know the truth first,” Shaun said coldly."
      },
      {
        "paragraph": "Chance smiled bitterly. “I didn’t suspect her at first, but after Liam disappeared, I thought that the\nsituation wasn’t good and told her to leave Liona first. I then asked her and she admitted that she didn’t\nwant me to work for the Hill family all my life, so she did it for me. I was angry at her, but there was\nnothing I could do. At the same time, the Campos family would frequently approach us as they wanted\nme to work for them.”"
      },
      {
        "paragraph": "Shaun looked at Yael and said in a low voice, “I want to know where Liam is.”"
      },
      {
        "paragraph": "At first, Yael struggled to hold on, but after Elle pricked yet another needle into her, Yael broke down. “ I\npushed him off a cliff into the sea. I was just following the Campos family’s orders. It was Mason who told\nme to do it.”"
      },
      {
        "paragraph": "“That b*stard! ”"
      },
      {
        "paragraph": "Shaun kicked over the chair in front of him, his eyes bloodshot."
      },
      {
        "paragraph": "His guess was right. It was Mason who did it."
      },
      {
        "paragraph": "Liam was definitely his full brother."
      },
      {
        "paragraph": "“Was it also Mason who told you to frame Liam for the stolen microchip data?” Shaun asked again."
      },
      {
        "paragraph": "Yael nodded feebly. “Yes, he said that Liam didn’t listen to him, so he wanted to teach Liam an\nunforgettable lesson.”"
      },
      {
        "paragraph": "Shaun smiled tragically."
      },
      {
        "paragraph": "At that time, he had beaten Liam up and Liam refused to admit it. He said that he did not betray them,\nbut Shaun did not believe him."
      },
      {
        "paragraph": "He did not believe his own brother."
      },
      {
        "paragraph": "‘Mason Campos, you’re so cruel.’ His grudge with the Campos family would never end in this life."
      },
      {
        "paragraph": "He pried Yael’s mouth open and stuffed a pill inside. Yael was terrified. “What did you make me\nswallow?”"
      },
      {
        "paragraph": "“Poison. If you don’t take the antidote every month, you’ll die from the festering wounds all over your\nbody. This poison can’t be cured even by the best doctors.”"
      },
      {
        "paragraph": "Shaun looked at Chance. “Chance, I’m giving you a chance to see your child.”"
      }
    ]
  },
  {
    "title": "Chapter 1203 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Chance was once the leader of Liona, so he quickly understood. “You want me to go undercover to the\nCampos family?”"
      },
      {
        "paragraph": "Shaun nodded. As expected of someone who had followed him for many years. “Chance, think of your\nfamily. They’ve been working for the Hill family for generations, and the Hill family has invested so much\neffort in you. If the Hill family falls, you can leave, but you can’t betray us."
      },
      {
        "paragraph": "According to Liona’s rules, traitors will be executed. Think about it. If it weren’t because of your\nconnivance, would the Hill family fall to where we are today?”"
      },
      {
        "paragraph": "Chance was ashamed."
      },
      {
        "paragraph": "Yes, it was because he was infatuated with Yael’s youth and beauty."
      },
      {
        "paragraph": "If not for his connivance, Yael would not have had the opportunity to steal the microchip data from Hill\nCorporation’s lab. If it were not for him, Yael would not have been able to kill Liam."
      },
      {
        "paragraph": "“Eldest Young Master Hill, I’m sorry. I’m willing to atone.” Chance looked up and said fiercely, “I was blind\nbefore and was bewitched by this b*tch, Yael. I’ll never let it happen again. I swear to be loyal to you my\nentire life.”"
      },
      {
        "paragraph": "Shaun said callously, “You think too much. I won’t keep someone who betrayed me by my side, and I\nwon’t trust you either. I just want you to finish this job cleanly and then you can get lost with your child. If\nyou fail, there’s no need for you, this woman, or the baby in her belly.”"
      },
      {
        "paragraph": "Chance’s face turned red with shame."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Don’t worry, Eldest Young Master Hill. Chance will definitely do the job well,” Yael quickly spoke. No\nmatter how stupid she was, she knew that her life relied on Chance now. She was someone who was\nafraid to die."
      },
      {
        "paragraph": "Chance looked at the woman with incomparable disgust and abhorrence. What a craven and cowardly\nopportunist."
      },
      {
        "paragraph": "This was the woman he loved. He had betrayed his conscience for her."
      },
      {
        "paragraph": "Shaun raised his brows at Yael. “Of course, if Chance has to go undercover, you have to go too. I believe\nthat you’ll do a better job than Chance.”"
      },
      {
        "paragraph": "Yael was horrified. “E-Eldest Young Master Hill, I’m pregnant.”"
      },
      {
        "paragraph": "“You’re pregnant, but aren’t you fooling around with Ivan?” Shaun’s gaze swept over her stomach. “\nAnyway, your fetus is stable now, so you can do whatever needs to be done.”"
      },
      {
        "paragraph": "Chance and Yael were shocked. They were clearly not expecting Shaun to be so unscrupulous."
      },
      {
        "paragraph": "Shaun threatened grimly, “What is that look for? I’m just fulfilling your wish. Don’t worry, you don’t have to\ndo anything. Just cooperate with Chance and let him obtain the trust of the Campos family. After all, if\nyou go missing, the Campos family will suspect Chance. Also, let me remind you, you can play around,\nbut if anything happens to the baby in your belly, I won’t give you the antidote.”"
      },
      {
        "paragraph": "Yael’s heart trembled. She could only turn to Chance, hoping that he would speak up for her. “ Chance,\ndo you want me to have sex with another man?”"
      },
      {
        "paragraph": "“Eldest Young Master Hill is right. Isn’t that your wish? Yael, I only want the baby. I don’t need you, ”\nChance said coldly."
      },
      {
        "paragraph": "“Enough, you can leave now. The car will send you back.”"
      },
      {
        "paragraph": "Shaun let Elle untie them. “Don’t try to play tricks on me.”"
      },
      {
        "paragraph": "Yael followed Chance out in a daze. When she got into the car, she tried to grab onto Chance but he\nshook her off coldly."
      },
      {
        "paragraph": "The car swiftly sent the two away."
      },
      {
        "paragraph": "After the car disappeared, Brennan walked in from outside the wooden house. “Your plan is good, but\nthat woman killed Liam. She can’t be spared.”"
      },
      {
        "paragraph": "“Don’t worry, Dad. Whether Yael succeeds or fails, I’ll make sure she ends up with a fate worse than\ndeath.”"
      },
      {
        "paragraph": "An hour later."
      },
      {
        "paragraph": "Shaun and Brennan stood on top of a cliff."
      },
      {
        "paragraph": "Below them was the turbulent sea. Brennan looked down, and tears of pain overflowed from the corners\nof his eyes. His son had been thrown down from here."
      }
    ]
  },
  {
    "title": "Chapter 1204 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“This cliff is too high and the waves are too strong. I broke Liam’s leg and beat him until he vomited\nblood. There’s almost no possibility of survival.”"
      },
      {
        "paragraph": "The more Shaun spoke, the more he blamed himself and felt remorseful. He dropped to his knees in\nfront of Brennan and shed tears. He said hoarsely, “Dad, I’m sorry. It was my stupidity that killed Liam.”"
      },
      {
        "paragraph": "“No, it’s not all your fault. I’m also responsible for it. If only I hadn’t left back then. Your mother wouldn’t\nhave misunderstood, and Mason wouldn’t have had an opportunity.”"
      },
      {
        "paragraph": "Brennan had a grim expression. “Mason Campos is really vicious. Just because I ruined his plan, he\nwent out of his way to acknowledge Liam as his son for more than 20 years. Those 20 years, it was\nbecause of this misunderstanding that you and Liam fought all the time. In the end, he finally made you\nbrothers end each other. This was his real purpose.”"
      },
      {
        "paragraph": "“Don’t worry, Dad. I’ll definitely destroy Campos"
      },
      {
        "paragraph": "Corporation and make Mason pay the price.”"
      },
      {
        "paragraph": "At that moment, Shaun was enveloped with endless flames of hatred."
      },
      {
        "paragraph": "Mason Campos, Wesley Lyons, Sarah Neeson… They were all his enemies."
      },
      {
        "paragraph": "In Golden Corporation."
      },
      {
        "paragraph": "Wesley had been in a bad mood recently and constantly had a sullen expression."
      },
      {
        "paragraph": "Regina made a cup of coffee for him and came in. She stood behind him to massage his shoulders. As\nshe massaged him, her hands started to wander."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“This isn’t the time nor place.” Wesley grabbed her hand and warned. “What happened with Ethan last\ntime was a lesson.”"
      },
      {
        "paragraph": "“Don’t worry, I locked the door. ” Regina blew into his ear and said in a jealous tone, “President Lyons,\nyou keep going to Ms. Neeson every time. Is she so skilled that you don’t need me anymore?”"
      },
      {
        "paragraph": "“Are you jealous?” Wesley raised his eyebrows."
      },
      {
        "paragraph": "“Of course I am. You’re my first man,” Regina said with a pout."
      },
      {
        "paragraph": "The implication in those words was that Eugene was not Sarah’s first."
      },
      {
        "paragraph": "Wesley sat still. Regina knew how he liked to act like a gentleman, and flames of passion immediately lit\nbetween the two."
      },
      {
        "paragraph": "At the door, the assistant’s voice suddenly sounded. “Miss Jones, why are you here?”"
      },
      {
        "paragraph": "As soon as the words sounded, someone tried to open the office door but it was locked."
      },
      {
        "paragraph": "Wesley was shocked and immediately pushed Regina aside to straighten his clothes. “Hide in the locker\nof the lounge.”"
      },
      {
        "paragraph": "If Catherine came in and found that he was in a locked office with his female secretary in broad daylight,\nshe would definitely be suspicious. He would never allow such a thing to happen."
      },
      {
        "paragraph": "After Regina hid, he went over to open the door."
      },
      {
        "paragraph": "Catherine stood at the door, smiling. She carried a bag in her left hand and two cups of bubble tea in her\nright hand. She joked and said, “Why was the door locked? Are you hiding a beautiful lady here?”"
      },
      {
        "paragraph": "“I do want a beautiful woman, but that woman has been making me wait in agony.” Wesley smiled\nelegantly and said in surprise, “ I can’t believe you came to the company to see me. That’s rare. I went to\nthe restroom earlier, so I locked it because I was afraid of irrelevant people coming in.”"
      },
      {
        "paragraph": "“I was passing by, so I came up to see you. I bought two cups of bubble tea. Why don’t we drink them\ntogether?” Catherine pretended to be shy."
      },
      {
        "paragraph": "Wesley’s eyes brightened and he immediately let her in."
      },
      {
        "paragraph": "Catherine had just walked in when she smelled a woman’s perfume in the air. It was a fragrance she had\nsmelled on Regina before."
      },
      {
        "paragraph": "Although Regina was his secretary and it was not strange for his office to have the scent of her perfume,\nit should not be that strong, right?"
      }
    ]
  },
  {
    "title": "Chapter 1205 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Did Wesley not mind that his secretary’s perfume was so strong?"
      },
      {
        "paragraph": "Honestly, the scent was too artificial. Even if it was from a luxury brand, Catherine did not like it very\nmuch."
      },
      {
        "paragraph": "For some reason, she felt that Wesley’s image in her mind was becoming more and more… vulgar."
      },
      {
        "paragraph": "“Cathy, you know that I don’t like to take sweet stuff…” Wesley said hesitantly."
      },
      {
        "paragraph": "“So you’re refusing me?” Catherine pretended to be unhappy. “You said it yourself that it’s rare for me to\ncome see you.”"
      },
      {
        "paragraph": "“Okay, okay, okay. Since my wife said so, I’ll have to drink it.” Wesley immediately took the bubble tea\nfrom her and gulped it down. “It’s good. Anything my wife brings is sweet.”"
      },
      {
        "paragraph": "When he saw that Catherine did not put up resistance when he called her his wife, his heart rejoiced.\n“Cathy… I didn’t think that… I thought you were still angry at me.”"
      },
      {
        "paragraph": "“As I said… I was in the wrong too.” Catherine’s expression revealed embarrassment. “Stop mentioning\nthe past. By the way, do you have a rag? I stepped on something dirty outside. I’ll go to the toilet to wipe\nit.”"
      },
      {
        "paragraph": "“Yeah, ” Wesley remembered that Regina was hiding inside and immediately followed her in."
      },
      {
        "paragraph": "Catherine did not expect Wesley to follow her so closely. She finished wiping her shoes and said, “My\nstomach hurts a little so I might take a while. You can go back to work first."
      },
      {
        "paragraph": "After closing the door, she pressed herself against the door for a minute but did not hear the sound of\nWesley leaving. Instead, she heard the faint sound of the locker door opening, followed by the sound of a"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "pair of high heels. It was so soft that she would not have heard it if she had not been listening while\nleaning against the door."
      },
      {
        "paragraph": "She suddenly remembered that the door had been locked when she entered earlier. The office smelled\nlike Regina’s perfume too."
      },
      {
        "paragraph": "Could it be that there was something going on with Wesley and Regina? When she just so happened to\ncome by, Wesley told Regina to hide in the locker?"
      },
      {
        "paragraph": "Now that she was in the toilet, Wesley was asking Regina to quietly leave?"
      },
      {
        "paragraph": "At that thought, it felt as though her brain was struck by lightning."
      },
      {
        "paragraph": "It was not unusual for the boss to have an affair with his secretary, but Wesley was a gentleman. He\nalways boasted about his unwavering love for her and that he had never touched another woman."
      },
      {
        "paragraph": "‘It doesn’t matter if you can’t do it. People like Chester are indeed flirtatious, but you can’t have an affair\nwith your secretary and act like a gentleman with deep feelings at the same time.’"
      },
      {
        "paragraph": "The more Catherine thought about it, the more she felt that Wesley was too fake. He was completely\ndifferent from what she thought of him before."
      },
      {
        "paragraph": "Just as she was thinking about it, Wesley knocked on the door. “Cathy, I’m going out for a while. Come\nfind me after you’re done.”"
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "Catherine pretended to be constipated. “I might take a while.”"
      },
      {
        "paragraph": "After seven to eight minutes, she gently opened the door and went out."
      },
      {
        "paragraph": "She originally wanted to put the mini surveillance camera in his office, but in order to confirm her guess,\nshe stuffed it directly into the socket."
      },
      {
        "paragraph": "Logan had taught her how to do it. It was easily hidden."
      },
      {
        "paragraph": "After coming out, she chatted with Wesley for a while. When someone came in to ask for his signature,\nshe pretended to look at his bookcase and stuffed another camera there."
      },
      {
        "paragraph": "Half an hour later, she left Golden Corporation and sighed in relief. It was so nerve -wracking being a\nspy."
      },
      {
        "paragraph": "She assigned Logan to keep an eye on Eugene. “ Watch him closely every day. I think he’s having an\naffair with Regina.”"
      }
    ]
  },
  {
    "title": "Chapter 1206 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Logan was stunned. “No way.”"
      },
      {
        "paragraph": "“It’s a woman’s intuition, ” Catherine said faintly, “ I didn’t properly hide the one in the bookcase. It’ll\nprobably be noticed before long. I hope we find something as soon as possible.”"
      },
      {
        "paragraph": "Logan nodded."
      },
      {
        "paragraph": "Catherine thought that it would take a while to get a clue, but unexpectedly, Logan sent her something\namazing that afternoon."
      },
      {
        "paragraph": "He directly brought his computer over to Catherine and played a video for her to see."
      },
      {
        "paragraph": "Wesley and Regina were entangled on the sofa she had just sat on in the morning,"
      },
      {
        "paragraph": "They were being so fierce and crazy that she almost vomited."
      },
      {
        "paragraph": "Was Eugene still the warm and elegant gentleman in her mind? Was this the man who had been in love\nwith her for three years? At that moment, Wesley’s twisted face made her sick."
      },
      {
        "paragraph": "“There are even more exciting ones.”"
      },
      {
        "paragraph": "Logan changed the video. It was from the camera she had put in the bedroom."
      },
      {
        "paragraph": "Wesley was holding a whip in his hand while Regina was lying willingly on the bed. The two of them were\nno different from animals."
      },
      {
        "paragraph": "Catherine was dumbfounded and afraid that she would really vomit."
      },
      {
        "paragraph": "She quickly turned off the computer as her face paled."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Logan looked at her with a complicated expression. “I think your guess was correct. When you asked me\nto follow Wesley before, what I saw was how modest and gentlemanly he was. He never approached\nwomen and was kind and charitable. He was just pretending. He probably already knew I was following\nhim.”"
      },
      {
        "paragraph": "Catherine expected that. Wesley had noticed that Logan was following him, but he did not say a word to\nher. Although Wesley and she were husband and wife, they were more unfamiliar than strangers. “ Say…\nThe day Ethan came to find me, do you think he discovered something going on between Ethan and\nRegina? Wesley didn’t want him to say anything, so…”"
      },
      {
        "paragraph": "Logan shuddered. “He wouldn’t go that far, right? Would he kill his own nephew because of that?”"
      },
      {
        "paragraph": "Catherine sighed softly. She did not know either. However, if that was the case, then Wesley was utterly\nheartless. “Maybe he knew something else. I’m increasingly suspicious that Ethan’s death was not an\naccident.”"
      },
      {
        "paragraph": "“Since you said so, I think you should quickly leave Wesley. You’d better move out of the villa.”"
      },
      {
        "paragraph": "Logan said worriedly, “ I think… Wesley is a little abnormal. He hides his true colors so well it’s like he\nhas two personalities. You’ve known him for so many years but you didn’t realize it at all. He even hit you\nlast time. Who knows when his patience will disappear?”"
      },
      {
        "paragraph": "Catherine pursed her lips with apprehension. “If I leave now, how will I find out how Ethan died?"
      },
      {
        "paragraph": "Besides, he won’t divorce me easily. Shaun is right. He’ll torture me slowly. He hasn’t revealed his true\nnature yet because I haven’t fallen in love with him and submitted to him. If I get pregnant with his child,\nhe’ll slowly reveal his true colors. That’ll be when his revenge begins.”"
      },
      {
        "paragraph": "“You can threaten him to divorce you with these two videos, ” Logan said. “Reputation is very important\nfor a hypocrite like Wesley. He definitely won’t want these videos to be spread.”"
      },
      {
        "paragraph": "Catherine sighed softly."
      },
      {
        "paragraph": "Back then, Wesley had blocked a knife for her without regard for his life and lost a kidney."
      },
      {
        "paragraph": "She did not expect that one day, they would come to this point."
      },
      {
        "paragraph": "“Living with Wesley now is like living in the lion’s den. When you go to sleep at night, remember to lock\nthe door and report your safety to me on time every day. I’m afraid something will happen to you.”"
      },
      {
        "paragraph": "Logan stood up and said, “Also, don’ t let the two children come into contact with him. I also suspect that\nWesley doesn’t only have this woman. We can tell from the video that he’s extremely hardcore and\nexperienced. It’s impossible that Regina is the only one he’s sleeping with.”"
      }
    ]
  },
  {
    "title": "Chapter 1207 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Not long after Logan left…"
      },
      {
        "paragraph": "Wesley called. “Cathy, I got off work early today. Let’s pick Lucas and Suzie up together. I haven’ t spent\ntime with the kids for a long time. Let’s bring them to the playground after dinner later.”"
      },
      {
        "paragraph": "Catherine felt creeped out."
      },
      {
        "paragraph": "He had just finished fooling around with Regina yet came down to fawn over her next. This person was\ntoo hypocritical. “We can’t today. Shaun is bringing the kids back to the Hill family.”"
      },
      {
        "paragraph": "“Cathy, do you want your children to go back to the Hill family?” Wesley was a little disappointed. “ What\nright does he have? Shaun has never done anything for them.”"
      },
      {
        "paragraph": "“They want to go, so I can’t stop them. ” Catherine sighed deliberately."
      },
      {
        "paragraph": "“Then why don’t we go watch a movie?” Wesley said enthusiastically again. Since Catherine had taken\nthe initiative to bring him bubble tea today, he thought that she wanted to work on this marriage with him."
      },
      {
        "paragraph": "“Sure.”"
      },
      {
        "paragraph": "Catherine agreed."
      },
      {
        "paragraph": "Nothing ventured, nothing gained."
      },
      {
        "paragraph": "On the other side, Wesley hung up the phone and smiled sinisterly. A moment later, he called someone\nelse. “Shaun is picking up the two children from kindergarten today. Teach him a lesson on the road.”"
      },
      {
        "paragraph": "The elevator incident failed to kill Shaun the last time because he had good fortune."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "In that case, he would let Shaun lose what was most precious to him. If one wanted to kill him, one first\nhad to kill his heart. He would not dare to provoke Catherine in the future anymore."
      },
      {
        "paragraph": "That was the price Shaun had to pay."
      },
      {
        "paragraph": "As for the two children, he had tried to please them for so many years but he could never compare to\ntheir biological father, Shaun. In that case, they could not blame him for being ungracious."
      },
      {
        "paragraph": "5:00 p.m."
      },
      {
        "paragraph": "Shaun took the two children back to the Hill family."
      },
      {
        "paragraph": "Along the way, Suzie saw the cake shop outside and clamored for dessert."
      },
      {
        "paragraph": "“Scummy dad, scummy dad, I wanna eat strawberry cake. The cakes from that shop are delicious."
      },
      {
        "paragraph": "Mommy bought one for me before.”"
      },
      {
        "paragraph": "“No, we can’t park the car here, ” Shaun said with a headache."
      },
      {
        "paragraph": "“I don’t care. I wanna eat it.” Suzie pursed her lips and began to cry."
      },
      {
        "paragraph": "Shaun had no choice but to make an emergency stop by the roadside."
      },
      {
        "paragraph": "When he got out of the car, he said, “We can’t stop here for long. It’s too much trouble to bring you down,\nso wait in the car. I’ll be right back. Lucas, watch over Suzie.”"
      },
      {
        "paragraph": "“Okay.” Lucas nodded."
      },
      {
        "paragraph": "After Shaun went down and reached the cake shop, his phone suddenly rang. There was a message\nfrom the number Chance and him used to communicate during emergencies: [The children are in\ndanger.]"
      },
      {
        "paragraph": "A deep sense of trepidation immediately enveloped Shaun."
      },
      {
        "paragraph": "He hurriedly rushed back and opened the car door. “Scummy dad, where’s the cake…”"
      },
      {
        "paragraph": "Suzie was still asking questions when Shaun noticed a black car speeding toward them. Not only did the\ncar not slow down, but it also increased its speed."
      },
      {
        "paragraph": "He quickly dragged the two children out, frightening them. Before they could react, his car was severely\nhit by a force."
      },
      {
        "paragraph": "Even if his car was of very good quality, it spun in several circles after getting hit. It collided with the\nguardrail in the middle. The car was completely totaled."
      },
      {
        "paragraph": "The children were terrified, and Suzie was so scared she started to bawl. Even though Lucas seemed\ncalm, his little face had turned white."
      },
      {
        "paragraph": "He knew that if Shaun had not dragged them out earlier, Suzie and he would have been crushed just like\nthe rear of the car."
      },
      {
        "paragraph": "Shaun quickly hid the children in his arms and went to the cake shop."
      },
      {
        "paragraph": "When the perpetrator saw that the situation had not worked out as planned, he immediately abandoned\nthe car and fled."
      }
    ]
  },
  {
    "title": "Chapter 1208 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun did not go after the driver because he wanted to protect the kids. Moreover, since the incident\ntook place in public with surveillance cameras around, the police should be able to capture the hit- and-\nrun driver soon."
      },
      {
        "paragraph": "Shortly after someone called the police, the police hurried over and took Shaun’s statement."
      },
      {
        "paragraph": "Meanwhile, Suzie was weeping over the phone with Catherine."
      },
      {
        "paragraph": "“Mommy. Mommy. Boo—hoo…”"
      },
      {
        "paragraph": "The minute Catherine heard Suzie cry, she was shocked. “Darling, what’s wrong?”"
      },
      {
        "paragraph": "“Mommy, something scary happened. Just now, a car sped toward Lucas and me, and we almost died.\nLuckily, our scummy dad pulled us out of the car.” Suzie could not stop sobbing."
      },
      {
        "paragraph": "Her words sent a chill down Catherine’s spine. “ Where are you guys? I’ll be there right away. Pass the\nphone to your dad.”"
      },
      {
        "paragraph": "“Scummy dad is speaking to the police now. We’re a t the place where you bought me the cake earlier.”\nAs Suzie was speaking, she began to bawl, which made Catherine overwrought."
      },
      {
        "paragraph": "“Don’t be scared, darling. I’ll be there in a moment.”"
      },
      {
        "paragraph": "Upon hanging up, Wesley tightened his grip on the steering wheel calmly. “Did something happen to the\nkids? Where are they? Let’s get there now.”"
      },
      {
        "paragraph": "“Mm.” Catherine’s mind was in a mess."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "After she told Wesley the address, he sped to the scene. Nevertheless, the road had been blocked due t\no an accident. Since Wesley’s car could not enter the area, Catherine unfastened her seat belt. “I’ll just\nwalk there on my own.”"
      },
      {
        "paragraph": "With that, she swiftly got out of the car and left before Wesley could reply."
      },
      {
        "paragraph": "Wesley punched the steering wheel. Soon, he dialed a number. “Dumb*ss, why did you fail again?”"
      },
      {
        "paragraph": "“Shaun carried the kids out of the car after he came out of the bakery. ” The person replied, “He might\nhave seen the car speeding toward him.”"
      },
      {
        "paragraph": "“Duh, dumb*ss, ” Wesley insulted. “Have you cleaned up the mess?”"
      },
      {
        "paragraph": "“Don’t worry. There won’t be any problem.”"
      },
      {
        "paragraph": "Even so, Wesley felt exasperated that he had wasted another chance and money. Shaun must have nine\nlives, or else how could he be so fortunate?"
      },
      {
        "paragraph": "After running for a while, Catherine caught sight of the appalling situation. The back of Shaun’s car\nseemed completely wrecked."
      },
      {
        "paragraph": "“Mommy. ” Suzie and Lucas dashed to Catherine the instant they saw her."
      },
      {
        "paragraph": "“Mommy, we nearly couldn’t see you again.” Lucas said with a low voice, “Thankfully… We have our\nscummy dad this time.”"
      },
      {
        "paragraph": "It was very rare of Lucas to compliment Shaun, but Catherine was immensely grateful to Shaun as well.\nIf Shaun had not reacted quickly enough, she might not be able to see the kids anymore."
      },
      {
        "paragraph": "“Cathy… ” Shaun walked to her, his deep -set eyes filled with guilt. “I’m sorry that the kids encountered\nsuch an awful situation…”"
      },
      {
        "paragraph": "“What actually happened?” At the sight of this accident, Catherine could not help but recall Ethan’s\ndeath."
      },
      {
        "paragraph": "Why was it an accident again?"
      },
      {
        "paragraph": "The people around her had been frequently involved in accidents in less than a month. This made her\nfeel a little more alert and terrified."
      },
      {
        "paragraph": "Was this man-made or coincidental?"
      },
      {
        "paragraph": "Were these accidents targeted at her or Shaun?"
      },
      {
        "paragraph": "Shaun’s thin lips twitched. He thought it would be inappropriate to say it with the kids around. “Let’s leave\nthis place and send the kids home first. Later, I’ll still need to go to the police station.”"
      },
      {
        "paragraph": "Catherine understood it, but she felt gloomier deep down."
      },
      {
        "paragraph": "As cars had been blocked from entering this area, Shaun carried Suzie and Lucas in each of his arms\nbefore he walked forward."
      },
      {
        "paragraph": "Watching his tall figure, Catherine zoned out for a few seconds before she hurriedly caught up with him."
      },
      {
        "paragraph": "She had even forgotten that Wesley was waiting for her."
      },
      {
        "paragraph": "Only until she hopped into Hadley’s car did she remember to send Wesley a WhatsApp message, asking\nhim to return home first."
      },
      {
        "paragraph": "Along the way, she kept comforting the two kids."
      },
      {
        "paragraph": "After dropping them at the Hill family’s house, she headed to the police station with Shaun."
      },
      {
        "paragraph": "“Sorry, Cathy. This was a case of attempted murder.” Shaun handed Catherine his phone, which\ndisplayed Chance’s reminder message. “I assigned Chance to the Campos family to spy on them. If it\nweren’t for his reminder, Suzie and Lucas…”"
      }
    ]
  },
  {
    "title": "Chapter 1209 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Upon reading the message, Catherine felt as if her head had exploded."
      },
      {
        "paragraph": "Her children were so young, yet they were already being targeted."
      },
      {
        "paragraph": "They were lucky today, but what about tomorrow?"
      },
      {
        "paragraph": "Catherine was so furious that she shifted her eyes to Shaun. “I was wrong. I shouldn’t have let the kids\nbe with you. Shaun, you truly are a plague and troublemaker. You’re forever my nemesis. Not only have\nyou hurt me, but you’re also planning to hurt the kids now. Why am I so unlucky to have met you?”"
      },
      {
        "paragraph": "Her words were like an awl that pierced through Shaun’s heart."
      },
      {
        "paragraph": "His heart clenched in pain. He said reluctantly, “ The Campos family is not the one who wants to hurt\nSuzie and Lucas.”"
      },
      {
        "paragraph": "Catherine scoffed. “You just said that Chance has been spying on the Campos family. If it wasn’t the\nCampos family’s doing, how would he have known the truth?”"
      },
      {
        "paragraph": "“Chance said that Mason has a mysterious follower who has been assisting him with a lot of shady\ndealings. That man has a bunch of murderers from Neah Bay under him…”"
      },
      {
        "paragraph": "The term ‘Neah Bay’ startled Catherine."
      },
      {
        "paragraph": "As far as she recalled, Logan once mentioned that Lucifer, who had an affair with Sarah, was killed by a\nmurderer from Neah Bay. At that point, Catherine suspected that there was an unknown force behind\nSarah. Logan even personally headed to Neah Bay to investigate the matter later on, but he could not\nfind out who the mastermind was."
      },
      {
        "paragraph": "“Cathy, even though Charlie dislikes me, the most he would do is to leave me high and dry.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun continued to explain seriously, “In fact, the Hill family has been the oppressed party in this Hill -\nCampos rivalry. The data regarding Hill Corporation’s microchip was stolen, the Campos family made\nWillie a fool, Mason abandoned my mom, and the Campos family even killed Liam…”"
      },
      {
        "paragraph": "“What? The Campos family killed Liam?” Catherine was hit by another piece of staggering news. “Isn’t\nhe Mason’s son?”"
      },
      {
        "paragraph": "“He’s not.” Shaun said while hiding his pain, “We only figured out recently that he’s actually my biological\nbrother. That night, my mom was so drunk that she mistook the man whom she slept with for Mason.\nMason, who knew it earlier, took advantage of my mom’s pregnancy to marry into the Hill family. Later, I\nfound out that it was Yael who betrayed Liona. The Campos family was the one that had Liam thrown\nover the cliff and into the sea.”"
      },
      {
        "paragraph": "Catherine froze."
      },
      {
        "paragraph": "Considering Liam had been missing for a long time yet his body had not been found meant that he could\nstill be alive. Hence, she never thought that Liam’s body would have been thrown into the sea. More\nsurprisingly, it was the doing of the man whom Liam had called Dad for over 20 years."
      },
      {
        "paragraph": "Were Mason and those people considered humans?"
      },
      {
        "paragraph": "At the thought that Liam was gone just like that, Catherine’s eyes began to hurt in spite of herself."
      },
      {
        "paragraph": "She had always treated Liam as her good friend."
      },
      {
        "paragraph": "It seemed like the people around her were slowly disappearing ever since she came back."
      },
      {
        "paragraph": "As for those who were still around, they filled her with dread."
      },
      {
        "paragraph": "Amid his pain, Shaun came back to his senses and said, “To the Campos family, I’m always under their\ncontrol. Now that they’re high up, they won’t be bothered about oppressing me all the time. I believe it’s"
      },
      {
        "paragraph": "unlikely for them to harm young kids like Suzie at this time. Actually, Chance received this piece of news\nbecause he heard a murderer from Neah Bay casually mentioning it. The Campos family doesn’t seem\nto know anything about it.”"
      },
      {
        "paragraph": "“Do you mean Mason’s mysterious follower was the sole mastermind behind this? And the Campos\nfamily didn’t give the order?” Catherine soon grasped his message."
      },
      {
        "paragraph": "Shaun nodded and stared at her with a complicated gaze. “I suspect that mysterious follower is…"
      },
      {
        "paragraph": "Wesley Lyons.”"
      },
      {
        "paragraph": "Catherine’s eyes trembled."
      },
      {
        "paragraph": "If this had happened earlier, she would think that Shaun was willfully accusing Wesley."
      },
      {
        "paragraph": "With Ethan’s passing, however, she was uncertain."
      }
    ]
  },



  {
    "title": "Chapter 1210 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Would someone be so cruel as to hurt the kids as well?"
      },
      {
        "paragraph": "What more, Wesley had watched Suzie and Lucas grow up."
      },
      {
        "paragraph": "“Do you have any support for this?” Catherine asked with much difficulty after a while."
      },
      {
        "paragraph": "“No.”"
      },
      {
        "paragraph": "Shaun shook his head candidly. “Considering that Chance has just entered the Campos family not long\nago, it’s good enough for him to obtain so much news. He can’t be too aggressive, or he’ll be suspected.\nI suspect Wesley because he has been invited to all kinds of Campos family events in recent years,\nincluding Charlie’s wedding. Wesley might be like any other guest, but don’t forget that he’s an outsider\nwith no influential background."
      },
      {
        "paragraph": "He’s who he is today most likely because he has been secretly working for the Campos family.”"
      },
      {
        "paragraph": "Catherine felt as if her head had exploded."
      },
      {
        "paragraph": "She had just watched the video of Wesley having an affair with Regina in the afternoon, and now, she\nwas suspecting him of colluding with the Campos family."
      },
      {
        "paragraph": "“Besides, Wesley has a hidden agenda.”"
      },
      {
        "paragraph": "Shaun continued, “When he knew that I was with you in the bathroom during Hannah’s birthday, he was\nso mad that he lost control and beat you up."
      },
      {
        "paragraph": "Clearly, he’s holding a grudge and wants to hurt Suzie and Lucas. By doing so, he wants me to\nexperience the agonizing pain. Secondly, if the kids are gone when they are under my care, you’ll hate\nme to the core and cut off all possibility of getting together with me again.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine’s pretty and supple lips could not help but quiver."
      },
      {
        "paragraph": "She recalled how Wesley whipped Regina ferociously like a psycho in the video."
      },
      {
        "paragraph": "Indeed, a psycho like Wesley would not easily let her go since she had wronged him with Shaun."
      },
      {
        "paragraph": "He was also very good at pretending. Who knew what was hidden behind his gentle front?"
      },
      {
        "paragraph": "Furthermore, he said he wanted to take the kids out for a meal this afternoon, but she told him that\nShaun was bringing them back to the Hill family."
      },
      {
        "paragraph": "Was that the moment he decided to do something about it?"
      },
      {
        "paragraph": "She even stupidly told him about the kids’ whereabouts."
      },
      {
        "paragraph": "“Cathy…”"
      },
      {
        "paragraph": "Shaun noticed that she had gone silent all of a sudden, and her pretty, exquisite face was pale. He could\nnot help but stretch out his hand to hold hers, only to realize that her hands were trembling and cold.\n“Cathy, I know you won’t trust me, but…”"
      },
      {
        "paragraph": "“Your suspicions might be right.” Catherine interrupted him abruptly."
      },
      {
        "paragraph": "Shaun was stunned. Instead of feeling happy, he was more worried. “Is it because you’ve found out\nabout something? Or has Wesley done something to you again?”"
      },
      {
        "paragraph": "“No.”"
      },
      {
        "paragraph": "A look of annoyance washed over Catherine’s face. She used to chew Shaun out for being blind, but it\nturned out that she was pretty much the same. “ Anyhow, he’s quite terrifying. I’m mainly worried about\nSuzie and Lucas…”"
      },
      {
        "paragraph": "“They shouldn’t attend preschool for now. Just keep them in the Hill family’s house, and I’ll get someone\nto look after them. As long as they don’t go out, they’ll be safe. ” Shaun gazed at Catherine, “ I’m just\nworried about you, Cathy. Stay away from Wesley. I’m afraid you’ll be in danger if you remain by his side.\nHe actually approached you with a hidden agenda.”"
      },
      {
        "paragraph": "“I know. He’s planning to take revenge on me because I slept with you on the island after I got married.”\nCatherine let out a low, bitter laugh."
      },
      {
        "paragraph": "“Not just that…”"
      },
      {
        "paragraph": "Shaun’s thin lips twitched. However, it was all based on Brennan’s assumption and no evidence, so he\ncould only say, “Anyway, listen to me and leave him. If he’s not willing to divorce you, I can be your\nlawyer and help you apply for divorce.”"
      }
    ]
  },
  {
    "title": "Chapter 1211 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“I can divorce him if I want, but… not now.” Catherine gazed out of the window as soon as she finished\nspeaking."
      },
      {
        "paragraph": "It would be fine with Shaun if she trusted Wesley, but what annoyed Shaun was that she refused to\ndivorce Wesley despite suspecting him. She did not seem to care about her life at all. “Catherine Jones,\nwhy won’t you listen to me?”"
      },
      {
        "paragraph": "“Why must I listen to you?” Catherine asked him nonchalantly. “All you have to do is look after the kids.\nYou don’t have to bother about my affairs.”"
      },
      {
        "paragraph": "“You’re the woman I love. Who’s going to care about you if I don’t?”"
      },
      {
        "paragraph": "Shaun instantly stopped the car at the roadside. Then, he moved her body closer to his and caressed\nher snowy-white face straight away. He made no pretense of hiding the domineering concern in his eyes.\n“You just don’t know how hypocritical and terrifying Wesley is. Are you assuming he won’t harm you just\nbecause he loves you? You’re wrong. Since he could bring himself to kill the kids, there’s nothing in the\nworld that he’s afraid of doing.”"
      },
      {
        "paragraph": "“Anyway… I can’t leave him at this point.” Catherine could not resist averting her eyes away from his\nhandsome face that was inches away from hers."
      },
      {
        "paragraph": "At the sight of her obstinate expression, Shaun was so furious that his heart ached. “Catherine, if you\ndon’t cherish your life and something happens to you, I’m going to marry a wicked woman. By then, don’t\nblame me if she abuses Suzie and Lucas.”"
      },
      {
        "paragraph": "“You…”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine could not help glowering at him indignantly. Despite knowing that he was provoking her on\npurpose, she was still terrified by his words."
      },
      {
        "paragraph": "“Cathy, you can choose not to be with me, but I hope you’ll be safe and sound.”"
      },
      {
        "paragraph": "Pressing his forehead against hers, Shaun said in a gentle tone as if he was begging her, “Forgive me\nfor forcing you this way. I don’t wish the kids to lose their mom, and I can’t afford to lose you too.”"
      },
      {
        "paragraph": "The man’s scent wafted past the tip of her nose."
      },
      {
        "paragraph": "With the windows shut tight, Catherine suddenly felt that the car was poorly ventilated. She could not\nresist extending her hands to push his shoulders away without looking at his long and black lashes."
      },
      {
        "paragraph": "“Cathy, are you listening to me?” Shaun tightened his grasp on her head without letting her go. “ I’m\nserious.”"
      },
      {
        "paragraph": "“Shaun…” His scent made Catherine’s face flush. “Do you need to talk to me at such a close distance?”"
      },
      {
        "paragraph": "“Yeah.”"
      },
      {
        "paragraph": "Shaun fixed his eyes on her lashes that fluttered like a feather. His throat moved before he lowered his\nhead and kissed her on the lips."
      },
      {
        "paragraph": "“Shaun, I’m currently not in the mood…”"
      },
      {
        "paragraph": "Catherine immediately pushed him away. The sight of the man’s burning eyes left her completely\nspeechless. “Suzie and Lucas almost died, yet you’re aroused.”"
      },
      {
        "paragraph": "“I’m not aroused. I just feel like kissing the woman I love.”"
      },
      {
        "paragraph": "Shaun laughed in a self-righteous manner. “You’re not in the mood for it now, but when you feel like\ndoing it, just let me know. I’m at your beck and call.”"
      },
      {
        "paragraph": "“Can you behave yourself? If you’re involved with me, Suzie and Lucas wouldn’t have encountered that\nkind of incident,” Catherine said in annoyance."
      },
      {
        "paragraph": "“You’re wrong. If I weren’t involved with you, you might’ve been leading a peaceful married life with\nWesley and gotten cheated on even more. ” Shaun added firmly, “Such a hypocritical man might not truly\nbe as in love with you as he said.”"
      },
      {
        "paragraph": "Catherine was at a loss for words. Shaun seemed to have a brilliant mind, but he was an idiot back then,\nwas he not?"
      },
      {
        "paragraph": "“Unlike me.” Shaun gave an evil smile all of a sudden. “When I love someone, I show my love. When I’m\nbad, I behave badly. I’ll never hide nor pretend.”"
      },
      {
        "paragraph": "“So, should I reward you?” Catherine snorted. “ After all, everyone in Australia knows that you’re a n utter\nsc*mbag.”"
      },
      {
        "paragraph": "“…Ahem. Let’s go to the police station.” Shaun clenched his fist and coughed embarrassedly. After that,\nhe started the car to divert her attention."
      },
      {
        "paragraph": "Catherine had a lot of things to think through, so she did not bother arguing with him."
      },
      {
        "paragraph": "During the journey, all she thought about was Lucifer’s death."
      }
    ]
  },
  {
    "title": "Chapter 1212 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Lucifer’s death earlier had to be related to Sarah. The thing was Lucifer was killed by a murderer from\nNeah Bay although the Campos family did not have a grudge against him. In this case, it was very likely\nthat Sarah had the backing of the Campos family or their mysterious follower."
      },
      {
        "paragraph": "At this point, Shaun suspected that the mysterious follower was Wesley."
      },
      {
        "paragraph": "If this was true, Wesley was probably in contact with Sarah."
      },
      {
        "paragraph": "All of a sudden, it struck Catherine that someone threw Logan and Sarah into a cave when Sarah was\nkidnapped the last time."
      },
      {
        "paragraph": "At that time, Catherine wondered how Logan’s presence was discovered. After all, he was her right-\nhand man, and he had always been very secretive."
      },
      {
        "paragraph": "Previously, she was under the impression that Logan was discovered because a reporter had captured\nhis back at the pub."
      },
      {
        "paragraph": "If her assumption was wrong, it would mean that Wesley was the one who willfully revealed Logan’s\nwhereabouts."
      },
      {
        "paragraph": "Later, when it came to filing a lawsuit against Shaun, the odds of winning were against her initially.\nHowever, it was Wesley who provided her with convincing evidence and saved Logan."
      },
      {
        "paragraph": "With that, she was very grateful to Wesley that she promised to marry him then."
      },
      {
        "paragraph": "When she reflected on it now, she felt it was very likely a scheme that Sarah and Wesley had hatched\ntogether."
      },
      {
        "paragraph": "“Cathy, we’re at the police station. What are you thinking? You didn’t even move a bit.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun moved closer to her to unfasten the seat belt for her. Seeing that she had zoned out, he quickly\nkissed her on the forehead."
      },
      {
        "paragraph": "Catherine looked at him in bewilderment, still intent on this dreadful assumption."
      },
      {
        "paragraph": "“Are you okay?”"
      },
      {
        "paragraph": "Shaun could not resist how she was staring fixedly a t him, which was indeed alluring. Hence, he\nlowered his head and kissed her lips despite knowing that this was not the right place to do it."
      },
      {
        "paragraph": "“Shaun… ” Catherine covered his mouth with her hand. “Let’s get out.”"
      },
      {
        "paragraph": "Shaun was at a loss for words as he thought that she was going to tell him off."
      },
      {
        "paragraph": "Only when she pushed the door open and walked out did Shaun follow her."
      },
      {
        "paragraph": "In the police station."
      },
      {
        "paragraph": "Catherine and Shaun saw the hit-and-run driver who had been arrested by the police. The driver’s last\nname was Zucker, and he was 6o years old."
      },
      {
        "paragraph": "As soon as Driver Zucker saw them, he dropped on his knees and apologized to them. “It wasn’t my\nintention to hit you. I accidentally pressed the accelerator, which I mistook for the brake. I can’t afford to\ncompensate you, so I don’t mind being in jail forever.”"
      },
      {
        "paragraph": "Although the driver appeared very apologetic, Catherine flew into a rage."
      },
      {
        "paragraph": "Shaun stared down at the driver. “Whether you took bribes or not, you know better than anyone else.”"
      },
      {
        "paragraph": "A dazed look washed over Driver Zucker’s face. “I don’t know what you’ re talking about. Who did I take\nbribes from?”"
      },
      {
        "paragraph": "“I suspect that you had the intention of killing me.” Shaun said nonchalantly, “Your son is just a hooligan,\nbut he suddenly went to the States last month, where he owns a house and car.”"
      },
      {
        "paragraph": "“It’s because he’s clever at making money, ” Driver Zucker disputed in a huff."
      },
      {
        "paragraph": "Officer Wise, who was in charge of the case, took the hit-and-run driver away before shifting his gaze to\nShaun. “President Hill, is everything you just said true?”"
      },
      {
        "paragraph": "“Sorry, Officer Wise. After the incident, I found a way to investigate the hit-and-run driver’s family through\nthe internet and felt it’s a little strange.” Shaun said helplessly, “As you know, I’ve offended many people\nwith my status back then. Having said that, I’m very pissed that he almost killed my children this time.”"
      }
    ]
  },
  {
    "title": "Chapter 1213 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Don’t worry. We’ll reinvestigate the incident from scratch.”"
      },
      {
        "paragraph": "Upon hearing Shaun’s words, Officer Wise nodded seriously. If the driver had the intention of killing the\nkids, he would not allow such a devil to exist."
      },
      {
        "paragraph": "Ever since Catherine walked out of the police station, there was a sullen look on her face. Afraid that she\nwould lose her temper, Shaun explained to her, “Sorry, Cathy. I can’t show the police the warning\nmessage Chance sent to me as it could raise the alarm. With the Campos family’s current"
      },
      {
        "paragraph": "wealth and power, we won’t be able to defeat them if we don’t have enough evidence. We can’t expose\nChance, or Liam’s death would be in vain.”"
      },
      {
        "paragraph": "“I understand. I’m not as stupid as you think.” Catherine could not help but say impatiently, “I don’t think\nthe police will find out anything even if they continue to investigate it.”"
      },
      {
        "paragraph": "Shaun raised his brows. “Not necessarily. Even if the police can’t hunt down the mastermind, it can\ntrigger conflict within the Campos family. Think about it. Wesley made the killer under the Campos family\nwork for him. If the police continue to investigate the incident, it’ll set the alarm bells ringing in Mason’s\nhead. Knowing that someone is secretly causing him trouble, do you think Mason can stay cool?”"
      },
      {
        "paragraph": "Catherine was startled. She then shot a look at him. “You’re not so dumb, after all.”"
      },
      {
        "paragraph": "Shaun’s handsome face darkened in spite of himself. He could tell that Catherine was mocking him for\nbeing deceived by Sarah back then, so he did not mind her saying it. However, if it were someone else\nwho said it, he would have killed that person. “Cathy, I’m no longer the same as I was before…”"
      },
      {
        "paragraph": "“I heard Sarah got Stevens to represent her in the lawsuit. And the trial is tomorrow, right?” Catherine\nchanged the topic out of the blue."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Cathy, you’re quite concerned about my affairs, huh?” A flirtatious smile crossed Shaun’s face."
      },
      {
        "paragraph": "Catherine smiled discreetly and said, “Well, it’s because you didn’t give me a penny when we divorced.\nBut when you broke up with Sarah, you gave her 100 billion dollars.” Shaun was at a loss for words."
      },
      {
        "paragraph": "He finally knew how it felt to shoot himself in the foot."
      },
      {
        "paragraph": "“Cathy, it was my fault. Once I win the lawsuit, I’ll offer 1oo billion dollars and myself to you. If you still\ncan’t get over it, I’ll sink to my knees every day.” Shaun clenched his fists and coughed softly before he\nswore, “If you’re still angry, I can kneel for you now.”"
      },
      {
        "paragraph": "Now?"
      },
      {
        "paragraph": "Speechless, Catherine watched the people walking in and out of the police station. If he kneeled here, he\nwould definitely make headlines tomorrow."
      },
      {
        "paragraph": "“Shaun, what happened to your high and mighty image back then?”"
      },
      {
        "paragraph": "“Because of you, I’ve shed it.” Shaun stared at her intently. “I don’t mind losing my dignity and honor for\nyour sake.”"
      },
      {
        "paragraph": "Catherine rubbed her brows. His interruption had made her forget what she was about to say."
      },
      {
        "paragraph": "She turned around and headed to the car. With that, Shaun immediately ran over and opened the\npassenger door for her."
      },
      {
        "paragraph": "“Cathy…”"
      },
      {
        "paragraph": "Wesley’s car suddenly stopped in front of them. Dressed in a black suit, Wesley got out of his car. His\neyes were gentle. “I knew you’d come to the police station. Have you settled it?”"
      },
      {
        "paragraph": "Shaun’s handsome face sank and made no pretense of giving him the cold shoulder. As he was about to\nspeak, he heard Catherine say apologetically, “Yes. I’m sorry. I forgot to contact you because I was\npreoccupied with Lucas and Suzie just now…”"
      },
      {
        "paragraph": "“It’s alright. I can understand it. What matters most is that the kids are fine. Since it has been settled, let’s\ngo home. ” As Wesley was speaking, he stretched out his hand to hold Catherine’s hand."
      },
      {
        "paragraph": "Shaun clutched Wesley’s wrist and glared at him. “ She’s not going back. The kids got a fright, so I’ll take\nher to my place.”"
      },
      {
        "paragraph": "Wesley looked coldly into Shaun’s eyes as well. “ Excuse me. She’s my wife. She should go home with\nme. My house is where she calls home.”"
      },
      {
        "paragraph": "“Shaun, let go of Wesley. He’s right. His house is my home, and I should go back. Please help me calm\nthe kids,” Catherine interrupted the two men."
      },
      {
        "paragraph": "Shocked, Shaun gazed at her with a disappointed and complicated look in his eyes. Her pretty face was\ncalm and self-righteous."
      },
      {
        "paragraph": "What on earth was she trying to do? Was she aware of what she was saying?"
      },
      {
        "paragraph": "He had just told her that Wesley could be the perpetrator who intended to hurt the kids."
      },
      {
        "paragraph": "She somewhat believed it too, yet she ended up taking Wesley’s side."
      }
    ]
  },
  {
    "title": "Chapter 1214 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun could not figure out what was on Catherine’s mind."
      },
      {
        "paragraph": "“Let’s go.” Catherine ignored Shaun’s sad gaze and got into Wesley’s car while holding his hand."
      },
      {
        "paragraph": "Wesley’s thin lips curled upward. He kindly opened the door and fastened the seat belt for her."
      },
      {
        "paragraph": "They looked like a sweet married couple."
      },
      {
        "paragraph": "Shaun was so infuriated that he punched the top of his car."
      },
      {
        "paragraph": "Soon, Wesley’s car drove off."
      },
      {
        "paragraph": "Wesley held Catherine’s hand tightly in the car. “ Cathy, I’m quite glad. I thought you’d choose to\naccompany Lucas and Suzie tonight.”"
      },
      {
        "paragraph": "“Actually, I did feel like doing it. But as the kids’ father, Shaun should take responsibility for them. ”"
      },
      {
        "paragraph": "“That’s true.” A glint flashed across Wesley’s eyes. “By the way, what happened in the accident today?”"
      },
      {
        "paragraph": "“The hit-and-run driver said that he mistook the accelerator for the brake. ” At the mention of this issue,\nCatherine looked furious. “But Shaun said it’s not as simple as it seems. He found out that the driver’s\nson somehow went to the States and even bought a house and a car. I suspect someone put the driver\nup to it.”"
      },
      {
        "paragraph": "Wesley’s fingers twitched as he held onto the steering wheel. He did not expect Shaun to find out about it\nso soon. “Shaun has offended too many people back then. You shouldn’t have allowed the kids to\nacknowledge him. I think you’d better let the kids stay with me. It’s not safe to keep them with Shaun.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“I thought so too, but he won’t agree. As you know, he’s a lawyer. It’s not possible to win a case against\nhim, ” Catherine replied, pretending to be torn."
      },
      {
        "paragraph": "“It’s fine. As long as you agree, I’ll assist you.” Wesley tapped the back of her hand."
      },
      {
        "paragraph": "“Um, let me sleep on it.” Catherine nodded fakely."
      },
      {
        "paragraph": "Shaun returned to the Hill residence glumly."
      },
      {
        "paragraph": "Suzie and Lucas immediately ran out, only to find Shaun returning alone. They immediately became\ndisappointed. “Where’s Mommy? Isn’t she going to accompany us?”"
      },
      {
        "paragraph": "“Wesley has already sent your mommy home.” Shaun suppressed his bitter feelings and picked the kids\nup. “I’ll accompany the two of you, okay?”"
      },
      {
        "paragraph": "“No. I want Mommy. If Mommy doesn’t accompany me, I’m going to get angry.” Suzie stomped her feet\nand ran upstairs amid her sobs."
      },
      {
        "paragraph": "Lucas furrowed his brows wilfully. Although he did not utter a word, he was unhappy."
      },
      {
        "paragraph": "Considering that the kids were shaken up, it was normal for them to ask for their mother’s company."
      },
      {
        "paragraph": "Lea and Old Madam Hill sighed. The two of them had no choice but to try their best to please these little\nones."
      },
      {
        "paragraph": "While they reassured the little ones, Shaun had no one to reassure him."
      },
      {
        "paragraph": "He was so perturbed that he kept sending Catherine messages. [Without you, Suzie has been crying\nnon- stop, and Lucas is unhappy.]"
      },
      {
        "paragraph": "[I’m unhappy too.]"
      },
      {
        "paragraph": "[All of us miss you so badly.] [All of us need you so badly.]"
      },
      {
        "paragraph": "[Are you ignoring me? If you ignore me, I’m going to keep texting you until you reply.]"
      },
      {
        "paragraph": "[Reply to my messages. Are you ignoring me? Don’t ignore me.]"
      },
      {
        "paragraph": "By the time Catherine had finished dealing with Wesley and returned to her room, Shaun had already\nsent her more than 3o messages. She was at a loss for words. Then, she responded, [Enough."
      },
      {
        "paragraph": "Stop texting me. That’s very childish of you. I’ll accompany the kids tomorrow.]"
      }
    ]
  },
  {
    "title": "Chapter 1215 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun responded, [You told me you want to divorce Wesley. Did you turn a deaf ear to all I said?]"
      },
      {
        "paragraph": "[Cathy, I’m sure you care about the kids. Are you planning to stay by Wesley’s side for other reasons? Or\nare you trying to collect evidence of him hurting the kids?]"
      },
      {
        "paragraph": "[Listen to me and come back. If Wesley notices, you’ll be in danger.]"
      },
      {
        "paragraph": "Catherine was undeniably impressed by how sharp Shaun was sometimes. However, she was not\nstaying merely to obtain evidence showing Wesley’s intention of killing the two kids. What"
      },
      {
        "paragraph": "mattered more to her was Ethan’s death. If that was Wesley’s doing, she must send Wesley to jail of her\nown accord."
      },
      {
        "paragraph": "This was her promise to Tracy."
      },
      {
        "paragraph": "She turned off her phone straight away without replying to Shaun’s messages."
      },
      {
        "paragraph": "When Catherine arrived at the office the next day,"
      },
      {
        "paragraph": "she called Logan over. “There are surveillance cameras around Wesley’s villa. Do you have any means\nof disrupting the surveillance cameras for the time being without alerting Wesley? I want to check his\nbedroom, study, and laptop.”"
      },
      {
        "paragraph": "“Yes. With a blackout.” Logan said, “But if the blackout takes place inside the villa, he’ll suspect it. The\nonly means is disrupting the whole circuit.”"
      },
      {
        "paragraph": "“Alright. ” Catherine nodded. “I’ll ask Wesley about his schedule before we plan our move tomorrow.\nWe’ll do it within the next two days. I don’t want to drag it on any longer.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Suzie and Lucas’s incident made her realize that she could not stay with Wesley and continue acting.\nShe felt that Wesley’s gaze on her had been getting more intense over the last two days."
      },
      {
        "paragraph": "In the court."
      },
      {
        "paragraph": "Today was the first time that the case between Shaun and Sarah came to court."
      },
      {
        "paragraph": "They had been a couple for over ten years, but now, they were against each other in court because of\n1oo billion dollars."
      },
      {
        "paragraph": "Given that the public was very concerned about this case, a group of reporters had already crowded the\ncourt entrance early in the morning."
      },
      {
        "paragraph": "At 11:00 a.m., Rodney accompanied Sarah upstairs. Following behind them was the top internationally\nrenowned lawyer, Stevens."
      },
      {
        "paragraph": "Shaun was dressed in a black suit with a dark green tie neatly tied in front of his chest. His handsome,\nexquisite face was extremely cold and sharp like a sword."
      },
      {
        "paragraph": "To Shaun, the court was like a battleground."
      },
      {
        "paragraph": "Sarah could not help but sigh at the sight of him. She had to admit that Shaun was the most perfect man\nin terms of his charms, looks, and presence. Unfortunately… she had never really won this man’s love."
      },
      {
        "paragraph": "Nevertheless, she could not be bothered about Shaun with his status now. After all, she had a better\noption."
      },
      {
        "paragraph": "“Shaunic, I never thought we would come to this point.”"
      },
      {
        "paragraph": "A bitter, faint smile crossed Sarah’s face. “Why do we have to do this? You used to be the most perfect\nperson in my heart. Why do we have to go against each other in court? It’s not my intention to do this.”"
      }
    ]
  },
  {
    "title": "Chapter 1216 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "A complicated look washed over Rodney’s face. Shaun used to be his best buddy, but Rodney had to\ntake Sarah’s side at this point. “Shaun…”"
      },
      {
        "paragraph": "“Unfortunately, you’re the most disgusting person to me now.” Shaun ignored Rodney and answered\nSarah."
      },
      {
        "paragraph": "“Dude, it’s disappointing to hear you say such a thing.” Rodney said furiously, “Even if you guys can’t be\na couple, you don’t have to treat her as an enemy.”"
      },
      {
        "paragraph": "“Rodney, you dumped your child and family for the sake of this woman. Are you happy with your life?”\nShaun asked indifferently."
      },
      {
        "paragraph": "His words made Rodney choke. During these days, he could sense the Snow family’s unwillingness to\nkeep any ties with him. Sometimes, he did regret it. However, now that he had reached this point, he had\nno alternative but to take responsibility for Sarah since he pursued her. “I don’t regret it.”"
      },
      {
        "paragraph": "“Thanks, Rodney. ” Sarah was so touched that her eyes reddened."
      },
      {
        "paragraph": "The scene filled Shaun with utter disgust. He hated himself for having loved this kind of woman."
      },
      {
        "paragraph": "“Attorney Hill, I’ve heard so much about you. Although you’re quite famous in Australia, you might not be\nable to defeat me.” Stevens suddenly grinned. “If I were you, I’d think about settling it out of court.”"
      },
      {
        "paragraph": "Shaun darted a stony glance at him. “Defeating me is a pie in the sky. Unless you can hold on until the\nnext trial, I don’t think you’re capable.”"
      },
      {
        "paragraph": "With that, he shoved his hands into the pockets of his pants and walked directly into the court."
      },
      {
        "paragraph": "Seeing his arrogant look, Stevens flew into a fury. “ Shaun, I’ll make you suffer a disastrous defeat.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shortly after, the trial began."
      },
      {
        "paragraph": "Shaun was the plaintiff as well as his own attorney, which was a rare occurrence."
      },
      {
        "paragraph": "After the judge made an opening statement of the case, Stevens stood up and said, “I don’t think the\ndefendant needs to return the money to the plaintiff. The defendant has known Shaun Hill since she was\neight. When she was 18, she got into a relationship with him. As everyone knows, Shaun used to suffer\nfrom mental illness, but the defendant had never looked down on him. She even studied psychology for\nthe sake of him. She was the one who cured Shaun’s illness, yet Mr. Hill has never paid her any medical\nfees.”"
      },
      {
        "paragraph": "“On top of that, Mr. Hill proposed to Sarah Neeson ten years ago, but he has yet to fulfill his promises. I\nseriously doubt if Shaun is playing with Sarah’s feelings and wasting her youth.”"
      },
      {
        "paragraph": "“Secondly, when Mr. Hill gave 100 billion dollars to Sarah previously, it is written in black and white that\nthe money was offered to her. According to the laws in Australia, once you transfer your money to\nsomeone else, you can’t ask for it back. Well, everyone might think that it’s a huge amount, but why was\nShaun willing to give it to Sarah? It shows that he, too, felt that he owed Sarah then.”"
      },
      {
        "paragraph": "After Stevens finished speaking, the jury looked at Shaun contemptuously. Furthermore, the judge\ntonight was a female, and she hated sc*mmy men the most."
      },
      {
        "paragraph": "Shaun rose to his feet. “Laws are rigid, but humans are flexible. When I got into a relationship with the\ndefendant at a young age, I thought she was a kind girl. Since we got together, Sarah has received gifts\nworth 6.230 billion dollars from me. Here are the receipts from when I was 18 until several months ago\nwhen we broke up. This is not including the 1oo billion dollars I gave her.”"
      },
      {
        "paragraph": "Sarah’s expression changed."
      },
      {
        "paragraph": "She probably did not expect Shaun to print out all the receipts from more than ten years ago."
      },
      {
        "paragraph": "Stevens mocked, “Attorney Hill, what a penny pincher you are. I’m afraid you’re the only man in this\nworld who would be so calculative.”"
      },
      {
        "paragraph": "Shaun laughed. “Hardly anyone in the world would spend as much on their girlfriends as me. On the\nother hand, Neeson Corporation is managed by Sarah’s brother, Thomas. In order to help Thomas out,\nI’ve secretly invested 8 billion dollars in the company in the last few years to support it. Besides, I’ve\ndisputed a few lawsuits for Thomas. The fees for my service is a few hundred million dollars per lawsuit,\nbut I have yet to receive the remuneration.”"
      },
      {
        "paragraph": "After pausing for a moment, Shaun shifted his eyes to the female judge. “Here are the receipts\ncontaining all the fund transactions. Also, when Miss Neeson was with me, she was engaged in an\nadulterous relationship with a drug addict. The police’s earlier investigative records regarding this\nincident are all here.”"
      }
    ]
  },



  {
    "title": "Chapter 1217 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“The police even took Miss Neeson away during our wedding. That was why I decided to cancel my\nwedding with Sarah. I didn’t mean to waste her youth. I was just deceived by her.”"
      },
      {
        "paragraph": "After looking at the documentary evidence that was presented, the female judge darted a profound\nglance at Sarah."
      },
      {
        "paragraph": "Sarah was slightly unsettled. Stevens rose to his feet and stared at Shaun, “Attorney Hill, earlier on the\ninternet, you said that you’re impotent. So does it mean that you’ve never touched Miss Neeson?”"
      },
      {
        "paragraph": "“Mm. I can prove it with my medical record.” Shaun nodded."
      },
      {
        "paragraph": "Stevens snorted. “Really? But I found out that you bought your ex-wife, Catherine Jones, contraceptive\npills when you were in a relationship with Sarah. This indicates that you aren’t impotent."
      },
      {
        "paragraph": "Your claim that you’ve never touched Miss Neeson is a lie.”"
      },
      {
        "paragraph": "The female judge frowned. “Defense attorney, do you have any evidence?”"
      },
      {
        "paragraph": "“Yes. Here are the records regarding his purchase of contraceptive pills, and behind are records showing\nhis frequent purchase of condoms. This means that he’s actually potent. ” Stevens said, “He’s lying. ”"
      },
      {
        "paragraph": "Shaun furrowed his brows."
      },
      {
        "paragraph": "Indeed, Stevens was smarter than those lawyers he had encountered before. Shaun had never expected\nhim to find these records."
      },
      {
        "paragraph": "He raised his head and said, “It’s true that I’ve never touched Sarah because whenever we were about\nto make out, my body naturally resisted it. ”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Stevens sneered. “You fooled around with Miss Neeson for over ten years, only to claim that her body is\ndisgusting. Shaun, you’re really good at making things up. Miss Neeson had an affair with Lucifer\nprecisely because you secretly dated Catherine all the time and slept with her after she returned. Sarah\nsimply did the same thing to take revenge on you.”"
      },
      {
        "paragraph": "“I hadn’t divorced Catherine at that time…”"
      },
      {
        "paragraph": "“That’s even more shameless of you. Sarah has been by your side these three years. You were the one\nwho claimed that you had divorced Catherine, but you lied and cheated on her. You cheated on her body\nand feelings, yet you still plan to get back the money. How brazen.”"
      },
      {
        "paragraph": "Stevens’ righteous and stern voice made many people cast a disdainful look at Shaun."
      },
      {
        "paragraph": "At last, the female judge struck the gavel to signal the end of the first trial. The second trial would be held\nnext week."
      },
      {
        "paragraph": "Everyone could tell from the trial that Shaun was at a disadvantage."
      },
      {
        "paragraph": "Sarah and Stevens were extremely smug as they walked out of the court."
      },
      {
        "paragraph": "“It turns out that the so-called best lawyer in Australia is mediocre. ” Stevens said to Sarah in a loud\nvoice, “If I had known this earlier, my apprentice could have dealt with this.”"
      },
      {
        "paragraph": "“It’sbecause you’re too brilliant, Attorney"
      },
      {
        "paragraph": "Stevens.”"
      },
      {
        "paragraph": "Sarah sighed at Shaun. “Shaunic, we still have one more week to go. You can look for me anytime. If you\nthink I’ve taken too much money, I can return a few hundred million dollars to you. I believe a few\nhundred million dollars will be sufficient for you to lead a comfortable life.”"
      },
      {
        "paragraph": "“Rodney, do you see this? This is the woman you love.” Shaun suddenly mocked him, “You should know\nthat I’ve never touched her.” With that, Shaun strode out."
      },
      {
        "paragraph": "Rodney was filled with mixed feelings as he watched Shaun’s silhouette."
      },
      {
        "paragraph": "Upon getting into the car, he could not help but ask Sarah, “Why did you and Stevens lie in court?"
      },
      {
        "paragraph": "Shaun has never touched you.”"
      },
      {
        "paragraph": "Sarah gave him an innocent look. “Attorney"
      },
      {
        "paragraph": "Stevens said that this is the only way we can win…”"
      },
      {
        "paragraph": "“So you’ll stop at nothing to win the case?” It dawned on Rodney that he could not see through Sarah."
      },
      {
        "paragraph": "“Rodney, from the moment I hired Stevens, this case doesn’t only involve me. It also concerns Stevens,\nthe top international lawyer’s reputation. He can’t afford to lose, ” Sarah replied in an aggrieved manner."
      },
      {
        "paragraph": "Rodney’s expression remained somber. “Fine. I can accept all you’ve just said. But the tone you used to\ntell Shaun that you can settle the issue out of court with a few hundred million dollars, don’t you think..\nit’s too much?”"
      },
      {
        "paragraph": "Indeed, if it were not for the trial just now, Rodney would not have known that Shaun had spent so much\non Sarah."
      }
    ]
  },
  {
    "title": "Chapter 1218 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "In the end, Sarah planned to brush Shaun off with a few hundred million dollars. Was she treating him\nlike a beggar?"
      },
      {
        "paragraph": "Rodney’s aggressive attitude caused Sarah to grow impatient. “Rodney, I hate Shaun. I can’t possibly\nreturn so much money to him and allow him to make a comeback. What’s more, I need to pay ten\npercent of the attorney’s fees. You know nothing.”"
      },
      {
        "paragraph": "Rodney looked utterly perplexed."
      },
      {
        "paragraph": "Although Sarah was beside her, he suddenly, for some reason, felt that he did not understand her well."
      },
      {
        "paragraph": "Perhaps he was overthinking it. Sarah could just be moody after being hurt by Shaun."
      },
      {
        "paragraph": "Nevertheless, he was inexplicably averse to the current Sarah."
      },
      {
        "paragraph": "“Just drop me at the mall in front. I want to buy something and spend some time alone.” Sarah cocked\nher head and gazed out the window."
      },
      {
        "paragraph": "Ever since she got together with Wesley, she was increasingly disgusted by Rodney."
      },
      {
        "paragraph": "Even so, she could not let go of Rodney, her supporter, yet."
      },
      {
        "paragraph": "Rodney pursed his lips dejectedly."
      },
      {
        "paragraph": "From her tone, he knew that Sarah did not need him to accompany her to the mall."
      },
      {
        "paragraph": "He dropped his gaze in annoyance, started the car, and dropped Sarah off at the entrance of the mall."
      },
      {
        "paragraph": "Sarah opened the door and left directly without turning back."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Looking at her silhouette, Rodney suddenly felt a chill run down his spine."
      },
      {
        "paragraph": "Having taken the day off to accompany her to the trial, he initially wanted to accompany her all day. Yet,\nshe left him alone just like that."
      },
      {
        "paragraph": "He sat alone in the car, not knowing where to go for the first time."
      },
      {
        "paragraph": "He used to have Shaun, Chester, many more fair- weather friends, and siblings from the Snow family.\nHowever, he realized that his circle of friends had gotten smaller ever since the Snow family disowned\nhim."
      },
      {
        "paragraph": "At this very moment, he caught sight of Wendy’s private car entering the car park."
      },
      {
        "paragraph": "His eyes lit up, and he quickly went after the car."
      },
      {
        "paragraph": "Soon, Wendy got out of the rear seat while Freya got out from the other side with her long and sexy legs\nwrapped in a pair of blue jeans. She was wearing an ink art shirt, and her long hair was tied i n a\nponytail."
      },
      {
        "paragraph": "At first glance, she looked like a stylish, pretty lady with graceful movements. It was hard to tell that she\nwas nearly two months pregnant."
      },
      {
        "paragraph": "Rodney zoned out for two seconds before he went after them. “Mom…”"
      },
      {
        "paragraph": "It had been a long while since he last met Wendy, who had not been answering his calls."
      },
      {
        "paragraph": "Wendy and Freya turned around, only to see Rodney striding toward them. His handsome face looked\nso pathetic that any woman would probably be swayed."
      },
      {
        "paragraph": "Nevertheless, Wendy and Freya were unlike any other women. Having long since been disappointed in\nhim, Wendy pulled a long face. “Don’t call me Mom. I’ve disowned you.”"
      },
      {
        "paragraph": "Rodney paused for an instant. Wendy continued as she dragged Freya, “Let’s go. Don’t bother about\nhim. There’s always someone who doesn’ t know his place, trying to play up to the Snow family."
      },
      {
        "paragraph": "When you come across this kind of person, you’d better keep a distance.”"
      },
      {
        "paragraph": "Rodney widened his eyes, speechless."
      },
      {
        "paragraph": "Her criticism made him feel like vomiting blood."
      }
    ]
  },
  {
    "title": "Chapter 1219 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Mom, are you planning not to acknowledge me for the rest of your life?” Rodney asked with a bitter\nsmile as he went after Wendy."
      },
      {
        "paragraph": "However, Wendy was not swayed. Instead, her expression turned grimmer. “Well, did you ever think\nabout my feelings when you chose Sarah and harmed my grandson? Rodney Snow, I’ve worked so hard\nto give birth to you and raise you. I don’t expect you to be filial to me, but you shouldn’t be so ungrateful.”"
      },
      {
        "paragraph": "“Mom, I didn’t…” Rodney was extremely aggrieved."
      },
      {
        "paragraph": "Freya did not want to chip in at first. However, she could not help it when she saw his pathetic look. She\nsaid indifferently, “Since you were bold enough to make this decision, you shouldn’t pester us anymore.\nHurry up and look for Sarah. She can comfort your miserable soul and give you what your parents can’t."
      },
      {
        "paragraph": "“Freya Lynch…”"
      },
      {
        "paragraph": "Her mockery made Rodney explode with rage. “This is the Snow family’s business. Stop being so\nconceited. If I hadn’t gotten you pregnant, you wouldn’t be where you are today.”"
      },
      {
        "paragraph": "“Shut up. ” Wendy stood up for Freya and chided him, “Even without Freya, I’d still disown you if you\ninsist on involving yourself with Sarah."
      },
      {
        "paragraph": "Although Freya isn’t my biological child, she’s much tougher than you. I don’t plan to acknowledge you\nas my son anymore. Stop calling me mom. I don’t know you.”"
      },
      {
        "paragraph": "As soon as she finished speaking, she dragged Freya away. “Let’s go, Freya.”"
      },
      {
        "paragraph": "Rodney’s heart ached at the sight of Wendy’s cold and resolute figure."
      },
      {
        "paragraph": "Despite knowing that he had been abandoned, he could not resist going after them."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "He saw Wendy entering a maternity clothing store with Freya. Holding a mini baby’s outfit, Wendy\ngrinned from ear to ear. Rodney was overwhelmed with mixed feelings. Given that Wendy chose a pink\noutfit for his child, could it mean that the child would be a girl?"
      },
      {
        "paragraph": "He was going to have a daughter…?"
      },
      {
        "paragraph": "“Rodney Snow, please leave this place now. Don’t interrupt Madam Snow and Miss Lynch’s shopping.” A\nbodyguard walked to Rodney and called out his name grimly."
      },
      {
        "paragraph": "Rodney felt deeply humiliated. “Shane, how dare you treat me this way. Aren’t you afraid that I’ll return to\nthe Snow family…”"
      },
      {
        "paragraph": "“You can never return to the Snow family.” The bodyguard said coldly, “Old Master Snow said that he\nwould never allow you to come back. He meant what he said.”"
      },
      {
        "paragraph": "Rodney was momentarily stunned."
      },
      {
        "paragraph": "Indeed, his grandfather had always been a man of his word."
      },
      {
        "paragraph": "He never thought Old Master Snow would be so heartless."
      },
      {
        "paragraph": "Tears welled in his eyes as he turned around and left in an embarrassed and gloomy state."
      },
      {
        "paragraph": "Deep down, he felt terrible. Since Sarah was in the same mall, he gave her a call to see if she would\nconsole him. Nevertheless, she did not answer his call."
      },
      {
        "paragraph": "In the end, he headed to the hospital to look for Chester."
      },
      {
        "paragraph": "Chester was busy reading a medical record. Rodney was so upset that he pulled a long face like an\nabandoned husky. “Chester, even you’re ignoring me now, huh? Are you taking Shaun’s side? Sure\nenough, I’m the extra person among the three of us."
      },
      {
        "paragraph": "Chester’s brows knitted together. “Are you done? You’re a man, but why are you behaving like a\nwoman?”"
      },
      {
        "paragraph": "“I’m just telling the truth.” A resentful look washed over Rodney’s face. “I’ve been standing here talking to\nyou for ten minutes, and you haven’t even looked me in the eye.”"
      },
      {
        "paragraph": "“Because I can’t be bothered about you.” Chester lazily put down the medical record."
      },
      {
        "paragraph": "Rodney’s heart broke. “Chester, you’re too much. You’re the second person who said that to me today.”"
      },
      {
        "paragraph": "“Rodney, you really let me down. I didn’t attend the trial this morning, but I watched it online.”"
      },
      {
        "paragraph": "With a grave expression, Chester continued, “You should know that Sarah was lying. It is true that Shaun\nand Sarah did not do it, and you know this better than anyone else.”"
      },
      {
        "paragraph": "Rodney lowered his head, not knowing what to do. “ I’m pissed too. After the trial ended, I asked Sarah\nabout it. She said it was Attorney Stevens’ decision because he can’t afford to lose the case.”"
      }
    ]
  },
  {
    "title": "Chapter 1220 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Fine. Just believe whatever Sarah says. You trust nobody but her. Since you like her so much, why did\nyou bother looking for your mom? You’ll never break up with Sarah for the sake of your parents anyway.\nOr are you forcing your mom to accept Sarah?”"
      },
      {
        "paragraph": "Chester leaped to his feet and took out an ultrasound report from his file. Then, he handed it to Rodney."
      },
      {
        "paragraph": "“What’s this?” Rodney asked sulkily."
      },
      {
        "paragraph": "“Freya’s ultrasound report. I secretly asked  someone to get it for you, lest you don’t know what your\nchild looks like. I’m busy. I have to go on duty now.”"
      },
      {
        "paragraph": "As soon as Chester finished speaking, he put on a white coat and left straight away."
      },
      {
        "paragraph": "Rodney lowered his head, staring at the ultrasound report in his hand."
      },
      {
        "paragraph": "He was slightly puzzled."
      },
      {
        "paragraph": "Well, the thing was, he could not tell how the child looked from the report because it was exactly like a\ntiny bean at this point."
      },
      {
        "paragraph": "Having said that, was this little bean the one that Freya planned to abort?"
      },
      {
        "paragraph": "All of a sudden, he felt bad."
      },
      {
        "paragraph": "It was an indescribable feeling."
      },
      {
        "paragraph": "Only at that moment did it occur to him that he was going to become a father."
      },
      {
        "paragraph": "Later, he fixed his eyes on the ultrasound report in his hand without realizing that he had stared at it for\nmore than half an hour."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "In Wesley’s villa at night."
      },
      {
        "paragraph": "Wesley had a social function to attend tonight, and he had already informed Catherine by phone that he\nwould not return home for dinner."
      },
      {
        "paragraph": "After Catherine finished her dinner, the power in the entire villa went out."
      },
      {
        "paragraph": "She knew it was Logan who had disrupted the nearby cable."
      },
      {
        "paragraph": "Hence, she immediately headed upstairs and entered Wesley’s study, which was where he usually dealt\nwith his work. After rummaging around for some time, all she found were some insignificant documents\nregarding Golden Corporation."
      },
      {
        "paragraph": "Catherine then turned on his laptop. Having acquired some hacking skills, she managed to crack the\npassword of his laptop. When she found a video in a hidden file, she clicked it open."
      },
      {
        "paragraph": "To her astonishment, it was actually a recording of Wesley and her making out in a private room in\nMelbourne three years ago."
      },
      {
        "paragraph": "She vividly remembered that she was deceived by Rebecca, who had spiked her drink at that time. It\nwas Wesley who saved her later. However, she felt so uncomfortable that she could not help hugging\nWesley and making out with him."
      },
      {
        "paragraph": "However, she quickly came to her senses and pushed Wesley away. She then spent the night soaking\nherself in cold water."
      },
      {
        "paragraph": "Unfortunately, some scenes of her intimate behavior with Wesley had been spread on the internet. As a\nresult, she had a bitter row with Shaun, which put her relationship with Shaun at stake."
      },
      {
        "paragraph": "She had been under the impression that Rebecca was the one who recorded the scene in secret, but\nthat was not the case. It turned out that the video had always been in Wesley’s hands."
      },
      {
        "paragraph": "In this case, Wesley was the one who deliberately exposed the photos and triggered conflict between\nShaun and her."
      },
      {
        "paragraph": "It seems that Wesley had already begun framing her since they were in Melbourne."
      },
      {
        "paragraph": "This person had been hiding so well, and it was frightening."
      },
      {
        "paragraph": "How many lies had he told her?"
      },
      {
        "paragraph": "After turning off the video, she tried her best to calm down and searched for other things."
      },
      {
        "paragraph": "However, she could not find anything suspicious even after a long while. Just as she was about to give\nup, she stumbled across a photo of a female, and she casually clicked it open."
      }
    ]
  },
  {
    "title": "Chapter 1221 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "The photo was of a young and energetic lady who looked about 18 years old. She was smiling shyly at\nthe camera while carrying a bag."
      },
      {
        "paragraph": "The instant Catherine recognized the lady, she was shocked to the core."
      },
      {
        "paragraph": "This lady’s appearance…"
      },
      {
        "paragraph": "She was Sarah’s cousin, Shelley."
      },
      {
        "paragraph": "Previously, Rebecca had undergone plastic surgery to change her face to Shelley’s prior to showing up\nby Shaun’s side to look after him."
      },
      {
        "paragraph": "However, Catherine could sense that the Shelley in this photo was not the one Rebecca transformed\ninto. In this photo, Shelley’s eyes were pure and innocent."
      },
      {
        "paragraph": "In other words, the lady in this photo was the real Shelley."
      },
      {
        "paragraph": "However, why would Wesley have the real Shelley’s photo?"
      },
      {
        "paragraph": "He had even saved the photo three years ago, before Shaun hired Shelley as his carer."
      },
      {
        "paragraph": "Catherine recalled that Rebecca escaped from the fire, but the real Shelley, who was swapped with\nRebecca, died in the fire. Due to this incident, Charity was framed and sent to jail. When Charity fled\nlater, she jumped into the sea and most likely died."
      },
      {
        "paragraph": "Could it be that… Wesley was secretly involved in that matter too?"
      },
      {
        "paragraph": "After this scary thought flashed in Catherine’s mind, she felt a chill that made her shudder even though it\nwas not the winter season."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Just as she had begun to investigate Wesley, it hit her that he was much more terrifying than she\nimagined."
      },
      {
        "paragraph": "How many evil deeds had he done? Her phone rang out of the blue."
      },
      {
        "paragraph": "It was a call from Austin. “Wesley is coming back. As he’s driving very fast, he’ll arrive at the villa within\nten minutes.”"
      },
      {
        "paragraph": "Catherine swiftly cleared all her activities on the laptop and sneaked out of the study."
      },
      {
        "paragraph": "Her heart was still racing madly."
      },
      {
        "paragraph": "Even so, she could only try her best to pull herself together. She must not let Wesley detect anything\nunusual."
      },
      {
        "paragraph": "Seven minutes later, the sound of the car engine rang in the courtyard. Wesley promptly walked in, only\nto find Catherine playing with her phone on the couch. His darkened eyes trembled, and he then asked\nwith an astonished tone, “There’s a blackout in the house, huh?”"
      },
      {
        "paragraph": "“Yeah. The power just went out all of a sudden when I was having dinner.” Catherine looked annoyed.\n“I’ve called the management, but they have no idea what’s going on as well.”"
      },
      {
        "paragraph": "“You should’ve told me immediately.” Wesley extended his hand to stroke her hair."
      },
      {
        "paragraph": "Catherine nearly had goosebumps. “Didn’t you say you have a social function to attend? Why are you\nhome so early?”"
      },
      {
        "paragraph": "“The other party had something urgent, so we didn’t have dinner together. I thought I might as well come\nhome and eat with you. I didn’t expect… Let me call and ask.”"
      },
      {
        "paragraph": "Wesley sat down beside her and called the management."
      },
      {
        "paragraph": "After contacting the telco company, the management said that someone with a drone accidentally\ndestroyed the nearby cable. Repair works were underway, and it would take an hour or so before power\nwas back on."
      },
      {
        "paragraph": "“Since it’s going to take a while, let’s go out and watch a movie together. We didn’t get to watch it last\ntime,” Wesley said gently."
      },
      {
        "paragraph": "“No, I’m tired. I’ll just play with my phone at home.”"
      },
      {
        "paragraph": "Catherine did not feel like going out for a movie with him at all."
      },
      {
        "paragraph": "If it were not for the intention of discovering the truth, she would have divorced Wesley right away."
      },
      {
        "paragraph": "Back then, she often claimed that Shaun was blind. However, she was not any better than him."
      },
      {
        "paragraph": "What was worse, she had married Wesley, this devil. After an hour,  the power in the house  was back\non."
      },
      {
        "paragraph": "Just when Catherine was about to go upstairs for a shower, Wesley suddenly pulled her onto his knees\nand  wrapped  his hands  around  her affectionately."
      },
      {
        "paragraph": "“What’s the matter?” At the thought of Wesley and Regina’s disgusting behavior, she felt like throwing"
      },
      {
        "paragraph": "Nevertheless, all she could do was endure it to avoid exposing herself."
      }
    ]
  },



  {
    "title": "Chapter 1222 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Cathy, how much longer are you going to keep me waiting?” Wesley tilted his head to kiss her."
      },
      {
        "paragraph": "However, Catherine could not resist tilting her head to the other side in an attempt to dodge him."
      },
      {
        "paragraph": "Wesley’s handsome face darkened. At the sight of his expression, a sense of fear subconsciously\nwashed over Catherine, and she promptly slipped out of his embrace."
      },
      {
        "paragraph": "Nevertheless, Wesley was hugging her very tightly, reluctant to let go of her."
      },
      {
        "paragraph": "“Can’t I even give you a kiss now?” Wesley was infuriated."
      },
      {
        "paragraph": "He had put up with her these days, but ever since he hit her, he noticed that he had been losing control\nof the anger simmering within him."
      },
      {
        "paragraph": "This was because she would rather allow the impotent Shaun than him to touch her."
      },
      {
        "paragraph": "“Are you going to… hit me again?” Catherine instinctively covered her face."
      },
      {
        "paragraph": "It was her instinct, but she was really frightened as well."
      },
      {
        "paragraph": "Wesley’s body stiffened, and he instantly hugged her. “No. I won’t hit you anymore. I just love you too\nmuch. Cathy, I want you.”"
      },
      {
        "paragraph": "His need was so straightforward that even Catherine could sense it."
      },
      {
        "paragraph": "She was completely at a loss for words."
      },
      {
        "paragraph": "Logan had been keeping him under surveillance all the time. Wesley was still dissatisfied despite doing i\nt with Regina in the office every day."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Wesley was really a sc*mbag."
      },
      {
        "paragraph": "When he made such a remark, did he not feel like throwing up?"
      },
      {
        "paragraph": "“Wesley, give me a bit more time…” Catherine hedged while dragging her words."
      },
      {
        "paragraph": "“ I always give you time, but how much longer do you actually need?” An imploring look washed over"
      },
      {
        "paragraph": "Wesley’s face. “I’ll set a time. We’ll do it  this Sunday night. I don’t want to wait any longer.”"
      },
      {
        "paragraph": "Catherine widened her eyes, not knowing what to say."
      },
      {
        "paragraph": "“Go and take a shower.” Wesley freed her."
      },
      {
        "paragraph": "Only after Catherine went upstairs did Wesley turn around and head to his study. He looked around, and\nit seemed that no one had tampered with his things. However, when he switched on the laptop, it was\nonly left with 25 percent of battery. Before he left this morning, he was aware that his laptop still had 3o\npercent."
      },
      {
        "paragraph": "His expression changed all of a sudden."
      },
      {
        "paragraph": "A moment later, Wesley dialed a number. “Check whose drone destroyed the nearby cable…”"
      },
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "Catherine dragged herself into the office with a tired body."
      },
      {
        "paragraph": "Last night, her head was occupied with Wesley’s words and laptop, so she could not fall asleep."
      },
      {
        "paragraph": "Shortly after, Austin and Logan came. Upon noticing her pale look, Logan asked anxiously, “Did you\ndiscover something?”"
      },
      {
        "paragraph": "“Mm.” Catherine then told them her presumptions."
      },
      {
        "paragraph": "Although Logan and Austin did not know much about the incident three years ago, they looked somber\nafter hearing it."
      },
      {
        "paragraph": "“I think… You cannot stay by his side anymore.” Austin was first to say, “Wesley hides too well."
      },
      {
        "paragraph": "Although you found something suspicious in his laptop yesterday, you couldn’t find any evidence of his\ncrime. This shows that he’s a cautious person. Now, both of you are basically acting with each other. If\nhe finds out that you’re investigating him, he might stealthily launch a terrifying counterattack.”"
      },
      {
        "paragraph": "Logan nodded. “I agree with Austin. What’s more, Wesley has a murderer from Neah Bay by his side.\nWe don’t even know the murderer’s background, but he knows the two of us like the back of his hand. If\nwe go head -to -head with him, we surely won’t be able to defeat him.”"
      },
      {
        "paragraph": "Catherine knitted her brows discontentedly."
      },
      {
        "paragraph": "If this had happened earlier, she would have carried on with the investigation. However, what Wesley\nsaid last night made her realize that his patience with her had begun to wear off."
      }
    ]
  },
  {
    "title": "Chapter 1223 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South] Chapter 1227"
      },
      {
        "paragraph": "After leaving the hotel, Wesley got in the car and searched for an overseas number from his contacts."
      },
      {
        "paragraph": "Soon, a seductive voice of a woman came from the phone.  “It’s been three years, Wesley. You’ve finally\ncontacted me again.”"
      },
      {
        "paragraph": "“Rebecca, you should be grateful to me. If it wasn’t for me pleading for your sake back then, Mason\nmight not have kept you alive. After all, you’re a useless piece of chess to him.”"
      },
      {
        "paragraph": "After a moment of silence, Rebecca sneered. “ Everyone said Mason disguised himself well. But if you\nask me, you’re the one who’s the most well- disguised. You’ve started scheming three years ago."
      },
      {
        "paragraph": "Wesley, I’ve never seen a more ruthless person"
      },
      {
        "paragraph": "than you. I heard Ethan is dead. You’re the one who killed him, right?”"
      },
      {
        "paragraph": "“You may not be in the country, but you do know quite a lot.”"
      },
      {
        "paragraph": "Wesley’s eyes darkened. “Rebecca, don’t you want  to come back? Don’t you want to settle your old\nscores? Don’t forget who sold you to the mountains and was the reason you got raped. Although\nCatherine and Shaun are divorced, they’re still living well. Meanwhile, your parents are still struggling in\njail, and you can’t even return to the country.”"
      },
      {
        "paragraph": "“What do you want me to do this time?” Rebecca quickly caught on."
      },
      {
        "paragraph": "Wesley flashed a big smile and slowly said, “I’m giving you an opportunity. A chance to change your fate.\nYou’ll thank me…”"
      },
      {
        "paragraph": "In the evening."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South] Chapter 1227"
      },
      {
        "paragraph": "Catherine entered the villa with the evening sun shining down on her."
      },
      {
        "paragraph": "When she entered, she saw Wesley in an apron, popping his head out of the kitchen. “Just wait for a little\nwhile more. We can have our meal soon.”"
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "After Catherine changed her shoes, she sat on the sofa. She looked toward Wesley’s phone, which was\non the coffee table."
      },
      {
        "paragraph": "Her heart started to pound."
      },
      {
        "paragraph": "She really wanted to see if she could find information about Rebecca from his phone."
      },
      {
        "paragraph": "When she found out yesterday that Wesley could have been involved in Rebecca’s appearance after a\nmakeover as Shelley, she realized that he might be in contact with Rebecca."
      },
      {
        "paragraph": "Catherine hated Rebecca as much as she hated Sarah."
      },
      {
        "paragraph": "She desperately wanted to cut them both into thousands of pieces."
      },
      {
        "paragraph": "Catherine went upstairs and changed into her loungewear. By the time she came downstairs, Wesley\nhad already served all the dishes and even the rice."
      },
      {
        "paragraph": "After she sat down, she fiddled with her phone while eating. A moment later, she said to Wesley, “ Our\ncompany launched a mobile application, but I can’t open it on my phone. Let me try it on your phone to\nsee whether it’s my phone or the application’s problem.”"
      },
      {
        "paragraph": "“Okay.” Wesley handed her his phone after unlocking it while smiling."
      },
      {
        "paragraph": "Catherine was surprised. She did not think it would be so easy."
      },
      {
        "paragraph": "As she was pretending to download the application,"
      },
      {
        "paragraph": "she quickly tapped into his messages. Nevertheless, she could not find anything."
      },
      {
        "paragraph": "“Did you find it? ” Wesley suddenly stood up and walked toward her."
      },
      {
        "paragraph": "Catherine frantically went back to the application’s downloading page. She said sheepishly, “I can open it\non yours…”"
      },
      {
        "paragraph": "After she said that, however, she suddenly stiffened. Did Wesley say “Did you find it?” just now?"
      },
      {
        "paragraph": "She raised her head only to meet with Wesley’s jet- black eyes. They were like an abyss — bottomless."
      }
    ]
  },
  {
    "title": "Chapter 1224 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "After leaving the hotel, Wesley got in the car and searched for an overseas number from his contacts."
      },
      {
        "paragraph": "Soon, a seductive voice of a woman came from the phone.  “It’s been three years, Wesley. You’ve finally\ncontacted me again.”"
      },
      {
        "paragraph": "“Rebecca, you should be grateful to me. If it wasn’t for me pleading for your sake back then, Mason\nmight not have kept you alive. After all, you’re a useless piece of chess to him.”"
      },
      {
        "paragraph": "After a moment of silence, Rebecca sneered. “ Everyone said Mason disguised himself well. But if you\nask me, you’re the one who’s the most well- disguised. You’ve started scheming three years ago."
      },
      {
        "paragraph": "Wesley, I’ve never seen a more ruthless person"
      },
      {
        "paragraph": "than you. I heard Ethan is dead. You’re the one who killed him, right?”"
      },
      {
        "paragraph": "“You may not be in the country, but you do know quite a lot.”"
      },
      {
        "paragraph": "Wesley’s eyes darkened. “Rebecca, don’t you want  to come back? Don’t you want to settle your old\nscores? Don’t forget who sold you to the mountains and was the reason you got raped. Although\nCatherine and Shaun are divorced, they’re still living well. Meanwhile, your parents are still struggling in\njail, and you can’t even return to the country.”"
      },
      {
        "paragraph": "“What do you want me to do this time?” Rebecca quickly caught on."
      },
      {
        "paragraph": "Wesley flashed a big smile and slowly said, “I’m giving you an opportunity. A chance to change your fate.\nYou’ll thank me…”"
      },
      {
        "paragraph": "In the evening."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine entered the villa with the evening sun shining down on her."
      },
      {
        "paragraph": "When she entered, she saw Wesley in an apron, popping his head out of the kitchen. “Just wait for a little\nwhile more. We can have our meal soon.”"
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "After Catherine changed her shoes, she sat on the sofa. She looked toward Wesley’s phone, which was\non the coffee table."
      },
      {
        "paragraph": "Her heart started to pound."
      },
      {
        "paragraph": "She really wanted to see if she could find information about Rebecca from his phone."
      },
      {
        "paragraph": "When she found out yesterday that Wesley could have been involved in Rebecca’s appearance after a\nmakeover as Shelley, she realized that he might be in contact with Rebecca."
      },
      {
        "paragraph": "Catherine hated Rebecca as much as she hated Sarah."
      },
      {
        "paragraph": "She desperately wanted to cut them both into thousands of pieces."
      },
      {
        "paragraph": "Catherine went upstairs and changed into her loungewear. By the time she came downstairs, Wesley\nhad already served all the dishes and even the rice."
      },
      {
        "paragraph": "After she sat down, she fiddled with her phone while eating. A moment later, she said to Wesley, “ Our\ncompany launched a mobile application, but I can’t open it on my phone. Let me try it on your phone to\nsee whether it’s my phone or the application’s problem.”"
      },
      {
        "paragraph": "“Okay.” Wesley handed her his phone after unlocking it while smiling."
      },
      {
        "paragraph": "Catherine was surprised. She did not think it would be so easy."
      },
      {
        "paragraph": "As she was pretending to download the application,"
      },
      {
        "paragraph": "she quickly tapped into his messages. Nevertheless, she could not find anything."
      },
      {
        "paragraph": "“Did you find it? ” Wesley suddenly stood up and walked toward her."
      },
      {
        "paragraph": "Catherine frantically went back to the application’s downloading page. She said sheepishly, “I can open it\non yours…”"
      },
      {
        "paragraph": "After she said that, however, she suddenly stiffened. Did Wesley say “Did you find it?” just now?"
      },
      {
        "paragraph": "She raised her head only to meet with Wesley’s jet- black eyes. They were like an abyss — bottomless."
      }
    ]
  },
  {
    "title": "Chapter 1225 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "An inexplicable chill washed over her."
      },
      {
        "paragraph": "Catherine told herself that she was too sensitive. Wesley could not have noticed it so fast."
      },
      {
        "paragraph": "However, Wesley quickly took her phone away the next second and smashed it on the table. With a\nbang, the screen shattered. Catherine’s phone was completely broken."
      },
      {
        "paragraph": "“Wesley… ” Catherine stood up abruptly with her fierce eyes glaring at him. “What are you doing?”\n“Cathy, do you still want to keep up the act with me? Maybe I should be asking you, what exactly have\nyou noticed?” Wesley still had a warm smile on his face, but his words made Catherine shudder."
      },
      {
        "paragraph": "“I don’t know what you’re talking about. I just wanted to have a look at the application.” Catherine denied.\n“Wesley, what’s wrong with you?”"
      },
      {
        "paragraph": "No matter what, she could not fall out with Wesley today. She was situated in a lion’s den, and Logan\nand Austin were not there yet."
      },
      {
        "paragraph": "“You don’t know?” Wesley raised his eyebrows in astonishment."
      },
      {
        "paragraph": "“What should I know?” Catherine revealed a puzzled look. “You broke my phone, so you must\ncompensate me with another one.” Wesley stared at Catherine silently for some time before he suddenly\nlaughed. “Cathy, you sure are the woman I fell for. You have exceptional talent in acting, like me. We’re\nactually a good match, but unfortunately… Give me back my phone.”"
      },
      {
        "paragraph": "Of course, there was no way Catherine would return his phone to him."
      },
      {
        "paragraph": "Since they had already shed all pretenses, she had to take his phone away. Even if she could not take it\naway, she could still contact Logan in case anything happened."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“I can’t agree with your condition. You broke my phone. You can compensate for my phone with yours.”"
      },
      {
        "paragraph": "Catherine turned around, wanting to leave after she spoke."
      },
      {
        "paragraph": "Wesley gripped her shoulders, to which Catherine twisted away and attacked Wesley first."
      },
      {
        "paragraph": "Yet, to her surprise, Wesley easily avoided her attack."
      },
      {
        "paragraph": "Catherine widened her eyes. The last time she fought Wesley, there was some pushing and shoving. It\nwas clear that Wesley had no defensive skills at all."
      },
      {
        "paragraph": "However, his reflexes were now no slower than hers."
      },
      {
        "paragraph": "“Cathy, I haven’t raised a hand in so long.” Wesley started attacking her with a smile."
      },
      {
        "paragraph": "Catherine quickly started to fight with him. Wesley’s skills were no better than hers, but he was a man,\nand he was strong. It did not take long before he quickly kicked the phone in Catherine’s hand away."
      },
      {
        "paragraph": "“Wesley, what on earth are you trying to do?” Catherine’s pretty face was as cold as ice. She finally\nunderstood that Wesley had no intention of letting her go out that night."
      },
      {
        "paragraph": "Wesley’s arrogance was out of her expectations."
      },
      {
        "paragraph": "Everyone knew she was his wife and that they lived together. If something happened to her, he would be\nthe prime suspect."
      },
      {
        "paragraph": "Did he not care about that at all?"
      },
      {
        "paragraph": "“Cathy, you touched my phone before, right?” Wesley neared Catherine step by step. “The villa’s\nelectricity went out that night because you ordered"
      },
      {
        "paragraph": "Logan to do it. You already knew early on that this house is full of security cameras.”"
      },
      {
        "paragraph": "Catherine gritted her teeth. “I did it very carefully. How did you find out?”"
      },
      {
        "paragraph": "“The battery on my computer depleted slightly.” Wesley said in a relaxed manner, “I’m very curious.\nWhen did you start suspecting me?”"
      },
      {
        "paragraph": "Catherine let out a long sigh. Since they had utterly shed all pretenses, she no longer needed to hide. “\nWesley, you’re the most deceitful person I’ve ever met in my life. Since three years ago, you’ve been\ndoing everything possible to drive a wedge between Shaun and me.”"
      },
      {
        "paragraph": "“Cathy, that’s because I love you.”"
      },
      {
        "paragraph": "Wesley knew she might have seen that video. Hence, he made no attempt to conceal anything anymore.\n“ Besides, the last time I saved you was"
      },
      {
        "paragraph": "real. If it weren’t  for me, you would’ve been raped. If it weren’t for me, you would’ve been stabbed to\ndeath by someone. But you, b*tch, are blind. No matter how much I’ve done for you, you only have\nShaun in your eyes. Both you and Shaun have trampled on my pride time and again and again. I swore\nthat I would marry you and torment you.”"
      },
      {
        "paragraph": "Catherine used all her might to control the fury in her eyes."
      }
    ]
  },


  {
    "title": "Chapter 1226 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Although Catherine already knew that Wesley was evil, they both had never really revealed their true\ncolors. So now that she heard those words from him, Catherine finally understood how much Wesley\nresented her."
      },
      {
        "paragraph": "“You’re saying I should be grateful to you?” Catherine sneered."
      },
      {
        "paragraph": "“What else? Cathy, I even lost a kidney for you. ” Wesley sighed."
      },
      {
        "paragraph": "“Forget it. If I knew you were such an evil, disgusting man, I’d rather be killed.”"
      },
      {
        "paragraph": "Catherine said hatefully, “In these three years, you’ve treated me well on the surface, but you’ve set me\nup over and over again behind my back."
      },
      {
        "paragraph": "Three years ago, Rebecca did plastic surgery to look like Shelley to approach Shaun. That was your\ndoing, right? In that case, you must’ve something to do with Charity being accused and sent to jail as\nwell. This is not forgetting Ethan’s death. You’re so evil that you can’t even spare your biological nephew.\nYou’ll die a horrible death.”"
      },
      {
        "paragraph": "“You started suspecting me when Ethan died?” Wesley looked astonished. “I did that so discreetly. How\ndid you find out?”"
      },
      {
        "paragraph": "Catherine was horrified."
      },
      {
        "paragraph": "She simply said it on purpose, but she did not expect Wesley would really admit it."
      },
      {
        "paragraph": "Wesley really did kill Ethan."
      },
      {
        "paragraph": "Looking at Catherine’s shocked expression, Wesley grinned evilly. “I’m surprised. You know a lot more\nthan I thought. Luckily… Luckily, I made my move first.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“…Made your move?”"
      },
      {
        "paragraph": "Catherine’s expression changed as she immediately looked toward the food on the table. “What did you\nput inside them?”"
      },
      {
        "paragraph": "“What do you think?” Wesley smiled. “Cathy, I really like you. I’ve spent so much effort on you that if I\ncan’t have you, I will never be satisfied. Besides, aren’t you a sl*tty one too? I watched the video Shaun\nsent me. Don’t worry. I’ll surely satisfy you the way he did.”"
      },
      {
        "paragraph": "“Disgusting.”"
      },
      {
        "paragraph": "Catherine could not resist slapping him across the face."
      },
      {
        "paragraph": "Wesley did not avoid it. “Hit me. The harder you hit, the more I’ll pleasure you later.”"
      },
      {
        "paragraph": "“You won’t have your way.”"
      },
      {
        "paragraph": "Catherine rushed toward the door after she spoke. Nevertheless, Wesley quickly stopped her."
      },
      {
        "paragraph": "With that, they started fighting again."
      },
      {
        "paragraph": "Toward the end, Catherine felt her body was getting itchier and more uncomfortable. Her limbs became\nincreasingly weak too."
      },
      {
        "paragraph": "She bit her lips to keep herself sober with the pain."
      },
      {
        "paragraph": "“It’s okay. I have ample time to waste with you. It’s going to be a long night.” Wesley grabbed one of her\narms and yanked her into his embrace."
      },
      {
        "paragraph": "“Wesley, let go.” Catherine resisted and struggled with all her might."
      },
      {
        "paragraph": "“I won’t let go. I even want you to give birth to a few children of mine.”"
      },
      {
        "paragraph": "Wesley burst into laughter as he took out a red rope and tied her up. Then, he carried her upstairs."
      },
      {
        "paragraph": "Once they entered the bedroom, he threw her onto the bed before taking out his phone. He subsequently\nopened the recording function and focused it on the bed."
      },
      {
        "paragraph": "Catherine was scared. She really was scared."
      },
      {
        "paragraph": "She regretted it. She should have suggested a divorce right today. She should have brought Logan and\nAustin with her."
      },
      {
        "paragraph": "Catherine could only hope that Logan and the rest would rush in to save her when they could not reach\nher."
      }
    ]
  },
  {
    "title": "Chapter 1227 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "After Wesley was done setting up the phone, he slowly took off his coat and walked toward Catherine."
      },
      {
        "paragraph": "Catherine stared at his elegant face. Under the light, it looked ferocious and twisted like a demon."
      },
      {
        "paragraph": "This was the real Wesley."
      },
      {
        "paragraph": "She was so disgusted that a glance at him was enough to make her puke."
      },
      {
        "paragraph": "“Wait, I have one last question. Even if I die, let me die knowing, ” Catherine said with a hint of despair."
      },
      {
        "paragraph": "“Okay, go ahead.” Wesley was in no rush. He looked like he was looking at a fish on the chopping board.\nThat fish had already gone down without a fight and was only waiting to be slaughtered."
      },
      {
        "paragraph": "“Three years ago, did you approach me because you really liked me, or did you have other ulterior\nmotives?”"
      },
      {
        "paragraph": "Catherine could not help but say, “I don’t believe someone like you would woo me purely out of love. Did\nyou… already know that I’m Joel’s daughter? Or"
      },
      {
        "paragraph": "were you aiming for Hudson Corporation from the start? You want to swallow up my company.”"
      },
      {
        "paragraph": "“Ha. I’d say it’s fifty—fifty.”"
      },
      {
        "paragraph": "Wesley’s answer was ambiguous. “I sincerely liked you at first. However, I began to hate you when you\nturned to Shaun immediately after he framed me and put me in jail. Cathy, I loved you so much. What\ndoes Shaun have that I don’t? Is it because he’s Australia’s wealthiest man? Well, too bad. He is so\ninferior now that he can only bow down at my feet. To me, squashing him is as easy as squashing an\nant.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "After he said that with a twisted smile, he pressed Catherine down on the bed."
      },
      {
        "paragraph": "“Did you know? On the night  of  our wedding  day, he sent a video to me. You and Shaun made me  feel\nthe most humiliated in my entire life. Since he likes to send videos so much, let’s record a performance\nand send it to him to watch too, okay? I want him to see how the woman he loves looks when she’s on\nme.”"
      },
      {
        "paragraph": "Catherine’s heart was about to stop beating out of fear."
      },
      {
        "paragraph": "Her whole body trembled, but she forced herself to stay calm and dragged out the time. “Then why didn’t\nyou admit it when I asked you about it last time?”"
      },
      {
        "paragraph": "“Wouldn’t you suspect me if I admitted it? After all, no man could stand it. Do you understand?” Then, a s\nif he had thought of something, Wesley slapped her face hard."
      },
      {
        "paragraph": "Catherine’s brian rang from the slap. She shuddered and said, “Wesley, didn’t you say… you won’t hit\nme?”"
      },
      {
        "paragraph": "“Haha, I lied to you. Did you take it seriously?” Wesley yanked her up by her long hair so that she could\nsee the savageness in his eyes clearly."
      },
      {
        "paragraph": "“Did you think you will be free after today? You’re wrong. Today is just an appetizer. From now on,"
      },
      {
        "paragraph": "you will stay by my side obediently. If you disobey me, I’ll put the video out there for everyone to watch!\n“Did you think you will be free after today? You’re wrong. Today is just an appetizer. From now on, you\nwill stay by my side obediently. If you disobey me, I’ll put the video out there for everyone  to watch!"
      },
      {
        "paragraph": "“You can not think about yourself, but you have to consider your son and daughter. Do you want them to\nbe humiliated their entire lives and be pointed at everywhere they go?” Wesley threatened her coldly."
      },
      {
        "paragraph": "Catherine shuddered and could not help but scream, “Enough, Wesley. I’ve told you clearly from when\nyou pursued me that I don’t like you. You were the one who kept pestering me and driving a wedge\nbetween Shaun and my relationship. If it weren’t for you, Shaun and I wouldn’t have come to this today."
      },
      {
        "paragraph": "“Never mind that you stopped at no evils, but you even pushed all the responsibilities on me. You don’t\nunderstand at all that despicable methods and schemes cannot buy love. You disgusting man.”"
      },
      {
        "paragraph": "“I’m disgusting?”"
      },
      {
        "paragraph": "Infuriated, Wesley slapped her again and strangled her throat."
      },
      {
        "paragraph": "“Catherine, being able to have my fancy is your honor. Do you really think of yourself as someone clean?\nAren’t you just a woman that Shaun got"
      },
      {
        "paragraph": "bored of? Fine. Since you think I’m disgusting, let me show you how a disgusting man like me possesses\nyou.”"
      },
      {
        "paragraph": "He ripped her clothes apart after he spoke."
      },
      {
        "paragraph": "Catherine yelled, “Wesley Lyons, if you dare touch me, the video of you having an affair with Regina will\nbe leaked too. Office s*x is quite hot, huh? I believe it’ll be even more sensational.”"
      },
      {
        "paragraph": "Wesley’s body stiffened, and he looked toward her with his eyes wide. ”You installed security cameras in\nmy office?”"
      }
    ]
  },
  {
    "title": "Chapter 1228 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Wesley understood quickly. “You had it planned when you sent me the milk tea last time?”"
      },
      {
        "paragraph": "“When else?”"
      },
      {
        "paragraph": "Catherine sneered. “Only you can set others up, but I can’t set you up? It must have been difficult for you\nto play passionate games with Regina in the office every day. If your perverted look gets out, everyone\nwill surely be shocked!"
      },
      {
        "paragraph": "“However, the charitable image that you, President Lyons, have built may be wasted. A deceitful person\nlike you should be very concerned about your image, right?”"
      },
      {
        "paragraph": "“You really hid yourself well.” Wesley chuckled coldly."
      },
      {
        "paragraph": "“It’s nothing compared to you. ” Catherine mocked him as she tried hard to suppress the heat in her\nbody."
      },
      {
        "paragraph": "“Too bad. You still don’t understand me well enough. Let me ask you. Where is the video? Hand it over.”\nWesley gazed at her coldly."
      },
      {
        "paragraph": "“Are you dreaming?”"
      },
      {
        "paragraph": "“You’ll find out soon whether I’m dreaming or not.”"
      },
      {
        "paragraph": "Wesley smiled. “Don’t you know I’m a pervert? Then I’ll let you have a taste of my real, perverted\nmethods. Cathy, if you don’t say it, I’ll have no choice but to call the group of killers of Neah Bay over to\nhave some fun with you after I’m done. I’m not joking.”"
      },
      {
        "paragraph": "He gazed at Catherine. There was an eerie gleam in his eyes."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine was creeped out."
      },
      {
        "paragraph": "She did not expect that Wesley would go this far."
      },
      {
        "paragraph": "Perhaps she had forgotten that Wesley did not deserve to be called human."
      },
      {
        "paragraph": "“Let me ask you one last time. ” Wesley raised three fingers. “One…”"
      },
      {
        "paragraph": "“ If I tell you, will you let me go?” Catherine took a deep breath and asked."
      },
      {
        "paragraph": "“No, but I won’t let other people have their fun with you. I’ll keep you to myself, ” Wesley said with a fake\nsmile. “Two…”"
      },
      {
        "paragraph": "“In your dreams, Wesley. I won’t hand it over to you. What hardships have I not suffered before? I’ll\ndefinitely let the public have a good look at you, this demon. Moreover, even if you use the video to\nblackmail me, I’ll sue you for marital rape and committing crimes against me. Everything you did was\nagainst the law. Worst comes to worst, we’ll go down together.”"
      },
      {
        "paragraph": "Catherine said without flinching, “Worse come to worst, I’ll just jump off a building and commit suicide\nafter suing you. I’m not afraid of death. I haven’t feared death since three years ago. There are people to\ntake care of my children. But it’s different for you, Wesley. Can you bear to lose your empire?”\n“Catherine,  you have a death wish.” Wesley was extremely infuriated."
      },
      {
        "paragraph": "He raised his hand and was about  to slap Catherine."
      },
      {
        "paragraph": "“Hit me. It’s even better if you hit me harder. By the time when I sue you, your crime of domestic violence\nwill be heavier. Wesley, don’t go to  jail.”"
      },
      {
        "paragraph": "Catherine raised her head and flashed him a smile."
      },
      {
        "paragraph": "That face was awfully swollen, but Wesley held back because of her."
      },
      {
        "paragraph": "He was the one who had her, and he was about to have his way. Yet, in the end, she actually had him in\nher hands."
      },
      {
        "paragraph": "That woman…"
      },
      {
        "paragraph": "His eyes turned weirdly gentle. “As expected of the woman I fell in love with. Cathy, you’re really different\nfrom others.”"
      }
    ]
  },
  {
    "title": "Chapter 1229 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“But…”"
      },
      {
        "paragraph": "He stopped for a moment. He raised his eyebrows menacingly, “I can leave you be, but can you leave\nme be?”"
      },
      {
        "paragraph": "Catherine looked at him in confusion."
      },
      {
        "paragraph": "“I know you’re very strong, and you can tolerate things very well. I’ve witnessed it myself. That’s why I’ve\nincreased the dosage by a lot tonight. You may be able to stay conscious now, but later, you’ll be in a\nblur. You won’t even recognize who I am."
      },
      {
        "paragraph": "You’ll become like a cat in heat, with no rationality at all.”"
      },
      {
        "paragraph": "Wesley faked a smile and said, “I’m looking forward to you throwing yourself on me later.”"
      },
      {
        "paragraph": "Catherine looked like she was at a complete loss."
      },
      {
        "paragraph": "She could feel the heat in her body getting stronger wave after wave. It was like countless ants were\nbiting her. She felt extremely uncomfortable."
      },
      {
        "paragraph": "She even had to breathe in big breaths."
      },
      {
        "paragraph": "It was as if every pore was about to explode."
      },
      {
        "paragraph": "Wesley just sat by her side silently, looking as she bit her lip hard until it tore and dug her fingers into\nherself with all her strength. However, her face kept getting redder."
      },
      {
        "paragraph": "Her gaze on him was getting hotter too."
      },
      {
        "paragraph": "“Babe, you have to control yourself. ” Wesley teased her, taking pleasure in her suffering."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“You… B*stard.” Catherine felt like everything in front of her eyes was becoming a blur."
      },
      {
        "paragraph": "She wanted so badly to take a cold shower, but her body was tied up tightly."
      },
      {
        "paragraph": "Bang."
      },
      {
        "paragraph": "The door of the room was finally kicked open."
      },
      {
        "paragraph": "Logan barged in straight away, and Catherine let out a mental sigh when she saw him."
      },
      {
        "paragraph": "Luckily… she dragged out some time for Logan to finally get here."
      },
      {
        "paragraph": "“Wesley, you even f*cking hit women. You b* stard.” Seeing that Catherine was hurt, Logan rushed in\nand fought Wesley."
      },
      {
        "paragraph": "“Logan, do you think you alone can save her? In your dreams.” Wesley did not expect Logan to appear\nso suddenly, but he paid no attention to Logan at all."
      },
      {
        "paragraph": "“Of course, I know I can’t bring her out alone. However, if I don’t bring her out within 15 minutes, Austin\nwill call the police.” Logan sneered and said, “It’ll surely be interesting if the police come over and see\nthis scene.”"
      },
      {
        "paragraph": "Wesley’s expression changed. “I’m afraid even if I let you take her away, you guys will still call the police\nafterward. In that case, I should just keep you guys here. When the police ask about it, I can say that you\nwere the one who trapped my wife and harbored bad intentions toward her. Look at her unconscious\nright now. If she pounces on you later, the scene will be quite interesting. Haha.”"
      },
      {
        "paragraph": "“Shameless.” Logan hated Wesley so much. “ Wesley, as long as you let us go today, we’ll act as if\ntoday’s incident never happened.”"
      },
      {
        "paragraph": "“Do you think I’ll believe you?”"
      },
      {
        "paragraph": "Unknowingly, they both have fought for seven or eight minutes."
      },
      {
        "paragraph": "Logan obviously did not expect Wesley’s defensive skills to be so good. However, he was not worried\nthat the group of Neah Bay killers would come."
      },
      {
        "paragraph": "That was because it was Wesley’s house. If those people appeared, there would be no explaining it for\nWesley if the police saw them."
      },
      {
        "paragraph": "That was also why Logan dared to barge in."
      },
      {
        "paragraph": "Seeing as he was pressed for time, Logan finally found an opening and kicked Wesley’s chest."
      },
      {
        "paragraph": "As Wesley was pushed back a few steps, Logan immediately rushed over and cut open Catherine’s\nropes. Then, he pointed the knife at Wesley."
      },
      {
        "paragraph": "“Wesley, you’re not my opponent. If you come closer, believe it or not, I’ll kill you. You should be clear\nabout my identity. I’m not afraid of death, let alone going to jail.”"
      },
      {
        "paragraph": "Wesley clenched his jaw. He glanced at Catherine, whose face was flushed red, and clenched his fists in\ndiscontent."
      },
      {
        "paragraph": "Everything was almost in his grasp, yet an accident just had to happen."
      },
      {
        "paragraph": "“Get lost,” he roared."
      },
      {
        "paragraph": "Catherine may have escaped him today, but once his plans were complete, squashing people like\nLogan, Catherine, or Shaun would be like squashing an ant."
      },
      {
        "paragraph": "However, it was not yet time for him to die."
      },
      {
        "paragraph": "Logan let out a sigh of relief. Luckily, Wesley was a person who feared death."
      }
    ]
  },
  {
    "title": "Chapter 1230 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Logan quickly carried Catherine on his back."
      },
      {
        "paragraph": "After they ran out of the villa, Austin dashed over with the car. By the time Logan and Catherine got in\nthe car, Catherine was already completely disoriented."
      },
      {
        "paragraph": "In her eyes, Logan was just a man."
      },
      {
        "paragraph": "She hugged Logan without any sense of self- control."
      },
      {
        "paragraph": "“F*ck. What did she eat? She can’t even think straight. ” Austin glanced at Logan ruefully. “Don’t let her\ntouch you.”"
      },
      {
        "paragraph": "Logan was exasperated. “Shut your f*cking mouth.”"
      },
      {
        "paragraph": "As soon as he finished speaking, Catherine started pulling on his clothes forcefully."
      },
      {
        "paragraph": "“Don’t, Eldest Young Lady. Please let me go.” Logan was on the verge of tears. “I’m Logan.”"
      },
      {
        "paragraph": "“Shaun… Shaun, give me…” It was as if Catherine did not hear him. Her gaze looked as if she\ndesperately wanted to gobble Logan up."
      },
      {
        "paragraph": "“Quick, hurry. Drive the car and look for Shaun, ” Logan shouted."
      },
      {
        "paragraph": "Austin was at a loss. “But I don’t know where Shaun is. I don’t know his phone number either. ”"
      },
      {
        "paragraph": "“Are you stupid? Don’t you know to call Suzie?” Logan yelled in frustration."
      },
      {
        "paragraph": "Austin immediately found Lucas’s number and dialed it. “Suzie, tell me where Shaun is. Quick.”"
      },
      {
        "paragraph": "“Sc*mmy dad? He’s right by my side…”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Before Suzie could finish her sentence, Shaun’s voice came through. “What’s the matter?”"
      },
      {
        "paragraph": "“There’s a matter. A huge one. Wesley has drugged Eldest Young Lady. Come over quickly to help\nrelieve her… If you don’t, Eldest Young Lady is about to strip Logan naked, ” Austin yelled."
      },
      {
        "paragraph": "“Don’t touch her, ” Shaun roared."
      },
      {
        "paragraph": "Austin was helpless. “It’s not Logan who wants to touch her. It’s Eldest Young Lady who wants to touch\nLogan, okay?”"
      },
      {
        "paragraph": "“B*stard. ” Shaun cursed out of anger. “Where are you guys at? I’ll come over immediately.”"
      },
      {
        "paragraph": "“I just exited the Lyons’s house. I’m heading toward the Hill family’s residence now. But going to the Hill\nfamily’s residence will be quite inconvenient, right?” Austin cleared his throat and said. “Go to Palm\nSprings. I have a house there.”"
      },
      {
        "paragraph": "Shaun quickly stood up after he spoke, and Suzie grabbed him worriedly. “Sc*mmy dad, what happened\nto Mommy? I want to go too. I want to be Mom’s antidote too.”"
      },
      {
        "paragraph": "Shaun was shocked. “Suzie, don’t add more trouble to things. I’ll bring your mommy over tomorrow. I\ndon’t have time to take care of you now.”"
      },
      {
        "paragraph": "“But…”"
      },
      {
        "paragraph": "“Alright. You can play with Lucas.”"
      },
      {
        "paragraph": "Shaun pushed Suzie away and left in a hurry."
      },
      {
        "paragraph": "Suzie pouted aggrievedly. “Lucas, why does sc* mmy dad get to be Mommy’s antidote? Why?"
      },
      {
        "paragraph": "Aren’t we the people Mommy loves the most?”"
      },
      {
        "paragraph": "“How would I know?” Lucas lowered his gaze. He was deep in thought."
      },
      {
        "paragraph": "All he heard just now was Uncle Austin saying that Wesley had hurt Mom."
      },
      {
        "paragraph": "It was Wesley again."
      },
      {
        "paragraph": "Lucas clenched his fists in contempt."
      },
      {
        "paragraph": "Shaun sped to Palm Springs."
      },
      {
        "paragraph": "By the time he arrived, Austin’s car was already parked at the neighborhood’s entrance."
      },
      {
        "paragraph": "When he opened the car door, Shaun saw Catherine on top of Logan, who was grabbing onto his clothes\ntightly. He looked like he would die rather than submit."
      }
    ]
  },
  {
    "title": "Chapter 1231 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Shaun’s face darkened in anger."
      },
      {
        "paragraph": "He knew that he should not blame Logan, but he was still so furious that he wanted to beat Logan up."
      },
      {
        "paragraph": "“Hand her to me.” Shaun carried Catherine over."
      },
      {
        "paragraph": "When he saw that Catherine’s face was much more swollen than the last, Shaun’s eyes narrowed coldly\nand painfully."
      },
      {
        "paragraph": "What on earth did Wesley do to her? He hit her until she was in such a state."
      },
      {
        "paragraph": "However, it was not the time to ask questions about the situation. The most urgent thing was for her to\nregain consciousness."
      },
      {
        "paragraph": "Shaun carried her to his car."
      },
      {
        "paragraph": "Catherine was tugging on his clothes in agony at the backseat."
      },
      {
        "paragraph": "Shaun tightened his grip on the steering wheel. He could sense that her condition was more severe than\nhis last time."
      },
      {
        "paragraph": "“Cathy, just bear with it a little more.” He drove the"
      },
      {
        "paragraph": "car to the parking lot and parked it before he carried her into the elevator."
      },
      {
        "paragraph": "After entering the house, he lowered his head and kissed her lips deeply."
      },
      {
        "paragraph": "Nevertheless, he did not dare to use too much strength. Catherine’s lips were already torn, so he was\nafraid he would hurt her."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "The most frustrating and damnable thing was that even though the beauty was already in his arms, he\nwas still incapable of sex."
      },
      {
        "paragraph": "“Cathy, don’t rush. I’ll help you like the way you helped me last time. ” Shaun then carried her into the\nbedroom."
      },
      {
        "paragraph": "The consequence of being impotent was that he worked hard the whole night and barely even slept."
      },
      {
        "paragraph": "Only when morning came did Catherine gradually calm down. She fell asleep in his embrace, exhausted."
      },
      {
        "paragraph": "Shaun was very tired too, so tired that his arm was almost dead."
      },
      {
        "paragraph": "Even so, he did not dare to sleep. He gave Chester a call instead, and Chester soon came over."
      },
      {
        "paragraph": "Looking at Catherine, who was sleeping on the bed, a hint of gloominess flashed across Chester’s eyes.\n“"
      },
      {
        "paragraph": "Did Wesley hit her?”"
      },
      {
        "paragraph": "“Catherine’s subordinates said it was Wesley who did it. They sent her over last night all of a sudden. Do\na check-up on her. I don’t know what drug"
      },
      {
        "paragraph": "Wesley gave her, but her reaction was very intense last night. She was totally disoriented. I’m afraid\nthere’ll be side effects. Furthermore, the wounds on her face have to be treated too.” Shaun’s heart\nached for Catherine."
      },
      {
        "paragraph": "In fact, when he realized that Wesley might harm Suzie and Lucas, he wanted to have Elle protect\nCatherine."
      },
      {
        "paragraph": "However, he had to discuss it with Catherine  first. He thought Wesley was still in disguise and probably\nwould not hurt her so soon. Little did he know that Wesley would make a move in just two days."
      },
      {
        "paragraph": "“I have to take a blood sample and go back to run some tests on it.”"
      },
      {
        "paragraph": "After Chester drew some blood with a syringe, he checked her pulse."
      },
      {
        "paragraph": "“Her pulse is very weak. It should be because her body is extremely exhausted. Wesley is too cruel. He\nmust’ve given her a large dose of the drug without any concern about how it’ll affect her body. If his\ndosage was slightly larger, she might’ve died from"
      },
      {
        "paragraph": "suffocation last night because her heart couldn ‘t keep up.”"
      },
      {
        "paragraph": "Shaun’s fist cracked as he clenched it. “Did Wesley do it on purpose?”"
      },
      {
        "paragraph": "“That’s for sure. He didn’t want her to die, but he didn’t want her to let her off easily either.” Chester\nsighed. “Luckily, you called me over. If you just let her be, her heart functions may deteriorate in the\nfuture.”"
      },
      {
        "paragraph": "Shaun was startled to hear that."
      },
      {
        "paragraph": "“Send her to the hospital. She needs an IV drip,” Chester said. “The injuries on her body have to be\nexamined by professionals. If she wants to sue Wesley, she needs evidence.”"
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "Shaun did not dare to delay."
      }
    ]
  },
  {
    "title": "Chapter 1232 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine was rushed to the Jewell family’s private hospital."
      },
      {
        "paragraph": "Chester already had the hospital arrange a VIP ward."
      },
      {
        "paragraph": "However, when Shaun carried Catherine down the car, a group of reporters suddenly rushed out in the\nparking lot. They took pictures of Shaun and Catherine."
      },
      {
        "paragraph": "“Shaun, we received news that you spent a passionate night with Catherine last night. It looks like it’s\ntrue.”"
      },
      {
        "paragraph": "“Nonsense. Isn’t it obvious? Look at Catherine’s neck. There are hickeys all over it.”"
      },
      {
        "paragraph": "“There are hickeys on Shaun’s neck too. You both might’ve been a little intense. However, isn’t this too\nimmoral? Catherine is Wesley’s wife.”"
      },
      {
        "paragraph": "“What happened to Catherine? Is she too exhausted from last night?”"
      },
      {
        "paragraph": "“Move away.” Faced with those reporters’ buzzing discussions, Shaun was infuriated."
      },
      {
        "paragraph": "“Haha, why are you getting angry? Do you really think you’re  still the haughty Young Master Hill you\nonce was? You’re having an affair with another person’s wife. Can’t other people talk about it?”"
      },
      {
        "paragraph": "“That’s right. Take those pictures, and let other people have a look at this cheating couple’s faces.”"
      },
      {
        "paragraph": "“Shut up. Can’t you all see the wounds all over her face?”"
      },
      {
        "paragraph": "Shaun said angrily, “Wesley gave her all those wounds. Don’t you guys want an interview? Just nice."
      },
      {
        "paragraph": "Please tell Wesley for me that I won’t let him off the hook for all the things he has done to Catherine.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Okay, make way. Don’t delay the patient’s treatment. The hospital is not a place for all of you to create a\nruckus. If not, I will have no choice but to call the security guard over to chase you away.” Chester glared\nat those reporters as a warning. He then escorted Shaun and Catherine into the elevator."
      },
      {
        "paragraph": "“It must’ve been Wesley who informed those reporters.” Shaun’s handsome face darkened."
      },
      {
        "paragraph": "“That’s right. The reporters took pictures just at the right timing. Wesley must’ve guessed that"
      },
      {
        "paragraph": "Catherine’s men would bring her to you last night, and he also expected that you would bring her to m y\nhospital. This scheme is too terrifying.”"
      },
      {
        "paragraph": "Chester sighed. “I reckon he’s worried that Catherine will call the police when she wakes up. That’s why\nhe used the reporters to produce strong evidence of you and Catherine having an affair. I don’t know\nwhat he will do next.”"
      },
      {
        "paragraph": "“If I were him, I’d go to the police station first and turn myself in,” Shaun said in a deep voice."
      },
      {
        "paragraph": "Chester was taken aback, but he nodded after that. “ As matters stand, we can only discuss this after\nCatherine wakes up. After all, you’re not clear about the details of the incident. Standing out rashly will\nonly make things worse.”"
      },
      {
        "paragraph": "Shaun pressed his lips together coldly."
      },
      {
        "paragraph": "At 9:00 a.m., after the doctor inserted the needle into Catherine, Hadley came in with a phone."
      },
      {
        "paragraph": "“Young Master Hill, Wesley was interviewed by the reporters at the police station’s entrance at 6:00 a.m.”"
      },
      {
        "paragraph": "“Let me see.” Shaun took the phone over."
      },
      {
        "paragraph": "In the video, Wesley looked disheveled. His eyes were red and swollen, and he looked remorseful. “ I\ncame to the police station to turn myself in today. Because last night… I finally lost control of my"
      },
      {
        "paragraph": "emotions and hit my wife. I even drugged her.”"
      },
      {
        "paragraph": "A reporter asked, “Why did you do that?”"
      },
      {
        "paragraph": "Wesley covered his face. “I couldn’t control it. I was in too much agony. Everyone should know that\nShaun snatched my wife away on our wedding day. When I had done my best and got my wife back, I\nwas willing not to care about that past because I love her. I just wanted to have a new start with her."
      },
      {
        "paragraph": "“However, she could not get over Shaun. She went on dates with Shaun again and again behind my\nback. When I went to look for her, she even let Shaun hide in the bedroom of her office."
      },
      {
        "paragraph": "“She thought I didn’t  know, but I knew everything. I just wanted to give her a chance. I’ve never loved a\nwoman so much before.”"
      },
      {
        "paragraph": "The reporter was astonished. “So Catherine betrayed you multiple times during your marriage?”"
      },
      {
        "paragraph": "Wesley smiled pitifully. “Yes. The worst one was not long ago, during the birthday party of Senator\nMead’s daughter. She and Shaun were in the bathroom… Haha, she thought I didn’t know. It was\nsomeone else who told me afterward. Many people knew about it that night, but she took me as a fool.\nShe overstepped the line. ”"
      }
    ]
  },
  {
    "title": "Chapter 1233 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Last night, I couldn’t resist spiking her food. I thought I could have her by possessing her body. It must\nsound hilarious, but she has never let me touch her even though we’ve been married for so long.”"
      },
      {
        "paragraph": "The reporters looked incredulous."
      },
      {
        "paragraph": "Wesley shed a tear. “She wasn’t willing last night, so I lost control for a moment and slapped her. After\nthat, she escaped from me and went to find Shaun. She was with Shaun the whole night. However,\nbreaking the law is breaking the law, and what’s wrong is wrong. I came to turn myself in.”"
      },
      {
        "paragraph": "The reporters sighed. “That’s so sad.”"
      },
      {
        "paragraph": "Wesley said miserably, “Love can change a person. I never  thought  I would  become  like  this one day.”"
      },
      {
        "paragraph": "Within two hours after the video got out, the views had already surpassed five billion."
      },
      {
        "paragraph": "Shaun looked at Wesley’s shameless look and was pissed off that his temples began to throb."
      },
      {
        "paragraph": "What made him more furious was the netizens’ overwhelming criticisms."
      },
      {
        "paragraph": "[I feel sorry for Wesley. It’s so sad.]"
      },
      {
        "paragraph": "[I can especially understand Wesley’s feelings of loving a scummy woman. Catherine is simply a b* tch.]"
      },
      {
        "paragraph": "[I used to like and admire Catherine quite a lot, but now, I think I’m a fool for doing so.]"
      },
      {
        "paragraph": "[No one can defeat a b*tchy person. Since Catherine couldn’t let go of Shaun, why did she have to go\nand hurt Wesley? She gave him hope only to disappoint him afterward.]"
      },
      {
        "paragraph": "[I really admire Wesley. If I were him, not only would I slap her, but I’d even hit her to death. F*ck.]"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "[How sl*tty is she? She can’t even let a bathroom slide. She left Wesley with no dignity at all.]"
      },
      {
        "paragraph": "[Shaun, Catherine, go to hell. Disgusting sc*mbag and b*tchy woman.]"
      },
      {
        "paragraph": "[How can a person like Catherine, who has no ethical boundaries, be the director of a listed company?"
      },
      {
        "paragraph": "Don’t purchase the houses from her company, lest you purchase a jerry-built house.]"
      },
      {
        "paragraph": "Shaun’s heart almost ached out of anger."
      },
      {
        "paragraph": "He did not mind if other people criticized him, but he could not stand them degrading Catherine that way."
      },
      {
        "paragraph": "She was clearly the victim all along. It was him who kept bugging her."
      },
      {
        "paragraph": "Wesley really wanted to destroy Catherine."
      },
      {
        "paragraph": "Hadley said worriedly, “This move of Wesley’s is very skillful. He might’ve been worried that Miss Jones\nwould sue him, so he turned himself in first. Although he was the one who hit someone, the police and\nthe public will sympathize with him. I reckon he’ll only be locked up for one week at most. The\nunfortunate thing is that his words have completely ruined Miss Jones’ reputation, and what’s most\nfrustrating is that she got hit for nothing.”"
      },
      {
        "paragraph": "“Get Logan and Austin to come over. I need to understand the sequence of events.” Shaun thought for a\nwhile and spoke."
      },
      {
        "paragraph": "More than 20 minutes later, Logan and Austin showed up at the hospital together."
      },
      {
        "paragraph": "They had most likely watched the video of Wesley’s interview too, hence both of their complexions were\nawful."
      }
    ]
  },


  {
    "title": "Chapter 1234 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Can you tell me what exactly happened last night?”"
      },
      {
        "paragraph": "Shaun’s gaze landed on Logan. “I know I chopped off your finger in the past. I’m very sorry, and I feel\nvery guilty toward you. However, Catherine is your master. Something happened to her yesterday. No\nmatter what, now is the time for us to work together.”"
      },
      {
        "paragraph": "“Don’t worry. I’m not such a petty person.”"
      },
      {
        "paragraph": "Logan glanced at Shaun. “Miss Jones has been investigating Wesley lately. She secretly installed\nsecurity cameras in his office and found Wesley and Regina having an affair in the office. The main thing\nis that Miss Jones suspects Wesley and Sarah are conspiring together. Even Charity being framed and\ngoing to jail, as well as Ethan’s death, may be related to Wesley.”"
      },
      {
        "paragraph": "A hint of shock flashed across Shaun’s deep, black eyes."
      },
      {
        "paragraph": "Wesley and Sarah were conspiring together?"
      },
      {
        "paragraph": "Charity going to jail had something to do with Wesley?"
      },
      {
        "paragraph": "Ethan died because of Wesley, too?"
      },
      {
        "paragraph": "All that shocking news stunned him for a long time."
      },
      {
        "paragraph": "Logan snorted. “You don’t have to be shocked. You were fooled by Sarah about a lot of things as well\nback then. However, Miss Jones already had us investigate Sarah secretly once she returned to the\ncountry. We were the ones who deliberately lured Lucifer back too.”"
      },
      {
        "paragraph": "Shaun smiled bitterly. How many things did he still not know of? “What was the matter with Lucifer?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Logan said calmly, “Miss Jones asked us to investigate Sarah’s past during those years she was\noverseas. The people who participated in Sarah’s kidnapping back then were all dead. Only Lucifer was\nleft. In fact, after Sarah was kidnapped by the abductors that year, she sold herself to them in order to\nstay alive. Anyway, she was quite willing. She serviced a group of people alone. However, it was her who\nexposed the abductors’ tracks afterward. Many people were shot dead, so she might’ve not expected\nthat Lucifer escaped.”"
      },
      {
        "paragraph": "“We told Lucifer about her news. Ha, after knowing that Sarah hooked up with Australia’s wealthiest"
      },
      {
        "paragraph": "man, Lucifer came back and blackmailed her. She gave him a few hundred million dollars and even slept\nwith him. They had quite some happy sex. Oh, right. Those days, Sarah was living with you, and you\neven wanted to marry her.”"
      },
      {
        "paragraph": "Taking pleasure in Shaun’s unhappiness, Logan said, “Lucifer took the money, took drugs, and even\nbrought women back. His private life was a mess, so Miss Jones was afraid that she’d catch diseases\nfrom you.”"
      },
      {
        "paragraph": "Shaun’s face turned green upon hearing that."
      },
      {
        "paragraph": "He more or less guessed some things before, but he did not have evidence. After listening to them from\nLogan, he felt inexplicably nauseous."
      },
      {
        "paragraph": "When he recalled that he actually thought Sarah had an undying love for him and that he even stupidly\nwanted to marry her, he was disgusted."
      },
      {
        "paragraph": "“Why didn’t Catherine tell me about Lucifer’s existence?”"
      },
      {
        "paragraph": "“Firstly, you were someone who would think Sarah’s fart smelled good. You wouldn’t have believed Miss\nJones at all. Secondly, Sarah was exceptionally cunning. Thirdly, Miss Jones thought that you both were\nquite a match when you guys were together. Didn’t you love Sarah? Wouldn’t it"
      },
      {
        "paragraph": "have been more satisfying to expose Sarah’s true colors after you married her?”"
      },
      {
        "paragraph": "Shaun looked toward Catherine, who was asleep on the bed. He really wanted to hit her butt to teach her\na lesson."
      },
      {
        "paragraph": "That little brat."
      },
      {
        "paragraph": "Logan continued saying, “During that time, I followed Lucifer every day. A few days before your wedding\nwith Sarah, a group of Neah Bay killers killed him one night. They even buried Lucifer’s body in a remote\nplace. I was the one who dug his body out and threw it to a place where people would easily notice it. If\nnot, you really would’ve married Sarah, that evil woman.”"
      },
      {
        "paragraph": "Shaun understood everything. “Lucifer must’ve been killed because Sarah wanted to get rid of him t o\nkeep his mouth shut. But how could she find Neah Bay’s killers?”"
      },
      {
        "paragraph": "“That was why we suspected that there was another mysterious person behind Sarah’s back that time,\nbut we could not find out who it was all along. Miss Jones only started suspecting Wesley when Suzie\nand Lucas got attacked.”"
      },
      {
        "paragraph": "Logan lamented, “We have the evidence of Wesley cheating. He even has some perverted hobbies. All\nof this is enough to let the public know that Wesley is a deceitful person. As long as we reveal them,\nWesley’s words in the video won’t be valid, and"
      },
      {
        "paragraph": "Miss Jones’s reputation can be salvaged.”"
      },
      {
        "paragraph": "“Does Wesley know you have this evidence in your hands?” Shaun asked"
      }
    ]
  },
  {
    "title": "Chapter 1235 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Logan shook his head. “ I’m not sure. We’ll have to ask Miss Jones about this. However, Miss Jones\nmentioned before that she wanted to use this evidence to threaten Wesley for a divorce. That’s why I\nhaven’t taken it out yet. We’ll wait until she wakes up to make decisions.”"
      },
      {
        "paragraph": "Only then Shaun did understand."
      },
      {
        "paragraph": "Cathy was more intelligent than he expected."
      },
      {
        "paragraph": "It was just that she underestimated Wesley’s slyness in the end."
      },
      {
        "paragraph": "12:00 p.m."
      },
      {
        "paragraph": "Catherine woke up blurrily because she was hungry. Her stomach was growling, and it was\nuncomfortable."
      },
      {
        "paragraph": "“Are you hungry? I prepared some millet porridge for you.”"
      },
      {
        "paragraph": "Shaun hurriedly helped her up. He let her lean on his chest. He held a bowl in one hand while feeding"
      },
      {
        "paragraph": "her with a spoon using the other hand."
      },
      {
        "paragraph": "Catherine moved her mouth slightly. Her whole face was burning in pain."
      },
      {
        "paragraph": "“Your face muscles are bruised. The doctor said it’ll need a week at least to recover,” Shaun explained to\nher softly."
      },
      {
        "paragraph": "“Mm.”"
      },
      {
        "paragraph": "After enduring the pain and having half a bowl of the millet porridge, Catherine lifted her gaze and looked\nat him strangely. “Why are you here? Last night…”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Her face became slightly pale. All she remembered was that her body was boiling hot last night."
      },
      {
        "paragraph": "Toward the end, she was unconscious and could not recall what she had done."
      },
      {
        "paragraph": "“Last night, Logan sent you to my place… ” Shaun cleared his throat. He glanced at her awkwardly. “ You\nwere in a bad state at that time…”"
      },
      {
        "paragraph": "After a moment of silence, Catherine said, “He should’ve sent me to the hospital. What was the point of\nsending me to your place? You’re impotent. You couldn’t help me anyway.”"
      },
      {
        "paragraph": "Shaun’s face darkened from being insulted. His tone was rueful. “I helped you yesterday with the exact\nway you helped me last time. I didn’t sleep for the whole night, and I was so tired I was half dead. ”"
      },
      {
        "paragraph": "“…Ahem”"
      },
      {
        "paragraph": "Catherine almost got choked to death by the porridge."
      },
      {
        "paragraph": "After a few coughs, her swollen face was burning."
      },
      {
        "paragraph": "She moved her legs unconsciously, then glared at Shaun furiously."
      },
      {
        "paragraph": "However, when she thought about how ugly her face must look at that moment, she quickly lowered her\nhead."
      },
      {
        "paragraph": "“You’re shy. What is there to be shy of between us?” Shaun lowered his head and hugged her tightly. He\neven bit her ear intimately."
      },
      {
        "paragraph": "“Shaun…”"
      },
      {
        "paragraph": "Catherine shuddered. Although her body had calmed down, it had not completely returned to normal yet.\nAs such, a wave of heat washed over unconsciously."
      },
      {
        "paragraph": "She had the urge to do it again."
      },
      {
        "paragraph": "She really wanted to slap herself twice."
      },
      {
        "paragraph": "“Cathy, don’t make things hard for me anymore."
      },
      {
        "paragraph": "You have to hang in there. I really can’t take it anymore.” Shaun looked at her and said with a straight\nface."
      },
      {
        "paragraph": "“…Go to hell.”"
      },
      {
        "paragraph": "Catherine pinched him hard on the waist without hesitation."
      },
      {
        "paragraph": "Shaun’s handsome brows furrowed from the pain, yet he still said brazenly, “I don’t care. You already\nhad all of me last night. You have to be responsible for me.”"
      },
      {
        "paragraph": "Catherine glanced at him in disdain. “I was in such agony last night, yet you still did not react to it at all."
      },
      {
        "paragraph": "How shameless of you to say I should be responsible.”"
      }
    ]
  },
  {
    "title": "Chapter 1236 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Having been insulted, Shaun was not in a good mood at all. After a long while, he forced out a sentence\nthrough his clenched teeth. “Cathy, that was not what you said when you were clinging onto me tightly\nlast night. You said I…”"
      },
      {
        "paragraph": "“Alright. Just shut up.”"
      },
      {
        "paragraph": "Catherine could not hold it in anymore and cut him off. She was irrational at that time, so she must have\nsaid a lot of shameless words."
      },
      {
        "paragraph": "“Fine. Let’s not talk about this. I’ll show you a video.”"
      },
      {
        "paragraph": "Shaun played Wesley’s video for her."
      },
      {
        "paragraph": "Besides some anger on her face in the start, Catherine got calmer toward the end."
      },
      {
        "paragraph": "It was not surprising to see Wesley pull this stunt after she had seen his shameless side."
      },
      {
        "paragraph": "She just felt frustrated and annoyed that she got married to such a person."
      },
      {
        "paragraph": "Especially in the past, she even praised Wesley in front of Shaun multiple times. She said Wesley was\nthe person truly worthy of her to entrust herself to and treasure."
      },
      {
        "paragraph": "She literally shot herself in the foot. Her pride and image were gone, and it was embarrassing."
      },
      {
        "paragraph": "“Cathy, I’ve reminded you many times that Wesley is not a good person. You didn’t believe me.” Shaun\nsaid bitterly, “You were bewitched by him. You would even think his fart smells nice.”"
      },
      {
        "paragraph": "Catherine was ashamed."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Those words were very familiar. It sounded like the words she used to mock Shaun with. She did not\nexpect he would return them to her so quickly."
      },
      {
        "paragraph": "“You’re in no position to say that about me, ” Catherine retorted, refusing to give in."
      },
      {
        "paragraph": "“I was hypnotized by Sarah. Wesley  didn’t even do ” Before Shaun could finish his sentence, he\nimmediately pressed his lips together when he saw Catherine was furious. He did not dare to say\nanything more."
      },
      {
        "paragraph": "Catherine closed her eyes. Although she really wanted to give Shaun a killing blow, she had to"
      },
      {
        "paragraph": "admit that he was right. “I didn’t… get deceived by Wesley on purpose. It was all because Wesley took a\nstab in my stead.”"
      },
      {
        "paragraph": "At that time, Wesley even lost a kidney for her sake. She was really shocked by Wesley’s feelings."
      },
      {
        "paragraph": "No man had ever gone that far for her before, not even Shaun."
      },
      {
        "paragraph": "“Do you really think that a cunning, selfish person like Wesley would lose a kidney for you?” Shaun\nrefuted."
      },
      {
        "paragraph": "Catherine was taken aback. Then, she thought of Wesley’s fighting skills which were on par with hers.\nShe had gone through countless hardships over the years to acquire those skills. Could Wesley have\nsuch skills even without a kidney?"
      },
      {
        "paragraph": "Shaun said suspectingly, “Maybe he bribed the doctor and fooled you to get your pity. Think about it. If\nyou didn’t hear that he lost a kidney back then, would you have agreed to get engaged to him?”"
      },
      {
        "paragraph": "Catherine was momentarily speechless from his question."
      },
      {
        "paragraph": "Right or wrong, true or false, she realized she could no longer differentiate many things."
      },
      {
        "paragraph": "“What are you planning to do?” Shaun asked, “Do you want to publish the video of Wesley’s affair?”\nCatherine lifted her lips weakly. “Wesley knows I have evidence of him cheating. The fact that he still\ndared to say those words to the reporters  means he’s sure that I won’t  dare  to reveal the evidence. He\nthinks that evidence  is  for me  to threaten him for a divorce.”"
      },
      {
        "paragraph": "“I’ll let you make the decisions. I’ll support you anyhow.”"
      },
      {
        "paragraph": "Shaun hugged her gently and lowered his gaze. “ If you want to use that evidence to threaten him for a\ndivorce, I’ll reveal the medical report of my ‘ treasure’ that got injured by someone in the police station.\nDidn’t Wesley say I have an affair with you? I’m already f*cking sexually disabled. How can I even have\ns*x with you?”"
      },
      {
        "paragraph": "Catherine looked at him with mixed feelings. “ Aren’t you afraid of being mocked by others?”"
      },
      {
        "paragraph": "“ Since I dared to reveal the fact that I went to the andrology unit, why not this?” After Shaun said that\nwithout a care, he suddenly lowered his head and kissed Catherine’s forehead. “I don’t care about what\nother people say. I only care about you.”"
      },
      {
        "paragraph": "“Actually, I do mind.” Catherine’s eyelashes fluttered innocently. ”I do mind it quite a lot that you’re\nimpotent.”"
      }
    ]
  },
  {
    "title": "Chapter 1237 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun, who was mercilessly stabbed in the heart again, lowered his eyes sadly. His thick, dark\neyelashes trembled. His handsome face looked sad, lonely, and aggrieved. He felt so attacked that his\nface drained of color, and he looked very pitiful."
      },
      {
        "paragraph": "He moved his body and let go of Catherine, letting her lie on the bed."
      },
      {
        "paragraph": "Catherine was stunned. Seeing his sad look suddenly made her regret it."
      },
      {
        "paragraph": "Even if she was joking, was it too much? “Ahem… Shaun, you…”"
      },
      {
        "paragraph": "“Cathy, I didn’t expect  you would say those kinds of words.” Shaun put both his hands by her ears all\nof a sudden. His good-looking lips suddenly lifted creepily. “In that case, I can only use actions to prove\nmy ability to give you pleasure.”"
      },
      {
        "paragraph": "His change of expressions caught Catherine off guard and made her dumbfounded. When she came\nback to her senses, she quickly covered his mouth in frustration. “Shaun, will you stop that? Can’t you\nsee that I’m still hospitalized?”"
      },
      {
        "paragraph": "“You were the one who challenged me again and again. Although my men’s pride is malfunctioning\ntemporarily, it doesn’t affect me from using other ways to prove myself. ” Shaun smiled vaguely. His\ntone had a hint of evilness."
      },
      {
        "paragraph": "“Pervert.”"
      },
      {
        "paragraph": "Catherine glared at him with a burning face."
      },
      {
        "paragraph": "She was frustrated to think that she was actually sympathetic toward him just now. “It’s all your fault. If\nit weren’t for you, I wouldn’t have been accused of being flirtatious.”"
      },
      {
        "paragraph": "Shaun, who was mercilessly stabbed in the heart again, lowered his eyes sadly. His thick, dark\neyelashes trembled. His handsome face looked sad, lonely, and aggrieved. He felt so attacked that his\nface drained of color, and he looked very pitiful."
      },
      {
        "paragraph": "“Ugh, what do those outsiders know? You’ve been faithful from the start until the end. You’ve never\nchanged.” Shaun suddenly looked toward her with a smile. “Cathy, did you really… never let Wesley\ntouch you?”"
      },
      {
        "paragraph": "“Why are you asking about this? It’s none of your f* cking business.” Catherine turned away bluntly."
      },
      {
        "paragraph": "When she recalled she even mocked Shaun for being not as capable in sex as Wesley, her ears\nburned."
      },
      {
        "paragraph": "“Of course it’s my business. It means that I’m your only man all along.” Shaun observed how"
      },
      {
        "paragraph": "embarrassed she looked and laughed. He laughed until his eyebrows arched. He looked very childish."
      },
      {
        "paragraph": "“Cathy, I’m very happy.”"
      },
      {
        "paragraph": "He kissed her mouth lightly again and again. “ You’re such a little liar. You made me suffer so much\nfrom your lies. I’ve always thought that you and Wesley…”"
      },
      {
        "paragraph": "“Don’t flatter yourself. That’s none of your own business either. It’s my own problem,” Catherine\nretorted."
      },
      {
        "paragraph": "“Is it?” Shaun raised his eyebrows with a smile. He did not believe it at all. “Cathy, you said you don’t\nlove me, but your body can only accept me."
      },
      {
        "paragraph": "Actually, you’re the same as me back then. We love each other, but we just didn’t realize it. In fact, we\nhave always had each other in our hearts.”"
      },
      {
        "paragraph": "Catherine chucked. “There’s nothing I can do if you want to think of it that way.”"
      },
      {
        "paragraph": "“Your mouth says no, but your heart says yes.” Shaun could not resist kissing her twice again."
      },
      {
        "paragraph": "There were wounds all over Catherine’s face, so she sucked in a few breaths due to the pain."
      },
      {
        "paragraph": "“ I… I’m sorry. It must hurt a lot. I’ll stop kissing you.” Shaun was startled. He quickly patted her head\nand coaxed her."
      },
      {
        "paragraph": "Catherine was speechless. Although she had yet looked at herself in the mirror, she could guess that\nshe must look very, very ugly. The fact that Shaun could still kiss her face made her impressed."
      },
      {
        "paragraph": "“Shaun, help me up. I feel uncomfortable all over. I want to take a bath, ” Catherine said in a low voice."
      },
      {
        "paragraph": "“Okay. I’ve already prepared your clothes.” Shaun took out a clean set of women’s clothing."
      },
      {
        "paragraph": "When Catherine got down from the bed, she felt as if her body was drained of energy. Even her legs\nwere trembling."
      },
      {
        "paragraph": "Shaun helped her into the bathroom and closed the door."
      }
    ]
  },
  {
    "title": "Chapter 1238 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“What are you doing?” Catherine was a little dumbfounded."
      },
      {
        "paragraph": "“Giving you a bath, of course. Do you have the strength to wash yourself?” Shaun rolled up his sleeves\ncasually."
      },
      {
        "paragraph": "“…Get out.” Catherine was annoyed and wanted to push him. However, her legs went weak after a few\nsteps, and she fell straight into his arms."
      },
      {
        "paragraph": "“Ahem. I won’t actually go out, but you didn’t  have to throw yourself at me like this.” Shaun smiled\nroguishly. Catherine was so angry that her face began to hurt."
      },
      {
        "paragraph": "In the end, Shaun helped her take a bath and dressed her in clean clothes before carrying her out."
      },
      {
        "paragraph": "During the whole process, Catherine felt fortunate that her face was swollen. Otherwise, her face would\ndefinitely burst from all the blushing."
      },
      {
        "paragraph": "After going out, Shaun’s phone rang. It was from Lucas and Suzie. The two children were so worried\nthat they did not sleep last night."
      },
      {
        "paragraph": "Suzie said, “ Scummy dad, how’s Mommy? Where are you now? I’m worried about Mommy.”"
      },
      {
        "paragraph": "Lucas chimed in too. “We want to see Mommy. Where are you two now?”"
      },
      {
        "paragraph": "“Your mommy is with me.”"
      },
      {
        "paragraph": "Shaun handed the phone to Catherine, and she said gently, “Darlings, Mommy is fine. Don’t worry.”"
      },
      {
        "paragraph": "“Mommy.” Suzie choked up when she heard Catherine’s voice. “Mommy, you scared us to death. Last\nnight, Uncle Logan said Wesley hurt you, and he went to scummy dad for the antidote. Were you\npoisoned? Your body is so weak now.”"
      },
      {
        "paragraph": "“What are you doing?” Catherine was a little dumbfounded."
      },
      {
        "paragraph": "Lucas said, “Did scummy dad give you the antidote? Mommy, what kind of poison did you get? Is it\nserious?”"
      },
      {
        "paragraph": "Suzie said, “Since when did scummy dad know medicine? Isn’t Uncle Chester the doctor?”"
      },
      {
        "paragraph": "“Uh…”"
      },
      {
        "paragraph": "The children talked over each other. When Catherine saw Shaun’s snickering face, she felt\nembarrassed. “Your Uncle Logan found your father so that he could send me to the hospital. After all,\nUncle Chester is a famous doctor. We wouldn’t have to queue to be hospitalized.”"
      },
      {
        "paragraph": "“I see. I thought  scummy dad had the antidote. That was amazing.” Suzie had just finished speaking\nwhen she began to cry again. “Why did Uncle Wesley poison you? He’s so evil. Mommy, we’ll go to the\nhospital now to see you.”"
      },
      {
        "paragraph": "“Don’t. Did you forget that you almost got into a car accident that day? Don’t come out. Don’t let\nMommy worry, okay? I’ll come and see you as soon as I get out of the hospital,” Catherine advised\nsoftly."
      },
      {
        "paragraph": "“Mommy, have you called the police?” Lucas said uneasily, “If Wesley hurt you, let the police arrest\nhim.”"
      },
      {
        "paragraph": "“Don’t worry. He’s already at the police station. ” Catherine did not want the children to know too much,\nso all she could do was comfort them as much as she could."
      },
      {
        "paragraph": "“I’m sorry, Mommy. I shouldn’t have… let you marry Wesley.” Lucas felt extremely guilty. “He’s a bad\nguy.”"
      },
      {
        "paragraph": "“Lucas, it’s not your  fault.  Mommy  was  also tricked. Bad people won’t show it on their faces that\nthey’re bad. You should learn from me so that you can better protect the people around you in the"
      },
      {
        "paragraph": "future.” Catherine taught him. “Stay at your grandmother’s house for the time being and don’t g o\nanywhere, okay?”"
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "After finally coaxing the two little darlings, Catherine hung up the phone to see Shaun grinning at her.\nHis eyes were gentle enough to drown her."
      },
      {
        "paragraph": "“What are you looking at?” Catherine felt annoyed a t his gaze. Especially after she had seen how ugly\nshe was in the bathroom earlier, she felt uncomfortable. “Shaun, I’m ugly. Can you stop staring at me?”"
      },
      {
        "paragraph": "“How are you ugly?” Shaun joked. “Your lips are as thick as a sausage, and it makes me want to bite it."
      },
      {
        "paragraph": "Your little face is like a freshly baked hamburger. You’re whetting an appetite…”"
      }
    ]
  },

  {
    "title": "Chapter 1239 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Shaun Hill, would you like to be beaten up?”"
      },
      {
        "paragraph": "Catherine was so angry that her lungs were about to explode. She did not know how she got the\nstrength to, but she grabbed the bouquet of flowers by the side and smashed it on his head."
      },
      {
        "paragraph": "Shaun covered his head from the assault and hurriedly dodged backward."
      },
      {
        "paragraph": "Chester came in just in time to see this scene and raised his brows teasingly. “It seems you’re\nrecovering quickly.”"
      },
      {
        "paragraph": "Catherine gloomily took a few deep breaths and used the quilt to cover her face."
      },
      {
        "paragraph": "“What’s up with her? ” Seeing her like this made Chester look at Shaun curiously."
      },
      {
        "paragraph": "It was like he saw a ghost. Shaun was clearly beaten, yet his smile was amorous and sweet, as if he\njust ate honey."
      },
      {
        "paragraph": "“Did a few screws in your head loosen because of the beating?” Chester mocked in exasperation."
      },
      {
        "paragraph": "“A superficial and feminine guy like you wouldn’t understand.” Shaun glanced at him with disdain."
      },
      {
        "paragraph": "Chester was speechless."
      },
      {
        "paragraph": "He would not understand? He had dated more women than his fingers could count, but Shaun said that\nhe would not understand?"
      },
      {
        "paragraph": "Forget it. Chester could not be bothered to bicker with him. After handing over the medicine, he said,\n“Feed it to her three times a day. I’m leaving.”"
      },
      {
        "paragraph": "He still had some self-awareness. He knew he had treated Catherine badly before, and since Catherine\nfound Cindy disagreeable too, she did not like him either."
      },
      {
        "paragraph": "“Shaun Hill, would you like to be beaten up?”"
      },
      {
        "paragraph": "After he turned and left, he suddenly heard Shaun ask, “Cathy, I heard from Logan that Charity was\nalso framed by Wesley. What happened?”"
      },
      {
        "paragraph": "The name ‘Charity’ made his long legs stop involuntarily."
      },
      {
        "paragraph": "Catherine could not be bothered to explain it to him at first. However, when she saw Chester stopped\nthere, her heart moved slightly, and she could not help but say, “Would you believe me if I told you?\nYou didn’t believe what I said three years ago.”"
      },
      {
        "paragraph": "“ I was foolish back then. From now on, I’ll believe everything you say, even if you say Chester swings\nthe other way.” Shaun’s desire for survival was very strong."
      },
      {
        "paragraph": "Chester glared at Shaun with a dark, expressionless face. “I finally know what it means to have your\nbrother choose a woman over you.”"
      },
      {
        "paragraph": "Shaun said shamelessly, “I once suffered a big loss because I didn’t listen to my wife. I’ve learned my\nlesson now.”"
      },
      {
        "paragraph": "Catherine snapped at him. “Let me remind you that"
      },
      {
        "paragraph": "I’m not your wife anymore.”"
      },
      {
        "paragraph": "“Cathy, let’s get down to business.” Shaun immediately put on a straight face. “My brain is too slow-\nwitted and can’t figure a lot of things out. I still need you to wake me up.”"
      },
      {
        "paragraph": "Chester was speechless. Shaun was so shameless now that even Chester spurned him."
      }
    ]
  },
  {
    "title": "Chapter 1240 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Catherine was also choked by his words. After a moment, she said, “Three years ago, I told you that\nRebecca was pretending to be Shelley…”"
      },
      {
        "paragraph": "Chester interrupted her. “But we did a DNA test. The one who died was Shelley. Catherine, I know you\nand Charity had a good relationship, but no one in the Neeson family is simple. You shouldn’t just think\nabout clearing her name.”"
      },
      {
        "paragraph": "Catherine was immediately annoyed by his attitude. “Previously, you said that Sarah was simple and\nkind and that Charity always bullied her. Now that you have a clear understanding of Sarah’s true\ncolors, do you think Charity could’ve bullied her? Didn’t you see I was bullied by Sarah so badly that I\nalmost committed suicide? You now know that you misunderstood me back then, so has it never\ncrossed your mind that Charity was the old me?”"
      },
      {
        "paragraph": "Chester was stunned by her words."
      },
      {
        "paragraph": "Shaun quickly agreed like a sycophant. “Cathy, you’re absolutely right. Your words have really woken\nme up. We were too prejudiced against Charity in the past.” “Yes, it was prejudice.”"
      },
      {
        "paragraph": "Catherine agreed with Shaun’. “Chester, although I don’ t know what happened between Charity and\nyou, you were prejudiced against her and decided that she was a bad woman. You were even afraid\nthat your thinking was wrong, so you found countless reasons to prove you were right, but the truth is\nthat you were too stubborn. I really don’t understand. She’s dead, yet why can’t you give her a fair\nchance?”"
      },
      {
        "paragraph": "“She’s dead?” Chester murmured. He recalled that when he went to the cemetery the other day, the\ngrave where the Neeson family’s ashes were buried was dug up."
      },
      {
        "paragraph": "“Of course she is. She jumped into the sea, and the police searched high and low for her but found\nnothing. Do you think she’s still alive?” Catherine felt a lump in her throat."
      },
      {
        "paragraph": "Catherine was also choked by his words. After a moment, she said, “Three years ago, I told you that\nRebecca was pretending to be Shelley…”"
      },
      {
        "paragraph": "Shaun did not know how to comfort her, hence all he could do was pat her back over and over."
      },
      {
        "paragraph": "Catherine returned to the main topic. “At that time, I really did test Shelley’s hair with Jeffery and\nconfirmed that they were indeed related. However, when the test was being done in Melbourne,\nRebecca’s friend from before found out."
      },
      {
        "paragraph": "“The one who died is the real Shelley because she got switched back the moment before the fire\nstarted. I had already guessed back then that Rebecca couldn’t do so many things alone. Rebecca was\njust a pawn to intensify the conflict between Shaun and me."
      },
      {
        "paragraph": "“The day before yesterday, when I was checking through Wesley’s laptop, I found he had a photo of"
      },
      {
        "paragraph": "Shelley when she was in college. He saved it before Shelley came to your side as a caregiver.”"
      },
      {
        "paragraph": "Catherine looked at Shaun. “I suspect that Wesley was secretly working for the Campos family at that\ntime. After you threw Rebecca into the ravine, she was brought back by the Campos family and\nbecame a pawn of revenge. Wesley found the real Shelley’s whereabouts and had her photo, so he\nmade Rebecca transform her face into Shelley’s through cosmetic surgery and approach you. The real\nShelley was already in their hands. When the truth was almost revealed, they pulled a trick and burned\nthe real Shelley to death instead.”"
      },
      {
        "paragraph": "Shaun and Chester were horrified."
      },
      {
        "paragraph": "What Catherine said was most probably true. Otherwise, how would Wesley, who had just come to\nCanberra, have an early photo of Shelley?"
      },
      {
        "paragraph": "Chester said with mixed feelings. “Then why did they frame Charity? Charity has nothing to do with\nthem.”"
      },
      {
        "paragraph": "Catherine glared at him frustratingly. “I realize that the two of you really become blockheads when it\ncomes to the Neesons. Have you ever thought that if Charity wasn’t the one who was framed, Shaun"
      },
      {
        "paragraph": "and I wouldn’t have fought to that point?”"
      },
      {
        "paragraph": "Shaun and Chester were stunned for a moment. However, they quickly understood."
      },
      {
        "paragraph": "Catherine said, “Charity was my friend, and I definitely wouldn’t stand knowing my good friend was\nframed. In order to save her, I’d definitely fall out with Shaun, Rodney, and you."
      },
      {
        "paragraph": "“My poor relationship with Shaun also directly affected his condition. Later, his condition deteriorated,\nand he even started to lose his memory. He had to stay in the hospital often and rarely went to the\ncompany. In fact, I had already suspected back then that the fake Shelley was adding things in his\nmilk.”"
      },
      {
        "paragraph": "Chester pondered for a while, and a shadow flashed in his eyes. “If  that’s true, maybe Shaun’s meals\nwere indeed tampered with. His condition was deteriorating too quickly back then, but I didn’t suspect it\nat first. I thought that you triggered him."
      }
    ]
  },
  {
    "title": "Chapter 1241 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "The more Shaun listened, the more shocked he was."
      },
      {
        "paragraph": "He could not help but sigh. Mason was truly sinister and cruel."
      },
      {
        "paragraph": "Perhaps he was already targeted by Mason when he went to Melbourne. Mason had been secretly\nplanning everything one step at a time."
      },
      {
        "paragraph": "He even saw through Wesley’s ambition and took the opportunity to win him over. They were both very\nshrewd people, so both Catherine and Shaun were tricked."
      },
      {
        "paragraph": "“Cathy, I’m sorry. If only I had trusted you a little more back then. We wouldn’t have ended up this way\ntoday.”"
      },
      {
        "paragraph": "“No, we would still end up like this because Sarah appeared. At that time, I thought about it. If you\ncould care so much about Sarah’s cousin, what if Sarah appeared? What I’m most afraid of still\nhappened in the end. I was completely defeated. ”"
      },
      {
        "paragraph": "Catherine said helplessly, “Before Sarah hypnotized you, you took me to a banquet. I was isolated and\nhumiliated by your brothers, but you never took my side. All of you unconditionally favored Sarah, and\nyour friends didn’t accept me. I had already lost confidence in our relationship, but I was pregnant at\nthat time, so there was nothing I could do.”"
      },
      {
        "paragraph": "Shaun looked chagrined. He could not recall a lot of what Catherine said because his memory was\ndisordered."
      },
      {
        "paragraph": "However, Chester apologized sincerely. “I’m sorry. You’re right. I was prejudiced against Charity back\nthen, and I was also prejudiced against you. I apologize to you for everything I’ve done.”"
      },
      {
        "paragraph": "Catherine’s lips twitched. “You can apologize to me since I’m still alive, but what about the dead? Poor\nCharity’s name still isn’t cleared. What’s even worse is that right after she died, her parents died too,"
      },
      {
        "paragraph": "The more Shaun listened, the more shocked he was."
      },
      {
        "paragraph": "and her mother’s ashes were replaced by a dog’s.”"
      },
      {
        "paragraph": "Chester was silent for a long time."
      },
      {
        "paragraph": "Charity’s cold and beautiful little face flashed in his mind."
      },
      {
        "paragraph": "After so many years, he found that he still remembered her appearance clearly."
      },
      {
        "paragraph": "Catherine said with reddened eyes, “Do you know? Charity told me that she had a good relationship\nwith you back then. But for some reason, even though it was always Sarah who bullied her, as soon as\nSarah cried, all of you would think it was Charity who bullied Sarah. Maybe in your eyes, Sarah is the\none who should always be protected.”"
      },
      {
        "paragraph": "Chester was at a loss."
      },
      {
        "paragraph": "There were many things they had never thought about before. After hearing Catherine’s words, it did\nseem like every time they saw Sarah crying in front of a cold-faced Charity, they thought that it was\nCharity who bullied Sarah."
      },
      {
        "paragraph": "So… it was him who misunderstood Charity all along?"
      },
      {
        "paragraph": "Charity was wrongly accused. It was he who personally found a lawyer and sent her to prison."
      },
      {
        "paragraph": "Chester turned around and left silently, without even saying goodbye."
      },
      {
        "paragraph": "He was always disgusted by Charity and did not like her. He even regretted dating her when they were\nyoung."
      },
      {
        "paragraph": "However, now that she was no longer here, Chester did not feel much pain in his heart either. It was as\nif he was numb."
      },
      {
        "paragraph": "The outside world called him a playboy who was indifferent and heartless. He abandoned women the\nmoment he got tired of playing with them, so he really did not understand what it was to love someone."
      },
      {
        "paragraph": "Chester stood in front of the window, lit a cigarette, and put it in his mouth."
      },
      {
        "paragraph": "As the smoke curled up, he remembered the taste of the first time he was with Charity in high school."
      },
      {
        "paragraph": "A young boy and girl with innocent hormones and feelings."
      },
      {
        "paragraph": "At that time, Charity’s young face was covered in a blush."
      },
      {
        "paragraph": "Later, that woman no longer remained fresh in his mind."
      },
      {
        "paragraph": "Perhaps in this life, he would never see the person named Charity Neeson again. If they met again,\nwhat should he say to her? Sorry?"
      }
    ]
  },
  {
    "title": "Chapter 1242 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "I was wrong about you?"
      },
      {
        "paragraph": "However, it was useless. The lost life would never come back."
      },
      {
        "paragraph": "In the ward."
      },
      {
        "paragraph": "Catherine did not say a word. Pain was written all over her beautiful little face."
      },
      {
        "paragraph": "Shaun carefully peeled oranges on the side. He understood that Charity was a wound for her."
      },
      {
        "paragraph": "Now, no apology would be useful. The damage was already done, so he could only make up for it."
      },
      {
        "paragraph": "“Cathy, you and I will dig out the truth of that year so that the real culprits can be punished by law.”\nShaun peeled a slice of orange and gave it to her."
      },
      {
        "paragraph": "“I have no appetite, ” Catherine said faintly. “I didn’t say all that just to blame you. I blame myself too. If\nI had been smarter back then, I wouldn’t"
      },
      {
        "paragraph": "have let Wesley frame Charity. I even got married to the person who hurt my friend.”"
      },
      {
        "paragraph": "“It’s not your fault. Wesley is too hypocritical. I even used to think of him as a loser.”"
      },
      {
        "paragraph": "Shaun mocked himself while comforting her."
      },
      {
        "paragraph": "For the next two days, Catherine stayed in the hospital."
      },
      {
        "paragraph": "She did not read the news on her phone, so she did not see the overwhelming insults against her on\nthe Internet."
      },
      {
        "paragraph": "She could handle it, but Freya could not."
      },
      {
        "paragraph": "I was wrong about you?"
      },
      {
        "paragraph": "The criticism made her furious. When she saw Catherine, she started cursing the moment  she came in\nthe door. “Those people on the Internet don’t know sh*t. They believe all sorts of rumors. I’m infuriated.\nWesley is too vicious. The most hateful thing is that the police only locked him up for five days. He got\njust five days for beating you up like this. Aren’t you mad about it?”"
      },
      {
        "paragraph": "“There’s no helping it. He turned himself in, and he has a good attitude. Besides, the Internet is siding\nwith him too, so the police won’t dare to give him such harsh punishment, ” Catherine said coldly."
      },
      {
        "paragraph": "“Why don’t you make a few statements? Just swear at them like they’re doing to you. Wesley is really\namazing. He’s been on the trending search for a few"
      },
      {
        "paragraph": "days, and the heat hasn’t died down at all.” Freya’s heart ached as she said, “You’re just like how I was\nback then. You’ll be pelted with eggs if you walk outside.”"
      },
      {
        "paragraph": "“It’s not like I’ve never been scolded before. When I was abducted by Shaun back then, I was pointed\nat wherever I went. I’m used to it.”"
      },
      {
        "paragraph": "Catherine said indifferently, “The only difference is being scolded fiercely and scolded even more\nfiercely.”"
      },
      {
        "paragraph": "“But your company’s stock has been dropping… ” Freya looked worried."
      },
      {
        "paragraph": "“That’s even less important. I’m the only shareholder of the company anyway. So even if the stocks fall,\nit’s just my money.” Catherine was calm."
      },
      {
        "paragraph": "Freya really wanted to give her a big thumbs up in admiration."
      },
      {
        "paragraph": "That mentality was simply unbeatable."
      },
      {
        "paragraph": "“By the way, how’s your pregnancy?” Catherine asked in concern."
      },
      {
        "paragraph": "“It’s fine. I’ve just been vomiting a lot recently and don’t have a good appetite.” Freya leaned into\nCatherine’s ear and glanced at Shaun who was cooking in the kitchen. “How are things going with you\ntwo? Are you getting back together? Also, does he know how to cook? Will he burn your kitchen\ndown?”"
      },
      {
        "paragraph": "Catherine’s expression grew complicated."
      },
      {
        "paragraph": "She did not know how to describe her situation with Shaun either. These days, he has been taking care"
      },
      {
        "paragraph": "of her from morning till night instead of going to the company."
      },
      {
        "paragraph": "He even washed her clothes and cooked her meals."
      },
      {
        "paragraph": "Although it could not be considered delicious, she could tell that he was attentive, and it did not taste a\ns bad as before."
      },
      {
        "paragraph": "However, getting back together with Shaun?"
      },
      {
        "paragraph": "She still could not act as if nothing had happened in the past."
      }
    ]
  },


  {
    "title": "Chapter 1243 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya rubbed her chin and said meaningfully, “I feel like with how much Shaun is clinging to you, you\nwon’t be able to pry him off for the rest of your life…”"
      },
      {
        "paragraph": "Catherine was speechless."
      },
      {
        "paragraph": "“Why don’t you just let him?” Freya sighed. “Stop fighting it. The more you struggle, the harder he\nclings onto you.”"
      },
      {
        "paragraph": "“Sis, I’m married now, okay?”"
      },
      {
        "paragraph": "Frustrated, Catherine reminded her. “What if you were me? In my first marriage, my husband was\ntaken away by another woman, and I was treated like a mental patient. In my second marriage, I\nmarried a devil and sc*mbag who beat my face into this state. Do you think I still have expectations for\nfeelings and marriage? I’m almost traumatized.”"
      },
      {
        "paragraph": "“That’s true, my poor baby.” Freya quickly reached out and hugged her in distress. “We won’t get\nmarried. We won’t find a partner. We’ll just raise"
      },
      {
        "paragraph": "our three darlings with each other in the future.”"
      },
      {
        "paragraph": "Shaun, who was chopping vegetables in the kitchen, saw the two women hugging each other, and his\nhandsome face turned black."
      },
      {
        "paragraph": "He knew they were good friends, but he still could not stand that scene."
      },
      {
        "paragraph": "“Let her go.” He could not resist coming out to warn Freya."
      },
      {
        "paragraph": "“Why?” Freya raised her chin in anger. “We’re both women who have been wounded by love. In the\nend, we’ve realized that men are unreliable. Only women can be relied on. Cathy said she wants to be"
      },
      {
        "paragraph": "Freya rubbed her chin and said meaningfully, “I feel like with how much Shaun is clinging to you, you\nwon’t be able to pry him off for the rest of your life…”"
      },
      {
        "paragraph": "with me in the future. Besides, we already have children, so we don’t need a man’s sperm to carry on\nthe family name.”"
      },
      {
        "paragraph": "“You’re crazy.” Shaun gritted his teeth. “If you want to find a woman, find someone else. Don’t pester\nher.”"
      },
      {
        "paragraph": "Freya snorted. “You’ re overthinking. The person who has been hurt most by men is Cathy. She has a\ntrauma of men. From now on, the only person"
      },
      {
        "paragraph": "she’ll like is a woman like me.” Catherine was speechless."
      },
      {
        "paragraph": "It was just a casual remark, yet Freya was able to spin such a story. Catherine was really  impressed."
      },
      {
        "paragraph": "“Okay. Visiting hours are over. You can leave now. ” Shaun  grabbed Freya and  dragged  her to the\ndoor."
      },
      {
        "paragraph": "“Shaun Hill, let go of me. How dare you lay your hands on a pregnant woman? Cathy won’t forgive\nyou…”"
      },
      {
        "paragraph": "With a ‘barn ‘, Shaun shut the door in Freya’s face."
      },
      {
        "paragraph": "“Why did you do that to my friend?” Catherine snapped at him."
      },
      {
        "paragraph": "“She has wild desires for you. I did it to put a stop t o such thoughts of hers.”"
      },
      {
        "paragraph": "Shaun said seriously, “Cathy, men are still better than women. At least, men have more strength than\nwomen. If a light bulb in the house breaks, I"
      },
      {
        "paragraph": "can change it. If the toilet is blocked, I can clear it…”"
      },
      {
        "paragraph": "“I can… call for a handyman to help with all that” Catherine was speechless."
      },
      {
        "paragraph": "Shaun raised his brows. “When you’re in a bad mood, I’ll allow you to scold me and beat me however\nyou like. When you’re tired from shopping, I can help you carry your stuff. I can also teach the children,\nprotect them, and be a good father  to them. These  can’t  be replaced by others.”"
      },
      {
        "paragraph": "“Enough.” Catherine’s head began to hurt from his words. “I’m not divorced yet, and I don’t want to\nthink about these things. Even if I do get divorced, I will stay single for a few years. I’m really fed up\nwith you men. I want to live quietly and freely by myself.”"
      },
      {
        "paragraph": "“A few years?” Shaun’s handsome face collapsed."
      },
      {
        "paragraph": "“Yes, a few years. Do you have a problem with that?” Catherine raised her eyebrows at him."
      },
      {
        "paragraph": "“Nope. Whatever you say, goes. It’s just a few years. I’ll definitely be cured by then. ” Shaun comforted\nhimself and went back to the kitchen to cook."
      }
    ]
  },
  {
    "title": "Chapter 1244 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya rubbed her chin and said meaningfully, “I feel like with how much Shaun is clinging to you, you\nwon’t be able to pry him off for the rest of your life…”"
      },
      {
        "paragraph": "Catherine was speechless."
      },
      {
        "paragraph": "“Why don’t you just let him?” Freya sighed. “Stop fighting it. The more you struggle, the harder he\nclings onto you.”"
      },
      {
        "paragraph": "“Sis, I’m married now, okay?”"
      },
      {
        "paragraph": "Frustrated, Catherine reminded her. “What if you were me? In my first marriage, my husband was\ntaken away by another woman, and I was treated like a mental patient. In my second marriage, I\nmarried a devil and sc*mbag who beat my face into this state. Do you think I still have expectations for\nfeelings and marriage? I’m almost traumatized.”"
      },
      {
        "paragraph": "“That’s true, my poor baby.” Freya quickly reached out and hugged her in distress. “We won’t get\nmarried. We won’t find a partner. We’ll just raise"
      },
      {
        "paragraph": "our three darlings with each other in the future.”"
      },
      {
        "paragraph": "Shaun, who was chopping vegetables in the kitchen, saw the two women hugging each other, and his\nhandsome face turned black."
      },
      {
        "paragraph": "He knew they were good friends, but he still could not stand that scene."
      },
      {
        "paragraph": "“Let her go.” He could not resist coming out to warn Freya."
      },
      {
        "paragraph": "“Why?” Freya raised her chin in anger. “We’re both women who have been wounded by love. In the\nend, we’ve realized that men are unreliable. Only women can be relied on. Cathy said she wants to be"
      },
      {
        "paragraph": "Freya rubbed her chin and said meaningfully, “I feel like with how much Shaun is clinging to you, you\nwon’t be able to pry him off for the rest of your life…”"
      },
      {
        "paragraph": "with me in the future. Besides, we already have children, so we don’t need a man’s sperm to carry on\nthe family name.”"
      },
      {
        "paragraph": "“You’re crazy.” Shaun gritted his teeth. “If you want to find a woman, find someone else. Don’t pester\nher.”"
      },
      {
        "paragraph": "Freya snorted. “You’ re overthinking. The person who has been hurt most by men is Cathy. She has a\ntrauma of men. From now on, the only person"
      },
      {
        "paragraph": "she’ll like is a woman like me.” Catherine was speechless."
      },
      {
        "paragraph": "It was just a casual remark, yet Freya was able to spin such a story. Catherine was really  impressed."
      },
      {
        "paragraph": "“Okay. Visiting hours are over. You can leave now. ” Shaun  grabbed Freya and  dragged  her to the\ndoor."
      },
      {
        "paragraph": "“Shaun Hill, let go of me. How dare you lay your hands on a pregnant woman? Cathy won’t forgive\nyou…”"
      },
      {
        "paragraph": "With a ‘barn ‘, Shaun shut the door in Freya’s face."
      },
      {
        "paragraph": "“Why did you do that to my friend?” Catherine snapped at him."
      },
      {
        "paragraph": "“She has wild desires for you. I did it to put a stop t o such thoughts of hers.”"
      },
      {
        "paragraph": "Shaun said seriously, “Cathy, men are still better than women. At least, men have more strength than\nwomen. If a light bulb in the house breaks, I"
      },
      {
        "paragraph": "can change it. If the toilet is blocked, I can clear it…”"
      },
      {
        "paragraph": "“I can… call for a handyman to help with all that” Catherine was speechless."
      },
      {
        "paragraph": "Shaun raised his brows. “When you’re in a bad mood, I’ll allow you to scold me and beat me however\nyou like. When you’re tired from shopping, I can help you carry your stuff. I can also teach the children,\nprotect them, and be a good father  to them. These  can’t  be replaced by others.”"
      },
      {
        "paragraph": "“Enough.” Catherine’s head began to hurt from his words. “I’m not divorced yet, and I don’t want to\nthink about these things. Even if I do get divorced, I will stay single for a few years. I’m really fed up\nwith you men. I want to live quietly and freely by myself.”"
      },
      {
        "paragraph": "“A few years?” Shaun’s handsome face collapsed."
      },
      {
        "paragraph": "“Yes, a few years. Do you have a problem with that?” Catherine raised her eyebrows at him."
      },
      {
        "paragraph": "“Nope. Whatever you say, goes. It’s just a few years. I’ll definitely be cured by then. ” Shaun comforted\nhimself and went back to the kitchen to cook."
      }
    ]
  },
  {
    "title": "Chapter 1245 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Shaun’s doting gaze stared at her, and the smile in his eyes was as sweet as honey."
      },
      {
        "paragraph": "“I don’t blame you. How can Senator Mead compare with you? He’s just a bald old man, and his\ndaughter is just a bean that’s been chewed thousands of times abroad. As for you…”"
      },
      {
        "paragraph": "His gaze stopped on a certain area of her body. “It’s nice that it’s big. A peerless beauty, right? Only\none in the entire world.”"
      },
      {
        "paragraph": "“…Pervert.” Catherine felt his crooked gaze."
      },
      {
        "paragraph": "She blushed and hurriedly pulled the quilt up while glaring at him."
      },
      {
        "paragraph": "“Those were your words.” Shaun chuckled and shrugged. “Cathy, I quite like the way you looked just\nnow, domineering and jealous.”"
      },
      {
        "paragraph": "“Who’s jealous? I just don’t like Hannah using me as a threat.” Catherine snapped at him. “Even when I\nwas chasing a man back then, I wasn’t tasteless like Hannah. Being shameless is one thing, but not\nknowing where to draw the line is another.”"
      },
      {
        "paragraph": "“Yup, I also dislike her, but… We probably offended her just now, and she would really say it to the\npublic. If someone with the Mead family reputation spreads the rumor, your reputation would…” Shaun\nhesitated to speak."
      },
      {
        "paragraph": "Catherine frowned at him. “Shaun Hill, why are you becoming more and more indecisive? Hannah even\nthreatened you just now. Where’s your once decisiveness and ruthlessness?”"
      },
      {
        "paragraph": "Embarrassment washed over Shaun’s handsome face. “ I had no weaknesses before, but now, you,\nSuzie, and Lucas are my weaknesses.”"
      },
      {
        "paragraph": "Shaun’s doting gaze stared at her, and the smile in his eyes was as sweet as honey."
      },
      {
        "paragraph": "Catherine looked at him with her clear eyes for a moment before she said, “Shaun, I don’t like being\nthreatened. You’re Lucas and Suzie’s dad, so I don’t like you being threatened easily either. Money and\nfame are fleeting. Since I came to Canberra, I’ve always been in the public’s limelight with too many\npeople scolding me. But what about it? How can they affect me besides scolding me online? If worse\ncomes to worst, I’ll take the children and leave Australia. The world is so huge. Why do I have to be\nsubject to those people?”"
      },
      {
        "paragraph": "Shaun was a little taken aback."
      },
      {
        "paragraph": "He suddenly realized that he did not understand how much she had changed."
      },
      {
        "paragraph": "However, her calm and indifferent attitude towards the future made him feel ashamed."
      },
      {
        "paragraph": "“You’re right, Cathy. If worse comes to worst, I’ll leave with you. If Australia has no place for us, we can\nlive in other countries. I’m proficient in four or five foreign languages, so I can still earn money.” Shaun\nsmiled."
      },
      {
        "paragraph": "“I didn’t say I would bring you with me.” Catherine glanced at him."
      },
      {
        "paragraph": "“Even if you don’t bring me, I’ll follow you on my own. I have legs.” Shaun grinned."
      },
      {
        "paragraph": "Catherine was speechless."
      },
      {
        "paragraph": "“Okay, it’s time to eat. I can’t let you starve.”"
      },
      {
        "paragraph": "Shaun stood up."
      },
      {
        "paragraph": "That afternoon, when Catherine got up from her nap to check her phone, [Hannah Mead’s confession"
      },
      {
        "paragraph": "] was on the top of the trending search."
      },
      {
        "paragraph": "She clicked on it to see that when Hannah was attending an event hosted by a high-end brand, the\nreporter asked her, “Ms. Mead, I heard that at your birthday party, Wesley Lyon’s wife, Catherine\nJones, sneaked around in the washroom with Shaun Hill. Is this true? Did you hear about this?”"
      },
      {
        "paragraph": "Hannah smiled sadly. “That matter is the unhappiest thing that has ever happened to me. I even fought\nwith Catherine over it. I didn’t think it’d turn out like that. It’s all my fault, and I shouldn’t have invited\nShaun. He saved me a few days before that, so I was quite grateful for him, but I didn’t expect that…\nhe and Catherine would do that. It’s no wonder I couldn’t find him the entire night.”"
      },
      {
        "paragraph": "The reporter was startled. “Ms. Mead, do you like…”"
      },
      {
        "paragraph": "“That’s enough. She won’t be answering personal questions.” Before Hannah could speak, the\nbodyguard behind her had gone up and stopped the reporter."
      },
      {
        "paragraph": "The reporter was also afraid of Hannah’s identity and did not follow up on the question."
      },
      {
        "paragraph": "However, that part was already enough for the netizens to create a heated discussion."
      }
    ]
  },
  {
    "title": "Chapter 1246 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "[So, it’s true that Catherine and Jones secretly cuckolded Wesley at Hannah’s party?]"
      },
      {
        "paragraph": "[Duh. Hannah didn’t deny it, so she basically admitted it. She just couldn’t say it too bluntly.]"
      },
      {
        "paragraph": "[F*ck. Why can I sense a hint of bitterness and sadness in Hannah’s tone? She likes Shaun, right? She\nwouldn’t have fought with Catherine otherwise."
      },
      {
        "paragraph": "[Yet another woman was harmed by that sc*mbag Shaun. I really don’t understand. He’s not the\nwealthiest man anymore, and he still has problems in that aspect. Besides being handsome, why do so\nmany women like him?]"
      },
      {
        "paragraph": "[You can’t say that. Shaun isn’t just a little handsome, he’s extremely handsome, okay?]"
      },
      {
        "paragraph": "[Anyway, I feel like Catherine and he are like cancer. They should just love and kill each other. Why do\nthey have to harm innocent and honest people?]"
      },
      {
        "paragraph": "[I feel sick when I see photos of Catherine now.]"
      },
      {
        "paragraph": "[Catherine is beautiful and seductive. Just by looking at her face, you can tell that she’s loose and\nshameless. If you’re looking for a woman, never look for someone like her because she’ll definitely\ncuckold you. Everyone can come to me if you want to see her face. My WhatsApp number is ****** *]"
      },
      {
        "paragraph": "[Iheard that Catherine has a daughter. Will her daughter grow up to be like her?]"
      },
      {
        "paragraph": "[Yeah, I heard that she’s in Sunshine Preschool. I don’t want her daughter to be in the same class as\nour sons. She definitely learned how to seduce men at an early age.]"
      },
      {
        "paragraph": "[Like mother, like daughter.]"
      },
      {
        "paragraph": "Near the end, Catherine’s expression was awful."
      },
      {
        "paragraph": "[So, it’s true that Catherine and Jones secretly cuckolded Wesley at Hannah’s party?]"
      },
      {
        "paragraph": "She did not care what people said about her, but they could not drag their children into it. That was the\none thing she would not tolerate."
      },
      {
        "paragraph": "Before long, she received a call from the preschool teacher. “Ms. Jones, could you transfer Suzie and\nLucas to a different school? I’m sorry. But because of your recent bad reputation, many parents have\ncome to the preschool to complain. They… they don’t want their children to be in the same class as"
      },
      {
        "paragraph": "Suzie and Lucas. The director also doesn’t want it to affect the school’s enrollment rate, so please can\nyou fill in the withdrawal paperwork? The tuition fee will be refunded to you.”"
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "Catherine did not want to argue."
      },
      {
        "paragraph": "If the preschool could force her children to withdraw from school because of this, it was not a good\npreschool."
      },
      {
        "paragraph": "Fortunately, the children had taken a leave of absence during this time. She could imagine that if they\nwere to go to preschool, they would definitely be attacked by many people."
      },
      {
        "paragraph": "‘Wesley, you really… crossed the line.’"
      },
      {
        "paragraph": "“Cathy, I’ve called Chester. The news and photos of Lucas and Suzy will be deleted immediately.”"
      },
      {
        "paragraph": "Shaun had noticed it too, and he explained with a cold face, “I had someone to investigate it. The\naddress and photos of Suzie’s preschool were sent out by someone who was encouraged behind the\nscenes. It should be Wesley’s doing.”"
      },
      {
        "paragraph": "“Yeah. I don’t want to drag the children into this.” Catherine closed her eyes."
      },
      {
        "paragraph": "Seeing how hard she was trying to hold back her anger, Shaun could only force himself to walk out of\nthe ward."
      },
      {
        "paragraph": "He clenched his fist in distress."
      },
      {
        "paragraph": "Then, Brennan called him. “I saw the news on the Internet. I know that the children were affected, and\nyou’re very angry. But no matter what, you have to endure it. It’s not the time to expose your strength\nyet.”"
      }
    ]
  },


  {
    "title": "Chapter 1247 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“I know.” Pain washed over Shaun’s face. “I’ve been holding it in, but I can’t even protect my woman\nand children. I feel so useless.”"
      },
      {
        "paragraph": "“This is only temporary.”"
      },
      {
        "paragraph": "Brennan said, “Wesley only dares to be so arrogant now because he has the Campos family backing\nhim. Once the Campos family falls, he’ll be reduced to nothing. By then, there’ll be plenty of\nopportunities to punish him.”"
      },
      {
        "paragraph": "“Dad, do you think… Cathy’s mom really is the mistress of Neah Bay?” Shaun suddenly whispered. “ If"
      },
      {
        "paragraph": "Wesley knows her true identity, why would he dare to hit her like this?”"
      },
      {
        "paragraph": "“About that… I was surprised too. Maybe… I was wrong?” Brennan was also suspicious."
      },
      {
        "paragraph": "“Forget it. I really do hope that you’re wrong. If her mom’s identity is that great, getting back together\nwith her might be a bigger obstacle. ” Shaun sighed."
      },
      {
        "paragraph": "After a week in the hospital."
      },
      {
        "paragraph": "Catherine was discharged."
      },
      {
        "paragraph": "On the day of discharge, the hospital entrance was packed with reporters, so Chester arranged for\nthem to leave secretly from the underground parking lot."
      },
      {
        "paragraph": "However, when they drove out of the parking lot, they were still blocked by reporters."
      },
      {
        "paragraph": "All kinds of vegetable leaves, rotten eggs, and rotten meat were thrown on the car."
      },
      {
        "paragraph": "They piled up on the car, making it hard to move."
      },
      {
        "paragraph": "“I know.” Pain washed over Shaun’s face. “I’ve been holding it in, but I can’t even protect my woman\nand children. I feel so useless.”"
      },
      {
        "paragraph": "Some people even opened the door of the driver’s seat and dragged the Yule family’s chauffeur down\nforcibly. Then, several reporters swarmed in."
      },
      {
        "paragraph": "“What are you doing? Are there still laws?” Joel was furious when he saw the group of crazy reporters."
      },
      {
        "paragraph": "The reporters simply ignored him and aimed their cameras at Shaun and Catherine. “Wow, Shaun\nreally is here. Catherine’s affair is caught red- handed.”"
      },
      {
        "paragraph": "“Haven’t you already got a shot of us when I brought her to the hospital?” Shaun grabbed the reporter’s\ncamera with a cold face. “Get out, or don’t blame me for being rude.”"
      },
      {
        "paragraph": "“Bring it on. What are you going to do? Hit us?”"
      },
      {
        "paragraph": "The reporters were unscrupulous. “You cheating couple. How dare you be so arrogant while having a n\naffair? I want to take a clear picture of you and let the world see your ugly mugs.”"
      },
      {
        "paragraph": "“You want to take a picture of us?”"
      },
      {
        "paragraph": "Catherine suddenly revealed a wry smile. After being hospitalized for the past few days, the swelling on\nher face had gone down a lot, but her petite face was still pale."
      },
      {
        "paragraph": "“Not only do I want to take pictures, but I also want to interview you…” The reporter grinned. “Are\nstolen things nicer than what you have? Have you ever loved Wesley before? He’s the man who gave\nyou everything and silently loved you, yet you used him ruthlessly and trampled over him. Don’t you\nfeel guilty at all? Have you lost all conscience? Has no one taught you morals before?”"
      },
      {
        "paragraph": "“Cathy, ignore him. I’ll drive him out.” Shaun looked at the reporters’ aggressive appearances and could\nnot stand it anymore."
      },
      {
        "paragraph": "“Why should you do that? Just let them interview me. Otherwise, they’ll hound us like dogs.”"
      },
      {
        "paragraph": "Catherine smiled brightly at the reporter. “Hey, it’s not interesting if you only ask those boring"
      },
      {
        "paragraph": "questions. Why don’t we do something more exciting?”"
      },
      {
        "paragraph": "Then, she suddenly turned Shaun’s face and forcefully kissed his thin lips."
      },
      {
        "paragraph": "Shaun, who had experienced all sorts of situations before, was also frozen."
      },
      {
        "paragraph": "Was she… sending the helve after the hatchet?"
      }
    ]
  },
  {
    "title": "Chapter 1248 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Joel, who was with Shaun and Cathy, was furious and wanted to knock his head on the door. “Cathy,\nwhat are you doing?”"
      },
      {
        "paragraph": "Some reporters were dumbfounded, while others frantically began to take photos."
      },
      {
        "paragraph": "It was the first time they met such cooperative interviewees. After they were done taking photos, they\nsuddenly came to their senses. “Are you trying to tell us clearly that you cheated in marriage?”"
      },
      {
        "paragraph": "“No, I’m trying to tell Wesley through you that I dislike him and feel disgusted by him. I’d rather be with\nShaun than continue to live with him. You all think he’s very affectionate to me, right? That’s fine. At\n8:00 a.m. tomorrow, I’ll let you all know how affectionate he is,” Catherine smiled coyly and battered her\neyelashes."
      },
      {
        "paragraph": "“What does that mean?” The reporters did not have time to react."
      },
      {
        "paragraph": "Shaun got into the driver’s seat and pushed down the reporter. He wound down the window and said to\nthe camera, “You look up to me too much. When I"
      },
      {
        "paragraph": "was attacked at the police station the last time, a certain part of me was traumatized. Since then, I have\nbeen going to a therapist for a follow-up visit every week. I can’t do anything to her. You can check and\nfind out that Chester Jewell started looking for prominent andrology doctors overseas about a month\nago.”"
      },
      {
        "paragraph": "The reporters were dumbfounded. “Don’t lie to us. Previously, you said that you couldn’t do it and went\nto the andrology department, but when you confronted Sarah Neeson in court the last time, their lawyer\npresented evidence that you bought contraceptives.”"
      },
      {
        "paragraph": "“I really can’t do it with Sarah. I had no problems with the woman I like, but I really do have issues now.\nAs I said, you’ll know if you check. I’ve been taking medicine,” Shaun said faintly."
      },
      {
        "paragraph": "“But the last time you came to the hospital with Catherine, we clearly saw she was covered with kiss\nmarks and you were too, ” the reporter said stubbornly."
      },
      {
        "paragraph": "“Yeah, those were done by me, ” Shaun nodded brazenly. “Unfortunately, I can only kiss her. I can’t do\nanything else.”"
      },
      {
        "paragraph": "“In short, Catherine cheated in marriage and you two have an unclear relationship, ” The reporter\nscolded in disdain."
      },
      {
        "paragraph": "Shaun laughed darkly. “Since I was brazen enough to snatch the bride, do you think I still care about\nmy reputation? I love her. Whether  she’s married or not, I’ll pester her forever. She’ll never escape my\nclutches in this life. Go ahead and scold me if you like.”"
      },
      {
        "paragraph": "He said this so openly and arrogantly."
      },
      {
        "paragraph": "The battle-hardened reporters were also dumbfounded."
      },
      {
        "paragraph": "Based on experience, this was not how it was supposed to go. The parties should instead do\neverything possible to distance themselves from each other."
      },
      {
        "paragraph": "“You two have no integrity. You’re a bad influence on society, ” the reporters denounced them."
      },
      {
        "paragraph": "Shaun sneered. “I only know that if it weren’t for Wesley, I’d never have broken up and divorced\nCatherine in the first place. Since three years ago, he began to provoke my relationship with Catherine\nsecretly. He’s scheming and calculating yet acts like a gentleman. I’ll uncover the true face of that\nhypocrite sooner or later.”"
      },
      {
        "paragraph": "He then started the car. When he saw that the reporters were still not making way, he floored the\naccelerator."
      },
      {
        "paragraph": "The revving of the engine scared away the reporters."
      },
      {
        "paragraph": "Shaun smiled mockingly. After shifting gears, the car drove away unimpeded."
      },
      {
        "paragraph": "In the car."
      },
      {
        "paragraph": "Joel wanted to explode in anger from these two people."
      },
      {
        "paragraph": "“Cathy, what the hell were you thinking? Haven’t you been scolded enough already? You even kissed\nhim in front of the reporters. Are you actually thinking of getting back together with him?”"
      },
      {
        "paragraph": "“As for you, Shaun, why are you like a ghost that won’t stop haunting her? You can’t do it anymore, so\nwhy can’t you let my daughter go? Do you want to trample her for life?” Shaun did not say anything and\nlet Joel rebuke him."
      }
    ]
  },
  {
    "title": "Chapter 1249 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "When Catherine’s ears felt like they would fall off from all the nagging, she could not help but say, “\nDad, can’t you see? The reporters won’t believe me no matter what I say, so there’s no need to hide it.\n”"
      },
      {
        "paragraph": "“You…” Joel was choked. “But you can’ t just kiss him in front of the camera. Are there no men left in\nthe world? Hasn’t he hurt you enough?”"
      },
      {
        "paragraph": "Shaun looked hurt and called out softly, “Dad…”"
      },
      {
        "paragraph": "“Stop. Who are you calling dad? I don’t have a son or a son-in-law like you,” Joel said furiously."
      },
      {
        "paragraph": "“Uncle Joel…”"
      },
      {
        "paragraph": "Shaun could only change his address by how agitated Joel was. “ It was my fault in the past. It’s\nunderstandable for you to scold me, but you can’t push all the blame on me. As Cathy’s father, you\ndidn’t find a good son-in-law and let her marry a scumbag like Wesley who hit women.”"
      },
      {
        "paragraph": "Joel was once again speechless to hear Shaun’s words."
      },
      {
        "paragraph": "It was embarrassing. Yes, what Shaun said was true."
      },
      {
        "paragraph": "As a father, he was a complete failure."
      },
      {
        "paragraph": "In the past, he always praised Wesley, but Wesley ended up being a scumbag."
      },
      {
        "paragraph": "“Cathy, it’s Dad’s fault. Dad is muddle —headed,” Joel sighed deeply. “After this incident, I feel like\nthere aren’t many good men in this world. I won’t ask you to marry in the future anymore. Move back"
      },
      {
        "paragraph": "home and Dad will accompany you and take care of you. I won’t feel at ease if you marry another man.\nIt’s better if I take care of you myself.”"
      },
      {
        "paragraph": "“Okay, Dad. I don’t plan on marrying anymore either,” Catherine nodded seriously."
      },
      {
        "paragraph": "Shaun’s heart jumped out in fright. “Uncle Joel, you can’t say that. You’re already in your fifties. You\ncan’t accompany Cathy forever. One day, you’ll leave before her.”"
      },
      {
        "paragraph": "“Then she still has her children,” Joel said coldly. “ When I die, Suzie and Lucas would have grown up.\nIt’s also their responsibility as children to take care of her.”"
      },
      {
        "paragraph": "“But they’ll also have a wife or husband and kids. Cathy still needs to find a reliable husband. I’m the\nbest choice. I know my roots inside out…”"
      },
      {
        "paragraph": "“Yeah, you know your roots too well, ” Joel chuckled and looked at him. “You know that your roots are\nbroken too.”                   1"
      },
      {
        "paragraph": "Shaun. “….”"
      },
      {
        "paragraph": "Catherine saw Shuan’s beaten appearance and looked out the window with a snicker. Her dad was\nunexpectedly humorous."
      },
      {
        "paragraph": "When they reached the Yule villa, Shaun was ruthlessly driven away by Joel."
      },
      {
        "paragraph": "Catherine chatted with Suzie and Lucas via video call for a long time before looking up the latest\nsearch trend."
      },
      {
        "paragraph": "The video of Shaun and her at the hospital reached more than one billion views."
      },
      {
        "paragraph": "[Catherine Jones is so rampant. She’s so arrogant even when having an affair. She’ll have retribution\nsooner or later.]"
      },
      {
        "paragraph": "[Wesley is such a gentleman, but she still belittled him. She’s too shameless.]"
      },
      {
        "paragraph": "[No, what did Catherine and Shaun mean by those words? Were they hinting that Wesley is a\nhypocrite?]"
      },
      {
        "paragraph": "[To the commenter above, don’t be fooled by Catherine. That woman is trying to smear mud at others\nto divert attention away from her, but we all"
      },
      {
        "paragraph": "have sharp eyes.]"
      },
      {
        "paragraph": "[Catherine said she’ll let us know something at 8:00 a.m. I think she must have gotten ahold of\nsomething for her to say such a thing.]"
      },
      {
        "paragraph": "[No matter what she reveals, it’s best if we don’t believe it. In any case, it’s a fact that she betrayed her\nhusband.]"
      },
      {
        "paragraph": "If it were Catherine Jones from three years ago, she would be so angry at the netizen’s words that she\nwould want to vomit blood."
      },
      {
        "paragraph": "However, she had to admit that her heart now was much stronger. She was no longer someone who\ncould be swayed emotionally by others."
      },
      {
        "paragraph": "Her phone rang suddenly."
      },
      {
        "paragraph": "She looked down at the phone and a coldness flashed from her eyes. She answered the call and"
      },
      {
        "paragraph": "Wesley’s voice could be heard in an extraordinarily gentle tone, “Cathy, let’s meet.”"
      }
    ]
  }
]