[


  {
    "title": "Chapter 1050 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Sarah was too much of a b*tch."
      },
      {
        "paragraph": "She was so much of a btch that Shaun wanted to shoot himself. Was he blind? How could he not see\nwhat a btch she was?"
      },
      {
        "paragraph": "“Rodney, you’ll be ruined by this woman sooner or later,” Shaun said through gritted teeth."
      },
      {
        "paragraph": "“ Shaun, how did you become like this? It’s fine if you don’ t want her, but you don’ t let me be with her\neither.” Rodney frowned deeply. “Sarah is where I draw the line, and if this happens again, I’ll call the\npolice. It doesn’t matter if we used to be brothers, I’ll let everything be solved according to the law.”"
      },
      {
        "paragraph": "“Fine.” Shaun nodded, almost dying from anger. “I won’t talk nonsense with you. Sarah Neeson, I just\nwant to tell you that within two days, give back to me all the money I once gave you, including all the\nmoney that I spent for you in these three days. If you’re not willing, I’ll send you an attorney’s letter.”"
      },
      {
        "paragraph": "Sarah said ruefully, “Shaun, are you still the Shaun I know?”"
      },
      {
        "paragraph": "Rodney was furious. “Shaun Hill, you’re too f*cking shameless. You have the nerve to take back what\nyou gave?”"
      },
      {
        "paragraph": "“Why not? I never f*cking touched her, but I gave her 1oo billion and funded Neeson Corporation for\nthree years. I let her live a high life. Hah, these years, I’d rather donate all that money than giving i t to\nher.”"
      },
      {
        "paragraph": "Shaun sneered and got into the car with Hadley, and left."
      },
      {
        "paragraph": "Sarah grew anxious. “Rodney, how did Shaun suddenly become like this? I took all that money and\ninvested it. I never thought he would want it back.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“I never thought that Shaun was so shameless.” Rodney patted her on the shoulder, not knowing what to\nsay. “If he really appeals and with his influence, who can beat him?”"
      },
      {
        "paragraph": "Colors drained from Sarah’s face. Asking her to return all the money was the same as asking for her life."
      },
      {
        "paragraph": "Without that money, how could she lead a luxurious life in the future? The rich ladies in the capital would\nnever fawn over her again."
      },
      {
        "paragraph": "“But last time, he went to court with Catherine and lost…”"
      },
      {
        "paragraph": "“That was because he didn’t argue. With his eloquence in court, he can make it so a dead person is said\nto be alive.”"
      },
      {
        "paragraph": "Rodney thought about it and said, “I’ll discuss it with Chester and let him persuade Shaun. If it doesn’t\nwork, just forget it and hand him back the real estate. We’ll keep our distance from him in the future. At\nmost… we’ll cut ties with him.”"
      },
      {
        "paragraph": "Rodney felt that the current Shaun was too disappointing."
      },
      {
        "paragraph": "Sarah wanted to vomit blood."
      },
      {
        "paragraph": "The real estate was worth tens of billions. In the end, it was just Rodney who was too useless."
      },
      {
        "paragraph": "When Shaun returned to the company, he immediately submitted the indictment."
      },
      {
        "paragraph": "Chester came to Hill Corporation that afternoon. He looked at Shaun with a heavy expression. “"
      },
      {
        "paragraph": "Shaun, are you short of money now? You could’ve told me. I’m your brother. I’ll lend you as much as I\ncan.”"
      },
      {
        "paragraph": "Shaun shook his head. “With how Hill Corporation is now, it can’t immediately improve just by investing\nmoney in it. I just… don’t want to give the money to Sarah. She’s unworthy. A vicious woman like her"
      },
      {
        "paragraph": "doesn’t deserve to live in this world at all.”"
      }
    ]
  },
  {
    "title": "Chapter 1051 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "When Shaun spoke, his pupils only held a cold hostility."
      },
      {
        "paragraph": "It was disgust and hatred that Chester had never seen before."
      },
      {
        "paragraph": "He could not understand why Shaun suddenly hated Sarah so much. Was it because of the kidnapping\ncase with Logan before? He only had his suspicions though, as there was no other evidence to prove\nthat Sarah was behind it."
      },
      {
        "paragraph": "“What exactly happened?” Chester asked."
      },
      {
        "paragraph": "“Would you believe me if I said it?” Shaun smiled cynically. “Rodney believes her. He doesn’t believe me\nat all.”"
      },
      {
        "paragraph": "Chester’s handsome eyebrows frowned slightly. “ Tell me. Rodney loves Sarah too much. When it comes\nto emotions, there are some things that can’t be calmly analyzed.”"
      },
      {
        "paragraph": "“Wasn’t I like that before too?” Shaun sneered and pointed at his own brain. “Three years ago, Sarah\nhypnotized me when she was treating me. I asked Professor Lincoln who treated me when I was young.”"
      },
      {
        "paragraph": "“There’s an ancient type of hypnosis in Country Y that can tamper with someone’s feelings like a robot.\nThen, you can weave what you want them to feel, and stuff it into the person to change them. Now, do\nyou understand why I suddenly wanted to get a divorce and be with Sarah three years ago? ”"
      },
      {
        "paragraph": "Chester was a little stunned. “Are you overthinking it? If it were true, wouldn’t you have caught on to it\nbefore?”"
      },
      {
        "paragraph": "“Yes, that’s actually what’s terrifying about this hypnosis. Didn’t you say that I used to eat KFC with\nCatherine, and I broke the legs of Young Master Kelly and the others for her? I began to find something"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "was off, so I went to Melbourne to investigate. I found Chase and the nanny who used t o cook for me in\nMelbourne.”"
      },
      {
        "paragraph": "“What they knew and saw were completely different from the memories I have in my mind. My memories\nwere full of Catherine’s faults, and those memories made me hate her. I thought that she approached me\nbecause she was vain and she coveted my status!”"
      },
      {
        "paragraph": "“My impression of her in my head was of an extremely vicious woman, and there’s no memory of me\never loving her.”"
      },
      {
        "paragraph": "Shaun smiled sadly. “Chester, I know myself. If I loved her before, even if I don’t like her anymore, I\nwould never be so cruel to someone who is pregnant with my child. At that time, my mind only had a love\nfor Sarah. She did so much for me, so I had to be with her."
      },
      {
        "paragraph": "“But in the past three years, every time I tried to touch her, I physically felt nauseated and vomited. She\nhypnotized my brain, but my body subconsciously resisted her. I didn’t have any problem when I touched\nCatherine.”"
      },
      {
        "paragraph": "Chester could not wrap his brain around what he was hearing. As a doctor, it was the first time he heard\nabout something like this. “Could it be a coincidence? Or maybe it was done by others.”"
      },
      {
        "paragraph": "“No, it had to be her. None of my other feelings were tampered with except that I suddenly fell in love\nwith Sarah. After my feelings changed, Sarah was the only one who benefitted from it."
      },
      {
        "paragraph": "Furthermore, Professor Lincoln said that the person who did it must be someone I completely trusted,\notherwise it wouldn’t have succeeded! ”"
      },
      {
        "paragraph": "“The success rate was also very, very low. If it had failed, I would’ve become a retard.”"
      },
      {
        "paragraph": "Shaun smiled bitterly. “That’s not all. It is not treatable because the success rate of the treatment i s even\nlower. It’s only 0.01%. If it fails, I’ll also become a retard.”"
      },
      {
        "paragraph": "Chester’s expression was conflicted and despondent. It was no wonder Rodney did not believe Shaun. It\nwas too outrageous."
      },
      {
        "paragraph": "Hadley could not help but say, “Young Master Jewell, Eldest Young Master is right. In fact, Ms. Jones and\nI noticed three years ago that something was off with the Eldest Young Master. We asked top\npsychologists and doctors and they all said the same thing, so we gave up trying to treat him. Little did\nwe expect that he would suddenly break the spell now.”"
      },
      {
        "paragraph": "“Chester, you and Rodney weren’t with me all the time unlike Hadley and Cathy, who lived under the\nsame roof as me every day. That’s probably why you didn’t notice.”"
      },
      {
        "paragraph": "Shaun said faintly, “Moreover, I’ve been with Sarah for more than ten years, so it’s normal that you guys\nthink I haven’t forgotten her, but think about it, did I ever forget memories about Rodney and you?”"
      }
    ]
  },
  {
    "title": "Chapter 1052 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Chester was shocked by this realization."
      },
      {
        "paragraph": "Indeed, when the three of them got together, Shaun still remembered his old friends. He was only\nconfused when it came to Catherine."
      },
      {
        "paragraph": "“If what you’re saying is true, then Sarah… is beyond terrible.” Chester shuddered. He had seen many\nnarrow-minded women, but never someone a s good in deceiving as Sarah."
      },
      {
        "paragraph": "“No, she’s not terrible. She’s vicious.” Shaun sneered. “Professor Lincoln said that no one dared t o\nattempt this hypnosis because of the failure rate and also because it was almost inhumane, yet she used\nit on me. She said that she loved me, but she still did it despite being aware that I would become a retard\nif it failed.”"
      },
      {
        "paragraph": "“Then, do you think… she’ll use it on Rodney too?” Chester asked hesitantly."
      },
      {
        "paragraph": "“Does she need to? Isn’t it clear that Rodney is focused on her whole -heartedly?” Shaun said in a deep\nvoice, “In the past, I used to think that it was good for Sarah and Rodney to be together.”"
      },
      {
        "paragraph": "“After all, Rodney loves her. But Sarah isn’t a good woman. She doesn’t like Rodney. What she likes is\nthe Snow family’s background. She’s not someone who’s content with her own lot.”"
      },
      {
        "paragraph": "“Are you talking about Lucifer?”"
      },
      {
        "paragraph": "Shaun raised his brows. “She’s full of lies. I believed her then when she said that she was forced by\nLucifer, but I don’t believe her now. If you ask me, she probably slept with Lucifer willingly. She said she\nfell into the hands of kidnappers when she disappeared in the States for so many years, but I don’t\nbelieve it.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Chester quietly waited for him to continue."
      },
      {
        "paragraph": "“Think about it. At that time, the bodies of her classmates and friends were found, but hers wasn’t. We\ntrusted her before, so we were convinced of whatever she said. What if she was full of lies?”"
      },
      {
        "paragraph": "Shaun guessed, “ She said Lucifer threatened her with a few photos, but in fact, we all know about what\nhappened to her in that incident back then. If I minded, I wouldn’t propose to marry her at all. It’s very\nlikely that Lucifer didn’t just use some photos! ”"
      },
      {
        "paragraph": "“She might have willingly slept with those kidnappers in order to stay alive back then! ”"
      },
      {
        "paragraph": "Chester was once again shocked."
      },
      {
        "paragraph": "However, after thinking about it carefully, it was not impossible."
      },
      {
        "paragraph": "“It’s a shame that Lucifer is dead. There’s no evidence.”"
      },
      {
        "paragraph": "“Yes, he’s dead. That’s the most terrible and fishy thing.” Shaun said thoughtfully."
      },
      {
        "paragraph": "Chester was silent for a long time."
      },
      {
        "paragraph": "He had to admit that he treated Sarah as his sister, so he needed time to digest all these revelations\nproperly."
      },
      {
        "paragraph": "“There’s one more thing, ” Hadley spoke suddenly. “Eldest Young Master, three years ago, when you\nwere still your normal self, you suddenly told me to go to the funeral home to take Jennifer Craven’s\nashes to the lab for testing. I was shocked at that time but I did as you said, and found out that Jennifer’s\nashes didn’t belong to a human at all.”"
      },
      {
        "paragraph": "Chester was shocked. “If it wasn’t human, then what was it?”"
      },
      {
        "paragraph": "Shaun murmured, “I think… you’ve mentioned that before.”"
      }
    ]
  },
  {
    "title": "Chapter 1053 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Yes, but you were hypnotized thereafter and threw a fit when I told you about it. That was also the time\nwhen I sensed that something was very wrong, but I didn’t dare to bring it up again.”"
      },
      {
        "paragraph": "Hadley added, “At that time, you probably suspected that Sarah exchanged Jennifer’s ashes and told me\nto investigate. The people from the appraisal department said that it might be the ashes of a cat or dog.”"
      },
      {
        "paragraph": "“Sarah changed Jennifer’s ashes to a cat or dog’s?” Chester completely froze."
      },
      {
        "paragraph": "He admitted that the word “kind” should never be used to describe him, but to replace the ashes of\nsomeone who died with those of a dog’s, how demented could that person be? “So the urn that was\nburied with Sarah’s father is just… an animal’s ashes?”"
      },
      {
        "paragraph": "“You could say that.” Hadley nodded."
      },
      {
        "paragraph": "Shaun and Chester were both speechless at the same time."
      },
      {
        "paragraph": "After a long silence, Chester said in a low voice, “ Maybe… it was done by Thomas.”"
      },
      {
        "paragraph": "“You don’t believe that she would be that bad?”"
      },
      {
        "paragraph": "Shaun did not dare to believe Sarah anymore. “I’ve known her the longest, but she would risk ruining me\nby hypnotizing me. What happened with Logan was also definitely her handiwork. Is Thomas that\nsmart?”"
      },
      {
        "paragraph": "“Yes well, Thomas is bad but from the way he manages Nesson Corporation, you can tell that he’s\nbrainless. If he had a brain, Neeson wouldn’t have stagnated even with me supporting them for so many\nyears. If we hadn’t repeatedly bailed him out, he would have gone to prison long ago.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Chester gave a long sigh. “We’ve known Sarah for more than ten years. In my heart, she has always\nbeen a very kind girl. When did she change? Is it because she experienced too many things in the few\nyears she was in the United States?”"
      },
      {
        "paragraph": "“Maybe she changed, or maybe… she’s always been this way and we just didn’t see it. She’s the best at\ndisguising herself.”"
      },
      {
        "paragraph": "Shaun suddenly said, “Thinking about it, when we were young, we always targeted Charity in order to\nprotect Sarah because we thought that she always bullied Sarah. Maybe…”"
      },
      {
        "paragraph": "Chester’s handsome face suddenly changed. The name ‘Charity’ was taboo to him. “You think it was\nSarah who framed Charity too?”"
      },
      {
        "paragraph": "Shaun looked at him conflictingly. “I don’t know."
      },
      {
        "paragraph": "That’s just my speculation.”"
      },
      {
        "paragraph": "“Sarah is bad, so Charity won’t be any better either.” Chester’s face showed disgust. “Don’t forget that\nshe had people burn Shelley to death. It’s clear that she’s also a vicious person.”"
      },
      {
        "paragraph": "Shaun pursed his thin lips and did not speak."
      },
      {
        "paragraph": "Chester took off his glasses and pinched his eyebrows. “Thomas, Sarah, Charity. Those three people\naren’t any better than each other. They’re all bad people.”"
      },
      {
        "paragraph": "Just as he finished, Rodney called him."
      },
      {
        "paragraph": "Chester looked at the phone but did not answer."
      },
      {
        "paragraph": "Shaun reminded him, “Rodney should be calling you to persuade me. Sarah must be pushing him from\nbehind. There’s no way she’ll return the money to me. She loves money and power. Ever since she met\nus, she’s been used to living the life of someone who stands above the rest.”"
      },
      {
        "paragraph": "In the end, Chester did not pick up the phone. He drove and left Hill Corporation."
      },
      {
        "paragraph": "In the past, he was a very calm person, but at that moment, his mind was thinking about what Shaun\nsaid."
      },
      {
        "paragraph": "Maybe…"
      },
      {
        "paragraph": "What did Shaun try to say? Maybe Charity never bullied Sarah before, and it was all an act directed and\norchestrated by Sarah?"
      },
      {
        "paragraph": "Hah. Where was the proof?"
      },
      {
        "paragraph": "Just because they were not biological sisters?"
      },
      {
        "paragraph": "The car was on the road for a while until he finally turned the steering wheel to go to the cemetery on the\noutskirts of the capital."
      },
      {
        "paragraph": "When he arrived at Boris and Jennifer’s tombstones, he saw that they had been exhumed. The two urns\ninside were missing."
      }
    ]
  },
  {
    "title": "Chapter 1054 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Chester’s deep eyes sank."
      },
      {
        "paragraph": "After kneeling by their resting place for a long time, he finally got up and went to look for the grave\nkeeper at the foot of the mountain."
      },
      {
        "paragraph": "The person was surprised to hear that the urns were exhumed. “That’s insane. Who would steal\nsomeone else’s ashes?”"
      },
      {
        "paragraph": "Chester’s eyes flickered in surprise."
      },
      {
        "paragraph": "Yes, no one would be senseless enough to steal ashes."
      },
      {
        "paragraph": "Unless that person was a relative or a family member who did not want the deceased to be buried here."
      },
      {
        "paragraph": "Or maybe the person already knew that the urn buried beside Boris’ was not Jennifer’s."
      },
      {
        "paragraph": "It was impossible for it to be Thomas or Sarah because they were the ones who placed it there in the first\nplace. The only other possibility was…"
      },
      {
        "paragraph": "Charity!"
      },
      {
        "paragraph": "She was not dead. She came back."
      },
      {
        "paragraph": "Chester pulled out a cigarette from his trousers pocket and lit one. The smoke haloed around his delicate\nbrows. “Let me ask you. Has a young and beautiful woman visited in the past few years?”"
      },
      {
        "paragraph": "“It’s not All Souls’ Day anytime soon so no one comes around. How would there be a young and\nbeautiful woman?” The grave keeper checked the computer. “The plots you mentioned have no contact\ndetails listed. If you’re here to pay your respects to them, can you contact her family?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Chester was stunned. “There’s no contact details listed? Does the family of that grave usually come to\nvisit?”"
      },
      {
        "paragraph": "“I’m not sure. There are always a lot of people visiting during All Souls’ Day. The only thing I remember is\nthat there’s a beautiful and young woman who seems to come every year.” The grave keeper recalled\nand said."
      },
      {
        "paragraph": "“Does she look like this?” Chester found a group photo of Sarah and them in his phone."
      },
      {
        "paragraph": "“No.”"
      },
      {
        "paragraph": "The grave keeper shook his head. “That girl has big eyes, like… like someone who was of mixed\ndescent."
      },
      {
        "paragraph": "She visits the graves every year. This year, she brought another beautiful woman about her age. She\nwasn’t here during All Souls’ Day, hence I could recall clearly, but I remember that she got into a fight\nwith a pair of siblings, a brother and sister, during her last visit. Oh, I remember now. This woman was\none of the siblings.”"
      },
      {
        "paragraph": "Chester guessed that the young beauty who looked like someone who was of mixed descent should be\nFreya Lynch."
      },
      {
        "paragraph": "In fact, he did not know much about Freya. However, if she insisted on visiting the graves of two\ndeceased elders who were not her relatives every year, it meant that Freya was someone who cared\nabout human ties."
      },
      {
        "paragraph": "If Rodney could marry Freya, she would be much better than Sarah."
      },
      {
        "paragraph": "“What about the brother and sister? Have you seen them before?” He asked."
      },
      {
        "paragraph": "The grave keeper shook his head. “I have no recollection of them. I saw them for the first time this year.”"
      },
      {
        "paragraph": "“Thank you.”"
      },
      {
        "paragraph": "When Chester left the cemetery, he took the initiative to call Rodney. “If you called me because of Shaun,\nthen don’t bother. I won’t get involved. Do you think Sarah would really feel at ease by taking Shaun’s\n100 billion?”"
      },
      {
        "paragraph": "These days, Catherine was busy spending time with Lucas and Suzie."
      },
      {
        "paragraph": "During the weekend, she took her two children to the beach with Wesley for a staycation."
      },
      {
        "paragraph": "When she returned, Shaun made headlines again. News on [Shaun Hill’s attorney’s letter to recover 100\nbillion breakup fee from his ex-girlfriend] was abuzz."
      },
      {
        "paragraph": "Of course, there were many people on the Internet scolding him. [Are you even a man? Aren’t you\nembarrassed to ask someone to return the money you gave?]"
      },
      {
        "paragraph": "[Sarah is really unlucky to have met you. You wasted her youth and now you want to recover your\nexpenses.]"
      },
      {
        "paragraph": "[I heard that all the jewelry and expenses spent on Sarah in the past few years will have to be\ncompensated. Isn’t that a bit too much?"
      }
    ]
  },
  {
    "title": "Chapter 1055 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "However, some netizens thought Shaun was doing the right thing. [Oh my God. loo billion for a\nrelationship. God, please give me a relationship like this. Never mind my youth from more than a decade\nago, I’m willing to have this relationship even if it drags on to my middle-age.] \n[Is Sarah made of gold? 1oo billion. Not even the most beautiful woman in the world is as expensive a s\nher. Even the richest person in the world wouldn’t be so expensive to date, right?]"
      },
      {
        "paragraph": "[Well, I used to sympathize with Sarah. I was blind. She’s the luckiest woman in the world.]"
      },
      {
        "paragraph": "[I used to call Shaun a scumbag every day, but I won’t scold him anymore. Holy sh*t, 1oo billion as a\nbreakup fee. Who the hell wouldn’t want to date him?]"
      },
      {
        "paragraph": "[Now the key point is that Shaun wants to get back the 1oo billion. It shows that he’s not that generous.\nEveryone seems to be focusing on the wrong thing.]"
      },
      {
        "paragraph": "[Please, if nothing happened to Hill Corporation and they didn’t have problems with their funding, Shaun\nwouldn’t have come back for that 100 billion."
      },
      {
        "paragraph": "[I feel like it’s really too much for Sarah to take 1oo billion. At least return half of it.]"
      },
      {
        "paragraph": "[Just half of it is already 500 million. It’s enough for her to live an extravagant and wealthy life. But I’m\nguessing Sarah won’t do it. Otherwise, why would Shaun send her an attorney’s letter?]"
      },
      {
        "paragraph": "[Why do I suddenly feel like Sarah is fake? Did she really love Shaun? I’m guessing she just went in for\nthe money.]"
      },
      {
        "paragraph": "[Duh? If Shaun wasn’t the richest man, would Sarah pester and love him? I don’t believe that true love\nexists in this world.]"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine was shocked."
      },
      {
        "paragraph": "Shaun actually went to Sarah to get back his 1oo billion breakup fee?"
      },
      {
        "paragraph": "That was too strange. Even if he was broke and ladened with debts, a man like Shaun would never ask\nhis ex to return the breakup fee. Furthermore, it was Sarah. Could he bear to do that to her?"
      },
      {
        "paragraph": "However, that amount really… made her sad."
      },
      {
        "paragraph": "She also dated him and gave birth to his children, but she did not get a single cent when they divorced."
      },
      {
        "paragraph": "Compared to Sarah, she really…"
      },
      {
        "paragraph": "Forget it. She could not think about it. The more she thought about it, the more speechless she became."
      },
      {
        "paragraph": "What made her even more speechless was that as the netizens were discussing, Shaun made a public\nstatement. [Sarah and I dated for more than ten years, but nothing happened between us in those ten\nyears. That was because when I was young, I was too preoccupied with work, and Sarah and I were too\nyoung when we started dating. That’s why we’ve always maintained a platonic relationship."
      },
      {
        "paragraph": "[In the following three years, something wrong happened to my body, so I had undergone physical and\npsychological examinations. The following are records of my physical examination. In addition, I didn’t\nmean to waste Ms. Neeson’s youth. In these three years, I realized that I was in poor health and\nsuggested breaking up on multiple occasions, but Ms. Neeson refused. Now, I just want to recover the\n100 billion I gave her after breaking up.]"
      },
      {
        "paragraph": "Then, Shaun uploaded several medical certificates from hospital examinations and a medical report"
      },
      {
        "paragraph": "that was handwritten by a doctor, complete with a timestamp and the name of the hospital."
      },
      {
        "paragraph": "The netizens exploded again."
      },
      {
        "paragraph": "[So in the end, what Eldest Young Master Hill is saying is that… he can’t… get it up? That scared me to\ndeath.]"
      },
      {
        "paragraph": "[Eldest Young Master taking back this 1oo billion is throwing caution to the wind.]"
      },
      {
        "paragraph": "[The key point is that Eldest Young Master spent 100 billion to let a woman live an extravagant life, and\nhe has never even touched her before. Doesn’t Sarah feel bad by accepting that money?]"
      },
      {
        "paragraph": "[What’s there to feel bad about? She doesn’t even mind that Eldest Young Master’s body can’t function.\nIt’s clear that she went to him for the money. I won’t believe that she loves Eldest Young Master so much\nthat she’s willing to never bed him."
      },
      {
        "paragraph": "[That’s true. If she has money, she can find fresh meat outside anytime. We were too stupid for\nsympathizing with a woman worth hundreds of millions. We were even worried that she would suffer.]"
      },
      {
        "paragraph": "[No, I’m just curious if Eldest Young Master is only unreactive to Sarah. Is he like that with Catherine\ntoo?]"
      },
      {
        "paragraph": "[That’s true. Did he just stare at Catherine when he took her captive back then?]"
      }
    ]
  },
  {
    "title": "Chapter 1056 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "[Probably, since Catherine didn’t sue him. In any case, Eldest Young Master can’t get it up. His love life is\nso complicated.]"
      },
      {
        "paragraph": "Once again, Catherine was dragged into this chaotic love triangle. She had no clue as to what Shaun\nwas thinking."
      },
      {
        "paragraph": "Was this what it meant to send the helve after the hatchet?"
      },
      {
        "paragraph": "Not only were the netizens gossiping, her best friend Freya, who was also passionate about gossip, soon\ncalled her. “Babe, I’ll treat you to dinner tonight. We haven’t met in so long. I miss you.”"
      },
      {
        "paragraph": "Catherine rolled her eyes to the sky. “We just met two days ago. I don’t miss you at all.”"
      },
      {
        "paragraph": "“Come on, don’t be like that. I’ll treat you to the most expensive Japanese cuisine in Canberra.” Freya\nchuckled."
      },
      {
        "paragraph": "In the end, Catherine agreed to the meetup."
      },
      {
        "paragraph": "Freya respectfully poured tea for her. “ Shaun really can’t get it up?”"
      },
      {
        "paragraph": "“Pfft.” Freya was too direct and Catherine almost choked at that. “Are you done?”"
      },
      {
        "paragraph": "“Hehe, I was just curious. What is Shaun planning?” Freya whispered, “Rodney didn’t come for two days\nafter this outburst. I heard from his secretary’s office saying that he has been contacting the world’s top\nlawyers these days.”"
      },
      {
        "paragraph": "“And?”"
      },
      {
        "paragraph": "“And they all ignored him.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Freya could not help but rejoice in his suffering. “ The world’s top lawyers only serve the world’s richest\npeople. But some renowned lawyers came to offer their services. It’s probably because they thought\nShaun was no longer the same after he lost his last lawsuit to the third-rate lawyer you hired. ”"
      },
      {
        "paragraph": "“Rodney is probably trying to find a lawyer for Sarah.”"
      },
      {
        "paragraph": "Catherine shook her head. “This lawsuit can’t be won. Firstly, the amount is too large. Secondly, Shaun\nhas no evidence that he never touched Sarah. The two of them don’t have a marriage certificate s o the\njudge won’t necessarily order Sarah to return"
      },
      {
        "paragraph": "100 billion to Shaun. At most, Sarah would be left with one billion.”"
      },
      {
        "paragraph": "“Yeah, 1oo billion. Shaun’s brain must have been waterlogged for him to give her that much.”"
      },
      {
        "paragraph": "Freya shook her head. “He dared to give it to her, she dared to take it, and she’s not willing to pay back a\ndime for it. What’s confounding is that Rodney is stupid enough to look for a lawyer for Sarah. Isn’t he\nafraid of others accusing him of colluding with Sarah to take Shaun’s 1oo billion for themselves?”"
      },
      {
        "paragraph": "She put a slice of sashimi in her mouth as she spoke."
      },
      {
        "paragraph": "However, after tasting a slice, a great sense of nausea came surging."
      },
      {
        "paragraph": "She quickly took the trash can by her feet and vomited."
      },
      {
        "paragraph": "“What’s wrong?” Catherine had a bad feeling as she watched Freya. “Are you… pregnant?”"
      },
      {
        "paragraph": "“Don’t be crazy.”"
      },
      {
        "paragraph": "Freya rolled her eyes. “I took the contraceptives. Maybe it’s because I’m not feeling well.”"
      },
      {
        "paragraph": "“If it were in the past, you would have no problems finishing a plate of sashimi.” Catherine was someone\nwho had experienced it before. Her"
      },
      {
        "paragraph": "expression was tense. “Not all contraceptives are effective. Sometimes, there might be tadpoles that slip\nthrough the net. Let me ask you. Have you gotten your period this month?”"
      },
      {
        "paragraph": "Freya’s complexion drained at those words. She was in fact more than a week late this month, but she\nusually had irregular periods."
      },
      {
        "paragraph": "“Stop eating.” Catherine took away the sashimi in front of Freya when she did not respond and replaced\nit with cooked food."
      }
    ]
  },
  {
    "title": "Chapter 1057 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Freya was about to cry. “Don’t frighten me. I don’t want to be pregnant with that stupid Rodney’s child.\nWill it be harmful to my child if he inherits Rodney’s IQ?”"
      },
      {
        "paragraph": "“Don’t say that. He just has zero emotional intelligence but his business acumen is still good.” Catherine\ncomforted her."
      },
      {
        "paragraph": "“Shut up.” Freya’s brain was frazzled."
      },
      {
        "paragraph": "“Just eat tempura today.” Catherine gave her a prawn. “ I’ll accompany you to the hospital to get an\nultrasound after eating.”"
      },
      {
        "paragraph": "“I’m not in the mood to eat anymore.”"
      },
      {
        "paragraph": "Freya was horrified. “I’ve never had a bloody child before. Is abortion extremely painful? I’m scared of\npain the most.”"
      },
      {
        "paragraph": "“If it’s still early, then abortion shouldn’t be painful.” Catherine comforted her."
      },
      {
        "paragraph": "However, Freya lost her appetite and she could not endure the smell of fish at all."
      },
      {
        "paragraph": "After dinner, Catherine brought her to the hospital emergency room. They ran a blood test and an\nultrasound."
      },
      {
        "paragraph": "Catherine waited outside the room after the ultrasound and Freya followed suit five minutes later with a\npale white face. “Holy sh*t. The doctor said I’m pregnant.”"
      },
      {
        "paragraph": "Catherine’s expression sank, and she said after a moment, “Abort it.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "She suffered too much when she was with Shaun. Back then, she could not compete with Sarah at all,\nmuch less Freya. Furthermore, Rodney was severely brainwashed by Sarah, and Sarah was the only\none i n his heart. There would be no benefit at all if Freya gave birth to this child."
      },
      {
        "paragraph": "“…Okay.” Freya nodded quickly."
      },
      {
        "paragraph": "Despite being afraid of going through an abortion, Freya knew that keeping the child would do her no\ngood."
      },
      {
        "paragraph": "She really wanted nothing more than to strangle those two idiots, Thomas and Rodney."
      },
      {
        "paragraph": "After seeing the ER doctor, he said, “If you want to abort it, go to the obstetrics and gynecology\ndepartment tomorrow to make an appointment. ”"
      },
      {
        "paragraph": "The two ladies exited the emergency room. At that same moment, Chester appeared with several\nhospital executives on the other side of the hallway. His long legs stalled when he saw Catherine and\nFreya."
      },
      {
        "paragraph": "“Young Master Jewell, thanks to your guidance in our hospital, this patient could be saved…” The dean\nhad not finished speaking when he suddenly saw Chester stopped in his tracks and looked ahead.\n“Young Master Jewell, did you see someone you “Yeah, help me ask what those two came to the\nhospital for.”"
      },
      {
        "paragraph": "Chester turned around and spoke. “No problem. I’ll call you later when I find out.” The dean smiled and\nescorted him to the car."
      },
      {
        "paragraph": "While in the car, the dean called. “I found out what they came for. One of the two women, a patient called\nFreya Lynch, had a checkup. The doctor found out that she’s one month pregnant.”"
      },
      {
        "paragraph": "“What?” Chester was startled. “Are you sure?” “Yes, but it seems that she wants to abort the child. I\nheard that she’ll be coming to the OBGYN department tomorrow morning to make an"
      },
      {
        "paragraph": "appointment for the abortion.” “I got it. Thank you.”"
      },
      {
        "paragraph": "Chester frowned. According to the timeline, that child should be Rodney’s. He did not expect Freya to get\npregnant."
      },
      {
        "paragraph": "After hesitating for a long time, he dug up Jessica Snow’s number and called her. Although it might be\nunfair to Freya, it would only hurt Freya if Rodney continued to get involved with Sarah. This was a\nchance for him to leave Sarah."
      }
    ]
  },
  {
    "title": "Chapter 1058 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "Catherine took a day off to accompany Freya to the obstetrics and gynecology unit."
      },
      {
        "paragraph": "After looking at the ultrasound and blood test reports, the doctor said, “If you want to have an abortion,\nyou can do it this afternoon.”"
      },
      {
        "paragraph": "“This afternoon?” Freya widened her eyes. “So soon She thought it would take a few days, so she had\nyet to brace herself mentally. “Will it hurt badly?”"
      },
      {
        "paragraph": "“Pain is inevitable. If you’re really afraid of pain, you can choose to be anesthetized.”"
      },
      {
        "paragraph": "“Anesthetize me, then.” Freya nodded in a daze."
      },
      {
        "paragraph": "As soon as she walked out of the consulting room, she suddenly faced Wendy, Jessica, and Jason who\nwere waiting outside."
      },
      {
        "paragraph": "“Freya, I heard you’re pregnant.”"
      },
      {
        "paragraph": "Beaming with joy, Wendy walked to her. She was already in her 5os. Her friends had all become"
      },
      {
        "paragraph": "grandmothers. Only her two sons had yet to give her a grandchild. Yesterday, when she learned that\nFreya was pregnant, she was so excited that she did not sleep the whole night."
      },
      {
        "paragraph": "“Aunty Wendy, how did you all find out?” Freya was at her wit’s end. The situation gave her a sense of\nforeboding."
      },
      {
        "paragraph": "“When you came to do a prenatal test yesterday, a close family member of ours spotted you.” However,\nJessica did not reveal that it was Chester."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine and Freya exchanged glances and remained silent."
      },
      {
        "paragraph": "Yesterday, the two of them had deliberately chosen to come to this hospital as it did not belong to the\nJewell family and they were afraid of being spotted. Nevertheless, they still failed to keep it a secret."
      },
      {
        "paragraph": "Needless to say, the Snow family would definitely stop Freya from having an abortion."
      },
      {
        "paragraph": "Jason gazed at her imploringly. “Freya, keep this child. We’ll immediately arrange a grand wedding for\nyou and Rodney. Rodney has a responsibility to you.”"
      },
      {
        "paragraph": "“Yeah. You’re already his fiancée.” Wendy nodded. “ As long as you’re willing to keep the child, we’ll\nagree to whatever request you make.”"
      },
      {
        "paragraph": "Freya shook her head. “Uncle Jason, Aunty Wendy, Aunty Jessica, I know all of you treat me well but I\nreally don’t want to marry Rodney. I agreed to get engaged before this as an act of expediency to solve\nthe serious issue that night. We’re not a good match. If I give birth to this child, they’ll suffer a lot. I don’t\nwant them to be born in an incomplete family.”"
      },
      {
        "paragraph": "Her words caused Wendy to be uneasy. “Freya, Rodney was just careless. He’ll see through Sarah’s true\ncolors sooner or later.”"
      },
      {
        "paragraph": "“How soon?”"
      },
      {
        "paragraph": "Catherine could not resist chipping in, “Rodney is madly in love with Sarah. He won’t even make a good\nfather. He doesn’t have a sense of responsibility to the family either. This is obvious enough from how\nhe’s refusing to listen to his parents and insisting on being with Sarah. To him, love takes priority over\nothers. What’s more, Sarah isn’t someone to be taken lightly.”"
      },
      {
        "paragraph": "“Uncle Jason, Aunty Wendy, Aunty Jessica, I’m not desperate for money.”"
      },
      {
        "paragraph": "Freya added earnestly, “I won’t change my mind even if you try to persuade me using shares and money.\nIn fact, 1oo million, 1oo billion, and a"
      },
      {
        "paragraph": "trillion dollars make little difference to me. Although my family isn’t as wealthy as the Snow family, I’m\ncontent with what I have.”"
      },
      {
        "paragraph": "Jason sighed. Freya’s words made him think highly of her."
      },
      {
        "paragraph": "This was the kind of person who was raised in a peaceful, blessed, and rich family. However, Rodney\nfailed to appreciate this woman. What a pity."
      },
      {
        "paragraph": "“If you want the Lynch family to collapse, go ahead and abort the child, ” Jessica said out of the blue."
      },
      {
        "paragraph": "“What do you mean?” Freya stared at Jessica, feeling exasperated. They were both women, so why was\nshe acting like the devil?"
      },
      {
        "paragraph": "“Perhaps money and power can’t really move you, but what about your family?” With her pretty face,\nJessica continued indifferently, “I can make your family’s years of hard work go down the drain. I can let\nyour family experience the misery of being strapped for cash and unable to spend their remaining years\npeacefully. With our ability, we can make it happen by simply giving an order.”"
      },
      {
        "paragraph": "“Are you the devil?” Freya could no longer tolerate her."
      }
    ]
  },
  {
    "title": "Chapter 1059 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Jessica acted as if she did not hear Freya’s yell. She remained calm and said arrogantly, “If you give\nbirth to the child, not only will I make sure that the Lynch family will live without worries, but I’ll also allow\nyou guys to rise to greater heights."
      },
      {
        "paragraph": "“You’ll be able to own ten percent of the shares in Snow Corporation. Of course, you can choose not to\nmarry Rodney, or marry him and divorce him later.”"
      },
      {
        "paragraph": "“When all is said and done, you guys are just trying t o push me to give birth to this child.”"
      },
      {
        "paragraph": "With that, Freya went mad. “It’s just a matter of pregnancy. You guys can even get a random woman to\nbecome pregnant with Rodney’s child. By then, it won’t be one pregnancy per month. If he does it with\nmany women, he can easily get them pregnant and you’ll have ten children on the way within a month.”"
      },
      {
        "paragraph": "Wendy sighed. “This is the first grandchild in the Snow family. We really hope that they can come into\nthis world. Freya, since this child happens to be in your belly, it signifies the destiny between the two of\nyou.”"
      },
      {
        "paragraph": "Freya gave a bitter laugh. “To me, it’s like a tiny tadpole now. I can’t even treat it as a child.”"
      },
      {
        "paragraph": "“Freya, I’ll make Rodney take responsibility for you, ” Jason persuaded her sincerely."
      },
      {
        "paragraph": "Jessica said impassively, “Remember what I said. If the child is gone, you have to bear the\nconsequences on your own.”"
      },
      {
        "paragraph": "Freya almost broke down and went insane. She simply did not want the child. She did not want it. What\ndid she do in her last life that had caused her to provoke the Snow family?"
      },
      {
        "paragraph": "“Freya, go home with us.” Wendy approached her to hold her hand."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "However, Freya shunned her and turned around without looking back at the Snows. She pulled\nCatherine along and left straight away."
      },
      {
        "paragraph": "Her cold figure left Wendy feeling terrible. “I’ve only forced two people in my life —one is Rodney, and\nthe other is Freya. I really don’t want to force Freya, but I just hope she can save Rodney from Sarah’s\nclutches.”"
      },
      {
        "paragraph": "The recent incident of Shaun demanding 1oo billion dollars from Sarah had caused an uproar among the\nwealthy families in Canberra."
      },
      {
        "paragraph": "Shaun had never slept with Sarah. He had even assisted Neeson Corporation for years. Although Sarah\ncheated on him, when they broke up, Sarah actually took 1oo billion dollars from Shaun. How brilliant\nand terrifying this woman must be!"
      },
      {
        "paragraph": "Unfortunately, Wendy’s silly son seemed to have been bewitched. He dumped his pretty fiancée, and his\nlife revolved around Sarah."
      },
      {
        "paragraph": "Wendy was left with no alternative. She was trying to count on the child to make Rodney realize his duty\nas a father."
      },
      {
        "paragraph": "“Jessica, why did you behave that way earlier?” Jason cast a helpless look at his daughter."
      },
      {
        "paragraph": "Jessica bit her scarlet lip. “Dad, Mom, I’ve always been the bad person in our family. This is my last time\nstanding up for Rodney, that dumb*ss. I won’t meddle in his affairs anymore.”"
      },
      {
        "paragraph": "Jessica swung around and left without looking back. She often maintained an arrogant, upright figure,\nwhich made others see her as a cruel female devil."
      },
      {
        "paragraph": "When she turned, her shoulders relaxed and exuded an inexplicable sense of fatigue."
      },
      {
        "paragraph": "Nobody knew that she actually did not wish to be a bad person."
      },
      {
        "paragraph": "However, Old Master Snow had told her that her parents and brother were too kind and gentle."
      },
      {
        "paragraph": "Although members like them could be in the Snow family, a person as sharp as a razor was needed to\nremove the obstacles for the Snow family and help Nathan rise to the top."
      },
      {
        "paragraph": "Living in the Snow family, this was her only choice."
      }
    ]
  },
  {
    "title": "Chapter 1060 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Two hours later."
      },
      {
        "paragraph": "Rodney was urgently called back to the Snow family’s villa."
      },
      {
        "paragraph": "“Grandpa, why did you call me back so urgently? What’s the matter? Hurry up and tell me. I still have a\nlot of company matters to deal with.” Rodney lied. He actually planned to look for Shaun in Hill\nCorporation later."
      },
      {
        "paragraph": "F*ck! How dare Shaun issue Sarah an attorney’s letter? Was Shaun insane because he was strapped for\ncash?"
      },
      {
        "paragraph": "“It’s been three days since you last returned to the office. All you’ve been doing every day is spending\ntime with Sarah. What a shame that you mentioned the company’s matters.” Looking at Rodney’s\nalluringly handsome face, Old Master Snow felt a strong urge to slap him to death."
      },
      {
        "paragraph": "Why did he have such an incapable eldest grandchild?"
      },
      {
        "paragraph": "“How do you guys know? Freya, that big mouth, told you guys, didn’t she?” Rodney suddenly lost his\ntemper."
      },
      {
        "paragraph": "“Shut up! Freya didn’t say anything about you.”"
      },
      {
        "paragraph": "Jason could not help slapping the table. He took a deep breath before he said, “Freya went to the\nhospital for a prenatal test yesterday and a close family member of ours spotted her. Only then did we\nfind out that she has been pregnant for over a month. The child is yours, so you need to get ready and\nmarry her immediately.”"
      },
      {
        "paragraph": "“How can this be?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Rodney’s handsome face became ferocious all of a sudden. “Freya must have done it on purpose. I\nmade that woman take a contraceptive pill last time and she told me she took it. It turns out that she lied\nto me. I understand now. She pretended as if she didn’t want to marry into the Snow family to make me\nlower my guard. What a scheming woman she is! I’m sure she deliberately let that close family member\nof ours spot her doing the prenatal test as well.”"
      },
      {
        "paragraph": "Unable to bring herself to listen to Rodney anymore, Wendy slapped him in the face."
      },
      {
        "paragraph": "“Mom, you slapped me?”"
      },
      {
        "paragraph": "Rodney found it unbelievable. Wendy had loved him the most since he was young. She would never\nhave slapped him. “Is it because you’ve been fed lies by Freya Lynch? Because of her, you’re even\nslapping your biological son now.”"
      },
      {
        "paragraph": "Wendy shook. “Are you out of your mind? It’s alright if you were beaten silly after getting slapped, but\nyou’ve become so foolish instead.”"
      },
      {
        "paragraph": "Old Master Snow said furiously, “The person who spotted Freya doing the prenatal test was your buddy,\nChester. He happened to be guiding a clinical surgery in Delmont Hospital yesterday. So, tell me how\nFreya planned to let us discover it?"
      },
      {
        "paragraph": "“What’s more, Freya made an appointment to have an abortion today. It was your mom and sister who\nreceived the news and dealt with the matter. Freya herself is set on aborting the child, but your sister\nthreatened her with the Lynch family. Rodney, you’re biased against Freya. That’s why you keep thinking\nthat she’s plotting something. You should not be biased anymore. She’s a truly nice woman.”"
      },
      {
        "paragraph": "Rodney’s mouth twitched. Fine, perhaps it was a stretch to say that Freya was a scheming woman. “\nWhy did Chester let you all know about this matter? He should’ve told me.”"
      },
      {
        "paragraph": "“If he told you, would you have stopped Freya from aborting the child?”"
      },
      {
        "paragraph": "Jason snorted. “Obviously, Chester hoped that we would stop Freya from aborting the child. Think about\nit. Your buddy used to support you in getting together with Sarah, but why does he support Freya now?\nIt’s because he can tell that Sarah isn’t a simple woman. Can’t you see things clearly yet?”"
      },
      {
        "paragraph": "“I don’t want to hear you guys throwing mud at Sarah. Regardless, I won’t marry Freya. I agreed to marry\nher previously just because you guys threatened me.”"
      },
      {
        "paragraph": "Rodney added in annoyance, “Moreover, she lied to me when she said that she took the contraceptive\npill. She’s clearly a scheming woman.”"
      },
      {
        "paragraph": "“You’re wrong. She did take the pill.”"
      },
      {
        "paragraph": "Old Master Snow suddenly sighed. “It was your sister who asked the staff at the pharmacy to switch the\npills. Rodney, as a man, you should at least have a sense of responsibility. Did she seduce you to sleep\nwith her? No. It was Thomas who tricked her and even caused her to be pregnant now. Have you\nseriously thought about it? That this is your child? You’re going to be a father.”"
      }
    ]
  },
  {
    "title": "Chapter 1061 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Father…"
      },
      {
        "paragraph": "All of a sudden, this word startled Rodney for a moment."
      },
      {
        "paragraph": "Wendy said earnestly, “Yes. You might’ve only contributed a sperm, but the child is now around one\ncentimeter long. You’ve probably thought of making her abort the child, but have you ever thought how\nmuch damage an abortion will bring to a woman’s body?"
      },
      {
        "paragraph": "“It’s all too easy for you to say that because you’re not the one suffering the pain. A woman’s body will be\ndamaged after going through an abortion. Some women even experience different kinds of complications\nor have difficulty getting pregnant again."
      },
      {
        "paragraph": "“Besides, have you thought that if her future boyfriend or husband finds out that she had previously\naborted another man’s baby, how would they see her? Put yourself in her shoes. If you learn that your\nfuture wife used to be pregnant with another man’s child, will you be upset?”"
      },
      {
        "paragraph": "Rodney kept quiet when listening to those words."
      },
      {
        "paragraph": "He was not inherently mean. After Wendy advised him in detail, a twinge of confusion and guilt crept into\nhis mind."
      },
      {
        "paragraph": "Back then, he had thought about marrying a random woman to satisfy his parents’ wishes if Sarah and\nShaun got married."
      },
      {
        "paragraph": "Later, Sarah and Shaun got a divorce. Rodney had sworn to make this woman happy."
      },
      {
        "paragraph": "Nevertheless, another woman was currently pregnant with his child."
      },
      {
        "paragraph": "What should he do now?"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Old Master Snow said in a calm voice, “Rodney, I’ve always taught you that men must have a sense of\nresponsibility. If you don’t even have a basic sense of responsibility, how are you going to earn other\npeople’s trust and respect in your business and career? When it comes to relationships, you don’t listen\nto us. The bottom line is, we won’t accept irresponsible descendants.”"
      },
      {
        "paragraph": "Rodney was shocked."
      },
      {
        "paragraph": "Old Master Snow had mentioned a few times that if Rodney ended up with Sarah, he would disown him."
      },
      {
        "paragraph": "Nevertheless, Old Master Snow had only said it out of fury back then. Right now, he was calm and\ndetermined."
      },
      {
        "paragraph": "Rodney knew that Old Master Snow had always hated irresponsible and unfaithful men the most."
      },
      {
        "paragraph": "“Between your child and Sarah, choose either one. If you choose Sarah, don’t ever step into the Snow\nfamily’s house anymore. We’ll have nothing to do with each other. You don’t have to contact or visit us\nduring the holidays either. You don’t have to send us messages as well. We’ll also publicly announce that\nyou’re kicked out of the Snow family.”"
      },
      {
        "paragraph": "Finally, Jason said, “Anyway, your mom and I still have two other children, Jessica and Carson. Let me\nadvise you beforehand that you shouldn’t use the Snow family’s name out there if you decide to choose\nSarah.”"
      },
      {
        "paragraph": "Wendy said, “Make your own choice.”"
      },
      {
        "paragraph": "No one from the Snow family spoke afterward."
      },
      {
        "paragraph": "Rodney stood there in a daze, and nobody could be bothered about him. He had no choice but to walk\nout alone."
      },
      {
        "paragraph": "When he stepped out of the house, his legs were both trembling."
      },
      {
        "paragraph": "He turned around and glanced at the Snow household’s gate. Never had he thought that he would one\nday fall into such a state?"
      },
      {
        "paragraph": "He could not help but go to the hospital to vent his anger on Chester. “Why didn’t you tell me about\nFreya’s matter first? Instead, you let my family members know about it. Do you know how miserable I am\nright now? Are you still my buddy? Sarah grew up with us. Don’ t you want to see her happy?”"
      },
      {
        "paragraph": "Chester was looking down and flipping through a medical record when he said, “Rodney, I’m your body\nso of course, I won’t frame you. Freya is a better match for you.”"
      },
      {
        "paragraph": "“You must be… crazy.”"
      },
      {
        "paragraph": "Rodney said in a huff, “If she’s a good woman, why don’t you get together with her? Is it because Shaun\nbadmouthed Sarah?”"
      },
      {
        "paragraph": "“Freya is pregnant with your child.”"
      },
      {
        "paragraph": "Chester closed the medical record. His eyes behind his glasses carried a sense of tranquility. “Rodney,\nmen don’t use their brains when they’re in love."
      },
      {
        "paragraph": "You think that Sarah is nice in many ways. But if she’s nice, why isn’t she willing to return even a penny\nto Shaun now that he’s in a difficult situation?"
      },
      {
        "paragraph": "“It’s… It’s not because she doesn’t want to return it. It’s just that she has placed all the money in a\nclosed-end fund and can’t withdraw it.”"
      },
      {
        "paragraph": "Rodney responded evasively, “What’s more, she hates Shaun deep down. Why should she return the\nmoney to Shaun when he has wasted more than ten years of her youth?”"
      }
    ]
  },
  {
    "title": "Chapter 1062 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Chester snorted. “Fine. You’re just biased against Sarah. But let me remind you that once you get out o f\nthe Snow family, Sarah will leave you sooner or later.”"
      },
      {
        "paragraph": "“You’re bullsh*tting.”"
      },
      {
        "paragraph": "Rodney could not help but yell at him, “Chester Jewell, you’re just like Shaun! Why have you guys\nbecome like this? The five of us grew up together, yet you guys are discriminating against Sarah.”"
      },
      {
        "paragraph": "“Yes, the whole world is discriminating against Sarah and you’re the only one who is defending her.\nYou’re clear-headed, and something is wrong with everyone else. Then go and fight against the world for\nher sake. Also, personally kill your own child.”"
      },
      {
        "paragraph": "Chester became annoyed. “I’m going to perform surgery now. I’m not free to talk to you.”"
      },
      {
        "paragraph": "As soon as he finished speaking, he strode out with an impassive face."
      },
      {
        "paragraph": "Indeed, talking to Rodney made his blood boil. Chester began to feel a little sympathetic toward Freya."
      },
      {
        "paragraph": "Rodney then walked out of the doctor’s office. He walked down the stairs in a soulless manner."
      },
      {
        "paragraph": "When he got down, he happened to be at the pediatrics unit."
      },
      {
        "paragraph": "A father in his 30s who was hugging a pretty baby walked past him. The one -year-old baby had large\ndark eyes. Nevertheless, she looked listless, probably because she was sick. Even so, she looked very\ncute."
      },
      {
        "paragraph": "The father gently calmed her, saying, “Don’t be scared, baby. The doctor is just going to take a look a t\nyour throat. He won’t give you a shot…”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Somehow, Rodney felt a tight sensation in his heart. Was he going to kill a cute baby like her?"
      },
      {
        "paragraph": "F*ck."
      },
      {
        "paragraph": "As he drove the car in distress, he arrived at the gate of Freya’s house without him realizing it."
      },
      {
        "paragraph": "After he pressed the doorbell, someone pushed the door open from inside."
      },
      {
        "paragraph": "Dressed in a pink shirt and a pair of jeans, Freya fixed her fierce eyes on him."
      },
      {
        "paragraph": "“Why are you glaring at me?” Rodney was aggrieved. He wanted to glower at her as well, considering\nthat he was a victim."
      },
      {
        "paragraph": "“You got me pregnant and your family doesn’t allow me to abort the child. Who should I glare at if not\nyou?” The instant Freya saw him, she flew into a rage."
      },
      {
        "paragraph": "Rodney touched his nose. Indeed, it was Jessica, that b*stard, who secretly switched out Freya’s pill,\ncausing her to be pregnant. “It’s all because you couldn’t resist throwing yourself at me at that time. If\nyou had resisted your urges, you wouldn’t be pregnant now.”"
      },
      {
        "paragraph": "“Then don’t call Thomas over. Don’t call me over to your company to develop a new product for you. ”"
      },
      {
        "paragraph": "Freya lost her temper. “Rodney Snow, are you actually a man? Can you stop passing the buck?”"
      },
      {
        "paragraph": "“If I weren’t a man, how could I have gotten you pregnant?” Rodney mocked her."
      },
      {
        "paragraph": "“I mean… As a man, you must take responsibility for your actions.”"
      },
      {
        "paragraph": "Freya replied moodily, “You never have the courage to admit your actions. You even shift the blame to\nothers. Why does the Snow family have such a member like you?”"
      },
      {
        "paragraph": "Old Master Snow’s words came to him all of a sudden. Rodney pursed his thin lips with discomfort."
      },
      {
        "paragraph": "Was he such a disgrace to the Snow family?"
      },
      {
        "paragraph": "Upon noticing that he was not uttering a word, Freya could not be bothered about him. She turned\naround and walked back to her coffee table to continue having pickles."
      },
      {
        "paragraph": "After Rodney entered the house, the smell of pickles drifted into his nostrils and nearly made him vomit.\n“Freya Lynch, why are you feeding my baby that sort of processed food? Are you trying to suffocate it\nwith that nasty smell?”"
      }
    ]
  },
  {
    "title": "Chapter 1063 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Freya furrowed her brows. She previously disliked eating pickles and even wondered why so many\npeople enjoyed eating such gross food."
      },
      {
        "paragraph": "Nevertheless, she realized that she had become addicted to it this month."
      },
      {
        "paragraph": "Only at this point did it hit her that her pregnancy was the reason for it."
      },
      {
        "paragraph": "“You’re wrong. I only started liking pickles when I got pregnant. It’s the baby who wants to have them, ”\nshe replied in a self-righteous manner."
      },
      {
        "paragraph": "“My baby won’t love to eat such gross food.” Without hesitation, Rodney took the jar away and threw all\nthe pickles into the garbage bin."
      },
      {
        "paragraph": "Freya erupted with rage. “Rodney Snow, do you know how pricey a jar of pickles is? It cost over ten\ndollars.”"
      },
      {
        "paragraph": "Rodney was at a loss for words. “That’s pricey, huh? You’re staying in a duplex apartment worth\nhundreds of billions of dollars and receiving a"
      },
      {
        "paragraph": "monthly pay of hundreds of thousands of dollars. You also have 1oo million dollars in the card that Osher\nCorporation gave you the other day. How dare you say the pickles are pricey?!”"
      },
      {
        "paragraph": "“ Still, they’re pricey. The pickles in packets that I usually have cost only five dollars.”"
      },
      {
        "paragraph": "“Shut your mouth.”"
      },
      {
        "paragraph": "Rodney was fed up with her. “Freya Lynch, I’m warning you not to eat such processed food anymore as\nit’ll harm my child.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Your child?” Freya repeated with red eyes. “This child shouldn’t even exist. If your family hadn’t stopped\nme, I would’ve aborted it already.”"
      },
      {
        "paragraph": "Deep down, Rodney felt terrible as Wendy’s words came to him. “The child is already one centimeter\nlong. They’re a living being too. When you make such a remark, the child will hear it and feel bad. ”"
      },
      {
        "paragraph": "Freya was stunned."
      },
      {
        "paragraph": "The child could feel bad even though they were only one centimeter long?"
      },
      {
        "paragraph": "Was he treating her like a fool?"
      },
      {
        "paragraph": "Anyway, it was just strange to hear Rodney say things like these."
      },
      {
        "paragraph": "“Are you thinking about keeping the child? It’d be very out of character of you to do this.”"
      },
      {
        "paragraph": "Freya asked oddly, “Aren’t you the kind who can go as far as denying your connections with everyone\nelse and turning against the world for Sarah’s sake? Your biological parents don’t even have a place in\nyour heart, much less your child. If Sarah asked you to eat sh*t, you’d even do it right away, wouldn’t\nyou?”"
      },
      {
        "paragraph": "Rodney was speechless."
      },
      {
        "paragraph": "Damn. He nearly went mad. Had he been acting like a f*cking idiot?"
      },
      {
        "paragraph": "Upon noticing that he had stopped talking, Freya persuaded him. “Rodney Snow, I know you’ve always\ndisliked me but we should team up and turn against others at this moment. You must help me tell your\nfamily that any woman out there can give birth to a child. They don’t necessarily have to make me do it.”"
      },
      {
        "paragraph": "“Of course, I wish for this too. I did advise them, but my grandpa said…”"
      },
      {
        "paragraph": "Rodney’s alluringly beautiful eyes revealed a hint of bitterness and loneliness. “He said if I don’t take\nresponsibility, I’ll no longer be a part of the Snow family. My dad will even break family ties with me and\nexpose it to the public.”"
      },
      {
        "paragraph": "“Go ahead and break your family ties, then.”"
      },
      {
        "paragraph": "Freya said in a light-hearted manner, “You’re the sort who puts love above everything else. Romantic\nrelationships are the only thing in your brain. You were born to be the male lead in romance novels since\nyou can sacrifice everything for love— ”"
      },
      {
        "paragraph": "“Just zip it if you don’t know what to say.” Rodney wished he could shut her mouth."
      },
      {
        "paragraph": "He actually did it by covering her mouth using his hand."
      },
      {
        "paragraph": "His hand was big, whereas her face was small. Therefore, his palm covered half of her face, which felt\nsoft and smooth. Her face was also tender and bouncy. He could not help but squeeze her face lightly,\nletting him feel a different sensation."
      },
      {
        "paragraph": "“Freya, you have such a small face…” The man touched her face."
      },
      {
        "paragraph": "No matter how shameless Freya was, her face still flushed in spite of herself."
      },
      {
        "paragraph": "She yanked his hand away and glared at him with her eyes. “Rodney Snow, can you stop touching my\nface? You’re behaving like a hooligan.”"
      },
      {
        "paragraph": "“I… Hooligan?” Rodney was astounded. When he reflected on his action and realized that he had indeed\ntouched her subconsciously just now, a blush of shame crept up his handsome face."
      },
      {
        "paragraph": "“I just don’t want to hear you speak. Your voice is terrible.”"
      },
      {
        "paragraph": "“It’s the same for me. When I hear your voice, my head hurts.”"
      },
      {
        "paragraph": "The noise coming out of his mouth caused Freya’s head to hurt. She was hungry earlier. Now that all her\npickles had been thrown away, she felt even hungrier."
      }
    ]
  },
  {
    "title": "Chapter 1064 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“I don’t care. Since you’ve thrown my pickles away, you have to cook for me. I’m hungry.”"
      },
      {
        "paragraph": "Rodney glanced at Freya’s stomach. Initially, he did not want to cook for her, but he was worried that\nFreya would bring the little tadpole in her out to eat unhygienic food. In the end, he surrendered to his\nfate and decided to cook for her."
      },
      {
        "paragraph": "Nevertheless, when he opened her refrigerator, he did not find any ingredients except for pasta."
      },
      {
        "paragraph": "He let out a sigh. “Freya Lynch, you’re a woman. Can’t you behave more like a housewife? You don’t\neven have eggs at home. No man would want to live with you.”"
      },
      {
        "paragraph": "“I eat in the office every day. I’ve been working like a dog for you, yet you still expect me to come back\nand cook after I finish working overtime? Do I have so much spare time?”"
      },
      {
        "paragraph": "Freya criticized him in a self-righteous way, “Don’t look at me like that. Sarah isn’t any better than me.\nShe even hired a housekeeper, didn’t she?”"
      },
      {
        "paragraph": "“You’re bullsh*tting. She cooks on her own sometimes.”"
      },
      {
        "paragraph": "“Hah! Do you mean once a week? I can do that too.”"
      },
      {
        "paragraph": "Rodney kept quiet when that point was brought up. Evidently, he had failed to convince her."
      },
      {
        "paragraph": "He ended up cooking her pasta. When he was cooking, Freya reminded him, “Add more chili sauce.”"
      },
      {
        "paragraph": "Rodney was struck by a thought. He had heard that if a pregnant woman craved spicy food, she might\nbe pregnant with a girl. On the other hand, craving for sour food was a sign of having a boy."
      },
      {
        "paragraph": "Could the baby in her belly be a girl?"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Rodney was not a conservative man who would demand to have a baby boy to carry on the family\nlineage. In fact, it was nice to have a girl too. If the child could be as pretty as Freya, she would look"
      },
      {
        "paragraph": "like a doll. However, if she got Freya’s fiery temper as well…"
      },
      {
        "paragraph": "Hold on. Stop."
      },
      {
        "paragraph": "What was he thinking?"
      },
      {
        "paragraph": "He was actually thinking about how the baby would look after they were born? What about Sarah,\nthen?"
      },
      {
        "paragraph": "1:00 P.M."
      },
      {
        "paragraph": "Rodney cooked two plates of butter pasta without adding any chili sauce to them."
      },
      {
        "paragraph": "After glancing at the pasta, Freya walked into the kitchen and opened the cabinet above. She was\nabout to take a bottle of chili sauce."
      },
      {
        "paragraph": "Before she could take the sauce, a tall shadow enveloped her from behind. Rodney pulled her hand\naway and closed the cabinet. “Now that you’re pregnant, don’t eat things that have preservatives in\nthem.”"
      },
      {
        "paragraph": "Freya turned her head around furiously. Her eyes happened to settle on his long neck with a s*xy\nAdam’s apple."
      },
      {
        "paragraph": "His neck was undeniably better than those young hunks in the entertainment industry."
      },
      {
        "paragraph": "Rodney did not notice it and he continued to say, “I f you want something spicy, I’ll cook it for you\ntonight.”"
      },
      {
        "paragraph": "“Rodney Snow, what are you trying to do?”"
      },
      {
        "paragraph": "Freya suddenly lifted her head with a dazed look on her pretty face. “Are you planning to take\nresponsibility for me?”"
      },
      {
        "paragraph": "Rodney choked in an instant. He had no idea why he would make such a remark either."
      },
      {
        "paragraph": "It might have to do with his family who brought him up."
      },
      {
        "paragraph": "Every man in the Snow family was responsible."
      },
      {
        "paragraph": "“I haven’t made up my mind yet.” Distressed, Rodney turned around and ate the pasta."
      },
      {
        "paragraph": "Freya was stunned. “What’s there for you to consider? You’ll choose Sarah without a doubt.”"
      },
      {
        "paragraph": "Rodney’s handsome face flashed with agony. “Do you think that I don’t want to choose her? My\ngrandpa says that men must be responsible."
      },
      {
        "paragraph": "Perhaps I’m not fated to be with Sarah.”"
      },
      {
        "paragraph": "Freya was momentarily startled. In fact, Rodney was quite innocent. Unfortunately… he was involved\nwith a woman who was far from innocent."
      }
    ]
  },
  {
    "title": "Chapter 1065 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“No need.” Freya shook her head. “I don’t need you to be responsible for me. Since the Snow family is\nforcing me to give birth to this child and even threatening me with this child, I’ll give birth to them but I\nwon’t marry you.”"
      },
      {
        "paragraph": "Rodney never thought that she would rather remain unmarried and give birth to the child than marry him."
      },
      {
        "paragraph": "He was supposed to be glad, yet he was upset somehow."
      },
      {
        "paragraph": "“Freya Lynch, do you dislike me so much?”"
      },
      {
        "paragraph": "‘I’ve never liked you.’"
      },
      {
        "paragraph": "Freya insulted him inwardly before she seriously said, “When I got into a relationship three years ago, I\nfell in love with a guy in college and we were together for four to five years. We had even met each\nothers’ parents and were getting ready for our wedding. But one day, he stood my family and me up for\nhis childhood sweetheart. He didn’t do it only once but many times. He always put his childhood best\nfriend above everything else."
      },
      {
        "paragraph": "“Whenever we went out on a date, he would bring his childhood best friend along."
      },
      {
        "paragraph": "“When his childhood best friend got sick, he would take care of her."
      },
      {
        "paragraph": "“He claimed that he only treated her as a sister and was not in love with her. Later, I couldn’t endure it\nanymore so I broke up with him. Shortly after, he got into a relationship with that childhood best friend of\nhis."
      },
      {
        "paragraph": "“By the way, he even blamed me for being narrow- minded after we broke up. He said that his childhood\nbest friend was truly in love with him while I didn’t love him enough.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Listening to her story, Rodney was stunned."
      },
      {
        "paragraph": "He suddenly pitied her."
      },
      {
        "paragraph": "All this while, he had been under the impression that he was pathetic when it came to relationships. He\nnever thought that Freya would be the same as him."
      },
      {
        "paragraph": "“So you still can’t get over that shameless man, right?”"
      },
      {
        "paragraph": "“No.”"
      },
      {
        "paragraph": "Freya shook her head. “Although I initiated the break-up, I was actually the one who got dumped. I don’t\nwant to experience that kind of feeling anymore. If we get together for the sake of the child and I don’t\nhold a place in your heart because you can’t get over Sarah, I’m afraid you’ll dump me eventually.”"
      },
      {
        "paragraph": "For a long time, Rodney did not utter a word."
      },
      {
        "paragraph": "He just watched her lower her head as she ate the pasta. A complicated feeling of bitterness seized him."
      },
      {
        "paragraph": "“Then… It’s alright. If there’s anything, you can call me anytime. I’ll get you a housekeeper. Don’t eat\nprocessed food anymore.”"
      },
      {
        "paragraph": "“Mm.”"
      },
      {
        "paragraph": "In the mall."
      },
      {
        "paragraph": "Catherine accompanied Freya to stroll around aimlessly. “So you’ve made a deal with Rodney at last?”"
      },
      {
        "paragraph": "“Duh. You couldn’t even defeat Sarah. Will I be able to defeat her?”"
      },
      {
        "paragraph": "Freya shook her head. “What’s more, if I were to"
      },
      {
        "paragraph": "stay with Rodney every day, I’m afraid I’d depend o n him as time passed since his cooking is wonderful.\nI don’t want to depend on anyone.”"
      },
      {
        "paragraph": "“I’m just worried that you’ll get hurt.”"
      },
      {
        "paragraph": "Catherine sighed. “Actually, it’s not easy to be a single mother. It’ll affect your next marriage. Once you\ngive birth… you need to be responsible for the child.”"
      },
      {
        "paragraph": "“What else can I do? No matter how popular I am, I’m still a cosmetic chemist. I’m not capable enough to\nfight against the Snow family.” Freya gave a bitter laugh."
      },
      {
        "paragraph": "Catherine kept quiet."
      },
      {
        "paragraph": "It was true that none of the families were comparable to the Snow family given their status in both politics\nand business."
      },
      {
        "paragraph": "After dinner, Catherine sent Freya home. Then, she received a call from Logan."
      },
      {
        "paragraph": "“There’s nothing suspicious about President Lyons.”"
      },
      {
        "paragraph": "Logan said, “He’s been going to work on time every day. Sometimes, there are women who try to seduce\nhim during banquets, but he ignores them all."
      },
      {
        "paragraph": "When he’s engaged in social activities, he won’t drink nor smoke. Other men will call some women over,\nbut there won’t be any women around him. Besides, he does charity and actively advocates for children\nliving in poverty by raising funds for them. He’s also gentle to his employees. Based on what I heard from\nthe employees in Golden Corporation, none of them has pointed out anything bad about him.”"
      },
      {
        "paragraph": "Catherine frowned upon hearing this. Was she overthinking it?"
      },
      {
        "paragraph": "Could it be that Shaun had lied to her and Wesley did not actually send him that video?"
      },
      {
        "paragraph": "Logan asked out of confusion, “There’s nothing wrong with Wesley. Why did you ask me to investigate\nhim?” “Fine. Stop following him and come back.”"
      }
    ]
  },
  {
    "title": "Chapter 1066 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine hung up the call."
      },
      {
        "paragraph": "By the time she arrived at the Yule family’s villa, it was already eight-ish at night. Wesley was telling the\ntwo children a story with a gentle look and hoarse voice. He looked like a good father."
      },
      {
        "paragraph": "At the sight of this, a twinge of guilt crept up Catherine’s mind. She had actually suspected him. That was\nreally too much."
      },
      {
        "paragraph": "Only after Wesley finished the story did he notice her. “You’re back.”"
      },
      {
        "paragraph": "Joel glared at Catherine. “You’re Suzie and Lucas’ mom, but you always come home late. Even Wesley\nis doing a better job at being a parent than you.”"
      },
      {
        "paragraph": "“I’ll reflect on myself and won’t do it again,” Catherine apologized sincerely."
      },
      {
        "paragraph": "“It doesn’t matter. You can carry on with your work. I’ll help you take care of your children at home, ”\nWesley said with a smile."
      },
      {
        "paragraph": "Looking at him, Catherine decided on something deep down."
      },
      {
        "paragraph": "At night, Catherine kept Suzie and Lucas company as they slept. Suddenly, Suzie said, “Mommy,"
      },
      {
        "paragraph": "Granny called me today and said she misses me. Great-grandpa and Great-grandma miss me too. I feel\nlike… staying there for some time.”"
      },
      {
        "paragraph": "“What’s so nice about staying there?” Lucas asked grumpily."
      },
      {
        "paragraph": "Suzie pouted without saying anything else. Catherine touched her head. “Alright.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "If the Hill family were treating Suzie out of the kindness of their hearts, Catherine did not mind Suzie\nhaving more family members."
      },
      {
        "paragraph": "Lucas snorted with annoyance. He turned to the other side with his back facing them."
      },
      {
        "paragraph": "“My scummy dad said he’ll pick me up tomorrow.” Catherine was stunned but she nodded."
      },
      {
        "paragraph": "7:00 a.m. the next day."
      },
      {
        "paragraph": "The security guard said that Shaun was at the gate o f the Yule family’s villa."
      },
      {
        "paragraph": "Catherine helped Suzie carry her bag. Then, she held her hand and walked her out."
      },
      {
        "paragraph": "Wearing a shirt under a gray vest, Shaun was standing at the gate under a tree. He was holding a\ncigarette in one hand while the other hand was stuck into his trousers’ pocket."
      },
      {
        "paragraph": "He watched Catherine come out of the villa."
      },
      {
        "paragraph": "When he looked at her, his deep -set eyes reddened slightly. Catherine wondered if the smoke had\nirritated his eyes."
      },
      {
        "paragraph": "He said in a hoarse voice, “Suzie, I came to pick you up.”"
      },
      {
        "paragraph": "Suzie nodded. “Uncle Shaun, quit smoking. Smoking is bad for your health.”"
      },
      {
        "paragraph": "“Okay, I won’t smoke anymore.” Shaun opened the door of the car beside him and seated her.“ I’ll be\nsending you to Granny’s place.”"
      },
      {
        "paragraph": "“Suzie, you can call me if there’s anything, alright?” Catherine reminded Suzie concernedly."
      },
      {
        "paragraph": "“Okay, I’ll be fine. I’m already a grown-up.” Suzie pouted as she could not bear to part with her mom."
      },
      {
        "paragraph": "After Shaun closed the door, Catherine waved at Suzie through the window. She turned around to return\nto the Yule family’s villa."
      },
      {
        "paragraph": "“I understand now. I was hypnotized by Sarah three years ago.”"
      },
      {
        "paragraph": "Staring at Catherine’s back, Shaun suddenly said in a disheartened tone, “I went to Melbourne recently\nand found Aunty Linda. I learned a lot of things from her. We used to be… a very loving couple.”"
      },
      {
        "paragraph": "“… Oh,” Catherine responded serenely with her back facing him. However, a wave of emotions had\nalready swept over her."
      },
      {
        "paragraph": "He had actually discovered it?"
      },
      {
        "paragraph": "She thought that he would never realize it."
      },
      {
        "paragraph": "Shaun was deeply frustrated to receive a mere ‘oh’ a s a reply from her. Did she not have any other\nreactions, such as agitation, sorrow, or bitterness?"
      }
    ]
  },
  {
    "title": "Chapter 1067 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine did not show any other reactions, but Shaun was emotionally agitated."
      },
      {
        "paragraph": "In the past few days, he had found himself in a difficult dilemma about whether to see her or not. He\ndreaded seeing her, but he dearly missed her at the same time."
      },
      {
        "paragraph": "“Cathy, I’m sorry. I really didn’t know…”"
      },
      {
        "paragraph": "Shaun began to explain like a lost kid, “I didn’t mean to behave like that. I never thought that such a\nridiculous thing would happen to me either."
      },
      {
        "paragraph": "Sarah’s hypnosis was so powerful that it rewrote all my memories and made me hate you so much."
      },
      {
        "paragraph": "That’s why I was unaware of it…”"
      },
      {
        "paragraph": "“So are you asking me to forgive you?” Catherine suddenly turned her head around, her tranquil eyes\nsettling on his handsome face."
      },
      {
        "paragraph": "“ I … ” Awkward, Shaun did not know what to say. His eyes reddened in agony. “Cathy, I love you. My\nlove for you has never changed…”"
      },
      {
        "paragraph": "“Hah!”"
      },
      {
        "paragraph": "Catherine finally laughed. “Shaun, even if you hadn’t been hypnotized by Sarah, we might’ve already\ndivorced by now.”"
      },
      {
        "paragraph": "Shaun was dazed. “That wouldn’t be the case.”"
      },
      {
        "paragraph": "“It’s funny how I’m the only one who remembers that relationship of ours. In truth, we started having\nissues with our relationship before that."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "When you were still clear-headed, you completely ignored me and would spend time with Sarah every\nday. When you guys went for gatherings, I would occasionally join but I was the most unwelcome person\nin your circle.”"
      },
      {
        "paragraph": "Catherine recounted the past happenings, “You simply let your friends throw mud at me and attack me.\nYou’d forever stand up for Sarah rather than me. You thought that I was making a scene. When I got\npregnant later, we hardly talked to each other. Moreover, you were often not at home. I couldn’t feel your\ncare at all.”"
      },
      {
        "paragraph": "Shaun’s lashes fluttered weakly."
      },
      {
        "paragraph": "He had been under the impression that the two of them were very loving before this and it was Sarah\nwho changed everything through her hypnosis."
      },
      {
        "paragraph": "It turned out that he had already been treating Catherine unreasonably before that."
      },
      {
        "paragraph": "Catherine continued, “I’ve long since known how cruel and wicked Sarah is. I had reminded you\ncountless times to keep a distance from her, but you assumed that I was trying to tear you guys apart.\nYou had too much trust in Sarah, which was also why she managed to hypnotize you."
      },
      {
        "paragraph": "“Shaun, even so, I didn’t hate you back then. I only began to hate you after I lost our children and\nsomething happened to Freya. It was fine that you didn’t love me and defended her, but you even lost\nyour morals and crossed the line. That was just terrifying. Why did you have to take advantage of others\nfor the sake of your relationship?"
      },
      {
        "paragraph": "“Shaun, in case you’re unclear about it, you’re not a victim. You deserve this.”"
      },
      {
        "paragraph": "He deserved this…"
      },
      {
        "paragraph": "Shaun’s handsome face was as white as a sheet."
      },
      {
        "paragraph": "A moment later, he smiled wryly. “Yeah, I deserve it. I used to have a wife and children, but I didn’t know\nhow to appreciate them. I treated you like trash, yet I treated that wicked woman as the apple of my eye\n—”"
      },
      {
        "paragraph": "“Wifey, it’s time for breakfast.”"
      },
      {
        "paragraph": "Wesley suddenly walked out the door and called out to Catherine in an affectionate, gentle manner."
      },
      {
        "paragraph": "Shaun’s body jerked. At the sight of Wesley in pajamas, his reddened eyes carried a surge of emotions."
      },
      {
        "paragraph": "Did Wesley spend the night here? Were they… living together?"
      },
      {
        "paragraph": "Shaun heard Wesley calling his ex-wife ‘Wifey’."
      },
      {
        "paragraph": "“Mr. Hill, your relationship with my wife remains i n the past. Today, you’re just here to pick Suzie up. I\nthink there’s nothing much the two of you have to talk about.”"
      },
      {
        "paragraph": "Wesley gently put his hand around Catherine’s waist, his body sticking close to hers. “By the way, let me\nwarn you. You had greater status than me before this, so I had no choice but to put up with you when\nyou threatened me at my wedding. But now, you’re not the Young Master Hill you used to be anymore.\nHill Corporation is far from where Golden Corporation is now. I hope… you’ll stay away from my wife.\nOtherwise, don’t blame me for being rude.”"
      },
      {
        "paragraph": "Wesley’s eyes were frosty as he spoke softly. Shaun sneered at him."
      },
      {
        "paragraph": "Was Wesley threatening him?"
      }
    ]
  },
  {
    "title": "Chapter 1068 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Wesley Lyons, you’ve always been rude to me, haven’t you? Unfortunately, you hid it too well. Let’s see\nwhen your mask slips.”"
      },
      {
        "paragraph": "As soon as Shaun finished speaking, he darted a glance at Catherine. At the sight of her calm\nexpression, his heart ached deep down."
      },
      {
        "paragraph": "Suzie rolled down the rear window and stuck her head out. She then asked with an impatient tone, “\nUncle Shaun, how much longer are you going to talk?”"
      },
      {
        "paragraph": "“I’m coming now.” Shaun got into the car."
      },
      {
        "paragraph": "When he drove off, he spotted Wesley lowering his head and kissing Catherine on the lips through the\nrear-view mirror."
      },
      {
        "paragraph": "He tightened his grip on the steering wheel until the veins on the back of his hands bulged. At the same\ntime, he pressed down on the accelerator harder in spite of himself."
      },
      {
        "paragraph": "Suzie began to scream in shock. “Uncle Shaun, you’re driving too fast! I’m scared.”"
      },
      {
        "paragraph": "Shaun suddenly came back to his senses. He swiftly reduced his speed and apologized, “Sorry.”"
      },
      {
        "paragraph": "“Uncle Shaun, how immature of you. No wonder your wife left you.” Suzie could not help but mock him\nwith her hands on her waist."
      },
      {
        "paragraph": "“… You’re right.” Shaun looked down dejectedly."
      },
      {
        "paragraph": "Suzie sighed at his behavior. She knew that her mommy had married Uncle Wesley. However, when she\nimagined her mommy living with Uncle Wesley i n the future, she felt like she would be a homeless child."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Why are you sighing?” Shaun looked at the three- year-old little kid who was acting like an adult."
      },
      {
        "paragraph": "“I heard Aunty Cathy telling Uncle Wesley that she’ll move to his villa tomorrow. ” Suzie suddenly said\ngloomily, “It won’t be convenient for me to go there in the future.”"
      },
      {
        "paragraph": "Shaun happened to encounter a sharp right turn at the front."
      },
      {
        "paragraph": "The moment he spaced out, a black Rolls-Royce appeared in front of him. He subconsciously slammed\nthe brakes but it was too late."
      },
      {
        "paragraph": "The two cars crashed into each other."
      },
      {
        "paragraph": "Suzie, who was seated behind, was so shocked that she began to sob."
      },
      {
        "paragraph": "Shaun immediately turned his head around to have a look at the little kid. Fortunately, she had fastened\nher seat belt, so she was kept firmly in her seat. However, her face had paled and she kept sobbing due\nto the shock."
      },
      {
        "paragraph": "He hurriedly opened the door and carried her from the backseat."
      },
      {
        "paragraph": "Suzie wrapped her hands around his neck tightly, crying her eyes out."
      },
      {
        "paragraph": "A middle-aged man got out of his seat from the Rolls-Royce and asked concernedly, “Is the child\ninjured?”"
      },
      {
        "paragraph": "Shaun checked Suzie’s body. Only after he confirmed that she was fine did he let out a sigh of relief."
      },
      {
        "paragraph": "“She’s fine. I’m sorry,” Shaun apologized. He knew that his car crashed into the man’s because he had\nspaced out just now."
      },
      {
        "paragraph": "“Don’t cry, Suzie. I’m here, and you’re fine.” It"
      },
      {
        "paragraph": "took Shaun a long while before he could calm Suzie."
      },
      {
        "paragraph": "The driver just waited quietly beside him without urging him."
      },
      {
        "paragraph": "With that, Shaun had a favorable impression of him. “It was my fault. Let me know how much I should\ncompensate for the car and I’ll transfer the amount to you.”"
      },
      {
        "paragraph": "When the driver was about to speak, a man’s throaty voice sounded from the backseat of the Rolls-\nRoyce. “Come here, Robbie.”"
      },
      {
        "paragraph": "The driver walked to the back window of the car. The window was rolled down, revealing a strange man’s\nside profile. He was wearing a pair of sunglasses, and a scar was visible on his face. From his side\nprofile, one could tell that the man had been very handsome when he was young."
      },
      {
        "paragraph": "After the man gave his instructions to the driver in a husky voice, the driver walked to Shaun and said\ngently, “It doesn’t matter. We don’t need the money from you to repair the car. You can bring the child\nand leave. Don’t leave her here for too long, or she’ll be scared. Be careful when you drive next time.”"
      },
      {
        "paragraph": "“… Thank you.”"
      },
      {
        "paragraph": "Shaun was quite astonished."
      },
      {
        "paragraph": "Although the residents of Sherman Mountain were wealthy people, it was rare to find such an affable\nman among them. What was more, Shaun had never seen that man before."
      }
    ]
  },
  {
    "title": "Chapter 1069 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "When Shaun carried Suzie into the car, the driver suddenly asked, “Is this your child?”"
      },
      {
        "paragraph": "“… Mm,” Shaun responded casually."
      },
      {
        "paragraph": "Since Liam had gone missing, he would treat Suzie like his biological daughter in the future."
      },
      {
        "paragraph": "“Both of you look very alike.” The driver smiled."
      },
      {
        "paragraph": "“Yeah, she looks like me. ” Shaun was filled with mixed feelings. “Have you just moved here recently?\nI’ve never seen you before.”"
      },
      {
        "paragraph": "“Yeah.” The driver turned around and got into the car."
      },
      {
        "paragraph": "After the two cars drove past each other, Shaun glanced in the direction that the car was heading."
      },
      {
        "paragraph": "That manor above used to be the Hill family’s manor."
      },
      {
        "paragraph": "Could the man be the buyer of the manor?"
      },
      {
        "paragraph": "However, he was not in the mood to dwell on the matter related to the manor as he had just found out\nCatherine was going to be living together with Wesley."
      },
      {
        "paragraph": "He was certain that Wesley would sleep with Catherine."
      },
      {
        "paragraph": "His heart clenched at the thought of Catherine lying beneath Wesley’s body."
      },
      {
        "paragraph": "This was not the crucial point. What worried Shaun more was the possibility of Catherine being pregnant\nwith Wesley’s child. Wesley was absolutely not a good person. Shaun did not mind parting with\nCatherine, but he was worried that she would end up in the same situation as Lea."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Suzie…”"
      },
      {
        "paragraph": "Shaun suddenly called out to her. “Can you call Aunty Cathy tomorrow and let her know that you met\nwith an accident? Tell her that you want her to come over to accompany you.”"
      },
      {
        "paragraph": "Suzie widened her reddened eyes, which looked adorable. “This isn’t a good idea… Aunty Cathy hates\npeople who lie.”"
      },
      {
        "paragraph": "“But you’re not going to lie. It’s true that we had met with an accident just now. You even got a shock and\ncried, right?” Shaun talked the pure Suzie into i t like a wolf."
      },
      {
        "paragraph": "Suzie replied, “Uh… Uncle Shaun, you’ve turned into a bad guy. Is it because you haven’t gotten over\nAunty Cathy? She’s already married, so you should give up on her.”"
      },
      {
        "paragraph": "Shaun laughed bitterly. “ If she had married a good person, I’d wish her happiness, but Wesley is\nhypocritical and evil. I’m worried Aunty Cathy will get hurt in the future.”"
      },
      {
        "paragraph": "A dazed look washed over Suzie’s face. “No. I think Uncle Wesley is quite nice.”"
      },
      {
        "paragraph": "“Suzie, he treats you and Aunty Cathy well with the intention of winning over Aunty Cathy’s heart. I just\ncan’t make certain things clear to you. Having"
      },
      {
        "paragraph": "said that, just trust me when I say that he’s two- faced,” Shaun said earnestly."
      },
      {
        "paragraph": "“What does two-faced mean?”"
      },
      {
        "paragraph": "“It means saying one thing and doing another.” Shaun looked at her imploringly, trying to ingratiate\nhimself with her. “Suzie, don’t you believe me? Yes, I was a bad person last time, but at least I was\nopenly bad.”"
      },
      {
        "paragraph": "Suzie was at a loss for words. She did not expect her scummy dad to act in such a servile manner."
      },
      {
        "paragraph": "Fine. She decided to help him considering how pathetic he was."
      },
      {
        "paragraph": "Moreover, she did not want her mommy to live with Uncle Wesley either. Once her mommy gave birth to\na new baby, she would no longer be the apple of her mommy’s eye.”"
      },
      {
        "paragraph": "As for Lucas, forget about him. He was like an ice statue."
      },
      {
        "paragraph": "Shaun took Suzie to Hill Corporation."
      },
      {
        "paragraph": "Upon learning that Suzie was here, Lea planned to bring her granddaughter upstairs in person to play\nwith her."
      },
      {
        "paragraph": "Before Lea left, she asked, “How did it go with asking for 1oo billion dollars from Sarah?”"
      },
      {
        "paragraph": "“ She’s not planning to return it,” Shaun answered."
      },
      {
        "paragraph": "Lea snorted in fury. “I’ve long since told you that this woman isn’t a good person, but you refused to listen\nto me and even gave her 1oo billion dollars without me knowing it. How generous of you.”"
      },
      {
        "paragraph": "“Didn’t you give Mason a lot of money too? Since you guys have been together for over 2o years, you\nprobably gave him more than 1oo billion dollars.” Shaun raised his brows. “No doubt, I’m your biological\nson. I take after you.”"
      }
    ]
  },
  {
    "title": "Chapter 1070 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Stung by Shaun’s mocking comments, Lea was speechless."
      },
      {
        "paragraph": "She had basically shot herself in the foot."
      },
      {
        "paragraph": "“By the way, do you know who’s the man who bought the Hill family’s old manor?” Shaun asked out of\nthe blue."
      },
      {
        "paragraph": "“I’m not sure. He didn’t show his face at all.” Lea asked with a frown, “Why are you asking this?”"
      },
      {
        "paragraph": "“Nothing. ” Shaun shook his head. He then watched Lea hold Suzie’s hand as she brought her upstairs."
      },
      {
        "paragraph": "The phone on his desk vibrated again, showing a strange number."
      },
      {
        "paragraph": "He answered the call and Sarah’s voice sounded. “ Shaun, why did you block my number?”"
      },
      {
        "paragraph": "“So are you going to return the money to me?” Shaun asked indifferently."
      },
      {
        "paragraph": "“No, Shaunic. You’ve misunderstood me. I’ve never thought of hurting you—”"
      },
      {
        "paragraph": "Shaun hung up the call before Sarah could finish her sentence."
      },
      {
        "paragraph": "She was so furious that she screamed like a madwoman."
      },
      {
        "paragraph": "Rodney came in and happened to catch sight of this scene. He got a shock as he found this side of\nSarah strange."
      },
      {
        "paragraph": "“Rodney, what brings you here?”"
      },
      {
        "paragraph": "Sarah was shocked as well. She did not expect the security guard to let him in without her knowing. She\nquickly forced out a few teardrops and acted as if she was breaking down. “I called Shaunic just now and"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "he got on my nerves. He has become so strange and terrifying. Although we’re no longer friends after we\nbroke up, we don’t need to be enemies.”"
      },
      {
        "paragraph": "“Shaun has changed.” Rodney saw why she had lost control and nodded. “I went to look for him and he\nignored me too.”"
      },
      {
        "paragraph": "Enduring her helplessness, Sarah asked on impulse, “Have you looked for Chester?”"
      },
      {
        "paragraph": "“… Chester doesn’t want to interfere.” Rodney glanced at her and said, “Chester also thinks that you\nshould return about 8o billion dollars to Shaun. In fact, even 2o billion dollars is a lot. A lot of people can’t\nmake 1oo million dollars even if they don’t eat or drink their whole lives.”"
      },
      {
        "paragraph": "Chester had not made such a remark. However, Rodney was too ashamed to say this to Sarah directly.\nTherefore, he tried to persuade her using Chester’s name."
      },
      {
        "paragraph": "“I’ve said that I can’t fork out so much money now because I placed it in a closed-end fund. Why don’t\nyou lend it to me first? I’ll return it to you later.” Struck by a thought, Sarah said pathetically."
      },
      {
        "paragraph": "Rodney was stunned. “If I had this amount of money, I would’ve surely lent it to you. But I only have a\nfew billion dollars in hand.”"
      },
      {
        "paragraph": "The Snow family had blocked his card to stop him from being with Sarah. Therefore, he could only rely\non Osher Corporation now. However, he was also strapped for cash, considering that advertising Osher’s\nnew product would require a great deal of money as well."
      },
      {
        "paragraph": "Deep down, Sarah snorted and thought, ‘What a poor man!’"
      },
      {
        "paragraph": "She actually expected him to return 8o billion dollars for her when he was so poor."
      },
      {
        "paragraph": "How dumb of her!"
      },
      {
        "paragraph": "Rodney persuaded her, saying, “Sarah, you must believe me. I can make a lot of money in the future."
      },
      {
        "paragraph": "I can give you 200 billion dollars, much less 100 billion dollars…”"
      },
      {
        "paragraph": "“Enough. Drop it.”"
      },
      {
        "paragraph": "Amid her sobs, Sarah rose to her feet. “ Shaun has dumped me once, so I’ve lost faith in relationships. I\njust want to hold onto what I have now. Besides, what gives Shaun the right to treat me this way?"
      },
      {
        "paragraph": "I’m not happy about it.”"
      },
      {
        "paragraph": "Dejected, Rodney lowered his gaze. “I wish I could help you too. I’ve asked many lawyers about it."
      },
      {
        "paragraph": "From what they said, you won’t be able to win this case…”"
      },
      {
        "paragraph": "“Please leave now. I want to spend some time alone.” Sarah turned around without being bothered about\nhim."
      },
      {
        "paragraph": "Rodney felt incredibly upset. He gazed at her for a while before he walked away."
      },
      {
        "paragraph": "He was very disappointed."
      },
      {
        "paragraph": "He wondered if Sarah refused to return the money because she was dissatisfied with how Shaun had\nharmed her or because she could not bear to part with the money."
      },
      {
        "paragraph": "He just found the current Sarah very strange."
      },
      {
        "paragraph": "One could be fond of money but… one could not be too greedy."
      },
      {
        "paragraph": "What was more, Rodney had been going here and there recently to get Sarah a lawyer. He was so\nweary that he had not even been to the office these days. Even so, Sarah could not seem to understand\nhis intentions."
      }
    ]
  },
  {
    "title": "Chapter 1071 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "In the end, Rodney drove to Osher Corporation."
      },
      {
        "paragraph": "When he arrived there, he spotted a female employee rushing out of the elevator with two packets of\njalapeno poppers in her arms."
      },
      {
        "paragraph": "“Aren’t you… Freya’s assistant?” Her name was on the tip of Rodney’s tongue. He had met her a few\ntimes in past meetings."
      },
      {
        "paragraph": "“I’m Lauren Cox,” the female employee said, “ Director Lynch ordered takeaway and asked me to collect\nthe food.”"
      },
      {
        "paragraph": "“You mean these…?” Rodney pointed at the jalapeno poppers in her arms and his handsome face\ndarkened."
      },
      {
        "paragraph": "“Yeah… This kind of food is allowed in the company, right?” His expression frightened Lauren."
      },
      {
        "paragraph": "Of course, their company did not set any rules about food. Having said that, could she eat… such food\nwith heavy flavors considering that she was a pregnant woman?"
      },
      {
        "paragraph": "Hold on!"
      },
      {
        "paragraph": "Rodney realized something else. “Is Director Lynch still at work?”"
      },
      {
        "paragraph": "“Of course. It’s not even time for a break…” Lauren noticed that his face had turned grim, but she was\nnot sure what she had said wrong."
      },
      {
        "paragraph": "“Pass these to me. I’m going to meet her. Where’s she?”"
      },
      {
        "paragraph": "Rodney snatched the packets away. “In the lab.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Rodney strode toward the laboratory that was behind him."
      },
      {
        "paragraph": "When he stepped in, he saw Freya developing a product with her head down. She was wearing a white\ncoat and a pair of goggles."
      },
      {
        "paragraph": "It was his first time seeing her like this."
      },
      {
        "paragraph": "Although the two of them had been working in the same company, he hardly came to the laboratory.\nAlso, he was not working whenever she visited him."
      },
      {
        "paragraph": "Freya was wearing a light yellow checked shirt. Of course, with the white coat covering her body, the\ncurves on her exquisite figure were not visible. This woman could not even be associated with the word ‘"
      },
      {
        "paragraph": "fashionable’ when she was working."
      },
      {
        "paragraph": "Nevertheless, her serious and cautious expression made her look like an authoritative researcher whom\nnobody dared to look down on."
      },
      {
        "paragraph": "They said that men looked charming when they were working. However, women who were focused o n\nwork were also equally charming."
      },
      {
        "paragraph": "Freya heard footsteps, so she thought it was Lauren who came back. She extended her hand in the\ndirection of the footsteps while looking at the result of her experiment."
      },
      {
        "paragraph": "Rodney glanced at her pretty and clean hand. After that, he shifted his eyes to her serious face."
      },
      {
        "paragraph": "He was stunned. After a moment of hesitation, he ultimately placed his hand on her palm."
      },
      {
        "paragraph": "This was what she meant… Right?"
      },
      {
        "paragraph": "Freya pinched the hand that was much bigger than hers."
      },
      {
        "paragraph": "She suddenly turned around, only to see Rodney’s dazed and handsome face. She then glanced at the\nman’s big hand that was holding hers."
      },
      {
        "paragraph": "Her eyes behind the goggles revealed a confused look. After that, she flew into a rage and broke free\nfrom his hand. “Rodney Snow, are you out of your mind? What are you trying to do?”"
      },
      {
        "paragraph": "“You stretched out your hand to me. Wasn’t this what you meant?” Stung by her criticism, Rodney argued\nsulkily, “Why are you yelling? It’s not like I’m despising you now.”"
      },
      {
        "paragraph": "“Are you a dog?” Freya criticized, “Only a dog will put its paw on its owner’s hand that’s stretched out.”"
      },
      {
        "paragraph": "“Say it again if you have the guts.” Rodney’s handsome face flushed with anger. “I’m your superior. Is this\nhow you should speak to your superior? What’s more, who asked you to stretch out your hand to me so\nrandomly?”"
      },
      {
        "paragraph": "“Was I stretching out my hand to you? I thought Lauren came back to pass me the jalapeno peppers.”"
      },
      {
        "paragraph": "At the mention of the jalapeno poppers, Rodney snorted nonchalantly. “I threw them.”"
      }
    ]
  },
  {
    "title": "Chapter 1072 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Rodney Snow…” Freya was so furious that she glared at Rodney with her bright eyes. “Who are you to\nthrow my jalapeno poppers away?”"
      },
      {
        "paragraph": "“Who am I?” Rodney reacted as if he heard a joke. He lowered his head and gazed at her belly. “Simply\nbecause you’re pregnant with my child. I need to be concerned about my child’s diet. I can’t let you\ndestroy my child with junk food.”"
      },
      {
        "paragraph": "Freya rubbed her temples. As her mouth was currently bland, she wanted to eat something spicy t o\nstimulate her taste buds. However, Rodney had ruined her plans. Was he a rat?"
      },
      {
        "paragraph": "“Besides…”"
      },
      {
        "paragraph": "Rodney continued, “Since you’re pregnant, why are you still working in the lab? Go home and sleep.”"
      },
      {
        "paragraph": "“Sleep, my *ss.” Freya was at a loss for words. “I’m only one month pregnant, but you’re already\nstopping me from coming to work. You want to bore me to death and make me suffer from depression,\nhuh?"
      },
      {
        "paragraph": "“Stop biting the hand that feeds you. I’m doing this for your own good.”"
      },
      {
        "paragraph": "Rodney replied sulkily, “Many women just stay home and nurture their babies after they’re pregnant. Our\nchild is fated to live a luxurious life in the future. The Snow family won’t mistreat you either. You can\nindulge in the pleasures of life forever without having to work hard.”"
      },
      {
        "paragraph": "Our child…"
      },
      {
        "paragraph": "The moment Freya heard this phrase from his mouth, she found it extremely odd. She had never thought\nthat she would share such a link with Rodney one day."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "With that, her feelings became complicated all of a sudden."
      },
      {
        "paragraph": "“Why are you suddenly not speaking anymore?” It baffled Rodney to see her staring at him."
      },
      {
        "paragraph": "Freya sighed. “Rodney Snow, even without your family, I can rely on my parents and indulge in the\npleasures of life forever. Anyway, one can’t possibly live like this. Instead, one should lead a productive\nlife. To me, being able to develop cosmetic products that can make women beautiful and skincare\nproducts that can delay their aging process is what makes me fulfilled. When I walk into a mall and see"
      },
      {
        "paragraph": "the products that I developed being sold, I’ll feel a sense of pride and satisfaction that no one else can\nprovide me with.”"
      },
      {
        "paragraph": "“So…” Rodney was stunned."
      },
      {
        "paragraph": "“So I’ll continue working although I’m pregnant. It won’t affect me in nurturing the baby because I’m doing\nsomething I enjoy. At the same time, I’ll protect the baby.”"
      },
      {
        "paragraph": "After pushing him away, Freya wore a pair of gloves and took a test tube. Then, she used a cotton bud\nand dipped it into the liquid inside the tube. Later, she placed the cotton bud near the tip of her nose to\nsmell it."
      },
      {
        "paragraph": "Her long lashes behind the goggles were as luscious and dark as a paintbrush."
      },
      {
        "paragraph": "Rodney zoned out while looking at her. He suddenly screamed, “Freya Lynch, you’re pregnant! Why are\nyou wearing make-up?”"
      },
      {
        "paragraph": "Freya, who was disturbed once more, lost her temper. “Are you blind? Where did I apply make-u"
      },
      {
        "paragraph": "“Well… Your eyes.”"
      },
      {
        "paragraph": "Pointing at her, Rodney said, “You’re wearing eyeliner and mascara…”"
      },
      {
        "paragraph": "He remembered that Sarah’s lashes were not this luscious unless she put on make-up."
      },
      {
        "paragraph": "“This is how I originally look, okay. I never apply eye make-up,” Freya answered weakly while gnashing\nher teeth."
      },
      {
        "paragraph": "“I don’t believe it.” Rodney frowned. “Don’t try to fool me.”"
      },
      {
        "paragraph": "“Check it yourself, then.” Freya took off the"
      },
      {
        "paragraph": "goggles and stared at him without blinking her eyes."
      },
      {
        "paragraph": "Not knowing what to do, Rodney had no choice but to bend over to take a closer look at her."
      },
      {
        "paragraph": "After touching her long lashes, he realized that there was indeed nothing on them."
      },
      {
        "paragraph": "What was more, he found it interesting to see her lashes flutter like a butterfly at the touch of them."
      },
      {
        "paragraph": "He could not help but touch her lashes a few more times. His childish look was then reflected in Freya’s\nbright eyes, which resembled a mirror."
      },
      {
        "paragraph": "Somehow, he felt awkward."
      },
      {
        "paragraph": "He became annoyed, thinking that he must be out of his mind."
      },
      {
        "paragraph": "Freya was speechless and also slightly embarrassed."
      },
      {
        "paragraph": "It was because Rodney, that man, was so close to her at this moment. His attractive face could\nundoubtedly beat many young, handsome men in the entertainment industry."
      },
      {
        "paragraph": "It was no wonder those young and handsome men were so popular. Indeed, their appearance was a\nfeast for the eyes. Rodney enjoyed wearing showy clothes in particular. From the way he was dressed,\none could not tell that he was already in his early 30s."
      }
    ]
  },
  {
    "title": "Chapter 1073 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Ahem, you indeed didn’t put on makeup. Forget it. I still have a lot of things to deal with. You can get\nback to work, but don’t make my baby exhausted.”"
      },
      {
        "paragraph": "Rodney held a fist to his face and coughed. He retracted his awkward gaze and walked out."
      },
      {
        "paragraph": "Freya looked at him from behind. She concluded that he just came over to quarrel with her."
      },
      {
        "paragraph": "Back in the office."
      },
      {
        "paragraph": "Rodney was going through that month’s income statement. On the opposite side of the table, a female\nsecretary was reporting the overall income situation of each major city."
      },
      {
        "paragraph": "The female secretary was 3o years old. She wore a two—piece suit."
      },
      {
        "paragraph": "Rodney raised his head and beckoned at her with his finger. “Come here, closer.”"
      },
      {
        "paragraph": "The female secretary walked forward without putting her guard up. After all, everyone knew that"
      },
      {
        "paragraph": "except for Sarah, other women were nothing in his eyes. They did not have to worry about him taking\nadvantage of the secretaries."
      },
      {
        "paragraph": "“Your eyes… You’ve applied makeup on them, right?” Suddenly, Rodney scrunched his face."
      },
      {
        "paragraph": "The female secretary felt awkward. “The company has requirements for us to put on some makeup. ”"
      },
      {
        "paragraph": "“So there are differences between people. Some people are born with features that make them look like\nthey have on contact lenses and eyeliner, ” Rodney could not help but mutter."
      },
      {
        "paragraph": "“Are you talking about Director Lynch?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "The female secretary smiled and said, “Director Lynch’s pretty face looks like she’s mixed-race. She’s\ngood-looking even without makeup. Her parents are clearly Australians, though.”"
      },
      {
        "paragraph": "“She’s quite popular, huh?” Rodney raised his eyebrows."
      },
      {
        "paragraph": "“Yes, many male employees in the company treat her as their goddess. Many of them want to pursue her\ntoo, ” the female secretary said as she smiled."
      },
      {
        "paragraph": "Rodley tugged on his tie. His eyebrows were raised with a dangerous look in them. “Our company\ndoesn’t allow office romance, right?”"
      },
      {
        "paragraph": "The female secretary was confused. “Is there a rule like that?”"
      },
      {
        "paragraph": "“There is. Have I forgotten to say it before? Dating within the company affects work efficiency. I’ll fire\nanyone who dates, ” Rodney said coldly."
      },
      {
        "paragraph": "Hah, was Freya thinking of dating other guys while carrying his child? In her dreams."
      },
      {
        "paragraph": "6:00 p.m."
      },
      {
        "paragraph": "Freya was finally done extracting the ingredient components of lavender. Suddenly, she heard Rodney’s\nvoice in her ears."
      },
      {
        "paragraph": "“You haven’t gotten off work yet?”"
      },
      {
        "paragraph": "Freya’s hand trembled. She looked at Rodney as if she had seen a ghost. “I should be the one asking\nyou that. Shouldn’t you be looking for Sarah now?”"
      },
      {
        "paragraph": "“What do you mean?” Rodney was like a porcupine. His eyebrows became straight."
      },
      {
        "paragraph": "“Well, usually you’d be gone even before 5:00 p.m. As the president, you’re always the last to arrive and\nthe first to leave. Everyone in the company knows that you have to accompany Sarah the moment you\nget off work.” Freya took off her goggles and spoke honestly."
      },
      {
        "paragraph": "Rodney’s expression darkened from listening to her words."
      },
      {
        "paragraph": "However, he could not refute her at all. After all, that was the truth."
      },
      {
        "paragraph": "“Do many people… talk about it in the company?” he could not help asking."
      },
      {
        "paragraph": "“Not really. Who dares to talk about it? You’re the boss.” Freya asked curiously, “Aren’t you\naccompanying her today? From what I know, she probably needs you a lot now.”"
      },
      {
        "paragraph": "Rodney felt stabbed again. He could not help but be depressed. “Do I look like I’m really needed by\nsomeone? I can’t even find a good lawyer. I only have a billion dollars in my hands…”"
      },
      {
        "paragraph": "Sarah wanted to borrow money from him, but he could not give her the amount needed."
      },
      {
        "paragraph": "She then told him to leave. He felt like she was looking down on his poor financial situation."
      }
    ]
  },
  {
    "title": "Chapter 1074 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "As a man, he wanted his pride too. “Isn’t a billion dollars money as well? I painstakingly work to develop\na product, but I only earn 200 to 300 million dollars.”"
      },
      {
        "paragraph": "Freya was shocked. “Think about the senior management of Osher Corporation. Their annual salary is\nonly about two million dollars. How many years do they have to go without eating or drinking to earn a\nbillion dollars? Be content with what you have. Don’t take things for granted.”"
      },
      {
        "paragraph": "Rodney looked at her being wide-eyed and astonished. His heart strangely felt healed."
      },
      {
        "paragraph": "Although that woman’s words always made him exasperated, sometimes, they did not make him gnash\nhis teeth either."
      },
      {
        "paragraph": "“But women always hope to have more money, right?” he said in distress."
      },
      {
        "paragraph": "Freya figured it out. She could roughly guess that Rodney was feeling troubled because of Sarah. “ If\nthere’s too much money, it’ll just be saved in the bank as mere numbers anyway. A billion dollars is more\nthan enough for us if we want a luxurious life. Buying bags and shoes that’s hundreds of thousands of\ndollars, living in a luxurious house or a villa, and even having a private airplane. All these are still\npossible."
      },
      {
        "paragraph": "“But you have to understand that it’s already good enough if ten percent of the people in the whole world\ncan do what I mentioned just now. The remaining go percent of people are still working hard to make\nends meet.”"
      },
      {
        "paragraph": "Rodney thought it made sense as he listened."
      },
      {
        "paragraph": "However, Sarah did not think that way. It would be nice if only Sarah were like Freya…"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "After that thought crossed Rodney’s mind, he was startled."
      },
      {
        "paragraph": "F*ck, what was he thinking?"
      },
      {
        "paragraph": "While he was in a daze, Freya had already taken off her lab coat and packed up everything. “President\nSnow, I’ll be leaving first.”"
      },
      {
        "paragraph": "“ .. Hey, wait. I’m going to your place to check on the housekeeper I arranged for you.” Rodney suddenly\nfollowed her."
      },
      {
        "paragraph": "Freya was taken aback. Her pretty face showed that she was finding this odd. “I didn’t ask the\nhousekeeper to make dinner tonight. I planned to get Lauren to have hotpot with me.”"
      },
      {
        "paragraph": "Rodney was speechless. Freya knew what he wanted to say, so she said quickly, “I know that the food\noutside isn’t hygienic and it’s not good for the baby, but I really want to have hotpot today. I wasn’t this\nway before, so it must be the baby who wants to eat it.”"
      },
      {
        "paragraph": "“You only know how to push the blame to the baby.”"
      },
      {
        "paragraph": "Rodney said angrily, “The hotpot served outside isn’t clean. Many vegetables aren’t washed properly …\nForget it. If you want to eat hotpot, I’ll go back and make it for you.”"
      },
      {
        "paragraph": "Freya was dumbfounded. “Ah?”"
      },
      {
        "paragraph": "“What do you mean by ‘Ah’? I just have to prepare the hotpot’s soup base, don’t I? I know how to make\nit.”"
      },
      {
        "paragraph": "Rodney harrumphed."
      },
      {
        "paragraph": "Freya blinked. Suddenly, she realized Flashy Rodney, who wore a floral shirt, looked… very handsome."
      },
      {
        "paragraph": "In the end, Rodney brought Freya to the supermarket to buy the ingredients."
      },
      {
        "paragraph": "Freya could not resist taking a photo of his back. She sent it to Catherine. Freya: [F*ck, Flashy Rodney is\ngoing to make hotpot for me. A flashy person can actually make the soup base for hotpot?"
      },
      {
        "paragraph": "My eyes are almost dropping out of their sockets.]"
      },
      {
        "paragraph": "Catherine: [Ah, Sarah doesn’t deserve him. It’s unfortunate.]"
      },
      {
        "paragraph": "Freya: [It’s pretty unfortunate. I feel like he’s slightly disappointed in Sarah now. Moreover… I suspect\nthat Sarah dislikes him for being… poor.]"
      },
      {
        "paragraph": "Catherine: [??? Well, compared to 1oo billion dollars, he’s pretty poor.]"
      },
      {
        "paragraph": "Freya laughed when she saw that message."
      },
      {
        "paragraph": "Suddenly, she heard a man’s voice scolding her. [ Freya… Be careful…]"
      },
      {
        "paragraph": "Before she could react, a force pulled her against a firm chest all of a sudden. Next, she saw a little boy\nrunning over the spot she stood at just now."
      },
      {
        "paragraph": "Her heart sped up in fear. If Rodney had not pulled her over, she would have been knocked over by that\nchild. She might even have gotten a miscarriage."
      },
      {
        "paragraph": "She looked up and saw Rodney’s handsome face."
      },
      {
        "paragraph": "“Freya, can you be more careful? You’re already pregnant, yet you’re still playing with your phone while\nwalking. I really don’t know how you managed to survive thus far.”"
      }
    ]
  },
  {
    "title": "Chapter 1075 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Rodney scolded Freya angrily. When he saw her almost getting knocked over, his heart leaped in fear.\nHe rushed over almost instinctively and pulled her over."
      },
      {
        "paragraph": "Actually, he did not… hate the existence of the baby as much as he thought."
      },
      {
        "paragraph": "However, that woman seemed to not be aware that she was a pregnant woman now."
      },
      {
        "paragraph": "“Rodney, I’m in pain… ” Freya suddenly frowned and moaned."
      },
      {
        "paragraph": "Rodney became nervous in an instant. “Where… Where are you in pain? Your stomach?”"
      },
      {
        "paragraph": "He touched her stomach in fear. “Is it bleeding down there…”"
      },
      {
        "paragraph": "“No, it’s your grip on my shoulder that’s painful.” Freya gritted her teeth and reminded him with a blushed\nface as she looked at the adult man bent over in front of her and nervously touching her stomach."
      },
      {
        "paragraph": "“… Oh.” Only then Rodney remembered that he was gripping her shoulder. He quickly let go, and his\ntone was indignant. “Why didn’t you say it clearly? I was scared to death.”"
      },
      {
        "paragraph": "Freya gave him a confused sidelong glance. “What’s there to be scared of? If this baby is gone, you can\nb e together with Sarah, right?”"
      },
      {
        "paragraph": "“That baby is also a life. You don’t have to say it like it’s a trivial matter and make me look like a cold"
      },
      {
        "paragraph": "-blooded, heartless person, ” Rodney muttered."
      },
      {
        "paragraph": "Freya sneered. “Haven’t you been cold-blooded and heartless many times? In your heart, as long as\nSarah and the people by her side are happy, you don’t care about right or wrong at all.”"
      },
      {
        "paragraph": "“… Can you not bring up the past?” Rodney said. He had a headache."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“No.” Freya pushed him away coldly. She simply walked straight ahead."
      },
      {
        "paragraph": "That made Rodney nervous as he had to buy things while making sure she did not get knocked over by\nothers."
      },
      {
        "paragraph": "After getting in the car, he took out a small bag of potato chips from the shopping bag and gave it to\nFreya. “This is for you.”"
      },
      {
        "paragraph": "Freya rolled her eyes at him. “Didn’t you say you won’t let me eat junk food?”"
      },
      {
        "paragraph": "“It’s just a small bag. This is my limit.”"
      },
      {
        "paragraph": "Rodney said with a tone that was meant to please her, “I’m giving this as an apology. I was wrong in the\npast.”"
      },
      {
        "paragraph": "He was already handsome with his intricate features. Now that he was trying to please someone, it could\nmake a woman’s motherly instincts surge."
      },
      {
        "paragraph": "After Freya was stunned for a few seconds, she finally understood why so many older female fans would\ncare for younger male celebrities."
      },
      {
        "paragraph": "It was advantageous for a person to have handsome looks."
      },
      {
        "paragraph": "She sighed mentally. She took the bag of potato chips and humphed. “If an apology is useful, why do we\nstill need the police? All the hurt you’ve"
      },
      {
        "paragraph": "caused me is engraved in my heart.”"
      },
      {
        "paragraph": "“Thomas is already a cripple. It’s not like you don’t know about it, ” Rodney muttered."
      },
      {
        "paragraph": "“Were you the one who crippled him?”"
      },
      {
        "paragraph": "“ .. Although I wasn’t the one who did it, I was at the scene.”"
      },
      {
        "paragraph": "“That’s right. When you were at the scene, you must’ve said, ‘Hey, actually, there’s no need to be so\ncruel. After all, he’s Sarah’s brother. This isn’t too appropriate… ”’ Freya said while imitating his tone."
      },
      {
        "paragraph": "Rodney had no words."
      },
      {
        "paragraph": "Could that woman read his mind?"
      },
      {
        "paragraph": "She made him so embarrassed. He was her superior!"
      },
      {
        "paragraph": "Freya sneered. She ignored him and concentrated on eating her chips."
      },
      {
        "paragraph": "However, Rodney’s face heated up because of that. He felt guilty."
      },
      {
        "paragraph": "When they reached Freya’s home, the housekeeper, Aunty Sophia, greeted them, “Young Master Snow,\nlet me do it— ”"
      },
      {
        "paragraph": "“No need. You don’t know how to make hotpot. I’ll do it.”"
      },
      {
        "paragraph": "Rodney rolled up his sleeves and went to the kitchen."
      },
      {
        "paragraph": "Not long after, a strong hotpot fragrance wafted from the kitchen. Freya was craving it so much that she\nalmost drooled."
      },
      {
        "paragraph": "Aunty Sophia went into the kitchen to have a look and came out. She smiled and said, “Ms. Lynch, you’re\nso lucky. Young Master Snow is so skilled at cooking. Ah, I don’ t even know how he made the hotpot’s\nsoup base. The vegetables have been washed so well too. Men who know how to cook are rare now.”"
      },
      {
        "paragraph": "Freya felt bitter as she listened."
      }
    ]
  },
  {
    "title": "Chapter 1076 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Freya was not at all lucky. Rodney only loved Sarah."
      },
      {
        "paragraph": "Actually, anyone who Rodney loved would be pretty happy."
      },
      {
        "paragraph": "He was a single-minded person. If he loved someone, he would treat that person well."
      },
      {
        "paragraph": "He might also treat his children well in the future too."
      },
      {
        "paragraph": "The baby was still in Freya’s belly, yet Rodney was already scared the baby would be unhealthy from\neating junk food."
      },
      {
        "paragraph": "Freya had a tough life. In the past, Patrick was stolen away from her by that b*tch, Linda."
      },
      {
        "paragraph": "This time, she ended up sleeping with Rodney for no reason. The problem was Rodney was not even\nattracted to her beauty."
      },
      {
        "paragraph": "Nowadays, natural beauty really was not worth anything."
      },
      {
        "paragraph": "Freya touched her stomach. ‘Baby, Mom owes everything to you’, she thought."
      },
      {
        "paragraph": "At 7:00 p.m., Freya and Rodney ate a meal of steaming hotpot together."
      },
      {
        "paragraph": "Eating hotpot was only fun if people were fighting over the food. She and Rodney did it that way."
      },
      {
        "paragraph": "Rodney liked to eat too. They both finished all the ingredients."
      },
      {
        "paragraph": "“It’s weird. Aren’t you afraid of getting fat?” Rodney looked at Freya. She was unlike Sarah, who was\nafraid of getting fat no matter what she ate."
      },
      {
        "paragraph": "Sarah could not eat a lot of things. It was not fun to have meals with Sarah."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“I’m sorry, but I won’t get fat no matter how much I eat.” Freya raised her eyebrows at him. She was very\nsmug."
      },
      {
        "paragraph": "Her little face was flushed from eating hotpot. Her small mouth was also slightly swollen as if someone\nhad kissed her. They looked very flirtatious."
      },
      {
        "paragraph": "Rodney felt a wave of heat welling up from his lower abdomen."
      },
      {
        "paragraph": "For some reason, he vaguely remembered some things from the night he had sex with Freya."
      },
      {
        "paragraph": "This woman had been like a fairy. Her waist was thin, her passion was overflowing, and she had been\nvery aggressive. Ahem…"
      },
      {
        "paragraph": "Damn it. What was he thinking about?"
      },
      {
        "paragraph": "He turned his face away. He was regretful. Sure enough, men really could not get laid. His mind became\ntainted after getting laid."
      },
      {
        "paragraph": "After finishing the hotpot, it was 9:00 p.m."
      },
      {
        "paragraph": "Freya went upstairs for a bath. In the living room below, Rodney was still chatting with Aunty Sophia\nabout Freya’s diet."
      },
      {
        "paragraph": "“Aunty Sophia, you mustn’t let her eat junk food. If she doesn’t listen, you can call me immediately. ”"
      },
      {
        "paragraph": "The corners of Freya’s mouth twitched. Rodney was really meddlesome."
      },
      {
        "paragraph": "After she came out from her bath, Rodney had already left."
      },
      {
        "paragraph": "Aunty Sophia brought a phone over. “Ms. Lynch, Mr. Snow left his phone here.”"
      },
      {
        "paragraph": "“Give it to me. I’ll pass it to him at the company tomorrow.”"
      },
      {
        "paragraph": "Freya brought the phone upstairs. Not long after, Rodney’s phone rang. It was Sarah who called."
      },
      {
        "paragraph": "Freya’s red lips smirked. She picked up the call."
      },
      {
        "paragraph": "The sound of Sarah sobbing was heard. “Rodney, where are you? I miss you so much… I’m sorry, my\nattitude toward you was bad today. I didn’t do it on purpose… I was just upset…”"
      },
      {
        "paragraph": "Freya listened to her pitiful cries. She asked inwardly. No wonder Sarah could completely fool two men.\nAs expected, Sarah had her ways. “Excuse me, Ms. Neeson. Rodney just left. He left his phone at my\nhome.”"
      },
      {
        "paragraph": "Every sentence of hers was uttered after careful consideration."
      },
      {
        "paragraph": "Sarah immediately exploded from anger. “Freya Lynch?”"
      },
      {
        "paragraph": "“Ah, I didn’t expect you to recognize my voice.” Freya laughed with her hand over her mouth."
      },
      {
        "paragraph": "“Why would Rodney be at your place at such a late hour? Did you seduce him?” Sarah yelled."
      }
    ]
  },
  {
    "title": "Chapter 1077 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“What do you mean I seduced him? He’s my fiancé. I should be the one asking you that. What are you\nthinking by calling my fiancé late at night and saying you miss him?” Freya raised her eyebrows and\nsaid, “Are you trying to be a mistress again?”"
      },
      {
        "paragraph": "“Who’s the mistress? Rodney and I were clearly in love first.” Sarah was exasperated. “Rodney is just\nfaking an engagement with you.”"
      },
      {
        "paragraph": "“How can it be fake? This promise was made by our parents after they met. It’s legitimate. Besides…”"
      },
      {
        "paragraph": "Freya suddenly covered her mouth and made a vomiting sound. “It’s so annoying. I’m feeling\nuncomfortable due to morning sickness after getting pregnant. Please don’t mind me.”"
      },
      {
        "paragraph": "“You… You’re pregnant?”"
      },
      {
        "paragraph": "Sarah was dumbfounded. It was as if lightning had struck on a clear day. “It’s Rodney’s?”"
      },
      {
        "paragraph": "“Who else? Your good brother made this happen.”"
      },
      {
        "paragraph": "Freya deliberately whined, “Didn’t Rodney tell you? He wants this baby.”"
      },
      {
        "paragraph": "“ It’s impossible. ” Sarah was utterly agitated. She could not calm down. “Rodney doesn’t love you at all.”"
      },
      {
        "paragraph": "“But he loves the baby. He even made a meal for me just now.”"
      },
      {
        "paragraph": "Freya burped. “His cooking skills are excellent. I think… I’m almost falling in love with him. I don’t want to\nlet you have such a good man.”"
      },
      {
        "paragraph": "“Freya, just wait. Even if you’re pregnant, it’s useless, ” Sarah yelled and hung up."
      },
      {
        "paragraph": "Hearing Sarah losing control, Freya laughed in satisfaction."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Three years ago, Sarah had made her and Catherine so miserable."
      },
      {
        "paragraph": "Finally, it was her turn to torture Sarah. It felt very good."
      },
      {
        "paragraph": "She had to show off to Catherine."
      },
      {
        "paragraph": "Who knew that after Catherine heard about it, she went silent for a moment. Then, she scolded, “You\nacted too rashly! Sarah isn’t that easy to deal with. If she had recorded the call and edited it a little,\nRodney would think that you’re a scheming woman.”"
      },
      {
        "paragraph": "Freya’s heart skipped a beat. After a while, she said, “He can think that way all he wants. It’s not like I\nwant to have anything to do with him anyway.”"
      },
      {
        "paragraph": "“Fine, as long as you have it figured out.” Catherine moved her lips and said. Actually, she was still a bit\nworried. After all, no one knew better than her just how evil Sarah could be."
      },
      {
        "paragraph": "Forget it. She would go over earlier tomorrow in case Rodney went to trouble Freya."
      },
      {
        "paragraph": "Rodney lived alone at a penthouse in the city center."
      },
      {
        "paragraph": "When he reached home, he suddenly realized that he left his phone at Freya’s place. He was too lazy to\ngo back to retrieve it. He would just fetch her to work tomorrow morning and take his phone back."
      },
      {
        "paragraph": "Just as he got ready to take his bath, the doorbell rang."
      },
      {
        "paragraph": "He opened the door. Sarah stood at the door with a tear-streaked face. “Rodney, I called you just now\nand it was Freya who picked up. She said she’s pregnant with your child. Is it true?”"
      },
      {
        "paragraph": "Rodney’s expression changed drastically."
      },
      {
        "paragraph": "He had not thought about how to tell Sarah this matter."
      },
      {
        "paragraph": "“She… How did she tell you about it?”"
      },
      {
        "paragraph": "Sarah studied his expression. She knew then it was true. She clenched her fists. She did not expect\nRodney, whom she held tightly in her hands, would have a child with Freya."
      },
      {
        "paragraph": "She vented out while sobbing. “Freya said you don’t want her to abort the child and that you cooked for\nher. She’s falling in love with you and she wants to snatch such a good man like you away.”"
      },
      {
        "paragraph": "Rodney was stunned. Freya said she was falling in love with him? Freya wanted to snatch him away?"
      }
    ]
  },
  {
    "title": "Chapter 1078 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Strangely, his mind was in a mess until Sarah’s cries of despair pulled him back. Only then did he get\nenraged. Freya was so calculating! What a shame, his impression of her had even improved that night."
      },
      {
        "paragraph": "“Rodney, why are you doing this to me? It’s one thing that Shaun doesn’t want me, but even you’ve\nbetrayed me now. How do you expect me to continue living? Who was the one who said he’d love me\nforever and never leave me?”"
      },
      {
        "paragraph": "Every word from Sarah was like a slap across Rodney’s face, stinging him."
      },
      {
        "paragraph": "“Sarah, I’m sorry… I only found out that she was pregnant a few days ago.”"
      },
      {
        "paragraph": "Rodney lowered his head and explained, “I don’ t like her, but… my family doesn’t agree to have her\nabort this child.”"
      },
      {
        "paragraph": "Sarah’s eyes widened. Tears came streaming down her face. “You’re saying that you want this child to\nbe born. What do you want me to do? Do you want me to back out of this?”"
      },
      {
        "paragraph": "Rodney was having a headache. “My parents will raise that child after they’re born. I told Freya that I\nwouldn’t marry her…”"
      },
      {
        "paragraph": "“Rodney, you’re too innocent. She knows you don’t love her now and using the child to get married to\nyou will make you feel repulsed. That’s why she retreated to make you let your guard down, so that she’ll\nbe able to get close to you and make you like her. Then, she’ll ruin our relationship.”"
      },
      {
        "paragraph": "Sarah persuaded him bitterly."
      },
      {
        "paragraph": "Rodney was utterly confused by her words. He thought that Freya was not that kind of person."
      },
      {
        "paragraph": "“You don’t believe me?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Sarah smiled pitifully. “I knew that you don’t trust me all that much, so I recorded the phone call just now.\nListen.”"
      },
      {
        "paragraph": "She played the recording. When Rodney heard Freya saying, ‘I don’t want to let you have such a good\nman’ in such an arrogant tone, his expression turned awful."
      },
      {
        "paragraph": "“Rodney, I don’t want to force you, but if you still want to be with me, you have to make Freya abort the\nchild. I don’t want the person I love to have an illegitimate child. I just want our child. I care about you, so\nI won’t be that tolerant or generous. ” Sarah moved back step by step and left with reddened eyes."
      },
      {
        "paragraph": "Rodney looked at her from behind. His heart was in great pain."
      },
      {
        "paragraph": "It was all Freya’s fault. The woman who did not know her place. He only treated her slightly better\nbecause of the child, but she was trying to push her luck."
      },
      {
        "paragraph": "That night, Rodney could not sleep at all. When morning came, he drove to find Freya."
      },
      {
        "paragraph": "Aunty Sophia opened the door. She smiled and said, “Ms. Lynch is still getting dressed upstairs.”"
      },
      {
        "paragraph": "Rodney went upstairs in long strides. As there were usually no men in the house, Freya did not close the\ndoor when she was getting dressed."
      },
      {
        "paragraph": "Rodney barged into the room. His breathing hitched when he saw the unclothed woman in the room."
      },
      {
        "paragraph": "That narrow waist, her fair skin, and even her curves"
      },
      {
        "paragraph": "It was as though there were flames in his eyes."
      },
      {
        "paragraph": "It was his first time seeing a woman’s body this clearly."
      },
      {
        "paragraph": "“Aunty Sophia, is there…” When Freya turned her head and saw Rodney’s dark eyes, she screamed out\nof shock. She shut the door of the dressing room with a yelp."
      },
      {
        "paragraph": "Rodney’s Adam’s apple bobbed. Damn it! His body was having a reaction."
      },
      {
        "paragraph": "How could he go downstairs in this state?"
      },
      {
        "paragraph": "He quickly went to the bathroom in Freya’s room."
      },
      {
        "paragraph": "Freya finished getting dressed and came out with a flushed face. She noticed that no one was in the\nroom, but there was a silhouette of a man in her bathroom."
      },
      {
        "paragraph": "What was Rodney doing in her bathroom?"
      },
      {
        "paragraph": "Freya was a neat freak. She immediately rushed over and knocked on the door. “Rodney, there are\nbathrooms downstairs too! Why are you using my bathroom? Can you not pee on the floor?”"
      },
      {
        "paragraph": "“Shut up…” Rodney’s hoarse roar could be heard."
      },
      {
        "paragraph": "“Why is your voice so weird? Do you have constipation?”"
      },
      {
        "paragraph": "Freya felt increasingly disgusted as she thought about it. “Who allowed you to defecate in my private\nbathroom? It stinks.”"
      }
    ]
  },
  {
    "title": "Chapter 1079 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "In the bathroom, Rodney was angered by Freya to the point he almost got a stroke."
      },
      {
        "paragraph": "However, he could not refute her words at all."
      },
      {
        "paragraph": "Forget it. It was better than letting her know that he did… that in her bathroom."
      },
      {
        "paragraph": "F*ck."
      },
      {
        "paragraph": "A few minutes later, his face was blushing when he came out of the bathroom. When they saw each\nother, he saw Freya covering her nose and looking at him in disdain."
      },
      {
        "paragraph": "“Freya, cut the act. You’re actually feeling smug now, right?”"
      },
      {
        "paragraph": "Rodney had never felt as embarrassed as he was at that moment. “Did you know I was coming and\npurposely took off your clothes to seduce me?”"
      },
      {
        "paragraph": "“Are you shameless?”"
      },
      {
        "paragraph": "Freya almost had high blood pressure from anger. “ This is my room, my house. You ran in without\nknocking on the door and saw me naked. I haven’t"
      },
      {
        "paragraph": "even settled this debt with you, yet you’re falsely accusing me instead.”"
      },
      {
        "paragraph": "“Don’t think I’m clueless about your intentions.”"
      },
      {
        "paragraph": "Rodney sneered, “What did you say to Sarah last night? You like me. You want to seduce me and ruin\nmy relationship with Sarah. You’re too calculating.”"
      },
      {
        "paragraph": "“I… I like you?” Freya’s eyes almost popped out of their sockets."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Hah, you’re fully aware of it. Don’t you remember what you told Sarah last night?” Rodney reminded her\ncoldly."
      },
      {
        "paragraph": "Freya was astonished. Fine, Catherine had been right."
      },
      {
        "paragraph": "“I did that on purpose to agitate Sarah. I hate her for hurting Cathy before— ”"
      },
      {
        "paragraph": "“Enough! Isn’t Sarah miserable enough now because of Catherine?” Rodney yelled and cut her “I don’t\nwant to talk nonsense with you. Get out of here.” Freya was afraid of miscarrying due to anger, so she\nturned around and left."
      },
      {
        "paragraph": "“Stop right there.” Rodney went after her. “You have to follow me to the hospital.”"
      },
      {
        "paragraph": "“What for?”"
      },
      {
        "paragraph": "“To do an abortion.”"
      },
      {
        "paragraph": "Rodney was determined. If Freya were a kind person who knew her place, he could have let her give\nbirth to the baby. However, after last night, he had a clear understanding of this woman’s sly nature. He\nwould no longer be involved with her."
      },
      {
        "paragraph": "“F*ck you!”"
      },
      {
        "paragraph": "Freya could not resist spitting out vulgar words."
      },
      {
        "paragraph": "What a shame. She thought he had a sense of responsibility last night and that he would be a good\nfather. The next moment, he became so cold-"
      },
      {
        "paragraph": "blooded and heartless that it made people’s hearts go cold."
      },
      {
        "paragraph": "“Come on, let’s go.” Rodney grabbed her wrist. “Let me go. I’m not going.” Freya started struggling. It\nwas not because she really wanted to keep the baby. It was just that why must she abort it just because"
      },
      {
        "paragraph": "he said so?"
      },
      {
        "paragraph": "“Sure enough, what you said about us having a common enemy and wanting to persuade my family to\nabort the baby was all a lie. You just want to keep the baby so that it’s easier for you to marry me.”"
      },
      {
        "paragraph": "Not only did Rodney not let go, but he even freed his other hand to firmly grab her."
      },
      {
        "paragraph": "“Rodney, let me go!” Freya pushed him hard. As a result, when she stood at the wooden staircase, her\nfoot slipped and she fell to the ground."
      },
      {
        "paragraph": "“Freya…”"
      },
      {
        "paragraph": "Catherine, who just entered through the door, saw Freya tumbling down the staircase to the first floor."
      },
      {
        "paragraph": "She rushed over in a hurry. She saw Freya clutching her stomach. Her face was twitching in pain."
      },
      {
        "paragraph": "“Cathy… It hurts so much…”"
      },
      {
        "paragraph": "“Quickly call the ambulance,” Catherine ordered Aunty Sophia."
      },
      {
        "paragraph": "Aunty Sophia hurriedly found a phone and dialed 000."
      },
      {
        "paragraph": "At that moment, Rodney came back to his senses. He did not expect that she would just… fall."
      },
      {
        "paragraph": "He did not push her. He did not do it on purpose."
      }
    ]
  },
  {
    "title": "Chapter 1080 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“I… I’ll carry her… ” Rodney hurriedly rushed down and wanted to carry Freya."
      },
      {
        "paragraph": "However, Catherine pushed his hands away. She glared at him, her eyes filled with rage. “Get lost!\nYou’re so eager to kill your child. Who knows if you’ll deliberately kill the child while carrying Freya?”"
      },
      {
        "paragraph": "“Catherine Jones, watch your mouth! Am I such an evil person… F*ck… She’s bleeding.” Rodney’s mind\nwent blank."
      },
      {
        "paragraph": "Freya lowered her head and had a look. Her face was pale. “Cathy, it hurts down there.”"
      },
      {
        "paragraph": "“Don’t move. Aunty Sophia, help me out. We’ll carry her down together, ” Catherine said to Aunty Sophia\nin a hurry."
      },
      {
        "paragraph": "Aunty Sophia had also heard Rodney saying he wanted to make Freya get an abortion when she went to\nopen the door just now. She did not dare to let Rodney help out either."
      },
      {
        "paragraph": "She and Catherine supported Freya and took the elevator down. The ambulance had rushed and sent\nFreya to the hospital immediately."
      },
      {
        "paragraph": "On the way, Freya’s head was covered in sweat from the pain."
      },
      {
        "paragraph": "After arriving at the hospital, she was sent to the emergency room straight away."
      },
      {
        "paragraph": "Catherine immediately called the Snow family. “ Uncle Jason, your son pushed Freya down the staircase.\nPlease come over right now. The Snow family has to give us an explanation on this matter.”"
      },
      {
        "paragraph": "Rodney panicked when he heard that. “Hey, what are you saying? I didn’t push her at all. It was her.\nCatherine slapped him across the face without letting him finish his sentence."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Catherine, how dare you hit me?!” Rodney was infuriated and wanted to slap her back."
      },
      {
        "paragraph": "However, Catherine quickly avoided him and did a shoulder throw. She tossed his tall figure onto the\nfloor of the hospital."
      },
      {
        "paragraph": "“Ow… It hurts…” Rodney’s back almost snapped from the pain."
      },
      {
        "paragraph": "“You feel pain too? But what you’re feeling now can’t even compare to Freya’s pain.”"
      },
      {
        "paragraph": "Catherine glared at him angrily. “Rodney Snow, they say even a vicious tiger wouldn’t eat its cubs. Even\nif you don’t love Freya, she’s still pregnant with your child. You can love Sarah, but you can’t love\nsomeone to the point of becoming inhumane.”"
      },
      {
        "paragraph": "“I really didn’t push her. She slipped and fell down on her own.” Rodney was frustrated from getting\nscolded."
      },
      {
        "paragraph": "Catherine sneered, “So you’re still not admitting that you’re in the wrong? If you hadn’t tried to drag her\nto go and have an abortion, would she have slipped?”"
      },
      {
        "paragraph": "Rodney’s handsome face went pale from her words. He was speechless."
      },
      {
        "paragraph": "The doctor came out. “The patient’s uterine lining i s damaged. The baby is in a critical state as well, but\nwe can still manage to keep the baby—”"
      },
      {
        "paragraph": "Rodney said in a daze, “This… There’s no need to keep it.”"
      },
      {
        "paragraph": "“Shut your mouth! ” Catherine glared at him sharply."
      },
      {
        "paragraph": "“Keep the baby.” Suddenly, Jason and Wendy came running."
      },
      {
        "paragraph": "“Doctor, this is my grandchild. You have to save my grandchild no matter what,” Wendy said urgently."
      },
      {
        "paragraph": "The doctor said, “Actually, I haven’t finished my sentence. If we abort the baby, the patient has to\nundergo a dilation and curettage procedure. It’ll be harmful to her body and it’ll be very difficult for her to\nget pregnant again in the future.”"
      },
      {
        "paragraph": "Catherine was shocked. It seemed like Freya was destined to keep this child. “Then keep the baby… ”"
      },
      {
        "paragraph": "She knew Freya would surely not want to lose the right to be a mother."
      },
      {
        "paragraph": "“Okay, please sign here.”"
      },
      {
        "paragraph": "The doctor took a pen out. Catherine put down her signature."
      },
      {
        "paragraph": "Rodney was confused. “Why did it turn out like this? Could it be that Freya bribed the doctors inside?”"
      },
      {
        "paragraph": "Right after he said those words, Catherine was infuriated. She wanted to strike out at him, but Jason was\nfaster and crueler than her."
      },
      {
        "paragraph": "A slap from a man could not compare to a woman’s at all."
      },
      {
        "paragraph": "Rodney’s mouth instantly bled. He widened his"
      },
      {
        "paragraph": "eyes in disbelief. “Dad…” “Get lost.”"
      },
      {
        "paragraph": "Jason pointed outside. His body was shaking because he was utterly enraged. “Get out of here! We, the\nSnow family, have nothing to do with you from now on. Freya’s child will have nothing to do with you as\nwell. You don’t have to be responsible for the child either. You can go and be together with Sarah. No\none will stop you guys anymore.”"
      }
    ]
  },
  {
    "title": "Chapter 1081 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“No, Dad. I…”"
      },
      {
        "paragraph": "“Why do I have such an evil son like you?”"
      },
      {
        "paragraph": "Wendy shook her head in disappointment. “ I had already advised you before, but you still made me\ndisappointed. Leave. We’ll have no ties with you at all in the future.”"
      },
      {
        "paragraph": "Rodney felt bitter. “Dad, Mom, I really didn’t push her. Are you really disowning me for the sake of a\ngrandchild and Freya?”"
      },
      {
        "paragraph": "“Do you still not understand? As a human, you should have a conscience and know not to cross the line.\nBut you don’t have a conscience at all. A person like you doesn’t deserve to be my son. You don’t\ndeserve to remain in the Snow family.”"
      },
      {
        "paragraph": "Jason yelled while trembling, “Get lost! Don’t let me see you again!”"
      },
      {
        "paragraph": "They were utterly disappointed in him."
      },
      {
        "paragraph": "Rodney opened his mouth. In the end, when facing everyone’s gazes of contempt, he could only turn\naround and leave. Loneliness shrouded his entire body."
      },
      {
        "paragraph": "He knew that no one would stop him from being together with Sarah in the future."
      },
      {
        "paragraph": "However, why did he not feel happy? Instead, he felt lost."
      },
      {
        "paragraph": "“Uncle Jason…” Catherine did not expect Jason to chase Rodney out of the Snow family. However, she\nstill told Jason and Wendy about what had happened."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Anyway, Rodney definitely played a role in this incident. If he hadn’t forced Freya to have an abortion, all\nthis wouldn’t have happened.”"
      },
      {
        "paragraph": "Jason sighed. He said, “We were wrong. I thought Rodney still had some sense of responsibility in him.\nHis kindness is almost disappearing because of Sarah.”"
      },
      {
        "paragraph": "Catherine’s brows were knitted together in a tight frown. “But the baby…”"
      },
      {
        "paragraph": "“The baby can’t be aborted. We owe Freya for this. We’ll compensate her.”"
      },
      {
        "paragraph": "Wendy said, “On our way here, we had a call with Old Master Snow. Old Master Snow intends to let\nNathan take Freya in as his goddaughter. With the identity as the future prime minister’s goddaughter, I\nbelieve that Freya can find the one she loves in the future without having to worry about anything.\nNobody will dare to bully her in the future.”"
      },
      {
        "paragraph": "Catherine’s heart trembled."
      },
      {
        "paragraph": "Being Nathan’s goddaughter was indeed an extraordinary identity."
      },
      {
        "paragraph": "Besides, Nathan only had a son and that son was working in political law. Who would dare to cause\ntrouble with Freya in the future?"
      },
      {
        "paragraph": "“After some time, we’ll hold a grand ceremony to acknowledge Freya as Nathan’s daughter. We’ll let the\nwhole world know that Freya is part of the Snow family. At the same time, ten percent of Snow\nCorporation’s shares will be transferred to her. But those shares can only be inherited by the child in her\nbelly now. If she marries another man and has children with that man in the future, we’ll arrange another\nset of dowry as well, ” Wendy said sincerely."
      },
      {
        "paragraph": "“About this… I’ll inform Freya about this later.”"
      },
      {
        "paragraph": "Catherine could see that the Snow family was indeed being sincere. Firstly, it was because of their guilt\nover Rodney’s immoral actions. Secondly, they were concerned about the child in Freya’s belly."
      },
      {
        "paragraph": "An hour later."
      },
      {
        "paragraph": "After Freya settled down in the ward, she learned about the Snow family’s arrangements."
      },
      {
        "paragraph": "She would be the goddaughter of the prime minister in the future?"
      },
      {
        "paragraph": "She did not know whether she should cry or laugh."
      },
      {
        "paragraph": "“Freya, if you abort this child, you’ll lose the right to be a mother, ” Catherine said helplessly."
      },
      {
        "paragraph": "“Hah! It seems like the heavens have already decided for me.” Freya did not expect her life to come to\nthis point."
      },
      {
        "paragraph": "She had thought of being in a normal, romantic relationship in the past. The man did not have to be\nexceptionally wealthy. After that, she would build a family and have children. Now, her life had taken a\ngreat turn."
      },
      {
        "paragraph": "Wendy consoled her, saying, “Don’t worry, Freya. With this identity of yours in the future, you’ll be the\none picking the men. Of course, you may be worried that the other party will mind that you’ve given birth\nto a child before. But many women who remarried are living well and happily too. Besides, if anyone\ndares to bully you, the Snow family will stand up for you.”"
      },
      {
        "paragraph": "Freya could only laugh bitterly. Actually, she should not have so many complaints. “But I won’t let my\nchild acknowledge Rodney as their father. Firstly, he doesn’t deserve it. Secondly, I don’t want my child\nto call Sarah their stepmother in the future.”"
      }
    ]
  },
  {
    "title": "Chapter 1082 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“That will definitely not happen. We don’t have any ties with Rodney anymore. I’ve already arranged for\nthe company to draft a disownment document."
      },
      {
        "paragraph": "We’ll announce it to the public soon,” Jason said without hesitation."
      },
      {
        "paragraph": "Freya was shocked. The Snow family was really efficient in doing things."
      },
      {
        "paragraph": "However, she strangely felt content. Rodney must have wanted to vomit out blood when he lost his\nfamily. Also, how long would Sarah put up with Rodney? She was filled with anticipation all of a sudden."
      },
      {
        "paragraph": "2:00 p.m."
      },
      {
        "paragraph": "Snow Corporation’s official Facebook account released a statement: [Snow Corporation’s director, Jason\nSnow, officially announces that he has ended his father-son relationship with Rodney Snow. At the same\ntime, Rodney will no longer have anything to do with the Snow family from here on out. The Snow family\nmembers will not have any interactions with Rodney either. Mr. Rodney Snow’s right of inheritance to all\nthe Snow family’s assets is void. It’s hoped that each party will go their own ways from now on and never\ninteract anymore.]"
      },
      {
        "paragraph": "Next, Jessica released a statement as well. [Snow Corporation’s president has cut off her sibling ties with\nRodney Snow.]"
      },
      {
        "paragraph": "Carson Snow: [Snow Corporation’s vice president has cut off his sibling ties with Rodney Snow.]"
      },
      {
        "paragraph": "Nathan Snow: [Nathan Snow has ended his relationship as Rodney Snow’s uncle.]"
      },
      {
        "paragraph": "The Snow family’s statements were released one after another."
      },
      {
        "paragraph": "The whole nation was shocked."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "[What on earth did Rodney do to get kicked out of the Snow family? Everyone in the Snow family even\ncut all ties with him.]"
      },
      {
        "paragraph": "[Rodney must be a fool. He has a dad and a sister who have assets worth 1oo billion dollars. He even\nhas an uncle who’ll be the prime minister, yet he angered his family.]"
      },
      {
        "paragraph": "[I heard that it’s because Rodney insists on being together with Sarah. The Snow family is dissatisfied"
      },
      {
        "paragraph": "with her. They prefer his fiancée, Freya, more.]"
      },
      {
        "paragraph": "[This is the future prime minister’s family we’re talking about. Is that a family where a greedy materialistic\nwoman like Sarah can join?]"
      },
      {
        "paragraph": "After half an hour, Nathan posted a pretty picture of Freya on his Facebook. [My wife and I have been\nmarried for many years. We’ve always wanted a daughter. Unfortunately, we only have a troublemaker\nas our son. Luckily, my wife and Freya have been getting along with each other very well. We’ve decided\nto take her in as our goddaughter. Although she couldn’t be our former nephew’s wife, being our\ngoddaughter is good too.]"
      },
      {
        "paragraph": "The netizens were dumbfounded again."
      },
      {
        "paragraph": "[I’m confused. So Rodney really got chased out of the Snow family because he refused to marry Freya?"
      },
      {
        "paragraph": "[I pitied Freya before, but now I’m so envious of her. The future prime minister’s daughter! She’s a\nprincess now.]"
      },
      {
        "paragraph": "[If she can be a princess, why does she have to be Rodney’s fiancée? Ahhh, isn’t being a princess\ntempting?]"
      },
      {
        "paragraph": "[Do you still remember that people used to throw rotten eggs at Freya when she walked on the streets"
      },
      {
        "paragraph": "three years ago? This news tells us not to look down on women. Who knows when she’ll become\npowerful and rise again?]"
      },
      {
        "paragraph": "[I heard Freya pursued a senior in school in the past. They broke up afterward. Will that senior spit out\nblood after reading the news?]"
      },
      {
        "paragraph": "At that moment, Rodney was dumbfounded looking at the series of statements."
      },
      {
        "paragraph": "He did not think that his father was being serious about it. In a swift manner, he had publicly disowned\nhim and the other Snow family members followed suit."
      },
      {
        "paragraph": "Moreover, Nathan took Freya in as his goddaughter as well."
      },
      {
        "paragraph": "That woman had become his cousin?"
      },
      {
        "paragraph": "No, not his cousin. He was not even a member of the Snow family anymore."
      },
      {
        "paragraph": "He was on the verge of crying. Although he had already thought of the worst possible outcome last night\nwhen he decided to make Freya undergo an abortion, he still felt very distressed when the moment really\ncame."
      }
    ]
  },
  {
    "title": "Chapter 1083 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "At that moment, Rodney desperately needed someone to console him. He could only call Sarah. “ Sarah,\nI don’t have to marry Freya anymore. But… I’ve been chased out of the Snow family. You won’t mind,\nright?”"
      },
      {
        "paragraph": "“Why… Why would I mind? You’ve done so many things for my sake… I’m very touched.”"
      },
      {
        "paragraph": "Sarah held in the urge to scold him. She then said in a low voice, “But if I had known earlier that your\nfamily dislikes me so much, I—”"
      },
      {
        "paragraph": "“ Sarah, don’t say any more. I’ve already made my decision. Freya’s child will have nothing to do with me\nin the future, ” Rodney interrupted her annoyedly."
      },
      {
        "paragraph": "Speaking of Freya, Sarah almost wanted to spit out blood. “By the way, why did your uncle take her in a\ns his goddaughter?”"
      },
      {
        "paragraph": "The daughter of the future prime minister. Although she was not his biological daughter, that identity was\npowerful enough that Freya could do anything she wanted in Australia now."
      },
      {
        "paragraph": "Freya could marry into a better family in the future too."
      },
      {
        "paragraph": "“Maybe my family did that to make up for their guilt.” Rodney was depressed too. “Forget it. Just let it be.\nThat woman is too calculating. In the end, she managed to get what she wanted.”"
      },
      {
        "paragraph": "Forget it? How could this matter be brushed off just like that?"
      },
      {
        "paragraph": "Sarah had the urge to swear out loud."
      },
      {
        "paragraph": "She was utterly envious of Freya. How could a sl*t be the future prime minister’s daughter? She wanted\nthat identity too. She would rather give up on Rodney."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Hah! Rodney really returned to her side in the end."
      },
      {
        "paragraph": "However, without the Snow family’s support, he would just be a normal president now no matter how well\nOsher Corporation performed. Besides, the Snow family had disowned him. It would become tougher for\nRodney to advance in the business world. No one would pay him any attention at all."
      },
      {
        "paragraph": "Rodney was poorer than Sarah now."
      },
      {
        "paragraph": "“Rodney, I’m guessing you must be feeling upset now. Take a good rest before apologizing to the Snow\nfamily. There are no grudges that last overnight between father and son.”"
      },
      {
        "paragraph": "Sarah hung up the phone just like that."
      },
      {
        "paragraph": "Rodney was stunned. He had wanted to chat with her more to alleviate his feelings of despair."
      },
      {
        "paragraph": "He gave it some thought and called Chester. “ Chester, I’m in a bad mood. Let’s go have a drink\ntonight…”"
      },
      {
        "paragraph": "“I’m not going.” Chester immediately rejected him. “Are you still my friend?” Rodney was enraged."
      },
      {
        "paragraph": "“I don’t want to die from being angry at you.”"
      },
      {
        "paragraph": "Chester scolded him bluntly, “Rodney, I never thought you would be so silly! You forced Freya to have an\nabortion and even made her fall down the stairs. What were you thinking?”"
      },
      {
        "paragraph": "“I… I just wanted to give Sarah an explanation. I can’t have an illegitimate child. Sarah and I… will have\nkids in the future,” Rodney said in defense."
      },
      {
        "paragraph": "“Mm, then I wish that you both can have kids in the future. Just a reminder, you have to be polite\nwhenever you see Freya in the future. She’s the future prime minister’s goddaughter. A sentence from\nher can crush you to the ground.”"
      },
      {
        "paragraph": "Chester sneered before ending the call."
      },
      {
        "paragraph": "Rodney’s expression was filled with shame and sadness. He was only following his heart, so why was\neveryone leaving him?"
      },
      {
        "paragraph": "In the evening."
      },
      {
        "paragraph": "Catherine brought over a meal. Freya gave her an apologetic glance. “Cathy, I feel sorry for letting you\ntake care of me. Why don’t you go back? I’ll just ask Lauren to come over.”"
      },
      {
        "paragraph": "“It’s alright. What friend would I be if I didn’t accompany you during these times? Besides, when I was\npregnant in the States, didn’t you take good care of me as well?” Catherine noticed that Freya was not\nvery happy."
      },
      {
        "paragraph": "However, she could understand. To give birth to a child who did not have a father would be a battle of\ncourage for any woman."
      },
      {
        "paragraph": "“That’s right. I felt very happy spending time with Suzie and Lucas in the States. Actually, kids are… quite\ncute too.”"
      }
    ]
  },
  {
    "title": "Chapter 1084 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Freya suddenly felt relieved as she thought about it. “Nowadays, there are too many sc*mbags. It’s better\njust to give birth to a child. Just dating and not getting married sounds good too.”"
      },
      {
        "paragraph": "“You’ll still have lots of opportunities, especially after becoming the princess of Australia. There’ll only be\nbetter men pursuing you.”"
      },
      {
        "paragraph": "“Mm—hmm.”"
      },
      {
        "paragraph": "Freya laughed. “Who knows? Maybe after a few years, I’ll be walking down a grand banquet hall wearing\na long gown. When I see those two sc* mbags, Rodney and Patrick, lowering their heads humbly and\nstanding at the side, I’ll wave my hand and say, ‘Guards, get these two pieces of trash out o f here. They\ndon’t deserve to be here and dirty my noble eyes on such an occasion.”’"
      },
      {
        "paragraph": "Catherine let out a breath of relief after seeing Freya finally smiling."
      },
      {
        "paragraph": "After finishing her meal, she gave Wesley a call. “ I’m sorry. I can’t move in tonight. I didn’t know this\nwould happen to Freya…”"
      },
      {
        "paragraph": "“It’s okay. She’s your friend. You should accompany her more.”"
      },
      {
        "paragraph": "Wesley said gently, “Which ward are you both in? I’ll come over to visit later.”"
      },
      {
        "paragraph": "“It’s alright, there’s no need. Too many people from the Snow family came today. Freya’s also feeling\ndizzy. We should let her rest.”"
      },
      {
        "paragraph": "“Okay, I’ll come over tomorrow then.” Wesley hesitated for a moment before suddenly asking, “ Is Nathan\nreally taking her in as his goddaughter?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Of course. Uncle Nathan even released a statement personally. When Freya gets better, the Snow\nfamily will hold a grand ceremony to acknowledge Freya.”"
      },
      {
        "paragraph": "Wesley said profoundly, “It seems like this accident was a blessing in disguise for Freya. The prime\nminister’s goddaughter, this identity is indeed extraordinary.”"
      },
      {
        "paragraph": "“It’s just alright. Freya isn’t someone who cares about these things. ” Catherine frowned when she heard\nhis words."
      },
      {
        "paragraph": "She did not think that it was a blessing in disguise for Freya."
      },
      {
        "paragraph": "It was fine if other people had said the same thing,"
      },
      {
        "paragraph": "but Wesley was someone who understood them. Him saying those words… It was weird."
      },
      {
        "paragraph": "“I misspoke. You guys should rest.”"
      },
      {
        "paragraph": "Not long after Catherine returned to the ward, the sound of someone knocking on the door came from\noutside."
      },
      {
        "paragraph": "She turned around and saw Shaun walking in with the cold white lights shining on him. He was wearing a\nwhite shirt paired with black slacks. He looked handsome and noble."
      },
      {
        "paragraph": "“Why are you here?” Catherine’s brows instinctively knitted together in a tight frown again."
      },
      {
        "paragraph": "Freya gave Shaun a sidelong glance as well. “Shaun, we’re not close to you, right?”"
      },
      {
        "paragraph": "“I heard from Chester that your friend is hospitalized and you’re here taking care of her. I came over to\nvisit.”"
      },
      {
        "paragraph": "Shaun put the things in his hand on the table. “This is the quinoa salad that the five-star hotel just made,\nand—”"
      },
      {
        "paragraph": "“I don’t care about quinoa at all, ” Freya grumbled, “ Do you see this? All of these things beside me are\nquinoa— ”"
      },
      {
        "paragraph": "“And… crayfish. I bought some for you.” Shaun suddenly looked at Catherine. His eyes were so deep\nthat someone could drown in them."
      },
      {
        "paragraph": "Freya’s words got stuck in her throat. F*ck,"
      },
      {
        "paragraph": "crayfish. It was her favorite, but could she even eat it?"
      },
      {
        "paragraph": "Catherine’s eyebrows twitched slightly. “Thank you, but I can buy it myself if I want to eat it."
      },
      {
        "paragraph": "Moreover, Freya can’t eat this. You’ll just be tempting her with it.”"
      },
      {
        "paragraph": "“You liked to eat it before…”"
      },
      {
        "paragraph": "Shaun got rejected by Catherine. His long eyelashes were drooped in disappointment. That face, which\nlooked as if it had been intricately carved by gods, looked so lonely that any woman would not be able to\nbear it."
      },
      {
        "paragraph": "Even Catherine was in a daze for a moment. It was a s if she had hurt him. However, after a while, she\nsaid emotionlessly, “The past is the past. I even loved you in the past, but I don’t anymore now.”"
      },
      {
        "paragraph": "Hiss."
      },
      {
        "paragraph": "Freya could not resist sucking in a breath. Those words were too vicious. When she saw Shaun’s noble,\nhandsome face looking pale and hurt, she wanted to clap her hands."
      }
    ]
  },
  {
    "title": "Chapter 1085 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "However, Shaun would not get angry, right?"
      },
      {
        "paragraph": "She saw Shaun tightly holding onto the plastic bag i n his hands. The veins on the back of his hand were\nbulging."
      },
      {
        "paragraph": "Nevertheless, he did not get angry. He placed the things on the table."
      },
      {
        "paragraph": "His humble and forbearing behavior almost made Freya go blind."
      },
      {
        "paragraph": "Shaun opened the container of crayfish."
      },
      {
        "paragraph": "He put on gloves and started shelling them one by one."
      },
      {
        "paragraph": "The large crayfish inside and the overwhelming fragrance made Catherine and Freya’s stomachs growl."
      },
      {
        "paragraph": "“Shaun, if you want to eat, can you eat it outside?” Catherine said, feeling frustrated."
      },
      {
        "paragraph": "“I’m shelling them for you. I’ll leave when I’m done.”"
      },
      {
        "paragraph": "Shaun said without raising his head, “It’s okay even"
      },
      {
        "paragraph": "if you don’t eat them. I’ll just leave them here after shelling them anyway.”"
      },
      {
        "paragraph": "At that moment, another person who came to visit arrived at the door. It was Charlie. In his hands were\npink roses and some supplements. He had an excessively eager smile. “Hey, Catherine. What a\ncoincidence! We meet again.”"
      },
      {
        "paragraph": "“Charlie, why are you here?” Catherine’s expression was dark."
      },
      {
        "paragraph": "Why were these eyesores all coming over? “Freya, d o you know him?”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“ I don’t f*cking know him.” Freya rolled her eyes."
      },
      {
        "paragraph": "Charlie acted as if he did not hear that. He smiled and said, “I came to visit Ms. Lynch. Ms. Lynch is\nSenator Snow’s goddaughter. My uncle and Minister Snow are acquaintances, so he asked me to visit\nyou.”"
      },
      {
        "paragraph": "The uncle he was talking about was Mason."
      },
      {
        "paragraph": "Catherine immediately guessed that the Campos family was definitely taking the opportunity to establish\na relationship with Nathan. Freya was a new target they could exploit."
      },
      {
        "paragraph": "Catherine was utterly speechless. The Campos family was totally shameless."
      },
      {
        "paragraph": "Charlie continued talking with a gentlemanly face. “ I didn’t expect you to be prettier in person compared\nto the pictures, Ms. Lynch. Although you’re sick, your beauty still makes one’s heart pound…”"
      },
      {
        "paragraph": "Shaun, who was shelling crayfish at the side, suddenly scoffed."
      },
      {
        "paragraph": "Charlie glared at him furiously. “Shaun, what are you doing here? As far as I know, you helped Thomas\nhurt Ms. Lynch before. What right does a person like you have to be here?”"
      },
      {
        "paragraph": "“They haven’t chased me away yet. Why are you so hasty? Have you already become the future prime\nminister’s son-in-law?”"
      },
      {
        "paragraph": "Shaun raised his sharp eyebrows. Hill Corporation was already ruined, but his elegance and piercing\neyes made Charlie feel humiliated."
      },
      {
        "paragraph": "Freya and Catherine were dumbfounded. Catherine said right away, “Charlie, aren’t you and Melanie\nalready married?”"
      },
      {
        "paragraph": "Just as Charlie was about to say something, Shaun beat him to it and said, “A marriage can be ended"
      },
      {
        "paragraph": "through a divorce. Moreover, Melanie’s current identity no longer matches Charlie’s, who’s the noble\nYoung Master Campos. Wouldn’t it be way better for him if he could establish a relationship with the\nfuture prime minister?”"
      },
      {
        "paragraph": "“Shaun, shut your mouth! ”"
      },
      {
        "paragraph": "Charlie was infuriated. Although he did have those thoughts, it was not the time to make them known. “I’\nm just complimenting Ms. Lynch’s beauty. Do you think everyone is like you, not being content with what\nyou already have and taking divorce as child’s play?”"
      },
      {
        "paragraph": "Shaun glanced at him coldly. “It might’ve been my first time hearing a married man say such ambiguous\nwords like ‘Your beauty makes one’s heart pound’ to another woman.”"
      },
      {
        "paragraph": "Charlie’s face was flushed from embarrassment. His eyes were staring at Shaun with malice. “Watch\nyour mouth, Shaun. Do you need me to remind you of your identity?”"
      },
      {
        "paragraph": "“How do you want to remind me?” Shaun smirked playfully."
      },
      {
        "paragraph": "Charlie had no words all of a sudden."
      },
      {
        "paragraph": "He could not possibly say that he would find someone to teach Shaun a lesson. There were other people\nin the ward, so he did not dare to be so cocky."
      },
      {
        "paragraph": "He thought of an idea. He looked eagerly at Freya. “ Ms. Lynch, do you need me to chase this person\naway?”"
      },
      {
        "paragraph": "Freya was taken aback. She instinctively looked at Catherine. In the end, she cleared her throat. “ Cathy,\nwhat do you think?”"
      },
      {
        "paragraph": "Everyone focused their eyes on Catherine. Even Shaun locked his gaze on her."
      },
      {
        "paragraph": "Catherine had the urge to kick both Freya and Charlie."
      },
      {
        "paragraph": "Why were they letting her decide?"
      },
      {
        "paragraph": "She could let Charlie do it… However, she looked at Charlie’s arrogant appearance and then at\nShaun’s… pitiful gaze."
      }
    ]
  },
  {
    "title": "Chapter 1086 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "She…“ If you ask me, I’d like to have both of you leave. The patient needs to rest. We understand your\nkind intentions, so please leave.” Catherine bluntly asked the guests to leave."
      },
      {
        "paragraph": "She gave them both the same treatment."
      },
      {
        "paragraph": "The corners of Shaun’s mouth lifted slightly. It was good enough that she did not let Charlie chase him\naway."
      },
      {
        "paragraph": "However, Charlie felt utterly disgraced. He was the president of Campos Corporation, yet he was\nmentioned alongside Shaun."
      },
      {
        "paragraph": "Nevertheless, Freya’s identity was special now and Catherine was her friend."
      },
      {
        "paragraph": "He could only hold it in. He forced a smile and said, “Then, we won’t be disturbing you two anymore. ”"
      },
      {
        "paragraph": "When Charlie left, he glared at Shaun viciously."
      },
      {
        "paragraph": "Shaun stood up. His dark, captivating eyes were looking at Catherine. “I’ve finished shelling the crayfish\nfor you. I’ll be leaving now.” After he spoke, he turned around and left."
      },
      {
        "paragraph": "Catherine had a headache and touched her forehead."
      },
      {
        "paragraph": "Shaun was already incapable of sex. She did not know what else he wanted to do."
      },
      {
        "paragraph": "“F*ck, has Shaun been possessed by some devil?”"
      },
      {
        "paragraph": "Freya became sentimental. “He’s totally different from the Shaun I knew back then. He was so arrogant\nbefore, especially the aura he had when he snatched you away during the wedding. I thought he’d never\nlet you go in this lifetime.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Could he not let go?"
      },
      {
        "paragraph": "He could not even have sex anymore."
      },
      {
        "paragraph": "“Could it be because he experienced too great of a shock when Hill Corporation met its demise?”"
      },
      {
        "paragraph": "“Alright, stop guessing blindly.” Catherine went to the table. Looking at the delicious crayfish, she wanted\nto throw them away. However, she still ended up tasting one of them in the end. The taste was not bad."
      },
      {
        "paragraph": "At last, she finished everything."
      },
      {
        "paragraph": "After she was done eating, her brows furrowed in regret. She really had no resolve."
      },
      {
        "paragraph": "In the parking lot."
      },
      {
        "paragraph": "Just as Shaun opened the car door, Charlie’s sneer sounded from behind. “Shaun, you really didn’t even\nshow me a single bit of respect up there just now.”"
      },
      {
        "paragraph": "“Why should I show you respect?” Shaun retorted coldly."
      },
      {
        "paragraph": "“Fine, maybe you’re still unclear of the fact that you can only keep your tail between your legs when\nyou’re in front of me now.”"
      },
      {
        "paragraph": "Charlie gave a maniacal laugh before turning around and getting into his car."
      },
      {
        "paragraph": "Shaun frowned."
      },
      {
        "paragraph": "Not long after Shaun’s car left the hospital, he noticed that his car was being followed."
      },
      {
        "paragraph": "Three cars were closing in on him from behind."
      },
      {
        "paragraph": "Shaun’s eyes narrowed. He suddenly increased his speed."
      },
      {
        "paragraph": "Those three cars were not easy to deal with either."
      },
      {
        "paragraph": "They knocked into his car from the left and right."
      },
      {
        "paragraph": "Shaun quickly turned the steering wheel. He passed through a very narrow space between the cars at\nlightning speed. The driver of one of the cars was startled and stepped on the accelerator. It rammed into\nthe car in front."
      },
      {
        "paragraph": "Shaun smirked when he saw this. He swiftly changed his course, stepped on the accelerator, and left\nspeedily."
      },
      {
        "paragraph": "The person who knocked into the other car pounded the steering wheel out of rage. He called Charlie’s\nnumber. “Young Master Campos, we failed.”"
      },
      {
        "paragraph": "“Useless things! ” Charlie scolded."
      },
      {
        "paragraph": "Shaun rushed to the company."
      },
      {
        "paragraph": "Chance had been waiting there for a long time. “ Eldest Young Master Hill, Joshua and Tobias are\nrequesting to leave Liona.”"
      }
    ]
  },
  {
    "title": "Chapter 1087 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“How many people has it been this week?” Shaun asked calmly."
      },
      {
        "paragraph": "Chance clenched his fists. After a long time, he mustered his courage and said, “Young Master Hill,\nactually… I’m also planning to put in a request to leave Liona.”"
      },
      {
        "paragraph": "A hint of disappointment flashed across Shaun’s narrowed eyes. “Why, Chance? I hope you can be\nhonest with me. Is someone headhunting you?”"
      },
      {
        "paragraph": "“No.”"
      },
      {
        "paragraph": "Chance hesitated for a moment but decided to be honest in the end. “Yael is pregnant. Liona doesn’t\nallow dating between superiors and subordinates. That’s why I plan to resign. Moreover, I’m pretty tired\nof this kind of life. I’ll retire with Yael in the future.”"
      },
      {
        "paragraph": "“I see…”"
      },
      {
        "paragraph": "Shaun was surprised. However, he understood that the Hill family was low on funds. Maintaining Liona\nrequired a huge amount of money. He indeed did not have that much money at this moment."
      },
      {
        "paragraph": "Maybe it would be better if those people who wanted to quit left. Those who stayed back were the ones\ntruly loyal to the Hill family."
      },
      {
        "paragraph": "“You can leave,” Shaun said calmly, “I’ll arrange another person to take over your position.”"
      },
      {
        "paragraph": "“Thank you.”"
      },
      {
        "paragraph": "Chance turned around apologetically and left."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“By the way, Chance… ” Shaun suddenly spoke, “ When Liam was tossed into the alley, are you sure\nthat no one else knew about it?”"
      },
      {
        "paragraph": "Chance was startled, but he still said unwaveringly,"
      },
      {
        "paragraph": "“No one else knew.” “Okay.”"
      },
      {
        "paragraph": "After Chance left, Hadley could not help but say, “ Eldest Young Master Hill, what did you mean by that\nlast question?”"
      },
      {
        "paragraph": "“I didn’t expect Yael to be pregnant with his child. ”"
      },
      {
        "paragraph": "Shaun raised his eyebrows. There was a gleam in his eyes. “I always thought Chance was a loyal and\nindifferent superior in the past. But today, I’ve realized I was wrong. If a man can retire for the sake of a\npregnant woman, it means that woman has an important place in his heart."
      },
      {
        "paragraph": "“SO…”"
      },
      {
        "paragraph": "“You’ve forgotten that Yael has been protecting Sarah closely during these three years.”"
      },
      {
        "paragraph": "Shaun reminded Hadley, “What type of person is Sarah? In these three years, Yael always put in good\nwords for Sarah. Yael is skilled at driving wedges between people too. She’s not simple. I suspected her\nbefore, but I trusted Chance.”"
      },
      {
        "paragraph": "Hadley immediately understood. “But now Yael is pregnant with Chance’s child. Chance might’ve hidden\nsome things from you to protect Yael. Young Master Hill, do you want to get someone to follow Chance?”"
      },
      {
        "paragraph": "“Get who?” Shaun smiled bitterly. “Liona is my last power. However, once Chance leaves, there’ll only be\nmore members of Liona who want to leave. Wait and see. Those who are willing to stay till the end are\nthe most loyal ones. I’ll have someone investigate Chance and Yael when that time comes.”"
      },
      {
        "paragraph": "8:00 p.m."
      },
      {
        "paragraph": "After Wesley was done with a social engagement, he got in his private sedan."
      },
      {
        "paragraph": "Suddenly, he realized the driver in front was not moving at all."
      },
      {
        "paragraph": "He sensed that something was wrong. Just as he wanted to turn his head, a gun was pressed to his\ntemple."
      },
      {
        "paragraph": "“Don’t move. ” A man was laughing dangerously."
      },
      {
        "paragraph": "“Who… Who are you?” Wesley glanced at the person beside him from the corner of his eyes. That man\nwas wearing a white mask. He looked very scary."
      },
      {
        "paragraph": "There was a man wearing a black mask sitting on the front passenger seat as well. He was playing with\na gold lighter in a relaxed manner. His buff figure made the interior of the car feel small."
      },
      {
        "paragraph": "“Someone who wants to tell you something.”"
      },
      {
        "paragraph": "The man who was playing with the lighter said, “ Wesley, don’t touch Catherine.”"
      },
      {
        "paragraph": "“You’re Shaun’s men?” Wesley’s eyes went cold."
      },
      {
        "paragraph": "If it was Shaun behind this, Wesley would make him face the consequences. Shaun would never be able\nto rise again in this lifetime."
      },
      {
        "paragraph": "It just so happened that Wesley had wanted to teach Shaun a lesson for a long time."
      },
      {
        "paragraph": "“No.” The man ignited the lighter. In the dark car, the flames appeared. “You just need to remember m y\nwords. If you touch Catherine, I won’t be sitting here and giving you a chance anymore. I’ll immediately\nfire a bullet into your head.”"
      },
      {
        "paragraph": "Wesley clenched his fists. Hisbody trembled out of anger."
      },
      {
        "paragraph": "However, it was as if the man could not see it. His tone was cold. “You desperately want to eliminate me\nnow, right? Who will you look for? Those killers from Neah Bay?”"
      }
    ]
  },
  {
    "title": "Chapter 1088 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Wesley was shocked."
      },
      {
        "paragraph": "No one knew about the killer besides Mason, so how could this person…"
      },
      {
        "paragraph": "“I also know that… your feelings for Catherine Jones have never been pure from the start.”"
      },
      {
        "paragraph": "The person suddenly laughed in a low voice. “ May be other people would have unwavering and unfailing\nlove, but Wesley Lyons’s love is scheming at best.”"
      },
      {
        "paragraph": "Wesley’s body trembled."
      },
      {
        "paragraph": "Who the hell was this person?"
      },
      {
        "paragraph": "Why did this person know his secret when no one should know?"
      },
      {
        "paragraph": "“Don’t touch Catherine Jones. Don’t touch her, or the next time I see you, you’ll be a corpse. You can\ntry…”"
      },
      {
        "paragraph": "The masked man in the passenger seat opened the car door."
      },
      {
        "paragraph": "Then, a black car without a license plate drove over."
      },
      {
        "paragraph": "The man on the other side of Wesley also withdrew. The two men quickly got into the car and left."
      },
      {
        "paragraph": "Wesley punched the leather backrest hard, his warm and handsome face full of rage and panic."
      },
      {
        "paragraph": "When did such a person exist in the capital? He even knew about the murder at Neah Bay."
      },
      {
        "paragraph": "“P-President Lyons.” The driver turned back, trembling."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“Find out who that person is, ” Wesley gave the order in a sinister tone."
      },
      {
        "paragraph": "“Okay. Are we going home now?” the driver asked. “No, send me to the clubhouse.”"
      },
      {
        "paragraph": "Wesley was upset. He originally wanted to go back, but he had lost his mood."
      },
      {
        "paragraph": "That person’s words had made him wary. After all, the other party knew too much."
      },
      {
        "paragraph": "He did not dare to gamble. There could not be any mistakes in his plan."
      },
      {
        "paragraph": "However… he was unreconciled, very unreconciled."
      },
      {
        "paragraph": "He wanted to possess Catherine for a very, very long time."
      },
      {
        "paragraph": "After arriving at the clubhouse, Wesley took a glass of wine and chugged it."
      },
      {
        "paragraph": "The room door suddenly opened, but he ignored it until a finger landed on his back."
      },
      {
        "paragraph": "“Go away…” He looked up and saw Sarah’s charming little face. She had dressed up tonight and was\nwearing a long white dress. She looked like someone who grew up in a dirty environment but remained\npure."
      },
      {
        "paragraph": "Some women indeed possessed such a pure temperament. Otherwise, she would not have been able to\nmake fools of the three young masters for so many years."
      },
      {
        "paragraph": "“Sarah Neeson, what do you want?” Wesley narrowed his eyes in warning."
      },
      {
        "paragraph": "“President Lyons, are you lonely since Catherine isn’t here to accompany you?”"
      },
      {
        "paragraph": "Sarah smiled and sat next to him, refilling his glass. “But even if she’s here, aren’t you tired of pretending\nin front of her?”"
      },
      {
        "paragraph": "Wesley sneered, “Sarah, you’re really the most shameless woman I’ve ever met. Rodney Snow has no\nvalue to you anymore since he’s expelled from the Snow family, right?”"
      },
      {
        "paragraph": "“Not necessarily. As long as it’s not the end yet, there’s the possibility of changing one’s fortune. ”"
      },
      {
        "paragraph": "Sarah did not mind his insults and smiled. “I came here to keep the 1oo billion dollars.”"
      },
      {
        "paragraph": "“You came to the wrong person.” Wesley pinched her chin coldly. “ I helped you in the past because you\nwere useful to me, but what do you have now?”"
      }
    ]
  },
  {
    "title": "Chapter 1089 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "“I have… the future grandchild of the Snow family.”"
      },
      {
        "paragraph": "Sarah lowered her head and suddenly touched her stomach. “Yes, Rodney was expelled from the Snow\nfamily, but his children will always be the flesh and blood of the Snow family. After a long time has\npassed and the Snow family isn’t angry anymore, the child will eventually return to the family.”"
      },
      {
        "paragraph": "Wesley’s eyes moved slightly. “Sarah Neeson, you’re really vicious.”"
      },
      {
        "paragraph": "“Don’t I make a good match for you, then? Not to mention… Don’t you want to taste a woman whom\nShaun Hill once had before?” Sarah leaned over and bit his earlobe gently."
      },
      {
        "paragraph": "Wesley’s body immediately reacted. He pressed Sarah under his body and sneered, “You’re just a\nwoman Shaun didn’t want. He has never touched you before.”"
      },
      {
        "paragraph": "Sarah’s face stiffened, but she forced herself to laugh. “You can’t say that. I was his favorite when we\nwere young. If Catherine hadn’t appeared, it wouldn’t be like this. Besides… I can tell you a secret.”"
      },
      {
        "paragraph": "“What secret?” Wesley raised his eyebrows. “Do you know why Shaun didn’t want Catherine three years\nago? It was because he was under my hypnosis. President Lyons, I’m actually quite useful, especially in\ncontrolling people’s minds.”"
      },
      {
        "paragraph": "Sarah smiled and wrapped her arms around his neck. “From the first time we met, I could tell that you’re\nan extraordinary man who can remain persistent no matter the years. The position Mason Campos sits in\nnow will belong to you in the future.”"
      },
      {
        "paragraph": "Wesley’s dark eyes flashed."
      },
      {
        "paragraph": "It was no wonder that Shaun suddenly did not want Catherine three years ago."
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "In other words, Sarah Neeson was still of use."
      },
      {
        "paragraph": "Besides, he did not mind trying out a woman who had once belonged to Shaun Hill."
      },
      {
        "paragraph": "“Fine, I’ll help you. ” Wesley cupped her chin and kissed her as if he was venting."
      },
      {
        "paragraph": "Freya stayed in the hospital for three days before she was discharged."
      },
      {
        "paragraph": "However, instead of returning to Brighton Gardens, she was taken to the Snow family’s villa by the Snow\nfamily."
      },
      {
        "paragraph": "With the Snow family to look after her, Catherine moved to Wesley’s place."
      },
      {
        "paragraph": "Originally, she wanted to bring Lucas along with her as well. However, Lucas said he wanted to stay with\nJoel, so she let him."
      },
      {
        "paragraph": "“This is President Lyons’ bedroom.” Regina helped her move her luggage in."
      },
      {
        "paragraph": "“… Okay, thank you.” Catherine looked at the bedroom. It was very clean and bright with a great view,\nbut she still felt great pressure when she thought that she was really going to start staying in the same\nbedroom as Wesley."
      },
      {
        "paragraph": "“You’re welcome. You can look for me if you need anything.” When Regina turned to leave, she looked at\nthe big bed with mockery in her eyes."
      },
      {
        "paragraph": "Hah, it was a spot where she had gotten tired of sleeping in. It was just a pity that Catherine would not\nknow the truth."
      },
      {
        "paragraph": "After Regina left, Catherine started cooking. This was the beginning of their lives as husband and wife."
      },
      {
        "paragraph": "– At 6 3o p.m., Wesley came back. When he looked at the figure busying about in the kitchen, his eyes\nbecame filled with chagrin and resentment."
      },
      {
        "paragraph": "He finally got this woman in here, but he could not touch her."
      },
      {
        "paragraph": "He had someone investigate the masked man, but there was no news at all. That person was too\nbizarre."
      },
      {
        "paragraph": "However, he had two women, Regina and Sarah, to attend to his physical needs. Hence, he was in no\nhurry."
      },
      {
        "paragraph": "Especially that woman, Sarah Neeson. Tsk, she was full of tricks."
      },
      {
        "paragraph": "“Wesley, it’s time to eat. Why are you spacing out?” Catherine smiled and brought out the dishes."
      },
      {
        "paragraph": "“ I feel so happy. It’s like I’m dreaming.” Wesley held her hand. “I’ve been waiting for this day for too\nlong.”"
      },
      {
        "paragraph": "“Wesley, it’s been hard on you all these years. I’ve already decided to work on this marriage with you.”"
      },
      {
        "paragraph": "Catherine said as if she had made up her mind. “… Yes.”"
      },
      {
        "paragraph": "Wesley lowered his eyes."
      }
    ]
  },
  {
    "title": "Chapter 1090 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "At 9:00 p.m., Catherine was taking a shower in the bedroom’s bathroom. The sound of the running water\nmade her very nervous. When she thought that she would be doing it with Wesley later, her body felt\nrepulsed."
      },
      {
        "paragraph": "However, there were some things that she would not be as resistant to after taking the first step, right?"
      },
      {
        "paragraph": "She could not spend her life only accepting Shaun. She gritted her teeth and went out."
      },
      {
        "paragraph": "However, what greeted her was Wesley holding the blanket and preparing to go out."
      },
      {
        "paragraph": "“Cathy, I don’t think you’re mentally prepared just yet. I want to give you some time to gather yourself.”\nWesley smiled. “Besides, I’ve been very busy at work recently and have to work overtime at night, so I’ll\nsleep in the next room for the time being.”"
      },
      {
        "paragraph": "“ ” Catherine bit her lip, feeling touched. “Wesley, I can— ”"
      },
      {
        "paragraph": "“Don’t force yourself. I don’t want to force you at all, ” Wesley interrupted her."
      },
      {
        "paragraph": "Catherine was so touched that she felt like she was i n a mess."
      },
      {
        "paragraph": "She felt immensely guilty when she recalled having ever doubted Wesley."
      },
      {
        "paragraph": "Not long after Wesley went next door, Suzie suddenly called her while sobbing. “Aunty Cathy, I’m sick! I\nmiss you.”"
      },
      {
        "paragraph": "“Suzie, what happened?” Catherine was worried."
      },
      {
        "paragraph": "Suzie cried out, “My head hurts. I have a fever. I miss you…”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South]"
      },
      {
        "paragraph": "Catherine could not bear listening to the child’s cries. She felt her heart breaking the moment she heard\nSuzie’s cries and could not care about anything else. “Where are you? I’ll come to you right away.”"
      },
      {
        "paragraph": "“I’m in the hospital.”"
      },
      {
        "paragraph": "Catherine became even more anxious when she heard that Suzie was in the hospital. She hurriedly went\nnext door to tell Wesley that she was going to the company as something had come up."
      },
      {
        "paragraph": "She did not dare say she was looking for Suzie. She was afraid that Wesley would mind if she got too\nclose to the Hill family."
      },
      {
        "paragraph": "In the hospital. \nAfter Suzie was done crying and hung up the call, she immediately turned around and hugged Chester’s\narm fawningly. “Uncle, where’s the candy you promised me?”"
      },
      {
        "paragraph": "Chester was speechless and took out a lollipop from the drawer before giving it to her. Then, he turned to\nShaun. “Your niece’s acting is amazing.”"
      },
      {
        "paragraph": "Shaun glanced at him. “Have you talked to the doctor already?”"
      },
      {
        "paragraph": "“Don’t worry, there won’t be any loopholes. Go quickly.” Chester was speechless. It had taken great\npains to trick Catherine to come out tonight."
      },
      {
        "paragraph": "When Catherine rushed to the hospital, Suzie, who had just finished eating the lollipop, was asleep in\nShaun’s arms."
      },
      {
        "paragraph": "The father and daughter sat on the chair in the hospital. Suzie had her eyes closed, looking adorable. It\nmade people feel tender affection for her."
      },
      {
        "paragraph": "Maybe it was the bleak hospital environment, but Catherine’s heart ached when she saw them. Suzie\nhad always been delicate and loved to cry when she got sick, but Catherine was not able to be with her"
      },
      {
        "paragraph": "from the very start."
      },
      {
        "paragraph": "“Suzie…”"
      },
      {
        "paragraph": "Her eyes could not help but redden."
      },
      {
        "paragraph": "A trace of guilt flashed in Shaun’s eyes. He did not expect Catherine to care so much about Suzie. After\nall, Suzie was not her child."
      },
      {
        "paragraph": "“Suzie is asleep.”"
      },
      {
        "paragraph": "Shaun lied without a change in expression. “She had a fever just now, but she’s much better after taking\nfever medicine. She was crying and saying she missed you. Sorry that we disturbed your sleep.”"
      },
      {
        "paragraph": "“Why did she suddenly get a fever?” Catherine asked with red eyes."
      },
      {
        "paragraph": "She really wanted to take Suzie back with her now."
      },
      {
        "paragraph": "As a mother, she would only feel relieved if she took care of her child herself."
      },
      {
        "paragraph": "“… She kicked the blanket off at night.” Shaun casually found a reason."
      },
      {
        "paragraph": "“Where’s the nanny? Didn’t the nanny help cover her back up?” Catherine asked angrily."
      }
    ]
  }


]