[


  {
    "title": "Chapter 1100 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "The guests immediately looked over."
      },
      {
        "paragraph": "They recognized the woman as Chelsea Holt, the youngest daughter of the Holt family. They had already\nheard that the eldest daughter of the Holt family, Joanne Holt, had become Mason Campos’ woman."
      },
      {
        "paragraph": "The smart ones immediately figured out what was going on when they saw this scene. Someone\nattentively came forward and asked, “Young Lady Holt, what’s wrong?”"
      },
      {
        "paragraph": "Chelsea pointed at Shaun with red eyes and complained, “ I saw him standing here alone so I came to\ngreet him, but after a few words, he started to flirt with me. I wanted to leave, but he grabbed my hand\nand pulled me. He even spilled his wine on my dress. Oh, how can I face other people like this?”"
      },
      {
        "paragraph": "She clutched her chest and sobbed."
      },
      {
        "paragraph": "“You’re shameless!” A young man immediately pointed at Shaun and yelled, “ Shaun Hill, who do you\nthink Ms. Holt is? Do you think you can lay a hand on her? Why don’t you take a mirror to look at your\ncurrent self?"
      },
      {
        "paragraph": "“Why did the Snow family invite such a rogue like you? Apologize to Young Lady Holt immediately.”"
      },
      {
        "paragraph": "Everyone started to talk, and Shaun’s face flushed with scorn."
      },
      {
        "paragraph": "He had just been standing here to rest, but Chelsea suddenly came over to pester him. He did not want\nto be disturbed and wanted to leave, but she suddenly poured his wine on her. It was clear that she\nwanted to frame him."
      },
      {
        "paragraph": "“Young Lady Holt, please look at your face before telling others I was flirting with you. My taste isn’t that\nlow.”"
      },

      {
        "paragraph": "Shaun said faintly, “If you want me to apologize, sure. Take out the surveillance footage. If I’m the one at\nfault, I’ll apologize.”"
      },
      {
        "paragraph": "“What surveillance footage? It’s clearly your fault. ”"
      },
      {
        "paragraph": "A young man from a wealthy family sneered, “I think you’re just trying to stick to the Holt family because\nthe Hill family is done for.”"
      },
      {
        "paragraph": "“Yeah, don’t think of leaving this place if you don’t apologize to Young Lady Holt on your knees.”"
      },
      {
        "paragraph": "A group of people surrounded Shaun and pointed at him. Of course, there were people who did not say\nanything, but they were all looking at the scene like they were watching a show. Shaun suddenly seemed\nto be completely isolated."
      },
      {
        "paragraph": "“Chelsea, what’s going on?” Mason and Charlie walked over at the same time. Charlie’s expression was\nfull of gloating."
      },
      {
        "paragraph": "“Mason, you’re just in time. He bullied me and splashed wine on me, ” Chelsea said with red eyes."
      },
      {
        "paragraph": "“Shaun Hill, you’re really capable. A big man has his own ways of taking liberties with a woman,” Charlie\nimmediately said, “Kneel down and apologize to Chelsea immediately. We’ll forgive you then.”"
      },
      {
        "paragraph": "Mason stood by the side, his elegant face dignified and dark."
      },
      {
        "paragraph": "It was clear that he wanted what Charlie wanted too. “You want me to kneel?”"
      },
      {
        "paragraph": "Shaun’s delicate and thin lips curled coldly. His gaze swept over everyone one by one. “I’m afraid you’re\nnot qualified.”"
      },
      {
        "paragraph": "“He’s too rampant. Throw him out!” someone shouted."
      },
      {
        "paragraph": "Mason looked at the crowd gently. “Don’t say that. He was invited by the Snow family.”"
      },
      {
        "paragraph": "“So what if he was invited by the Snow family? Throw him out. He has no right to stay here.”"
      },
      {
        "paragraph": "Many rich kids came forward and started pushing Shaun."
      },
      {
        "paragraph": "Freya, who was not far away, clicked her tongue. “ When a wall is about to fall, everyone gives it a\nshove. It doesn’t matter if Shaun is being framed. Those people just want to see him get embarrassed.”\n“Freya, go help him out, ” Catherine finally sighed and said to her."
      }
    ]
  },
  {
    "title": "Chapter 1101 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Freya looked at Catherine with a vague smile. “ Can’t bear to see him like that?”"
      },
      {
        "paragraph": "“Don’t be ridiculous.” Catherine rolled her eyes. “ I’m a kind-hearted person whose heart overflows with\njustice. I can’t stand to see any acts of bullying.”"
      },
      {
        "paragraph": "“But my heart isn’t overflowing with justice. I haven’ t forgotten how Shaun allowed Thomas to hurt me, ”\nFreya deliberately said."
      },
      {
        "paragraph": "Catherine, “ ”"
      },
      {
        "paragraph": "“Forget it, I’m just kidding.” Freya suddenly smiled. “I’m the same as you. I don’t like to see others\nbullying the weak.”"
      },
      {
        "paragraph": "Catherine was speechless. That woman actually teased her."
      },
      {
        "paragraph": "“Wait here.”"
      },
      {
        "paragraph": "Freya flicked her hair and put on a princess-like temperament before walking over just in time to see\nShaun grab the wrist of a young man who was pushing him."
      },
      {
        "paragraph": "“Ouch, it hurts!” The young man bent over and screamed, “Help, Shaun is bullying me!”"
      },
      {
        "paragraph": "“You’re also a man, but you only know how to shout for help. If I were you, I’d be too embarrassed to\nshout. ” Shaun gripped the man’s wrist tightly, giving off a chilly aura. Although his current status was\nprobably the lowest among everyone at this banquet, his sharp eyes when he was angry made the\npeople around him fear him."
      },
      {
        "paragraph": "Seeing how the people around Shaun were no longer pushing him, Charlie hurriedly shouted righteously,\n“Shaun Hill, let go of Young Master Riley’s hand immediately! I’ve never met such an arrogant bully"
      },

      {
        "paragraph": "before.”"
      },
      {
        "paragraph": "He suddenly stopped his words when he saw Jason Snow from the Snow family coming over. Charlie\nquickly said, “Uncle Jason, you’re just in time."
      },
      {
        "paragraph": "Shaun tried to take liberties with Young Lady Holt and we scolded him, but he beat up Young Master\nRiley.”"
      },
      {
        "paragraph": "“Uncle Jason, help me. My hand is going to break. ” Young Master Riley took the chance to cry out with a\nbitter face."
      },
      {
        "paragraph": "“President Snow, hurry up and kick Shaun out. He’s too arrogant.”"
      },
      {
        "paragraph": "“Yes, he pushed me earlier too.”"
      },
      {
        "paragraph": "“Me too. I was almost pushed down by him.”"
      },
      {
        "paragraph": "The large group of people pointed at Shaun with indignation as if he had done something heinous."
      },
      {
        "paragraph": "Those who did not know what was going on also started to talk in low voices."
      },
      {
        "paragraph": "“Isn’t that Shaun Hill? Why did the Snow family invite him over?”"
      },
      {
        "paragraph": "“ I heard the Snow and Hill families shared a good relationship before.”"
      },
      {
        "paragraph": "“But the Hill family isn’t qualified to be in such a place now. If I were him, I wouldn’t have dared to come.”"
      },
      {
        "paragraph": "“I heard he’s looking for a young lady from a rich family. I think he was rejected by Young Lady Holt in\npublic after he tried to hook up with her.”"
      },
      {
        "paragraph": "“Yes, with the Hill family’s current situation, he must be looking for a rich young lady to rely on. I never\nexpected Shaun Hill to fall this far down.”"
      },
      {
        "paragraph": "The people in the banquet hall gathered around to watch the show."
      },
      {
        "paragraph": "Shaun’s handsome face gradually oozed with frost. He had seen too many people who would throw\nstones at someone who had fallen down a well, but each of these rich noblemen made him open his\neyes."
      },
      {
        "paragraph": "The truth was not important to them. What was important was that they wanted to see him being thrown\nout of the party wretchedly."
      },
      {
        "paragraph": "“Uncle Jason, I didn’t do it.” Shaun explained in a low voice."
      },
      {
        "paragraph": "Jason looked at his elegant and reserved face. He also did not believe that Shaun would do such a thing,\nbut so many guests were accusing Shaun, so he could not protect him in public. He said helplessly,\n“Shaun, why don’t you go back first…”"
      },
      {
        "paragraph": "“Uncle…”"
      }
    ]
  },
  {
    "title": "Chapter 1102 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Freya appeared at that moment. She grabbed Jason’s arm and smiled like a pampered child. “ If you tell\nhim to leave like that, he’ll be unconvinced. No matter what, tonight’s party is still for me. I think for the\nsake of fairness, let’s check the surveillance footage. It’ll be clear at a glance who’s in the right and\nwrong.”"
      },
      {
        "paragraph": "At those words, everyone’s faces immediately changed."
      },
      {
        "paragraph": "Shaun looked at Freya in shock. He thought that Freya hated him very much."
      },
      {
        "paragraph": "“Ms. Lynch, what do you mean? You don’t believe me?” Chelsea got a fright and hurriedly spoke up like\nshe was being wronged."
      },
      {
        "paragraph": "“Yeah, it’s clear that he started it. My hand still hurts even now, ” Young Master Riley piped up\nimmediately."
      },
      {
        "paragraph": "“When did I say that I didn’t believe you?”"
      },
      {
        "paragraph": "Freya pretended to be aggrieved and pouted. “It’s because Shaun isn’t convinced, and I don’t want to\ngive him the opportunity to argue again. You guys don’t care, but if news of this spreads, people outside\nwill say that I bully the weak.”"
      },
      {
        "paragraph": "Jason’s expression sank as he immediately said, “ That’s right, our Snow family has always been fair in\ndoing things. Besides, today is a big day for Freya. We don’t want her to have a bad reputation.”"
      },
      {
        "paragraph": "Chelsea hurriedly said, “Ms. Lynch, you’ve misunderstood me. This matter is actually very clear.\nEveryone here is a witness. Just ask anyone and you’ll find out that I didn’t lie. There’s no need to check\nthe surveillance footage."
      },

      {
        "paragraph": "“Yes, it was Shaun who splashed wine on Young Lady Holt.”"
      },
      {
        "paragraph": "Words of agreement immediately echoed."
      },
      {
        "paragraph": "Freya looked confused. “It’s not that hard to check the surveillance footage. It’ll be done in two minutes,\nand we’ll be able to get conclusive evidence. I believe Shaun won’t be able to refute anything then.\nWhen the time comes, he’ll kneel down and apologize to Young Lady Holt. It won’t be too late to drive\nhim out then.”"
      },
      {
        "paragraph": "“I support checking the surveillance footage.” Shaun curled his lips coldly."
      },
      {
        "paragraph": "Chelsea’s face immediately turned unpleasant and she quickly glanced at Mason, who smiled at Jason.\n“Forget it. It’s just the young people messing around. My head hurts from all the noise. President Snow,\nlet’s go to the side to have a few drinks.”"
      },
      {
        "paragraph": "Shaun smiled mockingly. “What? All of you are no longer making a fuss just as we’re about to check the\nsurveillance footage. Didn’t you all scold me quite fiercely just now?”"
      },
      {
        "paragraph": "Chelsea flushed and snapped, “Shaun Hill, I just don’t want to make things hard for Ms. Lynch. I’m\nshowing the Snow family courtesy, but I’m warning you, stay away from me next time. If you try to take\nliberties with me again, I won’t be so polite next time.”"
      },
      {
        "paragraph": "Then, she swiftly slipped away."
      },
      {
        "paragraph": "She knew that once they checked the surveillance footage, everyone would see that she had framed\nShaun."
      },
      {
        "paragraph": "However, she never expected this. Out of all the scenarios she played out in her head, she did not think\nthat Freya Lynch would help Shaun."
      },
      {
        "paragraph": "She slipped out so fast that everyone could tell what was going on."
      },
      {
        "paragraph": "However, no one said a thing. There were some people who were quite resentful. After all, they all\nwanted to see the miserable sight of the once richest man being thrown out of the banquet hall."
      },
      {
        "paragraph": "The rich young masters who pushed Shaun earlier saw that the situation was not right and immediately\nfound excuses to leave. Soon, only Jason and Freya were left."
      },
      {
        "paragraph": "“Uncle Jason, Ms. Lynch, thank you.” Shaun looked at them. He never thought that one day, Freya would\nhelp me."
      },
      {
        "paragraph": "“Don’t thank me. If it weren’t for…” Freya almost blurted it out and quickly shut her mouth. She glared at\nShaun. “I just don’ t like people making trouble at my party.”"
      },
      {
        "paragraph": "She turned and left."
      },
      {
        "paragraph": "Shaun glanced in the direction she was walking and saw Catherine standing there."
      },
      {
        "paragraph": "His eyes softened slightly, just like warm water."
      },
      {
        "paragraph": "Jason sighed. “Go back early. Those people just wanted to mess with you. Maybe I shouldn’t have called\nyou here tonight.”"
      },
      {
        "paragraph": "“Even if you hadn’t invited me, I would’ve still come.”"
      },
      {
        "paragraph": "Shaun’s gaze was fixed on Catherine."
      },
      {
        "paragraph": "Jason looked over and instantly understood."
      }
    ]
  },
  {
    "title": "Chapter 1103 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Done.”"
      },
      {
        "paragraph": "After Freya walked over, she winked at Catherine."
      },
      {
        "paragraph": "Catherine was just about to speak when she suddenly noticed that Shaun was looking over. Since he\nwas far away, she could not see his eyes clearly, but it still made her feel awkward. “You didn’t say\nanything to him, right?”"
      },
      {
        "paragraph": "“I didn’t say anything.” Freya shook her head. “He doesn’t know that you’re worried about him.”"
      },
      {
        "paragraph": "“I’m not worried about him.”"
      },
      {
        "paragraph": "Catherine immediately glared as if she had been poked in a sore spot."
      },
      {
        "paragraph": "“Don’t deny it, I understand.”"
      },
      {
        "paragraph": "Freya placed a hand around Catherine’s shoulder. “ After all, he’s a man you once loved. When you see\nhim in such dire straits, your heart will naturally feel differently than others. In short, it’s complicated.\nThere’s a little hate, a little sympathy, and maybe something unknown— ”"
      },
      {
        "paragraph": "“Shut up. I’m going to find Wesley. I can’t be bothered with you anymore.”"
      },
      {
        "paragraph": "Catherine pushed her away with a deadpan face and turned around."
      },
      {
        "paragraph": "Although she was looking for Wesley, Freya’s words would echo in her mind."
      },
      {
        "paragraph": "Yes, she hated Shaun before and had even cursed him to lose everything."
      },
      {
        "paragraph": "However, now that he had become like this, she did not feel all that happy—especially when she saw\nhim being bullied by everyone."
      },

      {
        "paragraph": "However, she refused to admit that she was worried about him."
      },
      {
        "paragraph": "How could she be worried about him? It was only because of Suzie."
      },
      {
        "paragraph": "After wandering around, she finally found Wesley in the tea room on the second floor. He was drinking\ntea with a few portly middle-aged men."
      },
      {
        "paragraph": "Looking at those people, they did not look like they were businessmen. It was clear that they were\ninfluential people in politics."
      },
      {
        "paragraph": "Wesley was talking and laughing with them. Occasionally, he would diligently pour tea for the people.\nThe sight of him flattering the others there made Catherine subconsciously stop in her steps."
      },
      {
        "paragraph": "She felt a little uncomfortable."
      },
      {
        "paragraph": "She rarely saw Wesley like this. In her memory, Wesley had always been gentle and elegant, but she\ncould see that Wesley was currying favor with these people."
      },
      {
        "paragraph": "She found this sight of Wesley rather unfamiliar. She knew she should not be like this. Everyone had to\nsweet talk and flatter others when it came to business, but she subconsciously felt resistant to it."
      },
      {
        "paragraph": "She suddenly remembered how Wesley had offered to accompany her to the banquet."
      },
      {
        "paragraph": "Was it really because he was afraid that Shaun would steal her away?"
      },
      {
        "paragraph": "In truth, was it actually because he wanted to befriend this group of powerful figures?"
      },
      {
        "paragraph": "“Is that your so-called husband? He’s quite good at kissing *ss.”"
      },
      {
        "paragraph": "Shaun’s cold voice suddenly sounded above her."
      },
      {
        "paragraph": "Catherine turned around and saw his sarcastic face. She felt her heart being stabbed by something. “It’s\nbetter than a certain someone who wants others to kiss his *ss but no one cares about him.”"
      },
      {
        "paragraph": "“Yes, I want to kiss your *ss but you don’t care about me.” Shaun’s gaze when he looked at her suddenly\nmelted like snow in spring; it was full of tenderness."
      },
      {
        "paragraph": "The corners of Catherine’s mouth twitched, but before she could react, she was pulled to the other side\nby Shaun."
      },
      {
        "paragraph": "“Shaun Hill, let me go.” Catherine lowered her voice and tried to shake off his hand. Her eyes glanced\nnervously at Wesley, afraid that he would see."
      },
      {
        "paragraph": "“Don’t worry, his heart is now full of Senator Mead. He has no time to pay attention to you.” Shaun\npushed open a small door on the side and pulled her in. He pressed her against the wall and caged her\nin."
      }
    ]
  },
  {
    "title": "Chapter 1104 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "The lights were not turned on inside. The man’s body loomed over her as his scent filled her nose.\nCatherine felt upset and lowered her voice, asking, “ Shaun Hill, why did you bring me here?”"
      },
      {
        "paragraph": "“Don’t you want to know who Senator Mead is? ” Shaun changed the topic as if he did not hear her\nwords."
      },
      {
        "paragraph": "Catherine froze, and he said, “Senator Mead is the vice president who’ll take office next year. Wesley is\nworking hard to please him now, which is probably his main purpose in coming tonight.”"
      },
      {
        "paragraph": "Catherine was completely shocked."
      },
      {
        "paragraph": "She thought that Wesley was only trying to curry favor with a powerful person, but she did not expect it to\nbe the future vice president."
      },
      {
        "paragraph": "“Also, you might not know this, but Senator Mead and Nathan Snow are on the same boat. If he has a\ngood relationship with Senator Mead, he’ll also be building a bridge with Nathan.”"
      },
      {
        "paragraph": "Shaun lowered his head and looked at her gently. “Do you know why Senator Mead is talking to him?”"
      },
      {
        "paragraph": "Catherine’s scalp tingled as she said in annoyance, “ Maybe Wesley already knows him. There’s nothing\nstrange about that.”"
      },
      {
        "paragraph": "“No, Wesley didn’t know him before this at all. He doesn’t have the capital to connect with people of that\nstatus.”"
      },
      {
        "paragraph": "Shaun said faintly, “Tonight, the Snow family is celebrating your good friend, Freya. They’ve invited\npeople from the political and business sectors. The Snow family wants to make it clear to the outside\nworld that they think highly of Freya and to affirm her future position in the country.”"
      },

      {
        "paragraph": "“So…” Catherine did not know what he was trying to say."
      },
      {
        "paragraph": "“After Wesley entered with you, Freya personally came to meet you and also introduced Heidi Lloyd to\nyou. The people present are all smart. They’ll think that Wesley knows the future president’s wife and\ntoday’s protagonist, Freya. They’ll naturally be impressed with him. He then took advantage of the\nopportunity to build a relationship with Senator Mead.”"
      },
      {
        "paragraph": "Shaun’s eyes gradually became cold and deep."
      },
      {
        "paragraph": "In the past, he only suspected that Wesley was not a simple man, but after tonight, he was certain."
      },
      {
        "paragraph": "He would not allow Cathy to be with a hypocritical man like that."
      },
      {
        "paragraph": "Catherine was completely stunned."
      },
      {
        "paragraph": "She would never have suspected that Wesley’s real purpose in coming here was to get to know the\ndignitaries."
      },
      {
        "paragraph": "However, after hearing Shaun’s words, it seemed like Wesley had deep schemes."
      },
      {
        "paragraph": "Her brows furrowed, and a second later, she looked up at Shaun’s handsome face before sneering. “\nFine, even if what you said is true, what about it? Are you trying to say that Wesley is unfathomable?\nShaun Hill, they’re all people who’ve struggled in the business world. In order to succeed, flattery is\nneeded. All that is very normal. Wesley wants to advance and consolidate his position, so it’s only natural\nthat he would try to get acquainted with the vice president. What about you? You came here tonight\nbecause you wanted to expand your network and get to know the bigwigs too, right?”"
      },
      {
        "paragraph": "“No.”"
      },
      {
        "paragraph": "Shaun’s thin lips moved as he denied it. “I came here because I knew you’d come.”"
      },
      {
        "paragraph": "The man’s eyes carried flames that shone brightly."
      },
      {
        "paragraph": "Catherine’s face immediately heated up as she became embarrassed. She only glared at him, as if\nasking ‘Do you think I’m stupid?’"
      },
      {
        "paragraph": "Shaun looked at her big and bright eyes before suddenly revealing a sexy smile. “Thank you for asking\nFreya to help me earlier.”"
      },
      {
        "paragraph": "“When did I ask Freya to help you?” Catherine sneered, “Don’t flatter yourself.”"
      },
      {
        "paragraph": "“I’m not flattering myself. I just think that… you’re very kind.”"
      },
      {
        "paragraph": "Shaun’s smile was very ambiguous."
      },
      {
        "paragraph": "Catherine felt like she had given herself away by trying to hide her intentions."
      },
      {
        "paragraph": "“Get out of the way, I’m going out.”"
      },
      {
        "paragraph": "She pushed him hard, but Shaun’s chest was like a wall. She could not make him budge at all."
      }
    ]
  },
  {
    "title": "Chapter 1105 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Shaun Hill, what the hell do you want?”"
      },
      {
        "paragraph": "Catherine was powerless. “Do you know how bad your reputation is right now? If people find out that I’m\nalone in the same room as you, they’ll misunderstand.”"
      },
      {
        "paragraph": "Shaun lowered his eyes."
      },
      {
        "paragraph": "The bright moonlight shone through the window, outlining his straight nose and thick eyelashes. He\nlooked exquisite and magnificent like a sculpture."
      },
      {
        "paragraph": "He was clearly a man in his 30s, but when he pursed his thin lips and fell silent, he looked like a\nyoungster in his early 20s. He looked miserable like he was… an abandoned puppy."
      },
      {
        "paragraph": "Catherine could not help but remember what Freya said."
      },
      {
        "paragraph": "He was still a man she used to love. Although she hated him before, when she saw him so despondent\nand getting bullied by others, she would feel differently from others."
      },
      {
        "paragraph": "Yes, things were a little different now."
      },
      {
        "paragraph": "She thought that the current Shaun Hill… seemed a little pitiful—so pitiful that it made her heart soften…"
      },
      {
        "paragraph": "No, she could not think about it. She would go crazy."
      },
      {
        "paragraph": "Catherine bent down and tried to duck under his arm."
      },
      {
        "paragraph": "However, the man’s arm clamped down and he immediately held her body in his arms."
      },
      {
        "paragraph": "He had only trapped her between the wall earlier, but now, they were pressed against each other."
      },

      {
        "paragraph": "“Shaun Hill, are you done?”"
      },
      {
        "paragraph": "Catherine exploded, but she could not be too loud. Even if she was throwing a tantrum, she could only\ndo it softly. “You said you can’t do it anymore, so why do you keep pestering me? Why are you so\nselfish? If I had known, I’d have let you be kicked out earlier.”"
      },
      {
        "paragraph": "Shaun’s eyelashes trembled as his eyes brightened. “So… You really did let Freya help me?”"
      },
      {
        "paragraph": "Catherine bit her lip in annoyance and snapped at him, “It’s because I’m kind-hearted and I happened to\nsee Chelsea set you up. Although I don’t like you, I’m not that despicable.”"
      },
      {
        "paragraph": "“So… you’ve always been looking at me.” Shaun smiled gently."
      },
      {
        "paragraph": "Catherine became upset and explained anxiously, “I just… saw you by coincidence. It was by chance."
      },
      {
        "paragraph": "Besides, even if it weren’t you but another man, I would’ve done the same.”"
      },
      {
        "paragraph": "“Would you pay attention to other men?”"
      },
      {
        "paragraph": "Shaun raised his hand thoughtfully and touched her silky smooth face. “Cathy, if my body were fine, even\nif I’m not the richest man in the country anymore, I wouldn’t let go of your hand. But for now…”"
      },
      {
        "paragraph": "The bottom of his eyes welled up with a twinge of pain. After a moment, he pulled out a pill from his\npocket and handed it over. “Take it and I’ll let you g"
      },
      {
        "paragraph": "Catherine looked at it curiously and saw that it was… contraceptives."
      },
      {
        "paragraph": "She was stunned and threw it at his face furiously. “ Shaun Hill, why are you giving me this? Are you\ncrazy?”"
      },
      {
        "paragraph": "“Take it.”"
      },
      {
        "paragraph": "Shaun picked up the pill and grabbed her wrist, saying firmly, “I won’t let you have Wesley’s child.”"
      },
      {
        "paragraph": "Wesley and she were living under the same roof. He had no way of stopping them from sleeping\ntogether, so he could only use this method."
      },
      {
        "paragraph": "Catherine widened her eyes. Did he think she… had done it with Wesley?"
      },
      {
        "paragraph": "She was completely speechless, but she did not want to tell him about her and Wesley’s matters."
      },
      {
        "paragraph": "“You’re insane. Wesley and I are already married. It’s our business whether we have children or not. Stay\nout of it. ” Catherine struggled hard but could not break free. She ended up kicking Shaun in anger."
      },
      {
        "paragraph": "Shaun dodged and warned her, “Are you sure you want to fight with me here? I don’t mind the fame, but\nyou have to take care of Wesley’s and your reputation.”"
      },
      {
        "paragraph": "“Shameless!” Catherine’s eyes were filled with resentment."
      },
      {
        "paragraph": "Sure enough, she should not have been soft- hearted to this wretched man."
      },
      {
        "paragraph": "“Cathy, take it. I’ll let you go if you take it.” Shaun took the pill and pressed it to her mouth."
      },
      {
        "paragraph": "It was just a pill, so it did not matter to Catherine if she took it or not. However, she was unwilling to be\nthreatened by him."
      },
      {
        "paragraph": "“Why should I take it just because you told me to? I won’t take it. What are you going to do about it?”\nCatherine smacked the pill to the ground and glared at him."
      },
      {
        "paragraph": "Shaun clenched the pill in his hand and frowned deeply. “Cathy, don’t force me.”"
      }
    ]
  },
  {
    "title": "Chapter 1106 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“How am I forcing you— ”"
      },
      {
        "paragraph": "Before Catherine could finish, the man suddenly lowered his head. Then, her lips were sealed by his."
      },
      {
        "paragraph": "Her lips were the same as before, just like jelly."
      },
      {
        "paragraph": "Shaun did not know what lipstick she was wearing tonight, but it smelled good."
      },
      {
        "paragraph": "He initially just wanted to force her a little, but after kissing her, he could not stop. It was as though he\nwas a child eating candy."
      },
      {
        "paragraph": "Catherine’s eyes widened. When she came to her senses, she pushed his chest hard."
      },
      {
        "paragraph": "However, the man’s tongue was like a sly snake. The more he kissed her, the more into it he got. She\nangrily used her fingers to pinch him."
      },
      {
        "paragraph": "Shaun hissed out a breath. At that moment, she was like a chili pepper. It was extremely spicy, but it\nmade him want to taste more."
      },
      {
        "paragraph": "At that moment, the sound of several men laughing sounded through the door."
      },
      {
        "paragraph": "“Wesley, you’re good at brewing tea.”"
      },
      {
        "paragraph": "“It’s my honor to show my skills in front of you, Senator Mead.”"
      },
      {
        "paragraph": "Wesley’s voice sounded through the door. Catherine was so scared that her heart dropped. At that\nmoment, Shaun intensified the kiss."
      },
      {
        "paragraph": "His hand gripped her waist, and he said in a husky voice, “If you don’t mind Wesley finding out, you can\nscream.”"
      },

      {
        "paragraph": "Scream?"
      },
      {
        "paragraph": "How could she scream? How would she dare to?"
      },
      {
        "paragraph": "If Wesley came in and saw Shaun kissing her, she would not be able to clear her name even after\njumping into a river."
      },
      {
        "paragraph": "Seeing her obediently not daring to do anything, Shaun cupped her small face and kissed her freely."
      },
      {
        "paragraph": "He knew that he was going too far. He was selfish and despicable."
      },
      {
        "paragraph": "However, when he got a taste of her, it was like drugs. He could not quit."
      },
      {
        "paragraph": "In the dark, the man’s low breaths echoed in her ears. Catherine did not dare to breathe out of\nnervousness. She could only pray for Wesley to quickly walk away so that she could push him away."
      },
      {
        "paragraph": "However, her rationale was slowly stolen by Shaun’s breaths."
      },
      {
        "paragraph": "Behind the door, the voices of the group of people drifted away."
      },
      {
        "paragraph": "Amidst her muddle-headedness, her phone suddenly rang."
      },
      {
        "paragraph": "She jumped in fright and hurriedly pushed Shaun away."
      },
      {
        "paragraph": "The engrossed man was caught off guard and took two steps back."
      },
      {
        "paragraph": "She took her phone out in a panic and saw the words ‘Wesley Lyons’. She felt like a mess. She could\nonly mute it and quickly put it back in her pocket. She then reached out for the door to try to escape."
      },
      {
        "paragraph": "She did not dare to stay here any longer."
      },
      {
        "paragraph": "“Are you sure you want to go out like that?” Shaun’s husky and sexy voice sounded from behind."
      },
      {
        "paragraph": "Her body froze. She was confused at first, but when she looked down, she saw that one side of her\ndress ‘ shoulder strap had torn off. A large part of her chest was exposed."
      },
      {
        "paragraph": "Her charming little face turned red in an instant."
      },
      {
        "paragraph": "She raised her hand and slapped him across the face. “Hoodlum!”"
      },
      {
        "paragraph": "“Yes, I’m a rogue.” Shaun used the tip of his tongue to prod his sore mouth. He stepped closer and\npropped his hands on both sides of her ears. His eyes burned with unconcealed heat."
      }
    ]
  },
  {
    "title": "Chapter 1107 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine was stupefied."
      },
      {
        "paragraph": "Her expression looked like she had gotten struck by lightning."
      },
      {
        "paragraph": "He was already like this when he was not cured. What would happen when he recovered?"
      },
      {
        "paragraph": "She could kiss her peaceful life goodbye."
      },
      {
        "paragraph": "“… Sometimes, you have to learn how to resign yourself to fate. There are some things that can’t be\ncured just because you want it to.”"
      },
      {
        "paragraph": "Catherine tried hard to restore her rationality and dispel those thoughts. “Why bother? If it can’t be cured,\nI really think you shouldn’t fight against fate.”"
      },
      {
        "paragraph": "She fluttered her big eyes with an innocent face."
      },
      {
        "paragraph": "Those who did not know would think that she was persuading a juvenile who had lost his way."
      },
      {
        "paragraph": "Shaun stared at her intently for a while before suddenly smiling. He said a few words, “After tasting you, I\ndon’t want to resign to my fate.”"
      },
      {
        "paragraph": "Catherine became angry. “Have you ever asked for my consent? Even if you recover, I don’t like you and\nI won’t forgive you. Think about all the despicable things you did before this.”"
      },
      {
        "paragraph": "“Yes, I was despicable. That’s why I’ll spend the rest of my life redeeming myself.” Shaun admitted that\nhe was despicable. In the past few days, he had tried to let go and step aside. However, he could only\nmuddle through each day."
      },
      {
        "paragraph": "Even if he was working in the company, it was like he had suddenly lost his ability to strive."
      },

      {
        "paragraph": "“Tak it. Take it and I’ll let you out.” Shaun took out another contraceptive pill and put it in her hand."
      },
      {
        "paragraph": "Catherine was completely speechless. Nothing had happened between Wesley and her, so why should\nshe take it?"
      },
      {
        "paragraph": "However, she did not want him to know that."
      },
      {
        "paragraph": "In the end, she took the pill and smiled deliberately. “Fine, I’ll take it. Wesley and I do it every day\nanyway, so even if I take contraceptives today, we can still conceive another day.”"
      },
      {
        "paragraph": "Shaun’s handsome face was suddenly tinted with a layer of rage."
      },
      {
        "paragraph": "Although he had already expected it, which was the reason why he was making her take contraceptives,\na burning hole was seared into his heart when he heard her say it."
      },
      {
        "paragraph": "“Get out of the way.” Catherine pretended not to see and pushed his hand away."
      },
      {
        "paragraph": "She really had to go. If she did not, she was afraid that Wesley would look for her here."
      },
      {
        "paragraph": "“I’ll let you go after leaving something behind.”"
      },
      {
        "paragraph": "Shaun said hoarsely and lowered his head to lean over."
      },
      {
        "paragraph": "Catherine’s head exploded."
      },
      {
        "paragraph": "When the man left, two striking marks were left on her fair skin."
      },
      {
        "paragraph": "Her face turned red with anger."
      },
      {
        "paragraph": "“Shaun Hill, you b*stard! ” She raised her hand and tried to hit him again."
      },
      {
        "paragraph": "Shaun easily blocked her hand with a smile. “If you don’t mind Wesley seeing those marks, you can get\nintimate with him.”"
      },
      {
        "paragraph": "“B*stard!” catherine glared at him furiously. “Be a good girl. Go out.”"
      },
      {
        "paragraph": "Shaun lowered his head and personally straightened her clothes before opening the door."
      },
      {
        "paragraph": "Catherine could not care anymore. If she stayed here, she would be driven crazy by him."
      },
      {
        "paragraph": "She looked around and saw that there was no one in the corridor. She quickly went out."
      },
      {
        "paragraph": "Shaun leaned against the wall and chuckled softly when he saw her careful movements outside the door.\nHe touched his lips."
      },
      {
        "paragraph": "He had to say, the feeling of sneaking around was quite enjoyable."
      },
      {
        "paragraph": "Catherine did not dare to find Wesley now. She went to the ladies’ room first."
      },
      {
        "paragraph": "Her lipstick had been kissed off by Shaun. She only went downstairs after touching up her makeup."
      },
      {
        "paragraph": "“Cathy, where did you go? You didn’t answer when I called you. I’ve been looking for you everywhere. ”"
      },
      {
        "paragraph": "Wesley saw her and strode over with worry on his handsome face."
      }
    ]
  },
  {
    "title": "Chapter 1108 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“I went to the restroom. I saw you chatting with Senator Mead just now, so I didn’t want to interrupt.”"
      },
      {
        "paragraph": "Catherine gave Wesley a random excuse."
      },
      {
        "paragraph": "“ I see…” Wesley’s heart sank. He had just asked a female guest to look for Catherine in the restroom,\nand he was told that there was no one there."
      },
      {
        "paragraph": "Evidently, Catherine was lying to him."
      },
      {
        "paragraph": "He did not seem to see Shaun around just now as well."
      },
      {
        "paragraph": "Wesley clenched his hands into fists in his pockets while smiling elegantly as usual. “By the way, I got to\nknow Senator Mead tonight. He asked me to bring you over to meet him.”"
      },
      {
        "paragraph": "In all honesty, Catherine disliked socializing with political dignitaries."
      },
      {
        "paragraph": "Those people were too complicated, and none of them were simple."
      },
      {
        "paragraph": "However, she had no choice but to tag along since Wesley had made such a request."
      },
      {
        "paragraph": "Drinking was inevitable in social functions."
      },
      {
        "paragraph": "Although Wesley did drink on her behalf, she ended up drinking quite a lot as well."
      },
      {
        "paragraph": "During the function, Wesley took Catherine to one side to let her rest and poured her a glass of water. “\nI’m sorry you ended up drinking so much. Let me take over from here. You can just stay here and rest.”"
      },
      {
        "paragraph": "“Mm.” Catherine nodded. She could drink, but she was averse to drinking with those political dignitaries."
      },
      {
        "paragraph": "She felt that she was now wealthy and had enough money to spend."
      },

      {
        "paragraph": "Hence, she disliked the feeling of fawning over someone."
      },
      {
        "paragraph": "Wesley stroked her hair. When he turned around to leave, Catherine suddenly looked at his back and\nsaid, “Wesley, you came here tonight mainly to get acquainted with those political bigwigs, didn’t you?”"
      },
      {
        "paragraph": "Wesley’s back stiffened. A moment later, he turned his head around. His handsome face looked\napologetic and helpless. “As someone who works in the medical industry, I need to get some insider\nnews. Whatever I received back then was quite outdated, which was why I was very passive."
      },
      {
        "paragraph": "Getting to know these people this time is an opportunity for me, but the main reason is also that I’m\nconcerned about you.”"
      },
      {
        "paragraph": "“Mm. I got it. ” Catherine smiled at him. “You can tell me directly next time. I won’t mind, and I’ll\nunderstand.”"
      },
      {
        "paragraph": "“…Okay.”"
      },
      {
        "paragraph": "Wesley smiled. When he turned around to walk away, his face turned extremely grim."
      },
      {
        "paragraph": "Instead of hurrying to get acquainted with the political dignitaries, he turned around to meet Charlie at a\nsecluded spot."
      },
      {
        "paragraph": "Charlie was in a foul mood. “Wesley, you came at the right time. Help me think of a way to deal with\nShaun. I must teach him a lesson, or better still, kill him.”"
      },
      {
        "paragraph": "“Why do you suddenly hate him so much?” Wesley raised his brows."
      },
      {
        "paragraph": "Charlie used to be very envious of Shaun and dissatisfied with how Shaun kept oppressing him."
      },
      {
        "paragraph": "However, all he wanted at the end of the day was"
      },
      {
        "paragraph": "just to turn things around. He had no deep resentment toward Shaun at all."
      },
      {
        "paragraph": "As such, it astonished Wesley that Charlie was now suggesting to kill Shaun."
      },
      {
        "paragraph": "“He has made me look bad time and time again. The last time I asked someone to ambush him to cause\nhim an accident, he escaped. Yet this time, at"
      },
      {
        "paragraph": "this banquet, Freya even butted in and destroyed my family’s reputation. I cannot swallow this.”"
      },
      {
        "paragraph": "Charlie asked coldly, “Don’t you hate him?”"
      },
      {
        "paragraph": "Wesley swirled the wine glass and said with a smile, “Considering Shaun’s current status, if you want to\nkill him, the Hill family won’t dare kick up a fuss no matter how discontented they are.”"
      },
      {
        "paragraph": "Charlie sighed. “I can’t kill him here. The Snow family and Shaun have a good relationship. If Shaun dies\nhere, the Snow family will suspect us, and even if they don’t investigate the matter, they’ll feel\nuncomfortable with us.”"
      },
      {
        "paragraph": "“We can still teach Shaun a lesson.” Wesley laughed."
      },
      {
        "paragraph": "Charlie’s eyes lit up. After a second, he said grimly, “Tell me your plans.”"
      },
      {
        "paragraph": "11:00 p.m."
      },
      {
        "paragraph": "After Catherine bid Freya goodbye, she left with Wesley."
      },
      {
        "paragraph": "When the car was two to three kilometers away from the hotel, Catherine suddenly received a call from\nFreya."
      },
      {
        "paragraph": "“Hey, Cathy. Are you alright? ” Freya’s voice was anxious."
      }
    ]
  },
  {
    "title": "Chapter 1109 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine was baffled. “What could’ve happened to me?”"
      },
      {
        "paragraph": "“It’s good to hear your voice. I was terrified out of my wits.”"
      },
      {
        "paragraph": "Freya sighed in relief. “You don’t know, but something happened to the hotel elevator shortly after you\nleft.”"
      },
      {
        "paragraph": "The news made Catherine’s heart rattle for a moment. “What happened?”"
      },
      {
        "paragraph": "“The elevator plummeted. The server said she saw a man and a woman entering the elevator going\ndown. The elevator plunged from the 20th floor to the ground, and it made a very loud noise.”"
      },
      {
        "paragraph": "Freya’s voice was shaky. “The people inside must be the guests who attended my banquet. How lucky a\nm I for this to happen when I finally held a"
      },
      {
        "paragraph": "banquet? The police and ambulance are now on their way here, but the people in the elevator surely\nwon’t have survived. I called to confirm whether you’re fine. If it were you and Wesley in the elevator, I\nwould break down.”"
      },
      {
        "paragraph": "Catherine was stunned."
      },
      {
        "paragraph": "Somehow, she recalled what Shaun told her tonight. He attended the banquet because of her."
      },
      {
        "paragraph": "Could he have left too since she had left? Could he be… in the elevator?"
      },
      {
        "paragraph": "When this thought flashed across her mind, her face paled."
      },
      {
        "paragraph": "“Cathy, I’ll stop here. There’s a rumpus going on at my end, but I’m relieved to know that you’re fine.”"
      },
      {
        "paragraph": "After that, Freya hung up the call."
      },

      {
        "paragraph": "Catherine gripped her phone tightly. Wesley held her hand and asked with concern, “What’s the matter?”"
      },
      {
        "paragraph": "“Freya told me that the hotel elevator we took plunged just down. She was worried that I was inside, ”\nCatherine explained absent-mindedly."
      },
      {
        "paragraph": "Upon hearing it, Wesley frowned. “There were people inside when it happened?”"
      },
      {
        "paragraph": "“Yeah. They should be tonight’s guests.” Catherine said reluctantly, “I wonder who they are. The police\naren’t there yet, so nobody dares to force the doors open.”"
      },
      {
        "paragraph": "“How can this kind of incident happen… ” Wesley mumbled, “I hope not many people are inside.”"
      },
      {
        "paragraph": "“Freya said there was a man and a woman, ” Catherine replied."
      },
      {
        "paragraph": "Wesley’s expression finally shifted."
      },
      {
        "paragraph": "However, it returned to normal seconds later."
      },
      {
        "paragraph": "“Wesley… Why don’t you head home first? I have a feeling that Freya is in low spirits because of this\nincident. I want to keep her company,” Catherine suddenly said."
      },
      {
        "paragraph": "“Alright. I’ll go with you so that you won’t be frightened, ” Wesley answered gently."
      },
      {
        "paragraph": "“It’s fine. You can drop me at the entrance. I’ll sleep over at Freya’s place tonight. You should go home\nearly and rest.” Considering her restlessness at this moment, Catherine was not in the mood to interact\nwith Wesley."
      },
      {
        "paragraph": "“…Okay.” Wesley glanced at her."
      },
      {
        "paragraph": "He planned to let her go since Shaun should be dead by now."
      },
      {
        "paragraph": "That person would not appear in Catherine and his little world anymore."
      },
      {
        "paragraph": "Ten minutes later, Catherine received a WhatsApp message from Freya. [Damn. Cathy, I have bad news\nfor you.]"
      },
      {
        "paragraph": "At the sight of the message, Catherine’s heart began to tremble."
      },
      {
        "paragraph": "It seemed that Freya was going to confirm the assumption in her mind."
      },
      {
        "paragraph": "She subconsciously refused to learn it."
      },
      {
        "paragraph": "Nevertheless, Freya sent another message. [I’ve seen surveillance camera footage. Shaun entered the\nelevator that plummeted to the ground.]"
      },
      {
        "paragraph": "Catherine stared at the message. Her brain shorted out, and her mind went blank."
      },
      {
        "paragraph": "Shaun was in the elevator? He was dead?"
      },
      {
        "paragraph": "How could it be?"
      },
      {
        "paragraph": "The man who kissed her a few hours ago was suddenly dead?"
      },
      {
        "paragraph": "Up until now, Catherine could still remember his scent as well as his masculine voice that always made\nher blood boil."
      }
    ]
  },
  {
    "title": "Chapter 1110 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "In the blink of an eye, only Shaun’s corpse was left?"
      },
      {
        "paragraph": "All Catherine could feel was a force clenching her heart, making it hard for her to breathe."
      },
      {
        "paragraph": "Her mind was blank."
      },
      {
        "paragraph": "Even the hand that was holding her phone trembled in spite of herself."
      },
      {
        "paragraph": "She hated Shaun."
      },
      {
        "paragraph": "When he imprisoned her on the island, she hated him so much that she wished he would die."
      },
      {
        "paragraph": "However, why did she become lost and flustered the minute she learned that he was dead?"
      },
      {
        "paragraph": "Freya continued to message her. [Are you okay?]"
      },
      {
        "paragraph": "Catherine lowered her head and replied with her trembling fingers. [Are you sure?]"
      },
      {
        "paragraph": "Freya responded. [I’m 100 percent sure. From the footage, I saw Shaun taking the elevator down with\nSenator Mead’s daughter. The elevator had only gone down two floors when it malfunctioned. He\ncouldn’t have escaped.]"
      },
      {
        "paragraph": "Catherine fixed her vacant gaze on those strange words."
      },
      {
        "paragraph": "At this moment, Wesley received a message as well. His eyes widened at it."
      },
      {
        "paragraph": "Senator Mead’s daughter, Hannah Mead, was also inside?"
      },
      {
        "paragraph": "Damn it."
      },

      {
        "paragraph": "However, he was not involved in the matter. Given that he merely suggested it, the investigation of the\nmatter would not concern him."
      },
      {
        "paragraph": "It was a pity to know that Hannah was in the elevator, but it was just a woman."
      },
      {
        "paragraph": "Everything else would not matter as long as Shaun was dead."
      },
      {
        "paragraph": "Wesley glanced at Catherine, who looked worried beside him, and the corners of his mouth twitched\ngrimly in the dark."
      },
      {
        "paragraph": "Freya had most likely informed her of Shaun’s death."
      },
      {
        "paragraph": "Although Catherine claimed that she no longer loved Shaun, her expression showed otherwise when she\nlearned about Shaun’s death."
      },
      {
        "paragraph": "Once again, the car arrived at the entrance of the hotel."
      },
      {
        "paragraph": "Catherine got out of the car straight away without saying goodbye to Wesley."
      },
      {
        "paragraph": "She rushed into the hotel, and at that time, the ambulance and firefighters had just arrived."
      },
      {
        "paragraph": "All of them gathered on the ground floor. As soon as Freya saw Catherine, she walked to her. “Why did\nyou come back?”"
      },
      {
        "paragraph": "“Has the dead body… been taken out yet?” Catherine stared intently at her."
      },
      {
        "paragraph": "“They’re going to take it out now.”"
      },
      {
        "paragraph": "Freya sighed and held Catherine’s hand, only to realize that it was icy. “Cathy, don’t take it too hard.”"
      },
      {
        "paragraph": "“I’m taking it easy. He’s only my ex-husband. Since he has done so many crazy things to me, he\ndeserves death. It serves him right.”"
      },
      {
        "paragraph": "Catherine spoke impassively, but toward the end of her sentence, she choked so badly that her eyes\nreddened uncontrollably."
      },
      {
        "paragraph": "She did not know what was wrong with her."
      },
      {
        "paragraph": "She just felt very uncomfortable. It was as if both"
      },
      {
        "paragraph": "her legs were floating in the air, and she could not get them to the ground."
      },
      {
        "paragraph": "“Freya, I’m not sad. Perhaps I just feel… guilty. He said that he came here today because of me. If I\nhadn’t come, he wouldn’t have died like this, right?”"
      },
      {
        "paragraph": "Catherine looked at Freya in bewilderment. The man who used to be the most brilliant person in\nAustralia had ultimately died in the elevator. How ridiculous."
      },
      {
        "paragraph": "Not knowing what to say, Freya just stared at Catherine sadly."
      },
      {
        "paragraph": "Beside her, Senator Mead’s wife was weeping bitterly, while Senator Mead, who was blind with anger,\ncriticized the hotel manager, “Your hotel has to be responsible for the sudden malfunction of the elevator.\nI won’t let you guys off the hook.”"
      },
      {
        "paragraph": "Upon prying the doors open, the firefighters got down by clutching onto the cable. Everyone watched the\ndark spot beneath and waited with bated breath."
      },
      {
        "paragraph": "“Dad, Mom…”"
      },
      {
        "paragraph": "Suddenly, a woman behind yelled amid her sobs. Senator Mead and his wife froze. They swung around,\nonly to see a pretty young lady standing behind them. However, she was a sorry mess. Her white dress\nwas ripped in half, and her lower body was wrapped around with a man’s black suit."
      },
      {
        "paragraph": "Standing beside the lady was a tall, handsome man."
      },
      {
        "paragraph": "The man was only wearing a shirt without a suit, and his tie was loosely hanging at the side of his shirt.\nDespite his disheveled clothes, he still looked attractive."
      }
    ]
  },

  {
    "title": "Chapter 1111 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine’s eyes suddenly widened."
      },
      {
        "paragraph": "She would be able to recognize Shaun’s face straight away no matter how much it had changed. Was it\nhim?"
      },
      {
        "paragraph": "He was alive?"
      },
      {
        "paragraph": "Her head buzzed. By the time she noticed Shaun’s eyes settling on her, it was too late to look away."
      },
      {
        "paragraph": "Just like that, Shaun had spotted her eyes on him. The two of them looked at each other at a distance\naway, separated by all the people between them."
      },
      {
        "paragraph": "He realized that her eyes were red."
      },
      {
        "paragraph": "With that, his thin lips curled up a little."
      },
      {
        "paragraph": "Despite his narrow escape from death just now, he was in an inexplicably good mood."
      },
      {
        "paragraph": "“Hannah…”"
      },
      {
        "paragraph": "At this moment, Madam Mead called out to her daughter amid her tears. She then ran to her daughter\nemotionally and hugged her. “This is"
      },
      {
        "paragraph": "great. You’re still alive. You scared the hell out of me. I thought you were inside.”"
      },
      {
        "paragraph": "“What happened, Hannah? The surveillance footage caught you entering the elevator at that time. ”\nSenator Mead then walked to Hannah with his eyes red. He almost lost his footing the instant he knew\nthat his only daughter was dead."
      },

      {
        "paragraph": "“Dad, I nearly died.” Hannah hugged his parents and said tearfully, “But luckily, Young Master Hill saved\nme.”"
      },
      {
        "paragraph": "After she finished speaking, she darted a shy glance at Shaun."
      },
      {
        "paragraph": "“Dad, you don’t know how terrifying the situation was just now. The elevator plunged over ten floors, and\nit did not stop even after we pressed all the buttons. Thank god Shaun opened the roof in time. When the\nelevator fell to the second floor, he swiftly grabbed me and fled to the elevator shaft. Then, he forced\nopen the doors on the third floor with his bare hands, and we crawled out.”"
      },
      {
        "paragraph": "Toward the end of her sentence, Hannah gazed at Shaun in admiration. “Really. We would’ve died if we\nwere one or two seconds late. Fortunately, Shaun took it in stride. He could’ve escaped alone at that\ntime, but he decided to save me even though I might be a drag. He even suffered gashes on his arms\nfrom the cable in order to grab me in the shaft She reached out to hold Shaun’s arm as she was\nspeaking, but Shaun shunned her touch."
      },
      {
        "paragraph": "Shaun looked at Senator Mead coldly and said, “If I was alive and something happened to your daughter,\nthe Mead family might treat me as your arch-enemy. I just didn’t want to get myself into trouble.”"
      },
      {
        "paragraph": "“Anyhow, thank you for rescuing my daughter.” Senator Mead nodded gratefully."
      },
      {
        "paragraph": "Back then, Senator Mead used to think that Shaun was arrogant even though he had not interacted with\nhim personally before. However, this incident made him look at Shaun differently."
      },
      {
        "paragraph": "Well, Shaun’s assumption was right too. If they both entered the elevator and he was alive but Hannah\nwas dead, Senator Mead would certainly blame him for not rescuing his daughter."
      },
      {
        "paragraph": "He was not concerned about whether Shaun would risk his life to save his daughter. What mattered to\nhim was that Shaun would have to save his daughter as long as Shaun was alive."
      },
      {
        "paragraph": "“Thank you, Shaun. I’m glad you were around tonight, ” Hannah said with tender affection."
      },
      {
        "paragraph": "She would never forget how Shaun used his muscular arms to save her out of the elevator moments\nbefore her death."
      },
      {
        "paragraph": "When the two of them were trapped in the shaft later, he hugged her tightly with his strong body without\nsaying a word."
      },
      {
        "paragraph": "She even felt this man’s muscles and smelled his pleasant masculine scent."
      },
      {
        "paragraph": "She had long since heard of the name ‘Shaun Hill’."
      },
      {
        "paragraph": "Nevertheless, they did not belong in the same world. She was only in her early 20s and had been\nstudying abroad before this. All this while, she assumed that Shaun was a heartless man. Through\ntonight’s incident, she came to realize that this man was not as bad as how the public had described him."
      },
      {
        "paragraph": "His great charm provided women with a strong sense of security. Moreover, he was the most attractive\nman she had ever seen, considering his perfect physique and features that made her breathless."
      },
      {
        "paragraph": "Being in her early 20s, Hannah finally experienced what was love."
      },
      {
        "paragraph": "Shaun cast an indifferent look at her and frowned. He pursed his lips so tightly that he was not even in\nthe mood for talking."
      },
      {
        "paragraph": "“It’s good that everyone’s fine.” Nathan walked to Shaun and patted him on the shoulder. “Luckily you’re\nhere tonight, Shaun.”"
      },
      {
        "paragraph": "If Senator Mead’s daughter had died during the banquet where Nathan acknowledged his goddaughter,\nthis incident would have caused a misunderstanding between Senator Mead and Nathan."
      }
    ]
  },
  {
    "title": "Chapter 1112 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Uncle Nathan, this incident is strange.”"
      },
      {
        "paragraph": "Shaun reminded Nathan, “Usually, all hotel elevators are inspected regularly, much less a seven"
      },
      {
        "paragraph": "-star hotel. In the case of an accident, the emergency system is supposed to activate and allow people to\nescape. The elevator can’t possibly plunge down straight away.”"
      },
      {
        "paragraph": "“I’ll investigate it.”"
      },
      {
        "paragraph": "A somber expression washed over Nathan’s face."
      },
      {
        "paragraph": "“Sure. I suspect someone was targeting me on purpose. ” Shaun suddenly said, “Perhaps I was the one\nwho brought Senator Mead’s daughter into it.”"
      },
      {
        "paragraph": "Everyone was stunned. If someone caused this incident to target Shaun, the most suspicious people\nwould be the Campos and the Holts."
      },
      {
        "paragraph": "After all, everyone in the banquet could tell that these two families had set Shaun up just now."
      },
      {
        "paragraph": "However, no one could be bothered to point it out since Shaun was not looked highly on."
      },
      {
        "paragraph": "Senator Mead and Nathan looked grim. A while later, Nathan said, “We’ll definitely investigate this\nincident thoroughly. Miss Mead said that your arm is injured. You should take the ambulance to the\nhospital…”"
      },
      {
        "paragraph": "“There’s no need. I’m fine. I’ll head off first.”"
      },
      {
        "paragraph": "After Shaun spoke indifferently, he turned on his heel and left."
      },

      {
        "paragraph": "Catherine fixed her eyes on his figure until it vanished from sight. That was when Heidi came over and\nsaid, “Freya, since everything is fine now, you and Miss Jones should go home and rest.”"
      },
      {
        "paragraph": "“Alright, Godmother. Is it true that… someone tampered with the elevator?” Freya could not help but ask."
      },
      {
        "paragraph": "Heidi knitted her brows. “Most likely. Shaun is right that the elevator won’t go wrong so easily, but you\nguys don’t have to bother yourselves with this incident. It’s alright if Shaun was the sole target. If the\nincident was aimed at someone else… things would be quite complicated.”"
      },
      {
        "paragraph": "Freya was not a fool. She understood from her words that those noble families might have offended\nother people. However, she hurriedly left with Catherine, not wanting to be involved in their circle."
      },
      {
        "paragraph": "On her way back, she could not resist asking, “ Cathy, do you think Hannah is into Shaun?”"
      },
      {
        "paragraph": "“I don’t know.”"
      },
      {
        "paragraph": "Even though Catherine said so, she was not silly. She could sense something unusual in how Hannah\nlooked at Shaun."
      },
      {
        "paragraph": "Damn, that shameless man. He even lured a woman when they were on the verge of death. Why was he\nstill alive?"
      },
      {
        "paragraph": "Sure enough, bad things would never die."
      },
      {
        "paragraph": "Just as Catherine and Freya walked into the car park, the protagonist Shaun, who had just come down,\nwas standing quietly under the dim light. His hands were in his pockets while his glowing, obsidian-like\neyes looked toward Catherine."
      },
      {
        "paragraph": "Catherine caught sight of him as well."
      },
      {
        "paragraph": "She was just thinking about that albatross the minute before."
      },
      {
        "paragraph": "She pursed her exquisite, thin lips and turned a blind eye to him. She simply held Freya’s hand and\nheaded to where Freya’s car was parked."
      },
      {
        "paragraph": "The corners of Shaun’s lips curled up as he walked to them and blocked their way with his sturdy\nphysique."
      },
      {
        "paragraph": "Wherever they went, he followed."
      },
      {
        "paragraph": "Eventually, Freya flew into a rage. “Shaun Hill, what are you trying to do?”"
      },
      {
        "paragraph": "“I want to hit on the person beside you.” Shaun smirked frivolously."
      },
      {
        "paragraph": "The way he acted like a hooligan made Freya dumbfounded."
      },
      {
        "paragraph": "Catherine’s face flushed red. With her teeth clenched, she warned, “Shaun Hill, if you dare say that\nagain, I’ll report to the police that you’re harassing me.”"
      },
      {
        "paragraph": "Freya nodded immediately. “I can be the witness.” “Are you sure I can harass you?” Shaun looked at\nCatherine profoundly. “You know I can’t do it. I have a medical report as proof.”"
      }
    ]
  },
  {
    "title": "Chapter 1113 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Freya gaped at him."
      },
      {
        "paragraph": "She had never seen an impotent man acting so arrogantly."
      },
      {
        "paragraph": "Unlike other impotent men who would typically abase themselves, Shaun wished everyone in the world\nknew about it."
      },
      {
        "paragraph": "“You can prove it too,” Shaun added softly while fixing his eyes on Catherine."
      },
      {
        "paragraph": "Catherine was speechless. What could she prove?"
      },
      {
        "paragraph": "Prove that he was capable of harassing her in spite o f his impotence?"
      },
      {
        "paragraph": "Those words made Freya’s ears turn red. As an onlooker, she could not help but have improper thoughts\nupon hearing Shaun’s flirtatious remarks. “Well… You guys can take your time and carry on with your\nconversation. I’m going to get into the car first.”"
      },
      {
        "paragraph": "After taking a few steps forward, she reminded Catherine with concern, “Cathy, hurry up and get in. Don’t\nkeep me waiting for too long.”"
      },
      {
        "paragraph": "She then ran into her car like the wind, leaving Catherine speechless and annoyed. If Catherine had\nknown that he was alive, she would not have come back."
      },
      {
        "paragraph": "Shaun looked at her so gently that it could drown her. “Cathy, I saw your eyes were red just now."
      },
      {
        "paragraph": "Were you heartbroken because you were under the impression that I was dead…”"
      },
      {
        "paragraph": "“I think you’re delusional. Don’t think too highly of yourself. In fact, I almost cried tears of joy.”"
      },

      {
        "paragraph": "Catherine lifted her head and snorted. “After learning that the man who tortured me for several years was\nfinally dead, the excitement in me isn’t something you could fathom.”"
      },
      {
        "paragraph": "“I don’t believe it…”"
      },
      {
        "paragraph": "Shaun smirked, but the corners of his mouth revealed a faint smile. “Cathy, I was already there when you\nstepped into the hotel, but I just didn’t show myself. However, you looked like you were panicking rather\nthan crying for joy.”"
      },
      {
        "paragraph": "Catherine was stunned."
      },
      {
        "paragraph": "This guy actually hid elsewhere and observed her in secret."
      },
      {
        "paragraph": "He must have done it on purpose."
      },
      {
        "paragraph": "He had seen her disconcerted look after she thought that he was dead. This made her so furious that\nshe could feel her blood boil."
      },
      {
        "paragraph": "Sure enough, she should have been cruel in the face of such a devil."
      },
      {
        "paragraph": "“Cathy, you still care about me.” Shaun slowly approached her and held her hand. His eyes were so\ndeep that one could drown in them."
      },
      {
        "paragraph": "Considering that anyone could appear in this public space, Catherine was so frightened that she\nhurriedly broke free from his grip."
      },
      {
        "paragraph": "Shaun’s handsome face paled all of a sudden. When she yanked his hand away, he gasped, and his arm\nstarted to tremble."
      },
      {
        "paragraph": "Catherine suddenly recalled Hannah mentioning that his arms were injured."
      },
      {
        "paragraph": "Her fingers twitched, and she said gravely, “Shaun, don’t you think that you went too far? All of us\nthought you were dead, and the incident involved a lot of police and medical staff. While everyone else\nwas worrying, you just secretly watched the fun from the side.”"
      },
      {
        "paragraph": "Shaun explained with a low voice, “I didn’t. I appeared less than five minutes after you arrived. After the\nelevator went wrong, I was struggling in the shaft for ten minutes, and I lifted a woman from there. Look\nat my arms…”"
      },
      {
        "paragraph": "Only when he stretched out both his hands did Catherine realize that his previously good-looking nails\nwere injured and stained with blood."
      },
      {
        "paragraph": "She was shocked."
      },
      {
        "paragraph": "Noticing her reaction, Shaun rolled up his sleeves lightly. “And this part too. It got hit by the iron chain\ninside.”"
      },
      {
        "paragraph": "Catherine saw that his entire arm was bruised. She could not help but take a shallow breath."
      },
      {
        "paragraph": "She initially thought that he had only suffered from minor injuries. However, it was unsurprising that he\nwas so badly injured. Even though she had not been to the elevator shaft, the mere thought of it dreaded\nher."
      }
    ]
  },
  {
    "title": "Chapter 1114 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Crawling out and waiting for help did not necessarily mean that he was saved, as the things in the shaft\ncould kill him brutally at any time."
      },
      {
        "paragraph": "To put it another way, staying alive was not easy. In fact, it was nothing short of a miracle that he\nmanaged to save someone else as well."
      },
      {
        "paragraph": "Even so, Catherine remained indifferent. “Young Master Hill, how impressive of you. You didn’t forget to\nsave the woman even though you were on the verge of death.”"
      },
      {
        "paragraph": "The woman even had a crush on him now. Indeed, h e would never forget to lure women."
      },
      {
        "paragraph": "Shaun raised his brows when he heard her. “Cathy, you’re jealous.”"
      },
      {
        "paragraph": "“Jealous, your *ss.”"
      },
      {
        "paragraph": "Despite being an elite young lady, Catherine was forced to use swear words time and time again\nbecause of him. “ Shaun, you claimed that Wesley has ulterior motives, but I think you’re no different\nthan him. Now that you’ve saved Senator Mead’s"
      },
      {
        "paragraph": "daughter, his family probably considers you as Hannah’s lifesaver and feels eternally grateful to you.\nPerhaps you can turn things around again after marrying Hannah. That’s quite a brilliant plan too.”"
      },
      {
        "paragraph": "The spark in Shaun’s eyes vanished. He had never expected this to be Catherine’s impression of him."
      },
      {
        "paragraph": "A hint of self-mockery lit up in his eyes. Nevertheless, who could he blame?"
      },
      {
        "paragraph": "He was the one who had destroyed his own image in her heart, bit by bit."
      },
      {
        "paragraph": "“No, Cathy.”"
      },

      {
        "paragraph": "He explained to her softly, “If I escaped without saving Hannah today, Senator Mead would’ve taken my\nlife away. For someone of his character, he wouldn’t let me off the hook even if I wasn’t the one who\nkilled her daughter. He would wonder"
      },
      {
        "paragraph": "what gave me the right to survive when his daughter was dead. He wouldn’t bother considering how\ndifficult it was to escape the situation. In fact, saving his daughter was much harder than reaching the\nsky.”"
      },
      {
        "paragraph": "Catherine was suddenly at a loss for words."
      },
      {
        "paragraph": "Indeed, the more powerful one was, the more selfish they would be."
      },
      {
        "paragraph": "In everyone else’s eyes, their family’s lives were more significant than other people’s."
      },
      {
        "paragraph": "It seemed that her earlier remarks had gone too far. “Cathy, I really thought that I’d die today.”"
      },
      {
        "paragraph": "Shaun walked closer to her again, his eyes glinting with deep affection. “When the elevator plunged, all I\nthought about was you. I was dissatisfied and refused to believe how I was going to lose you just like\nthat. At that very instant, it struck me that you’re much more important than I imagined."
      },
      {
        "paragraph": "Because of you, I did my best to crawl out. I didn’t show up immediately because I wanted to see who\nwas laughing in their sleeves. That person could very well be the mastermind behind the incident.\nAnother reason was I wanted to see whether you were happy or sad after you found out about my death.\nIf you were happy, I would disappear from your sights. If you were sad, I…”"
      },
      {
        "paragraph": "“Drop it.”"
      },
      {
        "paragraph": "Agitated, Catherine interrupted him as she did not want to listen to him anymore. The more he explained,\nthe more confused she was."
      },
      {
        "paragraph": "She did not know why she was beside herself at that time either."
      },
      {
        "paragraph": "Shaun smiled at how confused she looked. At least h e held a different place in her heart and not"
      },
      {
        "paragraph": "someone insignificant to her."
      },
      {
        "paragraph": "Regardless of love or hate, he had a place in her heart."
      },
      {
        "paragraph": "“Cathy, I came here to tell you that for your sake, I won’t give up on myself anymore. I’ll lead Hill\nCorporation to the top again. As for you, I will snatch you away from Wesley once again."
      },
      {
        "paragraph": "“I love you. I used to be grossly mistaken, but I won’t behave like that anymore.”"
      },
      {
        "paragraph": "After that, he slowly retreated in the dark with his breathtaking, handsome face."
      },
      {
        "paragraph": "Despite being severely injured, he turned around and walked away arrogantly."
      },
      {
        "paragraph": "Catherine stared at his back in a daze. His words were echoing in her head."
      },
      {
        "paragraph": "Was he planning to snatch her back? What a lunatic."
      },
      {
        "paragraph": "Then, a sports car stopped in front of Catherine, and Freya lowered the car window. “Are you a statue?\nHurry up and hop in.”"
      }
    ]
  },
  {
    "title": "Chapter 1115 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine was speechless “What nonsense are you saying?”"
      },
      {
        "paragraph": "When did she become a statue?"
      },
      {
        "paragraph": "“You were standing still and staring at your ex- husband.” Freya shrugged."
      },
      {
        "paragraph": "“I was just thinking about something else,” Catherine argued as she got into the passenger seat. “Why\ndon’t you let me drive? After all, you’re pregnant…”"
      },
      {
        "paragraph": "“I’m only one month pregnant. It’s not like I’m due now.”"
      },
      {
        "paragraph": "Freya looked at Catherine curiously. “What did Shaun tell you? Has being on the verge of death made\nhim realize that he can’t get over you, so he’s asking you to get back together with him?”"
      },
      {
        "paragraph": "Catherine was embarrassed. If she had not watched Freya get into the car, she would have doubted if\nFreya had eavesdropped on Shaun and her conversation."
      },
      {
        "paragraph": "Upon noticing Catherine’s silence, Freya shot her a look. “What are your thoughts?”"
      },
      {
        "paragraph": "“Please. I’m already married, ” Catherine reminded her frustratingly."
      },
      {
        "paragraph": "“Tsk, look in front.”"
      },
      {
        "paragraph": "Freya raised her brows. As Shaun’s tall figure was slowly walking along the roadside, he turned his head\naround to glance at the cars."
      },
      {
        "paragraph": "The seven-star hotel was located in a remote area. I f there had not been a banquet here tonight, much\nfewer private cars would pass by this place, let alone taxis."
      },
      {
        "paragraph": "Catherine saw it too, and the scene made her feel painfully conflicted."
      },

      {
        "paragraph": "The man whom she used to find elegant and haughty had no car to leave the banquet."
      },
      {
        "paragraph": "Where was Hadley? Where was his chauffeur?"
      },
      {
        "paragraph": "“Do you want to give him a ride?” Freya asked for Catherine’s opinion."
      },
      {
        "paragraph": "Catherine sneered. “No way. I’m sure he has a chauffeur. He must be trying to win my sympathy.”"
      },
      {
        "paragraph": "“True…” Freya nodded and pressed on the accelerator. After traveling ten meters, Catherine stopped\nher."
      },
      {
        "paragraph": "“Hang on…”"
      },
      {
        "paragraph": "“What’s wrong?” Freya sped up significantly."
      },
      {
        "paragraph": "“Hit the brakes, ” Catherine reminded her speechlessly."
      },
      {
        "paragraph": "The corners of Freya’s mouth twitched before she slammed on the brakes."
      },
      {
        "paragraph": "Catherine let out a light cough. “I noticed just now that his arms are quite badly injured. Let’s send him to\nthe hospital. After all, he got injured during your banquet. If anything happens to him, it’s going to harm\nyour reputation.”"
      },
      {
        "paragraph": "Freya really felt an urge to ask Catherine to reflect on her behavior that contrasted with her words. Just a\nsecond ago, she claimed that Shaun was trying to win her sympathy. Yet now, she was left with eggs on\nher face."
      },
      {
        "paragraph": "“Why are you looking at me? Well, we’re kind- hearted people. ” Catherine blinked. “Ask him to hop in,\nbut don’t let him know that I told you to stop.”"
      },
      {
        "paragraph": "Freya was at a loss for words."
      },
      {
        "paragraph": "She lowered the window and looked back through the rear-view mirror. The tall and sturdy figure was\nwearing a white shirt, and when the night breeze blew, his shirt stuck out. Even without a clear look a t\nhis face, his long model-like legs and his figure would make any woman’s heart melt."
      },
      {
        "paragraph": "However, Shaun walked past Freya’s sports car and continued to walk forward without looking in."
      },
      {
        "paragraph": "Freya honked and stopped the car in front of him. “ Hop in. We’ll send you to the hospital.”"
      },
      {
        "paragraph": "When Shaun heard a familiar voice, he looked back. Only then did he see Freya and Catherine, who was\nseated in the passenger seat."
      },
      {
        "paragraph": "Nevertheless, Catherine’s head was lowered as she played a game on her phone. She looked very\nengrossed in it, as if she was not concerned as to who Freya was speaking to."
      },
      {
        "paragraph": "Catherine’s behavior made Freya feel like rolling her eyes."
      }
    ]
  },
  {
    "title": "Chapter 1116 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "What the f*ck. Freya had known Catherine for ten years, but this was her first time seeing Catherine act\nso well. Catherine could not even stop looking behind just a minute ago."
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "Shaun chuckled. After that, he pulled the door open and got into the car."
      },
      {
        "paragraph": "Freya started the car. With Catherine and Shaun quiet in the car, the eerie silence made Freya feel so\nuncomfortable that she could not help but start a topic. “Why were you walking alone on the road?\nWhere’s your chauffeur?”"
      },
      {
        "paragraph": "“I couldn’t find him.” Shaun explained softly, “ Before I crawled out of the shaft, my phone fell and broke,\nso I have no way of contacting anyone.”"
      },
      {
        "paragraph": "“Use my phone to call your family, then. I’ll send you to a nearby hospital. You can ask your family to pick\nyou up there.” As Freya was speaking, she observed Catherine, who was still engrossed in her game."
      },
      {
        "paragraph": "“It’s fine. Just drop me off there. I’m on bad terms with my family. The ones I get along well with are\neither too old or too young, or she has married someone else…”"
      },
      {
        "paragraph": "Shaun spoke in a helpless and melancholic tone."
      },
      {
        "paragraph": "Catherine, who was in the middle of her game, was speechless."
      },
      {
        "paragraph": "Since when did she get along well with him?"
      },
      {
        "paragraph": "Not knowing what to say, Freya decided to remain silent."
      },
      {
        "paragraph": "20 minutes later, she finally dropped Shaun off at the hospital."
      },

      {
        "paragraph": "After opening the door, Shaun got out and turned around. His handsome face revealed a pitiful look\nunder the wan streetlights. “Can you lend me some money? My wallet fell in the shaft as well, so I can’t\npay to see the doctor. It happens that Chester isn’t around. He has gone out of town to attend a\nconference.”"
      },
      {
        "paragraph": "This time, Catherine could not resist asking, “ Shaun Hill, are you treating us like fools?”"
      },
      {
        "paragraph": "“I’m not lying. The Snow family has invited the Jewell family tonight, but Chester isn’t in Canberra, ”\nShaun explained with an innocent expression."
      },
      {
        "paragraph": "Freya could prove this too. “It’s true that Chester isn’t in Canberra.”"
      },
      {
        "paragraph": "Shaun immediately continued, “Although I’m not as powerful as I was before, I will not owe you guys m y\nmedical fees. If you don’t believe me, you can frisk me.”"
      },
      {
        "paragraph": "Catherine was at a loss for words. Seeing his pathetic expression reminded her of how Suzie practiced\nsad fishing. When had Shaun learned to practice sad fishing as well?"
      },
      {
        "paragraph": "The father and daughter were two of a kind."
      },
      {
        "paragraph": "“Freya, do you have money? Lend him some and send him away, ” Catherine said in disgust."
      },
      {
        "paragraph": "“Please. Who would carry cash with them in this day and age? Everything is by mobile payment.”"
      },
      {
        "paragraph": "Freya sighed and said, “Why don’ t you stay here and settle the medical fees for him? After all, he was\ninjured during my banquet. If anything happens to him, it’ll harm my reputation.”"
      },
      {
        "paragraph": "Catherine did not know what to say to that oddly familiar sentence. In fact, she had said that to Freya not\nlong ago. Yet now, Freya was saying the same"
      },
      {
        "paragraph": "words back to her."
      },
      {
        "paragraph": "Shaun gazed at Catherine eagerly outside the window. His eyes were as black as obsidian."
      },
      {
        "paragraph": "Catherine sighed weakly as she opened the door and got out of the car. Then, she glowered at Shaun\nresentfully. “Let’s go.”"
      },
      {
        "paragraph": "“Thanks. ” Shaun followed behind her obediently. He looked exactly like a little puppy."
      },
      {
        "paragraph": "Catherine could not help but dart him a glance. “ Shaun Hill, have you no shame? What happened to\nyour intolerably arrogant president look?”"
      },
      {
        "paragraph": "“When I’m with the person I love, I can be shameless. I can also be humble and submissive, ” Shaun\nresponded confidently and shamelessly."
      },
      {
        "paragraph": "He had previously used his phone to search for various ways and tips to win his ex-wife back. From the\nfinal results, he learned that he had to pester her shamelessly."
      },
      {
        "paragraph": "Catherine was speechless. “I think you injured your brain in the elevator rather than your arms.”"
      },
      {
        "paragraph": "“Yeah, I injured my brain. That’s why it’s currently filled with your voice and face. Tell me how my brain\ncan be cured.”"
      },
      {
        "paragraph": "Shaun raised his brows. His words were extremely cheesy."
      }
    ]
  },
  {
    "title": "Chapter 1117 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Shaun’s words made Catherine feel deeply powerless."
      },
      {
        "paragraph": "It reminded her of Shaun uttering all kinds of pickup lines when she met him for the first time. Later, she\nlashed out at him and wondered if he was mentally ill."
      },
      {
        "paragraph": "At that time, she felt that he was a dumb*ss for not knowing how to flirt with such a beauty."
      },
      {
        "paragraph": "Now, she seemed to understand his feelings then."
      },
      {
        "paragraph": "Once Shaun entered the emergency department, he had to fill in his name and phone number on the\nform to complete the registration."
      },
      {
        "paragraph": "He directly raised his injured right arm. “I can’t write.”"
      },
      {
        "paragraph": "As such, Catherine had no choice but to help him fill out the form and register for an appointment."
      },
      {
        "paragraph": "Shaun walked with her all the way. He had to take a n X-ray before finally needing some sodium chloride\nIV infusion to reduce inflammation."
      },
      {
        "paragraph": "After the nurse set up the infusion for him, he glanced at the time. It was almost 12:00 a.m. As much as\nhe wanted to spend more time with Catherine, he did not want her to tire herself out. “ Lend me your\nphone for a while. I want to give Hadley a call.”"
      },
      {
        "paragraph": "Assuming that Shaun wanted Hadley to come over to look after him, she passed him the phone."
      },
      {
        "paragraph": "Unexpectedly, he called Hadley and said, “I’m in the hospital. Come here and send Cathy home.”"
      },
      {
        "paragraph": "Catherine frowned. After Shaun ended the call, she said, “I don’t need Hadley to send me home. I can\ntake a taxi.”"
      },

      {
        "paragraph": "“No. It’s not safe for a pretty young lady like you to take a taxi home at such a late hour.” Shaun shook\nhis head. “Give me the receipt. I’ll return you the money tomorrow.”"
      },
      {
        "paragraph": "Catherine glanced sideways at him."
      },
      {
        "paragraph": "Given that the beds were full tonight, he had no alternative but to have IV infusion seated on the chair,\nalone in the lifeless infusion room. The atmosphere of this messy environment did not match his elegant\nand noble temperament at all, and it made him look rather miserable."
      },
      {
        "paragraph": "She closed her eyes, telling herself that she should not soften her attitude toward him. “You don’t need to\nreturn it. Don’t think I don’t know that you’re trying to seize the opportunity to stay in touch with me.”"
      },
      {
        "paragraph": "After his attempt was seen through, Shaun smiled wryly. “Since you don’t need me to return it, that’s fine.\nWhat’s mine is yours anyway. I understand.”"
      },
      {
        "paragraph": "“Whose things are yours?” Catherine was frustrated by his shameless behavior. “I just don’t want to\nleave any chance for you to approach me.”"
      },
      {
        "paragraph": "“I know. You take pity on me because I’m not as rich as before. You’re trying to help me save money.”\nShaun’s mesmerizing eyes were filled with tender affection."
      },
      {
        "paragraph": "Catherine was speechless. “I’m sick of your nonsense. I’m leaving now, and I don’t need Hadley to send\nme home.”"
      },
      {
        "paragraph": "This guy was such a jerk that he made her lose her temper."
      },
      {
        "paragraph": "“Don’t leave, Cathy. I know you want Hadley to keep me company. You’re afraid that I’ll have a hard time\nbeing here alone…” Shaun’s annoying voice rang from behind."
      },
      {
        "paragraph": "No longer able to tolerate him, Catherine eventually gritted her teeth and replied in frustration, “Fine, fine.\nJust take me to mean that I worry about you, okay? Please let me go. If I don’t go, I’m afraid I’ll knock"
      },
      {
        "paragraph": "you unconscious with the infusion bottle. ”"
      },
      {
        "paragraph": "“If you’re really planning to leave, do send Hadley a text once you get home later. If you don’t, I’ll contact\nWesley to find out whether you’ve reached home.” Shaun sighed faintly. He looked helpless."
      },
      {
        "paragraph": "“Alright, I will. You don’t have to contact Wesley. I’ll be staying at my dad’s place tonight.” Catherine\nglared at him before she left."
      },
      {
        "paragraph": "As Shaun watched her walk out the door, the corners of his mouth curved upward into a smile."
      },
      {
        "paragraph": "Never in his wildest dream did he think that he would one day go to the trouble of pestering a woman."
      },
      {
        "paragraph": "In the past, he could not be bothered about it. Nevertheless, he came to realize that there was nothing\nwrong with pursuing the woman he loved."
      }
    ]
  },

  {
    "title": "Chapter 1118 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South] Chapter 1120"
      },
      {
        "paragraph": "Shaun’s words made Catherine feel deeply powerless."
      },
      {
        "paragraph": "It reminded her of Shaun uttering all kinds of pickup lines when she met him for the first time. Later, she\nlashed out at him and wondered if he was mentally ill."
      },
      {
        "paragraph": "At that time, she felt that he was a dumb*ss for not knowing how to flirt with such a beauty."
      },
      {
        "paragraph": "Now, she seemed to understand his feelings then."
      },
      {
        "paragraph": "Once Shaun entered the emergency department, he had to fill in his name and phone number on the\nform to complete the registration."
      },
      {
        "paragraph": "He directly raised his injured right arm. “I can’t write.”"
      },
      {
        "paragraph": "As such, Catherine had no choice but to help him fill out the form and register for an appointment."
      },
      {
        "paragraph": "Shaun walked with her all the way. He had to take a n X-ray before finally needing some sodium chloride\nIV infusion to reduce inflammation."
      },
      {
        "paragraph": "After the nurse set up the infusion for him, he glanced at the time. It was almost 12:00 a.m. As much as\nhe wanted to spend more time with Catherine, he did not want her to tire herself out. “ Lend me your\nphone for a while. I want to give Hadley a call.”"
      },
      {
        "paragraph": "Assuming that Shaun wanted Hadley to come over to look after him, she passed him the phone."
      },
      {
        "paragraph": "Unexpectedly, he called Hadley and said, “I’m in the hospital. Come here and send Cathy home.”"
      },
      {
        "paragraph": "Catherine frowned. After Shaun ended the call, she said, “I don’t need Hadley to send me home. I can\ntake a taxi.”"
      },
      {
        "paragraph": "Let me go, Mr. Hill [by Shallow South] Chapter 1120"
      },
      {
        "paragraph": "“No. It’s not safe for a pretty young lady like you to take a taxi home at such a late hour.” Shaun shook\nhis head. “Give me the receipt. I’ll return you the money tomorrow.”"
      },
      {
        "paragraph": "Catherine glanced sideways at him."
      },
      {
        "paragraph": "Given that the beds were full tonight, he had no alternative but to have IV infusion seated on the chair,\nalone in the lifeless infusion room. The atmosphere of this messy environment did not match his elegant\nand noble temperament at all, and it made him look rather miserable."
      },
      {
        "paragraph": "She closed her eyes, telling herself that she should not soften her attitude toward him. “You don’t need to\nreturn it. Don’t think I don’t know that you’re trying to seize the opportunity to stay in touch with me.”"
      },
      {
        "paragraph": "After his attempt was seen through, Shaun smiled wryly. “Since you don’t need me to return it, that’s fine.\nWhat’s mine is yours anyway. I understand.”"
      },
      {
        "paragraph": "“Whose things are yours?” Catherine was frustrated by his shameless behavior. “I just don’t want to\nleave any chance for you to approach me.”"
      },
      {
        "paragraph": "“I know. You take pity on me because I’m not as rich as before. You’re trying to help me save money.”\nShaun’s mesmerizing eyes were filled with tender affection."
      },
      {
        "paragraph": "Catherine was speechless. “I’m sick of your nonsense. I’m leaving now, and I don’t need Hadley to send\nme home.”"
      },
      {
        "paragraph": "This guy was such a jerk that he made her lose her temper."
      },
      {
        "paragraph": "“Don’t leave, Cathy. I know you want Hadley to keep me company. You’re afraid that I’ll have a hard time\nbeing here alone…” Shaun’s annoying voice rang from behind."
      },
      {
        "paragraph": "No longer able to tolerate him, Catherine eventually gritted her teeth and replied in frustration, “Fine, fine.\nJust take me to mean that I worry about you, okay? Please let me go. If I don’t go, I’m afraid I’ll knock"
      },
      {
        "paragraph": "you unconscious with the infusion bottle. ”"
      },
      {
        "paragraph": "“If you’re really planning to leave, do send Hadley a text once you get home later. If you don’t, I’ll contact\nWesley to find out whether you’ve reached home.” Shaun sighed faintly. He looked helpless."
      },
      {
        "paragraph": "“Alright, I will. You don’t have to contact Wesley. I’ll be staying at my dad’s place tonight.” Catherine\nglared at him before she left."
      },
      {
        "paragraph": "As Shaun watched her walk out the door, the corners of his mouth curved upward into a smile."
      },
      {
        "paragraph": "Never in his wildest dream did he think that he would one day go to the trouble of pestering a woman."
      },
      {
        "paragraph": "In the past, he could not be bothered about it. Nevertheless, he came to realize that there was nothing\nwrong with pursuing the woman he loved."
      }
    ]
  },
  {
    "title": "Chapter 1119 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Ask Gary to settle it,” Mason said nonchalantly."
      },
      {
        "paragraph": "“Will Gary agree on it?” A helpless expression flashed across Maurice’s face. “I’m sure the Holt family\nwould rather sacrifice Chelsea than offend the Mead family and the Snow family."
      },
      {
        "paragraph": "“I have dirt on the Holt family. When I threaten them, I’ll also give them some benefits.”"
      },
      {
        "paragraph": "Mason paused for an instant and glanced at Charlie gravely. “It’s not as simple as you guys think. We\ncan shift the blame to Chelsea, but the Mead family and the Snow family aren’t fools. They’ll definitely\nsuspect us.”"
      },
      {
        "paragraph": "“So… what should we do?” Charlie’s face turned ghastly."
      },
      {
        "paragraph": "“Offer them benefits.” Mason secretly rubbed his fingers together. “Let’s start from the Mead family.\nMoney talks.”"
      },
      {
        "paragraph": "“Okay, I got it. Uncle Mason, you’re awesome.” Charlie admired Mason a lot However, Mason remained\nindifferent. “Use your brains before you act next time. It doesn’t matter if you die. Just don’t drag the\nCampos family into the mess.”"
      },
      {
        "paragraph": "Abashed, Charlie could not help but lower his head and admit his reckless impetuousness this time. “ I’m\nsorry.”"
      },
      {
        "paragraph": "“Shaun is even more skillful than a top special agent. If you’re planning to kill him with your poor tactics,\nyou can dream on.” Mason glowered at Charlie. “Now, get lost.”"
      },
      {
        "paragraph": "After Charlie left despondently, Maurice said with concern, “Will Shaun jump at this opportunity to\ndevelop a good relationship with the Mead family? We can’t possibly allow him to make a comeback.”"
      },

      {
        "paragraph": "“Get someone to keep an eye on him all the time.”"
      },
      {
        "paragraph": "After spending a night in the hospital, Shaun directly headed to Hill Corporation for work."
      },
      {
        "paragraph": "Once Lea knew that he came, she walked to him and told him off, “Go back and rest. You’ve just been\ndischarged from the hospital, yet the first thing you do is to come to the office. Don’t you dare drop dead\nin the office. I still want you to be around in my last moments.”"
      },
      {
        "paragraph": "Shaun raised his eyebrows. He could sense her care for him from her somber tone. “Don’t worry. I’ll be\nwith you in your last moments.”"
      },
      {
        "paragraph": "Lea lifted her brows. She felt that something seemed quite different about him."
      },
      {
        "paragraph": "Although Shaun had been coming to the office every day before this, he hardly did anything. He just lived\nin a daze, as if he had lost all motivation to live."
      },
      {
        "paragraph": "Could he have bestirred himself because he was on the verge of death last night?"
      },
      {
        "paragraph": "“What actually happened last night?”"
      },
      {
        "paragraph": "When Lea recalled almost losing this son last night, her gaze turned gentle. “Why did the elevator\nsuddenly go wrong? Was it because someone planned to kill Hannah? Or could the person be targeting\nyou?”"
      },
      {
        "paragraph": "“I’m not sure. Just leave it to the police to find out, ” Shaun responded indifferently."
      },
      {
        "paragraph": "“Is the Campos family trying to kill you? I heard both the Campos family and the Holt family were\ntargeting you at the banquet…”"
      },
      {
        "paragraph": "“There’s no evidence, ” Shaun interrupted her."
      },
      {
        "paragraph": "Lea’s expression looked awful. It even had a hint of hatred and despair."
      },
      {
        "paragraph": "Since Shaun did not deny it, it meant that it could be the Campos family’s doing."
      },
      {
        "paragraph": "She could not get her head around it. The Campos family was already the most influential family in\nAustralia, Hill Corporation had already been defeated and left in a tight corner, and she had also been\nabandoned. She had even lost one of her sons."
      },
      {
        "paragraph": "In this case, why would the Campos family want to go as far as killing her family?"
      },
      {
        "paragraph": "What had she done wrong to make the Campos family turn against people around her time and time\nagain?"
      },
      {
        "paragraph": "“Don’t overthink things.” Shaun looked at her expression. “This matter has nothing to do with you. The\nCampos family is petty. What’s more, I jeered at Charlie last time, so he has been holding a grudge\nagainst me ever since.”"
      },
      {
        "paragraph": "Lea was astounded. “They’re trying to kill you just because of that jeer?”"
      }
    ]
  },
  {
    "title": "Chapter 1120 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Don’t underestimate the Campos family’s cruelty. Right now, for them, it’s their way or the highway.”\nShaun reminded, “You don’t have to look for Mason. A person like him is already considered inhuman.”"
      },
      {
        "paragraph": "“What… what do you mean?” Lea was confused. She had a feeling that Shaun knew something."
      },
      {
        "paragraph": "“ If it was the Campos family’s doing, they’d make Chelsea a scapegoat for this incident in order to\nprotect Charlie. Although Chelsea is Joanne’s sister and Joanne has given birth to Mason’s child, the\nCampos family can afford to sacrifice the Holt family. Just wait and see. We’ll hear from them soon.”"
      },
      {
        "paragraph": "Lea shuddered. Only now did it hit her that Mason was much more terrifying than she had imagined."
      },
      {
        "paragraph": "“I’m going to meet the chairman of Garson Corporation this afternoon,” Shaun informed her."
      },
      {
        "paragraph": "“Alright.”"
      },
      {
        "paragraph": "When Lea got to the door absent-mindedly, she turned around and reminded him with mixed feelings, “\nShaun… Take care of yourself… You’re the only son I have now.”"
      },
      {
        "paragraph": "As Shaun stared at her desolate figure, he could not resist clicking open a group photo on his phone."
      },
      {
        "paragraph": "It was a photo of the entire Hill family, taken during Old Master Hill’s birthday a few years ago. It was the\nonly photo he had with Liam."
      },
      {
        "paragraph": "In fact, he dared not let Lea know his suspicion that Liam’s disappearance had to do with Mason."
      },
      {
        "paragraph": "Chance’s going made Shaun suspect that there was a mole among the Liona members."
      },
      {
        "paragraph": "If it was the mole who stole the information regarding Hill Corporation’s microchip, Liam might be\ninnocent. It meant that Liam did not betray Hill Corporation, and Mason was the one who abandoned"
      },

      {
        "paragraph": "him."
      },
      {
        "paragraph": "Back then, Shaun never would have thought that Mason would treat his biological son this way. After all,\nwhy would a parent harm their own child?"
      },
      {
        "paragraph": "However, he noticed from yesterday’s incident that the Campos family was far crueler than he expected."
      },
      {
        "paragraph": "Hopefully… Liam was still alive."
      },
      {
        "paragraph": "“Young Master Hill, Miss Mead is here, ” Hadley suddenly said."
      },
      {
        "paragraph": "Shaun knitted his attractive brows. A moment later, he said, “Let her in.”"
      },
      {
        "paragraph": "Soon, Hannah appeared at the door in a purple maxi dress. She wore a butterfly-shaped diamond\nearring, and her face was beautifully made up. Her movement carried an eccentric sense of sexiness."
      },
      {
        "paragraph": "“Shaun, I deliberately came here to thank you. Here is your shirt. Thank you for lending it to me last\nnight. I’ve had it washed.” Hannah passed him the bag in her hand."
      },
      {
        "paragraph": "Shaun kept still, so Hadley swiftly took it."
      },
      {
        "paragraph": "“Thank you for sending it over,” Shaun said coldly."
      },
      {
        "paragraph": "Hannah looked at the man seated in the leather chair and could tell that he did not have a good rest last\nnight. Even so, it did not affect his noble and charming presence."
      },
      {
        "paragraph": "He had changed into a black shirt, which color made him look much cooler and more attractive. As his\ncollar was not fully buttoned up, his exquisite Adam’s apple and sexy collarbones were visible."
      },
      {
        "paragraph": "Having grown up abroad since she was young, Hannah had met numerous influential figures."
      },
      {
        "paragraph": "However, none of the men had such a strong aura as Shaun’s. His glance could simply make a woman’s\nears flush red."
      },
      {
        "paragraph": "She was set on getting this man."
      },
      {
        "paragraph": "At that moment, Hannah was so determined that she smiled seductively. “ It’s my responsibility to return\nthe shirt back to its owner. I was wondering i f you’d have the time to have lunch together. I know a great\nrestaurant here.”"
      },
      {
        "paragraph": "Given that Shaun was down-and-out at this point, she believed he would jump at the chance because of\nher status."
      },
      {
        "paragraph": "However, Shaun glanced at her and said, “Sorry. I have to work overtime at noon.”"
      },
      {
        "paragraph": "“Let’s make it at night, then…”"
      }
    ]
  },
  {
    "title": "Chapter 1121 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Shaun interrupted Hannah mid- sentence. “Miss Mead, I only saved you because I don’t want your dad\nto put me into trouble, so I don’t need you to express your gratitude or return the favor.”"
      },
      {
        "paragraph": "Hannah stared at him in astonishment. The man’s gaze was as calm as a lake, making it hard for people\nto see through him."
      },
      {
        "paragraph": "Nevertheless, she could sense that he meant what he said."
      },
      {
        "paragraph": "This man’s frankness made her fall even deeper for him."
      },
      {
        "paragraph": "“But… I want to express my gratitude and return the favor to you. What should I do?” Hannah walked\nflirtatiously to his office desk and pressed her hands on it before she bent over a little."
      },
      {
        "paragraph": "Despite sitting on the chair, Shaun could easily get a glimpse of her chest the instant he lifted his eyes."
      },
      {
        "paragraph": "However, his eyes did not glint at all. Instead, he felt a faint feeling of disgust in his throat. “Miss Mead, I\nthink you should check my profile. As"
      },
      {
        "paragraph": "everyone knows, I’m impotent, so I shall not keep you waiting.”"
      },
      {
        "paragraph": "“I don’t buy it. How is it possible for a sturdily- built man like you to be impotent?”"
      },
      {
        "paragraph": "Hannah stretched out her hand and touched his crotch."
      },
      {
        "paragraph": "Shaun’s expression changed, and he grabbed her wrist. If she were not Senator Mead’s daughter, he\nwould have kicked such a shameless woman out."
      },
      {
        "paragraph": "“I just want to take a look. Why are you so nervous?” Hannah pouted without feeling embarrassed at all.\n“Unless you’re lying to me.”"
      },

      {
        "paragraph": "“Get someone to check my profile, and you’ll know. I got beaten up in the detention center earlier, and I\nwas even sent to the hospital.” Shaun rose to his feet and pushed her away coldly. “I visit the hospital\nevery week, so my medical record is there.”"
      },
      {
        "paragraph": "Hannah was dumbfounded at how serious he looked. She could not believe that such an excellent man\nwas actually… impotent?"
      },
      {
        "paragraph": "“It’s fine. I’ll get someone to cure it for you.” Hannah shot him a flirtatious look. “Besides… I can be happy\neven without that. I trust you.”"
      },
      {
        "paragraph": "Shaun’s handsome face turned black with anger."
      },
      {
        "paragraph": "Perhaps he had never met such a shameless young lady before."
      },
      {
        "paragraph": "Hannah gave a faint smile before she turned around and left gracefully."
      },
      {
        "paragraph": "Shaun rubbed his forehead as he swung around and said to Hadley, “ If this woman comes next time,\njust tell her that I’m not around.”"
      },
      {
        "paragraph": "“Okay.” Hadley was completely speechless."
      },
      {
        "paragraph": "“By the way, pass me your phone.” Shaun extended his hand to Hadley."
      },
      {
        "paragraph": "“Young Master Hill, didn’t I buy you a new phone already…”"
      },
      {
        "paragraph": "Under Shaun’s stony gaze, Hadley sighed and took out his phone reluctantly."
      },
      {
        "paragraph": "Shaun dialed Catherine’s number and soon got through."
      },
      {
        "paragraph": "“Hi, Hadley…” Catherine’s gentle voice rang."
      },
      {
        "paragraph": "The second Shaun heard it, he glowered at Hadley. He was surprised at how gently she spoke to Hadley."
      },
      {
        "paragraph": "Looking innocent, Hadley was at a loss for words. What on earth had he done wrong?"
      },
      {
        "paragraph": "“It’s me.” Shaun cleared his throat. A second later, his handsome face became extremely gentle, which\nstartled Hadley. Shaun must have trained his skills in switching facial expressions."
      },
      {
        "paragraph": "Upon hearing Shaun’s voice, Catherine immediately turned cold. “Why are you the one speaking?”"
      },
      {
        "paragraph": "Despite being despised, Shaun forced a smile. “ Thank you for paying my medical fees on my behalf last\nnight…”"
      },
      {
        "paragraph": "“If you want to return the money to me, I’ll send Hadley the QR code, and you can just scan it directly.”\nCatherine cut in on him without a second thought."
      }
    ]
  },
  {
    "title": "Chapter 1122 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Shaun choked for a few seconds before he came to and thought on his feet. “Paying you back isn’t\nenough to express my gratitude to you. I know a great restaurant around. I was wondering if you are free\nthis afternoon…”"
      },
      {
        "paragraph": "“Thank you, but I’m not.” Catherine rejected him categorically."
      },
      {
        "paragraph": "“When will you be free then? You can set a time. I’ll go with your schedule, ” Shaun said right away."
      },
      {
        "paragraph": "Exasperated, Catherine answered, “I’ll never be available to you.”"
      },
      {
        "paragraph": "“Coincidentally, I’ll always be available to you…”"
      },
      {
        "paragraph": "She hung up before Shaun could finish his sentence."
      },
      {
        "paragraph": "Shaun looked at the phone and laughed. In less than a minute, he received the QR code from Catherine\non Hadley’s phone."
      },
      {
        "paragraph": "He scanned the code using his phone and transferred 52 thousand dollars to her."
      },
      {
        "paragraph": "In the office."
      },
      {
        "paragraph": "When Catherine saw the money, she had no thought of returning it to him."
      },
      {
        "paragraph": "So what if he gave her extra money? He had hurt her badly, yet he did not pay her a penny when he\ndivorced her. Therefore, she would not even bat an eye if he gave her 500 million dollars, much less\n50,000 dollars."
      },
      {
        "paragraph": "At 11:00 a.m., Freya called Catherine. “I went to the Snow family’s house this morning. Regarding the\nelevator incident yesterday, Uncle Nathan said that someone intentionally destroyed the cable. Based on"
      },

      {
        "paragraph": "the Mead family’s investigation, the evidence points to Chelsea.”"
      },
      {
        "paragraph": "“Chelsea?” Catherine was surprised. “I saw the Campos family egging her on last night, so she’s\nobviously brainless. How could she do that?”"
      },
      {
        "paragraph": "“Yeah. Uncle Nathan said it might have to do with the Campos family, but they’ve shifted the blame to\nChelsea. What’s more, everyone saw Chelsea coming into conflict with Shaun last night. The police have\narrested her for interrogation.”"
      },
      {
        "paragraph": "Catherine replied, “Tsk. It looks like the Campos family has made Chelsea a scapegoat. Having said that,\nis Senator Mead not bothered about the matter?”"
      },
      {
        "paragraph": "“From what Uncle Nathan said, it seems that the Mead family isn’t planning to look into it.”"
      },
      {
        "paragraph": "Only then did it click in Catherine. “ It looks like the Campos family has given them some benefits this\ntime.”"
      },
      {
        "paragraph": "“Most probably. By the way, Senator Mead also asked Uncle Nathan about Shaun…”"
      },
      {
        "paragraph": "Catherine’s heart did a flip. She had already noticed Hannah’s unusual gaze on Shaun last night."
      },
      {
        "paragraph": "“Hehe. Cathy, do you think Shaun will become Senator Mead’s son-in-law?” Freya added curiously, “If he\nbecame the future deputy prime minister’s son-in-law, it should be easy for a person of his caliber to\nmake a comeback.”"
      },
      {
        "paragraph": "“I don’t know. It has nothing to do with me.” Catherine ended the call indifferently."
      },
      {
        "paragraph": "In her opinion, any man in this dire situation would definitely choose to marry Hannah if given the\nchance."
      },
      {
        "paragraph": "However, now that the Mead family took a liking to him, why did he transfer 52 thousand dollars to her?\nAt the thought of it, she felt like slapping him to death."
      },
      {
        "paragraph": "She directly called Harvey in and ordered, “Be alert these few days. Don’t ever let Shaun come in.”"
      },
      {
        "paragraph": "Harvey was momentarily stunned, but he then quickly nodded."
      },
      {
        "paragraph": "In order to fulfill the task Catherine assigned to him, Harvey purposely informed the receptionist and\nsecurity guard about it."
      },
      {
        "paragraph": "At 12:00 p.m., Shaun really did show up with a bouquet of roses and a lunchbox."
      },
      {
        "paragraph": "It was break time, so a lot of employees were going out to buy things. Although Shaun was stopped by\nthe security guard, he still stood at the door shamelessly and insisted on meeting Catherine."
      },
      {
        "paragraph": "“I must see her. She saved me last night, and I just want to express my gratitude to her.”"
      },
      {
        "paragraph": "The receptionist was speechless. “ I’ve never seen people thanking their saviors this way.”"
      },
      {
        "paragraph": "“Well, I have to. If she hadn’t saved me at the last moment, I would’ve died…” At the sight of the\nemployees’ confused gazes, Shaun’s thin lips curled upward. “Are you guys wondering how President\nJones saved me last night?”"
      },
      {
        "paragraph": "Those employees subconsciously nodded. After all, curiosity was an innate quality. Besides, they were\neager to find out how President Jones, who was already married, rescued her ex-husband."
      }
    ]
  },

  {
    "title": "Chapter 1123 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Shaun flashed a captivating and mysterious smile. “ It was at a pitch-black place. It was very dark…”"
      },
      {
        "paragraph": "Harvey, who was watching from the side, saw the situation was not right. He was afraid Shaun would say\nsome ambiguous things that would affect Catherine’s reputation. Hence, he squeezed over in a hurry\nand pulled Shaun aside. “President Hill, you and President Jones already divorced a long time ago. Can’t\nyou just go along your own way? If words of what you said here got out, it’d affect President Jones’\nmarriage.”"
      },
      {
        "paragraph": "“ Isn’t that great?” Shaun raised his eyebrows. He had already become adept at being a shameless\nhomewrecker."
      },
      {
        "paragraph": "The corners of Harvey’s mouth twitched. “No. As a person, this is not right…”"
      },
      {
        "paragraph": "“Then, I can not be a person.”"
      },
      {
        "paragraph": "Harvey stammered. “…But, if you’re not a person, what will you be?”"
      },
      {
        "paragraph": "“A simp.” Shaun’s expression showed no care at all."
      },
      {
        "paragraph": "Harvey looked at Shaun’s arrogant, handsome face. He was stunned. He did not know what Shaun had\nexperienced to have made him like this."
      },
      {
        "paragraph": "Did he not care about his pride anymore?"
      },
      {
        "paragraph": "“If you don’t let me in, I’ll have no choice but to wait here. ” Shaun sighed. “If someone asked out of\ncuriosity, I’d have to tell everyone about last night, when your President Jones almost cried out of panic\nbecause she thought I was dead.”"
      },

      {
        "paragraph": "Harvey’s scalp tingled. With that, he had no choice but to turn around secretly and call Catherine to\nreport the situation."
      },
      {
        "paragraph": "Catherine’s pretty face darkened when she heard about it. “Don’t listen to his bullsh*t. I didn’t cry at all.”"
      },
      {
        "paragraph": "“President Jones, me listening is not the problem here. If he says this to the employees, it’ll ruin your\nreputation.”"
      },
      {
        "paragraph": "Harvey lowered his voice and said, “Moreover, I feel like Young Master Hill has changed into a different\nperson. He said he need not be a human. He can simply be a simp.”"
      },
      {
        "paragraph": "Catherine was speechless."
      },
      {
        "paragraph": "Then, she touched her forehead and finally said weakly, “Fine. Bring him in from the parking lot. Don’t let\nanyone see him.”"
      },
      {
        "paragraph": "There were too many people and too many mouths in the company. It would be troublesome if Wesley\nheard about it."
      },
      {
        "paragraph": "In the end, Shaun went up through the president’s private elevator in the parking lot. Along the way,\nHarvey was very cautious. When they came out of the elevator, Harvey even complained, “You’re the\none who wants to be the lover, so there’s no choice. A lover only deserves to sneak around.”"
      },
      {
        "paragraph": "“It’s okay. For her, I can always sneak around, ” Shaun said without hesitation."
      },
      {
        "paragraph": "Harvey shuddered."
      },
      {
        "paragraph": "He could understand if anyone else said those words, but he felt very uncomfortable when it came out of\nShaun’s mouth."
      },
      {
        "paragraph": "In the office, Harvey immediately closed the door after Shaun entered. That sneaky action made Shaun\nsmirk at Catherine. “Cathy, don’t you think we look like we’re… having an affair?”"
      },
      {
        "paragraph": "Catherine was already feeling guilty toward Wesley, but after hearing those last three words from\nShaun’s mouth, she picked up the mouse on the table and threw it at him out of anger. “Shut up. ”"
      },
      {
        "paragraph": "“Fine. Guilty people will usually make others shut up. I understand.” Shaun made a gesture of sewing his\nmouth shut. Then, he smiled mysteriously."
      },
      {
        "paragraph": "Catherine almost spat a mouthful of blood."
      },
      {
        "paragraph": "She really hoped for Shaun to return to how he was before, arrogant and haughty."
      },
      {
        "paragraph": "She did not know how to handle shameless him. She could not even chase him away at all. He was as\nsticky as chewing gum."
      },
      {
        "paragraph": "She took a deep breath and sneered. “I heard you want to be a simp?”"
      }
    ]
  },
  {
    "title": "Chapter 1124 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Yes, a high -class simp. This is how a man cares about a woman. I didn’t know this before, but I will\nlearn from now on.” Only then, as Shaun stood in front of her, did he realize that once he was used to\nthrowing his pride to the ground, picking it back up did not seem to matter to him anymore."
      },
      {
        "paragraph": "Catherine was utterly speechless. Luckily she had already made preparations before letting him come\nup."
      },
      {
        "paragraph": "“Fine. Since you want to be a simp, then eat this.” She took a piece of raw beef from the drawer and\nthrew it on the floor. She had asked the kitchen"
      },
      {
        "paragraph": "staff to bring it up just now."
      },
      {
        "paragraph": "Shaun’s handsome face darkened when he saw that piece of meat. After a moment, under Catherine’s\ngaze, he picked that piece of raw beef and took a bite."
      },
      {
        "paragraph": "Catherine’s eyes widened. She only wanted to prank him so that he would back off from the humiliation.\nShe did not expect he would…"
      },
      {
        "paragraph": "She stood up in a hurry. “ Shaun, you… You really ate it. I… I was just joking.”"
      },
      {
        "paragraph": "A pungent, unpleasant smell filled his nose. Shaun almost puked, but he forced himself to swallow it\ndown. “Cathy, I know you want to make me leave, but I won’t go. It’s just a piece of raw beef. It’s nothing\ncompared to the hardships that you’ve gone through before.”"
      },
      {
        "paragraph": "After he spoke, he took another bite of the beef. His white teeth were stained with blood, but he still\nsmiled. “In the past, you must’ve hated me so much that you wanted to devour my meat and drink my\nblood, right?”"
      },

      {
        "paragraph": "“Stop eating it.”"
      },
      {
        "paragraph": "Catherine could no longer stand the sight of him taking another bite of the meat. Hence, she rushed over,\nsnatched the meat in his hand, and threw it into the trash can."
      },
      {
        "paragraph": "Although she had become very rational and calm after having experienced so many things, she found\nthat Shaun’s torment lately had made it harder and harder for her to control her emotions."
      },
      {
        "paragraph": "“Okay, if you don’t allow me to eat it, then I won’t. Shaun gazed at her and smiled affectionately. Those\nwho did not know better would think what she gave him was a sweet piece of chocolate."
      },
      {
        "paragraph": "Helpless against a man like that, Catherine’s head began to hurt. “ Shaun, how many times do I have to\nsay…”"
      },
      {
        "paragraph": "“I’ve packed a lunch box for you. ” Shaun took out the lunch that he made for her that morning. “ Thank\nyou for helping me yesterday.”"
      },
      {
        "paragraph": "Catherine gritted her teeth. She blurted out, “ If I knew you’d keep pestering me, I would rather not help\nyou yesterday.”"
      },
      {
        "paragraph": "“Even if you didn’t help me, I would still have to thank you. After all, it was my conviction of love for you\nthat helped me to escape. Anyhow, you’re my life savior.” Shaun opened the container. “Although it’s not\nas tasty as what you make, it’s edible. It won’t kill you.”"
      },
      {
        "paragraph": "“Thanks, but I’ve already eaten. ” Catherine did not want to eat the food he made."
      },
      {
        "paragraph": "“It’s impossible for you to have eaten at this hour. Cathy, don’t upset your stomach. ” Shaun handed her\na fork. “Try it. I made these… pork ribs. You always used to make it for me in the past. From now on, I’ll\nbe the one cooking it for you.”"
      },
      {
        "paragraph": "Catherine looked at the pork ribs, which were arranged neatly, with mixed feelings."
      },
      {
        "paragraph": "That was right. She always used to rack her brains to cook for him in the past."
      },
      {
        "paragraph": "Suddenly, Harvey’s raised pitch came from the outside. “President Lyons, why are you here?”"
      },
      {
        "paragraph": "Catherine’s hand trembled, and Wesley’s voice rang. “Mm. I came to visit Cathy.”"
      },
      {
        "paragraph": "As Catherine was flustered, Shaun suddenly got close to her ear and asked with a hoarse voice, “Do you\nneed me to hide?”"
      },
      {
        "paragraph": "The corners of Catherine’s mouth twitched. He really did have self-awareness."
      },
      {
        "paragraph": "However, she and Shaun had done nothing at all. If he hid, it would make it seem like they were covering\nup something. If he did not hide, Wesley would surely misunderstand."
      },
      {
        "paragraph": "While she was thinking, Shaun had already swiftly hidden in her lounge."
      },
      {
        "paragraph": "His adept movements left Catherine gawking."
      }
    ]
  },
  {
    "title": "Chapter 1125 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "The next second, Wesley pushed the door and walked in."
      },
      {
        "paragraph": "Catherine did not manage to hide the food container on the table, but luckily Shaun had taken the\nbouquet away with him."
      },
      {
        "paragraph": "“Cathy, you’re eating.” Wesley looked at the food container, and a dark gleam flashed in his eyes. “\nShaun sent it?”"
      },
      {
        "paragraph": "Catherine wanted to say yes. However, when the words were at the tip of her tongue, she felt it would be\nhard to explain if she admitted that she accepted Shaun’s food. “No, the canteen sent it up here.”"
      },
      {
        "paragraph": "After a moment of hesitation, she quickly changed the topic. “How did you know Shaun was here?”"
      },
      {
        "paragraph": "“I was afraid Shuan would pester you, so I told your company’s employees downstairs beforehand to\ninform me if Shaun came.”"
      },
      {
        "paragraph": "Wesley smiled as he explained. “Has he left?” “Mm, I didn’t let him up.” After Catherine answered, she\nfelt very guilty."
      },
      {
        "paragraph": "“That’s good.” A glint flashed in Wesley’s eyes. He suddenly smiled and said, “Your office smells good.”"
      },
      {
        "paragraph": "“I sprayed some perfume just now.”"
      },
      {
        "paragraph": "Catherine guessed it must have been the fragrance of Shaun’s bouquet. Since she told a lie, she could\nonly continue lying to complete the lie. “Um… Have you eaten? Why don’t we go down to the canteen to\neat?”"
      },
      {
        "paragraph": "When she thought about that time bomb, Shaun, who was hiding inside, she did not dare stay there for\nanother moment."
      },

      {
        "paragraph": "“…Okay.” Wesley nodded. “Are you going to bring that food container down too?”"
      },
      {
        "paragraph": "“No. If I knew you were coming, I wouldn’t have told the kitchen to send it up.”"
      },
      {
        "paragraph": "Catherine smiled sheepishly. Then, she quickly stood up and headed downstairs with him."
      },
      {
        "paragraph": "“Hold on. I have to use the bathroom.” Wesley suddenly walked toward the lounge."
      },
      {
        "paragraph": "Catherine was so startled that her heart was up in her throat. However, Wesley was too quick. Before\nshe could manage to find a suitable excuse, the door was already pushed open."
      },
      {
        "paragraph": "Luckily, the lounge was empty — Shaun and the flowers were gone. The only place where he could hide\nwas the cupboard."
      },
      {
        "paragraph": "Shaun was hiding in the cupboard?"
      },
      {
        "paragraph": "Catherine’s mood became complicated. However, her suffocating heart finally calmed. Maybe she was\noverthinking, but she felt like Wesley might be suspecting that Shaun was hiding in here."
      },
      {
        "paragraph": "However, it did not look that way from Wesley’s calm, collected face."
      },
      {
        "paragraph": "After Wesley came out from the bathroom, he put his hand around her, and they left the office."
      },
      {
        "paragraph": "As they were exiting, Harvey even glanced at Catherine weirdly."
      },
      {
        "paragraph": "When Catherine arrived at the canteen, she sent Harvey a text message. [Find Shaun and send that VIP\naway.]"
      },
      {
        "paragraph": "Five minutes later, Harvey replied. [The VIP said he’s not leaving. He’s tired, and he wants to… take a\nrest on your bed.]"
      },
      {
        "paragraph": "F*ck."
      },
      {
        "paragraph": "“Cathy, can you put down your phone when you’re with me? Eat.” Wesley gave her some vegetables. His\ntone was gentle."
      },
      {
        "paragraph": "“ I’m assigning Harvey some work.” Catherine put down her phone."
      },
      {
        "paragraph": "“Cathy, actually, I have something I want to discuss with you,” Wesley said suddenly. “Lucas is your son,\nbut you always have to be secretive when you’re with him. This can’t go on. I’m thinking of registering\nLucas under my name and announcing to the public that he’s our son. You went missing for three years\nbefore this anyway. No one would suspect anything even if we have a child.”"
      },
      {
        "paragraph": "Catherine was taken aback."
      },
      {
        "paragraph": "Wesley took the chance and said, “He can’t pretend to be Uncle Sheldon’s son forever. Do you wish to\nkeep him hidden forever? You won’t even have the right to participate in his parent-child activities in the\nfuture.”"
      }
    ]
  },
  {
    "title": "Chapter 1126 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Let me… think it over.” Catherine’s mind was in a mess. Actually, Wesley had a point there."
      },
      {
        "paragraph": "If she wanted to tell others that Lucas was her son, she had to find a legal father for him. With Shuan’s\npersonality, she would not be able to steer clear of him her whole life if he found out that Lucas was his\nson."
      },
      {
        "paragraph": "“What’s there to consider about this?”"
      },
      {
        "paragraph": "Disappointment clouded Wesley’s face. “Lucas is a very nice and sensible child. Although he doesn’t\nsay it, I know he feels upset whenever he can’t freely be with his mom like the other kids. He just\ndoesn’t say it out loud because he doesn’t want to put pressure on you.”"
      },
      {
        "paragraph": "Catherine tightened her grip on the fork."
      },
      {
        "paragraph": "She knew what kind of child Lucas was, and his sensibility made her heart ache."
      },
      {
        "paragraph": "“Unless… you’re still undecided on being together with me, ” Wesley said suddenly."
      },
      {
        "paragraph": "Catherine was stunned."
      },
      {
        "paragraph": "Was she still undecided? Had she not moved over already?"
      },
      {
        "paragraph": "She was even mentally prepared to have sex with him, but he was the one who chose to live apart all\nalong. Moreover, Shaun had been frequently appearing in her world these days. It made her very\nannoyed."
      },
      {
        "paragraph": "“Wesley, you said it yourself that Lucas is sensible, so I have to ask Lucas for his opinion on this.”\nCatherine found an excuse."
      },

      {
        "paragraph": "“Okay.” Wesley had no words to say. “Do you need me to go shopping with you in the evening? Do you\nhave anything you want to buy? You’ve been married to me for so long, yet I haven’t spent any money\non you.”"
      },
      {
        "paragraph": "“No need. I have an important meeting to attend in the evening. ” What Catherine said was the truth."
      },
      {
        "paragraph": "“Alright, then. I’ll just go back to my company and work extra hours too. My wife is a workaholic\nanyway.”"
      },
      {
        "paragraph": "Wesley had said that to tease her, but Catherine felt increasingly guilty at those words."
      },
      {
        "paragraph": "That guilt overwhelmed her when she returned to her office and noticed Shaun was sleeping in her\nbedroom."
      },
      {
        "paragraph": "“Shaun, who allowed you to fall asleep here? Go back.” Catherine pulled up Shaun angrily, but he did\nnot budge. It was as if there was a pillar rooted behind his tall figure."
      },
      {
        "paragraph": "Shaun opened his eyes in a blur. “Cathy, let me sleep for a while. I didn’t have enough rest last night.”"
      },
      {
        "paragraph": "“You can return to your own home if you didn’t have enough rest. Why do you have to be here?”\nCatherine said while gritting her teeth."
      },
      {
        "paragraph": "“Your bed has your scent. It helps me sleep peacefully.”"
      },
      {
        "paragraph": "Shaun even buried his head in her pillow and sniffed it as he spoke. “It smells good.”"
      },
      {
        "paragraph": "Catherine’s face flushed out of disgust at his shameless face. “Shaun, I’m begging you. I’m a married\nwoman. Your actions are causing great inconvenience to my marriage.”"
      },
      {
        "paragraph": "“How did I inconvenience you? I even hid in the cupboard for your sake when Wesley came in just now.\n” Shaun looked toward her with dimmed eyes"
      },
      {
        "paragraph": "and said, “You know I was often locked in the cupboard by my sitter when I was young. I have a trauma\nof cupboards…”"
      },
      {
        "paragraph": "Catherine was taken aback. What he said was a fact."
      },
      {
        "paragraph": "For someone who was hurt in the cupboard before, entering the cupboard again required a lot of\ncourage indeed."
      },
      {
        "paragraph": "However, looking at his annoying, handsome face, she did not want to give in to him. “You were the\none who came and looked for me? You brought it upon yourself.”"
      },
      {
        "paragraph": "“You’re right. For your sake, I’m willing to bring anything upon myself.”"
      },
      {
        "paragraph": "Shaun suddenly sat up and started unbuttoning his shirt with one hand."
      },
      {
        "paragraph": "Seeing his chest getting exposed inch by inch, Catherine’s scalp tingled. “Shaun, you pervert. What are\nyou trying to do?”"
      }
    ]
  },
  {
    "title": "Chapter 1127 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Shaun revealed his rows of white teeth to her, smiled, and started taking off his belt. “ I want to take a\nbath.”"
      },
      {
        "paragraph": "Catherine was dumbfounded. Then, she witnessed his slacks falling to the ground."
      },
      {
        "paragraph": "Although he was wearing something underneath, Catherine’s rosy cheeks turned a darker shade of red\nafter only a glance."
      },
      {
        "paragraph": "“Why are you so shy? It’s not like you haven’t seen it before.” Shaun raised his eyebrows playfully."
      },
      {
        "paragraph": "“No. I just haven’t seen an impotent man,” Catherine roasted him."
      },
      {
        "paragraph": "It was a blow to his pride, but Shaun was numb from being attacked so many times. “So what if I’m\nimpotent? I have countless ways to give you pleasure.”"
      },
      {
        "paragraph": "“…Pervert.” Catherine could not resist glaring at him and yelled, “Put your clothes on and get lost. Who\nallowed you to take a bath at my place?”"
      },
      {
        "paragraph": "“I didn’t bathe last night, and my body feels uncomfortable.”"
      },
      {
        "paragraph": "When Shaun bent over and was about to remove the last piece of clothing, Catherine could not stand it\nanymore. She slammed the door and went out."
      },
      {
        "paragraph": "She sat on the leather chair."
      },
      {
        "paragraph": "After sulking for some time, General Manager Wolfe and Manager Larson of the public relations\ndepartment came up to discuss a land project in Canberra with her."
      },

      {
        "paragraph": "When Catherine thought about the man in her lounge, she was not in the mood to discuss work with\nthem. Hence, she wanted to send them away after a word or two."
      },
      {
        "paragraph": "However, it seemed like General Manager Wolfe and Manager Larson would not leave without finishing\nthe discussion."
      },
      {
        "paragraph": "10 minutes later, the lounge’s door opened all of a sudden."
      },
      {
        "paragraph": "“Cathy, can you help me to put on my clothes?”"
      },
      {
        "paragraph": "Shaun stepped out barefooted in her pink bathrobe. His hair was wet and not blown dry, so the water\ndroplets from the ends of his hair dripped onto the well-built muscles of his chest. The overwhelming\nmasculine presence made both the male managers stunned."
      },
      {
        "paragraph": "10 thousand “F*ck yous” flashed across Catherine’s mind. Her face was flushed, and she wanted so\nbadly to dig a hole and bury herself in the ground. “ Ahem, don’t misunderstand. He…”"
      },
      {
        "paragraph": "“I know. I understand,” General Manager Wolfe said hurriedly, “chairwoman Jones, don’t worry. We won’t\nsay a word about today’s matter. It’ll never reach President Lyons’ ears.”"
      },
      {
        "paragraph": "“Yes, yes. ” Manager Larson nodded vigorously. “ Actually, it’s quite normal too. I’ve seen this many\ntimes. With your identity, it’s normal to have another male companion.”"
      },
      {
        "paragraph": "General Manager Wolfe said, “That’s right. Which man doesn’t have other women outside nowadays?\nAlthough you’re a woman, it’s all the same. Men and women have equal rights.”"
      },
      {
        "paragraph": "“We won’t be disturbing you anymore. We’ll leave first. You can continue.”"
      },
      {
        "paragraph": "Seeing them both leaving so quickly made Catherine speechless."
      },
      {
        "paragraph": "What were her subordinates blabbering about? What did they mean by “it’s normal to have another male\ncompanion”? They have lost their morality just to flatter her."
      },
      {
        "paragraph": "“Your employees… are quite knowledgeable.” Shaun chuckled as he walked to her side. The fragrance\nof the body wash in her bathroom was wafting off him."
      },
      {
        "paragraph": "It was a body wash catered for women, but it was not weird at all when the scent was on his body. On\nthe contrary… it smelled quite intimate."
      },
      {
        "paragraph": "Catherine was shorter than Shaun, so her gaze was in line with his sexy Adam’s apple. Moving\ndownward was his broad, firm chest. After the water droplets rolled down his chest, they sneaked into\nher pink bathrobe like a nimble fish."
      },
      {
        "paragraph": "Catherine’s face heated up. It was unknown whether it was due to embarrassment or anger, but her\npretty face was completely flushed. “Shaun, who let you use my bathrobe? And why did you come out…”"
      },
      {
        "paragraph": "“Didn’t you hear me? I asked you to help me put on my clothes,” Shaun said innocently. “As for the\nbathrobe, you didn’t give me other bathrobes. Why do you have to be such a stranger? It’s not like I’ve\nnever used yours in the past.”"
      },
      {
        "paragraph": "The past was the past. Could it be counted as the same thing?"
      }
    ]
  },

  {
    "title": "Chapter 1128 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine touched her forehead. “You have hands and legs. Can’t you put it on yourself? You’re doing\nthis on purpose, right?”"
      },
      {
        "paragraph": "“No. Can’t you see how swollen my hand is?” Shaun shook his right arm, which was swollen like a carrot,\nin front of her. “My arm can’t bend.”"
      },
      {
        "paragraph": "Catherine sneered as she looked at his arm. “You’ve really troubled yourself, coming to my place and\ncausing trouble despite your injury.”"
      },
      {
        "paragraph": "“If you don’t give me a hand, I’ll have no choice but to leave dressed like this later.” Shaun sighed."
      },
      {
        "paragraph": "Catherine glanced at his exposed body and felt her head ache. If he went out in that state, news about\nher and Shaun would be on the trending searches again tomorrow."
      },
      {
        "paragraph": "In the end, she had no choice but to walk toward the bedroom. “Come in first.”"
      },
      {
        "paragraph": "After Shaun followed her in, he locked the door."
      },
      {
        "paragraph": "Catherine looked at the closed door, then saw him removing the bathrobe. She heard a boom in her\nhead once again. “Shaun…”"
      },
      {
        "paragraph": "“If I didn’t close the door, you’d tell me off again if someone saw us and misunderstood,” Shaun\nexplained. However, his smirk was very annoying. “ By the way, please help me put on my pants too."
      },
      {
        "paragraph": "Thank you.”"
      },
      {
        "paragraph": "“…I’m not doing it.”"
      },
      {
        "paragraph": "Catherine was so angry that she could not focus her eyes. “If you dare, you can just go out in this state. ”"
      },

      {
        "paragraph": "“Fine. I’ll go.” Shaun turned around as he spoke. He put his hand on the doorknob and opened the door."
      },
      {
        "paragraph": "Seeing as the door was about to open, Catherine rushed over frantically and shut the door tightly. She\neven locked the door."
      },
      {
        "paragraph": "Shaun smiled happily as he watched her. “Sorry to trouble you, Cathy.”"
      },
      {
        "paragraph": "“Shaun, do you feel no shame?” Catherine could not understand that man’s brain structure."
      },
      {
        "paragraph": "“Cathy, I do feel shame, but my arm really hurts.” Shaun blinked innocently."
      },
      {
        "paragraph": "In the end, Catherine accepted her fate. She had dressed him before anyway. She lowered her head and\nforced herself to help him put on his clothes."
      },
      {
        "paragraph": "Her actions were not gentle, but the corners of Shaun’s mouth still lifted into a warm smile."
      },
      {
        "paragraph": "It was especially when he saw her pretty face blushing with charm."
      },
      {
        "paragraph": "She was once his wife. Why did he not treasure her? Why did he let her go?"
      },
      {
        "paragraph": "By the time Catherine stood up to help him put on his shirt, Shaun could not resist hugging her."
      },
      {
        "paragraph": "When Catherine realized what was happening, she flew into a fury. “Shaun, didn’t you say your arm hurts\na lot?”"
      },
      {
        "paragraph": "“It does hurt a lot. Can’t you see that my face has paled because of the pain?”"
      },
      {
        "paragraph": "Shaun replied in a hoarse voice. In order to hug her, the wounded muscles in his right arm hurt so badly.\nIt felt as if they were being ripped apart."
      },
      {
        "paragraph": "Catherine was stunned when she noticed his pale, handsome face."
      },
      {
        "paragraph": "During that short moment, Shaun kissed her. That b*stard…"
      },
      {
        "paragraph": "She knew he would not stay still."
      },
      {
        "paragraph": "Catherine extended her hand to push him. However, his shirt was not worn properly yet, so her hand\ntouched his hot skin."
      },
      {
        "paragraph": "She withdrew her hand instinctively due to the heat."
      },
      {
        "paragraph": "Shaun took the opportunity and pushed her onto the bed behind her."
      },
      {
        "paragraph": "Catherine’s eyes reddened from glaring at him. “ Shaun, is this the love you meant? All you know is to\nbully me. If you really love me, treat me with"
      },
      {
        "paragraph": "more respect, and don’t… make me feel guilty toward my husband again and again. You do this every\nsingle time. It was the same on the island as well.”"
      }
    ]
  },
  {
    "title": "Chapter 1129 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "As Catherine spoke, tears rolled down."
      },
      {
        "paragraph": "Shaun panicked when he saw it, and his heart was i n great pain. “Don’t cry. I’m not bullying you. I just\nwant to kiss you. If you don’t want to kiss, then I won’t do it.”"
      },
      {
        "paragraph": "Toward the end of his sentence, his voice sounded a little upset and pitiful as well. He was like a dog\nwho could not have its meat."
      },
      {
        "paragraph": "Catherine grabbed the opportunity and pushed him away. She kept a far distance from him and dared\nnot go near him anymore."
      },
      {
        "paragraph": "Shaun sat up and clumsily buttoned up with one hand."
      },
      {
        "paragraph": "Catherine did not want to be teased by him anymore, so she just turned around and walked out."
      },
      {
        "paragraph": "However, when she sat in front of the office table and turned on her laptop, she could not comprehend\nthe contents of a report she was reading."
      },
      {
        "paragraph": "Shaun’s breath was still on her lips, and it made her feel like she was carrying heavy chains on her back.\nNevertheless, it was an undeniable fact that she did not reject Shaun’s kiss."
      },
      {
        "paragraph": "On the contrary, she would feel extremely uncomfortable whenever Wesley got close to her."
      },
      {
        "paragraph": "Her heart gradually sank as she continued to think about it."
      },
      {
        "paragraph": "Not long after, Shaun came out."
      },
      {
        "paragraph": "Catherine acted as if she was working seriously and gave him a cold shoulder."
      },

      {
        "paragraph": "That was because she realized that once Shaun opened his mouth, she felt as if he had gobbled her\ndown. She would be put in a constantly defensive state."
      },
      {
        "paragraph": "When a contraceptive pill that she just saw last night was placed in front of her, a pain arose in her heart\nout of anger. “Shaun, are you planning to come over every day and force me to eat this thing? Did you\nforget I just ate it last night? Too much is not good for the body.”"
      },
      {
        "paragraph": "Shaun’s arm stiffened. After a long moment, he said with mixed feelings, “Who knows if Wesley will\ntouch you tonight…”"
      },
      {
        "paragraph": "Catherine shut her laptop. She was silent for half a minute before she gritted her teeth and said, “ Aren’t\nyou just hoping that I don’t get pregnant with Wesley’s child? You don’t have to give me those\ncontraceptives anymore because I already had his child.”"
      },
      {
        "paragraph": "Shaun’s body trembled. He said with a smile, “ Cathy, don’t lie to me.”"
      },
      {
        "paragraph": "“I’m not lying.”"
      },
      {
        "paragraph": "Catherine stood up abruptly and said with determination, “Wesley and I have a child who’s a little more\nthan two years old. When Wesley was with me in the US back then, I had that child after we had s*x\nunder the influence of alcohol.”"
      },
      {
        "paragraph": "She could not be tangled up in this weird relationship with Shaun anymore. Although last night made her\nrealize that she might still have some feelings for Shaun, she could no longer do Wesley wrong."
      },
      {
        "paragraph": "Shaun gazed at her in a daze. Slowly, his handsome face started to turn grim. His hands, which were\nresting by his thighs, gradually clenched into fists. However, his thin lips were still smiling stubbornly.\n“Cathy, do you think I believe you? You said you have a child. Where is that child?”"
      },
      {
        "paragraph": "“I wanted to seduce you and get revenge on you after I came back, so I didn’t keep that child by my\nside.”"
      },
      {
        "paragraph": "Catherine pressed her lips together with mixed feelings. In fact, she had already thought of that excuse\nright after she came back from the US. Firstly, that excuse could hide Lucas’s identity naturally. Secondly,\nit could provoke and hurt Shaun."
      },
      {
        "paragraph": "After that, she went through a lot of things and gave up on using that excuse. She also gave up on the\nthought of getting revenge on Shaun."
      },
      {
        "paragraph": "The reason she used this excuse again now was not to get revenge on him but to make him give up\ncompletely."
      },
      {
        "paragraph": "“I don’t believe it.”"
      },
      {
        "paragraph": "Shaun shook his head. Even if his heart was filled with overwhelming dread and fear, he still stubbornly\ndenied it. “You already have Wesley’s child, yet you came to seduce me and even had s*x with me\nbefore. Would Wesley agree to that?”"
      },
      {
        "paragraph": "“He can’t disagree with my plans because the birth of that child was an accident.”"
      },
      {
        "paragraph": "Catherine averted her gaze. She did not want to look into his eyes that were about to lose control. “\nInitially, I wanted to wait until you had fallen too"
      },
      {
        "paragraph": "deeply in love with me, then tell you about the child. It was a kind of revenge on you too. However, I gave\nup on the thought of getting revenge on you afterward. In fact, you know about this too. The child has\nbeen by my side all along, raised at my dad’s place. You can choose not to believe it, but you will after\nyou see the child’s appearance.”"
      },
      {
        "paragraph": "The boy whom Shaun saw at the preschool flashed across his mind all of a sudden."
      },
      {
        "paragraph": "When Shaun met that boy for the first time, he thought that boy looked very similar to Catherine.\nHowever, he found out after that the boy seemed to be Joel’s nephew’s child."
      },
      {
        "paragraph": "Could it be that… the child was actually… Catherine’s?"
      },
      {
        "paragraph": "“That child… goes to the same preschool… as Suzie, right?” His throat struggled to say that sentence."
      }
    ]
  },
  {
    "title": "Chapter 1130 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine deliberately revealed an astonished expression. “How did you know?”"
      },
      {
        "paragraph": "Boom."
      },
      {
        "paragraph": "Shaun felt as if his mind had exploded, and his heart broke."
      },
      {
        "paragraph": "He thought the most agonizing thing was knowing that she got married to another man. Yet, it turned out\nthat she and Wesley had a child who was a little more than two years old."
      },
      {
        "paragraph": "“No, tell me this isn’t real. You’re lying to me.”"
      },
      {
        "paragraph": "Shaun rushed over like a madman. He grabbed Catherine’s shoulders and shook her vigorously. Tears of\nagony welled up in his eyes. “Even if you gave birth to that child, it must be our child, right? I know now.\nYou must’ve deceived me three years ago. In fact, our children weren’t gone, and that child is mine.”"
      },
      {
        "paragraph": "Catherine’s heart trembled at Shaun’s yell."
      },
      {
        "paragraph": "Seeing the man in front of her cry inexplicably tugged at her heartstrings."
      },
      {
        "paragraph": "After a long while, she forcefully sneered. “Did you forget that our children are gone because of you? Do\nyou still remember how much blood I lost that day?”"
      },
      {
        "paragraph": "Shaun was stunned."
      },
      {
        "paragraph": "His arms were trembling, but his body felt as if it was pinned in place."
      },
      {
        "paragraph": "That was right. What was he saying? His children were gone three years ago."
      },
      {
        "paragraph": "He lost the opportunity. He did not know how to treasure things back then. That was why she had a child\nwith another man."
      },

      {
        "paragraph": "Two streams of tears trickled from the corners of his eyes."
      },
      {
        "paragraph": "In this life, Shaun finally knew what it felt to be brokenhearted and devastated."
      },
      {
        "paragraph": "He had finally found a sliver of hope, only for her to crush it cruelly again."
      },
      {
        "paragraph": "Catherine witnessed the light in his eyes vanish. She slowly lowered her head as well."
      },
      {
        "paragraph": "‘Let it be, Shaun. Please don’t come and look for me anymore. Let’s not cross paths anymore.’"
      },
      {
        "paragraph": "She was afraid that if she kept getting involved in each other’s lives, she would fall into a situation where\neveryone would despise her."
      },
      {
        "paragraph": "The current her did not want to hurt Wesley. Therefore… She could only choose to hurt Shaun."
      },
      {
        "paragraph": "In the end, Shaun left."
      },
      {
        "paragraph": "He stumbled out of her office. He did not even say goodbye to her."
      },
      {
        "paragraph": "Catherine stood in front of the full-length windows and looked outside absent-mindedly."
      },
      {
        "paragraph": "Then, Harvey came in. “Chairwoman Jones, President Hill has left. He looked like a wreck when he was\nleaving…”"
      },
      {
        "paragraph": "Harvey was very curious as to what Director Jones did to torment Shaun into that state. It was as if\nShaun had lost part of his soul."
      },
      {
        "paragraph": "“Mm, I got it. You can continue with your work,” Catherine said dispiritedly."
      },
      {
        "paragraph": "Shaun drove straight to the entrance of the preschool."
      },
      {
        "paragraph": "It was lunch break, so the guard did not let him in."
      },
      {
        "paragraph": "He stood under the scorching sun until Hadley gave him a call. “President Hill, where are you? Didn’t you\nsay you’re going to visit the Chairman of Garson Corporation at 3:00 p.m.?”"
      },
      {
        "paragraph": "“Hadley, tell me. Three years ago, did you bribe the doctors in the hospital? Cathy did not miscarry at all,\nright?” Shaun’s absent voice rang out."
      }
    ]
  },
  {
    "title": "Chapter 1131 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "When Hadley heard Shaun’s words on the other"
      },
      {
        "paragraph": "side of the phone, it was as if a bomb went off in his brain."
      },
      {
        "paragraph": "After quite some time, he stammered, “Eldest Young Master, how… How did you find out?”"
      },
      {
        "paragraph": "Shaun, who was struggling in agony and sadness, went silent."
      },
      {
        "paragraph": "What did he just hear? Was he hallucinating?"
      },
      {
        "paragraph": "Was the meaning of Hadley’s words the same as what he thought it meant?"
      },
      {
        "paragraph": "Although Shaun had gone through many ups and downs before, he was still dumbfounded at that\nmoment, so much that he even forgot to talk."
      },
      {
        "paragraph": "However, he did not know that his silence made Hadley more flustered. “Eldest Young Master, I’m sorry. I\ndidn’t do it on purpose.”"
      },
      {
        "paragraph": "“So… Lucas is my child?” Shaun’s mind spun, and he quickly threw out a bomb."
      },
      {
        "paragraph": "Knowing that Eldest Young Master had even found out about Lucas made Hadley even more worried. All\nhe could do was apologize. “Eldest Young Master, I’m sorry. You can ask Miss Jones regarding this\nmatter. This is between the both of you. I’ve promised Miss Jones not to tell anyone.”"
      },
      {
        "paragraph": "From Hadley’s tone, Shaun was already 8o percent sure. He knew Hadley too well. If it were not the\ntruth, Hadley would deny it right away."
      },
      {
        "paragraph": "It seemed that the boy from the preschool who looked like Catherine was most probably his son."
      },
      {
        "paragraph": "Just now, he thought that boy was Wesley and Catherine’s child."
      },

      {
        "paragraph": "It made him such a wreck along the way. He was in such agony that he wanted to crash the car into\nsomething and die."
      },
      {
        "paragraph": "He did not expect Catherine to lie to him."
      },
      {
        "paragraph": "Hold on. He remembered Catherine was carrying twins back then, so there should be another child."
      },
      {
        "paragraph": "In a flash, Shaun suddenly thought of Suzie. At first, he thought Suzie was so attached to Catherine\nbecause Suzie had lost her mother and Catherine took special care of her."
      },
      {
        "paragraph": "However… What about Catherine?"
      },
      {
        "paragraph": "It seemed like she treated Suzie a little too well."
      },
      {
        "paragraph": "If it were before, Shaun would not suspect anything at all because he was sure that the twins were gone.\nHowever, thinking back now, both kids were at the same preschool, and they had a good relationship.\nOther than that, Liam had a hand in faking Catherine’s death back then. Perhaps Liam had known from\nthe start that Catherine’s children were still alive. Therefore, was Suzie Shaun’s daughter?"
      },
      {
        "paragraph": "When that thought popped up in his mind, Shaun felt as if his brain had exploded. He was so worked up\nthat his whole body was trembling."
      },
      {
        "paragraph": "“Hadley, who exactly is your boss?” Shaun gritted his teeth and warned coldly, “Let me ask you. Is Suzie\nmy daughter and not Liam’s?”"
      },
      {
        "paragraph": "Hadley did not know how to reply."
      },
      {
        "paragraph": "In fact, he was glum and stressed at the sudden leap in improvement in Eldest Young Master’s\nintelligence, which had been dense for three years."
      },
      {
        "paragraph": "Shaun sneered. “Even if you don’t say it, won’t I do a DNA test myself?”"
      },
      {
        "paragraph": "Hadley’s head hurt. He knew once a DNA test was done, he could no longer hide anything from Eldest\nYoung Master. Hence, he had no choice but to say, “ Eldest Young Master, Miss Jones did indeed give\nbirth to those children, but they are not related to you. You just contributed your sperm.”"
      },
      {
        "paragraph": "Ever since Hadley worked for Shaun, this was the one and only time he dared to retort and disrespect\nthe latter."
      },
      {
        "paragraph": "However, Shaun did not blame Hadley at all. His eyes even reddened emotionally."
      },
      {
        "paragraph": "He, Shaun Hill, really had children. It was a pair of fraternal twins too."
      }
    ]
  },
  {
    "title": "Chapter 1132 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Heaven knew how jealous Shaun was when he first heard Suzie was Liam’s daughter. Yet, he did not\nexpect that Suzie was his daughter."
      },
      {
        "paragraph": "No wonder he, who initially disliked kids, would think that Suzie was very adorable."
      },
      {
        "paragraph": "“Hadley, tell me. I want to know the truth,” Shaun said excitedly."
      },
      {
        "paragraph": "Hadley was taken aback. “If you don’t know the truth yet, how did you find out that the two children were\nstill alive?”"
      },
      {
        "paragraph": "“There’s no need for you to know that. ” Shaun’s trembling voice was short of patience. “Hadley, I’m\nbegging you.”"
      },
      {
        "paragraph": "For the first time, he, as a superior, was begging Hadley so sincerely. It gave Hadley a great shock."
      },
      {
        "paragraph": "“Young Master Hill, don’t say those words."
      },
      {
        "paragraph": "Actually, faking a miscarriage was Miss Jones’s suggestion. It was because back then, you insisted on\nhanding over the kids to Sarah to raise them once they were born. At that time, I didn’t believe Sarah\nwould treat the kids nicely at all. I was afraid the kids would end up as the second and the third you of\nyour younger self. That was why I agreed to Miss Jones’s request. However, I couldn’t do it alone."
      },
      {
        "paragraph": "That was why Second Young Master stepped in too.”"
      },
      {
        "paragraph": "Hadley sighed as he said, “Actually, the person you have to thank is Second Young Master. It was him\nwho sent Miss Jones overseas and hired the best doctors to save the children. You don’t know this, but\nthe children’s condition was very bad because Miss Jones was forced to consume a lot of antipsychotic\nmedications during that time. Miss Jones had to stay in the hospital for a few months after her arrival"
      },

      {
        "paragraph": "overseas. The children were born prematurely as well. They survived only after staying in the incubator\nfor two months.”"
      },
      {
        "paragraph": "As Shaun listened, his heart ached so much that he was about to suffocate."
      },
      {
        "paragraph": "It turned out that the sufferings that Catherine and the children went through were a lot more than he\nthought."
      },
      {
        "paragraph": "No wonder she hated him that much. He was a total sc*mbag."
      },
      {
        "paragraph": "He was the one who scolded Liam, but in fact, he could not even compare to Liam."
      },
      {
        "paragraph": "Hadley said, “ Eldest Young Master, to be honest, your actions at that time infuriated me as well."
      },
      {
        "paragraph": "Never mind if you want to be together with Sarah, but why did you have to hurt Miss Jones that way?\nYou even wanted to rob her of her child. That was too much.”"
      },
      {
        "paragraph": "Shaun felt even more ashamed."
      },
      {
        "paragraph": "Thinking back, he was so evil and crazy. It was as if he was possessed at that time."
      },
      {
        "paragraph": "If Catherine were in front of him, he would surely kneel and repent."
      },
      {
        "paragraph": "“Actually, I’ve known that Suzie is your daughter from the start. However, I didn’t tell you because I knew\nif I did, you’d surely use the child to threaten Miss Jones or even snatch the child away from her side.\nThat would be unfair toward her.”"
      },
      {
        "paragraph": "Hadley said regretfully, “Eldest Young Master, I sincerely hope you don’t snatch the children away from\nher. You don’t even have a clue about how many hardships Miss Jones went through for those two\nchildren. You didn’t even raise them. Your money was all spent on Sarah. Ever since Miss Jones was\npregnant, you have done nothing besides agitating Miss Jones and put her pregnancy at risk.”"
      },
      {
        "paragraph": "“Eldest Young Master, I know I’ve crossed the line with my words, but this is what I’ve been wanting t o\nsay for the past three years.”"
      },
      {
        "paragraph": "“Hadley, I don’t blame you.”"
      },
      {
        "paragraph": "Shaun spoke hoarsely, “On the contrary, I’m grateful for you. Thank you. Don’t worry. I won’t snatch the\nchildren away. I don’t have the right to do so. But in the future, I’ll take the rest of my life to compensate\nfor these two kids.”"
      },
      {
        "paragraph": "Hadley let out a huge breath of relief."
      },
      {
        "paragraph": "Then, Shaun suddenly said, “Drive over and pick me up. Let’s go visit Mr. Garson.”"
      },
      {
        "paragraph": "Hadley was taken aback. “I thought you won’t be in the mood to go…”"
      },
      {
        "paragraph": "“I’m indeed not in the mood to go, but… I know I’ve got more responsibilities on me now.” The corners of\nShaun’s mouth subconsciously lifted into a gentle smile. “I have two kids. I want to work hard for them.”"
      },
      {
        "paragraph": "He glanced at the preschool behind him."
      },
      {
        "paragraph": "When he arrived, he felt as if the sky was falling, but as he left, he saw hope for the future."
      }
    ]
  },
  {
    "title": "Chapter 1133 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "On the way to pick Shaun up, Hadley thought about it and decided to give Catherine a call. However, she\ndid not pick up. She might be in the middle of a meeting."
      },
      {
        "paragraph": "After that, he drove Shaun to Fortuna International Hotel, where the chairman of Garson Corporation\nwas staying. Hadley had contacted his assistant beforehand."
      },
      {
        "paragraph": "Upon entering the hotel, Shaun saw Charlie and his assistant walking out from the inside. Charlie’s\nexpression was unpleasant, but he let out a sarcastic laugh when he saw Shaun."
      },
      {
        "paragraph": "“You’re not here to visit Garson Corporation’s chairman too, right?”"
      },
      {
        "paragraph": "Charlie sized Shaun up and said disdainfully, “Even a nobody has the nerve to come. Why don’t you take\na mirror and look at your own identity?”"
      },
      {
        "paragraph": "Hadley walked up angrily, but Shaun stopped him. The latter’s tone was cold. “Charlie, I suggest you\nshould restrain yourself a bit. It’s not every time that you’ll get lucky and have someone do all the hard\nwork for you.”"
      },
      {
        "paragraph": "The look in Charlie’s gaze changed. He sneered. “ Shaun, you just got lucky last time. You’ll die by my\nhands one day.”"
      },
      {
        "paragraph": "Shaun did not react to his words. Instead, he looked at Charlie haughtily, as if he looked down at the\nlatter. “Charlie, I’ll settle all the debts between us soon.”"
      },
      {
        "paragraph": "“Ha, what fancy ideas. Do you think Hill Corporation can rise again by establishing a collaboration with\nGarson Corporation? In your dreams. Let me tell you. Garson Corporation’s chairman won’t meet you, so\nthere’s no need for you to go up and disturb him either.”"
      },

      {
        "paragraph": "Charlie gestured for the lobby manager to come over after he spoke."
      },
      {
        "paragraph": "“President Campos, is there anything I can help you with?” The manager immediately came over and\nasked in an attempt to please Charlie."
      },
      {
        "paragraph": "“This person wants to go to the presidential suite and disturb your VIP. You should keep a close eye on\nhim. Don’t let him sneak up, ” Charlie said with a smile."
      },
      {
        "paragraph": "Hadley said angrily, “We’ve already made an appointment.”"
      },
      {
        "paragraph": "“Appointment? With the likes of you?” Charlie laughed sarcastically. “Stop lying. Many of Australia’s\nwealthy families had come to visit this chairman, but they were all rejected. Who will believe you if you\nsay you have an appointment?”"
      },
      {
        "paragraph": "The manager immediately frowned upon hearing that. “Please don’t disturb our hotel’s VIP. Leave\nimmediately.”"
      },
      {
        "paragraph": "“Did you hear that? Shouldn’t you be leaving?” Charlie started to chase them away too. “Manager, I don’t\nthink they want to leave. It’s better to get the security guards to come over and chase them out.”"
      },
      {
        "paragraph": "Hadley was infuriated, and Shaun, who was initially in a good mood, was enraged as well. Dressed in a\ncrisp suit, Shaun excluded a cold aura as his gaze swept across like an X-ray. The manager inexplicably\nshivered."
      },
      {
        "paragraph": "At that moment, a middle – aged man came out of the elevator. When he saw Shaun and the rest, he\nsmiled and said, “President Hill, why haven’t you gone up? Our chairman is waiting for you.”"
      },
      {
        "paragraph": "Shaun was taken aback when he saw that man. “It’s you.”"
      },
      {
        "paragraph": "That man was the Rolls-Royce driver that he had bumped into when he was driving with Suzie in the"
      },
      {
        "paragraph": "car. It seemed like the man on the passenger seat was the mysterious chairman of Garson Corporation."
      },
      {
        "paragraph": "“Yes, it’s me.” The driver smiled as he glanced at Charlie and the rest."
      },
      {
        "paragraph": "Charlie recognized him too. This was the man who stopped him when he went up to visit just now. At the\nthought that Garson Corporation’s chairman was really going to meet Shaun, his face turned green.\n“Why did you say that Garson Corporation’s chairman was not here when I visited just now? Is your\nchairman not clear about who Shaun is? Hill Corporation is not what it used to be. They’re about to meet\ntheir end now. We, the Campos family, are currently the top corporation in Australia.”"
      },
      {
        "paragraph": "The driver glanced at him indifferently before he said with a smile, “President Campos, you’ve come so\nmany times already, and every time, our chairman has refused to meet you. Don’t you understand that\nsaying he’s not here is just an excuse to save your dignity?”"
      },
      {
        "paragraph": "“Some people really think too highly of themselves.” Shaun swept a glance across Charlie."
      },
      {
        "paragraph": "Charlie’s eyes were burning with rage. “Fine, tell your chairman that he’d better not regret this in the\nfuture.”"
      },
      {
        "paragraph": "After that, he left in long strides."
      },
      {
        "paragraph": "That manager was stuck in the middle with an awkward expression. “I’m sorry. I thought…”"
      },
      {
        "paragraph": "“Since you obey Charlie’s orders so well, you shouldn’t be a manager here. You should go and interview\nfor a job at Campos Corporation.” Hadley sneered. “I’ll report this to your superior.”"
      }
    ]
  },
  {
    "title": "Chapter 1134 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "After Hadley spoke, he went upstairs with Shaun."
      },
      {
        "paragraph": "When they reached the door to the presidential suite, the driver stopped Hadley. “Excuse me. Our\nchairman will only meet President Hill.”"
      },
      {
        "paragraph": "“Wait here.” After a hint of suspicion flashed across Shaun’s eyes, he strode in."
      },
      {
        "paragraph": "On the black leather sofa sat a buff man in a dark blue bathrobe. The man looked like he was in his\nforties. His features and outline were very masculine, but it was a shame that he had a scar on his face.\nThat scar made one side of his face look ferocious, while the other side of his face was handsome."
      },
      {
        "paragraph": "At that moment, there was a cigarette between the man’s fingers. His dark eyes looked toward Shaun\nthrough the smoke."
      },
      {
        "paragraph": "Seeing that person clearly for the first time, Shaun thought the man was strangely familiar, but he could\nnot remember."
      },
      {
        "paragraph": "“Have we met before?” Shaun asked tentatively."
      },
      {
        "paragraph": "That man chuckled. He extinguished the cigarette in the ashtray and spoke with a hoarse voice, “We\nhave. My last name is Lowe, Brennan Lowe. Do you still remember?”"
      },
      {
        "paragraph": "Brennan Lowe."
      },
      {
        "paragraph": "It was a name that Shaun had never heard in a long time."
      },
      {
        "paragraph": "It had been so long that he almost forgot about that person."
      },
      {
        "paragraph": "He forgot that he would not have been born into the world if it were not for that person."
      },

      {
        "paragraph": "During his younger days, he prayed for that man to come back. However, he waited and waited until he\nwas devastated. In the end, he could only pull through by relying on himself."
      },
      {
        "paragraph": "Shaun looked at the man in front of him. His expression was calm, but emotions brewed in his heart. A\nlong moment later, he said with great difficulty, “Why did you come back? I’ve long thought of you as\ndead.”"
      },
      {
        "paragraph": "Intense guilt flashed across Brennan’s hawk eyes. “ Shaun, I’m sorry…”"
      },
      {
        "paragraph": "“You don’t have to apologize. I don’t have a father. ” Shaun cut him off abruptly. His eyes were glaring\nferociously. “My dad already died when I was young.”"
      },
      {
        "paragraph": "He turned around and headed toward the door after he spoke."
      },
      {
        "paragraph": "He did not even want to spend another moment in the same space as the man."
      },
      {
        "paragraph": "Moreover, too many things had happened that day. All of a sudden, he had a son and a daughter. Even\nhis father, who had been missing for more than 20 years, was back."
      },
      {
        "paragraph": "He just wanted to cool down alone."
      },
      {
        "paragraph": "“Shaun, I had to leave back then. If I didn’t leave, you’d lose your life.”"
      },
      {
        "paragraph": "Brennan suddenly spoke sorrowfully behind Shaun."
      },
      {
        "paragraph": "Shaun halted. Then, he looked back and gazed at Brennan in confusion."
      },
      {
        "paragraph": "Brennan sighed before he walked to Shaun’s side and patted his shoulders. “That year, Mason\nthreatened me. If I didn’t disappear, he would’ve killed you. The sitter who took care of you was his\npeople.”"
      },
      {
        "paragraph": "Shaun was shocked. “Is the sitter you’re talking about Aunty Willa?”"
      },
      {
        "paragraph": "“Mm.” Brennan nodded.“ I did think of taking you away with me, but the Hill family was powerful, and I\nhad no power nor influence back then. How could I have the ability to go against the Hill family? In\naddition, I had an elderly mother. I wanted to bring your Granny overseas to settle down first, then think\nof a way to contact you later. However, when I arrived overseas, Mason’s men came after me.”"
      }
    ]
  },
  {
    "title": "Chapter 1135 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Shaun was astonished."
      },
      {
        "paragraph": "He did not expect Mason to have been plotting and scheming since more than 20 years ago. “Why must\nhe hunt you down? Didn’t my mom agree to be with him willingly?”"
      },
      {
        "paragraph": "“Because I disrupted his plans.”"
      },
      {
        "paragraph": "Brennan said complicatedly, “More than 30 years ago, Lea, Mason, and I were in the same school."
      },
      {
        "paragraph": "Your mom was the belle of the school back then. She was the goddess in every guys’ heart while I was\nonly a university student from a family with a middle-class income. I got to know your mom because we\nboth joined the student council."
      },
      {
        "paragraph": "However, Mason’s family’s financial situation was slightly better than mine. During a party, Mason spiked\nyour mom’s wine…”"
      },
      {
        "paragraph": "Shaun’s brows furrowed. “But mom always said that it was you who used despicable methods that\ntime…”"
      },
      {
        "paragraph": "“I never thought of taking advantage of your mother’s status at all, okay?”"
      },
      {
        "paragraph": "Brennan said coldly, “It was Mason’s scheme, but I accidentally drank that glass of wine, and Mason was\nheld up by someone else at that moment as well. After that, we had you, and the Hill family made me\nmarry into the family.”"
      },
      {
        "paragraph": "Shaun frowned."
      },
      {
        "paragraph": "He knew about the marriage that happened afterward."
      },

      {
        "paragraph": "Although Brennan’s family was not financially well- off at that time, he was the scholar of the college\nentrance examination that year. After enrolling in university, his results were the top of the class, and he\nwon many grand awards. Since his reputation was not bad, the Hill family agreed to their marriage."
      },
      {
        "paragraph": "“So you disrupted Mason’s plans?”"
      },
      {
        "paragraph": "“Mm.”"
      },
      {
        "paragraph": "Brennan nodded. “Mason was supposed to marry into the Hill family. However, it got disrupted because\nof me. He sincerely loved Lea at that time, so he hated me very much. And although Lea and I got into\nsome fights after we were married, we wouldn’t have divorced if it weren’t for Mason’s continuous\ninterventions. What I couldn’t tolerate the most was that Lea got pregnant with Mason’s child within a\nshort time.”"
      },
      {
        "paragraph": "“What happened when you were overseas?” Shaun continued asking."
      },
      {
        "paragraph": "At the mention of that, a bone -deep hatred flashed across Brennan’s eyes. “I got this scar from that time.\nHalf of my face was nearly destroyed, but what I resented the most was that your granny stopped those\npeople with her life to save me. In the end… she died.”"
      },
      {
        "paragraph": "After Brennan spoke, he lowered his head, lit a cigarette, and took a long drag on it."
      },
      {
        "paragraph": "Shaun clenched his fists in disbelief."
      },
      {
        "paragraph": "He could not remember Granny Lowe’s appearance from his younger days because he was at the Hill\nfamily most of the time. His only impression of her was that she was a loving grandmother."
      },
      {
        "paragraph": "Little did he know that she was killed by Mason."
      },
      {
        "paragraph": "It turned out that he already had a deep grudge with the Campos family a long time ago."
      },
      {
        "paragraph": "Brennan continued saying, “After that, in order to avoid Mason’s chase on me, I didn’t dare to use my\npassport. I lived like a beggar every day. I slept in an alley and ate other people’s rancid rice. Sometimes,\nI did illegal work for others, and I was even deprived of my salary. I was a top student, yet I lived a life of\npure misery.”"
      },
      {
        "paragraph": "Shaun’s throat gulped painfully."
      },
      {
        "paragraph": "He always thought Brennan had abandoned him and was living comfortably overseas."
      },
      {
        "paragraph": "“Did Mason take it that far back then?”"
      },
      {
        "paragraph": "“Yes. The most hateful thing was that Mason was too good at disguising himself. Almost the whole of\nAustralia took him as a soft-spoken gentleman, and that Lea and art were the love of his life.”"
      },
      {
        "paragraph": "Brennan laughed sarcastically. “In other people’s eyes, I’m just a shameless man who would do anything\nto take advantage of your mom. No matter how I explained it to Lea, she kept thinking that I was trying to\nprovoke and ruin her relationship with Mason. No one believed me.”"
      },
      {
        "paragraph": "“Dad, I’m sorry…”"
      }
    ]
  },
  {
    "title": "Chapter 1136 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Shaun’s lips moved. He no longer hated Brennan."
      },
      {
        "paragraph": "He had suffered a lot when he was young, but Brennan did not fare any better too."
      },
      {
        "paragraph": "“No. I’m the one who should be apologizing. I’m a man, yet I couldn’t even protect my own son.”"
      },
      {
        "paragraph": "Brennan shook his head. He was filled with remorse. “Luckily, after enduring it for four or five years, I\nsecretly sneaked into Country Y. I changed my name there and found a new identity. I came back before\nand wanted to meet you. However, after knowing that you went to a boarding school to study, I didn’t\nwant to disturb you. After that, I worked hard in Country Y, started a company, and established Garson\nCorporation. I heard you"
      },
      {
        "paragraph": "became the wealthiest man in Australia too. As your father, I wanted to expand my company further and\nlet us, father and son, reunite. But I didn’t expect to hear about Hill Corporation’s incident some time\nago.”"
      },
      {
        "paragraph": "“So… you were the one who bought the Hill family’s manor?” Shaun asked."
      },
      {
        "paragraph": "“Mm.” Brennan suddenly frowned and snorted. “If i t weren’t to help you, I wouldn’t have bought the Hill\nfamily’s manor at all.”"
      },
      {
        "paragraph": "Shaun got the message. It seemed that Brennan still hated Lea a lot."
      },
      {
        "paragraph": "However, it was understandable. If it were him, he would hate Lea as well."
      },
      {
        "paragraph": "“Dad, why didn’t you recognize me as your son earlier? I even hit your car at Sherman Mountain, ”\nShaun said as he laughed."
      },
      {
        "paragraph": "“I didn’t want to alarm anyone.”"
      },

      {
        "paragraph": "Brennan smiled and said, “Moreover, I know Hill Corporation has always wanted to collaborate with\nGarson Corporation. I’ve been waiting for you for a while now, and here you are after so many days.”"
      },
      {
        "paragraph": "Shaun felt embarrassed. His life was a mess during those days, and he lost his fighting spirit. He was in\nno mood to think about work at all."
      },
      {
        "paragraph": "“It must’ve never crossed Mason’s mind that you’re the chairman of Garson Corporation. Charlie even\nthought of visiting you just now.” Shaun smiled playfully."
      },
      {
        "paragraph": "“Now isn’t the time to let Mason know yet.” Brennan shook his head. “Although I may not be strong\nenough to go against the Campos family, they have already joined hands with Landell Group.”"
      },
      {
        "paragraph": "“I knew it.” Shaun sneered. “It was the Campos family who passed the microchip data to Landell Group.”"
      },
      {
        "paragraph": "“That’s not the most important thing. There are a group of secret killers behind the Campos family,”\nBrennan said with a deep gaze. “Otherwise, how do you think Mason could mobilize so many people to\nhunt me down overseas more than 20 years ago?”"
      },
      {
        "paragraph": "Shaun’s heart shuddered when he heard that."
      },
      {
        "paragraph": "“I’ve recently investigated all your matters, ” Brennan suddenly said. “That Wesley, he’s conspiring with\nthe Campos family.”"
      },
      {
        "paragraph": "“I’ve guessed as much.” Shaun frowned annoyedly. “I’m worried he’ll be the second Mason.”"
      },
      {
        "paragraph": "Brennan looked toward Shaun and smiled. He stretched his hand again and patted his shoulders. “ Don’t\nworry. I’ve warned him before. He won’t lay a hand on Catherine for the time being.”"
      },
      {
        "paragraph": "Brennan explained, “I brought some men and gave Wesley a warning before. Wesley doesn’t know\nabout my identity. He’s afraid I’ll take his life."
      },
      {
        "paragraph": "However, he has been going all-out on investigating my identity lately, so I reckon it can’t be hidden\nmuch longer. Shaun, you have to think of a way to deal with Catherine as soon as possible."
      },
      {
        "paragraph": "Make her divorce Wesley quickly.”"
      },
      {
        "paragraph": "A trace of awkwardness flashed across Shaun’s face. “I want to, but she trusts Wesley a lot.”"
      },
      {
        "paragraph": "“You mustn’tlet Wesley be together withher.”"
      },
      {
        "paragraph": "Brennan suddenly said with a solemn expression, “I suspect Wesley didn’t approach Catherine only\nbecause he loves her. He has another ulterior motive.”"
      },
      {
        "paragraph": "Shaun was confused. “What motive?”"
      },
      {
        "paragraph": "If Wesley wanted to take advantage of the Yule family in the past, Joel had already left Yule Corporation.\nWhat other value did Catherine still hold for Wesley?"
      }
    ]
  },

  {
    "title": "Chapter 1137 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Brenan returned to the sofa and sat down. He lit another cigarette."
      },
      {
        "paragraph": "Shaun looked toward him. Only when Shaun was getting impatient did Brennan speak again. “More than\n1o years ago, I met a woman when I was at Neah Bay. The true lady owner of Neah Bay. She and\nCatherine look very much alike.”"
      },
      {
        "paragraph": "Shaun was astonished. At that moment, it was as if he had found out a secret. “You’re suspecting that\nperson is Cathy’s family?”"
      },
      {
        "paragraph": "After a moment of silence, Shaun said, “I remember Cathy’s mother was swept away by a typhoon when\nshe went overseas. It was not long after Cathy was born.”"
      },
      {
        "paragraph": "“At first, I didn’t think too much of it either. That was until I came back and saw Catherine’s picture\nbecause of the matters between you and her…”"
      },
      {
        "paragraph": "Brennan took a long drag on the cigarette. “I can’t be wrong. More than 1o years ago, that woman was\njust 30 years old. She was as beautiful as a dangerous rose. She was so beautiful that I would never\nforget her in my life. Furthermore, she had a lot of legendary experiences too. She’s the owner of\nSoromon Island. She was the one who exploited the petroleum and iron mines of Soromon Island. After\nthat, she got married to Titus Costner of Neah Bay. Titus is the true owner of Neah Bay, who controls the\nsea lanes all around the world. Not only that but the banks of the Costner family are also scattered all\nover the world.”"
      },
      {
        "paragraph": "“Dad, I’ve heard of the Costner family before.” Shaun’s Adam’s apple bobbed."
      },
      {
        "paragraph": "He used to be Australia’s wealthiest man."
      },
      {
        "paragraph": "Therefore, he knew a lot more compared to ordinary people."
      },

      {
        "paragraph": "Although the name list of the world’s wealthiest people would be announced every year, it only touched\nthe surface. The mysterious families, who were the real richest people, always kept a low profile. No\nmedia would dare to report their names."
      },
      {
        "paragraph": "The Costner family was such an existence."
      },
      {
        "paragraph": "Even the prominent Hill family before was like an ant compared to the Costner family."
      },
      {
        "paragraph": "However, all he knew was just about the Costner family. It was his first time hearing the name Titus\nCostner."
      },
      {
        "paragraph": "“He’s the head of the Costner family.”"
      },
      {
        "paragraph": "Brennan said, “The marriage of those two was one between giants. However, after their marriage, they\nkept an even lower profile. Currently, everything in the Costner family is managed by their son, Matthew\nCostner.”"
      },
      {
        "paragraph": "Shaun did not know what to say. All he felt was a wave of helplessness."
      },
      {
        "paragraph": "Could Cathy’s mother have a powerful background?"
      },
      {
        "paragraph": "If she returned to her family, would it not be harder for him to woo her back?"
      },
      {
        "paragraph": "When he recalled himself mocking Catherine for taking advantage of his status, he was so ashamed that\nhe felt like his face was slapped swollen."
      },
      {
        "paragraph": "“Dad, so you suspect Wesley knows about Catherine’s mother’s identity?” Shaun suddenly asked."
      },
      {
        "paragraph": "“I tried him before. I never went into details, but his expression was very nervous as if I was spot on.”"
      },
      {
        "paragraph": "Brennan said calmly, “Anyway, this person is a peculiar one. Does he love Catherine that much? Does\nhe love her so much that he can accept her without any hard feelings even though you snatched his"
      },
      {
        "paragraph": "bride away on their wedding day? He’s not a saint.”"
      },
      {
        "paragraph": "“Exactly.”"
      },
      {
        "paragraph": "Shaun had the same thoughts. “Moreover, Catherine even gave birth to my children. It’s impossible that\nhe doesn’t know.”"
      },
      {
        "paragraph": "Furthermore, Wesley lost a kidney to save Cathy in the past. After that, Shaun used despicable methods\nto threaten Cathy, then she returned to his side again."
      },
      {
        "paragraph": "Although Cathy was unwilling at first, she was willing to be together with him afterward. Did Wesley not\nmind at all?"
      },
      {
        "paragraph": "Catherine trusted Wesley because he always seemed to treat her well. However, Shaun was a man, and\nhe did not trust Wesley."
      },
      {
        "paragraph": "“Dad, according to your words, this person is terrifying. He might have already found out about it a long\ntime ago.”"
      },
      {
        "paragraph": "Shaun said, “Should I tell Cathy about this?”"
      },
      {
        "paragraph": "Brennan shook his head. “Firstly, these are just my suspicions. There’s no evidence. Secondly, why\ndidn’t Catherine’s mother come back to look for her for the past 2o years? There are too many doubts.\nMoreover, do you think she’ll believe it?”"
      }
    ]
  },
  {
    "title": "Chapter 1138 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Shaun froze. That was true. If he told Catherine that her mother was not dead but was also the owner of\nSoromon Island and Neah Bay, had wealth equivalent to that of an entire nation, and was remarried and\nhad other children, Catherine would definitely think that he was a liar."
      },
      {
        "paragraph": "Brennan comforted him. “No matter what Wesley’s real purpose is, you can’t let him be with Catherine\nanymore. First, if what I said earlier is true, the moment he gets to the Costner family, you’ll be the first\nperson he gets rid of. Second, after he’s done with Catherine, do you think she’ll have a good end? Think\nof your mom.”"
      },
      {
        "paragraph": "“I’ve already thought about it.”"
      },
      {
        "paragraph": "Shaun clenched his fists tightly. “ I’ll definitely get Cathy back soon. I just want her to be safe and happy.\nDad, I forgot to tell you. I just found out today that Cathy gave me a pair of fraternal twins.”"
      },
      {
        "paragraph": "“Really?” Brennan was stunned, but he smiled. “ That’s good. Bring them over to meet me someday.”"
      },
      {
        "paragraph": "“There’s no problem with Suzie, but for my son… I don’t think he’ll acknowledge me now, but I’ll try m y\nbest.”"
      },
      {
        "paragraph": "Shaun smiled wryly. “Dad, do you… want to tell Mom about you?”"
      },
      {
        "paragraph": "Brennan’s expression changed slightly. After a long time, he said faintly, “There’s no harm in telling her,\nbut there’s no need to meet face to face. If I didn’t meet her back then, your grandmother wouldn’t have\ndied so early.”"
      },
      {
        "paragraph": "Shaun sighed helplessly."
      },

      {
        "paragraph": "Brennan said, “Keep my matter confidential for now. When you go out, declare to the public that our talk\ndidn’t work out. Secretly, Garson Corporation will use all its means to help Hill Corporation through this\ndifficult situation and rise to the top as soon as possible.”"
      },
      {
        "paragraph": "“Thank you, Dad.”"
      },
      {
        "paragraph": "Shaun finally realized what it meant to see the light at the end of the tunnel."
      },
      {
        "paragraph": "Although he also had confidence that he would be able to change his fortunes by himself, he would be\nable to rise up much faster with Brennan."
      },
      {
        "paragraph": "With that, he came out of the presidential booth. His cold handsome face made Hadley think that their\nnegotiation failed."
      },
      {
        "paragraph": "Soon, news of the failed discussion between Shaun Hill and the chairman of Garson Corporation spread\nthroughout the country."
      },
      {
        "paragraph": "In the underground parking lot, Charlie, who got a call from the waiter, was deeply relieved."
      },
      {
        "paragraph": "He thought Shaun had managed to get close to Garson Corporation, but he knew that it was impossible\nfor Garson Corporation to take a fancy to the current Hill Corporation."
      },
      {
        "paragraph": "In Hill Corporation."
      },
      {
        "paragraph": "Shaun immediately summoned several senior executives to hold an emergency meeting. Everyone was\nvery excited and happy when they learned that Hill Corporation could introduce Garson’s advanced\ntechnology in their business."
      },
      {
        "paragraph": "After all, as long as the sales of Hill Corporation’s products were temporarily stabilized, Hill Electronics\ncould still rise up again."
      },
      {
        "paragraph": "Once the meeting ended, Lea stayed behind and said with delight, “I didn’t expect Garson to agree so\nquickly. What method did you use to convince them?”"
      },
      {
        "paragraph": "Shaun’s complicated eyes fell on her face. Lea was confused. “What’s that look for?”"
      },
      {
        "paragraph": "“I’m looking at how bad your vision is. How did you pass off something fake as genuine?”"
      },
      {
        "paragraph": "Shaun stood up straight. “Garson Corporation’s chairman is Brennan Lowe.”"
      },
      {
        "paragraph": "The moment the words came out, Lea was stupefied."
      },
      {
        "paragraph": "“The mysterious person who bought Hill Manor was also him, ” Shaun continued."
      },
      {
        "paragraph": "Lea’s brain was in a mess, and she felt like her head had exploded."
      }
    ]
  },
  {
    "title": "Chapter 1139 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "The name Brennan Lowe had disappeared from Lea’s life for more than 20 years, but she had never\nforgotten him. He was her first husband and also Shaun’s biological father."
      },
      {
        "paragraph": "She even once hated Brennan for giving her Shaun. He was the one who messed up her life."
      },
      {
        "paragraph": "She thought he would never show up again."
      },
      {
        "paragraph": "Unexpectedly, the person she once looked down upon was now the chairman of a multinational group\nand saved her from being humiliated by Mason Campos at the auction."
      },
      {
        "paragraph": "“ Is… Is he well?” She murmured after a long time."
      },
      {
        "paragraph": "“Well, thanks to you, he lived like a dog in the earlier parts of his life.”"
      },
      {
        "paragraph": "Shaun told Lea everything about Mason trying to assassinate Brennan."
      },
      {
        "paragraph": "Lea was dumbfounded. “How… How could this be?”"
      },
      {
        "paragraph": "Shaun frowned. “Does he need to lie about this? One side of his face is scarred. Mom, he never drugged\nyou. It was Mason who tried to drug you, and Brennan accidentally drank that glass of wine. You’ve\nmisunderstood him all along.”"
      },
      {
        "paragraph": "When he finished, he saw Lea’s confused and beautiful face and could not help but sigh."
      },
      {
        "paragraph": "He was too similar to Lea as he also did the same stupid things as her. Hence, he knew what Lea was\nthinking."
      },
      {
        "paragraph": "“Don’t tell anyone about this for now, and don’t try to look for him. We don’t want to inadvertently"
      },
      {
        "paragraph": "alert the enemy.”"
      },

      {
        "paragraph": "Shaun finished and strode away with his long legs. Lea stood where she was, frozen."
      },
      {
        "paragraph": "She remembered when she first met Brennan, he was standing in the meeting room of the student union\nin a white shirt, which made people easily think he was a gentleman. He was the most handsome man\nshe had ever seen, but he rarely spoke. He was like a cold block of ice and very different from Mason,\nwho was always around her."
      },
      {
        "paragraph": "At that time, Mason was very talented and cared for her very much."
      },
      {
        "paragraph": "Compared to Brennan’s coldness, she naturally preferred Mason’s warmth."
      },
      {
        "paragraph": "However, at a party, an accident happened where Brennan and she ended up sleeping together. At that\ntime, Brennan’s family was not well off, so she thought that he wanted to use her to climb up the social\nladder. She often looked down on him and slandered and humiliated him."
      },
      {
        "paragraph": "Brennan explained that he did not do it on purpose, but she did not believe him at all."
      },
      {
        "paragraph": "When she got pregnant, the Hill family made her marry Brennan."
      },
      {
        "paragraph": "After the marriage, she often had morning sickness and a bad temper, but a cold person like Brennan\nactually cooked for her every day. No matter how she scolded him, he never said a word."
      },
      {
        "paragraph": "When she was cold, he gave her clothes."
      },
      {
        "paragraph": "When she was uncomfortable, he carried her to the hospital."
      },
      {
        "paragraph": "When her back ached from the pregnancy, he massaged her."
      },
      {
        "paragraph": "Later, she gradually got used to it."
      },
      {
        "paragraph": "However, she met Mason again at an exhibition."
      },
      {
        "paragraph": "Mason Campos, who used to be full of mettle and high-spirited, seemed to have become a different\nperson because she got married. He became wan and sallow."
      },
      {
        "paragraph": "She felt ashamed to face Mason, but after that time, Brennan no longer cared about her."
      },
      {
        "paragraph": "Endless cold war and quarrels began between Brennan and her."
      },
      {
        "paragraph": "Whenever she was in a bad mood, Mason would appear."
      },
      {
        "paragraph": "It was not long after Shaun was born that she got divorced, and she only married Mason because she\ngot pregnant with Liam."
      },
      {
        "paragraph": "Then, every time Brennan was in her sights, he was completely drunk, which she found disgusting and\nhateful."
      },
      {
        "paragraph": "After she married Mason, Brennan left. He never came back."
      },
      {
        "paragraph": "Thinking about it now, Mason only approached her back then because he had ulterior motives. If she had\nnot been soft-hearted for Mason, maybe she would have been able to be with Brennan for the rest of\ntheir lives."
      },
      {
        "paragraph": "However, she never expected Brennan to have suffered so much abroad because of her."
      },
      {
        "paragraph": "Although his family was not well off, he was the top student. If he had not met her, he would not have\nsuffered so much."
      },
      {
        "paragraph": "For the first time, Lea felt guilty toward this man."
      }
    ]
  },
  {
    "title": "Chapter 1140 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "However, Lea knew that she had no right to be with him anymore."
      },
      {
        "paragraph": "Hudson Corporation."
      },
      {
        "paragraph": "After Catherine finished her work, she suddenly remembered that she got a missed call from Hadley at\nthe end of the meeting. She was so busy at the time that she had forgotten to call back."
      },
      {
        "paragraph": "She immediately gave him a call. “Hadley, did something happen?”"
      },
      {
        "paragraph": "“…Yeah, something big.”"
      },
      {
        "paragraph": "Hadley secretly glanced at Shaun’s departing figure. President Hill’s strides were now lively and brisk,\nand he was in an extremely good mood."
      },
      {
        "paragraph": "Catherine had a bad feeling about it. Shaun was staggering when he left this afternoon. Did he take the\nnews too hard? “Hurry up and tell me.”"
      },
      {
        "paragraph": "“Eldest Young Master already knows that Lucas and Suzie are his children.”"
      },
      {
        "paragraph": "Hadley explained guiltily, “I don’t know how he found out, but he suddenly called me to ask me if I bribed\nthe doctor back then and if you actually didn’t have a miscarriage. He seemed to have realized\nsomething, so I had no choice but to confess.”"
      },
      {
        "paragraph": "That was why she lied and said that the children were Wesley and her’s. How was the lie exposed so\nquickly? It had only been a few hours."
      },
      {
        "paragraph": "Catherine almost spat out blood. “What time did he ask you in the afternoon?”"
      },
      {
        "paragraph": "“Around 2 p.m.”"
      },

      {
        "paragraph": "That meant it was not long after he left here."
      },
      {
        "paragraph": "How did he find out that Lucas was his child so quickly?"
      },
      {
        "paragraph": "Catherine’s beautiful face darkened. “He didn’t know at all. Yes, he knows of Lucas’s existence, but he\nthinks the child belongs to Wesley and me. He probably just said that to you because he couldn’t accept\nthat fact, but you… you accidentally told him the truth.”"
      },
      {
        "paragraph": "“Is that it?” Hadley was dumbfounded and helpless. That meant he was tricked?"
      },
      {
        "paragraph": "“Absolutely.” Catherine also felt helpless."
      },
      {
        "paragraph": "At first, she thought she could get him to give up completely if he knew that she had a child with Wesley,\nbut now, Shaun had discovered both children. It would be harder to extricate herself from him now."
      },
      {
        "paragraph": "She had a feeling that this time, Shaun would stick onto her harder than a leech."
      },
      {
        "paragraph": "“ I’m sorry, Ms. Jones.” Hadley wanted to slap his mouth. “But Eldest Young Master said that he won’t\ntake the children from you.”"
      },
      {
        "paragraph": "“Yes, he won’t take the children from me. He’ll take me along with the children. ” Catherine said\nfrustratingly."
      },
      {
        "paragraph": "Hadley was speechless. “Where is Shaun going now?”"
      },
      {
        "paragraph": "“He just left after the meeting. I’m guessing he’s going to kindergarten,” Hadley said softly."
      },
      {
        "paragraph": "“Alright. I have to go too.”"
      },
      {
        "paragraph": "Catherine was not in the mood to continue the conversation."
      },
      {
        "paragraph": "After hanging up the phone, she quickly drove to the kindergarten."
      },
      {
        "paragraph": "Shaun arrived a little earlier than her."
      },
      {
        "paragraph": "At 4:30 p.m., some parents were already starting to pick up their children."
      },
      {
        "paragraph": "Shaun’s handsome figure stood out among the group of grandmothers and mothers, making him\nparticularly conspicuous."
      },
      {
        "paragraph": "The security guard at the door knew him and immediately had the kindergarten teacher come out with\nSuzie."
      },
      {
        "paragraph": "“Uncle, you’re so early today.” Suzie skipped up to him."
      },
      {
        "paragraph": "Shaun stared at her with an excited and complicated look in his eyes."
      },
      {
        "paragraph": "It was fine since he did not know it before, but now that he knew she was his daughter, his heart began\nto race."
      }
    ]
  },

  {
    "title": "Chapter 1141 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "God really did treat Shaun well."
      },
      {
        "paragraph": "Despite having done so many cruel things, God still left him a pair of lovely children."
      },
      {
        "paragraph": "The more he thought about it, the more teary—eyed he became."
      },
      {
        "paragraph": "“Uncle, what’s wrong with you?” Suzie felt creeped out by his look."
      },
      {
        "paragraph": "Shaun squatted down and flicked her forehead gently. Then, he said softly, “Crafty little imp.”"
      },
      {
        "paragraph": "Suzie touched her forehead innocently. “Uncle, what are you talking about? I’m not crafty. I’m an angel.”"
      },
      {
        "paragraph": "Shaun chuckled in a low voice and smiled deeply. His eyes were twinkling as if there were stars in them."
      },
      {
        "paragraph": "It was Suzie’s first time seeing such a bright smile on his handsome face, and she was stunned."
      },
      {
        "paragraph": "Shaun reached out again to pinch her chubby little face. “You’ve known all along that… I’m your dad?”"
      },
      {
        "paragraph": "Thinking about it now, the little girl told all sorts of lies."
      },
      {
        "paragraph": "Although she usually called Catherine by her name, it was impossible that she did not know Catherine\nwas her mother."
      },
      {
        "paragraph": "However, she always hid it from him and called him Uncle."
      },
      {
        "paragraph": "What was she but not crafty?"
      },
      {
        "paragraph": "Stunned, Suzie’s round, dark eyes widened. She was always smart and clever, but now she was\ncompletely dumbfounded."
      },

      {
        "paragraph": "She did not understand how her scummy dad had found out about this shocking secret."
      },
      {
        "paragraph": "“Your mommy told me.” Shaun looked at her appearance and started to lie again."
      },
      {
        "paragraph": "“Mommy is so bad… ” Suzie stomped her feet. “She didn’t tell me in advance.”"
      },
      {
        "paragraph": "Deep down, Shaun sighed. Thinking of all the pitiful things that this little girl had told him about her\nmother, she could debut as a drama queen."
      },
      {
        "paragraph": "However, it was good that his daughter had this trait. A crafty girl would not be bullied by others. Only\nshe would bully others."
      },
      {
        "paragraph": "“Tell me, if you knew that I’m your dad, why didn’t you acknowledge me?”"
      },
      {
        "paragraph": "Shaun looked at her, a little hurt. “You’d rather call Liam your father but refuse to call me that.”"
      },
      {
        "paragraph": "Suzie rolled her eyes at him without hesitation.“ Please, scummy dad, think of all the scummy things\nyou’ve done. If not for the fact that Grandma noticed me when I was in the hospital for a head injury, I\nwouldn’t have thought about going to the Hill family at all.”"
      },
      {
        "paragraph": "Shaun’s handsome face changed. He recalled that her head was indeed injured when he first met her. “\nDidn’t you hurt your head from an accidental fall?”"
      },
      {
        "paragraph": "“No, someone broke into Mommy’s home. When I was hiding in the box, those people hit the box with a\nsteel rod and made my head bleed.”"
      },
      {
        "paragraph": "Suzie glared at him hatefully. “Mommy said that the person behind it was Thomas Neeson. I really hated\nyou back then. You have bad eyes.”"
      },
      {
        "paragraph": "The more Shaun listened, the more shocked and ashamed he became."
      },
      {
        "paragraph": "He knew that Thomas broke in and destroyed Catherine’s home. That morning, Catherine drove into the\nseaside villa angrily and flew off the"
      },
      {
        "paragraph": "handle, wanting to teach Sarah a lesson. However, he protected Sarah."
      },
      {
        "paragraph": "It turned out that Thomas had destroyed Catherine’s home and injured Suzie’s head."
      },
      {
        "paragraph": "As a father, not only did he fail to protect his child, but he also took sides with the perpetrator."
      },
      {
        "paragraph": "Shaun’s face burned with embarrassment."
      },
      {
        "paragraph": "“Suzie, I’m sorry. It’s Daddy’s fault.” Shaun grabbed her little hand and hit his face."
      },
      {
        "paragraph": "Suzie scoffed. “You still treated that Sarah woman like a treasure and wanted to marry her. I’ve\ncompletely given up on you as a father.”"
      },
      {
        "paragraph": "“So… Lucas has also given up on me?” Shaun said dejectedly."
      },
      {
        "paragraph": "Suzie suddenly panicked. “Oh, you even know who Lucas is.”"
      },
      {
        "paragraph": "“Yes. Suzie, it’s fine if you don’t acknowledge me, but you can’t stop me from atoning my sins,”"
      },
      {
        "paragraph": "Shaun said gently. “Give me a chance. I’ll be a good father.”"
      },
      {
        "paragraph": "Suzie pursed her lips. “I can’t help it since I live with you every day, but Lucas won’t like you. He hates\nyou very much.”"
      }
    ]
  },
  {
    "title": "Chapter 1142 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Hate…"
      },
      {
        "paragraph": "The word stung Shaun’s heart."
      },
      {
        "paragraph": "So, Lucas already knew that he was his father."
      },
      {
        "paragraph": "At that moment, he saw an unfamiliar man holding Lucas’s hand walk out of the kindergarten."
      },
      {
        "paragraph": "He assumed that the man was Sheldon Yule, Joel’s nephew. The last time he investigated, Sheldon was\nregistered as Lucas’s father in the kindergarten."
      },
      {
        "paragraph": "“Lucas… ” Shaun carried Suzie and quickly walked over."
      },
      {
        "paragraph": "Lucas looked at him indifferently before tightening his grip on Sheldon and sped up his pace."
      },
      {
        "paragraph": "“Lucas, I need to talk to you.” Shaun approached, but Sheldon immediately stopped him."
      },
      {
        "paragraph": "“Mr. Hill, please don’t harass my son.” Sheldon glared at him defensively."
      },
      {
        "paragraph": "“He’s my son. ” Shaun sized up Lucas’s little face seriously. He looked similar. He really looked very\nsimilar to Catherine."
      },
      {
        "paragraph": "Among the two children, Suzie looked like him but her temper was like Cathy. Meanwhile, Lucas looked\nlike Cathy, but his temper probably took after him."
      },
      {
        "paragraph": "Sheldon frowned, and Lucas suddenly looked up and said coldly, “I have nothing to do with you, and I\ndon’t know you at all.”"
      },
      {
        "paragraph": "Then, he pulled Sheldon along and left."
      },

      {
        "paragraph": "Shaun felt bitter, but he stubbornly chased after them. “Lucas, it’s normal for you to hate me, but as\nfather and son, we should sit down and talk. Don’t you have anything to say to me?”"
      },
      {
        "paragraph": "“I have nothing to say to a stranger.” Lucas’s delicate brows were knitted tightly, and his tone was very\nfirm."
      },
      {
        "paragraph": "“I’m not a stranger. I’m your biological father. You have the same blood as me. That’s a fact that cannot\nbe changed.”"
      },
      {
        "paragraph": "Shaun stubbornly stopped him."
      },
      {
        "paragraph": "Their dispute caused several parents, who were there to pick up their kids, to look over."
      },
      {
        "paragraph": "“Mommy…” Suzie suddenly called."
      },
      {
        "paragraph": "Shaun and Lucas turned around to see Catherine rushing out of a car. She wore a black dress with her\nwavy hair draped over her shoulder. She looked beautiful yet aloof."
      },
      {
        "paragraph": "Lucas’s eyes also softened slightly."
      },
      {
        "paragraph": "“Catherine, you’re here just in time.” Sheldon looked at Shaun awkwardly. “He said that he’s Lucas’s\nfather…”"
      },
      {
        "paragraph": "“Sheldon, thank you for all you’ve done these days. You can head back first. Leave Lucas to me.”\nCatherine gave her thanks and picked up Lucas familiarly."
      },
      {
        "paragraph": "“Alright. I’ll head off first.” Sheldon waved and left."
      },
      {
        "paragraph": "Catherine then looked at Shaun, who was holding Suzie."
      },
      {
        "paragraph": "This scene made the parents at the side wonder."
      },
      {
        "paragraph": "A beautiful woman carrying a son who looked like her, and a handsome man carrying a daughter who\nlooked like him — it was clear that they were their biological children."
      },
      {
        "paragraph": "“What’s going on?”"
      },
      {
        "paragraph": "“I heard that boy is that man’s son?”"
      },
      {
        "paragraph": "The people began to point at them and gossip."
      },
      {
        "paragraph": "Catherine glared at Shaun. “Let’s leave here first.” She carried Lucas and swiftly got into her car."
      },
      {
        "paragraph": "Shaun also carried Suzie and quickly got into the backseat."
      },
      {
        "paragraph": "Catherine gritted her teeth. “Shaun, didn’t you drive?”"
      },
      {
        "paragraph": "“I did, but I want to spend more time with my son and daughter.” Shaun smiled happily."
      },
      {
        "paragraph": "He never thought he would be able to sit in a car with his favorite woman and children. It was a great\nfeeling."
      }
    ]
  },
  {
    "title": "Chapter 1143 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine looked through the rearview mirror. When she saw Shaun’s smug look, she wanted so badly to\ntake off her shoes to smack him twice."
      },
      {
        "paragraph": "He must be very pleased to know that he was the father of her two children."
      },
      {
        "paragraph": "Lucas saw this and narrowed his eyes, which was cold. “If I were you, I wouldn’t have the guts to appear\nin front of us.”"
      },
      {
        "paragraph": "It was the first time his son said such a long sentence to him, and Shaun’s handsome face froze."
      },
      {
        "paragraph": "Lucas continued to speak indifferently, “What right do you have for me to accept you as my father? You\nthink we’re your children just because according to medical theory, you donated two sperm. That’s too\nunfair. What have you done for us?”"
      },
      {
        "paragraph": "Shaun’s delicate and handsome face turned pale from the words."
      },
      {
        "paragraph": "Catherine wanted to applaud her son’s beautifully spoken words. It was as expected of her son. He said\nwhat was on her mind."
      },
      {
        "paragraph": "“I’ve never done anything before, but I will from now on. ” Shaun’s face was exasperated. “Lucas, I was\nhypnotized by someone. Otherwise, I wouldn’t have done that to your mommy. I believe I would’ve\nlooked forward to your arrival if I was normal.”"
      },
      {
        "paragraph": "“Ha.”"
      },
      {
        "paragraph": "Lucas mocked mercilessly. “You’re a man in your thirties yet you got hypnotized by someone. I would be\nso embarrassed to say it if I were you.”"
      },
      {
        "paragraph": "Shaun choked once again."
      },

      {
        "paragraph": "Lucas said, “I don’t even know how you became the country’s richest man. It’s no wonder that position\ndidn’t last.”"
      },
      {
        "paragraph": "Shaun was speechless."
      },
      {
        "paragraph": "His son was really as sharp-tongued as him."
      },
      {
        "paragraph": "Forget it. Lucas was his son. No matter how sharp – tongued he was, Shaun still loved and doted on\nhim."
      },
      {
        "paragraph": "“You’re right.” Shaun nodded and said with a look o f admiration. “Cathy, as expected of your son. He hit\nthe nail on the head. If I had half his brains, I wouldn’t have ended up separated from my wife.”"
      },
      {
        "paragraph": "Catherine was at a loss for words."
      },
      {
        "paragraph": "Lucas did not know what to say either."
      },
      {
        "paragraph": "In order to get back his wife and children, he really did not care about his image anymore."
      },
      {
        "paragraph": "Suzie looked at Shaun blankly and finally burst out laughing. “Scummy dad, why are you so cute?”"
      },
      {
        "paragraph": "Shaun was stunned. If it were in the past, he would destroy anyone who called a man like him cute."
      },
      {
        "paragraph": "However, since she was his daughter, he could only smile and said, “Suzie, Daddy can be cuter as long\nas you give me the chance to atone.”"
      },
      {
        "paragraph": "Now, Suzie was speechless. He was trying too hard to get the chance to atone."
      },
      {
        "paragraph": "Catherine sighed."
      },
      {
        "paragraph": "Shaun immediately said, “Cathy, where are you going? Why don’t we look for a restaurant to eat at? I\nknow a children’s restaurant with a playground and a variety of delicious steaks, cakes, and snacks.”"
      },
      {
        "paragraph": "“Yes, yes.” The glutton Suzie nodded rapidly. “Childish.” Lucas snorted."
      },
      {
        "paragraph": "Suzie harrumphed. “I’m a kid, so I have the right to be childish.”"
      },
      {
        "paragraph": "Lucas frowned. “Suzie, are you being fair to Uncle Wesley? He’s been so good to you since we were\nyoung.”"
      },
      {
        "paragraph": "Suzie’s eyes flashed with guilt, but she still pouted. “Since you like Uncle Wesley so much, why didn’t\nyou go with Mommy? Yet, you’re still living with Grandpa.”"
      },
      {
        "paragraph": "Lucas glared at her frustratingly."
      },
      {
        "paragraph": "Shaun stroked Suzie’s little head in praise and decided he would buy her candy as a reward later. “You\nhave to understand that Uncle Wesley treats you well because he wants to win your mommy’s heart. He\nneeds to please you first because he wants your mommy to like him.”"
      },
      {
        "paragraph": "“Shaun…” Catherine warned a certain man to watch his words."
      }
    ]
  },
  {
    "title": "Chapter 1144 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Did I say something wrong?” Shaun shrugged innocently. “Cathy, men are not saints. He is kind to the\nchildren only because he wants to please you. He knows that if he’s not good to the children, you won’t\neven consider him.”"
      },
      {
        "paragraph": "“That’s still much better than you.” Lucas retorted. “When we were still in Mommy’s tummy, you wanted\nto give us to another woman to raise, and you wanted us to be separated from Mommy."
      },
      {
        "paragraph": "You’re a vicious person.”"
      },
      {
        "paragraph": "Shaun was suddenly embarrassed. He did not expect Catherine to tell the kids about those things."
      },
      {
        "paragraph": "Suzie said loudly, “We don’t want a vicious stepmother. We just want Mommy.”"
      },
      {
        "paragraph": "“There’s no vicious stepmother anymore. Your mommy is the only one in my heart now.”"
      },
      {
        "paragraph": "Shaun said seriously, “I’ll love her till I die.”"
      },
      {
        "paragraph": "Lucas’s aloof little face suddenly made a gagging expression. “Ew, gross. How fake.”"
      },
      {
        "paragraph": "Shaun was dealt a blow once again."
      },
      {
        "paragraph": "Catherine looked at his ashen expression and wanted to laugh."
      },
      {
        "paragraph": "In the end, she drove the car to the children’s restaurant Shaun mentioned."
      },
      {
        "paragraph": "Shaun wanted to please his children. Since he knew Suzie’s tastes but had no idea when it came to\nLucas, he simply ordered all of the children’s favorites in the restaurant."
      },
      {
        "paragraph": "“That’s enough. Don’t order too much. It’s a waste.” Catherine stopped him."
      },

      {
        "paragraph": "Before Shaun could speak, Suzie interjected. “It’s not a waste. Mommy, just let scummy dad spend\nmoney. He should be spending money on us anyway.”"
      },
      {
        "paragraph": "Catherine poked her head. “Don’t think I don’t know that you like eating. Your teeth will rot if you eat so\nmuch.”"
      },
      {
        "paragraph": "“Don’t accuse me. Godmother always says that if you don’t spend a man’s money, he’ll spend it on other\nwomen.” Suzie puffed out her small chest and said confidently."
      },
      {
        "paragraph": "Catherine rubbed her forehead. That damn Freya always taught Suzie nonsense like this."
      },
      {
        "paragraph": "Shaun looked at the mother and children with gentle eyes."
      },
      {
        "paragraph": "He wanted to protect the woman and children for the rest of his life."
      },
      {
        "paragraph": "Once the food was served, Suzie tied her bib and began to dig in messily."
      },
      {
        "paragraph": "Lucas sat up with his small body, holding a knife and fork. He looked like a little gentleman."
      },
      {
        "paragraph": "Shaun was very pleased and kept clipping food for the children."
      },
      {
        "paragraph": "However, Lucas swept away the food every time and refused to eat, giving him the cold treatment."
      },
      {
        "paragraph": "Shaun said softly, “Lucas, it’s natural for you to hate me, but I won’t give up. Don’t worry. I won’t take you\naway from your mom. I just want to do my duty as a father.”"
      },
      {
        "paragraph": "Lucas continued to eat as if he did not hear Shaun."
      },
      {
        "paragraph": "Nevertheless, Shaun did not give up. “You’re a boy. There are many things that your mommy can’t do\nwith you. I can teach you to play basketball…”"
      },
      {
        "paragraph": "“Uncle Wesley can do that too.” Lucas interrupted him."
      },
      {
        "paragraph": "Shaun smiled. “He’s not as good as me. The national basketball team once invited me to join their team,\nbut I wasn’t interested.”"
      },
      {
        "paragraph": "“You’re just boasting,” Lucas said bluntly."
      },
      {
        "paragraph": "“I’m not. You can watch me try after we eat. If I lose, I’ll call you dad in the future.” Shaun raised his\nhandsome brows with a proud face."
      },
      {
        "paragraph": "Lucas kept quiet for a while."
      },
      {
        "paragraph": "Catherine looked at them quietly. Since Shaun had found out about the children, she knew would not be\nable to get rid of that leech. Hence, all she could do now was take it one step at a time."
      },
      {
        "paragraph": "Shaun then said, “I can also teach you martial arts."
      }
    ]
  },
  {
    "title": "Chapter 1145 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“My mom can too, and so can Uncle Logan.” Lucas suddenly said angrily, “Oh, right. You chopped off\nUncle Logan’s finger.”"
      },
      {
        "paragraph": "Shaun immediately regretted that he had brought up martial arts. However, he knew that there were\nsome things he could not avoid. “You’re right. I’ll chop off one of my fingers to pay him back later.”"
      },
      {
        "paragraph": "Lucas frowned. “Stop lying.”"
      },
      {
        "paragraph": "“I could cut it now if I wasn’t afraid of scaring the people in the restaurant.”"
      },
      {
        "paragraph": "Shaun said without hesitation, “Logan’s martial art isn’t as skillful as mine. Even your mom is no match\nfor me either. If you don’t believe me, ask your mom.”"
      },
      {
        "paragraph": "The father and son turned their attention to Catherine, who had not spoken."
      },
      {
        "paragraph": "Catherine glared at Shaun. She had practiced martial arts for three years, yet he said that she was no\nmatch for him. Was he trying to shame her?"
      },
      {
        "paragraph": "Those beautiful eyes made Shaun’s mind wander slightly. “But there’s an aspect I’m no match for your\nmom.”"
      },
      {
        "paragraph": "“What is it?” Lucas could not help but ask. Shaun coughed into his fist, his eyes ambiguous."
      },
      {
        "paragraph": "Only then did Catherine understand, and her face heated up. She could not resist stepping on Shaun’s\nfoot fiercely under the table."
      },
      {
        "paragraph": "How dare he act immodestly in front of the children."
      },
      {
        "paragraph": "It clearly hurt, but Shaun’s thin lips curled up sweetly. “That’s a secret between your mommy and me.”"
      },

      {
        "paragraph": "Lucas looked at his flushed-faced mother and was confused."
      },
      {
        "paragraph": "In his memory, he had seldom seen his mommy like that. She looked pretty like a rose with the morning\ndew."
      },
      {
        "paragraph": "She was never like this when she was with Uncle Wesley either."
      },
      {
        "paragraph": "Lucas frowned as he was lost in thought."
      },
      {
        "paragraph": "Shaun continued, “Also, I can teach you how to swim.”"
      },
      {
        "paragraph": "“I know how to swim too,” Lucas said disdainfully."
      },
      {
        "paragraph": "“Then, do you know freestyle, butterfly stroke, breaststroke, or the backstroke?” Shaun raised his brows.\nTo him, those things were just child’s play. He did not expect that one day, he would be reduced to using\nthese means to please his child. “I know all of them.”"
      },
      {
        "paragraph": "Lucas pursed his lips in annoyance. He only knew the breaststroke. “Liar. How can one person know so\nmuch?”"
      },
      {
        "paragraph": "“It’s because I’m athletic.” Shaun held his glass of water proudly."
      },
      {
        "paragraph": "“It’s no wonder you’re so simple -minded, ” Lucas muttered."
      },
      {
        "paragraph": "“Ahem.” Shaun choked on the water. Catherine could not help but laugh."
      },
      {
        "paragraph": "“Also, I know the law,” Shaun added. “You shouldn’t underestimate law. This is a law-based society, so if\nwe understand the law, we can deal with people who hurt you without using our fists.”"
      },
      {
        "paragraph": "Lucas said faintly, “Really? If I learned about the law, the first person I would want to deal with is you.”"
      },
      {
        "paragraph": "“But I’m the world’s top lawyer. Ordinary lawyers can’t be used to deal with me.” Shaun smiled"
      },
      {
        "paragraph": "faintly. “But if such a day comes, I can only congratulate you for outperforming the teacher. I’d be\npleased.”"
      },
      {
        "paragraph": "“What else do you know?” Lucas asked."
      },
      {
        "paragraph": "Shaun put down his class and said seriously, “When you go to school in the future, I can teach you math,\nchemistry, physics, biology. I know everything.”"
      },
      {
        "paragraph": "“The teacher can teach me, and my mom can too,” Lucas argued."
      },
      {
        "paragraph": "“The teacher will only teach you the basics, and the teacher doesn’t know as much as me. As for your\nmom…” Shaun looked at Catherine and laughed. “Ms. Jones, do you know what the chemical\ncomposition of water is?”"
      },
      {
        "paragraph": "Catherine was speechless."
      },
      {
        "paragraph": "Who would know such an obscure topic?"
      },
      {
        "paragraph": "Shaun smiled and said to Lucas, “See? That’s the most simple and basic knowledge of chemistry, yet\nyour mom doesn’t remember. In terms of learning, what do you think she can teach you?”"
      },
      {
        "paragraph": "Lucas looked at his mother with a hint of disdain."
      }
    ]
  },
  {
    "title": "Chapter 1146 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "It was the first time Catherine’s son looked at her with disdain, and she glared at Shaun with hatred."
      },
      {
        "paragraph": "It could prove himself to his son, but why did he have to step on her to do it? Was he trying to shame\nher?"
      },
      {
        "paragraph": "Noticing Catherine’s anger, Shaun quickly cleared his throat. He carefully put all the steak he had cut into\nCatherine’s plate. “Of course, your mom can teach you how to draw. She’s a world-renowned designer,\nand her drawings are amazing. She can bring you to the park and teach you about the plants and\nanimals…”"
      },
      {
        "paragraph": "“That’s enough, Shaun. Shut your mouth.”"
      },
      {
        "paragraph": "Catherine rolled her eyes at him and ate two pieces of steak before she went to look for Suzie."
      },
      {
        "paragraph": "“You’ve offended Mommy,” Lucas concluded and put down his utensils. “I’m full.”"
      },
      {
        "paragraph": "Then, he jumped out of his chair and went to look for his mommy and Suzie."
      },
      {
        "paragraph": "Shaun hurriedly followed them into the playground."
      },
      {
        "paragraph": "Catherine was accompanying Suzie on the slide. However, Lucas quickly lost interest after a while and\nwent to play with the building blocks instead."
      },
      {
        "paragraph": "Shaun silently sat behind him and began to build blocks."
      },
      {
        "paragraph": "A few minutes later, Lucas looked over and saw that he had built an aircraft carrier."
      },
      {
        "paragraph": "He silently looked down at his playground and suddenly found it uninteresting."
      },

      {
        "paragraph": "“Lucas, I’m not very good at this. I need a helper. Are you willing to help me?” Shaun suddenly looked at\nhim pleadingly. “I can’t find the cannonball.”"
      },
      {
        "paragraph": "Lucas’s delicate eyebrows frowned. In the end, he grabbed a cannonball from the side and handed it to\nhim."
      },
      {
        "paragraph": "“Wow, you’re amazing. Thanks.” Shaun took it. “Can you help me with this part? I’ll do that side.”"
      },
      {
        "paragraph": "Lucas hesitated for a few seconds, but he finally went over."
      },
      {
        "paragraph": "When Catherine came over with a sweating Suzie, she saw the father and son working together on a\nhuge aircraft carrier model."
      },
      {
        "paragraph": "A complex feeling arose in Catherine’s heart upon witnessing the scene."
      },
      {
        "paragraph": "As a mother, she could sense that Lucas had lowered guard a little toward Shaun."
      },
      {
        "paragraph": "Lucas liked to play puzzle games, but she was not good at it. Hence, Lucas usually played on his own, o\nr occasionally, Wesley would play with him."
      },
      {
        "paragraph": "Nevertheless, she understood that at the end of the day, Wesley was not Lucas’s biological father."
      },
      {
        "paragraph": "Lucas hated Shaun, but how would he not be curious about what having a father was like?"
      },
      {
        "paragraph": "Just like Suzie, Lucas got closer to Shaun after he went over to Shaun."
      },
      {
        "paragraph": "After all, blood was thicker than water. Those"
      },
      {
        "paragraph": "thingscould notbe changed."
      },
      {
        "paragraph": "“Scummy dad, Lucas, what are you guys playing? I want to play too.” Suzie went over curiously."
      },
      {
        "paragraph": "“You need to use your brain to play this. It’s not suited for you.” Lucas did not let her touch his model."
      },
      {
        "paragraph": "“What’s the big deal? Hmph.” Suzie got angry."
      },
      {
        "paragraph": "“Don’t be mad, Suzy. Come to Daddy. I’ll teach you how to play with this.”"
      },
      {
        "paragraph": "Shaun hurriedly pulled Suzie into his arms and taught Suzie how to play with Lego."
      },
      {
        "paragraph": "Catherine sighed at the sight of Shaun earnestly playing with the children."
      },
      {
        "paragraph": "A parent, who was passing by with her toddler, said admiringly, “Your husband is handsome and patient,\nunlike my husband You’re so lucky. When I’m spending time with my kids, all he does is play video\ngames outside.”"
      },
      {
        "paragraph": "Catherine followed her gaze and saw several men at the corner of the playground playing with their\nphones."
      },
      {
        "paragraph": "There was a burst of mixed feelings inside her."
      },
      {
        "paragraph": "Perhaps it was not a bad thing for the children to know their father."
      },
      {
        "paragraph": "Although Lucas and Suzie also liked Wesley, she could tell they were still very courteous around him."
      },
      {
        "paragraph": "It was probably because they knew he was not their real father, so they could not make demands on him."
      }
    ]
  },
  {
    "title": "Chapter 1147 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "The four of them were at the children’s restaurant playground until 8:00 p.m."
      },
      {
        "paragraph": "Since Shaun said he wanted to prove his basketball skills to Lucas, he brought the three to the\nbasketball stadium."
      },
      {
        "paragraph": "An intense game was ongoing."
      },
      {
        "paragraph": "Shaun went down and whispered a few words to the captain of the team. Then, the other party gave\nShaun a jersey to wear and put him on the court."
      },
      {
        "paragraph": "As the tall and slender Shaun stood on the court after putting on the jersey, his handsome features\nimmediately made the women in the audience excited."
      },
      {
        "paragraph": "“No-3 is super handsome.”"
      },
      {
        "paragraph": "“You saw him too? He’s tall and handsome. I want a boyfriend like that.”"
      },
      {
        "paragraph": "“Hey, don’t you think he looks like the former wealthiest man, Shaun Hill?”"
      },
      {
        "paragraph": "“Why would Shaun Hill participate in this kind of organization-based competition? He looks twenty- one\nat the oldest.”"
      },
      {
        "paragraph": "“Shush. Ahh, holy cr*p… He dared to shoot the ball from so far away… It went in… Amazing.”"
      },
      {
        "paragraph": "“It’s enough that he’s handsome, but his ball- handling skills are first class too. Is he trying to make us\ndrool?”"
      },
      {
        "paragraph": "The women’s whispers reached the ears of Catherine and the two children."
      },
      {
        "paragraph": "Catherine was embarrassed, but she had to admit that Shaun did look very handsome on the court."
      },

      {
        "paragraph": "Many girls had watched Slam Dunk when they were young, just like she did. That was why back in those\ndays, she thought that Ethan was as handsome as Kaede Rukawa. However, he did not hold a candle\ncompared to Shaun."
      },
      {
        "paragraph": "Shaun’s skills were truly amazing. Whether it was dunking, three -pointers, or grabbing rebounds, he\nsimply outperformed the other players."
      },
      {
        "paragraph": "The whole game became his personal show."
      },
      {
        "paragraph": "The team that was originally on the losing end quickly made a comeback thanks to Shaun. As such, their\npoint gap with the opponent widened."
      },
      {
        "paragraph": "Suzie clapped her hands excitedly. “Scummy dad, you’re amazing. Go go go!”"
      },
      {
        "paragraph": "Shaun, who was cheered on by his daughter, played like he was on steroids."
      },
      {
        "paragraph": "A little boy next to them looked at Suzie enviously. “ That’s your dad? He’s amazing.”"
      },
      {
        "paragraph": "“Yeah, scummy dad is the best at basketball.” Suzie raised her chin high. She was incredibly proud."
      },
      {
        "paragraph": "The boy’s mother laughed. “Little girl, why are you calling him scummy dad?”"
      },
      {
        "paragraph": "Suzie choked, and Lucas said, “Because his last name is Scum.”"
      },
      {
        "paragraph": "“Oh, that’s a rare last name.” The boy’s mother smiled."
      },
      {
        "paragraph": "Lucas did not speak and simply looked at the most dazzling figure on the basketball court."
      },
      {
        "paragraph": "In the past, he really did not know what a father was."
      },
      {
        "paragraph": "Everyone had a dad, but he did not."
      },
      {
        "paragraph": "The children at preschool were picked up by their mom and dad every day."
      },
      {
        "paragraph": "When the preschool held activities during the holidays, the parents of his classmates would come, but\nhis did not."
      },
      {
        "paragraph": "When he went out to play and children of his age got tired, their fathers could carry them, but he did not\nhave a dad. He could only say that he was not tired because he could not bear to tire his mommy."
      },
      {
        "paragraph": "He had never experienced the feeling of having a ‘ father’ before."
      },
      {
        "paragraph": "However, he seemed to have experienced it today."
      },
      {
        "paragraph": "Although others used to think that Uncle Wesley was his father, he knew that Uncle Wesley was not."
      },
      {
        "paragraph": "Uncle Wesley would not treat him so kindly if not for Mommy."
      },
      {
        "paragraph": "He knew."
      },
      {
        "paragraph": "Previously, he only knew that his father was scum, but now, he found out that his father could play Lego\nand basketball very well."
      },
      {
        "paragraph": "After the game, Shaun was surrounded by many people, but he walked straight to Catherine and the\nchildren."
      },
      {
        "paragraph": "When he was before Lucas and Suzie, he asked gently, “How about I teach you guys how to play\nbasketball in the future?”"
      },
      {
        "paragraph": "”Yes, yes.” Suzie clapped her hands happily."
      }
    ]
  },
  {
    "title": "Chapter 1148 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Lucas was silent, but that proud look he had showed Shaun that he agreed."
      },
      {
        "paragraph": "Catherine could not help but ask, “How did they agree to allow you to play?”"
      },
      {
        "paragraph": "“It’s very simple. I gave them two thousand bucks each, and they wanted me to come every day.” Shaun\nsmiled."
      },
      {
        "paragraph": "Catherine was speechless and could not help but grunted to herself, “Money makes the world go round”."
      },
      {
        "paragraph": "Just as she scolded, her phone rang."
      },
      {
        "paragraph": "It was from Wesley. Her expression stiffened."
      },
      {
        "paragraph": "A moment later, she moved aside awkwardly with her phone."
      },
      {
        "paragraph": "“Cathy, where are you? It’s so noisy.” Wesley asked in a hushed tone, “When are you coming back?”"
      },
      {
        "paragraph": "“I’m playing with Lucas outside. I’ll come back later.” Catherine explained needlessly."
      },
      {
        "paragraph": "“Why didn’t you call me if you were playing with Lucas?” Wesley laughed. “Oh, I’ll call you next time.”"
      },
      {
        "paragraph": "Catherine used a few excuses and ended the call."
      },
      {
        "paragraph": "When she turned around, she saw Shaun and the two children standing behind her."
      },
      {
        "paragraph": "Shaun looked at her with concerned eyes, “Did Wesley urge you to go back?”"
      },
      {
        "paragraph": "“ It’s late. The kids still have to go to kindergarten tomorrow. ” Catherine tugged her hair behind her ear."
      },

      {
        "paragraph": "“Oh, then you can go back. Suzie stays with me anyway, and I can bring Lucas back with me tonight. I’ll\nbring them to the kindy together tomorrow.”"
      },
      {
        "paragraph": "Shaun was afraid she would overthink and assured her, “Don’t worry, I’m not trying to take the children\nfrom you. I just think that since you’ll be sending Lucas back to your dad, it’s better to let him come with\nme since it’s closer.”"
      },
      {
        "paragraph": "Catherine frowned. It would take 40 to 50 minutes to reach Sherman Mountain, so it was indeed a little\nfar. “Lucas, what do you think?”"
      },
      {
        "paragraph": "Lucas pursed his lips and fell silent, but Suzie took his hand. “Lucas, you should sleep with me tonight."
      },
      {
        "paragraph": "We haven’t slept together in a long time. We’ll go to Grandpa’s place tomorrow, okay?”"
      },
      {
        "paragraph": "“…Okay.” Lucas finally nodded in agreement."
      },
      {
        "paragraph": "“Alright then.” There was nothing else Catherine could say."
      },
      {
        "paragraph": "After they left the gym, she got into the car and left by herself."
      },
      {
        "paragraph": "In the rearview mirror, she saw Shaun holding the two children’s hands by his sides. In the dim lights,\nsomehow, her heart seemed to have been left behind somewhere."
      },
      {
        "paragraph": "How did that saying go?"
      },
      {
        "paragraph": "A mother’s heart was wherever her children were. In fact, she wanted to stay with the children."
      },
      {
        "paragraph": "However, they did not want to go to Wesley’s villa, so she could not force them to."
      },
      {
        "paragraph": "Shortly after Catherine left."
      },
      {
        "paragraph": "Hadley drove the car and picked Shaun and the others up."
      },
      {
        "paragraph": "He soon sent the three to the Hill family villa."
      },
      {
        "paragraph": "It was late, and all the elders of the Hill family were already asleep. Shaun did not wake them and\ninstead brought the two children to his room and prepared a bath for them."
      },
      {
        "paragraph": "Although Lucas was not used to it and resisted, he slowly eased up because of the troublemaker, Suzie."
      },
      {
        "paragraph": "When the two children played in the bathtub, he took a photo and sent it to Catherine."
      },
      {
        "paragraph": "Catherine had just arrived at the villa when she saw the photo. Under the warm light, Suzie’s smile was\nsweet and cute. Lucas’ face was splattered with the bathwater but his eyes showed a very faint smile."
      },
      {
        "paragraph": "That scene was so warm that her heart ached."
      },
      {
        "paragraph": "When she was pregnant, she had fantasized about their family of four. Her husband would dote on her\nand their children would be healthy and lively. It was every woman’s greatest wish."
      },
      {
        "paragraph": "Now, the children had returned to their father, and she was married to Wesley. However, when faced with\nthis villa, she was still feeling flustered and resistant."
      },
      {
        "paragraph": "Suddenly, Shaun sent a message: [Cathy, thank you for giving birth to these two lovely little angels. The\napologies I owe you might not be said enough or made up to you in this lifetime, the next, or even the\nnext, next lifetimes, but I’m really grateful to you. I’ll love you forever. In this life, I’ll never marry anyone\nexcept you. I’ll always wait for you. I’ll wait for our family of four to be complete.]"
      }
    ]
  },
  {
    "title": "Chapter 1149 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "A family of four…"
      },
      {
        "paragraph": "Catherine stood still for a long time."
      },
      {
        "paragraph": "Wesley’s voice came over suddenly. “Cathy, why are you standing there?”"
      },
      {
        "paragraph": "“Nothing. ” Catherine immediately put down her phone and looked at Wesley’s warm face, feeling a little\nweak. “I’m going to take a shower.”"
      },
      {
        "paragraph": "Wesley stared at her and narrowed his eyes. Where did she go tonight?"
      },
      {
        "paragraph": "Somehow, there was a growing distance between them, even though she was physically by his side."
      },
      {
        "paragraph": "When he went upstairs, the door to the master bedroom was already closed."
      },
      {
        "paragraph": "For the first time, he went in without knocking. The sound of running water came from the bathroom."
      },
      {
        "paragraph": "It was late at night, and the sound tickled Wesley’s heart like a cat’s claw."
      },
      {
        "paragraph": "Regina had clearly relieved him today, and he had no shortage of women now. Sarah also had all sorts\nof techniques."
      },
      {
        "paragraph": "However, those two women were not Catherine."
      },
      {
        "paragraph": "Catherine’s face was beautiful, and her stunning eyes were always dark and soft. Her curvy figure was\nunmatched and extraordinarily gorgeous."
      },
      {
        "paragraph": "He longed for the picture of her crying under him. If that man had not threatened him…"
      },
      {
        "paragraph": "Wesley clenched his fist grimly."
      },

      {
        "paragraph": "Twenty minutes later."
      },
      {
        "paragraph": "When Catherine came out of the shower and suddenly saw Wesley sitting on the large bed, she was\nstartled."
      },
      {
        "paragraph": "She subconsciously covered her chest with a towel."
      },
      {
        "paragraph": "Normally, he would rarely enter after she closed the bedroom door. She got used to it, so she gradually\ndid not pay too much attention when she came out of the shower."
      },
      {
        "paragraph": "Even though she managed to cover herself, Wesley caught a glimpse of it. Her long and damp hair was\ndraped over her shoulders. It was messy, but it only made her look amorous."
      },
      {
        "paragraph": "At that moment, after her bath, her white little face was slightly flushed, showing a natural glow."
      },
      {
        "paragraph": "It was unlike Regina or Sarah, who normally put on exquisite makeup and only diminished his desire to\nkiss them."
      },
      {
        "paragraph": "“Cathy…” The flame in Wesley’s eyes ignited abruptly."
      },
      {
        "paragraph": "“Wesley, did something happen?” The look in his eyes caused a panic in Catherine."
      },
      {
        "paragraph": "“Can’t I come in to see you if nothing happened?” Wesley’s throat bobbed. He did not want to hold back\nanymore."
      },
      {
        "paragraph": "The more he endured, the further away he pushed her."
      },
      {
        "paragraph": "Only by possessing her entirely would she belong to him completely."
      },
      {
        "paragraph": "Even if she knew his true purpose, so what? When the deed was done and she had his child, everything\nwould be different."
      },
      {
        "paragraph": "Besides, it was not like she installed surveillance cameras in the villa."
      },
      {
        "paragraph": "“But… I want to sleep. I’m very tired today.” Catherine said tactfully."
      },
      {
        "paragraph": "“That’s true, it’s very late. Let’s sleep together. I figured that since we’re husband and wife, we shouldn’t\nsleep in separate beds.” Wesley’s flaring gaze was fixed on her."
      },
      {
        "paragraph": "Catherine’s eyes widened in dismay."
      },
      {
        "paragraph": "“Why are you staring at me like that?” Wesley smiled. “You don’t want to?”"
      },
      {
        "paragraph": "“That’s not…” Catherine stammered. “Then go to sleep.” Wesley lay on the bed."
      },
      {
        "paragraph": "Catherine’s mind went blank for a moment. She told herself that this was normal. She mentally prepared\nherself for this a long time ago, right?"
      },
      {
        "paragraph": "However, her body could not help but dawdle. She did her skincare routine and blow-dried her hair, and\nonly lay down when it looked like Wesley had fallen asleep."
      },
      {
        "paragraph": "After the lights went out, she carefully slept near the edge of the bed."
      },
      {
        "paragraph": "Soon after, Wesley’s body came close to her."
      },
      {
        "paragraph": "She gripped the corner of the quilt. She prepared herself mentally, but she still could not stand it and\nrecoiled reflexively."
      },
      {
        "paragraph": "”Wesley, I’m really tired. Maybe next time…”"
      }
    ]
  }
]