[

  {
        "title": "Chapter 1650 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "“Even when Sheryl noticed that Rebecca’s behavior was inappropriate, Rebecca would always bring up\nthat she was abducted as a child. As a mother, Sheryl naturally blamed herself. She thought that if she\nhad been around, her daughter wouldn’t have suffered so much. If she had the chance to educate her\ndaughter, her daughter wouldn’t have become vain and pretentious.”"
            },
            {
                "paragraph": "Catherine choked for a moment."
            },
            {
                "paragraph": "Her heart was subconsciously stirred up."
            },
            {
                "paragraph": "“You’re a mother yourself, so you should be able to understand her feelings.” Each of Titus’ words\nseemed to pierce her heart. “Will a mother who loves her children regard them with disdain? She won’t.\nIf her child turns out bad, she’ll only blame herself.”"
            },
            {
                "paragraph": "“But she shouldn’t have indulged Rebecca without limits, ” Catherine said."
            },
            {
                "paragraph": "“Do you think she was clear-headed when she indulged Rebecca?” Titus asked."
            },
            {
                "paragraph": "Catherine was immediately at a loss for words."
            },
            {
                "paragraph": "Titus looked at her distracted expression and sighed in his heart. “Actually, I’ve thought about it. When\nSheryl just arrived in Melbourne, she told me that memories were flashing in her head. However, she\nstopped experiencing that afterward. Rebecca probably began to drug her because she was afraid of\nSheryl regaining her memory. As her husband, I was careless as well.”"
            },
            {
                "paragraph": "“If she had regained her memory, she would know that the name she gave to her daughter was\nCatherine, not Rebecca. Hah.” Catherine smiled in irony."
            },
            {
                "paragraph": "Titus looked at her silently."
            },
            {
                "paragraph": "“Forget it. You don’t believe that I’m her daughter anyway.” Catherine opened the door and prepared to\nleave."
            },
            {
                "paragraph": "“I believe it now. Jeffery and his wife are very problematic. We were all tricked by them."
            },
            {
                "paragraph": "Unfortunately, all my men are injured now. Otherwise, I’d definitely deal with them, ” Titus said with an\nexpression as cold as ice."
            },
            {
                "paragraph": "“Rebecca is their daughter. Before this, their family wanted to swallow up Hudson Corporation but my\ngrandmother didn’t let them because she knew Hudson was something my mother left for me. Hence,\nthey killed my grandmother. It wasn’t easy for me to get Hudson Corporation back.”"
            },
            {
                "paragraph": "Catherine looked back at him. “Uncle Titus, I advise you to take her and leave Australia soon.”"
            },
            {
                "paragraph": "Then, she held Shaun’s hand and left."
            },
            {
                "paragraph": "She had been enduring it, but after remembering what Titus said, her eyes could not help but redden."
            },
            {
                "paragraph": "Sheryl loved her daughter, but she gave that love to Rebecca and harmed Catherine instead."
            },
            {
                "paragraph": "“Cathy, why are you crying?”"
            },
            {
                "paragraph": "Shaun’s bewildered voice suddenly sounded by her ear. “Did that bad uncle make you angry? I’ll go\nbeat him up.”"
            }
        ]
    },
    {
        "title": "Chapter 1651 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "“Don’t.”"
            },
            {
                "paragraph": "Catherine hurriedly grabbed Shaun’s wrist. Her voice was hoarse and enough to make anyone’s heart\nmelt. “He didn’t. You were there too. Did you see him bully me?”"
            },
            {
                "paragraph": "Shaun felt distressed."
            },
            {
                "paragraph": "Just now, he only heard Cathy say many things to that uncle but he did not understand what they were\ntalking about."
            },
            {
                "paragraph": "Bullying… There was no bullying. The uncle had not hit her either."
            },
            {
                "paragraph": "“Then… Why are you crying?” Shaun was very anxious. He could not bear to see her cry. His heart\nached."
            },
            {
                "paragraph": "“Because… I thought of some unhappy things.” Catherine forced a smile at him. “Get in the car.”"
            },
            {
                "paragraph": "On the way back to the manor, Shaun was feeling troubled. He kept thinking about the same problem."
            },
            {
                "paragraph": "Cathy cried because she thought of something unhappy. Then, would she smile if she thought of\nsomething happy?"
            },
            {
                "paragraph": "However, how could he make her happy?"
            },
            {
                "paragraph": "He rested his cheeks on his palms, which made him look adorable with his squishy cheeks."
            },
            {
                "paragraph": "However, Catherine was thinking about Rebecca and did not notice him."
            },
            {
                "paragraph": "At the manor, just after parking the car. Suzie and Lucas rushed out like a whirlwind. “Mommy,\nShaunny.”"
            },
            {
                "paragraph": "Suzie immediately threw a bear hug at Catherine. “"
            },
            {
                "paragraph": "Mommy, I missed you.”"
            },
            {
                "paragraph": "“I missed you too.” Catherine had just finished speaking when she saw Brennan and Lea. She was a\nlittle surprised. It was only nine in the morning now. It was too early for Brennan to come over."
            },
            {
                "paragraph": "Furthermore, she felt like the air between Brennan and Lea was weird for some reason."
            },
            {
                "paragraph": "She remembered that when she left last night, Suzie had cried and said that she wanted her\ngrandparents to sleep with her…"
            },
            {
                "paragraph": "Could it be…"
            },
            {
                "paragraph": "Catherine felt like she was struck by lightning. She quickly pretended to be calm and picked Suzie up. “\nAre you feeling better? Are you still scared? Did you suffer from insomnia last night?”"
            },
            {
                "paragraph": "Suzie pouted, and Lucas said, “She got up and cried several times last night. She was so noisy.”"
            },
            {
                "paragraph": "“ If you were the one who got kidnapped, you’d be scared and wake up crying at night too,” Suzie\nretorted angrily, “But fortunately, Grandpa and Grandma slept with me last night.”"
            },
            {
                "paragraph": "Lea and Brennan,“…”"
            },
            {
                "paragraph": "The combined age of both of them was almost a hundred, but their expressions now were full of\nembarrassment—especially Lea, who had a tinge of red on her face."
            },
            {
                "paragraph": "She had always maintained her looks and coupled with her excellent temperament from being a lady of\na wealthy family, she looked like a middle -aged woman who was in love again. She looked more than\na decade younger, and even her eyes had brightened up."
            },
            {
                "paragraph": "Catherine secretly sighed while looking at the changes brought about by love."
            },
            {
                "paragraph": "If Mason had not gotten in between Lea and Brennan’s relationship, they might not have divorced at all.\nIn fact, they might have become a loving couple over time."
            },
            {
                "paragraph": "Unfortunately, Liam and Shaun…"
            },
            {
                "paragraph": "“Mommy, why are you spacing out?” Lucas shook Catherine’s hand."
            },
            {
                "paragraph": "“ It’s nothing. ” Catherine smiled and looked up at Brennan and Lea. “Uncle, Aunty, thank you for these\ndays.”"
            },
            {
                "paragraph": "“No, we should be the ones thanking you for taking care of Shaun.” Lea also hurriedly changed the\ntopic so that she would not feel as embarrassed. “Let’s go in.”"
            }
        ]
    },
    {
        "title": "Chapter 1652 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "As they headed inside and walked for a while, they suddenly realized that one person was missing."
            },
            {
                "paragraph": "They turned around and saw Shaun was still standing where he was. His lips were pulled in a deep\npout and he wore an expression that seemed to say ‘I’ve been abandoned, poor me’."
            },
            {
                "paragraph": "Catherine and the others felt their hearts go numb at the sight as if they had suddenly become sinners\nfor neglecting a little darling."
            },
            {
                "paragraph": "As his mother, Lea was feeling even guiltier and said gently, “Shaunny, come over. I’ll have someone\nbake you a cake.”"
            },
            {
                "paragraph": "Shaun ignored her and looked at Catherine sulkily. “"
            },
            {
                "paragraph": "I’m angry now. You ignored me.”"
            },
            {
                "paragraph": "“…I wasn’t ignoring you. I thought you’d follow.” Catherine quickly took his hand and added, “I was\nthinking about Suzie and Lucas.”"
            },
            {
                "paragraph": "Shaun looked at Suzie and Lucas before whining, “ You already have me. Why are you still thinking\nabout them?”"
            },
            {
                "paragraph": "Lucas frowned and Suzie suddenly burst in anger. “ You’re too much. She’s our Mommy. How could\nyou steal our mommy from us?”"
            },
            {
                "paragraph": "Shaun froze. No matter how stupid he was, he still knew how important a mommy and daddy were for\nevery child."
            },
            {
                "paragraph": "His lips quivered, and he bit his sexy lips and suddenly cried. “I don’t have a mommy. I don’t have\none…”"
            },
            {
                "paragraph": "Catherine was completely flabbergasted."
            },
            {
                "paragraph": "Suzie was dumbfounded. She felt like she had done something heinous."
            },
            {
                "paragraph": "Just then, Lea stood out stiffly and said gently, “ Shaunny, don’t cry. I’m your mommy. This is your\ndaddy.”"
            },
            {
                "paragraph": "“Yeah, I’m your daddy.” Brennan was a little overwhelmed."
            },
            {
                "paragraph": "They were both powerful figures in the business world and were absent during Shaun’s childhood, so\nthey did not know how to face such a childish Shaun now."
            },
            {
                "paragraph": "Shaun looked at them and then at Catherine’s little face, and cried even harder. “I don’t want you. My\ndaddy and mommy… are so old.”"
            },
            {
                "paragraph": "The “old” Brennan and Lea felt as if their hearts were stabbed by millions of arrows."
            },
            {
                "paragraph": "They were not that old. They were only fifty, and since they had maintained their health very well, they\nlooked around forty at most."
            },
            {
                "paragraph": "Lea muttered, “We’re not old. It’s you who’s old. ”"
            },
            {
                "paragraph": "Brennan nodded in agreement. Although the doctor said not to provoke his son, he was still a little\nirritated at being called old."
            },
            {
                "paragraph": "“I can’t hear you, I can’t hear you. ” Shaun covered his ears while exclaiming in denial. “ I’m only two\nyears old.”"
            },
            {
                "paragraph": "Catherine felt dizzy. In normal circumstances, she could compromise, but when it came to his\nparents…"
            },
            {
                "paragraph": "“Stop crying,” she said solemnly as she tugged Shaun’s hand."
            },
            {
                "paragraph": "“Cathy.” Shaun stopped crying immediately when he saw her serious expression. However, he could\nnot help but sniffle. His handsome face was wet from his tears which tugged at the heartstrings of\nthose who saw him."
            },
            {
                "paragraph": "“Shaunny, listen to me,” Catherine said as she wiped his tears away. “Your daddy and mommy are\ndetermined by God. Aunty Lea is your mommy."
            },
            {
                "paragraph": "How can you call her old? Do you know how hard she worked to give birth to you? Also, Uncle Brennan\nis your daddy. Children should respect their mommy and daddy. You can’t look down on them. If you\ndo, then you’re not a good boy.”"
            },
            {
                "paragraph": "“I’m a good boy,” Shaun said seriously even though he was slightly flustered."
            },
            {
                "paragraph": "“Then you have to be nice to your daddy and mommy, ” Catherine continued."
            },
            {
                "paragraph": "“Oh, okay.” Shaun looked at Lea and Brennan obediently, and said softly, “Daddy, Mommy, I’m sorry.”"
            },
            {
                "paragraph": "“ It’s okay. ” Lea’s heart almost melted as her eyes welled up. She missed out on Shaun’s childhood, so\nshe never expected her son to treat her with such respect one day."
            },
            {
                "paragraph": "Brennan felt the same. However, he was a man, so no matter how much his eyes stung, he could not\nshed a tear."
            },
            {
                "paragraph": "He did not fulfill his duty as a father and missed out on Liam and Shaun’s childhoods. Now, God was\ngiving him a chance to get along with his son again.”"
            },
            {
                "paragraph": "It’s okay.” He waved his hand. ”Go in with cathy. I’m going to have a smoke.”"
            }
        ]
    },
    {
        "title": "Chapter 1653 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "Catherine held Shaun’s hand and went in, but Shaun could not help but turn back and glance at\nBrennan’s desolated figure. For some reason, his heart felt a little uncomfortable."
            },
            {
                "paragraph": "Was he overboard earlier?"
            },
            {
                "paragraph": "Cathy lectured him that he could not judge a book by its cover. It was not Brennan’s fault that he looked\nold."
            },
            {
                "paragraph": "Upon entering the villa, Suzie stopped being jealous and remembered what Catherine said earlier that\nshe had to regard Daddy as a good friend."
            },
            {
                "paragraph": "“Shaunny, both Lucas and I have a toy house. Do you want to play together?” Suzie took the initiative\nto invite him."
            },
            {
                "paragraph": "Shaun was tempted but could not help but look back at Catherine."
            },
            {
                "paragraph": "He wanted to play and stay with Cathy at the same time."
            },
            {
                "paragraph": "“Go ahead. I just got home, so I need to take a shower and change,” Catherine said gently. She had\nstayed in the hospital for several days and it felt uncomfortable now."
            },
            {
                "paragraph": "“Oh, okay.” Shaun was slightly disappointed."
            },
            {
                "paragraph": "“Come on, don’t keep clinging to Mommy. We can play by ourselves. ” Suzie dragged him into the toy\nroom."
            },
            {
                "paragraph": "The toy room was huge and had many pink dolls and various small pieces of Lego."
            },
            {
                "paragraph": "“Let’s play house.” Suzie said as she felt that she finally found a playmate. In the past, neither Lucas\nnor her grandmother liked to play house with her, and it was boring for her to play alone."
            },
            {
                "paragraph": "This time, she took out all her pots and pans. “ I’ll teach you how to play…”"
            },
            {
                "paragraph": "Shaun ignored her and picked up the Lego blocks on the ground curiously."
            },
            {
                "paragraph": "“Oh, that belongs to Lucas. Don’ t touch it. If you lose a piece, he’ll throw a tantrum again, ” Suzie\nshouted. “Also, that’s too difficult. It’s not something that humans can complete.”"
            },
            {
                "paragraph": "Lucas glared at her impassively. “Am I not a human?”"
            },
            {
                "paragraph": "Suzie stuck her tongue out at him. “You played with this Lego for a week but you still couldn’t complete\nit. Grandma said that only those 18 and above can play with it, but you didn’t believe her and insisted\non buying it. What a waste of money.”"
            },
            {
                "paragraph": "Lucas’s eyebrows furrowed tightly at her words and showed a little stubbornness. “I wanna play it. I’ll\nfinish it soon. Hey, don’t mess with my blocks.”"
            },
            {
                "paragraph": "However, Shaun seemed to not hear him and even opened up the guidebook on the table."
            },
            {
                "paragraph": "“Why are you reading it so seriously? You won’t understand it. You can’t even read.” Suzie sighed. “I f\nonly the previous Daddy was here. His IQ would still be okay. It’ll be a piece of cake for him to play with\nthis stuff, but you? Your IQ is lower than mine.”"
            },
            {
                "paragraph": "“It’s easy. ” Shaun looked at it for a moment and suddenly looked up."
            },
            {
                "paragraph": "“Easy?” Lucas felt like he heard a joke. “It is quite easy.”"
            },
            {
                "paragraph": "“Yeah, it’s easy.” Shaun did not pick up the sarcasm in Lucas’s voice and fiddled carefully with the\npieces on the ground. Before anything else, he classified them."
            },
            {
                "paragraph": "Lucas and Suzie did not believe him at first, but when they saw him successfully assemble a chassis of\na car, they were dumbfounded."
            },
            {
                "paragraph": "In less than forty minutes, Shaun assembled a cool military green Lamborghini."
            },
            {
                "paragraph": "“Look. It’s easy. ” Shaun pressed the door button, and the sports car’s door opened."
            },
            {
                "paragraph": "Lucas was stunned and Suzie was dumbfounded."
            },
            {
                "paragraph": "Was he not supposed to have the IQ of a two-year- old?"
            },
            {
                "paragraph": "How could he assemble it so quickly and perfectly?"
            },
            {
                "paragraph": "It was simply a fatal blow to them who were only three-year-olds. It was too shocking."
            },
            {
                "paragraph": "Just then, Catherine entered the room after her shower. She wore pink loose lounge clothes and her\nhair draped over her shoulders after being blow- dried. Her casual appearance made her seem more\nfeminine, and although without makeup, her skin was still fair and her face was bright and radiant."
            },
            {
                "paragraph": "Her body had a lingering scent of her shower gel."
            },
            {
                "paragraph": "Suzie and Lucas were used to this fragrance because this was Catherine’s usual shower gel at home."
            }
        ]
    },
    {
        "title": "Chapter 1654 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "Shaun, on the other hand, was not used to it. Catherine had previously showered in the hospital too,\nbut the scent was the refreshing kind. His mouth dried up today after smelling this unfamiliar yet\npleasant fragrance, and his heart began to throb erratically."
            },
            {
                "paragraph": "When he looked up and saw her dark hair and red lips, he was overwhelmed with a desire to kiss her."
            },
            {
                "paragraph": "However, someone hugged her more quickly than he could. It was Suzie."
            },
            {
                "paragraph": "“Mommy, you’re done showering?” Suzie hugged one of Catherine’s thighs."
            },
            {
                "paragraph": "“Yeah.” Catherine knelt down and was delighted to see the completed Lamborghini sports car on the\nground. “Lucas, isn’t this the same Lego your grandma gave you the last time? You actually finished\nassembling it. You’re amazing.”"
            },
            {
                "paragraph": "Lucas’s handsome face reddened slightly in embarrassment."
            },
            {
                "paragraph": "Shaun harrumphed and pouted."
            },
            {
                "paragraph": "Suzie covered her lips and snickered. “Mommy, it wasn’t Lucas who finished it. Lucas spent one week\nbut still couldn’t complete it, but Shaunny finished it after only a while. He’s truly amazing.”"
            },
            {
                "paragraph": "Shaun’s chest immediately puffed up like a proud peacock. It was not a big deal to him before this but\nfor some reason he wanted Catherine to sing the praises of his achievement now."
            },
            {
                "paragraph": "Shaun was slowly regaining his intelligence, and while he couldn’t be labeled a fool, he was still very\nmuch like a child to her. This puzzle, on the other hand, had put one’s mind to the test."
            },
            {
                "paragraph": "Lucas had always been a smart kid and loved to play with Lego since he was younger than he was\nnow. He picked up the challenge himself to assemble Lego designed for age 18 and above but alas he\ncould not complete it. Shaun, however, managed to finish it in such a short time."
            },
            {
                "paragraph": "This could only mean that his intelligence might have always been intact."
            },
            {
                "paragraph": "“Oh, you’re amazing, Shaunny,” Catherine said as she rubbed his black hair."
            },
            {
                "paragraph": "Shaun grinned happily, revealing his pearly whites. “Then can I have a reward?”"
            },
            {
                "paragraph": "“Sure.” Catherine smiled. “What do you want?” “I want a kiss, ” Shaun announced."
            },
            {
                "paragraph": "“Pfft.” Suzie burst out laughing then snickered as she covered her mouth."
            },
            {
                "paragraph": "Lucas smirked as well. He had secretly seen how Shaun and Catherine got along in private. They\nkissed in a way that was nothing like kissing a child."
            },
            {
                "paragraph": "Catherine’s face flushed in embarrassment. It would not have mattered if it was only Shaun alone but\nthe children were here too."
            },
            {
                "paragraph": "She said stiffly, “Okay. I’ll give you a kiss. Everyone gets a reward.”"
            },
            {
                "paragraph": "She pressed a kiss onto each of their foreheads, with Shaun being the last."
            },
            {
                "paragraph": "Shaun frowned after the kiss as this was not the kind of kiss he wanted. He was about to speak when\nCatherine glared at him."
            },
            {
                "paragraph": "He proceeded to zip his mouth and pout sulkily."
            },
            {
                "paragraph": "“Well, you guys continue playing. I’m going to take care of something.”"
            },
            {
                "paragraph": "Catherine slipped away."
            },
            {
                "paragraph": "Hadley had been waiting in the parlor for a while."
            },
            {
                "paragraph": "“Ms. Jones, Rebecca and Young Master Hill hadn’t been to the company lately. The company…” he\nhesitated."
            },
            {
                "paragraph": "“Rebecca is dead, ” Catherine said faintly."
            },
            {
                "paragraph": "“What?” Hadley was stunned. Rebecca had spent so much money and effort to acquire 70% of the\ncompany’s shares, but now she was dead? “Is that true?”"
            },
            {
                "paragraph": "“I’ll head over to the funeral parlor this afternoon. Even if it’s a corpse, I want to see for myself if it’s\ntruly Rebecca.” Catherine’s eyes were cold. She had to be sure, lest Rebecca escaped and stabbed\nher in the back again."
            }
        ]
    },
    {
        "title": "Chapter 1655 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "“I’ll go with you,” Hadley said immediately. “But if Rebecca really is dead, then what about her shares?\nWill they fall into the hands of Jeffery and his wife?”"
            },
            {
                "paragraph": "Catherine’s chest tightened. Hadley’s words served as a reminder."
            },
            {
                "paragraph": "“What’s the current situation at Hill Corporation? According to Shaun, Rebecca brought in her own\npeople to take over Hill Corporation and even fired many of the company’s senior executives?”"
            },
            {
                "paragraph": "“Yes, Rebecca hired a team herself. The person in charge is someone called Wade. The rest of them\ntook over other important positions of GM and managers of various departments.” Hadley had a\nheadache. “I looked into it and discovered that Wesley and Wade are close.”"
            },
            {
                "paragraph": "“So Wade is one of Wesley’s men,” Catherine said as she was struck with an understanding."
            },
            {
                "paragraph": "“Yes. That, in fact, made sense. As ruthless as she was, Rebecca wasn’t particularly skilled and\ncapable of dealing with the business side of things. When it comes to her connections, Wesley was the\nonly one"
            },
            {
                "paragraph": "she knew outside the Costner family. She must know, however, that when two dogs aim for a bone, it’s\nthe third dog that gets it. Wesley must have gone to look for Jeffery and Sally when he returned to\nMelbourne suddenly.”"
            },
            {
                "paragraph": "“Yes, Rebecca probably had the impression that her relationship with Wesley was one where they\nexploited each other, but she was wrong. She was only but a tool to Wesley. ” Catherine sighed. “In the\nend, she underestimated Wesley’s brutality and viciousness.”"
            },
            {
                "paragraph": "Wesley’s cruelty seemed to have no bounds."
            },
            {
                "paragraph": "Hadley smiled wryly. “If that’s the case, Hill Corporation fell into Wesley’s laps following his elaborate\nscheme. Wesley’s Golden Corporation is already at its pinnacle. If he were to control Hill Corporation\nby pulling the strings from behind the scene with Jeffery as a puppet, then he’ll be at the top. Who else\nthen, would be able to compete with him in the future?”"
            },
            {
                "paragraph": "Catherine also understood why Gavin Mead would help Wesley."
            },
            {
                "paragraph": "“I won’t let Wesley succeed.” She gritted her teeth coldly."
            },
            {
                "paragraph": "Hadley smiled bitterly. “What can you do? It might be possible if Young Master Hill was fine, but he\ncurrently has the IQ of a two-year-old… The both of you aren’t married either, so you have no right to\ninterfere. Besides… Wesley and you are still technically husband and wife… If you step in, others might\nretaliate and accuse you of colluding with Wesley to annex Hill Corporation.”"
            },
            {
                "paragraph": "Catherine thought about Lea, who was still a shareholder."
            },
            {
                "paragraph": "Lea might possess a strong business acumen but she was no match for Wesley’s malice and guile."
            },
            {
                "paragraph": "“I’ll train Shaun back to how he once was as soon as possible. I’ve discovered that he’s actually not\nstupid, so it’s not like this problem is hopeless. As long as we kick Wade away and prevent Jeffery from\nentering the company, Wesley’s plan won’t work.”"
            },
            {
                "paragraph": "Catherine mused, “Rebecca bought Hill Corporation with the money that Sheryl gave her, so Sheryl is\nqualified to reclaim her shares. It won’t fall into Jeffery’s hand.”"
            },
            {
                "paragraph": "“But Sheryl and Jeffery are siblings. Will she do it?”"
            },
            {
                "paragraph": "“…We’ll cross the bridge when we get there.” Catherine sighed."
            },
            {
                "paragraph": "Now, she only hoped that Titus could quickly cure Sheryl’s illness."
            },
            {
                "paragraph": "Aunty Yasmine was done cooking when Hadley left."
            },
            {
                "paragraph": "Old Madam and Old Master Hill were not pleased when they saw Shaun’s silly expression."
            },
            {
                "paragraph": "“Mom, Dad, don’t worry. Shaun will get better.” Lea comforted the two elders. “And… This is quite good\ntoo. Shaun’s childhood had always been miserable. Now that he has returned to his younger self, he\ngave us parents a chance to redeem ourselves. We’ ll give him a happy childhood this time.”"
            },
            {
                "paragraph": "Old Master Hill snorted. “What rubbish are you spouting? A perfectly good man was reduced to this.\nThe rest of the world will laugh at him. Besides, do you really think he needs you to give him a\nchildhood? Do you think he relies on you as a mother?”"
            },
            {
                "paragraph": "Lea was embarrassed."
            },
            {
                "paragraph": "It was obvious that Shaun had been clinging to Catherine since they sat at the table. Yet, he refused to\ntalk to her and every cell in his body seemed to say ‘I’m not happy. Hurry up and coax me’."
            },
            {
                "paragraph": "Old Madam Hill’s heart softened when she saw him. “Shaun wasn’t this cute when he was young.”"
            },
            {
                "paragraph": "“Come, Shaun. Have this drumstick. You have to eat more to be healthy, ” she said as she handed him\na drumstick."
            }
        ]
    },
    {
        "title": "Chapter 1656 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "When Shaun turned and saw the Old Madam’s kind face, his heart softened and he quickly held out his\nbowl to catch the drumstick. He said politely,“ Thank you, Grandma.”"
            },
            {
                "paragraph": "“Oh, what a good boy.” Old Madam Hill was overwhelmed with emotions. “Oh, I never would’ve\nimagined a day I’d see our Shaun behave so obediently. I hadn’t fulfilled my duty as a grandmother in\nthe past too. I’ll have to treat him better in the future. Old man, you’re not allowed to be as strict with\nShaun as you were when he was a child.”"
            },
            {
                "paragraph": "“I know.” Old Master Hill was heartbroken too."
            },
            {
                "paragraph": "Throughout the meal, the Hill family desperately tried to make it up to Shaun."
            },
            {
                "paragraph": "Contrastingly, Shaun was not as excited as they were. He ate only half a drumstick and pouted before\nrunning off to the toy room."
            },
            {
                "paragraph": "“Cathy, what happened? Did you fight?” Lea asked worriedly."
            },
            {
                "paragraph": "Catherine was a little taken aback. Was he unhappy because she glared at him earlier?"
            },
            {
                "paragraph": "He was indeed childish. Sigh."
            },
            {
                "paragraph": "Not even Suzie was that petty."
            },
            {
                "paragraph": "Old Madam Hill frowned. “It’s not good if he doesn’ t eat. Lea, why don’t you feed him? Didn’ t you say\nyou wanted to paint a more colorful childhood for him?”"
            },
            {
                "paragraph": "Lea was ashamed and stuttered, “It’s not that I don’t want to feed him, it’s just he doesn’t want me to\nfeed him.”"
            },
            {
                "paragraph": "“Hmph, useless.” Old Master Hill glared at her expressionlessly."
            },
            {
                "paragraph": "Lea.“…”"
            },
            {
                "paragraph": "“Grandma, I’ll feed him later.” Catherine smiled to defuse the awkwardness. “Shaunny listens to me.”"
            },
            {
                "paragraph": "Old Madam Hill laughed. “You thought he had the IQ of a two—year—old but I’d beg to differ. Which\ntwo-year-old cling to their wife instead of their mother? If you ask me, I’d say that even though he\ndoesn’t have any memories, his heart remembers the person he likes the most, and that’s Catherine.”"
            },
            {
                "paragraph": "Old Master Hill nodded in agreement."
            },
            {
                "paragraph": "Catherine was embarrassed to hear this, but she was in fact beaming internally."
            },
            {
                "paragraph": "After all, Shaun did treat her differently."
            },
            {
                "paragraph": "She quickly ate up and brought the bowl to the playroom."
            },
            {
                "paragraph": "As she left, she heard Suzie telling everyone softly, “ When Shaunny told Mommy to kiss him, Mommy\nonly kissed his forehead. He didn’t seem to like being kissed on the forehead, so he was unhappy the\nentire time he played with us.”"
            },
            {
                "paragraph": "Catherine stumbled and almost fell down."
            },
            {
                "paragraph": "She was abashed to the point she wanted to burrow into the ground. Suzie was such a busybody."
            },
            {
                "paragraph": "Old Madam Hill chuckled. “I told you. It’s clear that he wanted to be kissed by his wife. Being young\nand in love is such a wonderful thing.”"
            },
            {
                "paragraph": "Catherine. “…”"
            },
            {
                "paragraph": "She just imagined a row of crows flying over her head. With flushed cheeks, she went to deal with\nShaun."
            }
        ]
    },
    {
        "title": "Chapter 1657 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "In the toy room."
            },
            {
                "paragraph": "Shaun stared at the door with a dazed expression while fidgeting with his favorite building block in his\nhand."
            },
            {
                "paragraph": "However, he was not in the mood to play with it at all. Depressed, he was wondering when Catherine\nwould come and cheer him up."
            },
            {
                "paragraph": "If she did not cheer him up, he would not be in the mood to play with toys, watch cartoons, or eat."
            },
            {
                "paragraph": "Amid his thoughts, he suddenly heard familiar footsteps."
            },
            {
                "paragraph": "Upon hearing the footsteps, he knew it was Catherine."
            },
            {
                "paragraph": "Shaun promptly drooped his head and pretended to be seriously playing with the building blocks. He\nacted as though he could not be bothered about her."
            },
            {
                "paragraph": "No one knew that his heart was racing madly when the footsteps stopped at the door."
            },
            {
                "paragraph": "Why was he feeling like this? Was he sick?"
            },
            {
                "paragraph": "“You enjoy playing with building blocks, huh?” Catherine squatted beside him with a grin on her\nexquisite face. “Let’s go to the mall tomorrow to buy more building blocks, alright?”"
            },
            {
                "paragraph": "“No.” Shaun rejected her outright and even looked away like a softie."
            },
            {
                "paragraph": "“Are you still angry? How petty of you.” Feeling amused, Catherine cupped his face with her elbows on\nhis knees. “Do you know why I glared at you this morning?”"
            },
            {
                "paragraph": "“ I don’ t know, and I don’ t want to know either.” Shaun snorted, but he could not help but look\nsideways at her."
            },
            {
                "paragraph": "It amused Catherine so much to see his behavior contrast his words, but she tried to suppress her\nlaughter. She approached him and said, “I know you wanted me to kiss you on the lips and not on the\nforehead, but Suzie and Lucas were around. I was embarrassed…”"
            },
            {
                "paragraph": "“What’s embarrassing?” Shaun could not figure it out."
            },
            {
                "paragraph": "“Kissing is something that we can only do when no one else is around. I don’t want anyone else to see\nit. This is a private matter. You don’t see anyone kissing in public, do you?”"
            },
            {
                "paragraph": "“People do that on TV, ” Shaun immediately answered, “I saw it on TV this morning.”"
            },
            {
                "paragraph": "Catherine was speechless."
            },
            {
                "paragraph": "Her head ached. What the hell did he watch with Suzie and Lucas? Why was he precocious now? By\nthe look of things, she needed to educate Suzie and Lucas."
            },
            {
                "paragraph": "“The shows on TV are different.” Catherine’s head hurt as she did not know how to explain to him. “\nAnyway, that’s that. If you’re not happy with it, I won’t kiss you anymore.”"
            },
            {
                "paragraph": "Upon hearing her menacing tone, Shaun was frightened. He clutched her hand and said in a\ndomineering tone, “No way.”"
            },
            {
                "paragraph": "With that, Catherine said gently, “ Suzie and Lucas are my kids, but you’re different. As I said, you’re\nmy lover. Not only will we kiss, but we’ll also have lots of… other intimate acts. We can’t act intimately\nin front of others. It’s a matter of privacy.”"
            },
            {
                "paragraph": "Her words left Shaun feeling perplexed. Nevertheless, he understood the sentence ‘you’re my lover’."
            },
            {
                "paragraph": "Deep down, he was delighted. “But who do you love most? Sister Suzie, Brother Lucas, or me?”"
            },
            {
                "paragraph": "“My love for them is different. You’ll understand it in the future.” Catherine looked grave. “Don’t address\nthem as ‘Sister Suzie’ and ‘Brother Lucas’ anymore. Just call them by their names.”"
            },
            {
                "paragraph": "“Oh.” Shaun pouted. “I got it. I’m not your only love.”"
            },
            {
                "paragraph": "“No, you’re my only love.” At the sight of his disappointed face, Catherine glanced at the door before\nshe moved closer to him and kissed his exquisite, thin lips."
            },
            {
                "paragraph": "Shaun was stunned. After coming back to his senses, he returned Catherine’s sweet kiss just like what\nshe did to him just now."
            }
        ]
    },
    {
        "title": "Chapter 1658 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "Shaun was a bit clumsy when kissing Catherine. However, he soon took an active role and no longer\nremained a passive kisser."
            },
            {
                "paragraph": "His kiss made Catherine blush and melt. She could not help but sigh deep down. This man was still the\nsame."
            },
            {
                "paragraph": "After kissing her a few times, he soon got the hang of it. He had started to kiss her in a domineering\nmanner as well."
            },
            {
                "paragraph": "However, they were in the playroom, after all. As there were many people outside, she dared not\nindulge herself in the kiss for too long."
            },
            {
                "paragraph": "She promptly pushed him away and said while panting, “Stop. If someone barges in, we’ll be in\ntrouble.”"
            },
            {
                "paragraph": "“Oh.” Gazing at her pretty face, Shaun could not help but gulp. “Cathy, you’re so pretty.”"
            },
            {
                "paragraph": "Catherine felt as though her heart was dripping with honey. She lowered her head and poked his chest\nwith a slender finger. “Remember that I’m forever the prettiest person in your heart.”"
            },
            {
                "paragraph": "“Mm. ” Shaun felt as though something had filled his heart. He could never get enough of this woman.\nHe wished he could be with her all the time."
            },
            {
                "paragraph": "“Alright. Since you’re not angry anymore, go and eat some rice. Otherwise, you’ll feel hungry.” Given\nthat Catherine had already asked him, Shaun could not reject her."
            },
            {
                "paragraph": "Anyway, he was not full. Only after he finished a bowl of rice did Catherine bring him, Lucas, and Suzie\nupstairs to take a nap."
            },
            {
                "paragraph": "After Catherine finally put the three of them to sleep, she got changed and headed downstairs. Hadley\ncame to pick her up, and they headed to the funeral parlor."
            },
            {
                "paragraph": "Hadley asked the person in charge of the parlor for directions before they walked over."
            },
            {
                "paragraph": "As soon as they arrived at the door, they heard Sally and Jeffery weeping inside."
            },
            {
                "paragraph": "“Rebecca, how miserable that you lost your life just like that. How pathetic! ” Rebecca was her only\ndaughter, and Sally wept bitterly. She used to hate Rebecca for running away and leaving her and\nJeffery in jail. Even so, Rebecca still got them out of jail and allowed them to live luxurious lives."
            },
            {
                "paragraph": "Jeffery was smoking at one side. His reddened eyes were filled with hatred."
            },
            {
                "paragraph": "His daughter was gone just like that."
            },
            {
                "paragraph": "“Why are they here? Hadley was shocked. “Are we still going to enter?”"
            },
            {
                "paragraph": "Catherine narrowed her eyes. Before she could speak, Jeffery spotted her."
            },
            {
                "paragraph": "“Catherine Jones, how dare you come here?! ” Jeffery’s blood was boiling from rage at the sight of her."
            },
            {
                "paragraph": "He strode toward her and was about to hit her. However, Hadley was quick enough to block Catherine."
            },
            {
                "paragraph": "Jeffery stopped walking at once. After all, he was no match for the young and tall Hadley, considering\nthat he was in his 5os and had been in jail for a long time."
            },
            {
                "paragraph": "Unlike Jeffery, Sally had lost her sanity. She did not care that she was no match for Hadley. She\ndashed toward Catherine like a madwoman in an attempt to hit and bite her."
            },
            {
                "paragraph": "“Catherine Jones, you’ll be cursed with a horrible death! The biggest regret in my life is that I didn’t\ndrown you to death when you were young, you brute!”"
            },
            {
                "paragraph": "“Let go of me.” After Sally scratched him a few times, Hadley pushed her away impatiently."
            },
            {
                "paragraph": "Sally got up and intended to fight him again, but Catherine pushed Hadley away. She walked up to\nSally and slapped each side of her cheeks."
            },
            {
                "paragraph": "Sally’s face instantly swelled up as her head buzzed."
            },
            {
                "paragraph": "Initially, Sally wished to kill Catherine so badly. However, it frightened her when she met Catherine’s icy\neyes."
            },
            {
                "paragraph": "Afraid that Catherine would slap her again, Sally stopped moving forward. Nevertheless, she continued\nto criticize, “ I’ve put so much effort in raising you. How dare you slap me? Karma will get back at you.”"
            }
        ]
    },
    {
        "title": "Chapter 1659 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "“Karma?”"
            },
            {
                "paragraph": "Catherine scoffed. “If karma were to get back at someone, it should come for the two of you first. You\nkilled your own mother. You then falsified the issue as you didn’t dare acknowledge your biological\ndaughter for the sake of personal gain and wealth. It seems like you both didn’t learn from your\nmistakes when you were in jail. Instead, you both grew bolder.”"
            },
            {
                "paragraph": "Jeffery turned crimson. Although Catherine’s words were humiliating… he had gone too far to turn back\nnow."
            },
            {
                "paragraph": "“Enough. Stop bullsh*tting. What do you mean when you said I didn’t dare acknowledge my biological\ndaughter? You’re my biological daughter. Also, I didn’t kill my mother. Look, the police have released\nus.”"
            },
            {
                "paragraph": "Catherine shifted her eyes to him in frustration. “ When I visited you in jail before this, I thought you\nwere remorseful for what you did. I didn’t expect— ”"
            },
            {
                "paragraph": "“We’re telling the truth, ” Sally interrupted her in agitation and burst into tears. “You’re so heartless!\nWe’re your biological parents, yet you don’t acknowledge us. Yes, we’re not as rich as Sheryl and Joel,\nbut you shouldn’t deny your relationship with us for the sake of wealth. What’s worse, you killed your\ncousin! How vicious of you.”"
            },
            {
                "paragraph": "“Really? I didn’t know that the two of you are my biological parents.”"
            },
            {
                "paragraph": "Catherine said tauntingly, “But why did you both claim that Rebecca was your daughter in Melbourne\nthree years ago? You both even forced me to leave my boyfriend so that Rebecca could have him."
            },
            {
                "paragraph": "Although I had worked hard in Summit for so many years, you drove me out and even locked me in a\ndark house where you fed me stale food and let me starve. I had to suffer from the cold. You both\ntreated me really well, huh?”"
            },
            {
                "paragraph": "Stung by her mockery, Sally choked. However, Jeffery said shamelessly, “We did it because you\nrefused to listen to us. We just wanted to nurture you well.”"
            },
            {
                "paragraph": "Upon hearing their words, Catherine was speechless and so was Hadley."
            },
            {
                "paragraph": "Indeed, Jeffery and Sally proved to be Rebecca’s parents."
            },
            {
                "paragraph": "“In that case, let’s have a DNA test.” Catherine raised her brows. “If the two of you turn out to be my\nbiological parents, I’ll certainly respect and care for you both in the future.”"
            },
            {
                "paragraph": "“Get lost. Everyone knows that you have broad connections in Canberra. It won’t be surprising if you\nget people to tamper with the test results!” Sally shouted."
            },
            {
                "paragraph": "“Well…”"
            },
            {
                "paragraph": "Catherine nodded seriously. “Dad, Mom, since you both are my biological parents, you should stop\nlooking down on me. By the way, since Rebecca is dead, unmarried, and childless, her shares in Hill\nCorporation will probably go to both of you. But both of you are already so old now and have no idea\nhow to manage the shares. Since I’m your only daughter, I’ll help you manage Hill Corporation and be\nfilial to you both.”"
            },
            {
                "paragraph": "She changed her words so quickly that the two of them and even Hadley were stunned."
            },
            {
                "paragraph": "After coming to her senses, Sally told Catherine off, “Dream on! That’s what Rebecca left for us. It has\nnothing to do with you.”"
            },
            {
                "paragraph": "“Dad, Mom, you’re going too far. Am I not your only biological daughter?” Catherine showed an\ninnocent look."
            },
            {
                "paragraph": "“Rebecca has been wandering outside since young and she’s not your biological daughter. The three of\nus should be united as a family.”"
            },
            {
                "paragraph": "“Dream on!”"
            },
            {
                "paragraph": "Sally found those words disgusting."
            },
            {
                "paragraph": "Of course, Catherine was not her biological daughter, but Sally could not state it explicitly. If Catherine\nwas recording their conversation and used the recording to provoke Sheryl, she would be in trouble."
            },
            {
                "paragraph": "Catherine was unpredictable."
            },
            {
                "paragraph": "“Dad, Mom, you’re too cruel to me. I really doubt whether I’m your biological daughter. ” A sarcastic\nlook washed over Catherine’s face."
            },
            {
                "paragraph": "“Of course, you are.” Jeffery sneered. “But we definitely won’t give you anything that belongs to\nRebecca.” “Since the two of you are insistent that I’m your biological daughter but are cursing me to die\nhorribly, I’ve decided to respect you both so that I can be a filial daughter. ” Catherine sighed. “Don’t\nworry, as your biological daughter, I’ll manage Hill Corporation well on behalf of you both.”"
            }
        ]
    },



    {
        "title": "Chapter 1660 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "Once Catherine finished speaking, she drew her phone out from her pocket and ended the recording in\nfront of them. With a grin, she said, “Don’t worry, I have this as proof now. If the two of you pass away,\nI’ll sort out the affairs regarding your passing. If Rebecca’s shares are transferred to you both, I’ll also\nmanage Hill Corporation well.”"
            },
            {
                "paragraph": "An eerie silence descended on the parlor for some time. Jeffery and Sally’s faces contorted with rage."
            },
            {
                "paragraph": "“Over my dead body, Catherine Jones!” Sally lost her temper. She felt as though she had shot herself\nin the foot. “If anything happens to us, it’ll be your fault.”"
            },
            {
                "paragraph": "“Don’t take me for an evil person, okay?”"
            },
            {
                "paragraph": "Catherine shrugged innocently. “Now that I’m here, I’ll go and visit Rebecca. After all, we’re sisters. I\ndidn’t know she’d die so early. What a blessing.”"
            },
            {
                "paragraph": "Hadley was at a loss for words."
            },
            {
                "paragraph": "He wondered if his ears were deceiving him."
            },
            {
                "paragraph": "“Shut… your mouth…” Unable to tolerate Catherine’s behavior, Jeffery tried to slap her on the face."
            },
            {
                "paragraph": "“Dad, what are you doing?” Catherine grabbed hold of his wrist."
            },
            {
                "paragraph": "However, Jeffery could not break free from her grasp even after some time."
            },
            {
                "paragraph": "Catherine sighed. “I’m just stating the facts. Rebecca did so many terrible deeds in her life. We don’t\nknow how many men she slept with and how many people she hurt and deceived. It’s great that she\ndied just like that. I thought she’d be savagely tortured before she was dead. She was close to"
            },
            {
                "paragraph": "spending over ten years living a miserable life in jail only to end up killing herself. In this case, am I\nwrong to say that she was blessed?”"
            },
            {
                "paragraph": "“You’re the one who did so many terrible deeds! Don’t think that we don’t know that you instructed\nsomeone to push Rebecca down. ” Sally ran up to her with a ferocious look."
            },
            {
                "paragraph": "Hadley blocked Sally to keep her from approaching Catherine."
            },
            {
                "paragraph": "After letting go of Jeffery, Catherine walked to the corpse and lifted the cloth right away."
            },
            {
                "paragraph": "“Stop it.” Jeffery and Sally’s eyes reddened. Watching their only daughter be humiliated after her death\nmade them anxious."
            },
            {
                "paragraph": "“Calm down, I won’t destroy her corpse. I just want to check if it’s Rebecca, lest she’s faking her death\nlike what she did back then.”"
            },
            {
                "paragraph": "Catherine wore a pair of gloves and forcefully pinched Rebecca’s face to make sure it was not a mask.\nAfter that, she checked her injuries and saw that the back of her head was indeed broken. It was the\nfuneral worker who stitched her head."
            },
            {
                "paragraph": "Catherine was convinced that Rebecca had really died now."
            },
            {
                "paragraph": "However, as she said, it was a blessing that Rebecca died this way."
            },
            {
                "paragraph": "After Catherine finished checking the corpse, she took off the gloves and tossed them onto Sally’s face.\nA radiant smile spread across her face. “Mom, she’s really dead. Both of you should accompany her.\nI’m not going to bother you both further.”"
            },
            {
                "paragraph": "“Go… Go to hell! Just wait. We’ll take revenge against you on Rebecca’s behalf.” Sally went mad. She\nwished she could kill catherine there and then. Unfortunately, Hadley was still blocking her."
            },
            {
                "paragraph": "“Mom, is it necessary to go that far? I’m your biological daughter but Rebecca isn’t. Why are you mad\nbecause of someone insignificant?” Catherine grinned and acted as though she was forgiving. “\nHadley, please stay here and accompany my parents. Bring them to the apartment under my name\nafter the funeral and serve them well.”"
            },
            {
                "paragraph": "With that, she left elegantly."
            }
        ]
    },
    {
        "title": "Chapter 1661 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "As Hadley watched Catherine leave, his eyes were full of admiration for her."
            },
            {
                "paragraph": "Jeffery and Sally could go ahead and take the shares of Hill Corporation that Rebecca owned."
            },
            {
                "paragraph": "Since they claimed that Catherine was their biological daughter, there was nothing wrong if she were to\nmanage Hill Corporation on their behalf."
            },
            {
                "paragraph": "“She can dream on! Hill Corporation is ours! She can’t have it! Go away!” Sally was so exasperated\nthat her chest nearly ached. She shot a disapproving look at Hadley."
            },
            {
                "paragraph": "Hadley clicked his tongue and could not be bothered to argue with her."
            },
            {
                "paragraph": "Some people would never understand what shame was."
            },
            {
                "paragraph": "Hill Corporation was theirs?"
            },
            {
                "paragraph": "How shameless of her to say that. If Rebecca had not impersonated Sheryl’s daughter and acquired\nHill Corporation by force, Hill Corporation would have made a breakthrough in another industry under\nShaun’s leadership by now."
            },
            {
                "paragraph": "A few years ago, Jeffery and Sally were so insignificant that destroying them was just as easy a s\nsquashing an ant."
            },
            {
                "paragraph": "Apparently, almost every Tom, Dick, and Harry could clamor for anything."
            },
            {
                "paragraph": "“I’m sorry but I can’t go away. Given that the two of you are Miss Jones’ parents, I have to protect you\nboth,” Hadley replied with a smile like Catherine did. After he finished speaking, he stood at the door of\nthe parlor and waited for them."
            },
            {
                "paragraph": "Sally was dissatisfied. Jeffery then dragged her over. “It’s alright. Let’s quickly settle this for Rebecca.”"
            },
            {
                "paragraph": "“How can we settle it? Sheryl isn’t here.” Sally stomped her feet. “We should let her see how miserable\nher daughter is and ask her to take revenge.”"
            },
            {
                "paragraph": "“She’s not contactable by phone, probably because Titus is keeping an eye on her. Who knows when\nwe can reach her? We can’t possibly leave Rebecca’s corpse here. What if it stinks…” With red eyes,\nJeffery could not bring himself to continue."
            },
            {
                "paragraph": "Sally’s eyes reddened, but thinking of Wesley’s plan that would benefit her, she gnashed her teeth. “\nLet’s preserve it first. Only when Sheryl sees Rebecca’s body will she be triggered. When that\nhappens, Sheryl and Catherine will cut each other’s throats, whereas we can sit back and have Hill\nCorporation all to ourselves.”"
            },
            {
                "paragraph": "“ Sit back?” Jeffery disagreed with her. “Wesley is eyeing Hill Corporation as well. We’re just his\npuppets.”"
            },
            {
                "paragraph": "“So what if he treats us like a puppet? Now that Rebecca is gone, everything will come to us. As\nWesley said, he’ll do the work and we’ll receive billions of dollars from him every year without having to\ncare about anything. That amount is merely a drop in the bucket to him, but it’s more than sufficient for\nus to live our lives. I’ve never had so much money in my life.”"
            },
            {
                "paragraph": "Sally persuaded him, saying, “What’s more, we can’t turn back now. If it’s exposed that Rebecca was\nimpersonating Catherine, Titus won’t let us off the hook. Catherine won’t either.”"
            },
            {
                "paragraph": "Jeffery was convinced and changed his mind. With a sigh, he nodded. From the moment he promised\nWesley and Rebecca to deceive Titus and Sheryl, he could not turn back anymore."
            },
            {
                "paragraph": "He was left with no choice. Who would want to be jailed forever? Now that he was old, going to jail\nwould be torture."
            },
            {
                "paragraph": "“Alright, then. I’ll let the person in charge of the parlor know about it.”"
            },
            {
                "paragraph": "Jeffery nodded. Just as he arrived at the door, more than ten people barged in all of a sudden. These\nfierce people were wearing face masks and holding batons."
            },
            {
                "paragraph": "Jeffery’s legs turned to jelly."
            },
            {
                "paragraph": "Those people shoved him to the ground and even stepped on his body to enter the hall. Then, they\nsmashed everything in the hall."
            },
            {
                "paragraph": "“What are you guys doing?” Seeing these people lift the cloth to toss Rebecca’s corpse, Sally anxiously\nwent forward to stop them."
            },
            {
                "paragraph": "“Get lost.” A man pushed Sally roughly to the floor and kicked her in the chest."
            },
            {
                "paragraph": "“Help! It hurts so badly! ” The pain caused Sally’s tears to flow down. Without a moment’s hesitation,\nshe asked Hadley for help. “Didn’t Catherine ask you to protect us? Hurry up and save us.”"
            },
            {
                "paragraph": "Hadley was stunned by the incident that happened so abruptly."
            }
        ]
    },
    {
        "title": "Chapter 1662 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "Was it Catherine who got these people to come here?"
            },
            {
                "paragraph": "It did not seem to be her doing. No matter how much she hated Rebecca, Catherine would not stoop so\nlow as to disrespect her dead body."
            },
            {
                "paragraph": "Hadley was still glad to witness this incident and was not bothered about who would end up being\nkilled. Nevertheless, he felt the need to act as though he was trying to save the situation."
            },
            {
                "paragraph": "“Hey, who are you guys? This parlor isn’t a place for you guys to mess around. I’ve already called the\npolice,” Hadley said menacingly as he walked in. He covered his face with his hands while acting\nfearless. However, he was not planning to get involved at all."
            },
            {
                "paragraph": "“Get lost. Don’t be a busybody.” A few tall men blocked him."
            },
            {
                "paragraph": "At that moment, Hadley did not dare move forward anymore."
            },
            {
                "paragraph": "After smashing things for a few minutes, those people left arrogantly."
            },
            {
                "paragraph": "They had tossed Rebecca’s corpse directly at Sally. The wound on the back of her head that had been\nstitched split apart once more."
            },
            {
                "paragraph": "The sight of it made Hadley’s blood curdle."
            },
            {
                "paragraph": "Before he could scream, Sally screamed in terror first despite being Rebecca’s mother. After she was\npushed to the floor, her tailbone broke, which explained why she struggled for a long time to get up.\nAmid her tears, she could only howl. “H-Hurry up and take her corpse away. It’s creepy.”"
            },
            {
                "paragraph": "Jeffery was not doing any better. Having been in jail for several years, he had become much feebler."
            },
            {
                "paragraph": "When he was shoved to the floor and stepped on, he almost could not breathe. At this moment, he\ncould only wait for the ambulance to come."
            },
            {
                "paragraph": "Looking at Jeffery and Sally, Hadley felt speechless. They were really two of a kind."
            },
            {
                "paragraph": "Meanwhile, Catherine received a call from Hadley right after she parked her car at the manor."
            },
            {
                "paragraph": "“Miss Jones, some people barged into the hall and smashed everything inside just now. Even\nRebecca’s corpse has been ruined. Jeffery and Sally"
            },
            {
                "paragraph": "got a fright and they suffered minor injuries. I called an ambulance and they’ve been sent to the\nhospital.”"
            },
            {
                "paragraph": "Catherine gasped and asked, “Who did it?”"
            },
            {
                "paragraph": "Hadley coughed before he asked with a low voice, “ Wasn’t it your doing?”"
            },
            {
                "paragraph": "“How could I possibly have done such a thing? I did have an urge to do it, though, ” Catherine said\nhonestly, “It seems that Rebecca had offended"
            },
            {
                "paragraph": "quite a lot of people when she was alive.”"
            },
            {
                "paragraph": "“Judging from her family’s attitude, they’ve surely offended a lot of people.” Hadley scoffed. “But on\ntheir way to the hospital, Jeffery and Sally kept criticizing you and claimed that it was your doing. I’m\nguessing the police will call you for interrogation.”"
            },
            {
                "paragraph": "“Let them criticize all they want. Anyway, I have a clear conscience. The police won’t be able to charge\nme.”"
            },
            {
                "paragraph": "After Catherine finished speaking, she paused for a moment. “Having said that, I need to visit them in\nthe hospital to express my concern for them.”"
            },
            {
                "paragraph": "Hadley was at a loss for words."
            },
            {
                "paragraph": "‘Have you gotten too carried away in your role as a loving daughter?’"
            },
            {
                "paragraph": "“Wait there. I’ll come over once I settle their medical fees. ” After hanging up, Catherine started the car.\nSuddenly, she saw a silhouette dashing toward her."
            },
            {
                "paragraph": "A sense of unease instantly overwhelmed her."
            },
            {
                "paragraph": "Nevertheless, she lowered the window and smiled a t Shaun."
            },
            {
                "paragraph": "“Cathy, you’re back.” Shaun gazed at her in an aggrieved manner. “You’re such a liar. When I woke up,\nyou weren’t around. I’m sad that you always leave me behind.”"
            }
        ]
    },
    {
        "title": "Chapter 1663 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "Looking at Shaun’s handsome face, Catherine was too hesitant to tell him that she was about to go out\nagain."
            },
            {
                "paragraph": "“Come down and play with me.” Shaun extended his hand to pull her through the window."
            },
            {
                "paragraph": "“Uh… Shaunny, I just received a call and I have to go out again, ” Catherine said reluctantly, “ It’s quite\nimportant.”"
            },
            {
                "paragraph": "Against all her expectations, Shaun did not kick up a fuss. He just blinked his eyes in despair. “More\nimportant than me?”"
            },
            {
                "paragraph": "His voice was hoarse, and his eyes were red. It felt as though he would be in tears if Catherine said\nyes."
            },
            {
                "paragraph": "Speechless, Catherine replied with a gentle tone, “Of course, you’re more important, but I can’t stay by\nyour side all the time. Look, there are so many people in our family. I need to make money to support\nour family and also buy sweets for you.”"
            },
            {
                "paragraph": "“You can ask for money from my mommy. She gave"
            },
            {
                "paragraph": "birth to me, so it’s right to spend her money. I don’t want to spend your money,” Shaun said seriously\nafter some thought."
            },
            {
                "paragraph": "Deep down, Catherine took pity on Lea. Feeling amused, she responded, “But I need to make money\nto pay for Lucas and Suzie’s school fees.”"
            },
            {
                "paragraph": "“You can ask their daddy to pay. ” Shaun snorted. “ Why must you shoulder the burden alone?”"
            },
            {
                "paragraph": "Catherine choked."
            },
            {
                "paragraph": "‘Dude, you’re Suzie and Lucas’s daddy.’"
            },
            {
                "paragraph": "Speaking of this, how did he learn that parents had to share their responsibilities together when she\nhad only been away for a while?"
            },
            {
                "paragraph": "“Where did you learn this from?” Catherine was baffled as she remembered that she did not teach him\nthis."
            },
            {
                "paragraph": "“I learned it from the TV when I watched it with Granny just now.”"
            },
            {
                "paragraph": "Catherine rubbed her forehead."
            },
            {
                "paragraph": "Old Madam Hill was watching those campy family dramas that had no substance again. She first led\nSuzie astray, and now, Shaun was affected as well."
            },
            {
                "paragraph": "“Their daddy… was injured due to an issue, so he can’t share the burden, ” Catherine explained\ntactfully."
            },
            {
                "paragraph": "Shaun blinked and gazed at her for a while before he said softly, “Cathy, you’re really pathetic. You\nmarried such a terrible husband.”"
            },
            {
                "paragraph": "Catherine was speechless."
            },
            {
                "paragraph": "‘I really hope you’ll still remember what you just said when your memory is restored.’"
            },
            {
                "paragraph": "“Anyway, I need to make money even if it isn’t for the kids. Women need to spend money on personal\ncare products, clothes, and many other things,” Catherine said, “Don’t tell your mom to give me money."
            },
            {
                "paragraph": "It’s okay for her to support you, but it’s unreasonable for her to support me because we’re not related\nby blood.”"
            },
            {
                "paragraph": "Her words left Shaun feeling stunned. “Then… Let me support you, but I don’t know how to make\nmoney. Well, I can tag along and learn how to make money like you.”"
            },
            {
                "paragraph": "Once he finished speaking, he opened the car door and got in. “Bring me along. From today onward, I\nwant to learn how to make money and support you.”"
            },
            {
                "paragraph": "Catherine was touched, but she felt like crying at the same time."
            },
            {
                "paragraph": "She was not going to work. She was going to look for Jeffery and Sally to add insult to injury."
            },
            {
                "paragraph": "Since Shaun had gotten in the car, she could not bring herself to kick him out. Hence, she said, “ Later,\nyou have to follow what I say, okay?”"
            },
            {
                "paragraph": "“Mm. I’ll listen to you.” Shaun placed his hands on his lap, acting like a good kid."
            },
            {
                "paragraph": "A smile crossed Catherine’s face. She approached him to put on the safety belt for him."
            },
            {
                "paragraph": "When the scent of her hair happened to waft past the tip of his nose, his heart raced madly."
            }
        ]
    },
    {
        "title": "Chapter 1664 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "When Shaun lowered his head, Catherine retreated a little with her profile facing him. There were two\nstrands of curly hair framing her fair cheeks, and he had a clear view of her elegantly thin neck as well."
            },
            {
                "paragraph": "All of a sudden, he found his mouth slightly dry. He was tempted to bury his head in her neck and kiss\nit."
            },
            {
                "paragraph": "“I’ve fastened it. ” Catherine looked up out of the blue."
            },
            {
                "paragraph": "When their eyes met, his gaze was burning fiercely."
            },
            {
                "paragraph": "Catherine was stunned for a moment before she poked his thin lips amusedly. “Tell me, what were you\nthinking just now?”"
            },
            {
                "paragraph": "Upset, Shaun bit his lip. He was rather embarrassed, but he answered her honestly, “I wanted to kiss\nyour neck.”"
            },
            {
                "paragraph": "Catherine’s face instantly turned crimson as she did not expect him to be so frank."
            },
            {
                "paragraph": "“Why did you have such a thought? I was just"
            },
            {
                "paragraph": "fastening the seat belt for you, yet you started to overthink it.” She stared at him with coquettish eyes,\nwhich made his heart tickle."
            },
            {
                "paragraph": "Shaun gulped and fixed his eyes on her."
            },
            {
                "paragraph": "Catherine rubbed her head. “I’m in a rush now. I’ll accompany you tonight.”"
            },
            {
                "paragraph": "“Oh.” Shaun was confused even though he was unsure of what she actually meant by ‘accompany’.\nAnyway, he was glad that she would accompany him."
            },
            {
                "paragraph": "40 minutes later, the car arrived at the car park of the hospital."
            },
            {
                "paragraph": "Catherine brought Shaun to take the elevator while holding his hand. When she arrived at the ward that\nHadley had told her, she happened to spot a few police officers inside."
            },
            {
                "paragraph": "Sally was accusing Catherine amid her tears. “It must be Catherine, that wicked woman, who did it. No\none would do such a thing except her. She hates us. She said that once we’re dead, our assets will be\nhers.”"
            },
            {
                "paragraph": "“Yeah. It’s her doing. Go and investigate it right now. She must have hired people to do it.” Jeffery went\nalong with what Sally said."
            },
            {
                "paragraph": "As soon as he finished speaking, Catherine dashed in with reddened eyes."
            },
            {
                "paragraph": "“Dad, Mom, are you both okay? I got a fright when I learned that something happened to you both.”\nCatherine looked extremely anxious."
            },
            {
                "paragraph": "The police officers were stunned. Sally was so exasperated that she wanted to sit up. Nevertheless,\nthe second she moved, her tailbone hurt very badly. “Catherine Jones, how dare you come?! Officer, it\nwas her doing. Hurry up and arrest her! ”"
            },
            {
                "paragraph": "The police officers were baffled. “ I heard her call you ‘Dad’ and ‘Mom’.”"
            },
            {
                "paragraph": "“I… I don’t acknowledge her as my daughter.” Sally nearly let out that Catherine was not her daughter."
            },
            {
                "paragraph": "“Dad, Mom, it’s good that both of you are fine.” Catherine sighed gloomily before she turned around\nand said to a police officer, “Officer, please find out who hurt my parents. Seeing the state they’re in\nnow really breaks my heart.”"
            },
            {
                "paragraph": "The police officer’s mouth twitched. “But they’re claiming that you did this.”"
            },
            {
                "paragraph": "“Me?” Catherine was dumbfounded. “They’re my biological parents. How could I possibly have done\nsuch a crazy thing?”"
            },
            {
                "paragraph": "“You’re crazy! ” Sally roared."
            },
            {
                "paragraph": "“My parents have always disliked me.” A glum look washed over Catherine’s pretty face. “They dislike\nthe fact that I’m a girl. They kicked me out of the family long ago. When I paid my respects to my\ncousin today, they chased me out of the funeral parlor. The person who called the police is my\nassistant. I asked him to wait for my parents in the parlor and send them home afterward. Who knew\nthey would encounter that kind of incident?”"
            },
            {
                "paragraph": "Hadley immediately said, “Yes. She asked me to stay there. I wanted to help out, but there were too\nmany people.”"
            },
            {
                "paragraph": "The police officer knew Hadley. After watching the video of the scene, the police officer was convinced."
            },
            {
                "paragraph": "“In this modern era, both of you still have such outdated attitudes, huh?” The police officer glared at\nJeffery and Sally."
            },
            {
                "paragraph": "Sally was livid. “No, we don’t. Clearly, it’s…”"
            }
        ]
    },
    {
        "title": "Chapter 1665 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "“By the way, officer, my cousin offended quite a lot of people previously…” Catherine interrupted Sally.\nThen, she bit her tongue before she continued."
            },
            {
                "paragraph": "Sally was filled with resentment. “The cruelest person she ever offended is you.”"
            },
            {
                "paragraph": "“Mom…” Catherine’s eyes were red. “Am I your biological daughter or is it Rebecca? Dad and you\nwere injured when you mourned for Rebecca in the hall, so I just want to find out who attacked you. But\nwhy do you keep turning against me?”"
            },
            {
                "paragraph": "“How can you compare yourself to Rebecca?"
            },
            {
                "paragraph": "Rebecca got your dad and me out of jail, yet you were the one who sent us to jail, ” Sally responded in\na huff."
            },
            {
                "paragraph": "Catherine said righteously, “Would I have done so if you both hadn’t killed Granny? Granny had treated\nme well since I was young. Between justice and kinship, I had no choice but to pick the former.”"
            },
            {
                "paragraph": "“They killed your granny?” The police officer’s eyes became sharp. Her granny was her injured father’s\nbiological mother, was she not?"
            },
            {
                "paragraph": "Since he could sink so low as to kill his own mother, was he even human?"
            },
            {
                "paragraph": "The police officer’s eyes became hostile when he looked at Jeffery."
            },
            {
                "paragraph": "“I didn’t.” Jeffery denied it anxiously. “Someone framed me.”"
            },
            {
                "paragraph": "“Fine, keep on saying that. Anyway, that case was settled three years ago. I have no idea how\nRebecca got both of you out. It doesn’t matter as long as you both have a clear conscience.” A forced"
            },
            {
                "paragraph": "smile flashed across Catherine’s face."
            },
            {
                "paragraph": "“Enough.” The police officer pulled a long face, refusing to listen anymore. “I’ll investigate the incident\nthat took place at the parlor, but I might not be able to track down the mastermind behind it.”"
            },
            {
                "paragraph": "The police officer’s indifference made Sally’s blood boil. “As a police officer, you’re responsible for the\ninvestigation. What do you mean you might not be able to track down the mastermind? You have to\nfind out who did it. We can’t be injured for nothing.”"
            },
            {
                "paragraph": "“We’re police officers, but it doesn’t mean we can solve every case. We have hundreds of old cases\npiling up in the police station every year.” The police officer left once he was done speaking."
            },
            {
                "paragraph": "Facing a woman who could bring herself to kill her mother-in-law, he was sorely tempted to slap her."
            },
            {
                "paragraph": "“Stop right there…” Seeing the police leave just like that, Sally furiously grabbed the cup on the table to\nhurl it at Catherine. “Brute… Ouch, it hurts… It hurts.”"
            },
            {
                "paragraph": "Soon after she hurled the cup, her waist hurt so badly that she fell onto the bed."
            },
            {
                "paragraph": "“What are you doing?” Upon noticing that the cup almost hit Catherine, Shaun went in front of\nCatherine in exasperation and glowered at that damn woman."
            },
            {
                "paragraph": "He was tall and sturdy. When he lost his temper, there was a brooding look in his eyes."
            },
            {
                "paragraph": "Sally was so frightened that her heart clenched. “ What… What are you planning to do? There are\nsurveillance cameras in the hospital!”"
            },
            {
                "paragraph": "“Mom, I’m not planning to do anything to you. ” Catherine held Shaun’s hand. With a smile, she said,\n“Don’t worry, if I receive any news from the police, I’ll inform both of you right away.”"
            },
            {
                "paragraph": "“Don’t trouble yourself. I’ll handle their affairs.”"
            },
            {
                "paragraph": "A familiar, gentle voice rang behind Catherine all of a sudden."
            },
            {
                "paragraph": "However, the voice made Catherine’s blood curdle a s though a snake was gliding across her body."
            },
            {
                "paragraph": "She turned around, only to meet Wesley’s smiling eyes."
            },
            {
                "paragraph": "“Wifey, you’re here to visit Dad and Mom as well.”"
            }
        ]
    },
    {
        "title": "Chapter 1666 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "Catherine shuddered and had goosebumps."
            },
            {
                "paragraph": "Shaun knitted his dark eyebrows at the man in front of him who was slightly shorter than him. The man\nwas dressed in a black suit and was quite good- looking. However, he subconsciously disliked him."
            },
            {
                "paragraph": "Shaun found the man particularly loathsome especially when he addressed Catherine as ‘Wifey’."
            },
            {
                "paragraph": "“Cathy, who is he?” Shaun asked in a childish manner while tugging on Catherine’s hand."
            },
            {
                "paragraph": "After Wesley glanced at Shaun’s childish eyes, his elegant face flashed with disdain. “I’m her husband.”"
            },
            {
                "paragraph": "Shaun blinked his eyes. “What’s a husband?”"
            },
            {
                "paragraph": "Wesley cackled, and he was clearly taunting Shaun with his gaze. “I heard that you’ve become a fool.\nNow that I’ve seen you, I’m convinced.”"
            },
            {
                "paragraph": "“Who’s become a fool? You’re the fool. ” No matter how stupid Shaun was, he knew that Wesley’s\nremark was awful, so he jeered at him furiously. “ You ugly man.”"
            },
            {
                "paragraph": "After pausing for a moment, he recalled the sentence that he heard on TV this afternoon. He added,\n“Ugly people always trouble others.”"
            },
            {
                "paragraph": "“Haha.”"
            },
            {
                "paragraph": "Catherine could not suppress her laughter. She was disgusted by Wesley’s words at first, but now, the\nfeeling had mostly vanished thanks to Shaun."
            },
            {
                "paragraph": "“ Shaunny, he’s not only ugly but also wicked. He always tries to snatch other people’s things by using\ndevious means. He works hard, but it’s only because he wants to please big shots and plot against"
            },
            {
                "paragraph": "others. He has evil intentions.”"
            },
            {
                "paragraph": "Catherine held Shaun’s arm while ridiculing Wesley."
            },
            {
                "paragraph": "Shaun nodded seriously. “I know. He’s a bad guy, right?”"
            },
            {
                "paragraph": "Wesley’s expression turned grim. However, at the sight of Shaun’s silly look, he scoffed. “Cathy, are\nyou really planning to take care of this person forever? I wonder if he takes you for his mom or aunt?”"
            },
            {
                "paragraph": "“Whatever he takes me for, I still find it better than being with you. Wesley Lyons, you can go on\nbehaving haughtily, but let me remind you that you’re taking your life in your hands now. Don’t think that\nyou can do as you please just because you have Gavin defending you. Your deeds will be exposed\nsooner or later.”"
            },
            {
                "paragraph": "Catherine glanced sideways at Jeffery and Sally, who were behind her. “Also, you were the one who\nkilled Rebecca, right? But you probably told them something to tear us apart and make them assume\nthat I did it. When Rebecca’s shares in Hill Corporation are transferred to them, you’ll get to control\nthem and Hill Corporation will end up belonging to you. What a brilliant plan you have.”"
            },
            {
                "paragraph": "“Rebecca has always been with Titus. With the executive council keeping an eye on her, how could I\nhave possibly killed her?” Wesley expressed a righteous look. “But as for you, Freya is your friend and\nyou’re quite close to Rodney. Killing Rebecca would be as easy as squashing an insect for you."
            },
            {
                "paragraph": "You’ve long hated her and hoped for her to die. Now that Rebecca is dead, I believe you’re going to\ndeal with Jeffery and Sally next. You were the one who instructed those thugs to cause trouble in the\nfuneral parlor, right?”"
            },
            {
                "paragraph": "His words made Jeffery and Sally’s blood curdle."
            },
            {
                "paragraph": "“President Lyons, you need to save us. Get someone to protect us. I’m sure she wants to kill us,” Sally\nsaid imploringly."
            },
            {
                "paragraph": "“Don’t worry. As your son-in-law, I’ll definitely save you both.” Wesley clapped his hands."
            },
            {
                "paragraph": "Subsequently, a group of people appeared at the door of the ward. “ I’ve chosen these bodyguards\ncarefully. With them around, no one can approach you both.”"
            },
            {
                "paragraph": "“Thank you.” Jeffery nodded before glaring at Catherine impassively, “Get lost right now.”"
            },
            {
                "paragraph": "“Son-in-law?” Catherine laughed playfully. “ You’re really shameless. Anyway, at least I’ve figured out\nwhat your plans are. Let’s go.”"
            },
            {
                "paragraph": "She dragged Shaun away and left."
            },
            {
                "paragraph": "Hadley immediately tagged along. “Miss Jones, should I continue staying here?”"
            },
            {
                "paragraph": "“What’s the point of staying here? Wesley is here now. Don’t worry, I never planned on making you stay\nhere for long. I knew Wesley would keep Jeffery and Sally from taking my side. ” Catherine looked\ncalm."
            }
        ]
    },
    {
        "title": "Chapter 1667 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "“But you…”"
            },
            {
                "paragraph": "“I just wanted to annoy them and confront Wesley,” Catherine explained, “I had to figure out Wesley’s\nmotive. As you saw just now, he called himself their son-in-law. He’s probably not planning to treat\nJeffery and Sally as puppets. In my view, he wants to step into Hill Corporation using his identity as\ntheir son-in-law. Jeffery will probably be the chairman of Hill Corporation, and Wesley will then become\nthe president or something.”"
            },
            {
                "paragraph": "Hadley was shocked to his core. “Young Master Hill put a lot of blood, sweat, and tears into Hill\nCorporation. But it’ll end up benefiting Wesley in the end?”"
            },
            {
                "paragraph": "“Don’t worry. If Wesley wants to be their son-in- law, it means that I have to be Jeffery’s daughter. It’s\nmore legitimate for me to manage Hill Corporation than him.”"
            },
            {
                "paragraph": "Catherine snorted. This behavior was just despicable, was it not? It was because of Wesley"
            },
            {
                "paragraph": "that she had learned to be despicable."
            },
            {
                "paragraph": "“By the way, head to the police station to have a look. I’m sure Wesley will investigate the matter, but\nI’m afraid he’ll accuse me of doing it. He might be the one who got those people to cause trouble in the\nfuneral parlor. Perhaps he wants to frame me and worsen Jeffery and Sally’s impression of me,”\nCatherine ordered calmly."
            },
            {
                "paragraph": "After Hadley left, Catherine brought Shaun into the car."
            },
            {
                "paragraph": "Shaun was sulky throughout the journey. “Cathy, what does ‘husband’ mean?”"
            },
            {
                "paragraph": "Catherine was stunned as she did not expect him to be dwelling on it."
            },
            {
                "paragraph": "As much as she did not feel like clarifying it to him, she considered that he would find out about it from\nothers eventually."
            },
            {
                "paragraph": "After some thought, she parked the car at the roadside and said earnestly, “Shaunny, I have a\ncomplicated relationship with that man. Husband… refers to a marriage partner. It means we’re a\nmarried couple.”"
            },
            {
                "paragraph": "“What does a married couple mean?” Shaun was confused and nervous. “ Is he more important than\nme?”"
            },
            {
                "paragraph": "“No. No one is more important than you.” Catherine held his hand. “The man you saw just now used to\nbehave very well in front of me. I thought I could count on him for the rest of my life, so I married him.\nAfter getting married to him, I realized that he had a mistress and has always been hypocritical. He’s a\nbad guy. Although he’s always been very nice in front of me, he’s actually so evil that he even beat me\nand killed someone. But we can’t find evidence to prove that he killed someone. I want to divorce him,\nbut he keeps refusing to sign the divorce papers.”"
            },
            {
                "paragraph": "Upon hearing her words, Shaun was muddle- headed. As he still had the mind of a kid, he could not\nunderstand anything related to marriage. He only focused on one thing. “He beat you?”"
            },
            {
                "paragraph": "His expression became particularly grave. “How dare he beat you? Is he looking for death? Let me\nteach him a lesson on your behalf.”"
            },
            {
                "paragraph": "Catherine noticed that the anger in his eyes was quite similar to how he looked when he lost his temper\nback then. After being dazed for a moment, she said softly, “You can teach him a lesson, but you can’t\nact impulsively. If you get caught, I’ll"
            },
            {
                "paragraph": "need to save you. You have to protect yourself first.”"
            },
            {
                "paragraph": "“Oh. I’m really useless. ” Shaun was deeply upset."
            },
            {
                "paragraph": "“No, I think you’re doing great.” Catherine caressed his hair encouragingly. “Shaun, although I’m\nmarried to him, our relationship exists in name only. How I wish I could send him to jail. Actually,\nmarriage is just a formality, but it doesn’t represent my feelings. You’re the person I love, forever and\nalways.”"
            },
            {
                "paragraph": "He might only have the mental age of a two-year- old, but his understanding of things was gradually\nimproving."
            },
            {
                "paragraph": "Catherine did not want to make herself out to be his sister or aunt. Once certain things were set, it\nwould be hard to change his perception of things."
            },
            {
                "paragraph": "It was her intention to make it clear to him that she wanted to be his woman."
            },
            {
                "paragraph": "Shaun was stunned."
            },
            {
                "paragraph": "He raised his head. When he looked into her fiery eyes, he felt a burning sensation in his chest."
            },
            {
                "paragraph": "Although he could not grasp most of the things she had just said, he was fond of her words."
            },
            {
                "paragraph": "“Cathy…”"
            },
            {
                "paragraph": "He murmured as his handsome face flushed with shame. Before he could say anything else, Catherine\nleaned her body over and locked her red lips with his."
            },
            {
                "paragraph": "Shaun’s heart was palpitating. He wrapped his hand around her waist clumsily in response to the kiss."
            },
            {
                "paragraph": "Watching his eyes close and his eyelashes flutter, Catherine had butterflies in her stomach."
            },
            {
                "paragraph": "She felt like a pervert who was bullying an ignorant kid."
            }
        ]
    },
    {
        "title": "Chapter 1668 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "This was how Shaun had always forced a kiss on Catherine. Now, it was her turn to do the same."
            },
            {
                "paragraph": "In fact, this feeling was wonderful."
            },
            {
                "paragraph": "Geraldton."
            },
            {
                "paragraph": "A city situated in the west of Australia."
            },
            {
                "paragraph": "At this moment, Eliza was standing under an oak tree in the quiet courtyard. A yellow leaf fell on her\nhair, and it smelled pleasant."
            },
            {
                "paragraph": "She put her phone beside her ear without realizing it."
            },
            {
                "paragraph": "“Ellie, I’ve settled the matter regarding the funeral parlor. The police won’t be able to track us.”"
            },
            {
                "paragraph": "“Thank you, Tristan,” Eliza said softly as she lifted her hand to pluck a leaf in front of her."
            },
            {
                "paragraph": "“Not at all. But why are you… choosing to deal with a dead person?” Tristan Sinclair could not help but\nask out of curiosity."
            },
            {
                "paragraph": "“Because… she killed my best… friend.” Eliza’s dark eyes were completely indifferent."
            },
            {
                "paragraph": "She had only figured out certain things recently. It turned out that Rebecca impersonated Shelley back\nthen. Shelley found out that Rebecca was impersonating her, which was why Rebecca killed her in the\nfire and accused Charity of doing it."
            },
            {
                "paragraph": "After Charity went to jail, her parents passed away one after the other."
            },
            {
                "paragraph": "As such, she had a deep-seated grudge against Rebecca."
            },
            {
                "paragraph": "She never expected Rebecca to die just like that. Rebecca got off so lightly."
            },
            {
                "paragraph": "Indeed… She got off way too lightly."
            },
            {
                "paragraph": "“I see,” Tristan said. “How’s your injury? When are you heading back to Canberra? You said you want\nto deal with your scummy dad. You don’t need to trick him using your body. I can deal with him straight\naway.”"
            },
            {
                "paragraph": "“No need. Our relationship is a secret.” Eliza ended the call."
            },
            {
                "paragraph": "Her mother, Ruth Yardley, brought out a knitted shirt and put it on her. “You’re wearing such thin"
            },
            {
                "paragraph": "clothes. Don’t catch a cold. “I’m fine.”"
            },
            {
                "paragraph": "Looking at the loving face of the middle-aged woman in front of her, Eliza felt as though something was\nclenching her heart."
            },
            {
                "paragraph": "The woman was the mother of her body’s owner. Her mother, Jennifer, had died long ago."
            },
            {
                "paragraph": "She could take revenge against Rebecca, but the pain in her heart could never be erased."
            },
            {
                "paragraph": "Canberra."
            },
            {
                "paragraph": "Wesley was smoking in the car in front of the police station. Soon, his attorney and assistant got in the\ncar with grave expressions."
            },
            {
                "paragraph": "“President Lyons, the people who smashed things up in the funeral parlor have been arrested. They’re\nmostly hooligans from the streets. The leader is a recidivist who was just released from jail last year."
            },
            {
                "paragraph": "He told the police that Rebecca’s car crashed into his stall back then. She refused to apologize or\ncompensate him, so he got a group of people to mess things up at her funeral in a fit of fury.”"
            },
            {
                "paragraph": "Wesley took a drag of his cigarette and scoffed. “Do you buy that?”"
            },
            {
                "paragraph": "” I don’t, but he refuses to tell the truth. With his motive clearly stated and the incriminating evidence\nagainst him, the police had to charge him.”"
            }
        ]
    },
    {
        "title": "Chapter 1669 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "The attorney said helplessly, “At most, the hooligans will serve one to two years of sentence. They\ndidn’t actually intentionally beat up Jeffery and Sally. They just ran into Jeffery and Sally and stepped\non them when they fell to the floor."
            },
            {
                "paragraph": "They’re apologetic about it and are willing to pay compensation. They’re quite honest.”"
            },
            {
                "paragraph": "Wesley snorted. “Indeed, she didn’t leave a trail.”"
            },
            {
                "paragraph": "“Are you talking about Catherine?” The attorney observed Wesley’s grim expression cautiously."
            },
            {
                "paragraph": "“Is this how you’re supposed to address her?” Wesley glanced at him indifferently."
            },
            {
                "paragraph": "The attorney shuddered and instantly went quiet."
            },
            {
                "paragraph": "Wesley rolled down the window and pulled on the tie in front of his chest. His current status could\nalready compare to Shaun’s previous status."
            },
            {
                "paragraph": "Although he had a bad reputation before this, there were people trying to butter him up now since he\nhad risen to the top. Even those women who were previously afraid of him were ready to shamelessly\nthrow themselves at him."
            },
            {
                "paragraph": "While those women were able to satisfy his physical needs, the only woman he truly loved was… still\nCatherine."
            },
            {
                "paragraph": "With her intelligence, shrewdness, forbearance, slyness, and beauty, she was the most outstanding\nwoman he had ever met."
            },
            {
                "paragraph": "Unfortunately…"
            },
            {
                "paragraph": "She would rather stay by a fool’s side than express her regret."
            },
            {
                "paragraph": "Wesley smiled ferociously in spite of himself."
            },
            {
                "paragraph": "He had made Shaun a fool, and soon, he planned on snatching Hill Corporation away."
            },
            {
                "paragraph": "Back then, Shaun had humiliated him with his identity as the chairman of Hill Corporation."
            },
            {
                "paragraph": "Hah! Wesley would slowly settle the old scores with him."
            },
            {
                "paragraph": "Making Shaun a fool was definitely not the end of his plan. It was just the beginning."
            },
            {
                "paragraph": "At night."
            },
            {
                "paragraph": "After dinner, Catherine sat beside the court in the manor, watching Suzie, Lucas, and Shaun play\nbasketball."
            },
            {
                "paragraph": "Shortly after, Hadley came over. “I heard from the police that it was a hooligan’s doing. The hooligan\nwas just released from jail not long ago and confessed to everything. He claimed that he did it because\nthere was bad blood between Rebecca and him. Jeffery and Sally objected to closing the case as they\ninsisted on having the police investigate you. Even so, the case has been closed since there’s\nconclusive evidence pointing to the hooligan."
            },
            {
                "paragraph": "Catherine was a little surprised. “The case ended so quickly. I thought Wesley would pull some strings\nto have the police interrogate me.”"
            },
            {
                "paragraph": "Hadley laughed. “The police officer who came to the hospital earlier today is actually Chief\nSuperintendent Craig’s son, who’s being trained at the grassroots. After hearing what you said, he went\nback to investigate Jeffery and Sally’s profiles, which led him to have an unfavorable impression of"
            },
            {
                "paragraph": "them. It’s useless even if Wesley tries to pull some strings. Chief Superintendent Craig’s son is the sort\nwho acts impartially.”"
            },
            {
                "paragraph": "“That’s great.” Catherine nodded. “Previously, I was slightly worried that Wesley would frame me. It\nseems like I was overthinking it. I’m quite curious"
            },
            {
                "paragraph": "about who the mastermind behind today’s incident is. I wish to know the person. Perhaps I can befriend\nthem.”"
            },
            {
                "paragraph": "“Who knows? Rebecca has offended too many people. The moment Sheryl acknowledged her as her\ndaughter, Rebecca started to behave arrogantly outside. Too many people hate her.”"
            },
            {
                "paragraph": "Hadley paused for a moment before he continued, “ I just heard that Hill Corporation will be holding a\ngeneral meeting the day after tomorrow, probably because Rebecca is dead. They want to elect\nsomeone to take over her role. After some investigation, I found out that Jeffery and Sally’s names are\nstated on Rebecca’s birth certificate. So technically… she’s still considered to be Jeffery’s daughter.”"
            },
            {
                "paragraph": "Catherine rubbed her brows. She had expected this, which explained why Jeffery and Sally could act\nfearlessly."
            },
            {
                "paragraph": "“Cathy, why are you with him again?”"
            },
            {
                "paragraph": "Shaun suddenly ran toward Catherine and glowered at Hadley with dissatisfaction while holding a\nbasketball. He was wearing a blue jersey. With his crew cut, his sweaty handsome face, and childlike\ngaze, he looked just like a high school student."
            }
        ]
    },
    {
        "title": "Chapter 1670 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "Hadley was embarrassed and did not expect Shaun to be jealous. “I’m reporting the company’s matters\nto Miss Jones. Miss Jones, it’s already late, so I’ll head home first.”"
            },
            {
                "paragraph": "After seeing Hadley leave in a rush, Catherine took the towel beside her and wiped the sweat off\nShaun’s face. “ Shaunny, you have to be polite to Assistant Young. He has done a lot for you and the\nHills.”"
            },
            {
                "paragraph": "“I’m not even close to him. Why is he doing so much for my sake?” Shaun found it baffling."
            },
            {
                "paragraph": "Catherine was at a loss for words. She said to him seriously, “Your last name is Hill. Actually, the Hills\nhave a large company, but the company has been in crisis recently. Assistant Young is a very capable\nperson. Many people have been trying to poach him, but he’s loyal to the Hills. He decided to stay with\nus and assist me. If he leaves, I’ll have a hard time.”"
            },
            {
                "paragraph": "Her words left Shaun feeling stunned."
            },
            {
                "paragraph": "After half a minute, he nodded violently. With a pout, he said glumly, “I didn’t mean that, but you didn’t\nnotice it when I shot a three-pointer just now.”"
            },
            {
                "paragraph": "“Three-pointer?” Catherine was astonished. “ That’s amazing.”"
            },
            {
                "paragraph": "“Yeah. I’m amazing.” Shaun looked up proudly."
            },
            {
                "paragraph": "“Mommy, Shaunny is amazing. ” Suzie ran toward Catherine and grumbled beside her ear, “Didn’t you\nsay that he only has the mental age of a two-year- old? I thought I could bully him, but it turns out that\nhe still plays basketball so well.”"
            },
            {
                "paragraph": "Amused, Catherine poked Suzie’s head. “What a bully you are.”"
            },
            {
                "paragraph": "“No, I’m saying that he bullies me. ” Suzie stamped her feet."
            },
            {
                "paragraph": "“You’re just too lousy.” Shaun glanced at Lucas gloatingly. “Brother Lucas is so-so. He told me earlier\nthat he’d go easy, but he’s not that great. He’s just slightly better than Suzie.”"
            },
            {
                "paragraph": "Lucas, who felt humiliated, was speechless."
            },
            {
                "paragraph": "‘Stop calling me ‘Brother Lucas’. It sounds sarcastic."
            },
            {
                "paragraph": "“I’ll stop now. I’m going to look for Uncle Logan to learn martial arts.” Lucas tossed the ball coolly\nbefore he left."
            },
            {
                "paragraph": "“Learn martial arts? I want to come along too.” Shaun’s eyes lit up. “Once I master martial arts, I’ll be\nable to protect Cathy.”"
            },
            {
                "paragraph": "Half an hour later, Catherine sat at one side and watched Shaun punch Logan. The corners of her\nmouth twitched in agony."
            },
            {
                "paragraph": "“Damn, brother. Please stay away from me. I don’t want to teach you anymore.” Logan felt like weeping\nas Shaun was more skilled than him."
            },
            {
                "paragraph": "Shaun was more of a wrecker than a learner here."
            },
            {
                "paragraph": "Shaun pouted. He ran to Catherine and said, “ Cathy, he’s not that skillful as well. He’s too mediocre to\nteach us. You’d better not let him teach Lucas.”"
            },
            {
                "paragraph": "Catherine was speechless."
            },
            {
                "paragraph": "It was not because Logan was not brilliant but because Shaun was too brilliant."
            },
            {
                "paragraph": "Logan felt so humiliated that his face flushed. “I’ve been to the battleground. Based on my skills, I can\nmake it to the top zo in the world. Even Liona members are no match for me. You’re just f*cking\nbrilliant.”"
            },
            {
                "paragraph": "“Alright, alright. You can slowly teach Lucas.”"
            },
            {
                "paragraph": "Seeing Shaun hold back, Catherine hurriedly dragged him away from trouble."
            },
            {
                "paragraph": "Lucas, who remained there, darted a glance at Logan. Logan snorted and said, “You brat, are you\nplanning to stop learning from me? It’s fine, but you’ll have to see if Shaun can teach you.”"
            },
            {
                "paragraph": "“ .. It’s okay. Let’s carry on.” Lucas looked as if he had surrendered to his fate."
            },
            {
                "paragraph": "Logan was morose that a brat had looked down on him today. In fact, many people had tried to spend a\nlot of money to hire a top master like him."
            }
        ]
    },
    {
        "title": "Chapter 1671 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "Catherine pulled Shaun into the study."
            },
            {
                "paragraph": "Tonight, Shaun had surprised her over and over again."
            },
            {
                "paragraph": "When the doctor previously claimed that he only had the mental age of a two-year-old, she was\noverwhelmed with frustration."
            },
            {
                "paragraph": "However, she did not expect to see the light at the end of the tunnel. Indeed, he did not know many\nthings and was even unable to recognize words."
            },
            {
                "paragraph": "Nevertheless, he could still apply the physical skills he had mastered back then, such as playing\nbasketball and fighting."
            },
            {
                "paragraph": "“Shaunny, please sit down.”"
            },
            {
                "paragraph": "Catherine opened the dictionary on the table. “ From today onward, I’ll help you expand your\nvocabulary, okay?”"
            },
            {
                "paragraph": "“Oh.”"
            },
            {
                "paragraph": "Shaun nodded obediently. After he was seated, Catherine naturally sat on his lap."
            },
            {
                "paragraph": "This intimate posture instantly threw him into a panic."
            },
            {
                "paragraph": "He clumsily held her slender, soft waist. With her fragrance wafting through the air, Shaun was instantly\nshort of breath."
            },
            {
                "paragraph": "Catherine flipped the dictionary open, only to notice something unusual. Her face flushed with shame."
            },
            {
                "paragraph": "This man’s body was functioning so well."
            },
            {
                "paragraph": "“Cathy, I…” Shaun bit his lip embarrassedly. “Help me.”"
            },
            {
                "paragraph": "Catherine blushed while holding the dictionary. “ I’m here to teach you some words.”"
            },
            {
                "paragraph": "“I’m not in the mood to learn right now.” With his dark eyes, Shaun looked at her amorously."
            },
            {
                "paragraph": "Catherine was at a loss for words."
            },
            {
                "paragraph": "After half an hour, the dictionary was tossed onto the floor."
            },
            {
                "paragraph": "Catherine sat on the desk with her arms wrapped around his neck. The man began to kiss her\npassionately."
            },
            {
                "paragraph": "She almost lost her breath."
            },
            {
                "paragraph": "He was very clumsy before this but had improved so much."
            },
            {
                "paragraph": "He was as domineering and enthusiastic as he used to be, and his behavior almost drowned her."
            },
            {
                "paragraph": "Despite his reduced IQ, his character was still the same—especially when they made out."
            },
            {
                "paragraph": "She was obsessed with the current Shaun. Even her body was full of desire."
            },
            {
                "paragraph": "Ever since he became unwell, the two of them had not done it for a long time."
            },
            {
                "paragraph": "With a thought crossing her mind, she could hardly suppress it anymore."
            },
            {
                "paragraph": "“Shaunny…”"
            },
            {
                "paragraph": "At this moment, Catherine had completely forgotten that she was here to teach him vocabulary."
            },
            {
                "paragraph": "She placed her hand on the collar of his T-shirt and began to unbutton it one by one. “Shaunny, let’s… ”"
            },
            {
                "paragraph": "“Mommy, I want to take a bath.” Suzie’s loud voice abruptly sounded from outside."
            },
            {
                "paragraph": "Catherine suddenly regained her senses, feeling as though a bucket of cold water was poured over her\nhead."
            },
            {
                "paragraph": "She immediately pushed Shaun away."
            },
            {
                "paragraph": "Before Shaun came to his senses, his bottom landed on the chair. His handsome face was flushed,\nand his collarbone was partly exposed. He looked just like an attractive and seductive man."
            },
            {
                "paragraph": "Catherine felt a burning sensation inside her. She swiftly averted her eyes and got down from the desk."
            },
            {
                "paragraph": "The door was pushed open the next minute."
            },
            {
                "paragraph": "Suzie casually barged in. “Mommy, please bathe me.”"
            },
            {
                "paragraph": "“Okay.” Catherine nodded in a robotic manner amid her confused thoughts."
            },
            {
                "paragraph": "“Cathy, I…” Shaun pulled her hand, his dark eyes filled with reluctance."
            },
            {
                "paragraph": "He had no idea what Cathy was about to say just now, but he naturally wanted her to stay here and\ncarry on with what they were doing. He felt that there would surely be something delightful happening\nlater."
            },
            {
                "paragraph": "“You… You can stay here and browse the laptop. ” Catherine shot him a glance and placed a laptop in\nfront of him embarrassedly. “You said you wanted to work, right? So you need to learn how the laptop\nworks first.”"
            }
        ]
    },
    {
        "title": "Chapter 1672 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "As soon as Catherine finished speaking, she swiftly held Suzie’s hand and walked away."
            },
            {
                "paragraph": "From her back, it seemed like she was fleeing."
            },
            {
                "paragraph": "After all, she would still feel ashamed no matter how bold she was."
            },
            {
                "paragraph": "She had nearly lost control just now. Ahhh. Why did she lose her inhibitions? It had ruined her dignity."
            },
            {
                "paragraph": "After bathing Suzie and putting on her clothes, she felt too ashamed to enter the study again."
            },
            {
                "paragraph": "With that, she waited for Lucas to return from his martial arts class and asked him to get Shaun. She\nthen made the two of them bathe together."
            },
            {
                "paragraph": "“Lucas, you need to teach him how to bathe tonight.” Catherine gave her son an order."
            },
            {
                "paragraph": "“Why are you asking him to teach me? No way. I want you to bathe me.” Upon hearing her order,\nShaun was dissatisfied with it."
            },
            {
                "paragraph": "“Have you no shame? Even I didn’t ask Mommy to bathe me.” Lucas rolled his eyes. “It’s improper for\nboys and girls to have physical contact with each other, okay? You have hands and legs. You can’t ask\na girl to bathe you, nor can you let a girl look at your body.”"
            },
            {
                "paragraph": "Catherine was speechless."
            },
            {
                "paragraph": "No, son. It was actually fine for a girlfriend to look a t her boyfriend’s body."
            },
            {
                "paragraph": "He should not make a big deal out of it. What if Shaun refused to let her look at his body after this?"
            },
            {
                "paragraph": "Sure enough, Shaun’s brows furrowed after he heard it. “What if a girl looks at my body?”"
            },
            {
                "paragraph": "“That means she’s a pervert.” Once Lucas was done speaking, he strode into the bathroom."
            },
            {
                "paragraph": "Shaun cast a complicated look at Catherine, whom he thought to be a pervert."
            },
            {
                "paragraph": "Catherine’s face flushed. Since it was inconvenient for her to explain it further in front of the kids, she\nhad no choice but to urge them. “Go on, quickly take a bath.”"
            },
            {
                "paragraph": "After that, she pretended to take Suzie’s clothes to wash them and walked out."
            },
            {
                "paragraph": "At night, the four of them lay on a spacious bed together."
            },
            {
                "paragraph": "Lucas and Suzie had always slept in the middle of the bed. However, because of another big baby\nhere, Lucas was sleeping on the other side of the bed whereas Suzie clung to Catherine in her sleep."
            },
            {
                "paragraph": "Shaun had no choice but to sleep between Suzie and Lucas."
            },
            {
                "paragraph": "Dissatisfied with his position, Shaun kept trying to approach Catherine. Suzie, who was lying between\nShaun and Catherine, could not help but groan. “ You and Mommy are squeezing me like a sandwich.\nShaunny, can’t you move toward Lucas?”"
            },
            {
                "paragraph": "“No. I want to sleep near Cathy. If you can’t stand it, you can switch your position with me,” Shaun said\nshamelessly."
            },
            {
                "paragraph": "“You’re shameless. ” Suzie was mad. “Look at your size.”"
            },
            {
                "paragraph": "“Am I to blame? You’re not as tall as me because you eat very little rice.” Shaun scoffed."
            },
            {
                "paragraph": "Suzie said in a huff, “Even if I were born 20 years earlier, I still wouldn’t be taller than you after.”"
            },
            {
                "paragraph": "“Mm. I think so too.” Shaun nodded in a self-righteous manner."
            },
            {
                "paragraph": "Suzie was at a loss for words."
            },
            {
                "paragraph": "She nearly went crazy. Why did she have such a daddy?"
            },
            {
                "paragraph": "“I’m not sleeping here anymore. You can have my spot. You can have Mommy too. ” Unable to put up\nwith him, Suzie carried her pillow and went to Lucas ‘ side. She gave up her place to Shaun."
            },
            {
                "paragraph": "“Thank you.” Shaun promptly landed himself beside Catherine with delight."
            },
            {
                "paragraph": "Catherine was speechless. “ Suzie is a girl. Can’t you be tolerant of her?”"
            },
            {
                "paragraph": "“Why must I be tolerant of girls? Aren’t boys and girls equal?” Shaun asked discontentedly."
            },
            {
                "paragraph": "Catherine choked. Great, he even knew about gender equality."
            },
            {
                "paragraph": "She closed her eyes and soon felt sleepy. As she was about to fall asleep, an arm was suddenly\nwrapped around her."
            },
            {
                "paragraph": "“cathy…” Shaun was actually nibbling on her ear."
            },
            {
                "paragraph": "Catherine was so shocked that her sleepiness immediately vanished. She shot a look at Suzie and\nLucas. Fortunately, they were asleep."
            },
            {
                "paragraph": "“Why aren’t you asleep?”"
            },
            {
                "paragraph": "“I can’t fall asleep.” Shaun blinked his bright eyes. “Cathy, is it true that I can’t let girls look at my body?\nBut you’re a girl, and you’ve seen my body. So you’re a pervert.”"
            },
            {
                "paragraph": "Catherine nearly choked on her saliva."
            }
        ]
    },
    {
        "title": "Chapter 1673 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "The moonlight poured in through the window. Catherine’s face was burning."
            },
            {
                "paragraph": "Deep down, she really wished she could curse this trickster a hundred times."
            },
            {
                "paragraph": "Previously, Shaun had insisted on divorcing her to be with Sarah. Later, he tricked her into making"
            },
            {
                "paragraph": "peace with him. When they were on good terms, he tricked her into acting like a pervert."
            },
            {
                "paragraph": "Who drove her to this state?"
            },
            {
                "paragraph": "She used to be an innocent, cute young lady."
            },
            {
                "paragraph": "However, he called her a pervert now. When he asked for kisses from her previously, why did he not\ncall himself a pervert?"
            },
            {
                "paragraph": "Although Catherine knew that she should be tolerant of him since he was now a fool, she still felt\naggrieved and upset."
            },
            {
                "paragraph": "“Well…”"
            },
            {
                "paragraph": "She bit her lip and whispered, “I won’t look at your body anymore, then. Come to think of it, it’s really\ninappropriate for me to do that. If you don’t know how to wear your clothes, you can look for your dad.”"
            },
            {
                "paragraph": "Shaun was stunned. He blinked, feeling reluctant. “ I don’t want to look for my dad. I just want to look\nfor you.”"
            },
            {
                "paragraph": "“Why do you want to look for me? If I look at your body, I’ll be a pervert, ” Catherine said leisurely."
            },
            {
                "paragraph": "“But… But I like how you act like a pervert.”"
            },
            {
                "paragraph": "Shaun approached her ear. He felt a burning sensation when he breathed."
            },
            {
                "paragraph": "Catherine’s mouth twitched. Was he flirting with her right now?"
            },
            {
                "paragraph": "She closed her eyes and ignored him straight away."
            },
            {
                "paragraph": "“Cathy…” Upon noticing that she was silent, Shaun tugged on her sleeve. “Say something.”"
            },
            {
                "paragraph": "His persistence made Catherine’s head hurt. He was not planning to let go of her if she did not make it\nclear tonight. What actually concerned her was that Lucas and Suzie would be awakened."
            },
            {
                "paragraph": "“Shaun, don’t think that you can take advantage of me just because of the current state you’re in,”"
            },
            {
                "paragraph": "Catherine said directly, “Were you unhappy when I kissed you and took off your clothes? Ultimately,\nyou’re criticizing me for being a pervert. Why don’t you criticize yourself, then?”"
            },
            {
                "paragraph": "Her words left Shaun feeling perplexed as he could not really make out the meaning of her words."
            },
            {
                "paragraph": "Anyhow, he could sense that Catherine was angry."
            },
            {
                "paragraph": "Shaun got a fright when he saw her somber, indifferent expression for the first time."
            },
            {
                "paragraph": "Tears began to well up in his eyes. He then replied in an aggrieved manner, “I’ m not criticizing you.\nDon’t be mad. I’m sorry. I won’t talk nonsense anymore.”"
            },
            {
                "paragraph": "Catherine’s heart clenched at the sight of his expression. She knew that her words were too harsh."
            },
            {
                "paragraph": "She was not mad, actually. She felt aggrieved."
            },
            {
                "paragraph": "She had witnessed how he ended up in this state. Although it was amusing to see how muddle-\nheaded and shy he was sometimes, she was upset that he could not remember his past at all."
            },
            {
                "paragraph": "She wondered if it was because of love that he allowed her to touch him."
            },
            {
                "paragraph": "That was surely not the case. It was mostly because she was the only young woman around him."
            },
            {
                "paragraph": "Initially, Catherine had contemplated doing it with him. However, she was hesitant about it now."
            }
        ]
    },
    {
        "title": "Chapter 1674 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "“ I’m not mad. ” Catherine shook her head. “I was just thinking about the relationship between us."
            },
            {
                "paragraph": "Shaunny, who am I to you?”"
            },
            {
                "paragraph": "Feeling dazed, Shaun thought it over for a while before he stammered, “You’re my aunt… The person I\nlove…”"
            },
            {
                "paragraph": "Catherine forced a smile. “Shaun, I’m not your aunt. Fine, you won’t understand even if I explain to you.\nLet’s sleep.”"
            },
            {
                "paragraph": "She tilted her body to face the window."
            },
            {
                "paragraph": "Deep down, she grumbled at herself for asking that question. She clearly knew that he was just a child\nwho could not possibly love her. At most, he only liked her."
            },
            {
                "paragraph": "At the sight of her slender silhouette, Shaun felt as though something was clenching his heart and\ncausing him pain. At the same time, he felt anxious."
            },
            {
                "paragraph": "Somehow, he felt that Catherine was feeling bitter. Was it because he had said something wrong?"
            },
            {
                "paragraph": "Shaun found himself losing sleep for the first time."
            },
            {
                "paragraph": "When he woke up the next morning, he seemed listless with two dark circles under his eyes."
            },
            {
                "paragraph": "After Catherine was done helping Lucas and Suzie wash up, he silently came to her. “Cathy, help me\ntoo.”"
            },
            {
                "paragraph": "“Brush your teeth on your own.” Catherine kindly squeezed the toothpaste for him before saying with a\nsomber voice, “You can’t possibly rely on me forever. You need to learn to do it yourself.”"
            },
            {
                "paragraph": "At the sight of her grave expression, Shaun reluctantly took the toothbrush from her."
            },
            {
                "paragraph": "After Lucas and Suzie finished their breakfasts, they headed to preschool. Shaun looked glum while\nclumsily eating the food in his bowl."
            },
            {
                "paragraph": "Catherine said, “ I’ve hired three teachers to teach you. After you finish your breakfast, you’ll learn\nsome vocabulary and attend an English class. Then, you’ll learn about financial management in the\nafternoon.”"
            },
            {
                "paragraph": "Lea was dumbfounded. “That’s a bit too much, isn’t it?”"
            },
            {
                "paragraph": "“Aunty Lea, he can absorb knowledge much better than any other ordinary person. I’m guessing that\nthe knowledge is still in his mind. The teachers might be able to awaken his acquired knowledge. I think\nthat it’s worth a try. If it doesn’t work, we can change to another method.”"
            },
            {
                "paragraph": "Catherine was serious. “He can’t possibly learn everything bit by bit like Lucas. If he learns at that kind\nof pace, he’ll be in his 4o or 5os by then.”"
            },
            {
                "paragraph": "Lea instantly went silent. Indeed, what Catherine said made sense."
            },
            {
                "paragraph": "“I don’t want to.” Shaun suddenly furrowed his brows deeply, signaling his resistance. “I don’t want\nstrangers to teach me. I want Cathy to be my teacher.”"
            },
            {
                "paragraph": "“I don’ t know some of the topics. Plus, I’m not a professional, ” Catherine said, “Lucas and Suzie have\ngone to preschool and made friends. I think you need to interact with more people. It can’t be just me\nand you all the time.”"
            },
            {
                "paragraph": "“I don’t want to learn, then. I don’t want other people to teach me.” Shaun’s eyes turned red all of a\nsudden. “Don’t think I don’t know that you’re angry with me and you hate me. You’re just trying to get"
            },
            {
                "paragraph": "rid of me as soon as you can.”"
            },
            {
                "paragraph": "With that, he tossed the spoon and headed upstairs in a rage."
            },
            {
                "paragraph": "Complete silence descended upon the dining room."
            },
            {
                "paragraph": "Lea and Brennan looked at Catherine in embarrassment. Brennan had been staying here these few\ndays because of Shaun’s illness. However, it was plain to see that his son did not need him at all."
            },
            {
                "paragraph": "“Ahem.” Brennan coughed softly while clenching his fist. With a mature voice, he said, “Cathy, if you’re\nbusy, go ahead with your work. After all, you’re not married to Shaun. Although he has ended up in this\nstate, it’s not reasonable to have you take full responsibility for him. Conversely, I think you’ve done a\nwonderful job.”"
            },
            {
                "paragraph": "“Yeah.” Lea agreed with Brennan. “You’re not obligated to take care of him.”"
            },
            {
                "paragraph": "Catherine tightened her grasp on the fork, knowing that Lea and Brennan had misunderstood her."
            },
            {
                "paragraph": "Perhaps they thought that she had started to lose patience with him."
            },
            {
                "paragraph": "“Uncle Brennan, Aunty Lea, I actually hardly slept last night because I was contemplating my future\nwith Shaun.”"
            },
            {
                "paragraph": "Catherine’s voice was slightly hoarse. “All babies cling to the people who look after them the most, so\nit’s normal that Shaun is clinging to me now. His intellect is slowly developing. Given that he has\nforgotten about what happened between us, he might be different from how we remember him."
            },
            {
                "paragraph": "“At this point, he’s like a blank slate. Little by little, there’ll be people stepping into his life. Although he\nused to love me, what about in the future? Are his feelings for me mainly affection, love, or reliance?"
            },
            {
                "paragraph": "You’re both right. We’ re not married, so he’s not obligated to take full responsibility for me. I don’t wish\nfor him to assume responsibility for what had happened in the past either.”"
            }
        ]
    },
    {
        "title": "Chapter 1675 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "At that moment, the dining room was so quiet that one could hear a pin drop"
            },
            {
                "paragraph": "Lea and Brennan exchanged glances. The two of them had grasped the point of Catherine’s message."
            },
            {
                "paragraph": "Indeed, they had to admit that Catherine’s viewpoint was right."
            },
            {
                "paragraph": "“Catherine, I’m really sorry.” Lea took pity on her and felt very guilty. “Shaun owes you too much."
            },
            {
                "paragraph": "You’ve been with him for so long, and you’ re the one who has sacrificed the most and tolerated him\nthe most.”"
            },
            {
                "paragraph": "“Aunty Lea, we don’t owe each other. Perhaps God feels there’s a need to set obstacles between us."
            },
            {
                "paragraph": "Sometimes, it might be easy to love each other, but it’s difficult for our lives to work out smoothly.”"
            },
            {
                "paragraph": "The more Catherine spoke, the more upset she felt. Whenever she thought that she would be able to\nget her happily ever after, she would end up facing a major obstacle."
            },
            {
                "paragraph": "She rose to her feet. With her head lowered, she left."
            },
            {
                "paragraph": "Lea and Brennan were stunned."
            },
            {
                "paragraph": "Loving each other was easy, but having smooth- sailing lives was difficult."
            },
            {
                "paragraph": "Catherine was referring to them as well, was she not?"
            },
            {
                "paragraph": "Compared to Catherine and Shaun, Lea and"
            },
            {
                "paragraph": "Brennan were slightly more fortunate than them. A t least, they could sit down and eat together."
            },
            {
                "paragraph": "“What do you think?” Lea looked at Brennan in agony."
            },
            {
                "paragraph": "“Just do as Catherine said. Come to think of it, it’s really unfair to her. Shaun has hurt her more than he\nhas made her happy. He might be a fool now, but what about Catherine? Not only does she need to\nhelp him manage his company, but she also has to look after the kids and him as well. Even though\nWesley and Sarah are targeting her, no one can come to her assistance. It’s not easy for a young\nwoman like her to keep going.” Brennan lit up a cigarette, his handsome face expressing helplessness."
            },
            {
                "paragraph": "“Judging from Shaun’s character, he probably won’t agree with it.” Lea’s head hurt."
            },
            {
                "paragraph": "“He has no choice but to agree with it. He can’t possibly make Catherine take care of him forever.”\nBrennan was resolute."
            },
            {
                "paragraph": "In Militaire Hospital."
            },
            {
                "paragraph": "Sheryl kept screaming hysterically through the iron door separating Titus and her, “Titus Costner, how\ndare you lock me up, you b*stard?! Why didn’t I recognize earlier that you’ve been a beast in disguise?"
            },
            {
                "paragraph": "“I want to divorce you. Let me go!"
            },
            {
                "paragraph": "“I want to meet Rebecca. What have you done to Rebecca? Are you planning to kill me so that\nCatherine can replace me?"
            },
            {
                "paragraph": "“You shameless couple will be cursed with horrible deaths! ”"
            },
            {
                "paragraph": "Titus stood at the door with a sorrowful and grave expression on his handsome face."
            },
            {
                "paragraph": "His fingers were curled into fists, and the pain in his heart grew intense."
            },
            {
                "paragraph": "At the sight of Sheryl’s hysterical appearance, he wished he could take Rebecca’s corpse out and whip\nit several times."
            },
            {
                "paragraph": "His dark eyes revealed sorrow."
            },
            {
                "paragraph": "He did not even know how he walked out of the hospital with such a heavy heart."
            }
        ]
    },
    {
        "title": "Chapter 1676 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "“President Costner, didn’t you ask your subordinate to take Madam Costner and Suzie’s hair back to\nNeah Bay for DNA testing?”"
            },
            {
                "paragraph": "Titus’ assistant, Warren, rushed over. “The test report is already out. Please have a look at it.”"
            },
            {
                "paragraph": "Titus took the phone from him to look at the report, which indicated that Suzie and Sheryl were not\nrelated. Given that the DNA grand parentage test was performed between them, the percentage surely\nwould not reach 99%. However, after the medical staff in the Costners’ top hospital analyzed Suzie and\nSheryl’s DNA samples based on genetics and biology, they discovered that the two of them shared\n50% of their DNA."
            },
            {
                "paragraph": "As such, Suzie must be Sheryl’s granddaughter."
            },
            {
                "paragraph": "If Suzie was Jeffery’s biological granddaughter, Sheryl would just be Suzie’s grandaunt."
            },
            {
                "paragraph": "The DNA between Suzie and Sheryl would be practically identical."
            },
            {
                "paragraph": "Warren said furiously, “We’ve been tricked by Rebecca. Apparently, the hair that Young Master Costner\nused for the paternity test before belonged to Catherine. I asked someone to check the hotel"
            },
            {
                "paragraph": "that Rebecca stayed in when she just arrived in Neah Bay. The hotel staff claimed that he got the hair\nfrom her comb when he cleaned Rebecca’s room, so they didn’t actually get the hair from her head.”"
            },
            {
                "paragraph": "“It wasn’t Matthew’s fault. Who would’ve expected that?”"
            },
            {
                "paragraph": "Titus narrowed his grim eyes. What a schemer Rebecca was."
            },
            {
                "paragraph": "“President Costner, should I let Madam know about this matter…” Warren asked in hesitation."
            },
            {
                "paragraph": "“Will she believe you?” Titus snorted. “ She doesn’t trust me at all now. She might think that I’m making\nit up. She has been under the impression that I’m trying to kill her so that I can marry Catherine.”"
            },
            {
                "paragraph": "“Alas, Madam is really…” Warren sighed. “I wonder how long it’ll take her to recover.”"
            },
            {
                "paragraph": "“I heard it’ll take approximately half a year for her to fully recover.” Titus rubbed his forehead. “ I think\nthe doctors here aren’t as good as the ones we have. I’m planning to bring her back to Neah Bay.”"
            },
            {
                "paragraph": "“That’s good. By keeping Madam by your side here, you’re creating a time bomb for yourself. If she\nlearns that Rebecca has passed, things will be troublesome, ” Warren said, “By the way, I found out\nthat Jeffery and Sally’s names have always been on Rebecca’s birth certificate. According to the law in\nAustralia, Jeffery can inherit the shares that Rebecca owned since she has passed. Jeffery and Sally\nhave arrived in Canberra, and Hill Corporation will be holding a general meeting tomorrow. I’ m\nguessing they’re going to announce Jeffery as the new chairman.”"
            },
            {
                "paragraph": "A look of disgust washed over Titus’ face. “He can’t even handle a renovation company properly. How\ndare he think of being the chairman of the best company in Australia? Dream on!”"
            },
            {
                "paragraph": "“Exactly. It’s as if any Tom, Dick, and Harry can be the chairman. At the end of the day, he’s spending\nMadam’s money. Indeed, Jeffery’s family is extremely shameless. If our people were here, I would’ve\nhad them deal with Jeffery and Sally long ago,” Warren said indignantly."
            },
            {
                "paragraph": "At the mention of this matter, Titus furrowed his eyebrows deeply."
            },
            {
                "paragraph": "In fact, he had long since asked his subordinates from Neah Bay to come over. Nevertheless, they\nwere stuck processing their visa in the embassy. Hence, they could not board the plane."
            },
            {
                "paragraph": "After some investigation, Titus discovered that the Meads’ relatives were in charge of the embassy. It\nmeant that they were the ones causing trouble for his subordinates."
            },
            {
                "paragraph": "“Has there been any progress after I personally gave Nathan a call?” Titus asked coldly."
            },
            {
                "paragraph": "“Prime Minister Snow has just started to take over the local matters and assigned Gavin to take charge\nof the foreign affairs. It’s all Gavin’s people in the embassy. Prime Minister Snow has criticized Gavin,\nbut Gavin insists that our people are suspicious, so he’s not allowing them to enter Australia.”"
            },
            {
                "paragraph": "“Well done, Gavin.” Titus began to laugh grimly. “I never thought that I would one day be controlled by\nthe buffoons. I might not be able to tackle Wesley in this country, but my people are all overseas. Go\ncontact those people out there and ask them to stop all of Wesley’s international business deals at all\ncosts. Also, since the Meads have been behaving quite haughtily abroad, don’t let them come back as\nwell.”"
            },
            {
                "paragraph": "Warren reminded under his breath, “But… Young Master Costner is with them. What if…”"
            },
            {
                "paragraph": "“Don’t worry. They’ll keep Matthew alive as a means of protecting themselves. At most, they’ll chop off\na few of Matthew’s fingers and send them to me.” Titus was emotionless. “It’s just a few fingers.\nAnyway, it was Matthew who started it."
            },
            {
                "paragraph": "How stupid of him to get caught. It serves him right.”"
            },
            {
                "paragraph": "Warren was speechless."
            },
            {
                "paragraph": "All he could do was sympathize with Matthew silently."
            },
            {
                "paragraph": "“By the way, we’ll be attending Hill Corporation’s general meeting tomorrow to have a look. Rebecca\nspent Sheryl’s money on the company, yet the Jones family is planning on occupying it. They should\ndream on!” Titus’ dark eyes were full of annoyance."
            }
        ]
    },
    {
        "title": "Chapter 1677 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "“Uncle Titus… Okay… I’m relieved to know that you’ll be around.”"
            },
            {
                "paragraph": "In front of the French window, Catherine hung up the call with a smile."
            },
            {
                "paragraph": "In truth, she was not confident about the general meeting tomorrow. Now that Titus had said that he\nwould show up, Catherine felt as though the weight in her mind had finally become much lighter."
            },
            {
                "paragraph": "“Get out… I don’t need you to teach me…”"
            },
            {
                "paragraph": "“Fine. I’ll get out. Given your attitude, I won’t even come again even if you beg me tomorrow.”"
            },
            {
                "paragraph": "All of a sudden, a commotion rang out in the corridor outside."
            },
            {
                "paragraph": "Frowning, Catherine walked toward the door and opened it, only to see the teacher that she hired\nstomp out the door in a fit of fury."
            },
            {
                "paragraph": "There were a few books scattered on the floor of the corridor on the second floor."
            },
            {
                "paragraph": "Shaun stood beside the books. As soon as he saw the teacher leave, he glowered sideways at her with\nhis dark eyes that carried traces of grievance and rage."
            },
            {
                "paragraph": "He then entered the study and even swung the door shut heavily."
            },
            {
                "paragraph": "“You rascal, open the door! How could you treat your teacher that way? Are you learning for our sake?\nIt’s for your own good. Do you want to be illiterate forever? Even Suzie and Lucas know more than\nyou.” Shaun’s attitude made Brennan’s blood boil."
            },
            {
                "paragraph": "“No, I just don’t want to learn. Since nobody likes me, I don’t mind being illiterate forever. ” Shaun’s\nsulky voice rang out from the study."
            },
            {
                "paragraph": "“Nobody dislikes you. It’s precisely because we like you that we’re making you learn. We hope that\nyou’ll turn into a better person.” Brennan’s head hurt. A 50-year-old man like him had no experience\nnurturing children, yet he had to try to be a loving father to Shaun who was being extremely rebellious."
            },
            {
                "paragraph": "“Cathy dislikes me. I don’t want to learn. I don’ t need you guys to like me. I just want her to like me,”\nShaun said in a self-righteous manner from inside the study."
            },
            {
                "paragraph": "An embarrassed look washed over Brennan’s face. “ Who said she dislikes you? It’s just that she’s not\nteaching you. She’s not a teacher, and what’s more, she’s not good at teaching. Also, she has her own\nlife. What gives you the right to force her to accompany you all the time? If you continue acting\nunreasonably, she might really dislike you.”"
            },
            {
                "paragraph": "The study grew silent all of a sudden."
            },
            {
                "paragraph": "Shaun did not speak. However, he refused to open the door no matter how Brennan persuaded him."
            },
            {
                "paragraph": "“Uncle Brennan, you may go downstairs and rest. Let me deal with him. ” Catherine had no choice but\nto walk up to him."
            },
            {
                "paragraph": "“Catherine, don’t let him act as he pleases. After all, he’s a man. He can figure out certain things\nhimself. ” Brennan let out a sigh. “We don’ t wish for him to become your burden.”"
            },
            {
                "paragraph": "“I’ll talk to him.” Catherine felt as though something was weighing on her heart and it made her upset.\n“Perhaps I was too impatient.”"
            },
            {
                "paragraph": "Brennan shook his head helplessly before he turned to head downstairs."
            },
            {
                "paragraph": "“Shaun, please open the door.” Catherine knocked on the door gently. “If you don’t open it, I’m going to\nmove out.”"
            },
            {
                "paragraph": "The study remained quiet, and Catherine pretended to walk down the stairs."
            },
            {
                "paragraph": "Just then, the door of the study was opened forcefully. Shaun rushed out and stared anxiously at her\nwith reddened eyes. “You can’t leave. If you leave, I won’t want to stay here anymore.”"
            },
            {
                "paragraph": "“This is your house, ” Catherine whispered, “This isn’t my house.”"
            }
        ]
    },
    {
        "title": "Chapter 1678 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "Catherine had been staying here all because of Shaun."
            },
            {
                "paragraph": "Without a second thought, Shaun answered, “ Wherever you go, I’ll follow.”"
            },
            {
                "paragraph": "Catherine asked, “… Why?”"
            },
            {
                "paragraph": "“Why?” Shaun scratched the back of his head in a daze. With a pout, he replied, “ I don’t know. I just\ndon’t want to leave you.”"
            },
            {
                "paragraph": "Catherine did not know whether to laugh or cry. Should she feel happy or sad about it?"
            },
            {
                "paragraph": "“Shaun, let’s have a talk.” She walked up to him again."
            },
            {
                "paragraph": "When Shaun gazed at her pretty face, he felt aggrieved. He snorted and turned around to enter the\nstudy."
            },
            {
                "paragraph": "Catherine closed the door."
            },
            {
                "paragraph": "Her eyes swept over the messy floor of the study. He must have thrown a tantrum during the lesson."
            },
            {
                "paragraph": "Shaun gritted his teeth. As he fought back his tears, he suddenly stretched out his hands to hug her. “\nCathy, I know it was my fault. I shouldn’t have called you a pervert last night. Are you still mad about it?\nI promise that I won’t make such a remark about you anymore. Please don’t leave me.”"
            },
            {
                "paragraph": "Pulled into his arms so abruptly, Catherine was startled."
            },
            {
                "paragraph": "Only when his hot tears fell on her neck did she start regretting it."
            },
            {
                "paragraph": "She had forgotten that he only had the mental capacity of a two-year-old despite his sturdy figure,\nability to play basketball, and other brilliant skills."
            },
            {
                "paragraph": "No matter how unhappy and lost she was, she should not have placed the burden on him."
            },
            {
                "paragraph": "“ Shaunny, I’m not mad about what happened last night. I’m just… afraid that you’ll slowly grow up and\nleave me,” Catherine said gently, “When you woke up, you called me ‘Aunt’ at first glance. As I told you\nearlier, I don’t want to be your aunt. I want to be your lover, woman, and girlfriend.”"
            },
            {
                "paragraph": "“No problem. You can be my lover and girlfriend.”"
            },
            {
                "paragraph": "Shaun tightened his arms around her sulkily."
            },
            {
                "paragraph": "“But do you know what it means for me to be your lover and girlfriend?” Catherine asked as she\npushed him away softly."
            },
            {
                "paragraph": "Shaun’s dark gaze instantly became confused."
            },
            {
                "paragraph": "Catherine looked at him and smiled. “Look, you don’t even know things like this because you know too\nlittle. Shaunny, I hired teachers to teach you vocabulary and English because I hope that you’ll grow up\nas soon as possible. Then, you’ll be able to earn money, protect me, and take care of me."
            },
            {
                "paragraph": "That’s when you can talk about love and relationships.”"
            },
            {
                "paragraph": "Shaun was bewildered, but he was aware of his own ignorance. Indeed, he knew too little. Maybe he…\nshould really buckle down and study hard."
            },
            {
                "paragraph": "“Shaunny… As I said, this is your house and not mine. If it weren’t for you, I wouldn’t be staying here.\nDo you understand?” Catherine lifted her head and cupped his face. “Do you know what the outside"
            },
            {
                "paragraph": "world is like?”"
            },
            {
                "paragraph": "“… I don’t.” Shaun admitted candidly, feeling a little discouraged. “Am I very useless?”"
            },
            {
                "paragraph": "“Not at all. I used to be like you long ago, but now I know that there are vast grasslands, azure oceans,\ntowering snow mountains, bustling cities, and all kinds of delicious food out there. There’s also intrigue\nbetween people, but you don’t know all these. We don’t have any topics in common, and I can’t be\ntalking about cartoons and toys with you all the time. I want you to learn so that you’re aware of more\nthings. That way, we’ll have more topics to talk about and you can help me when someone bullies me.\nWe can also enjoy the view of the sea, go horse riding, and ski together.”"
            },
            {
                "paragraph": "Catherine looked into his eyes seriously. “I love you, and that’s why I hope you’ll grow up. I’m making\nyou learn and hired teachers to teach you so that you can be on an equal footing with me as soon as\npossible. Because… to me, you’re different from Suzie and Lucas.”"
            },
            {
                "paragraph": "Deep down, Shaun was shocked. He might not have been to those places, but he could not resist the\nintense longing he felt to visit those places with her."
            }
        ]
    },
    {
        "title": "Chapter 1679 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "“But… How am I different from Suzie and Lucas?”"
            },
            {
                "paragraph": "“Didn’t you realize that Suzie and Lucas are a lot shorter than you? Shaunny, they’re actually three\nyears old. You say you’re two years old, but why are you a lot taller than them and even taller than\nme?”"
            },
            {
                "paragraph": "Catherine sighed and told him the truth, “The reason why I didn’t ask you to attend preschool is that the\nplace doesn’t suit you. School isn’t a place where you should go either. In truth, you’re 33 years old.\nYou’re six to seven years older than me. ”"
            },
            {
                "paragraph": "Shaun was stunned, looking completely lost."
            },
            {
                "paragraph": "“Because something happened to you…” Catherine pointed at her head. “Something’s wrong here, so\nyou think that you’re only two years old. I’ll show you what a two-year-old kid actually looks like next\ntime.”"
            },
            {
                "paragraph": "Shaun, who had been under the impression that he was two years old, felt speechless."
            },
            {
                "paragraph": "No, he did not want to know as he refused to accept the fact."
            },
            {
                "paragraph": "“Cathy, am I really… that old?” A look of dejection washed over his face."
            },
            {
                "paragraph": "“No, you’re not.” Catherine caressed his distinct features. “You’re good-looking. You’re at the age\nwhere men are most charming. If you study more and learn how to make money, you’ll be even more\ncharming.”"
            },
            {
                "paragraph": "At first, Shaun was quite shocked and disappointed. However, now that Catherine was praising him for\nbeing charming, he was inwardly delighted. “Mm. I must study hard and learn to make money. I want to"
            },
            {
                "paragraph": "look after you and support you.”"
            },
            {
                "paragraph": "“Mm. When the teacher comes in the afternoon, are you going to throw a tantrum again?” Catherine\nasked in a soft tone."
            },
            {
                "paragraph": "Shaun shook his head obediently. “I’ll listen to you.”"
            },
            {
                "paragraph": "“Good. Let’s go downstairs and have lunch.” A gentle smile spread across Catherine’s face."
            },
            {
                "paragraph": "After they came downstairs, Lea and Brennan were astonished to see how obedient Shaun suddenly\nwas."
            },
            {
                "paragraph": "“Catherine, you seem to be the only one who can control him.” When Shaun went to drink some water,\nLea took the opportunity to grab Catherine."
            },
            {
                "paragraph": "“Aunty Lea, I’ve let Shaun know about his actual age,” Catherine said frankly."
            },
            {
                "paragraph": "Lea was taken aback. “Did he accept it? Was he triggered?”"
            },
            {
                "paragraph": "“We can’t possibly keep hiding it from him. What’s more, he’s not exactly a fool. As time passes, he’ll\nnotice that he’s different too. ” Catherine shrugged weakly. “In fact, his mental state is much better than\nwe initially imagined. We can’t treat him like how we treat Suzie and Lucas.”"
            },
            {
                "paragraph": "“You’re really something. I’m not a good mother. I’m inexperienced in handling this kind of situation.”\nLea was thoroughly embarrassed."
            },
            {
                "paragraph": "Lea had never taken care of Shaun back then as she always left him to the sitter. Hence, she was\nreally unsure of his thoughts."
            },
            {
                "paragraph": "Catherine was speechless. Despite having given birth to two children, Lea still lacked experience in this\narea. Shaun’s biological parents… She took pity on Shaun and Liam, who grew up relying on their In\nthe afternoon, the English teacher came."
            },
            {
                "paragraph": "Shaun did not kick up a fuss. He sat in the study and paid attention to the lesson."
            },
            {
                "paragraph": "At the sight of this scene, everyone was gratified."
            },
            {
                "paragraph": "When the English teacher went downstairs after teaching for two hours, she said to Catherine, “He has\nexcellent memory. Perhaps he still has some English knowledge in his head. He could grasp the\nmeaning instantly after I read out a text to him just once. It’s unbelievable! I’m done teaching him high\nschool-level English, so he can learn college-level English tomorrow.”"
            },
            {
                "paragraph": "Catherine was at a loss for words. How impressive!"
            },
            {
                "paragraph": "After dinner, she got a university professor who taught financial management to come over."
            },
            {
                "paragraph": "When the professor left, he said contentedly, “With his pace, I can probably teach him everything in a\nweek.”"
            },
            {
                "paragraph": "“That’s wonderful. Thank you, professor.” Catherine saw the professor off."
            },
            {
                "paragraph": "When she returned to the room, she heard Shaun showing off to Suzie and Lucas. “Those things are\ntoo easy. Both of you are… too childish. I mastered addition, subtraction, multiplication, and division in\ntwo minutes… Please don’t tell others that you both know me. You both bring shame to me.”"
            }
        ]
    },
    {
        "title": "Chapter 1680 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "It did not really matter to Suzie since she had thick skin."
            },
            {
                "paragraph": "Unlike Suzie, Lucas pulled a long face. Catherine wondered if he was going to throw the textbook to\nShaun’s face the next minute."
            },
            {
                "paragraph": "“Enough. How can you mock Lucas and Suzie?” Catherine rolled her eyes at Shaun. “You already\nlearned those things back then. The lessons just brought back your memories, which explains why\nyou’re learning faster than other people.”"
            },
            {
                "paragraph": "“Exactly. There’s nothing to brag about.” Suzie rolled her eyes. “What a shameless old man. You\nactually feel proud when comparing yourself to us three-year-olds. I wonder who addressed us as ‘\nElder Sister’ and ‘Brother’ yesterday. Shame on you.”"
            },
            {
                "paragraph": "“You…” Shaun’s face was flushed with anger. “ I’m not a shameless old man.”"
            },
            {
                "paragraph": "“You’re a shameless old man.” Suzie grimaced. Infuriated, Shaun nearly burst into tears. However,"
            },
            {
                "paragraph": "he fought back his tears at the thought of his actual age."
            },
            {
                "paragraph": "At the sight of the scene, Lucas curved his lips."
            },
            {
                "paragraph": "“You guys are going too far. The three of you are banding up to bully me.” Shaun puffed out his cheeks.\nHe appeared aggrieved while trying to contain his feelings."
            },
            {
                "paragraph": "“Ugh. Fine, fine. I’m not going to argue with you anymore. ” Suzie became soft-hearted. She turned\naround to read a picture book."
            },
            {
                "paragraph": "When Suzie and Lucas were asleep at night, Shaun secretly approached Catherine and whispered in\nher ear with a throaty voice, “I love you.”"
            },
            {
                "paragraph": "His voice was pleasant to hear. However, since it was in the middle of the night, Catherine felt her heart\nskipping a beat."
            },
            {
                "paragraph": "She looked back and caught sight of his exquisite face, moonlight reflecting in his dark eyes. There\nseemed to be a glint in his gaze that she could not resist."
            },
            {
                "paragraph": "“ I learned this today, ” Shaun said to her bashfully. “Thanks. I love it.”"
            },
            {
                "paragraph": "Catherine turned around and buried her face into his arms."
            },
            {
                "paragraph": "He might not know the real meaning of the phrase, but she found it rather sweet anyway."
            },
            {
                "paragraph": "Whether he would fall for someone else later, that would be in the future."
            },
            {
                "paragraph": "At this point, she did not want to overthink things."
            },
            {
                "paragraph": "In addition, given that she had made him fall for her the first time, she believed that she would be able\nto do it again considering her great charisma."
            },
            {
                "paragraph": "The next day."
            },
            {
                "paragraph": "After Shaun woke up, Catherine made him change into a black suit."
            },
            {
                "paragraph": "After he put it on, Catherine looked him up and down."
            },
            {
                "paragraph": "His physique and aura were still the same. Nevertheless, his childlike eyes…"
            },
            {
                "paragraph": "In the end, she chose a pair of black-rimmed glasses for him."
            },
            {
                "paragraph": "The minute he put on the glasses, Catherine was mesmerized by his handsome and elegant\nappearance."
            },
            {
                "paragraph": "She had seen a lot of men who looked old- fashioned and dull in black-rimmed glasses. However,\nShaun was worlds apart from them. With the black-rimmed glasses on his handsome face, he looked\nso elegant and respectable that it was as though he had transformed into a different person. He was\njust like those handsome young gentlemen one would find in comic books."
            },
            {
                "paragraph": "He was too… f*cking handsome."
            },
            {
                "paragraph": "He was so handsome that one would be tempted to throw themselves at him."
            },
            {
                "paragraph": "“Cathy, why are you staring at me this way?” Her stare made Shaun uneasy. “From your gaze… you\nlook like a cat that has caught a fish.”"
            }
        ]
    },
    {
        "title": "Chapter 1681 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "Catherine was speechless. Was it that obvious?"
            },
            {
                "paragraph": "She had indeed thought of eating him up, though."
            },
            {
                "paragraph": "“No. I just think that you look very handsome in this attire, ” Catherine put on a front and replied\nsolemnly."
            },
            {
                "paragraph": "“Really?” Shaun scratched the back of his head bashfully and chuckled. “Is it because you were\ndazzled by my handsome looks just now?”"
            },
            {
                "paragraph": "Catherine was sullen that Shaun had seen through her. His IQ had improved so much within a day."
            },
            {
                "paragraph": "Sure enough, taking lessons could make a difference. He had become so different after gaining\nknowledge from the lessons."
            },
            {
                "paragraph": "“Not really. I’ve met many other handsome men. My heart doesn’t melt so easily.” A casual look\nwashed over Catherine’s face."
            },
            {
                "paragraph": "Shaun pouted. “Who? Who’s more handsome than me?”"
            },
            {
                "paragraph": "“People like Doctor Jewell and Rodney are also quite handsome but in different ways, ” Catherine said\nas she grinned, “You need to accept that you’re not the only handsome person in the world.”"
            },
            {
                "paragraph": "Shaun tsked inwardly, thinking to himself that he would not accept it."
            },
            {
                "paragraph": "He was the most handsome person."
            },
            {
                "paragraph": "The most handsome person in the world!"
            },
            {
                "paragraph": "After he got changed, Catherine handed him a phone. “This is the phone that you were using before\nthis.”"
            },
            {
                "paragraph": "Shaun used his fingerprint to unlock the phone, only to see a selfie of Catherine and himself on the\nscreen. They were seen putting their faces next to each other and smiling sweetly."
            },
            {
                "paragraph": "He was stunned for a moment before he found it strange."
            },
            {
                "paragraph": "When Catherine was driving to Hill Corporation, Shaun sat on the passenger seat, exploring the phone\ncuriously."
            },
            {
                "paragraph": "When he was playing games and watching cartoons previously, he had longed to have his own phone."
            },
            {
                "paragraph": "Now that he had one, he did not know if he was elated."
            },
            {
                "paragraph": "After seriously going through the apps on his phone, he could not find any of his favorite games. The\napps on this phone were mostly related to finance and budgeting."
            },
            {
                "paragraph": "He clicked open a budgeting folder, only to see a page regarding stocks."
            },
            {
                "paragraph": "The finance professor had explained stocks to him yesterday. After researching those stocks, Shaun\nclicked open his account. Although he could not recall his password, he was able to reset his password\nusing his identity document and phone. He realized that there was a considerable amount of money in\nhis account."
            },
            {
                "paragraph": "It turned out that he used to be so rich."
            },
            {
                "paragraph": "He thought that he had easily earned money over the years, so he randomly bought some stocks."
            },
            {
                "paragraph": "20 minutes later, the car stopped at a junction. As Catherine was waiting for the traffic light to turn\ngreen, she glanced at the passenger seat. “What are you doing?”"
            },
            {
                "paragraph": "“I’m buying stocks.”"
            },
            {
                "paragraph": "“… Do you have money to buy stocks?” As far as Catherine remembered, none of the Hills had offered\nhim any money."
            },
            {
                "paragraph": "“I have money in my phone,” Shaun responded honestly."
            },
            {
                "paragraph": "Catherine’s eyes narrowed, and she had a sinking feeling. “How much money do you have there?”"
            },
            {
                "paragraph": "“ I think there are a few hundred million dollars. ”"
            },
            {
                "paragraph": "“So… how much money have you spent on stocks?” Catherine shuddered and asked."
            },
            {
                "paragraph": "Shaun looked at his phone once again. “About 200 million dollars.”"
            },
            {
                "paragraph": "Catherine was at a loss for words."
            },
            {
                "paragraph": "Honk, honk."
            },
            {
                "paragraph": "The light had turned green, yet her car was not moving. She was so dumbfounded until the honks from\nthe cars behind her prompted her to drive."
            },
            {
                "paragraph": "“Cathy, the cars behind us are urging us to move. You’re blocking them,” Shaun reminded out of the\ngoodness of his heart."
            },
            {
                "paragraph": "Catherine promptly drove forward in a daze. As soon as she drove past the traffic light, she stopped the\ncar at the roadside and flew into a fury."
            }
        ]
    },
    {
        "title": "Chapter 1682 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "“Shaun Hill, will you feel uneasy if you don’t anger me for one day?” Catherine completely lost her mind\nand roared. “You actually spent 2oo million to buy stocks? Are you crazy? Do you know how hard it is\nto earn money? You’re not who you used to be anymore. Do you think you’re still the richest man in the\ncountry?”"
            },
            {
                "paragraph": "She was utterly furious."
            },
            {
                "paragraph": "As far as she knew, Shaun invested most of his money in Hill Corporation’s R&D projects."
            },
            {
                "paragraph": "After Hill Corporation was acquired, he was kicked out of his position as chairman and president, and\nall he did was sit at home and live off his pants."
            },
            {
                "paragraph": "Despite it all, he was still spending his money extravagantly."
            },
            {
                "paragraph": "Did he think money fell from the sky? If they could not get Hill Corporation back, they might have to rely\non these savings to turn their fortunes around in the future, yet what did he do? He poured it all into the\nstock market."
            },
            {
                "paragraph": "Shaun froze at her roar. It was his first time seeing"
            },
            {
                "paragraph": "Catherine’s ferocity, and he was a little overwhelmed. “Is 200 million a lot?”"
            },
            {
                "paragraph": "“Of course it is. It’s an amount some people won’t be able to earn their entire lives.”"
            },
            {
                "paragraph": "“Oh, but the stock has been rising since I bought it and the current amount in the portfolio is 250\nmillion.”"
            },
            {
                "paragraph": "Shaun nonchalantly lifted his phone to show her."
            },
            {
                "paragraph": "Catherine was dumbfounded and quickly grabbed his phone."
            },
            {
                "paragraph": "In just a blink of an eye, 250 million became 253 million."
            },
            {
                "paragraph": "She tapped on one of the stocks he bought and saw the stock rose sharply in a diagonal line until it\nreached the daily limit."
            },
            {
                "paragraph": "‘I… #@ #!!!’"
            },
            {
                "paragraph": "She was speechless."
            },
            {
                "paragraph": "“I think it’s easy to earn money, ” Shaun rubbed his nose and said in a low voice."
            },
            {
                "paragraph": "Catherine sneered. It was easy?"
            },
            {
                "paragraph": "She suffered losses nine out of ten times when she bought stocks, but now he said it was easy."
            },
            {
                "paragraph": "It might be a fluke that one of the stocks he bought reached the daily limit, but it was not a coincidence\nthat all five stocks he bought were soaring."
            },
            {
                "paragraph": "Catherine gave the man next to her a rather conflicted look. She had no idea that he was still a\nfinancial expert."
            },
            {
                "paragraph": "Goddammit, how many secrets did he have?"
            },
            {
                "paragraph": "She took a deep breath and said sternly, “You can play with it occasionally, but I don’t approve of you\nputting a lot of money into it. It’s risky to speculate in stocks. Do you know how many have lost\neverything when they pour all of their money into stocks? Even if it rises today, it might fall tomorrow.\nYou better sell those stocks as soon as the market reopens tomorrow morning.”"
            },
            {
                "paragraph": "“Okay, ” Shaun pretended to listen and nodded. However, he had a different opinion."
            },
            {
                "paragraph": "He felt that finance was something that needed to be understood. If he understood the data and\ngraphs, he would be able to earn money."
            },
            {
                "paragraph": "However, he could not tell that to Cathy because he thought she was rather dumb in this regard."
            },
            {
                "paragraph": "Catherine had no idea what he thought of her. If she did, she would probably be furious."
            },
            {
                "paragraph": "She also took the opportunity to briefly tell Shaun about Hill Corporation’s situation."
            },
            {
                "paragraph": "Shaun listened and was struck by a realization. “I used to be so stupid. I was so useless I couldn’t even\nmanage such a large company.”"
            },
            {
                "paragraph": "Catherine sweat dropped, not knowing how to go along with him."
            },
            {
                "paragraph": "When she arrived at the company, she noticed the first floor had been completely replaced with new\nfaces."
            },
            {
                "paragraph": "The front desk and security guard at the door refused her entry."
            },
            {
                "paragraph": "“Sorry, but Hill Corporation isn’t a place where just anyone can enter.” The receptionist was quite\narrogant. “That’s unless you have an appointment with our chairman.”"
            },
            {
                "paragraph": "Catherine laughed in anger. She could not believe a day would come where Shaun and she would be\nhumiliated at the entrance of Hill Corporation."
            },
            {
                "paragraph": "Just as she was about to get angry, Shaun who saw her being bullied from behind went forward with a\ndark expression. “Who does your chairman think she is? My last name is Hill and I’m a shareholder\nhere, so I can enter as I please. How dare pieces of trash like you yell at us?”"
            },
            {
                "paragraph": "He stood tall and he was one of the legendary figures in Hill Corporation, so the general public knew\nwho he was."
            }
        ]
    },
    {
        "title": "Chapter 1683 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "The security guard and receptionist recognized Shaun and Catherine but were purposely making things\ndifficult for them."
            },
            {
                "paragraph": "Now that Shaun was livid, his aggressive aura came bursting and both the security guard and\nreceptionist felt a sense of fear."
            },
            {
                "paragraph": "At the same time, they wondered in their hearts, ‘ Didn’t Shaun Hill become stupid? How is this stupid?’"
            },
            {
                "paragraph": "“Get lost.” Shaun grabbed the bodyguard’s collar and flung him to the side."
            },
            {
                "paragraph": "Then, he said contemptuously, “You can’t even raise a finger against me. How did a piece of trash like\nyou become a security guard for Hill Corporation? You must have come through the back door.”"
            },
            {
                "paragraph": "“You… You’re courting death.” The security guard flushed red with anger. Even if he was no match for\nShaun, he did not believe that a group of guards would not be able to beat him."
            },
            {
                "paragraph": "Besides, the new president already told them that they could humiliate Shaun Hill to their hearts’\ncontent."
            },
            {
                "paragraph": "He immediately summoned a group of bodyguards."
            },
            {
                "paragraph": "Catherine only saw a flash before her eyes, and then the group of security guards were beaten to the\nground and could not get up."
            },
            {
                "paragraph": "“Bunch of trash.” Shaun adjusted his shades. The derisive expression on his handsome face was\nabsolutely arrogant."
            },
            {
                "paragraph": "Catherine was dumbfounded."
            },
            {
                "paragraph": "“You… You’ve gone too far. I’m calling the cops. ” The security guard who instigated the attack took out\nhis phone angrily."
            },
            {
                "paragraph": "“Go ahead,” Catherine grinned. “We can explain to the police how we can’t go into our own company\nand were bullied by a bodyguard instead. So many of you ganged up on him earlier. Isn’t that\ninteresting? We’ll let Wade see how he manages the company.”"
            },
            {
                "paragraph": "The security guard froze."
            },
            {
                "paragraph": "He was a trusted aide brought over by President Middleton himself. It would be troublesome if he were\nto involve the president in this. However, he still could not swallow his anger."
            },
            {
                "paragraph": "“Eldest Young Master Hill, Ms. Jones, you’re here.” Hadley hurried down from upstairs with a building\nkeycard hung around his neck."
            },
            {
                "paragraph": "Catherine had previously heard that he was transferred to the logistics department on the first floor, but\nthat did not stop her from feeling angry when she saw it with her own eyes."
            },
            {
                "paragraph": "“We’re here, but we were blocked by a group of dogs at the door, ” Shaun snorted coldly."
            },
            {
                "paragraph": "The receptionist and the guards who were called “ dogs” were speechless."
            },
            {
                "paragraph": "“They’re new and only take orders from Wade’s team, ” Hadley explained with a faint smile."
            },
            {
                "paragraph": "“I see, so it’s Wade who is deliberately making things hard for me. Fine. I’ll have a little talk with him,”\nShaun swaggered inside."
            },
            {
                "paragraph": "Hadley looked at his figure and turned to Catherine in confusion. “Did Eldest Young Master… recover?”"
            },
            {
                "paragraph": "“No, I told him to put on an act while we were on the way here, ” Catherine said, dumbfounded. “He’s\nquite good at it.”"
            },
            {
                "paragraph": "Hadley smiled. “That’s good. Otherwise, he won’t be able to suppress Wade.”"
            },
            {
                "paragraph": "The three of them went up."
            },
            {
                "paragraph": "It was only ten minutes till the board meeting."
            }
        ]
    },
    {
        "title": "Chapter 1684 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "Hadley brought them straight to the conference room."
            },
            {
                "paragraph": "This was Catherine’s first time in Hill Corporation’s conference room, and she looked around as she\nentered. It was not huge and could only seat at most ten pax. A middle-aged man in a dark suit sat in\nthe room with a secretary standing beside him brewing tea."
            },
            {
                "paragraph": "Catherine looked at the man and knew that he was Wade Middleton. She researched him on the\nInternet before and found out that he was a senior manager who had also previously served as the\nCEO of a top 100 company abroad."
            },
            {
                "paragraph": "Now that she saw him in person, she could see from his deep features that he was as cunning as a fox.\nIt was no wonder that Rebecca agreed to let him manage Hill Corporation."
            },
            {
                "paragraph": "“Mr. Hill.” Wade heard the footsteps and straightened up. He nodded at Shaun with a smile but did not\nget up, and did not even spare a glance at Catherine."
            },
            {
                "paragraph": "Catherine knew that he recognized her but he was doing this because he was trying to make a show of\nhis power."
            },
            {
                "paragraph": "With a smile, Catherine took out a document from her bag and threw it in front of Wade. “Lea will not\nattend the board meeting today because she isn’t feeling well, so this is proof that she authorized me to\nattend in her stead.”"
            },
            {
                "paragraph": "“I see.” Wade looked at the signature on the document and nodded politely. “Ms. Lea is indeed a little\nold, so it’s understandable.”"
            },
            {
                "paragraph": "“Fifty years old is old?” Catherine gave him a side – glance. “You look like you’re almost forty-nine. In\nthat case, I should be able to understand you too. Is your body holding up well? You can tell us if"
            },
            {
                "paragraph": "there’s anything wrong. It’s not like the company has to have you as its president.”"
            },
            {
                "paragraph": "Wade’s expression immediately darkened, but he did not lose his temper. Instead, he smiled and made\nit seem like Catherine was being overbearing. “You’ve misunderstood, Ms. Jones. That’s not what I\nmeant. Besides, I’m only forty-one and in good health. Men and women are physically different from\neach other.”"
            },
            {
                "paragraph": "“Sorry, you looked so mature that I was mistaken. ”"
            },
            {
                "paragraph": "Catherine smiled and said, “It’s indeed quite different. After all, the mortality rate of men who die of\ndiseases is far higher than that of women every year. Do you know why? It’s because men generally\nhave a variety of bad habits, such as smoking, drinking alcohol, drinking strong tea, staying up late,\nand spending too much time on a certain aspect of life. Women live over seventy"
            },
            {
                "paragraph": "years on average, while men only live around sixty. Counting it now, you should take care of yourself,\nPresident Middleton. Don’t work too hard.”"
            },
            {
                "paragraph": "Wade looked at the strong tea in front of him and almost lost the temper he was so very good at\ncontrolling."
            },
            {
                "paragraph": "He seemed to understand why Wesley said he had to watch out for this woman. Her mouth was\nabsolutely venomous."
            },
            {
                "paragraph": "“Thank you for the reminder, Ms. Jones. I’ll take care. ” Disgust started to seep in Wade’s fake smile.\n“Now that I can be in charge of a large company"
            },
            {
                "paragraph": "like Hill Corporation, I’ll do my best to manage the company well. I won’t say that I’ll manage it until I’m\nseventy, but I’ll definitely finish everything by sixty.”"
            },
            {
                "paragraph": "“Let’s hope you’ll be able to, ” Catherine smiled. “ But I feel like you won’t have the chance.”"
            },
            {
                "paragraph": "“What do you mean by that, Ms. Jones?” Wade’s face was cold."
            },
            {
                "paragraph": "“That should be my line. When Shaun and I entered the building earlier, not only did the receptionist\nand security guard at the door refuse our entry,"
            },
            {
                "paragraph": "they even ganged up on Shaun. For the staff to have that kind of culture, it’s much worse than when\nEldest Young Master Hill was at the helm. I think I must have a good talk with you on behalf of Lea."
            },
            {
                "paragraph": "You just rose to power, so it’s understandable that you want to change the staff to your confidants, but\nyou can’t just pick any Tom, Dick, and Harry. Before I met you, your reputation was quite admirable but\nnow that I’ve met you, that image crumbled the moment I stepped through the door.”"
            },
            {
                "paragraph": "Catherine looked at Wade’s increasingly unpleasant expression and smiled. “What? I just said a few\nwords and you’re already showing me that face. You have to remember that you’re just a worker.”"
            },
            {
                "paragraph": "“So what if he’s a worker? He’s not someone who can be switched just because you want to.” Jeffery’s\nangry voice suddenly came through the door."
            },
            {
                "paragraph": "Catherine turned around and saw Jeffery in a wheelchair, being pushed in by Wesley."
            },
            {
                "paragraph": "“Mr. Jones, you’re here.”"
            },
            {
                "paragraph": "Wade immediately greeted him with relief. “If you didn’t come, Ms. Jones might have told me to get out\nalready.”"
            },
            {
                "paragraph": "“What right does she have to tell you to get out?” Jeffery snorted coldly."
            },
            {
                "paragraph": "“Dad, why don’t I have that right? I’m your daughter. Look, you even brought your son-in-law here, so\nthat means you’re willing to acknowledge me again.” Catherine smiled enthusiastically."
            }
        ]
    },
    {
        "title": "Chapter 1685 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "Jeffery’s face was indifferent, but his heart was quite smug."
            },
            {
                "paragraph": "After he went to jail, catherine climbed higher and higher, and he always had to yield to her to the point\nwhere he thought he would have to look up to his former daughter with caution for the rest of his life.\nHowever, God was still showing him kindness."
            },
            {
                "paragraph": "Suddenly, he inherited Hill Corporation’s shares. Tsk, he never actually dreamed of such a day."
            },
            {
                "paragraph": "Although Rebecca was his biological daughter, he was not that sad now."
            },
            {
                "paragraph": "Catherine was fawning over him now, but it was only because she wanted to profit from him."
            },
            {
                "paragraph": "Unfortunately, he would not give her a single dime."
            },
            {
                "paragraph": "“I do acknowledge this son-in-law, but I don’t acknowledge an ungrateful daughter like you. Get lost.”\nJeffery insulted nonchalantly."
            },
            {
                "paragraph": "Wesley gave her a fake smile. “Cathy, Dad is quite unhappy about your affair. If you’re willing to return\nto my side, he might be able to forgive you. ”"
            },
            {
                "paragraph": "“You’re so ugly. There’s no way she’ll go back.” Shaun, who had not made a sound the entire time,\nstrode up to Catherine’s side."
            },
            {
                "paragraph": "This was his second time seeing Wesley, but he instinctively felt that this person was extremely\nannoying."
            },
            {
                "paragraph": "Wesley glanced at Shaun coldly. Now, the Shaun who was in front of him was well-dressed and looked\nnoble and elegant, especially after wearing a pair of glasses that made him look like an imperturbable"
            },
            {
                "paragraph": "young master."
            },
            {
                "paragraph": "It was an advantage he never had."
            },
            {
                "paragraph": "His handsome face stiffened slightly and he mocked, “Young Master Hill, you’re here too? But I’m\ncurious. Will you be able to understand our meeting?”"
            },
            {
                "paragraph": "“I’m not deaf,” Shaun scoffed. “But I’m curious too. Do you have any shares? Or are you a shareholder\nof Hill Corporation? What qualifications do you have to step in here?”"
            },
            {
                "paragraph": "Catherine’s brows raised. Who said that this man was stupid?"
            },
            {
                "paragraph": "Sure enough, Shaun’s growth was truly multifold that of ordinary people."
            },
            {
                "paragraph": "He was not once the richest man in the country just for show."
            },
            {
                "paragraph": "Wesley’s expression darkened. “I came today as Mr. Jones’s escort. All relevant documents and\nprocedures have been submitted to President Middleton in advance.”"
            },
            {
                "paragraph": "“That’s right,” Wade nodded with a smile. “Young Master Hill, you shouldn’t make things hard for Mr.\nJones.”"
            },
            {
                "paragraph": "“I’m making things hard for him?” Shaun’s eyes immediately turned fiery. “I’m just questioning him in\naccordance with the company’s rules. How would I know that he completed the formalities in private?\nAs the president of the company, shouldn’t you have reported this to the board of directors in advance?\nDid you say anything about this when we came in? If you don’t know how to talk, then shut that stinking\nmouth of yours. No one will take you for a mute.”"
            },
            {
                "paragraph": "“You…” Wade was furious. He had been in the business for so many years, but no one dared to\ndenounce him to his face before."
            },
            {
                "paragraph": "Even Catherine was just being sarcastic to him earlier."
            },
            {
                "paragraph": "“Did I say anything wrong? Remember your identity. You’ re not a shareholder. The company spent so\nmuch money for you to manage the company, not for you to give us more trouble."
            },
            {
                "paragraph": "You’re supposed to make the company flourish, but look at what you did after you came. You either\nfired this employee or laid off that employee. You even replaced the receptionist and security guards.\nWhat? Are you trying to turn this company into your own?”"
            },
            {
                "paragraph": "Shaun said every word ruthlessly, his dark eyes exuding a powerful and dignified light."
            },
            {
                "paragraph": "Even someone like Wade was frozen for a moment."
            }
        ]
    },
    {
        "title": "Chapter 1686 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "Wade never actually dealt with Shaun before because when Rebecca was around, she held seventy\npercent of Hill Corporation’s shares. That was why he was arrogant enough to bring his people over\nand expel Shaun’s staff."
            },
            {
                "paragraph": "Back then, he was rather apprehensive."
            },
            {
                "paragraph": "He did not expect Shaun would become stupid in just a few days after he entered the company."
            },
            {
                "paragraph": "He had been overjoyed and immediately kicked out those who had been loyal to Shaun. Now, Hill\nCorporation was filled with his men."
            },
            {
                "paragraph": "Little did he expect, Shaun returned to the company and was so aggressive."
            },
            {
                "paragraph": "Was this how a stupid person was supposed to act?"
            },
            {
                "paragraph": "“Young Master Hill, you’ve misunderstood. I fired those people because they weren’t working well, so I\nhad no choice. Don’t make things hard for me because the receptionist and security guard stopped you\nearlier. I’ll have them fired later.”"
            },
            {
                "paragraph": "Wade smiled in compensation, but his words implied that Shaun was making things difficult for him\nbecause of a personal vendetta."
            },
            {
                "paragraph": "Jeffery reprimanded Shaun immediately. “The receptionist and security guards are new, so it’s normal if\nthey don’t know you. Is there a need to make a mountain out of a molehill? If you ask me, I’d say that\nPresident Middleton manages Hill Corporation very well.”"
            },
            {
                "paragraph": "“What was it that he managed well?” Shaun’s dark eyes looked at him."
            },
            {
                "paragraph": "Jeffery subconsciously stopped."
            },
            {
                "paragraph": "Wade never actually dealt with Shaun before because when Rebecca was around, she held seventy\npercent of Hill Corporation’s shares. That was why he was arrogant enough to bring his people over\nand expel Shaun’s staff."
            },
            {
                "paragraph": "How would he know? It was his first day here too."
            },
            {
                "paragraph": "He looked at Wesley and Wesley smiled. “It’s clear that President Middleton is skilled since he was\nable to stabilize the company in just a few days."
            },
            {
                "paragraph": "Previously, Hill Corporation was quite turbulent, but now it’s business as usual. Uniting the company\nisn’t something ordinary people can do.”"
            },
            {
                "paragraph": "Shaun sneered. “He replaced every staff with his people, so for sure the company is united. I’m a board\ndirector, so what I want to see are concrete benefits. How did his people fare in technology,\ndevelopment, sales, resources, and so on?”"
            },
            {
                "paragraph": "Wade looked at Wesley for help."
            },
            {
                "paragraph": "Wesley gave Jeffery a look, and Jeffery rebuked, “ President Middleton had just been here for a few\ndays and taking it one step at a time. Besides, you took away all the laboratory information, so it’s your\nfault that there’s been no progress within the technology and development departments. Despite that,\nyou still had the cheek to blame others? For the future of the company, you should quickly hand over\nthe information and share it with us in order to bring a bright future to Hill Corporation.”"
            },
            {
                "paragraph": "Catherine laughed. “Dad, you’re too much. The Hill family only has a total of thirty percent of the\nshares, and the Hill family was removed from all of their positions. Yet, you’re asking him to hand over\nthe technical data that he has? You sure devised a good plan to get free benefits. If you ask me, we\nmight be able to consider it if you hand over 20% of your shares. Isn’t Rebecca dead? That’s great, this\nis a good opportunity.”"
            },
            {
                "paragraph": "“You… You’re deranged.” Jeffery was furious. After all, she said that it was good that Rebecca was\ndead. “Even if she’s dead, the shares will never fall into the Hill family’s hands.”"
            },
            {
                "paragraph": "“I didn’t say that they’ll fall into our hands. I’m proposing an exchange of interests. But you’re not\nnecessarily the one taking over her shares, right?”"
            },
            {
                "paragraph": "Catherine grinned."
            },
            {
                "paragraph": "“Who else would it be besides me?” Jeffery snorted."
            },
            {
                "paragraph": "“Rebecca didn’t contribute a penny when she bought Hill Corporation’s shares.”"
            },
            {
                "paragraph": "The conference room door was violently kicked open."
            },
            {
                "paragraph": "Dressed in black pants and a black t-shirt, Titus strode in with his assistant and lawyer."
            },
            {
                "paragraph": "His two—meter—tall figure coupled with a powerful aura emanating from his body and the fierce air he\ncultivated from fighting on a battlefield since he was young instantly dropped the temperature in the\nroom."
            },
            {
                "paragraph": "Even Wesley was a little frightened and intimidated."
            }
        ]
    },
    {
        "title": "Chapter 1687 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "Wesley had already investigated Titus when he told Rebecca to approach the latter."
            },
            {
                "paragraph": "This person was different from them. His hands were stained with the blood and lives of others."
            },
            {
                "paragraph": "Unlike other people, Titus never had other people do the dirty work for him. Instead, he did it himself."
            },
            {
                "paragraph": "Moreover, Neah Bay was a place where the lines were blurred, and it was home to killers who\ncommitted heinous crimes. However, under the Costner family’s management, Neah Bay was ruled\nstrictly, and no one dared to make trouble there."
            },
            {
                "paragraph": "This was only possible because of Titus’s reputation for being ruthless and merciless."
            },
            {
                "paragraph": "Wesley only dared to scheme against Titus because he was desperate. Furthermore, Titus was here in\nAustralia, where the Cosner family’s power was not as strong. It was only after Wesley quickly\nexchanged the shares and won over Minister Mead, tying him onto the same boat, that he had the guts\nto fight Titus."
            },
            {
                "paragraph": "Jeffery’s body completely froze when Titus arrived."
            },
            {
                "paragraph": "He had met Titus before. This man was very dangerous, but now, Jeffery wanted to bite the food out of\nhis mouth."
            },
            {
                "paragraph": "“Who are you?” Wade did not know Titus, so he was the first to speak out."
            },
            {
                "paragraph": "Titus ignored him as his gaze fell on Wesley instead, flashing him a fake smile. “You must be Wesley\nLyons. I’ve heard a lot about you.”"
            },
            {
                "paragraph": "“Who might you be?” Wesley shuddered but pretended not to know him and asked politely."
            },
            {
                "paragraph": "“You’re quite good at acting.” Titus laughed with a deep gaze."
            },
            {
                "paragraph": "His assistant immediately dragged out a leather chair for him."
            },
            {
                "paragraph": "Titus sat on it and lit a cigar. After exhaling the thick smoke, he said, “You should be very familiar with\nme. After all, you’ve been scheming against me for a long time. Hm… My wife currently has to be\ntreated in the hospital for treatment, and my son is missing. You’re the one behind it all, right? It’s quite\namazing. Young man, I haven’t been played like this for a long time.”"
            },
            {
                "paragraph": "“I don’t know what you’re talking about. ” Wesley looked puzzled and innocent. “This is my first time\nseeing you.”"
            },
            {
                "paragraph": "Catherine gnashed her teeth as she watched from the side. To be honest, if she were Titus, she would\nhave pressed the cigar on Wesley’s shameless face in anger."
            },
            {
                "paragraph": "However, Titus simply nodded calmly. “Maybe you’ll know me well soon. For example, once you\nreceive a call from Country Y saying that the medical agreement they have with you has been\ncanceled. You will never be able to sell your medicine and equipment in Country Y, and no country in\nthe world will cooperate with Golden Corporation anymore. You’ve been blacklisted.”"
            },
            {
                "paragraph": "As he spoke, he looked down at his watch. “The call from Country Y should come right about now.”"
            },
            {
                "paragraph": "Just then, Wesley’s phone rang."
            },
            {
                "paragraph": "It really was a call from Country Y."
            },
            {
                "paragraph": "Wesley’s handsome face paled. Nevertheless, he had no choice but to pick up the phone."
            },
            {
                "paragraph": "Catherine noticed Wesley’s pupils shrank once he answered the call, and his smug face had gone\nwhite."
            },
            {
                "paragraph": "She knew that Titus had made his move. Wesley had provoked him this time."
            },
            {
                "paragraph": "After finally hanging up the phone, Wesley looked at Titus with aggrieved, angry, and pleading eyes.“\nGolden Corporation has always been doing business in a proper manner. How exactly did I provoke\nyou? Do you know the number of people in Country Y who are waiting for my medicine? The medical\ntreatment there is underdeveloped, and many people want to cure their diseases. However, there are\nno quality medicines for them to buy. The people there were very happy about Golden Corporation’s\ncooperation with Country Y.”"
            }
        ]
    },
    {
        "title": "Chapter 1688 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "“I have never wanted to do any harm. On the contrary, my aim is to make it possible for the poor and\nunderdeveloped countries around the world to cure diseases rather than be plagued with illnesses and\ndying in despair. Do you know that feeling?”"
            },
            {
                "paragraph": "Catherine was deeply revolted."
            },
            {
                "paragraph": "She realized Wesley really had the potential to be a movie star."
            },
            {
                "paragraph": "How did this absolute monster, who he did not even spare his nephew, have the nerve to say he\nwanted to save sick people around the world?"
            },
            {
                "paragraph": "“Blergh.”"
            },
            {
                "paragraph": "She did not vomit, but beside her, Shaun let out a gagging sound. “I’m going to puke. If you ask me,\nAustralia’s medical treatment isn’t considered top- notch either. Since more developed countries look\ndown on you when you try to sell your medicine to them, you can only sell to poorer countries to earn\nmoney. After all, although the people there are poor, medicine is a must, so you’ll gain a quick profit\nwhile exploiting the poor to death. Yet,"
            },
            {
                "paragraph": "you’ re still making yourself a saint. Do you think everyone here is stupid?”"
            },
            {
                "paragraph": "Titus raised his brows, amused by Shaun’s words. “ That’s right. I’ve seen all kinds of people before,\nbut such a disgusting person like you is rare.”"
            },
            {
                "paragraph": "With Wesley’s strong ego, the repeated humiliation made him clench his fists tightly."
            },
            {
                "paragraph": "Titus slowly stood up and walked towards Wesley."
            },
            {
                "paragraph": "Jeffery and Wesley froze. When Titus’s tall and cold figure approached them, they were subconsciously\nafraid."
            },
            {
                "paragraph": "However, Jeffery was in a wheelchair and could not retreat. As such, he could only grip the armrest, not\nknowing what else to do."
            },
            {
                "paragraph": "“Mr. Costner, what are you planning to do? This is Hill Corporation. This is Australia,” Wesley reminded\nhim in a low voice."
            },
            {
                "paragraph": "“I thought you didn’t know who I am? So you know that I’m not from here.” Titus slowly unbuttoned the\nfirst two buttons of his shirt and rolled up his sleeves, revealing his study bronze arms. His firm and\nstrong fists made their scalps tingle."
            },
            {
                "paragraph": "“Guards!” Wade hurriedly called for backup when he saw that the situation was not right."
            },
            {
                "paragraph": "However, Warren held Wade’s arm behind his back and pressed him onto the conference table."
            },
            {
                "paragraph": "At the same time, Titus’s fist swiftly punched Wesley’s face."
            },
            {
                "paragraph": "Wesley was l8ocm tall, but his body was slammed into the wall. His lips were smeared with blood, and\nhis teeth fell out. It was so painful that he could not speak."
            },
            {
                "paragraph": "Jeffery was terrified. “You… Stop that. If you hit us again, I’ll call the cops.”"
            },
            {
                "paragraph": "“Go ahead, and call the cops. I’d like to see who dares to arrest me.” Titus raised his brows\nnonchalantly. “Even if you call Gavin Mead here today, he won’t dare to arrest me either.”"
            },
            {
                "paragraph": "“Just you wait…” Wesley stood up with much difficulty, and his trembling finger pointed angrily at Titus."
            },
            {
                "paragraph": "However, Titus grabbed his finger and broke it with a snap."
            },
            {
                "paragraph": "Wesley immediately screamed in pain."
            },
            {
                "paragraph": "“Didn’t you tell me to wait?” Titus approached him with a smile and whispered in his ear, “Do you think I\nwon’t dare to fight back because my son is i n your hands?”"
            },
            {
                "paragraph": "Wesley glared at him with red eyes. At that moment, he stopped pretending, because if he continued\nthe act, he did not know if he could walk out of here today. “If… If you dare to lay a hand against me, I’ll\ncut off one of your son’s hands.”"
            },
            {
                "paragraph": "“Go ahead.” Titus did not even blink. “I’m planning to save him, but I don’t expect him to be in one\npiece. It’s just an arm, so think of it as a lesson to him. He’s supposed to be the son of Titus Costner,\nbut he’s useless. Honestly, a son like that isn’t worthy of being my heir.”"
            }
        ]
    },
    {
        "title": "Chapter 1689 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "Wesley listened to Titus’s light-hearted tone and saw his cold, dark eyes."
            },
            {
                "paragraph": "He could not help but shudder."
            },
            {
                "paragraph": "He admitted that he thought he had a hold on Titus. Since Titus only had one son with Sheryl, he must\ntreasure Matthew very much. However, Wesley had underestimated this man’s ruthlessness."
            },
            {
                "paragraph": "Wesley’s lips went pale from the pain, and a cold sweat broke out on his forehead. Like a snake’s,\nagony-filled eyes gradually tinged with viciousness. “If you keep at it, you’ll have to collect your son’s\ncorpse. I’ve hidden him in a place where no one can find him.”"
            },
            {
                "paragraph": "“That’s more like it.” Titus laughed in a low voice and let him go, unfazed at being threatened. “ That’s\nwhy I hate dealing with hypocritical people. What’s the point? If you’ve caught him, then just admit it.\nWhy did you have to act?”"
            },
            {
                "paragraph": "Wesley took two steps back miserably as he clutched his broken wrist and breathed heavily. “ Titus\nCostner, apologize to me immediately or I’ll"
            },
            {
                "paragraph": "cripple your son and cut off your family’s bloodline.”"
            },
            {
                "paragraph": "The first thing he did when he escaped was to threaten Titus again."
            },
            {
                "paragraph": "Warren said angrily, “If you dare to harm the young master, we’ll destroy the Lyons family.”"
            },
            {
                "paragraph": "“The Lyons family isn’t as valuable as Young Master Costner.” Seeing Warren angry made Wesley feel\nlike he had recovered his ground and dignity again. As such, he said viciously, “Titus, as long as you\nbreak one of your own hands, I’ll pretend that today’s events never happened…”"
            },
            {
                "paragraph": "Before he could finish speaking, he was kicked by Titus’s long legs once again."
            },
            {
                "paragraph": "Wesley fell to the ground and spat a mouthful of blood."
            },
            {
                "paragraph": "Then, Titus walked over and stepped on Wesley’s face. “I gave you an inch, and you immediately took\na mile. Did you forget what I said earlier? I don’t care if my son is missing an arm or a leg. I just want\nhim alive. However, people like you should be quite afraid of dying, so you should understand that his\nlife is your only lifeline. Don’t threaten me however you like. I hate being threatened.”"
            },
            {
                "paragraph": "Wesley could not get up at all. He felt like a sandbag. His face was covered with blood, and his\nhandsome face was trampled flat. He had never been humiliated like this before."
            },
            {
                "paragraph": "Even the humiliation that Shaun gave him was not as cruel as this."
            },
            {
                "paragraph": "He trembled in anger, but no one entered the office, and no one helped him up either."
            },
            {
                "paragraph": "At the side, Jeffery and Wade were so frightened that they shook."
            },
            {
                "paragraph": "Who was Wesley Lyons? It was not an exaggeration to say that he was a figure at the top of the\nbusiness pyramid, as well as Minister Mead’s favorite. In the past, he had to beg others to do things.\nYet now, other people had to beg him instead."
            },
            {
                "paragraph": "Nevertheless, he was trampled all over like an ant."
            },
            {
                "paragraph": "“He’s pretty heavily injured. Aren’t you his men? Are you going to call an ambulance, or do you want\nhim to die?” Titus looked at Jeffery and Wade."
            },
            {
                "paragraph": "Wade was so frightened that he quickly called 000."
            },
            {
                "paragraph": "However, since the ambulance would not arrive so soon, Shaun said with disgust, “Can you carry him\nout first? There’s blood everywhere. How annoying.”"
            },
            {
                "paragraph": "“That’s right. It’s quite disgusting. ” Titus moved his long leg away and nodded."
            },
            {
                "paragraph": "With that, Wade hurriedly dialed the internal line and told the security guards to carry Wesley out."
            },
            {
                "paragraph": "Although he was not sure of Titus’s identity, the fact that the latter dared to hit Wesley unscrupulously\nshowed how terrifying his identity was."
            },
            {
                "paragraph": "Even so, Wesley seemed to have kidnapped his son, so he probably would not dare to take Wesley’s\nlife. To put it bluntly, he was most likely just venting his anger today."
            },
            {
                "paragraph": "As Wesley was leaving, he glared at Titus viciously. “ Just you wait…”"
            }
        ]
    },
    {
        "title": "Chapter 1690 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "If other people were not around, he would have slapped Catherine to death."
            },
            {
                "paragraph": "“Hundreds of billions worth of shares?” Titus played with the diamond ring on his ring finger and let out\na deep laugh. “Why are you the one inheriting it? Who do you think you are? A reformed prisoner?”"
            },
            {
                "paragraph": "His words were loud and clear, and the conference room fell eerily quiet."
            },
            {
                "paragraph": "Jeffery’s face went red, but he bit the bullet and said, “I’m Rebecca’s father. She’s dead and has no\nchildren. According to the laws, it should be inherited by her parents.”"
            },
            {
                "paragraph": "“Are you sure you’re her parent?” Titus stared at Jeffery with his deep and cold eyes. “But I clearly\nremember that when we were in Melbourne not long ago, you said that her father was someone else\nand her mother was my wife, Sheryl.”"
            },
            {
                "paragraph": "Jeffery said, “Did I say that? She’s my daughter in her birth certificate anyway.”"
            },
            {
                "paragraph": "“Is that so?” Titus raised his hand to the lawyer next to him."
            },
            {
                "paragraph": "The lawyer immediately took out a pile of documents from his briefcase and handed it over."
            },
            {
                "paragraph": "Titus threw the documents in front of Jeffery. “ Then take a good look at this. Your so-called daughter\nspent more than goo billion of my wife’s money the other day. According to the law, the money that\nRebecca has spent is my wife and my joint assets, so I have the right to get the money back. Since\nshe’s dead, you’ll pay it back as her father.”"
            },
            {
                "paragraph": "“O-on what basis?” Jeffery looked at the figures on the document and nearly went crazy."
            },
            {
                "paragraph": "He had never seen so much money in his life. “You’re really funny. Your daughter is dead, and you\nwant the shares she has left behind but refuse to pay back the huge amount of money she owes."
            },
            {
                "paragraph": "How can you reap the benefits and leave the bad to me? Oh, by the way, here’s a copy of your\ndaughter’s DNA test. It says that Rebecca is Sheryl’s biological daughter, but you’re saying that she’s\nyours.”"
            },
            {
                "paragraph": "Titus threw another appraisal form at him. “Well, can I take it that the three of you are engaged in\nfraud? First, you used this DNA test to approach my wife and had her think that Rebecca was her long-\nlost daughter before you cheated my wife of her money. Now that Rebecca is dead, you want to take\nover the company that my wife has spent money to acquire for her?”"
            },
            {
                "paragraph": "Jeffery sweated profusely. That was exactly it."
            },
            {
                "paragraph": "However, he could not admit it. Admitting it meant that he would go to jail, and he did not want to go to\njail again."
            },
            {
                "paragraph": "“I don’t know what you’re talking about. We didn’t know that Rebecca did a DNA test. All I know is that\non her birth certificate, Sally and I are listed as her parents. We were also the ones who raised her.”"
            }
        ]
    },
    {
        "title": "Chapter 1691 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "Titus’s lawyer came forward and said, “Excuse me. The money that Rebecca spent to acquire Hill\nCorporation came from Mr. and Mrs. Costner’s"
            },
            {
                "paragraph": "bank account. If you insist on taking over Hill Corporation, we’ll have to send an appeal to the court to\nfreeze this part of the shares.”"
            },
            {
                "paragraph": "“You have no right to do that,” Jeffery said anxiously. “My sister gave her the money. Tell her to come\nout and talk.”"
            },
            {
                "paragraph": "“She’s sick and hospitalized. As her husband, I have the right to recover our joint assets as a married\ncouple.”"
            },
            {
                "paragraph": "Titus leaned against the leather seat. “Besides, I seriously suspect that you three are fraudsters."
            },
            {
                "paragraph": "Coincidentally, Rebecca’s remains should still be frozen, so that makes things easier. We’ll just get\nsomething from her body to have a DNA test done. Of course, if she’s not my wife’s biological\ndaughter, not only will I recover the assets, but I’ll also sue you for committing fraud worth an\nastronomical goo billion dollars, which is unprecedented. I’m afraid you’ll probably be given the death\nsentence by then.”"
            },
            {
                "paragraph": "“You’re talking nonsense. We didn’t commit fraud.” Jeffery’s blood boiled."
            },
            {
                "paragraph": "He did not know what to say anymore. His vision went black, but it was not enough to make him faint,\nso he pretended to be short of breath and then passed out in his wheelchair."
            },
            {
                "paragraph": "Wade, who hosted the meeting today, hurriedly got up again to call the secretary. “Is the ambulance\nhere yet? Another person has fainted in the conference room. Send him over as well… Hurry up. Don’t\ntarry and risk a life…”"
            },
            {
                "paragraph": "After Wade hung up the phone, the meeting room was dead silent."
            },
            {
                "paragraph": "He then smiled at Titus and said, “I didn’t know there was such a big dispute in the shares. Let’s cancel\nthe meeting today and discuss it again next time, or we can discuss it in detail after you two settle your\ndisputes in private.”"
            },
            {
                "paragraph": "Titus glanced at him. “Did you know that the money Rebecca spent to hire your team to Hill\nCorporation was also my wife’s?”"
            },
            {
                "paragraph": "The smile on Wade’s face froze."
            },
            {
                "paragraph": "Back then, Rebecca offered to hire him with an annual salary of 3oo million."
            },
            {
                "paragraph": "“She spent my wife’s money and hired a piece of trash like you for 300 million dollars?” Titus did not\nconceal the contempt in his eyes."
            },
            {
                "paragraph": "“Mr. Costner, I don’t think I’ve offended you before. ” Wade took a deep breath and held back his anger.\n“If Rebecca hadn’t begged me to, I wouldn’t have come here.”"
            },
            {
                "paragraph": "“Enough. Don’t treat everyone like a fool. You know very well who recommended you to Rebecca.”"
            },
            {
                "paragraph": "Titus stood up slowly. “I have no reason to interfere in your company’s affairs, but I won’t let goo billion\ndollars go to waste. I’ll sue you to court."
            },
            {
                "paragraph": "Soon, 70 percent of Hill Corporation’s shares will be frozen. As for your 300 million, I’ll recover it soon\nas well.”"
            },
            {
                "paragraph": "Then, he looked away from Wade’s dark and stiff expression and shoved his hands in his pockets as\nhe left with his assistant and secretary."
            },
            {
                "paragraph": "Catherine watched Titus’s figure disappear before looking away, only to see Shaun staring at her in\ndissatisfaction."
            },
            {
                "paragraph": "How did she upset him again?"
            },
            {
                "paragraph": "However, now was not the time to pursue this."
            },
            {
                "paragraph": "Catherine smiled at Wade and said, “She hired you for 3oo million? That’s too expensive. I don’t think\nthat’s necessary.”"
            },
            {
                "paragraph": "“No matter how reluctant you are, Ms. Jones, Rebecca and I have signed a contract that has been\nstamped with the company’s official seal, ” Wade said with a sneer. “So what? We can break the\ncontract, ” Catherine said coldly. “Do you really think the company is yours? Don’t think I don’t know\nthat Wesley is backing you. Let me remind you that once the shares in Rebecca’s hands are frozen\nand the lawsuit drags on for a while, the Hill family will have the final say. When that time comes, we\ncan tell you to get lost anytime we want.”"
            }
        ]
    },
    {
        "title": "Chapter 1692 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "“You…”"
            },
            {
                "paragraph": "“Besides, as the president, you refuse to follow the director’s orders, and you go against us instead. I\neven suspect that you want to take over the company. Look at Hill Corporation’s top brass."
            },
            {
                "paragraph": "They’re all your people. Do you think any Tom, Dick, and Harry can come here and do as they please?”\nCatherine enunciated each word with a tone so cold that it made Wade’s facial muscles twitch and\ntremble."
            },
            {
                "paragraph": "Shaun had never seen Catherine so cold before, but this only made her look even more attractive. She\nwas simply a cold beauty."
            },
            {
                "paragraph": "Wade sneered. “Ms. Jones, not only do you want to dismiss me, but you want to get rid of all the\nexecutives I hired as well, right?”"
            },
            {
                "paragraph": "“What if I do? Will you get lost?”"
            },
            {
                "paragraph": "Catherine mocked, “People like you will stay here shamelessly anyway.”"
            },
            {
                "paragraph": "Wade clenched his fists in anger."
            },
            {
                "paragraph": "“I know you won’t leave.”"
            },
            {
                "paragraph": "Catherine said, “But from tomorrow onward, Shaun will return to the company to assume the position of\npresident. You’ve been demoted, but you don’t have to feel unhappy about it. When the board of\ndirectors exercises its powers, a worker like you has no qualifications to say no.”"
            },
            {
                "paragraph": "Then, she held Shaun’s hand and walked away."
            },
            {
                "paragraph": "When they got to the door, the sound of a cup smashing came from the inside."
            },
            {
                "paragraph": "Catherine gave Shaun a look."
            },
            {
                "paragraph": "Shaun immediately understood her. With that, he clenched his fists and turned around."
            },
            {
                "paragraph": "It was just in time for him to see Wade glaring at their backs ferociously and the shattered cup on the\nground."
            },
            {
                "paragraph": "“Wow. Not bad. ” Shaun raised the eyebrows on his grim but handsome face. “It’s the first time I’ve\nseen a president daring enough to smash a cup and glare at the board of directors.”"
            },
            {
                "paragraph": "“No, I accidentally knocked the cup down, ” Wade said coldly. “What? My facial muscles are twitching\nout of control too. I didn’t do it on purpose. Did you see me do it?”"
            },
            {
                "paragraph": "“It’s my first time seeing a worker who’s more arrogant than the boss. Fine, you can get lost now. You\ndon’t have to come to the company tomorrow.”"
            },
            {
                "paragraph": "Shaun snorted in disgust and pulled Catherine away."
            },
            {
                "paragraph": "However, along the way, the thought of Wade’s face still disgusted him. “Do you think he’ll leave\ntomorrow?”"
            },
            {
                "paragraph": "Catherine smiled. “Haven’t you heard the saying that it’s easier to invite the devil in than it is to send\nhim away?”"
            },
            {
                "paragraph": "“No…” Shaun shook his head firmly."
            },
            {
                "paragraph": "Catherine was speechless. She forgot that he had lost his memory. “He won’t leave. Wesley must’ve\nbribed him and given him a lot of benefits, so he doesn’t even need his dignity anymore. If you come to\nthe company tomorrow, he’ll definitely make the top management refuse to work with you. Even if you\nbecome the president, it’s just an empty seat.”"
            },
            {
                "paragraph": "“They can dream on if they want to make me a figurehead.” Shaun’s eyes flashed with anger. “ Cathy, I\nthink you have it too hard. Do you have to deal with these kinds of scum often? Don’t worry. Sooner or\nlater, I’ ll trample over them and make them respect and revere you.”"
            },
            {
                "paragraph": "Catherine turned around, and when she saw his serious expression, warmth filled her heart. “ Shaunny,\ndon’t take it too seriously. After all, as long as Uncle Titus recovers the shares and stops Wesley and\nJeffery from succeeding, Wade will be helpless. He’s just a scoundrel.” “Okay. Cathy, I think Uncle Titus\nis quite impressive. ” Shaun suddenly looked at her with a complicated gaze. “Do you admire him very\nmuch? You kept staring at his back when he left. It was as if you were reluctant to look away from him.”"
            }
        ]
    },
    {
        "title": "Chapter 1693 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "Cathy was speechless. So that was why he was unhappy just now."
            },
            {
                "paragraph": "“Yes, I admire him quite a bit.” Catherine nodded without concealing her admiration."
            },
            {
                "paragraph": "Titus may be both good and evil, but ever since he rescued Suzie, Catherine began to respect the man\nfrom the bottom of her heart."
            },
            {
                "paragraph": "He pampered and cherished Shery as a husband, but he did not overindulge her. To be truthful, with\nTitus’s strength, Shaun and she might have died long ago if he went all out on them when he first came\nto Melbourne."
            },
            {
                "paragraph": "It was said that the more money a man had, the more bad habits he had. However, she could not see\nthat in Titus."
            },
            {
                "paragraph": "He was truly good to Sheryl. Whether she was good or bad, he did not abandon her when she became\nsick."
            },
            {
                "paragraph": "Although she did not like Sheryl, she was envious of that love and marriage."
            },
            {
                "paragraph": "As for herself, her marriage was a failure, and Shaun was not as open-minded and tolerant as Titus\neither. Otherwise, he would not have been easily deceived and used by Sarah."
            },
            {
                "paragraph": "Perhaps he did change a lot after they reconciled, but not long after they got back together, he…"
            },
            {
                "paragraph": "Catherine looked at Shaun sadly and saw him frowning despondently."
            },
            {
                "paragraph": "“Cathy, don’t worry. I’ll become an admirable man like him.” Shaun clenched his fists in determination.\n“I’ll study hard and take Hill Corporation back.”"
            },
            {
                "paragraph": "Catherine smiled. “I admire him not because of how domineering he is in the business world. You won’t\nunderstand.”"
            },
            {
                "paragraph": "“Then you can tell me. I can learn,” Shaun quickly added."
            },
            {
                "paragraph": "“What do you want to learn?” Catherine gave him a side glance. “What I admire is his fidelity to\nmarriage and how forgiving he is when it comes to love. Who are you going to use this on if you learn\nit?”"
            },
            {
                "paragraph": "Shaun froze."
            },
            {
                "paragraph": "He was still very far from experiencing marriage and love."
            },
            {
                "paragraph": "He was a little distressed. He had never encountered these before yesterday. In fact, he could tell from\nthe group photos on his phone that he had a close relationship with Cathy."
            },
            {
                "paragraph": "However, Cathy was married and had children. What relationship did he use to have with her? Shaun\nwas very lost."
            },
            {
                "paragraph": "“Let’s go home. You still have class later.” Catherine did not think too much about it. She admitted that\nShaun was growing very fast, but how unlikely was it for him to understand love yet?"
            },
            {
                "paragraph": "Not long after getting into the car, Freya called. “ Cathy, are you done? Rodney said he wants to go to\nthe manor to visit Shaun. I also haven’t seen you for several days, so I’ll be coming along with him.”"
            },
            {
                "paragraph": "“Tsk. You two are getting along quite well, huh? You’re even going to places as a couple now."
            },
            {
                "paragraph": "Catherine teased with a grin."
            },
            {
                "paragraph": "“Don’t be ridiculous.” Freya hurriedly warned her in a low voice."
            },
            {
                "paragraph": "Catherine could instantly guess that Rodney might be present, so she smiled. “Okay, then. I’ll go to the\nsupermarket later to buy some groceries. You’re more than welcome to come over.”"
            },
            {
                "paragraph": "“Hehe. Remember to make a few more of my favorite dishes.”"
            },
            {
                "paragraph": "Freya grinned and hung up the phone. Once she turned around, she was confronted with Rodney’s\nhandsome face."
            }
        ]
    },
    {
        "title": "Chapter 1694 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "Her lips almost hit his nose, but she held her breath for one second, and her mixed-race featured face\nsuddenly reddened. “Rodney Snow, why are you so close? Are you insane?”"
            },
            {
                "paragraph": "“You’re the insane one, Freya Lynch. Are you incapable of saying anything nice?” Rodney was\nfrustrated. However, when he looked at her rosy face, a strange feeling surfaced in his heart."
            },
            {
                "paragraph": "Recently, Freya’s belly had grown as huge as a balloon, and her face was much rounder than before.\nShe looked a little chubby, but her skin was glowing from her diet at home. It made people want to\npinch her."
            },
            {
                "paragraph": "“I do say nice things, but not to you, ” Freya snorted. “Cathy has to go grocery shopping, so we’ll go\nover a little later.”"
            },
            {
                "paragraph": "“Oh, that’s fine. I have to go upstairs and do something.” Rodney smiled strangely and excitedly ran\nupstairs."
            },
            {
                "paragraph": "Freya stared at his back, puzzled."
            },
            {
                "paragraph": "An hour later, Rodney drove to Hill Manor."
            },
            {
                "paragraph": "Since the manor was not far away, they arrived in less than half an hour."
            },
            {
                "paragraph": "As this was Freya’s first time at the manor, she became envious when she saw such a large manor. “\nThis place is so big. Compared to yours, my villa is only a little bigger than your bathrooms.”"
            },
            {
                "paragraph": "Rodney retorted awkwardly, “Whose bathrooms are this big?”"
            },
            {
                "paragraph": "“Yeah, the bathrooms here are about the same as yours.” Catherine grinned. “Let me show you around\nand pick some fruits along the way.”"
            },
            {
                "paragraph": "“Sure. ” Freya turned to Rodney and said, “Don’ t follow me around. You can look for Shaun instead. ”"
            },
            {
                "paragraph": "“Why would I follow you around anyway? Nobody cares. Do you think you’re that popular?” Rodney\nsnapped instinctively."
            },
            {
                "paragraph": "“Great. Then don’t follow me around in the future.” Freya sneered."
            },
            {
                "paragraph": "Rodney choked. “Do you think I want to follow you around? You’re the one who’s always rash. I’m\nworried that you’ll hurt the child.”"
            },
            {
                "paragraph": "“Thanks. If you didn’t push me because of Sarah, m y child would have been healthier than anyone\nelse.” Freya sneered back."
            },
            {
                "paragraph": "“That happened a long time ago. Why are you still bringing it up? Forget it. I’m not going to argue with\nyou. I’m going to find Shaun. ” Rodney waved his hand in anger and quickly walked away."
            },
            {
                "paragraph": "Catherine was speechless. “You two… Aren’t you tired of bickering all the time?”"
            },
            {
                "paragraph": "“It’s fine. It’s just a waste of saliva.” Freya shrugged. “In fact, I won’t be used to it if he doesn’t bicker\nwith me one day.”"
            },
            {
                "paragraph": "“Serves you right that you’re stuck together.” Catherine sighed."
            },
            {
                "paragraph": "Freya looked at her in confusion. “Why?”"
            },
            {
                "paragraph": "“The two of you are so sharp -tongued. If you two didn’t get together, you’d be destined to live a lonely\nlife.” Catherine said, “Now, at least you have each other.”"
            },
            {
                "paragraph": "“You can kiss our friendship goodbye.” Freya waved her hand in anger."
            },
            {
                "paragraph": "“I’m joking.” Catherine hurriedly grabbed her hand. “How’s the baby? Is she naughty?”"
            },
            {
                "paragraph": "“Don’t talk about it. She keeps kicking my stomach at night. She’s so annoying, ” Freya said with\ndisdain, but her eyes were sparkling."
            },
            {
                "paragraph": "“You really think she’s annoying?” Catherine raised her eyebrows. She was also a mother, so she knew\nthat mentality best. “Tell the truth.”"
            },
            {
                "paragraph": "Freya said with mixed feelings, “You know it. I never used to welcome her arrival, but as my belly got\nbigger, the baby grew bigger too. When I eat my favorite food, she gets very excited in my belly."
            },
            {
                "paragraph": "When I play her music, she’ll move as well. It’s amazing. All of a sudden, it hit me that I’m really about\nto become a mother, and I have to be responsible for a life.”"
            },
            {
                "paragraph": "“Every mother goes through that journey,"
            },
            {
                "paragraph": "including me. When she’s born, you’ll feel it’s even more wonderful. Although life is filled with many\nunhappy things, children are all little angels, ” Catherine said with a smile."
            }
        ]
    },
    {
        "title": "Chapter 1695 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "“He doesn’t think of himself as a two-year-old baby anymore. I told him that he’s actually older than me.\nI’ve recently hired several professors for him, and he’s learning rapidly. He’ll probably catch up to his\nprevious level of knowledge in a month.”"
            },
            {
                "paragraph": "“But… So what? He still doesn’t remember the past and the feelings both of you used to share.” Freya\nhesitated and then reminded her, “How many times has he forgotten you and then fallen in love with\nyou again?”"
            },
            {
                "paragraph": "Catherine fell silent and became a little sad. Yes, how many times has it been?"
            },
            {
                "paragraph": "It seemed like ever since she met Shaun in Melbourne, she had always been the one trying her best to\npursue him and attract his attention."
            },
            {
                "paragraph": "Even after she came back from the United States, she used her methods to seduce him from Sarah."
            },
            {
                "paragraph": "Yes, she succeeded every time, but was she tired? She was really tired."
            },
            {
                "paragraph": "The mutual and pure love was always out of her reach."
            },
            {
                "paragraph": "“I don’t know.” Catherine was lost. “Back then, his memory was only disordered, but this time, he is like\na baby. He is a blank slate when it comes to feelings. In fact, I can easily make him fall in love with me.\nHowever, life is a long journey, and I can’t help but wonder if it’ll happen again. If it does, will I be able\nto take the initiative and stay strong every time? How many times can I do this? I’m not made of steel.\nI’m just an ordinary woman.”"
            },
            {
                "paragraph": "“Cathy, I have never commented about your relationships, but my heart aches for you when I see you\nlike this. I really do feel like… Shaun doesn’t know how to take care of himself at all. If he wants to date\nyou, don’t agree to him so easily.”"
            },
            {
                "paragraph": "Freya said, “He has it good to be able to just forget everything. To be honest, if the person I like forgets\nme time and time again, I will want to slap him to death even if he was tricked by another person."
            },
            {
                "paragraph": "Since he has a wife and child, it’s his responsibility to protect his own brain.”"
            },
            {
                "paragraph": "“You’re right. ” Catherine smiled. “Let’s wait for now. After this is all over, I want to be single for a while.\nRelationships are always like that. Although it’s sweet sometimes, it can be very painful some other\ntimes too, especially… your feelings. You’ ll"
            },
            {
                "paragraph": "always be the only one who remembers the unforgettable events.”"
            },
            {
                "paragraph": "“Will Shaun remember the past? Will Chester be able to find a way?” Freya asked."
            },
            {
                "paragraph": "“I don’t know either.”"
            },
            {
                "paragraph": "In the study."
            },
            {
                "paragraph": "Shaun was on his laptop, carefully studying Hill Corporation’s relevant information."
            },
            {
                "paragraph": "He wanted to master all the information regarding Hill Corporation quickly so that he could take control\nof Hill Corporation as soon as possible and lessen Cathy’s burden."
            },
            {
                "paragraph": "“Thump thump.”"
            },
            {
                "paragraph": "There was a sudden knock on the door outside."
            },
            {
                "paragraph": "Thinking it was Aunty Yasmine sending him food, he said, “Come in.”"
            },
            {
                "paragraph": "“Shaun, I’m here to play with you.” A beautiful man with an alluring face and dressed in a floral shirt\ncame in."
            },
            {
                "paragraph": "Shaun cast him a cold side glance. He remembered this face. This person had visited him in the\nhospital before, but he did not remember his name."
            },
            {
                "paragraph": "“Who are you?”"
            },
            {
                "paragraph": "Rodney’s beaming face froze. “I… I’m Rodney. I introduced myself to you when I was at the hospital to\nsee you.”"
            },
            {
                "paragraph": "“Oh. ” Shaun’s gaze returned to the laptop screen, treating Rodney as if he was invisible."
            },
            {
                "paragraph": "Rodney felt like he was back in junior high school. Damn it. Back then, Shaun also treated him like he\nwas invisible."
            },
            {
                "paragraph": "“Shaun, I specifically came here to visit you.” Rodney approached shamelessly. “Catherine said that\nyou know your real age now. Actually, I’m your best friend of twenty years. You can’t have forgotten our\ndeep friendship just because you lost your memories, right?”"
            },
            {
                "paragraph": "“You’re annoying.” Shaun glanced at him in disdain."
            },
            {
                "paragraph": "“Well, I was going to tell you some important information, but it seems like you don’t need it. In that\ncase, I’ll go…”"
            }
        ]
    },
    {
        "title": "Chapter 1696 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "“Wait,” Shaun spoke again."
            },
            {
                "paragraph": "“No, I’ll leave. You’re not the Shaun I know anyway. You don’t care about a friend like me at all.”\nRodney sighed softly. “Don’t tell me to stay.”"
            },
            {
                "paragraph": "“ I’m not telling you to stay.” Shaun looked at him speechlessly. Did he really have such a neurotic\nfriend?"
            },
            {
                "paragraph": "Rodney, who was suddenly embarrassed, said, “ I’m really leaving.”"
            },
            {
                "paragraph": "“ Sit down.” Shaun pointed at the chair at the side."
            },
            {
                "paragraph": "Only then did Rodney swagger to take a seat. His eyes glanced at the laptop on the desk. “Looking at\ninformation about Hill Corporation?”"
            },
            {
                "paragraph": "Shaun did not answer him. He simply frowned for a while before asking, “What was my relationship\nwith Cathy in the past?”"
            },
            {
                "paragraph": "“Why don’t you guess?” Rodney raised his eyebrows, gloating."
            },
            {
                "paragraph": "“ If I could guess, would I be here talking to you?”"
            },
            {
                "paragraph": "Shaun snorted. “Forget it. If you don’t want to tell me, I can find out by other means.”"
            },
            {
                "paragraph": "“You’re so cruel.” Rodney was a little angry. “Don’t you feel anything at all?”"
            },
            {
                "paragraph": "Shaun frowned. He did not know how to use a computer or a phone before this. However, now that he\ndid, he secretly checked it with his phone this morning. If an adult man and woman kissed, they must\nbe in some sort of relationship."
            },
            {
                "paragraph": "Moreover, the kiss he had with Cathy was a french kiss."
            },
            {
                "paragraph": "Upon recalling that information, his handsome face turned a little red."
            },
            {
                "paragraph": "“Hehe. What naughty thoughts are you thinking?” Rodney chuckled."
            },
            {
                "paragraph": "Shaun glanced at him coldly. “She’s my girlfriend? But she’s already married and has children. Then, a\nm I… her paramour?”"
            },
            {
                "paragraph": "“…Ahem. You’re pretty amazing to know what a paramour is.” Rodney gave him a thumbs up. “That\ndescription is quite appropriate.”"
            },
            {
                "paragraph": "That was the same as admitting it. Shaun’s face darkened."
            },
            {
                "paragraph": "He really was a shameful paramour?"
            },
            {
                "paragraph": "“You don’t need to be angry. You had it coming. ” Rodney chuckled. “Do you know who Suzie and\nLucas’s dad is?”"
            },
            {
                "paragraph": "“How would I know?” Shaun was annoyed. “Just get to the point.”"
            },
            {
                "paragraph": "“You are Suzie and Lucas, ” Rodney said coolly."
            },
            {
                "paragraph": "“What?” Shaun was shocked. Yesterday, he realized that he was not a two-year-old baby, and today,\nhe had to accept that he had two three-year-old children?"
            },
            {
                "paragraph": "He held his head and felt the need to calm down. “ How is that possible?”"
            },
            {
                "paragraph": "“Can’t you see how much Suzie resembles you? Catherine and you were once married, but… you\ndivorced her for another woman. Then, Catherine married Wesley, but Wesley was a liar and refused to\ndivorce her. However, you both got back together after you pursued her. So that’s the story, ” Rodney\nexplained complicatedly."
            },
            {
                "paragraph": "Shaun furrowed his brows."
            },
            {
                "paragraph": "He really did not expect his past relationship with Cathy to be so complicated."
            },
            {
                "paragraph": "However, when he thought that Cathy was his girlfriend and that they had children together, he did not\nseem to mind it at all. In fact, he was quite happy."
            },
            {
                "paragraph": "Did this mean that she would never leave him?"
            },
            {
                "paragraph": "“Oh, let me show you something.” A mysterious smile suddenly etched across Rodney’s face. “ I’m only\nshowing this to you because you’re my bro.”"
            }
        ]
    },
    {
        "title": "Chapter 1697 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "Shaun’s dark eyes flashed with doubts."
            },
            {
                "paragraph": "Rodney walked up to the door and locked it before taking out a memory card from his pocket and\ninserted it into the computer."
            },
            {
                "paragraph": "A few moments later, some heart-racing images appeared on the computer screen."
            },
            {
                "paragraph": "Shaun was dumbfounded. He felt like his worldview suffered a huge shock…"
            },
            {
                "paragraph": "His handsome face, too, had inexplicably turned as red as an apple in an instant."
            },
            {
                "paragraph": "He did not know what was wrong with him. All he felt was his face burning and his heart racing."
            },
            {
                "paragraph": "“How is it?” Rodney cackled. “I’m only showing this to you because you’re my bro.”"
            },
            {
                "paragraph": "12:30 p.m."
            },
            {
                "paragraph": "Catherine personally cooked some of her best dishes."
            },
            {
                "paragraph": "Freya had not been vomiting recently, and her appetite was particularly good. As such, she could not\nresist taking a prawn for herself. After eating it, she praised Catherine, “Your cooking skills are even\nbetter than the chef we hired. Hey, why hasn’t Shaun and Rodney come down yet? It’s rare that he can\nstay with an amnesiac Shaun for so long without being snubbed.”"
            },
            {
                "paragraph": "Catherine smiled strangely. “Maybe he’s asking Rodney about the past.”"
            },
            {
                "paragraph": "“You didn’t tell him that you two were once married and that the children are his?” Freya asked in\nsurprise."
            },
            {
                "paragraph": "Catherine shook her head. “I want to take it slowly. I’m afraid he won’ t be able to accept it. Besides…\nI’m scared that he’ll take responsibility after I tell him. I don’t want our relationship to be like that. ”"
            },
            {
                "paragraph": "“Uh-oh. Rodney must have told him. Before we came here, he said he wanted to get something done.\nIt was definitely for Shaun. He was so mysterious about it, but he was empty-handed when we came\nhere. I don’t know what he’s planning.” Freya suddenly became a little curious at what Rodney had\nplanned."
            },
            {
                "paragraph": "“Forget it. It’s a secret between them. We have secrets too. I’ll tell Aunt Yasmine to tell them to come\ndown for lunch.”"
            },
            {
                "paragraph": "Catherine did not think much about it."
            },
            {
                "paragraph": "After taking the food out, Shaun and Rodney came down. Both of their faces were flushed."
            },
            {
                "paragraph": "Rodney looked fine since his face was as thick as a wall, but Shaun was different. His eyes twinkled,\nand when he saw Catherine, he lowered his head shyly as if he had done something bad."
            },
            {
                "paragraph": "“What did you two do upstairs?” Catherine asked curiously."
            },
            {
                "paragraph": "Shaun was so nervous that he knocked over the bowl in front of him."
            },
            {
                "paragraph": "He quickly picked it up and stammered with his face red, “N-Nothing.”"
            },
            {
                "paragraph": "“It doesn’t look like nothing to me. ” Freya looked at them strangely and turned to Rodney. “Did you\nteach him how to pick up girls?”"
            },
            {
                "paragraph": "“Hey, am I that much of a sc*mbag?” Rodney looked aggrieved. “Yes, I used to have a bad relationship\nwith Catherine, and I said a lot of things to sow discord between them. However, I’ve seen how good"
            },
            {
                "paragraph": "she is to Shaun, so how could I teach him to pick up other girls?”"
            },
            {
                "paragraph": "“I agree.” Catherine grinned and gave Freya and prawn. “ Besides, he won’t be able to teach Shaun\nhow to pick up girls anyway.”"
            },
            {
                "paragraph": "“That’s true. After all, it’s always women who play with him.” Freya nodded in agreement."
            },
            {
                "paragraph": "Rodney instantly wanted to vomit blood. “Enough. Don’t attack me.”"
            },
            {
                "paragraph": "Just after he spoke, he suddenly felt Shaun’s contemptuous gaze on him. His eyes seemed to say, ‘So\nyou’re unskillful…’"
            },
            {
                "paragraph": "Rodney replied, “…Let’s eat. The food is delicious. ”"
            },
            {
                "paragraph": "Shaun lowered his head until a piece of fish was placed in his bowl."
            }
        ]
    },
    {
        "title": "Chapter 1698 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "Shaun looked up just in time to see Catherine turn to talk to Freya after giving him the fish. In the bright\nliving room, her beautiful little face was stunning, like she had walked out of a painting."
            },
            {
                "paragraph": "With her snow-white skin and thick black eyebrows, she looked like a butterfly with her wings out, ready\nto fly."
            },
            {
                "paragraph": "At that moment, he remembered the image he had seen on the computer, and his head felt inexplicably\nwarm."
            },
            {
                "paragraph": "Freya suddenly cried out. “Woah! Why do you have a nosebleed?”"
            },
            {
                "paragraph": "Shaun looked down to see a few drops of red liquid in his bowl. He then touched his nose with his hand\nand panicked."
            },
            {
                "paragraph": "Was he sick?"
            },
            {
                "paragraph": "“Holy sh*t. Come on, let’s go. I’ll take you to the bathroom to wash up.” Rodney hurriedly led him\ntowards the toilet downstairs."
            },
            {
                "paragraph": "After entering, he took a paper towel, wet it with water, and wiped Shaun’s nose. He said\ncontemptuously, “Bro, was that necessary? What kind of dirty pictures were you thinking about when\nyou were eating?”"
            },
            {
                "paragraph": "Shaun looked at him in shock. “How did you know?”"
            },
            {
                "paragraph": "“Your eyes were basically on fire when you looked at Catherine, and then you suddenly had a\nnosebleed. How would I not know? I’ve… been there too.” Rodney coughed in embarrassment. He"
            },
            {
                "paragraph": "used to be like this when he was single, but he never expected Shaun to be so disappointing, too.\nFrom now on, he was no longer the only one."
            },
            {
                "paragraph": "Shaun was speechless."
            },
            {
                "paragraph": "Well, he thought he had some kind of disease."
            },
            {
                "paragraph": "“Wipe it, and stop thinking about it,” Rodney reminded him. “Don’t expose yourself.”"
            },
            {
                "paragraph": "“Okay.”"
            },
            {
                "paragraph": "In the dining room."
            },
            {
                "paragraph": "Freya quietly leaned toward Catherine. “I noticed that Shaun was staring super intently at you just now,\nas if he wanted to eat you up. Then, he had a nosebleed.”"
            },
            {
                "paragraph": "“Aren’t you overthinking it?” Catherine cast her a disdainful look. “He’s a blank canvas now. He’s as\npure as can be.”"
            },
            {
                "paragraph": "“Oh really? But I heard from Rodney that his illness has been cured. Are you sure you don’t want to\ntake the opportunity to attend to your… Hehe, you know what I mean.” Freya wiggled her eyebrows\nand winked."
            },
            {
                "paragraph": "“Get out.” Catherine’s heart skipped a beat, and she glared at Freya. “You can go to Rodney too.”"
            },
            {
                "paragraph": "“Ew, like hell I’ll go to him.” While Freya grumbled, Rodney and Shaun came back."
            },
            {
                "paragraph": "After the meal, Rodney and Freya stayed until 3:00 p.m. before leaving, and Shaun was taken to class\nby the professor."
            },
            {
                "paragraph": "In the evening, when the two children were playing with their toys, Catherine pulled Shaun into the\nadjacent bedroom and said solemnly, “From now on, you’ll sleep in this room.”"
            },
            {
                "paragraph": "“Why?” Shaun did not catch what she said. All he could think about was his previous relationship with\nCathy. Was it not normal for them to sleep together?"
            },
            {
                "paragraph": "“I slept with you before this because there were many things you didn’t know how to do, and you\ncouldn’t take care of yourself. Since you’ve made rapid progress in the past two days and you’re a\ngrown man, you should know it’s inappropriate for a man and woman to sleep together. It’s better if you\nsleep here, ” Catherine explained to him patiently."
            },
            {
                "paragraph": "Shaun blinked. “But you used to help me take baths even when I felt uncomfortable, and we hugged\neach other to sleep every night. You didn’t say it was inappropriate back then.”"
            },
            {
                "paragraph": "Catherine blushed. “You only had a mental age of two back then. I couldn’t help it.”"
            },
            {
                "paragraph": "“So, because I was two years old… you took advantage of me, and even… gave me a French kiss?”\nShaun looked at her with his pure black eyes."
            },
            {
                "paragraph": "His stare made Catherine feel like digging a hole and crawling into it."
            },
            {
                "paragraph": "“I looked it up on my phone.” Shaun debunked her words. “What you did to me back then was\nsomething only a boyfriend and girlfriend, or a husband and wife would do. You told me not to treat you\nas an aunt, and you don’t want to be my aunt. Is it because you want to be my woman instead?”"
            }
        ]
    },
    {
        "title": "Chapter 1699 - Let Me Go, Mr. Hill!",
        "sub_title": "test",
        "reading_time": 0.0,
        "content": [
            {
                "paragraph": "Catherine was so embarrassed that she wished she was struck by lightning."
            },
            {
                "paragraph": "She just wanted to explode."
            },
            {
                "paragraph": "This guy was developing at rocket speed."
            },
            {
                "paragraph": "That was right. She had thought that way at that time, but her mind had changed in the past few days.\nFurthermore… His words made it seem like she was a lewd person."
            },
            {
                "paragraph": "What did he mean by becoming his woman? He spoke as if he was in high demand."
            },
            {
                "paragraph": "He, a man whose brain had been messed with constantly? Tsk. Even she was a little disgusted by him."
            },
            {
                "paragraph": "“You think too much, ” Catherine said stiffly and glared at him. “So you’re not going to listen to me,\nhuh?”"
            },
            {
                "paragraph": "“Cathy, if you took the initiative to kiss me before but didn’t want to be my woman, then you would be a\npervert.” Shaun braced himself and said, “ According to Australia’s criminal legislation, you’ll bear\ncriminal responsibility if the person hasn’t come of age yet. Moreover, the current law states that, in this\nregard, men have the same rights as women.”"
            },
            {
                "paragraph": "“You know criminal law?” Catherine glanced at him grimly."
            },
            {
                "paragraph": "“There were many books about the subject in the study, so I read a few of them, ” Shaun said\nsomewhat smugly."
            },
            {
                "paragraph": "Catherine raised her brows. She had been with him for so long, yet she knew nothing about it. “If you\nwant to talk about the law, fine. Let me ask you. Did you resist when it happened? Were you"
            },
            {
                "paragraph": "unconscious? No. On the contrary, if you enjoyed it, it’s not illegal.”"
            },
            {
                "paragraph": "“But I only had a mental age of two at that time. There’s also a doctor’s report about that. I didn’t resist,\nbut your behavior can constitute as deceiving an ignorant child.” Shaun retorted swiftly."
            },
            {
                "paragraph": "Catherine was rendered speechless."
            },
            {
                "paragraph": "She had to admit that even though he had lost his memory, he was still much better at applying the law\nthan her."
            },
            {
                "paragraph": "However, when she saw his smug face, she could not help but become furious. “Fine. If you feel like\nI’ve committed a crime, then go ahead and call the cops.”"
            },
            {
                "paragraph": "Shaun froze when he realized that she was angry. Then, he quickly lowered his head and tried to\nplease her. “That’s not what I meant. I just don’t want to sleep separately from you. Don’t think that I\ndon’t know. Rodney said that we were in a relationship before my accident and that Suzie and Lucas\nare our children. Seeing how Suzie and Lucas are used to it, it’s clear that we didn’t start sleeping\ntogether after my accident.”"
            },
            {
                "paragraph": "Catherine pursed her pink lips. She did not tell Rodney to hide it, and she did not plan on hiding it from\nShaun either. There were some things that he would find out sooner or later."
            },
            {
                "paragraph": "“Cathy… ” Shaun held her hand and said nervously, “Let me take care of you as I did before…”"
            },
            {
                "paragraph": "“Do you love me?” Catherine suddenly looked up at him."
            },
            {
                "paragraph": "Shaun was stunned."
            },
            {
                "paragraph": "Love? What was love? He still did not know. “Cathy, I really want to be with you. I…”"
            },
            {
                "paragraph": "“Shaunny, the truth is that when you were first diagnosed with the mental age of a two-year-old, I\nthought I might continue to be with you if you stayed like this forever. I don’t know how long I can hold\non for — maybe a few years, a few decades, or even my entire life. But then, I’ve noticed that your\nintelligence has been slowly growing, and you’ll soon grow into an exceptional person. You don’ t\nremember the past, our love, or all the gratitude and grievances we’ve had for each other. Your\nmemory started over with a clean slate, like you just came out of your mother’s womb. So you must not\nremember about… loving me.”"
            },
            {
                "paragraph": "Catherine stopped as she felt a lump in her throat. “ Shaun, do you know that this isn’t the first time\nyou’ve forgotten?” Shaun was stunned. “I’ve lost my memory before?”"
            }
        ]
    }

]