[

  {
    "title": "Chapter 1150 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine pushed Wesley away with all her might."
      },
      {
        "paragraph": "However, he was so fixated on getting his way and his grip started to hurt her. It was as if he had gone\ncrazy."
      },
      {
        "paragraph": "In the end, she could not hold back anymore. She picked up the lamp on the bedside table and smashed\nit on his head."
      },
      {
        "paragraph": "At that moment, Wesley looked up with a freezing cold flashed in his warm pupils."
      },
      {
        "paragraph": "When the moonlight fell on his face, Catherine could not help but shiver. She was frightened of him…"
      },
      {
        "paragraph": "Yes, fear."
      },
      {
        "paragraph": "She was actually scared of Wesley."
      },
      {
        "paragraph": "A few moments later, Wesley’s elegant and handsome face had turned painful, disappointed, and\nsorrowful. The shift had Catherine doubting that the fear and everything she saw earlier was just an\nillusion."
      },
      {
        "paragraph": "“Cathy, do you hate me this much?” Wesley looked at her with red eyes."
      },
      {
        "paragraph": "“I… I don’t hate you.” Catherine curled herself into a ball. She also felt desperate and numb. “I’m sorry,\nWesley. I’m really sorry.”"
      },
      {
        "paragraph": "It was not as if she did not want to, but her body was resisting him."
      },
      {
        "paragraph": "She was not as resistant and disgusted when Shaun kissed her."
      },
      {
        "paragraph": "She only felt that Shaun’s body warmth felt good."
      },

      {
        "paragraph": "If she did not fight to keep her rationality, she would be kissed until her head went blank."
      },
      {
        "paragraph": "It was as if her body was instinctively accustomed to Shaun but could not accept other men."
      },
      {
        "paragraph": "She was close to breaking down because of herself. “Wesley, why don’t we…”"
      },
      {
        "paragraph": "“Don’t say it.”"
      },
      {
        "paragraph": "Wesley interrupted her. His eyes were filled with panic and despair. “Cathy, don’t kill my heart, okay? I’ve\nloved you for so many years. I’ve waited for you for so many years, and you’ve finally married me. I\nthought I could finally be with you for"
      },
      {
        "paragraph": "the rest of my life. If you still want to leave me, I’d be destroyed. I won’t know how to continue living.”\nCatherine was at a loss for words."
      },
      {
        "paragraph": "Wesley’s words made her feel guilty beyond measure, but at the same time, they locked her like a\nshackle."
      },
      {
        "paragraph": "It bewildered her."
      },
      {
        "paragraph": "“Don’t think about it. Rest. I won’t force you. It’s my fault tonight for scaring you.”"
      },
      {
        "paragraph": "Wesley touched her head and turned to leave."
      },
      {
        "paragraph": "Once he was out the door, his gaze was replaced with a ferocious hatred."
      },
      {
        "paragraph": "Very well, Catherine Jones. He originally thought of leaving her the slightest bit of dignity after he got his\nrevenge on her."
      },
      {
        "paragraph": "However, he changed his mind. Sooner or later, he would make her pay for today. He would make her\nlife worse than death."
      },
      {
        "paragraph": "Catherine stayed up all night."
      },
      {
        "paragraph": "However, Shaun stayed with the two darlings and slept well."
      },
      {
        "paragraph": "Before going to bed, he told them a short story."
      },
      {
        "paragraph": "After the children went to bed, he looked at the two clean and lovely faces, and thoughts of Catherine\nflooded his chest."
      },
      {
        "paragraph": "He missed her. He thought about her."
      },
      {
        "paragraph": "He wanted her to come back to his side quickly. Their family of four would definitely be happy."
      },
      {
        "paragraph": "In the future, he would only listen to his wife. If Cathy told him not to associate with anyone, he would not\nassociate with that said person."
      },
      {
        "paragraph": "If Cathy told him not to do something, he would never do it."
      },
      {
        "paragraph": "6:00 a.m."
      },
      {
        "paragraph": "Shaun got up and personally went to cook."
      },
      {
        "paragraph": "Old Madam Hill and Old Master Hill got up early. When they saw Shaun’s figure hustling in the kitchen,\ntheir eyeballs almost fell out."
      },
      {
        "paragraph": "“Goodness gracious, did the sun rise from the west today? My grandson is cooking breakfast.” Old\nMadam Hill was filled with various emotions. “I never thought that I’d be able to eat a breakfast prepared\nby my grandson in my life.”"
      },
      {
        "paragraph": "“Grandma, don’t worry. You’ll be able to eat it every day in the future.”"
      },
      {
        "paragraph": "Shaun replied with a smile. He used to be taciturn, but when he smiled now, his elegant face was like the\nfirst sign of spring after a cold winter."
      },
      {
        "paragraph": "Old Madam and Old Master Hill looked like they saw a ghost."
      }
    ]
  },
  {
    "title": "Chapter 1151 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Shaun, are you… possessed?” Old Madam Hill asked tentatively."
      },
      {
        "paragraph": "Shaun.“ ”"
      },
      {
        "paragraph": "Lea came down and asked, “Mom, Dad, why are you two standing by the kitchen?”"
      },
      {
        "paragraph": "“Lea, Shaun is making breakfast today,” Old Master Hill said seriously."
      },
      {
        "paragraph": "Lea froze when she saw Shaun, who was wearing an apron. “That’s good. You always had an opinion on\nfood prepared by others anyway. You can eat more now that you’re making it yourself.”"
      },
      {
        "paragraph": "“That’s not the point.” Old Madam Hill whispered. “The point is… he smiled. It was like… we saw a\nghost.”"
      },
      {
        "paragraph": "Shaun was exasperated. “Grandpa, Grandma, I’m smiling because I’m in a good mood.”"
      },
      {
        "paragraph": "“Did something good happen?” Old Madam Hill was curious. With how the Hill family was, Willie became\na fool, Spencer was unable to pull himself back up, and Valerie complained about everything all day,\ncrying. If it were not for Old Madam Hill’s big heart, she would have died of fury."
      },
      {
        "paragraph": "Lea thought of Brennan."
      },
      {
        "paragraph": "She assumed that Shaun was in a good mood because his father came back. It was no wonder people\nsaid that a father was indispensable in a child’s life. In the past, Shaun was as cold as a popsicle, but\nafter Brennan came back, he became a different person."
      },
      {
        "paragraph": "“You’ll know later.”"
      },
      {
        "paragraph": "Shaun raised his brows, his eyes filled with high spirits."
      },

      {
        "paragraph": "Old Madam and Old Master Hill were confused, but Lea became nervous."
      },
      {
        "paragraph": "When the two elders went out, Lea apprehensively went to Shaun. “Is… your father coming here later?”"
      },
      {
        "paragraph": "Shaun looked at Lea’s nervous face and raised his eyebrows. “You’re overthinking. My Dad never wants\nanything to do with the Hill family anymore. How would he come here?”"
      },
      {
        "paragraph": "“…That’s true. ” Lea lowered her eyes and sighed. “Are you thinking of how good my dad is again?”"
      },
      {
        "paragraph": "Shaun suddenly asked."
      },
      {
        "paragraph": "“…Of course not. I just feel indebted to him.” Lea snapped at him."
      },
      {
        "paragraph": "Besides, she did not have the nerve."
      },
      {
        "paragraph": "“That’s good. I’m just worried that you’ll want to go back to him.” Shaun said. “I’m different from you. At\nleast I never married Sarah, and I never had a child with Sarah.”"
      },
      {
        "paragraph": "Lea glared at him speechlessly. “Do you have to be proud of such a thing? At least I let you come into\nthis world. Did you let your children come into this world?”"
      },
      {
        "paragraph": "“Heh.” Shaun smiled."
      },
      {
        "paragraph": "Lea got even more suspicious. If she said that in the past, his expression would have changed, but he\nwas not angry at all today?"
      },
      {
        "paragraph": "“Go out. Don’t bother me when I’m making breakfast.”"
      },
      {
        "paragraph": "Shaun turned on his phone and began to make sponge cake following the video."
      },
      {
        "paragraph": "Lea was increasingly confused."
      },
      {
        "paragraph": "That doubt made Old Madam Hill, who originally wanted to push Old Master Hill out for a walk,"
      },
      {
        "paragraph": "stayed back in the house. At a little past 7. Lea went upstairs to wake Suzie up. Before long, a scream\nwas heard from upstairs. ”Lea, what’s wrong?”"
      }
    ]
  },
  {
    "title": "Chapter 1152 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Old Madam Hill rushed upstairs and saw that besides Suzie, there was a boy around the same age as\nSuzie in the bedroom too. The boy was wearing blue cartoon pajamas and looked at them calmly.\nAlthough he was still young, it was clear from his excellent looks that he would definitely be a\nhandsome man in the future."
      },
      {
        "paragraph": "However, his face… resembled Catherine’s."
      },
      {
        "paragraph": "“This… This is…” Old Madam Hill was also stunned."
      },
      {
        "paragraph": "Lucas frowned. He guessed that these people should be from the Hill family. Suzie often talked about\nthem."
      },
      {
        "paragraph": "Suzie grinned and explained, “Great-grandma, I solemnly introduce to you, my younger brother…”"
      },
      {
        "paragraph": "“I’m your older brother.” Lucas interrupted her."
      },
      {
        "paragraph": "“What do you mean older? You just came out three minutes before me.” Suzie said petulantly."
      },
      {
        "paragraph": "“I’m still your older brother.” Lucas refused to give in."
      },
      {
        "paragraph": "Lea was dumbfounded. “Suzie, what… What’s going on? That child…”"
      },
      {
        "paragraph": "Lucas pursed his lips, and Suzie giggled. “Actually, we’re twins. I’m Susan Jones, and he’s Lucas\nJones.”"
      },
      {
        "paragraph": "Old Madam Hill and Lea gasped at the same time. “ No, I’ve never heard Liam mention this before.”"
      },
      {
        "paragraph": "“That’s because they’re not Liam’s children.”"
      },

      {
        "paragraph": "Shaun suddenly appeared behind them. The corners of his mouth lifted smugly. “Suzie and Lucas are\nmy children Cathy gave birth to. They’re the twins from back then. They were still around and weren’t\nmiscarried. We were all duped by Cathy and Liam.”"
      },
      {
        "paragraph": "“What?”"
      },
      {
        "paragraph": "Lea and Old Madam Hill were shocked."
      },
      {
        "paragraph": "Over the years, they felt remorseful that the twins were lost, but unexpectedly, the children were still\nalive."
      },
      {
        "paragraph": "“In the end, Suzie really is your child. It’s no wonder I feel like she’s so much like you.” Old Madam Hill\nwas elated. “Lucas doesn’t look like you, but he looks like his mother. But they’re both very beautiful\nchildren. This is great.”"
      },
      {
        "paragraph": "Old Madam Hill’s eyes turned bright with happiness. “Liam, that rascal. He hid such a big thing from\nus.”"
      },
      {
        "paragraph": "“It’s because Mommy was afraid that Great— grandma and the others would take us away if you found\nout,” Suzie explained. “We don’t want to be separated from Mommy, so Uncle Liam let me be his\ndaughter. That way, I can visit Great-grandma anytime, and Uncle can take me to see Mommy too.”"
      },
      {
        "paragraph": "“Liam had good intentions, I see.” Lea sighed with reddened eyes. “He did the right thing back then. If it\nweren’t for him, these two children might have disappeared long ago.”"
      },
      {
        "paragraph": "Shaun’s eyes were filled with guilt. “Yes, Mom. I regret it a lot. I shouldn’t have treated him like that\nbefore. I’ll definitely look for him and treat him like a real brother in the future.”"
      },
      {
        "paragraph": "“I still don’ t know if he’ll come back… ” Lea shed tears gloomily."
      },
      {
        "paragraph": "“Don’t talk about these unhappy things in front of the children. We should be happy today. Our Hill\nfamily has gone through so much, but at least we have two more darlings now.”"
      },
      {
        "paragraph": "Old Madam Hill walked over to Lucas. “Child, I’m your Great-grandma. The Hill family owes your\nmommy. We won’t make you leave your mommy, but we’re your family. This is your other home too.”"
      },
      {
        "paragraph": "“Yes. ” Lea also kneeled in front of the children and held Suzie’s hand. “In fact, when you were still in\nyour mommy’s tummy, we were looking forward to your arrival. Unfortunately, your daddy was too\ndisobedient and did many wrong things, causing you to be born into an incomplete family. I’m so sorry\nfor that.”"
      },
      {
        "paragraph": "Suzie hugged Lea and said in her childlike voice,“ Grandma, it’s not your fault. We just don’t like\nscummy dad, but you’re all very good. I like you all very much.”"
      },
      {
        "paragraph": "“Thank you, ” Lea happily kissed Suzie’s little cheek. She looked at Lucas, who had a faint expression."
      },
      {
        "paragraph": "“Lucas, your father also looked like you when he was a child.”"
      },
      {
        "paragraph": "Lea said suddenly, “But now I know that, under your cold appearance like your father, you long for\naffection. You’re just afraid of getting hurt, so you disguise yourself with indifference. In the past, I was\nnot able to be a good mother to him, but I’ll be a good grandmother to you in the future.”"
      },
      {
        "paragraph": "Lucas’ eyes moved slightly and he could not help but look at Shaun. Shaun was staring at Lea in\nsurprise."
      },
      {
        "paragraph": "Post navigati"
      }
    ]
  },
  {
    "title": "Chapter 1153 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Old Madam Hill chuckled and nodded. “That’s great. The Hill family is not as good as it used to be, but\nyou’ve all become sensible.”"
      },
      {
        "paragraph": "Soon, they brought the two children downstairs."
      },
      {
        "paragraph": "Old Master Hill, who had been feeling low lately, was also overjoyed when he learned the truth."
      },
      {
        "paragraph": "Lucas looked at the family members and seemed to understand why Suzie liked it here."
      },
      {
        "paragraph": "Although he hated his scummy dad, everyone here was kind and friendly."
      },
      {
        "paragraph": "Moreover, they were his grandmother, great- grandmother, and great -grandfather. They were not\noutsiders, so there was no need to be cautious."
      },
      {
        "paragraph": "After breakfast, Shaun took Lucas and Suzie to the kindergarten."
      },
      {
        "paragraph": "He also changed their parents’ contact information to Catherine and his names."
      },
      {
        "paragraph": "The kindergarten teacher was surprised. “So it turns out they were twins. It’s no wonder they usually play\nso well.”"
      },
      {
        "paragraph": "“Yes, in the future, the teacher can contact their mom or me anytime. ” Shaun was in a good mood, and a\ncharming smile hung on his handsome and elegant face."
      },
      {
        "paragraph": "The sight made the kindergarten teacher’s heart race."
      },
      {
        "paragraph": "On the way back to the company, Shaun gave Catherine a call."
      },
      {
        "paragraph": "If it were in the past, Catherine would definitely reject it, but considering her two children, she decided to\npick up today."
      },

      {
        "paragraph": "“Was Lucas okay last night?”"
      },
      {
        "paragraph": "“He was good. I said I’d take Suzie and him to play football tonight.” Shaun said smugly. “Lucas agreed.”"
      },
      {
        "paragraph": "Catherine, who was driving, became annoyed. She did not think that little brat Lucas would change sides\nso quickly."
      },
      {
        "paragraph": "“Do you want to come?” Shaun suddenly asked in a hushed tone. “We’ll be playing at the football field a t\nMagnolia Plaza.”"
      },
      {
        "paragraph": "“I’m a married woman who has to cook for my husband. I’m busy.” Catherine said while gnashing her\nteeth."
      },
      {
        "paragraph": "“But it’s not good to leave your two children behind after getting married, right?” Shaun’s tone was bitter.\n“The children want us to get back together too…”"
      },
      {
        "paragraph": "Before he could finish, Catherine hung up the phone."
      },
      {
        "paragraph": "Shaun looked at it and smiled instead of getting angry. Either way, with the two children and him stirring\nthings up, he had faith that Wesley would soon reveal his true colors."
      },
      {
        "paragraph": "Wesley really could not hide his true colors anymore."
      },
      {
        "paragraph": "After he was hit by Catherine last night, he suppressed his anger all night."
      },
      {
        "paragraph": "In the morning, as soon as he arrived at the company, he pressed Regina on his desk to vent his anger."
      },
      {
        "paragraph": "“Uncle, the recent production line of the freeze- dried powder injection…”"
      },
      {
        "paragraph": "Ethan pushed open the office door and saw the scene inside, and was completely shocked."
      },
      {
        "paragraph": "He never expected his uncle, who had always been gentle and elegant, to do such ridiculous things in\nthe office. Besides, was his uncle not devoted to Catherine? How could he…"
      },
      {
        "paragraph": "“Ah… ” Regina was frightened and hurriedly put on her clothes."
      },
      {
        "paragraph": "Wesley’s face was painted with embarrassment and misery, and there was a hint of chagrin deep in his\neyes."
      }
    ]
  },
  {
    "title": "Chapter 1154 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Get out. Who told you to seduce me?” Wesley pushed Regina away fiercely. \nRegina saw his ferocious expression and fled in fear with tears in her eyes."
      },
      {
        "paragraph": "Ethan was stunned and his brain rumbled. When the door closed, he suddenly snapped out of it and a\nsurge of anger rose. He stormed up to Wesley and punched him. “You b*stard.”"
      },
      {
        "paragraph": "Wesley did not dodge it. After he was beaten, he wiped his mouth and sneered. “Yes, I’m a b*stard.”"
      },
      {
        "paragraph": "Ethan was furious. “Uncle, how could you do this to Cathy? You’ve just gotten married. Is this all how\nmuch your deep affection amount to? You’re disgusting.”"
      },
      {
        "paragraph": "Ethan loved Catherine. Although it was impossible for him to be with her anymore, he still wished that\nshe could live a happy life. He also believed that Wesley would be able to give it to her, but he never\nexpected Wesley to sleep with his secretary."
      },
      {
        "paragraph": "He grieved deeply for Catherine."
      },
      {
        "paragraph": "She was such a good person. Why did she meet all the scumbags time and time again?"
      },
      {
        "paragraph": "“Do you think I wanted this?” Wesley ripped off his crooked tie and roared at him. “She doesn’t love me\nat all. Since we got married, she won’t even let me touch her. Look at my head.”"
      },
      {
        "paragraph": "He pointed at his bruised forehead. “She smashed a lamp on me because I wanted to touch her.”"
      },
      {
        "paragraph": "Ethan gaped slightly in shock."
      },
      {
        "paragraph": "After a long pause, he said, “Even so, you can’t mess around with a woman from the office. You even did\nit so early in the morning…”"
      },

      {
        "paragraph": "He could not go on because that scene made him sick. If he had not seen it with his own eyes, he would\nnot believe that the uncle he had always respected would do such a thing."
      },
      {
        "paragraph": "“Ethan, I’m a man. I have needs.”"
      },
      {
        "paragraph": "Wesley looked at him painfully. “For her, I’ve waited for years. If I wait any longer, I’d become a monk. As\nlong as she’s willing to let me touch her, I’d never do anything that would let her down.”"
      },
      {
        "paragraph": "“Ethan, you can’t put the blame on me entirely. Previously, weren’t you easily taken to bed by Rebecca\nJones? You should know that feeling.”"
      },
      {
        "paragraph": "Ethan’s handsome face was full of pain."
      },
      {
        "paragraph": "Yes, he knew. That was why he lost Catherine forever."
      },
      {
        "paragraph": "“Not to mention…” Wesley suddenly smiled bitterly. “Her heart has never let go of Shaun Hill. Did you\nknow? On our wedding night, Shaun sent m e a photo of him sleeping with Cathy. I’ve never suffered\nsuch a big blow before. My wife slept with another man on our wedding night.”"
      },
      {
        "paragraph": "Ethan’s lips trembled. “Uncle, it wasn’t Cathy’s wish to be taken away by Shaun that day. If you can’t\naccept it, then divorce her. Why are you cheating on her while staying in the marriage and hurting her?\nShe has already suffered too much in her life.”"
      },
      {
        "paragraph": "“I love her, Ethan. I love her so much that without her, my life will lose its color. There’ll be no meaning to\ncontinue living.”"
      },
      {
        "paragraph": "Wesley looked at him imploringly. “Don’t tell Cathy this, okay? I’ll let Regina leave. I won’t be involved\nwith her again.”"
      },
      {
        "paragraph": "Ethan was at a loss."
      },
      {
        "paragraph": "“Ethan, Cathy already had one failed marriage. If you tell her about me, it’ll be the second blow. I’m\nbegging you. As long as you don’t say anything, I can give you half the company, ” said Wesley as he\nbowed his pride."
      },
      {
        "paragraph": "“Uncle, I don’t need you to give me the company. In the past, I gave up my feelings for Cathy because of\nmoney and power. That was the deepest regret in my life. I only want her to be happy.”"
      },
      {
        "paragraph": "Ethan stepped back as he spoke. “I… won’t tell her about what happened today, but if you don’t stop\nfooling around with other women behind her back, I’ll definitely tell her.”"
      },
      {
        "paragraph": "He then turned and left."
      },
      {
        "paragraph": "When the door closed, the sorrowful expression on Wesley’s face was replaced by a chilling cold. He\ntook out his phone and dialed a number. “Pay attention to Ethan Lowe’s movements. If… If he goes to\nCatherine… make him disappear.”"
      },
      {
        "paragraph": "After hanging up, he sighed softly."
      },
      {
        "paragraph": "“Ethan, oh, Ethan. Why did you have to find out about something you shouldn’t have?”"
      },
      {
        "paragraph": "“I still need to preserve my image. Now is not the time to expose it.”"
      },
      {
        "paragraph": "“I hope you don’t ask for your own death.”"
      }
    ]
  },
  {
    "title": "Chapter 1155 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Ethan came out from the president’s office."
      },
      {
        "paragraph": "His heart was still furious, heavy, and conflicted."
      },
      {
        "paragraph": "On one side was his uncle, and on the other side was his beloved childhood sweetheart."
      },
      {
        "paragraph": "What should he do?"
      },
      {
        "paragraph": "Finally, he turned around and went to the secretarial department. He bumped into Regina just as he was\nabout to enter."
      },
      {
        "paragraph": "She bowed her head quickly when she saw him, showing a face of panic and bewilderment."
      },
      {
        "paragraph": "“Let me ask you. How long have you been with my uncle?” Ethan’s handsome face stared at her coldly."
      },
      {
        "paragraph": "“Manager Lowe, don’t ask me that. I’ve always had unrequited feelings for President Lyons. It was me\nwho seduced him,” Regina suddenly pretended to be in sorrow. “Just now, President Lyons called me\nand told me to go over. I guess he wants me to leave.”"
      },
      {
        "paragraph": "“It’s shameless to seduce a married man. You’re despicable,” Ethan denounced her."
      },
      {
        "paragraph": "Regina bowed her head and bit her lips silently, but pretended to choke her words, “I’m sorry, Manager\nLowe. I won’t do it again.”"
      },
      {
        "paragraph": "“Get out of my sight.” After Ethan was done scolding her, he suddenly noticed a diamond necklace\nhanging around her neck, and a diamond bracelet around her hand. The diamond was not large, but he\nsaw it was the same necklace his wife Tracy bought two days ago."
      },

      {
        "paragraph": "Tracy said that there were not many diamonds on the necklace, but because it was from a world- famous\nluxury brand, one necklace still cost more than tens of thousands of dollars."
      },
      {
        "paragraph": "How could a secretary afford such expensive jewelry?"
      },
      {
        "paragraph": "Uncle said that the secretary seduced him? However, he was so generous to Regina."
      },
      {
        "paragraph": "Ethan suddenly felt sad and pity for Cathy."
      },
      {
        "paragraph": "After Regina left, he went downstairs and finally could not help himself but to call her."
      },
      {
        "paragraph": "Hudson Corporation."
      },
      {
        "paragraph": "Catherine just left the marketing department when her phone suddenly rang. Surprisingly, it was from\nEthan."
      },
      {
        "paragraph": "Both of them had cut each other out from their lives three years ago but she had shared her new mobile\nnumber with Ethan on her wedding day with Wesley."
      },
      {
        "paragraph": "He had not contacted her since."
      },
      {
        "paragraph": "However, she heard Wesley mentioned Ethan had left Lowe Corporation a few days ago and was now\nthe General Manager of Golden Corporation."
      },
      {
        "paragraph": "Why was he suddenly calling her?"
      },
      {
        "paragraph": "After getting lost in thought for a few seconds, she answered the call. “Ethan…”"
      },
      {
        "paragraph": "“Cathy, are you busy?” Ethan asked in a hushed tone, “Where are you?”"
      },
      {
        "paragraph": "“I’m fine. I’m still at the office.”"
      },
      {
        "paragraph": "“I have something important to tell you and I need t o meet you. Can I come to your company now?” He\nasked carefully."
      },
      {
        "paragraph": "The tone made Catherine helpless. “Okay, I’ll tell the front desk, so you can just report your name and\ncome up directly.”"
      },
      {
        "paragraph": "“Okay. By the way, don’t tell my uncle that I’m coming to you.” Ethan said suddenly."
      },
      {
        "paragraph": "“…Sure.”"
      },
      {
        "paragraph": "Catherine was a little confused."
      },
      {
        "paragraph": "Why could she not tell Wesley that he was coming to her?"
      },
      {
        "paragraph": "Did Ethan want to get her back as well, like Shaun? No, Ethan was already married, so he would not do\nthat. If he wanted to get her back, he would have tried a long time ago."
      },
      {
        "paragraph": "Besides, she was now married to Wesley. If Ethan did something like that, he would be nagged to death\nby the Lyons family. Maybe it was something really important…"
      },
      {
        "paragraph": "Ethan hung up the phone and drove immediately to Hudson Corporation."
      },
      {
        "paragraph": "On the way, he suddenly noticed that the brakes seemed to have failed completely."
      },
      {
        "paragraph": "The car sped out of control and shot forward."
      },
      {
        "paragraph": "He grabbed the steering wheel desperately for fear of hitting the vehicle in front of him."
      },
      {
        "paragraph": "The car’s speed increased rapidly and reached l2omph. He knew then that he could not control it\nanymore. As he was about to hit the car in front of him, he swerved the steering wheel and the car\nslammed into the corner of the road."
      },
      {
        "paragraph": "Ethan’s mind went black and blood slid down his head."
      }
    ]
  },
  {
    "title": "Chapter 1156 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Ethan spurted blood as his eyes widened. He knew that this was not a coincidence. Wesley Lyons… was\ndespicable…"
      },
      {
        "paragraph": "If he could use such a vicious tactic on Ethan, then… What about Cathy…"
      },
      {
        "paragraph": "His body was stuck. He could not move but he struggled to reach for his phone close to him. He found\nCatherine’s number and typed: [Be careful…]"
      },
      {
        "paragraph": "However, before he could finish typing, the hood of the car caught fire suddenly."
      },
      {
        "paragraph": "He could not escape at all, and could only throw his phone out of the window."
      },
      {
        "paragraph": "Tears mixed with blood slid down his face."
      },
      {
        "paragraph": "He regretted it. If only he could start all over again. That year, he would never be with Rebecca."
      },
      {
        "paragraph": "He only wanted to stay with Catherine…"
      },
      {
        "paragraph": "Unfortunately… unfortunately…fate was not on his side."
      },
      {
        "paragraph": "In the office"
      },
      {
        "paragraph": "Catherine was drinking water when her hand shook suddenly. She lost grip on her cup and it shattered\non the ground."
      },
      {
        "paragraph": "She rubbed her brows. For some reason, her heart felt uneasy."
      },
      {
        "paragraph": "She could not help but call the kindergarten, but the teacher said the children were fine, so she was\nrelieved."
      },

      {
        "paragraph": "However, Ethan had not arrived despite saying that he was coming."
      },
      {
        "paragraph": "Later, a senior executive came over to see her. As she busied herself, she forgot about it."
      },
      {
        "paragraph": "At 5:00 p.m. when she was preparing to get off work, Harvey rushed in. “President Jones, there’s a\nwoman called Sonya Lyons looking for you in the lobby downstairs. She’s in hysterics and crying, and\nshe won’t leave no matter how hard we try to drive her out. She keeps saying that you killed her son so\nshe doesn’t want to live anymore. She wants to kill you and take you down with her.”"
      },
      {
        "paragraph": "Catherine froze."
      },
      {
        "paragraph": "She killed Ethan? Ethan was dead."
      },
      {
        "paragraph": "Her heart quivered. “I’ll go down and take a look.”"
      },
      {
        "paragraph": "Harvey hesitated, “President Jones, that’s… I’m afraid it’s not safe. She has a knife…”"
      },
      {
        "paragraph": "However, Catherine felt more disturbed the more she listened as Sonya would not go crazy for no\nreason. Something must have happened to Ethan."
      },
      {
        "paragraph": "“I’ll be careful.” She hurried downstairs."
      },
      {
        "paragraph": "Harvey looked at her back and felt anxious. He thought about it and called Wesley, but could not get\nthrough. In the end, he could only call Shaun."
      },
      {
        "paragraph": "When Catherine rushed to the hall, it was already filled with people."
      },
      {
        "paragraph": "Sonya sat on the ground, holding a knife and crying hysterically. “Catherine Jones, come out here. I don’t\nwant to live anymore, but I’ll drag you down to hell with me. You killed my son. My son died so\nmiserably…”"
      },
      {
        "paragraph": "The employees pointed at her and whispered. Catherine walked over in large strides. When Sonya saw\nher, she sprung up quickly and charged at Catherine with the knife."
      },
      {
        "paragraph": "Two security guards rushed over and held her back."
      },
      {
        "paragraph": "Catherine grabbed her wrist, snatched her knife, and threw it far away to one side."
      },
      {
        "paragraph": "“Let me go, ” Sonya glared at Catherine furiously. “ You jinx. Why won’t you die? Why did you harm\nEthan?”"
      },
      {
        "paragraph": "“What happened to Ethan? ” Catherine looked at her solemnly."
      },
      {
        "paragraph": "“What happened to him?” Sonya cried in despair. “ He died. The last phone call he made before he died\nwas to you, and the place he died was on route to your company. You have the audacity to claim that his\ndeath has nothing to do with you?"
      },
      {
        "paragraph": "Catherine’s eyes widened as her mind went blank for a few seconds."
      },
      {
        "paragraph": "“He died?” She murmured “That’s… That’s impossible. I just talked to him over the phone this afternoon.\nHe said he was coming to see me.”"
      },
      {
        "paragraph": "“So you admit it. When he was on the way, he got into an accident and his car crashed into a tree. It\ncaught fire and his body was burned beyond recognition, ” Sonya collapsed suddenly and began wailing."
      }
    ]
  },
  {
    "title": "Chapter 1157 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“My Ethan was so handsome, but when he died, he was charred to dust.”"
      },
      {
        "paragraph": "Catherine was completely bewildered."
      },
      {
        "paragraph": "How did a perfectly healthy person disappear suddenly?"
      },
      {
        "paragraph": "Although she did not love Ethan anymore, he was her favorite when she was young and naive. She had\nboth adored and hated him before."
      },
      {
        "paragraph": "Although they were both married, she still cared for him."
      },
      {
        "paragraph": "When she heard the news of his death, everything before her eyes was in a blur."
      },
      {
        "paragraph": "When the security guards’ hold on Sonya loosened, she grabbed the knife on the floor and attempted\nanother stab at Catherine."
      },
      {
        "paragraph": "“Watch out, Cathy!” A tall figure dashed into the scene and grabbed Cathy aside."
      },
      {
        "paragraph": "Sonya saw the one who saved Catherine was Shaun and she screamed, “Catherine Jones, you btch.\nYou married Wesley but you still seduced my Ethan and your ex-husband. You slt, you’re shameless."
      },
      {
        "paragraph": "You’ll never die a natural death.”"
      },
      {
        "paragraph": "Shaun’s charming eyes were cold and he walked over to Sonya. He snatched the knife from Sonya’s\nhand swiftly and pushed her to the police who had just arrived. “This woman tried to kill someone."
      },
      {
        "paragraph": "You’d better lock her up.”"
      },
      {
        "paragraph": "When Sonya was handcuffed by the cops, she totally panicked. “No, I still have to send my son off. I\nneed to see him off on his last journey.”"
      },

      {
        "paragraph": "Catherine could not bear it and went up to the police. “Even though she tried to kill, I am not pressing\ncharges. She didn’t do it on purpose either. She just lost her son and there must have been a\nmisunderstanding towards me, so she lost her rationale and did something like this.”"
      },
      {
        "paragraph": "The police officers looked at each other. “We’ll bring her to the station and remand her. As long as she’s\nwilling to admit her mistake and promise not to commit it again, we won’t pursue it.”"
      },
      {
        "paragraph": "The police then left with Sonya."
      },
      {
        "paragraph": "Catherine scrambled towards the parking lot while calling Wesley. “I heard that… something happened to\nEthan?”"
      },
      {
        "paragraph": "“Yeah,” Wesley said with a choked voice. “We’re in the funeral parlor now. Too many things happened\ntoday, so I forgot to tell you.”"
      },
      {
        "paragraph": "“I’m coming over now.”"
      },
      {
        "paragraph": "Catherine was just about to open the car door and leave, but a hand pulled her from behind."
      },
      {
        "paragraph": "“You can’t drive in this condition. Where are you going? I’ll take you there, ” Shaun looked at her\nworriedly. Although he came late, he could guess what happened."
      },
      {
        "paragraph": "“No need. I’ll go by myself.” Catherine pushed him away stubbornly."
      },
      {
        "paragraph": "However, Shaun refused to let her go. She lost control of her body suddenly and whacked him.“ Shaun\nHill, let me go. Go away…”"
      },
      {
        "paragraph": "Shaun did not move and just let her hit him."
      },
      {
        "paragraph": "After she hit him a dozen times, she broke down and cried."
      },
      {
        "paragraph": "Shaun hugged her fiercely, his hands gently soothed her back."
      },
      {
        "paragraph": "Catherine did not think of pushing him away. She lay on his chest and cried. “It’s my fault. He said he\nwanted to see me. Why did I agree to meet him? If I didn’t agree, he wouldn’t have died. He was still so\nyoung.”"
      },
      {
        "paragraph": "“Don’t put all the blame on yourself.”"
      },
      {
        "paragraph": "Shaun felt his heart break into pieces to see her cry in anguish. “Since he wanted to see you, it must\nhave been something important. You didn’t ask him to come to you.”"
      }
    ]
  },
  {
    "title": "Chapter 1158 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“But I shouldn’t have met Ethan. Considering that I’ve been through a lot with him, I should’ve… kept a\ndistance from him.” Catherine’s face was streaked with tears. “What’s more, he called me this morning\nand didn’t show up later, yet I forgot about it. I should’ve asked him…”"
      },
      {
        "paragraph": "Shaun lowered his head and gently wiped away the tears on her face. “Even if you had asked him, you\nwouldn’t have been able to change anything."
      },
      {
        "paragraph": "Something had already happened to him then. Moreover… At this point, I think you don’t quite know why\nhe was met with an accident yet. You should wait for the results of the investigation. Are you planning to\npay your last respects to him? Let me send you to the funeral parlor.”"
      },
      {
        "paragraph": "“… Okay.”"
      },
      {
        "paragraph": "With his gentle words of consolation, Catherine slowly regained her composure."
      },
      {
        "paragraph": "Indeed, she had to at least find out the cause of Ethan’s accident."
      },
      {
        "paragraph": "“I’ll send you there.”"
      },
      {
        "paragraph": "Shaun carried her to the passenger seat and fastened the seat belt for her."
      },
      {
        "paragraph": "Along the journey, Catherine gazed out of the window without saying a word. All her memories with\nEthan were running through her mind. The more she thought about them, the more terrible she felt."
      },
      {
        "paragraph": "Only after she arrived at the funeral parlor did she whisper to Shaun, “You’d better go back. The Lyons\nfamily members are probably here, so it might not b e good for you to attend the funeral.”"
      },
      {
        "paragraph": "“Mm.” Shaun passed her the car keys and said gently, “If there’s anything, you can call me immediately.\nTake care of yourself. Don’t let anyone bully you.”"
      },

      {
        "paragraph": "Catherine nodded casually. Due to her mind which was in a mess, she could not be bothered to think\nabout anything else."
      },
      {
        "paragraph": "As soon as she entered the parlor, she spotted Wesley’s somber expression. Mr. Lowe had come all the\nway from Melbourne. The Lowe family, the Lyons family, and the Steele family were all present with\nsorrowful expressions."
      },
      {
        "paragraph": "Tracy looked as pale as a soulless puppet."
      },
      {
        "paragraph": "Her mother was wiping her tears by her side. “Why is my daughter so unlucky? Her husband left right\nwhen she got pregnant.”"
      },
      {
        "paragraph": "Catherine jerked, feeling an unspeakable pain."
      },
      {
        "paragraph": "Mrs. Steele suddenly ran to Catherine to slap her the second she saw her. “ It’s your doing! If Ethan\nhadn’t gone to look for you, he wouldn’t have died.”"
      },
      {
        "paragraph": "Catherine let the slap land on her face without intending to dodge it. However, when Mrs. Steele was\nabout to slap Catherine, Wesley rushed toward the woman and stopped her. He then roared, “Why are\nyou guys blaming her? The police found out"
      },
      {
        "paragraph": "that there were issues with the car, so the factory that manufactured the car should be held responsible\ninstead.”"
      },
      {
        "paragraph": "“There were issues with the car?” Catherine asked in a daze."
      },
      {
        "paragraph": "“Yeah. The surveillance camera showed that the car lost control and accelerated in the last ten seconds\nor so.”"
      },
      {
        "paragraph": "Wesley explained, “Even if Ethan hadn’t gone to look for you, he could’ve gone to meet someone"
      },
      {
        "paragraph": "else and the same problem would most likely arise a s well. In fact, that car that he drove was the newest\ninnovation with cutting-edge technology. Having said that, there have been a lot of accidents involving\nhigh-tech cars in the past two years.”"
      },
      {
        "paragraph": "A look of grief washed over Catherine’s face. Did Ethan lose his life simply because of that?"
      },
      {
        "paragraph": "“What’s more…” Wesley suddenly added, “He could’ve gone looking for you because of me. We had a\nconflict last night. He probably knew that I was in a bad mood, so he wanted to mediate things without\nletting me find out. In this case, the blame should go to me instead of you.”"
      },
      {
        "paragraph": "Catherine was enlightened now. It was no wonder Ethan had said he had something important to tell her.\nHe had even asked her not to let Wesley know about it."
      },
      {
        "paragraph": "Tracy lifted her head and glanced at Wesley. With a hoarse voice, she said, “It’s okay, Mom. I’ m just\nunlucky, and so is Ethan. Let’s not pin it on anyone.”"
      },
      {
        "paragraph": "Mrs. Steele heaved a sigh."
      },
      {
        "paragraph": "Although Mr. Lowe was deeply saddened by the loss of his son, he still had another son. Moreover, he\ndid not wish to see Ethan and Wesley be at odds."
      },
      {
        "paragraph": "Given that Wesley’s current status was different from before, Mr. Lowe needed to fawn over him in the\nfuture. With that, he said, “Get Ethan cremated as soon as possible. Seeing him like this… I feel truly\nheartbroken.”"
      }
    ]
  },
  {
    "title": "Chapter 1159 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Ethan’s father gave the order."
      },
      {
        "paragraph": "The next day, the cremation ceremony was held for Ethan."
      },
      {
        "paragraph": "Catherine saw him for the last time. It was very startling, but she was not petrified. She felt nothing but\ngrief. The one whom she had been calling ‘ Brother Ethan’ since she was young had left just like that."
      },
      {
        "paragraph": "Why was a human’s life so fragile?"
      },
      {
        "paragraph": "After Ethan was cremated, Catherine did not go to the office for three consecutive days. She was like a\ntortoise that was hiding in her shell, not going anywhere."
      },
      {
        "paragraph": "On the fourth day, she suddenly received a strange call. “Is this Aunty Cath? I’m Tracy.”"
      },
      {
        "paragraph": "“Miss Steele…” Catherine was at a loss. She thought Tracy was going to cause her trouble."
      },
      {
        "paragraph": "“I’d like to meet you. Please don’t tell anyone about it,” Tracy said under her breath."
      },
      {
        "paragraph": "Stunned, Catherine became instinctively alert. However, as soon as she heard Tracy mentioning that\nthey would meet downtown, she banished her doubts."
      },
      {
        "paragraph": "Soon, she drove to the cafe and entered the private room."
      },
      {
        "paragraph": "Tracy was sitting at the table. She was wearing a pair of sunglasses and a cap. As she had cut her hair\nshort and heavy makeup on her face, Catherine could barely recognize her."
      },
      {
        "paragraph": "“Why did you want to meet me?” Catherine sat opposite her. She had always thought of Tracy as a quiet\nwoman, but she could feel that Tracy was not despicable. Despite knowing that Catherine was previously\nin a relationship with Ethan, Tracy had never envied her nor did she join Sonya to badmouth her."
      },

      {
        "paragraph": "“Look at this.”"
      },
      {
        "paragraph": "Tracy passed her phone to Catherine."
      },
      {
        "paragraph": "Catherine clicked it open. It was a screenshot of a message that had not been sent out. [Watch out…]"
      },
      {
        "paragraph": "One could tell that it was an incomplete message as the word ‘Lyo’ could be seen in the messaging box\na t the bottom."
      },
      {
        "paragraph": "The draft of the message was meant for Catherine."
      },
      {
        "paragraph": "“This was Ethan’s last activity found in his phone. The police spotted the phone in the bush after the\nincident, but they didn’t know the password to his phone. After I got his phone, I switched it on and\nunlocked it. This screenshot was displayed on the screen.”"
      },
      {
        "paragraph": "Tracy gazed at her with mixed feelings. “I think Ethan might’ve been aware of something during the\nincident. He could’ve realized that he was going to die, so he wanted to text you to warn you for the last\ntime. But it was too late when the car began to catch fire. Hence, he tossed his phone out of the window.”"
      },
      {
        "paragraph": "Catherine’s long lashes quivered."
      },
      {
        "paragraph": "Did this mean that Ethan had been trying to remind her even in his last moments?"
      },
      {
        "paragraph": "“Why is it a screenshot?” Catherine suddenly asked, “Can I have a look at his phone?”"
      },
      {
        "paragraph": "Tracy replied thoughtfully, “After Ethan’s phone was passed to the police, the Lowe family and the Lyons\nfamily took a look at it as well. But I was the first to look at it. After noticing the drafted message, I sent\nthe screenshot to my phone and removed it from his phone.”"
      },
      {
        "paragraph": "Catherine was startled."
      },
      {
        "paragraph": "Tracy knitted her brows together. “Have you thought about the reason Ethan wanted to send you this\nmessage in his last moment rather than his last words regarding other things? What did he want you to\nbe careful of? Or was he looking for you yesterday because of something?”"
      },
      {
        "paragraph": "“I have no idea.”"
      },
      {
        "paragraph": "Afraid that Tracy would overthink it, Catherine swiftly explained, “I haven’t seen him since the wedding.\nWhen he suddenly contacted me the other day, I was quite surprised. But according to Wesley, it was\nprobably because I quarreled with Wesley the"
      },
      {
        "paragraph": "day before and Ethan wanted to mediate things for us."
      },
      {
        "paragraph": "Once she finished speaking, she fixed her eyes on the screenshot."
      }
    ]
  },
  {
    "title": "Chapter 1160 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Watch out…"
      },
      {
        "paragraph": "Watch out for who?"
      },
      {
        "paragraph": "Ethan had typed out a person whose name started with ‘Lyo’."
      },
      {
        "paragraph": "This meant that the person’s name had these three letters."
      },
      {
        "paragraph": "Lyo."
      },
      {
        "paragraph": "A thought struck Catherine’s mind."
      },
      {
        "paragraph": "Had Ethan tried to type out ‘Wesley Lyons’?"
      },
      {
        "paragraph": "Her face paled."
      },
      {
        "paragraph": "Upon noticing her expression, Tracy said, “ It looks like you’ve guessed it.”"
      },
      {
        "paragraph": "“No. This is impossible. ” Cathrine shook her head."
      },
      {
        "paragraph": "How could Ethan have wanted to remind her to watch out for Wesley in his final moments?"
      },
      {
        "paragraph": "Tracy said, “ Since Ethan typed out ‘Lyo’, it means that you have to be careful of people whose names\nstart with this. In his last moments, he could’ve"
      },
      {
        "paragraph": "wanted to type Uncle Wesley. So now you know why I had to delete the draft.”"
      },
      {
        "paragraph": "Catherine understood. She gazed at Tracy admiringly and with complicated feelings at the same time."
      },

      {
        "paragraph": "For the first time, Catherine found this woman intelligent and cool. Perhaps Tracy had been too quiet, so\nCatherine never really paid attention to her before this."
      },
      {
        "paragraph": "“Don’t you hate me?” Catherine suddenly asked. “ Sonya wishes she could skin me alive. Ethan was\nkilled in an accident when he was on his way to meet me. Because of me, your child lost his father. ”"
      },
      {
        "paragraph": "“Of course, I hate you.”"
      },
      {
        "paragraph": "A bitter look crossed Tracy’s face. “Having said that, Ethan had told me frankly that he had wronged you\na lot. He hurt you and let you down. He felt that he owed you. He also called himself a despicable person\nbecause he got together with me for the sake of benefits. But since he married me, he told me he would\ntreat me well and not betray me. Although you were the sweetheart in the depths of his heart, I’ve never\nbeen jealous of you. Some people might take possession of love and snatch it, but all I wanted was to\nstay by his side.”"
      },
      {
        "paragraph": "Catherine was shocked. She had to admit that Tracy was a broad-minded woman."
      },
      {
        "paragraph": "It was surprising that Ethan had met a woman like Tracy despite having gotten involved with Rebecca,\nthat wicked woman."
      },
      {
        "paragraph": "Tracy added, “Also, I believe that Ethan would’ve left his dying words for me in his last moments if it\nweren’t for something very, very important. I’m telling you about this because I want you to fulfill Ethan’s\nlast wish.”"
      },
      {
        "paragraph": "Tracy smiled as she reached the end of her sentence. Her eyes had slowly reddened."
      },
      {
        "paragraph": "“Sorry, ” Catherine apologized with utter devastation."
      },
      {
        "paragraph": "“You don’t have to be sorry. I think the most important thing here is that Ethan’s death might not be an\naccident but rather an intentional act.”"
      },
      {
        "paragraph": "Tracy told her another piece of staggering news. “ I asked the police to check the last footage of Ethan’s\naccident. It proved that the message was typed out 20 seconds or so after the car crashed. Don’t you\nfind it strange? Why did he try to send you a message after something happened to him and not before?\nWas it because he noticed something after the crash?”"
      },
      {
        "paragraph": "“Are you saying that he realized someone wanted to kill him after the crash?” Catherine gasped in fear.\n“But wasn’t it caused by a fault in the car?”"
      },
      {
        "paragraph": "“Some faults are man-made, ” Tracy whispered, “"
      },
      {
        "paragraph": "Think carefully about the conversation you had with Ethan. Did he say anything unusual?”"
      },
      {
        "paragraph": "“He said he had something important to tell me, but he asked me not to let Wesley know…” As Catherine\nreflected on it, she was chilled to the core."
      },
      {
        "paragraph": "Upon hearing it, Tracy went silent for a long time before she rose to her feet. “Was he actually looking for\nyou to mediate the conflict between you and Wesley? Nobody knows the truth, but the only thing we’re\nsure of is that he had driven the car from the office at that time. I think you should be careful. It’s best not\nto let anyone know that I met you today.”"
      }
    ]
  },

  {
    "title": "Chapter 1161 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "As soon as Tracy finished speaking, she wore her cap and sunglasses. She seemingly transformed\ninto a different person."
      },
      {
        "paragraph": "“Tracy.” Catherine leaped to her feet with clenched fists. “ I’ll investigate the matter. If Ethan’s death\nwas an intentional act, I’ll certainly not let the killer off the hook.”"
      },
      {
        "paragraph": "“Thank you. I hope you’ll fulfill Ethan’s last words and not let him down. ” Tracy turned around and\nsmiled sadly before she walked away."
      },
      {
        "paragraph": "Catherine sat in the private room for a long time."
      },
      {
        "paragraph": "The weather was warm, yet she felt chilly to the core."
      },
      {
        "paragraph": "Tracy’s presumption actually made sense. What if Ethan’s death was not an accident?"
      },
      {
        "paragraph": "Ethan left Wesley’s office to look for her. Why had he been looking for her?"
      },
      {
        "paragraph": "Why did he not struggle to escape or ask for help after the crash? Instead, he planned to send her a\nmessage to warn her. This indicated that the contents of the message must be of crucial importance.\nHowever, the car began to catch fire before he could send it."
      },
      {
        "paragraph": "He tried his best to toss his phone out with the intention of delivering the message even in his last\nmoments."
      },
      {
        "paragraph": "In the end, he did not finish typing the message. Did he mean Wesley Lyons or someone else from the\nLyons family?"
      },
      {
        "paragraph": "Wesley and the Lyons family shared the same last name, after all."
      },

      {
        "paragraph": "Ethan had been working for Wesley, so he might have discovered a secret that involved Wesley or the\nLyons family. He wanted to let Catherine know, but in the end… he was killed."
      },
      {
        "paragraph": "It might have been an accident or an intentional act."
      },
      {
        "paragraph": "If it was the former, it would be an extraordinary coincidence. If it was the latter, that would be…\nterrifying."
      },
      {
        "paragraph": "Anyway, given that Ethan was Sonya’s son, he was also part of the Lyons family."
      },
      {
        "paragraph": "Catherine took a long, deep breath. She told herself to calm down."
      },
      {
        "paragraph": "She must find out the truth to take revenge on Ethan’s behalf. After all, she was associated with his\ndeath."
      },
      {
        "paragraph": "When she returned to Wesley’s villa, she found it gloomy like a cemetery."
      },
      {
        "paragraph": "She could not help but recall Shaun’s words."
      },
      {
        "paragraph": "Did she know Wesley well? Lea and Mason had known each other since college. Only after 3o years\ndid she see Mason’s true colors. On the other hand, Catherine had only known Wesley for four years.\nThey were not the sort who spent a lot of time together either."
      },
      {
        "paragraph": "At 10:00 p.m., Wesley came home feeling exhausted. These few days, she often saw him looking\ndepressed because of Ethan’s death. His usually tidy appearance had been replaced with an unshaven\nlook, which made him appear more disheartened."
      },
      {
        "paragraph": "“Cathy, why are you still awake?” Wesley was surprised to see her on the living room couch. Normally,\nshe was in the bedroom at this hour."
      },
      {
        "paragraph": "“I couldn’t fall asleep.” Catherine opened her eyes, feigning lethargy. However, her eyes were subtly\nfixed on him."
      },
      {
        "paragraph": "She noticed that he had changed his shirt after leaving the house this morning."
      },
      {
        "paragraph": "When she reflected on it, it seemed that he had done this a few times previously. Nevertheless, she did\nnot think too much into it."
      },
      {
        "paragraph": "Wesley rubbed his brows. “I’m sorry for not accompanying you these few days. Ethan’s death was too\nsudden. There are a lot of matters in the company that I have to handle.”"
      },
      {
        "paragraph": "“It’s alright.” Catherine asked, “How’s the investigation into Ethan’s accident going? Has the car factory\nadmitted to it?”"
      },
      {
        "paragraph": "“Based on the data that the police received, it was the car that was faulty. The factory is planning to\nsettle the issue privately by offering compensation. After all, Ethan’s parents are still around. It depends\non their decision.”"
      },
      {
        "paragraph": "Wesley said in a helpless tone, “Having said that, my brother-in-law doesn’t really care about Ethan. I\nthink he took the money and settled it privately.”"
      },
      {
        "paragraph": "“What a pity, ” Catherine said despondently, “ These few days, I keep wondering why Ethan didn’t seize\nthe opportunity to escape after the crash. If he had escaped from the car, he wouldn’t have burned to\ndeath.”"
      }
    ]
  },
  {
    "title": "Chapter 1162 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“The police said that he was stuck in the car after the crash, so he couldn’t escape.”"
      },
      {
        "paragraph": "Wesley sighed. “The dead can’t come back to life. Don’t think too much. We still have to move on with\nour lives. I heard that my sister took a knife to the office to look for you on the day Ethan died."
      },
      {
        "paragraph": "Later, Shaun came— ”"
      },
      {
        "paragraph": "“Mm, yes. I didn’t know he would come either, ” Catherine explained."
      },
      {
        "paragraph": "“Don’t worry, I’m not that petty. I heard that if Shaun hadn’t pushed you away, you might’ve been\nstabbed. Considering that both of you are my family, such an issue really pains me.”"
      },
      {
        "paragraph": "Wesley walked to Catherine and held her hands with an affectionate gaze."
      },
      {
        "paragraph": "If this had happened back then, Catherine would feel guilty. However, she was filled with coldness today."
      },
      {
        "paragraph": "Was this his true self? Could there be a strange side to him behind this affectionate side?"
      },
      {
        "paragraph": "“It’s all in the past. You must be tired too. Go and rest early.” Catherine turned around and walked up the\nstairs."
      },
      {
        "paragraph": "Wesley suddenly called out to her, “By the way, are you available the day after tomorrow? Senator\nMead’s daughter is having a birthday party. Mrs. Mead would like me to bring you over. Considering the\nMead family’s unique status and the fact you’re my wife, I was too embarrassed to reject her.”"
      },
      {
        "paragraph": "“Okay. I’ll go with you.” Catherine nodded."
      },
      {
        "paragraph": "Perhaps she could better understand Wesley’s character on such an occasion."
      },
      {
        "paragraph": "The next day."
      },

      {
        "paragraph": "She received a call from Suzie. “Mommy, do you still remember that you have two cute darling kids?”"
      },
      {
        "paragraph": "“Sorry, Suzie. I have a lot of things to handle recently.” Catherine felt extremely guilty for neglecting her\ntwo kids during this period because of Ethan’s matter."
      },
      {
        "paragraph": "Well, she only dared behave this way because Shaun was looking after them."
      },
      {
        "paragraph": "Suzie sighed. “I’m kidding. I heard my scummy dad say you lost a childhood friend recently, so you’re\nunhappy. I won’t blame you.”"
      },
      {
        "paragraph": "“Thank you for being so understanding, my darling, ” Catherine responded with a smile."
      },
      {
        "paragraph": "“But you have to come and pick us up to eat and swim with us,” Suzie said."
      },
      {
        "paragraph": "“Yeah. Lucas and I want to go swimming, but my scummy dad said that you have to come with us. It can\nbe dangerous for him to take the two of us out to swim. He’s afraid he can’t handle us alone.”"
      },
      {
        "paragraph": "Catherine admitted that Shaun was right. However, she felt rather embarrassed at the thought of having\nto wear a swimsuit and swim with Shaun."
      },
      {
        "paragraph": "“Well… Eating with you isn’t an issue. As for swimming, I’ll think about it…”"
      },
      {
        "paragraph": "“I don’t care. I want to swim. If you don’t promise me, I’ll cry in front of you. Hmph.” Suzie began to\nthreaten Catherine angrily."
      },
      {
        "paragraph": "Catherine’s head hurt badly. She would have to talk about it when she met Suzie later."
      },
      {
        "paragraph": "When Catherine was about to pick Suzie up at four- ish in the afternoon, Shaun gave her a call. He told\nher that he would pick Suzie up and asked her to head to the restaurant for dinner straight away."
      },
      {
        "paragraph": "Catherine readily agreed as it was much more convenient for her not to pick Suzie up."
      },
      {
        "paragraph": "When she came to reflect on this, there were quite a lot of pros to letting her children acknowledge their\nfather."
      },
      {
        "paragraph": "The restaurant that Shaun had chosen had a spacious courtyard with a peaceful environment."
      },
      {
        "paragraph": "By the time Catherine arrived there, the two children were playing with remote-controlled racing cars in\nthe courtyard. On the other hand, Shaun was seated on the chair beside some pots of red blooms. The\nman was wearing an orange shirt and a pair of gray pants. The bright color simply made him look so\nexquisite that the flowers around him paled in comparison."
      }
    ]
  },
  {
    "title": "Chapter 1163 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Mommy…”"
      },
      {
        "paragraph": "Suzie first spotted Catherine. She ran to her and hugged her happily. “Mommy, look, these are the new\ncars Granny bought for us. I’m having a competition with Lucas.”"
      },
      {
        "paragraph": "“You’re playing well.” Catherine stroked her hair and gazed at Lucas."
      },
      {
        "paragraph": "She was worried about Lucas. During this period, he would stay at Joel’s place sometimes and the Hill\nhousehold at other times."
      },
      {
        "paragraph": "“Lucas, how’s your stay in the Hill family’s house? ” Catherine asked Lucas in front of Shaun."
      },
      {
        "paragraph": "Shaun looked at his son nervously. These few days, everyone in the Hill family had been going all out to\nplease this little one."
      },
      {
        "paragraph": "“… It’s fine,” Lucas looked up and answered her."
      },
      {
        "paragraph": "Catherine was a little surprised. Given Lucas’ reserved disposition, his reply meant that he got along well\nwith the Hill family."
      },
      {
        "paragraph": "“That’s great. ” She sighed in relief. Now that she was at ease, she could focus her attention on the\ninvestigation on the cause of Ethan’s death."
      },
      {
        "paragraph": "“Stop playing. Come in and have some barbecue. Let’s finish our food soon and go for a swim, ” Shaun\napproached them and said."
      },
      {
        "paragraph": "“Hooray! I can swim! ” Suzie was ecstatic."
      },

      {
        "paragraph": "Catherine pulled a long face. “Considering that she’s still so young, swimming isn’t suitable for her. Also,\nthe water in the pool isn’t clean. It’s easy to get sick there.”"
      },
      {
        "paragraph": "Once she finished speaking, the two children’s faces fell. Even Lucas frowned, looking unhappy."
      },
      {
        "paragraph": "“It’s a private pool. It’s not open to the public, ” Shaun explained, “And I’ve already asked the manager to\nhave the water changed. No one will be using the pool except for our family.”"
      },
      {
        "paragraph": "At that moment, Catherine could not find any other excuses."
      },
      {
        "paragraph": "When she swung around in annoyance, Shaun shot a look at the two children and smiled smugly."
      },
      {
        "paragraph": "When he mentioned ‘our family’, Catherine had not denied it."
      },
      {
        "paragraph": "Suzie chuckled secretly. Meanwhile, a subtle smile flashed across Lucas’ eyes and he seemed to be in a\ngood mood."
      },
      {
        "paragraph": "At night, the four of them had barbecue."
      },
      {
        "paragraph": "The meat was prepared by the chef who came from Country H, so it was authentic."
      },
      {
        "paragraph": "Shaun took the initiative to barbecue the meat, whereas Catherine and the children just focused on\neating."
      },
      {
        "paragraph": "The three of them were full. After they rested for half an hour, Shaun drove to the private pool."
      },
      {
        "paragraph": "By the time they reached there, the manager had already prepared four new swimsuits for them."
      },
      {
        "paragraph": "The moment Catherine saw her swim suit, she was completely speechless. Initially, she was afraid that\nShaun would deliberately prepare a sexy bikini for her. However, the swimsuit in front of her was worlds\napart from a bikini. This was just a black one-piece swimsuit. Seeing how old school it was, she was at a\nloss for words"
      },
      {
        "paragraph": "Unlike hers, Suzie’s pink floral swimsuit looked pretty."
      },
      {
        "paragraph": "“Mommy, your swimsuit is so ugly.” Suzie scoffed with disgust."
      },
      {
        "paragraph": "Catherine could only smile reluctantly. “With my beauty and wonderful figure, I’ll look good in everything I\nwear.”"
      },
      {
        "paragraph": "Lucas went along with what Catherine said. “ Mommy, everything looks good on you.”"
      },
      {
        "paragraph": "Shaun nodded. “I think your mommy is too pretty, so I chose an ordinary swimsuit for her.”"
      },
      {
        "paragraph": "A moment later, Catherine came out with Suzie, holding her hand. Lucas and Shaun were already\nwaiting outside. There was nothing extraordinary about Lucas in his swimsuit, given that he was still a\ncute kid. However, Shaun, who was standing beside him in a pair of blue swim trunks, had revealed his\nsturdy and muscular physique. He had a wonderful figure. His chest showed his pees clearly, but they\nwere not too big. Overall, he oozed a masculine charm that was suffocating."
      },
      {
        "paragraph": "Catherine had seen him like this before, but it had been a long while since then."
      },
      {
        "paragraph": "After darting a glance at him, she could not avert her eyes."
      },
      {
        "paragraph": "Her face was burning in spite of herself, especially when she recalled leaning on his chest and crying\nuncontrollably a few days ago. Similarly, Shaun gazed at her with burning eyes."
      }
    ]
  },
  {
    "title": "Chapter 1164 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Even though Catherine was wearing a black one – piece swimsuit that was very old school, her hair was\ntied into a bun, which made her pretty features more prominent. The swimsuit emphasized her curves,\nwhile her snowy legs beneath the skirt looked alluring."
      },
      {
        "paragraph": "She was still so pretty despite having given birth to two children for Shaun."
      },
      {
        "paragraph": "She was like red wine—the more it aged, the better it tasted."
      },
      {
        "paragraph": "“Scummy Dad, why are you staring at Mommy? Let’s go swimming,” Suzie said with a pout."
      },
      {
        "paragraph": "With the child blurting out this statement, the two adults felt abashed."
      },
      {
        "paragraph": "Catherine’s pretty face turned crimson. She could not help but glance at Shaun before she held Suzie’s\nhand and got into the pool."
      },
      {
        "paragraph": "Lucas tagged along."
      },
      {
        "paragraph": "Shaun coughed lightly and immediately said, “ Lucas, I’m going to teach you how to swim freestyle\ntoday.”"
      },
      {
        "paragraph": "Since Lucas knew how to swim, Shaun took him to the other end of the pool to swim in the deeper parts.\nSuzie could not swim yet, so Catherine dared not risk bringing her there. She just let her play in the\nshallow end of the pool."
      },
      {
        "paragraph": "After playing for a while, Suzie saw Lucas and Shaun swimming like fishes on the other end. She kept\nbadgering Catherine to take her there."
      },
      {
        "paragraph": "“No way. You can’t swim, so you can’t go there. ” Catherine rejected her."
      },

      {
        "paragraph": "“I want to go there. I have a float.” Suzie continued to make a scene."
      },
      {
        "paragraph": "Catherine’s head hurt. At this moment, Shaun came with Lucas. “Enough, Suzie. You can play with water\nguns with Lucas.”"
      },
      {
        "paragraph": "“Yay! I have a water gun to play with! ”"
      },
      {
        "paragraph": "The two children began to play with water guns in the pool."
      },
      {
        "paragraph": "Shaun walked to Catherine who was covered with water droplets. The droplets slid all the way down to\nher neck."
      },
      {
        "paragraph": "“Shaun, where are you looking?” Upon catching his gaze, she flushed and glowered at him fiercely."
      },
      {
        "paragraph": "When she subconsciously wanted to cover her body, she realized that there was nothing exposed in this\nswimsuit."
      },
      {
        "paragraph": "“If I wanted to look at your body, I would’ve gotten you a bikini.” Shaun wiped away the water on his face,\nhis handsome face revealing an evil smile. “ But I didn’t do that because our son is around. I don’t want\nany other guys to see you in a bikini.”"
      },
      {
        "paragraph": "It turned out that he was wary of Lucas."
      },
      {
        "paragraph": "Catherine was completely at a loss for words. She could not be bothered about Shaun."
      },
      {
        "paragraph": "Since the two kids, who acted as the third wheels, were finally not around, Shaun would surely not miss\nthis opportunity. “Are you… feeling better?”"
      },
      {
        "paragraph": "Catherine did not say a word."
      },
      {
        "paragraph": "Shaun could not help but say weakly, “The other day, you wept so bitterly because of Ethan although he\nhad hurt you. If something happens to me one day, will you shed tears over me?”"
      },
      {
        "paragraph": "“No. An awful man like you even survived the elevator plunging down last time, ” Catherine snarked\nindifferently."
      },
      {
        "paragraph": "“It depends. Sometimes people just leave without any signs…”"
      },
      {
        "paragraph": "“ Shaun Hill, are you done? Why must you be a wet blanket by mentioning such a thing when all of us\nare having fun?” Catherine glared at him in annoyance."
      },
      {
        "paragraph": "“Mommy, take that.” Suzie suddenly shot her with the water gun."
      },
      {
        "paragraph": "Upon noticing that the water nearly splashed her face, Shaun hugged Catherine abruptly and blocked it\nwith his back."
      },
      {
        "paragraph": "The two of them were drenched. Catherine did not feel cold in Shaun’s embrace. Instead, she felt a\nburning sensation in her heart."
      },
      {
        "paragraph": "“Shaun Hill, what are you doing?” Catherine pushed his chest."
      },
      {
        "paragraph": "Shaun looked down and glanced at her wickedly. “ Cathy, how did you feel when you touched it?”"
      },
      {
        "paragraph": "“What a hooligan.” Catherine was aware of where her hands were placed. Blushing, she pushed him\naway and swung around to get even with Suzie."
      },
      {
        "paragraph": "Suzie’s ringing laughter echoed across the pool."
      }
    ]
  },
  {
    "title": "Chapter 1165 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Only when Suzie was tired of playing did Catherine carry her out of the pool. She helped Suzie wipe her\nbody and wrapped a towel around her from behind."
      },
      {
        "paragraph": "She turned around, only to meet Shaun’s deep -set eyes."
      },
      {
        "paragraph": "“Come on. Close your eyes.”"
      },
      {
        "paragraph": "He lowered his head and wiped the water off Catherine’s neck and body."
      },
      {
        "paragraph": "This intimate gesture made Catherine feel so awkward that she tilted away. “You don’t have to wipe\nanymore. I’m going to take a shower later.”"
      },
      {
        "paragraph": "“Okay. Bring this towel with you. It’s cold at night. Don’t catch a cold.”"
      },
      {
        "paragraph": "Shaun nodded gently and watched Catherine leave with Suzie. Then, he turned around and met Lucas’\ndistracted gaze."
      },
      {
        "paragraph": "“Are you trying to make peace with Mommy?” Lucas’ lips twitched. “Forget it. I admit that you’re quite\ncapable, but Mommy has already married Uncle Wesley. I won’t take your side.”"
      },
      {
        "paragraph": "“Lucas, let me teach you something, ” Shaun said seriously, “One must not give up easily.”"
      },
      {
        "paragraph": "Lucas rolled his eyes. “Not giving up easily and pestering someone relentlessly are two different things.”"
      },
      {
        "paragraph": "“When have I pestered her relentlessly?” Shaun raised his brows. “Have you seen your mommy acting\nlike she’s annoyed at me?”"
      },
      {
        "paragraph": "“Hasn’t she made it obvious enough?”"
      },
      {
        "paragraph": "“No. I can only see that she’s in a dilemma because she’s afraid that she’ll fall for me again.”"
      },

      {
        "paragraph": "Shaun let out a sigh. “You won’t understand these matters between adults. When you fall for a girl one\nday, you’ll then understand how I feel. At this point, you still don’t know what love is.”"
      },
      {
        "paragraph": "Lucas was speechless."
      },
      {
        "paragraph": "Shaun felt that his words had no impact on Lucas, considering that he was not even three years old. To\nLucas, love was something incomprehensible."
      },
      {
        "paragraph": "“Also, I want to remind you of something.” Shaun stared at Lucas earnestly. “Sometimes, we need a pair\nof observant eyes because the adult world is very complicated. You won’t be able to see through\nhypocrites easily.”"
      },
      {
        "paragraph": "“What do you mean?” Lucas pulled a long face. “ Are you saying that Uncle Wesley is a hypocrite?”"
      },
      {
        "paragraph": "Shaun did not admit it nor deny it. “Lucas, I just want to tell you that adults won’t reveal their wicked side\non their faces or through their actions. I hope you’ll know how to analyze them. Your mommy is the\npresident of a listed company, while your grandpa has assets worth hundreds of billions of dollars.\nThere’ll be a lot of people approaching you with ulterior motives and trying to gain advantages from you\nin the future. As a kid, you might think you’re clever, but other people already know how they can trick\nyou.”"
      },
      {
        "paragraph": "Lucas opened his mouth grumpily, but after some thought, he pursed his thin lips again. He frowned and\nremained silent for a long time."
      },
      {
        "paragraph": "When Catherine came out, he saw Shaun and Lucas in silence."
      },
      {
        "paragraph": "“What’s wrong with you guys?” She found them acting strange."
      },
      {
        "paragraph": "“I’m teaching him how to distinguish between good people and bad people. ” Shaun immediately\nexplained, “Having been a victim, I’m very experienced in this area. No one understands this more than I\ndo.”"
      },
      {
        "paragraph": "Catherine was at a loss for words."
      },
      {
        "paragraph": "Since he had knowledge of this, she really had no idea what to say. Then, she darted a glance at Lucas.\n“Alright. It’s good for you to learn about this as well. After all, your dad met a woman at the age of seven\nor eight who continued to deceive him for over ten years. You should learn about this now so that you\nwon’t follow in his footsteps.”"
      },
      {
        "paragraph": "Stung by Catherine’s words, Shaun hung his head silently."
      },
      {
        "paragraph": "Lucas shot a look at Shaun in disgust. “I’m not as foolish as him.”"
      },
      {
        "paragraph": "Catherine sighed. “You can’t say that. It seems to happen to your family a lot. Your granny was deceived\nfor 3o years, while your dad was deceived for 2o years. You guys— ”"
      },
      {
        "paragraph": "“We won’t be deceived, ” Lucas and Suzie interrupted Catherine simultaneously. “We take after you,\nMommy.”"
      },
      {
        "paragraph": "“Uh…”"
      },
      {
        "paragraph": "Catherine was dumbfounded. In fact, she felt that… She had been deceived before too, especially in\nregards to her marriage. Nevertheless, as their mother, she wanted to retain her dignity."
      },
      {
        "paragraph": "”Let’s go. I’ll bring you to get your car.” Shaun changed the topic. ”Are you available at night tomorrow?\nLet’s accompany the kids to… ”"
      }
    ]
  },
  {
    "title": "Chapter 1166 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“I have a date tomorrow, ” Catherine interrupted Shaun’s sentence, knowing what was on his mind."
      },
      {
        "paragraph": "“With Wesley?” Shaun’s handsome face looked particularly gloomy in the dark."
      },
      {
        "paragraph": "Catherine shot a strange glance at him. “He asked me to attend Miss Mead’s birthday party. Didn’t Miss\nMead invite you?”"
      },
      {
        "paragraph": "“ I’m not close to her.” Shaun instantly denied his relationship with her."
      },
      {
        "paragraph": "With that, Catherine did not say anything else."
      },
      {
        "paragraph": "When Shaun drove to the office the next day, someone called out to him."
      },
      {
        "paragraph": "“Shaun, I finally stumbled into you this time.” Hannah, who was dressed to the nines, appeared in front of\nhim. Considering her young age, she looked like a budding flower."
      },
      {
        "paragraph": "When Shaun recalled that Catherine would be attending her birthday party, his brows twitched and he\nstopped walking."
      },
      {
        "paragraph": "“Shaun, I’ve come to look for you several times. Are you trying to shun me and not answering my call on\npurpose?”"
      },
      {
        "paragraph": "As Hannah was speaking, she naturally put her hand on his shoulder."
      },
      {
        "paragraph": "“Miss Mead, please behave yourself,” Shaun said while dodging her."
      },
      {
        "paragraph": "“I’m interested in you. Why should I behave myself?” Hannah pouted coquesttishly. “What’s more, today\nis my birthday. Can’t you just put up with me?”"
      },
      {
        "paragraph": "Shaun gave her a stony glance. “Oh.”"
      },

      {
        "paragraph": "“Oh? How indifferent of you. I don’t care. You must attend my birthday party today.” Hannah took out an\ninvitation card from her handbag and stuffed it into his arms. “If you don’t come, I’ll make my dad do\nsomething to you.”"
      },
      {
        "paragraph": "Shaun’s expression changed."
      },
      {
        "paragraph": "He believed that what Hannah broght up would not be something favorable."
      },
      {
        "paragraph": "This current time was crucial period for Hill Corporation. If anything went wrong with its development, the\nconsequences would be unimaginable."
      },
      {
        "paragraph": "“I’ll be waiting for you.” Hannah gave him an air kiss before she turned around and swaggered off."
      },
      {
        "paragraph": "A hint of hatred flashed across his eyes. Suddenly, Shaun grinned at the sight of the invitation card in his\nhand."
      },
      {
        "paragraph": "He wondered how Catherine would react after seeing him there."
      },
      {
        "paragraph": "At night."
      },
      {
        "paragraph": "Catherine, who was dressed in a modest black gown, arrived at the Mead family’s villa together with\nWesley."
      },
      {
        "paragraph": "Since the eldest young lady of the Mead family was the focus of the party, Catherine had to dress\ncautiously to subdue her beauty."
      },
      {
        "paragraph": "At first, Catherine thought that a lot of noblemen would show up."
      },
      {
        "paragraph": "After she arrived, she realized that there were just ten or so influential figures. Most of the guests present\nwere Hannah’s friends."
      },
      {
        "paragraph": "“Miss Mead, this is a little birthday gift that my wife and I got for you. Happy birthday.” Wesley passed\nHannah the gift with a smile."
      },
      {
        "paragraph": "Hannah darted a glance at Catherine who was beside him. “Your presence is enough. Why did you bring\nyour wife over?”"
      },
      {
        "paragraph": "Hannah’s tone clearly indicated that she was not happy with Catherine’s presence."
      },
      {
        "paragraph": "Senator Mead’s face darkened. He told Hannah off, “"
      },
      {
        "paragraph": "How dare you say that?! Madam Lyons is a few years older than you and the chairwoman of a listed\ncompany. She’s also Miss Lynch’s best friend. It’s your honor that she’s here for your birthday party.”"
      },
      {
        "paragraph": "After pausing for a moment, Hannah said, “I’m sorry, Madam Lyons.”"
      },
      {
        "paragraph": "“It’s fine. I understand. Previously when I held birthday parties like this, I, too, hoped that only my good\nfriends would come. Sometimes, one tends to feel restrained when there are too many people around.”\nCatherine smiled, her words restoring Hannah’s dignity."
      }
    ]
  },
  {
    "title": "Chapter 1167 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Deep down, Catherine knew full well that the Mead family only invited her simply because of her\nrelationship with Freya."
      },
      {
        "paragraph": "At the thought of Freya, she believed that Freya would probably be here as well."
      },
      {
        "paragraph": "Immediately after the thought flashed across her mind, she saw Freya and Heidi walking in together.\nBehind them was an elegant young man who was probably in his early 20s. He had clear skin and a\nstriking appearance."
      },
      {
        "paragraph": "Catherine vaguely remembered that this person was Nathan’s only son, Ryan Snow. She had seen him\nfrom afar in the previous banquet but never talked to him."
      },
      {
        "paragraph": "“Cathy… ” The moment Freya saw Catherine, she immediately went to her enthusiastically. “Why didn’t\nyou tell me that you’d be here?”"
      },
      {
        "paragraph": "“ I had a lot of stuff to handle, so I forgot to inform you.” Catherine nodded at Heidi politely and shook\nhands with Ryan after that."
      },
      {
        "paragraph": "“Hi, Madam Snow, Young Master Snow.” Similarly, Wesley shook hands with Heidi and Ryan with a\nsmile. “Young Master Snow, your reputation precedes you. I’ve long since heard about your capability.\nYou’re just like your dad.”"
      },
      {
        "paragraph": "“President Lyons, I’m flattered by your compliment. You’re young and promising too.” Although Ryan was\nyounger than Wesley, he had been subtly influenced by his father and uncle whom he had been living\nwith since young. He was a smooth talker but not arrogant."
      },
      {
        "paragraph": "Catherine silently watched the scene from the side. During the banquet previously when Nathan\nacknowledged Freya as his goddaughter, Catherine had witnessed how Wesley quickly played up to"
      },

      {
        "paragraph": "Senator Mead with her own eyes. At that time, she thought it was normal for Wesley to have the intention\nof getting acquainted with influential figures. Nevertheless, only today did she realize that Wesley was\ngreat at buttering them up."
      },
      {
        "paragraph": "All of a sudden, Heidi looked at Catherine and said thoughtfully, “President Lyons, you have a glib\ntongue. How blessed Miss Jones is.”"
      },
      {
        "paragraph": "A hint of embarrassment flashed across Catherine’s gaze. In her eyes, Heidi meant that Wesley was\ngreat at buttering up influential figures."
      },
      {
        "paragraph": "Luckily, Senator Mead and Madam Mead soon approached them enthusiastically with their daughter."
      },
      {
        "paragraph": "“Uncle Gavin, this is the gift I prepared for Hannah.” Ryan handed the gift to Hannah chivalrously."
      },
      {
        "paragraph": "Ryan had known Hannah since he was young. Hannah smiled and said intimately, “Thanks, Ryan.”"
      },
      {
        "paragraph": "Madam Mead suddenly said while grinning, “ Hannah, you should serve Ryan well tonight. Come to think\nof it, both of you have developed a good relationship since young and are of similar age."
      },
      {
        "paragraph": "Hey, Madam Snow. Does Ryan have a girlfriend? They look compatible. Perhaps we can be relatives?”"
      },
      {
        "paragraph": "The glint in Ryan’s eyes changed, while Heidi gave a faint smile. “It depends on our children. Marriage\nconcerns their happiness. There must be mutual love between them.”"
      },
      {
        "paragraph": "Hannah said sweetly right away, “Aunty Heidi, that’s very wise of you. Ryan and I are just good friends.\nWhat’s more, I’m already interested in someone else.”"
      },
      {
        "paragraph": "“Oh, who’s that?” Heidi asked out of curiosity."
      },
      {
        "paragraph": "When Hannah was about to answer, she suddenly saw a striking figure walking in from the entrance.\nShe said cheerfully and affectionately, “Look, he’s here.”"
      },
      {
        "paragraph": "When everyone turned their gazes to Shaun, he was walking in with a black suit. The second he strode\nwith his long legs, his tall and attractive figure exuded a sense of nobility."
      },
      {
        "paragraph": "Despite the Mead family and the Snow family’s outstanding identities, their auras appeared to fade into\ninsignificance when compared to Shaun’s."
      },
      {
        "paragraph": "Even though this man was currently down and out, many women could not resist his exquisite face and\nelegance."
      },
      {
        "paragraph": "When Wesley caught sight of Shaun, the depths of his eyes carried a sense of grimness."
      },
      {
        "paragraph": "Damn it! Little did he expect that the previous incident with the elevator plunging would end up causing\nHannah to fall for Shaun."
      },
      {
        "paragraph": "“Shaun, you’re here.” Hannah approached him with a joyful face. She stretched out her hands to wrap\nthem around him."
      },
      {
        "paragraph": "Shaun subtly avoided her and walked to Senator Mead, Heidi, and the rest to greet them."
      },
      {
        "paragraph": "“What brings you here, Shaun?”"
      },
      {
        "paragraph": "“Exactly. With his current identity, why is he at Miss Mead’s birthday party?”"
      },
      {
        "paragraph": "“For your information, Shaun saved Miss Mead last time and took the opportunity to get close to the\nMead family.”"
      }
    ]
  },
  {
    "title": "Chapter 1168 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Tsk. The previously arrogant Shaun has become so despicable now.”"
      },
      {
        "paragraph": "“Exactly. Tonight is interesting. Look, his ex-wife, Catherine Jones, is here too.”"
      },
      {
        "paragraph": "The guests were discussing it in whispers."
      },
      {
        "paragraph": "Having heard it all, Shaun looked grim and pursed his thin lips. He pretended as if he did not hear any\nof it."
      },
      {
        "paragraph": "Senator Mead and his wife became flushed with embarrassment for a short moment. Senator Mead\nthen said with a smile, “Welcome, Shaun. Well, I have yet to properly thank you for rescuing my\ndaughter the other day.”"
      },
      {
        "paragraph": "Ryan raised his brows and gave an evil smile. “ Brother Shaun, it turns out that you’re the one Eldest\nYoung Miss Mead is interested in. How unlucky of you.”"
      },
      {
        "paragraph": "“Stop talking nonsense.” Hannah glowered at Ryan before she pulled on Shaun’s arm. “Let’s go to the\nother side. I’ll introduce my friends to you.”"
      },
      {
        "paragraph": "Shaun turned around to look at Catherine. Before he could take a good look at her, Hannah dragged\nhim away."
      },
      {
        "paragraph": "At the sight of the scene, Catherine was simmering with rage."
      },
      {
        "paragraph": "F*ck! This despicable man had just flirted with her yesterday, but here he was attending Hannah’s\nbirthday party. Hannah was even pulling on his arm so intimately."
      },
      {
        "paragraph": "He even claimed that he was not close to Hannah yesterday."
      },

      {
        "paragraph": "What a damn liar!"
      },
      {
        "paragraph": "Of course, she did not dare reveal her feelings."
      },
      {
        "paragraph": "After all, everyone knew that she was Shaun’s ex- wife. Nearly everyone was secretly observing her, so\nall she could do was remain calm with a smile."
      },
      {
        "paragraph": "It seemed as if she sincerely wished her ex- husband happiness."
      },
      {
        "paragraph": "“Cathy, let’s go over there.” Freya came to her and held her hand. “It’s been a few days since we last\nmet. What have you been up to recently?”"
      },
      {
        "paragraph": "Catherine took the opportunity to walk some"
      },
      {
        "paragraph": "distance away with Freya. However, she did not walk too far away. She arrived at the garden and\nwatched Wesley through the French window in a low-key manner."
      },
      {
        "paragraph": "“Hey, why do you keep staring at Wesley? Is it because you’ve fallen for him so you’re afraid that\nsomeone will snatch him away?” Freya made fun of her with a snigger."
      },
      {
        "paragraph": "“You’re overthinking it.”"
      },
      {
        "paragraph": "After some thought, Catherine whispered the truth in Freya’s ears."
      },
      {
        "paragraph": "Freya was shocked upon hearing it. “How could it be? Wes—”"
      },
      {
        "paragraph": "Catherine covered her mouth and warned her with a low voice, “You’d better be careful. Don’t ever let\nthe cat out of the bag, especially not in front of him.”"
      },
      {
        "paragraph": "“Oh.” Freya lowered her voice and said, “But if you’re right and Ethan wanted you to watch out for him,\ndoes it mean that Wesley is going to hurt you?”"
      },
      {
        "paragraph": "“I have no idea as well.” A complicated look crossed Catherine’s face. “Anyway, no matter how good\nWesley is at hiding, I think he’ll probably reveal his true self during such an occasion. With so many"
      },
      {
        "paragraph": "influential figures here, I’m sure he’ll take great pains to butter them up.”"
      },
      {
        "paragraph": "“Yeah.” Freya came to a realization through Catherine’s words. “I’ll help you keep an eye on him and\nalso ask Ryan to probe him.”"
      },
      {
        "paragraph": "“Ryan?” Catherine smiled discreetly. “Are you close to this little brother who came out of nowhere?”"
      },
      {
        "paragraph": "“Hehe. The Snows are actually quite nice, except for Rodney, that dumb*ss.” Freya snorted with\ndisgust."
      },
      {
        "paragraph": "“That sounds like a good plan too. I saw Wesley fawning over Ryan just now. Anyway, don’t let anyone\nknow what I’ve just told you, ” Catherine reminded Freya."
      },
      {
        "paragraph": "Post navigatio"
      }
    ]
  },




  {
    "title": "Chapter 1169 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Duh. I’m not that stupid. Anyway… What’s going on with Shaun and Hannah? Is he really playing up to\nher?”"
      },
      {
        "paragraph": "Freya blinked and glanced at the pool."
      },
      {
        "paragraph": "The group of people at the pool was Hannah’s friends. They were all in their early 20s. They were\nbuzzing with excitement probably because Hannah had brought Shaun over."
      },
      {
        "paragraph": "“How would I know? It’s none of my business.” Catherine looked stunned. Then, she urged, “ Alright.\nYou’d better quickly look for Ryan.”"
      },
      {
        "paragraph": "“Okay, okay.” Freya soon left."
      },
      {
        "paragraph": "There were a lot of cakes and juice placed on the long table in the garden."
      },
      {
        "paragraph": "As soon as she took a glass of juice, a purple -haired lady walked over to her. She looked like she was in\nher 20s, but she was wearing heavy makeup like a scene kid."
      },
      {
        "paragraph": "“Are you Shaun’s ex-wife?”"
      },
      {
        "paragraph": "The lady introduced herself, “ I’m Hannah’s best friend, Camilla Cross. Aunty Catherine, I’m here to warn\nyou. My best friend is interested in Shaun, so you’d better stay away from him.”"
      },
      {
        "paragraph": "Aunty…"
      },
      {
        "paragraph": "Although Catherine was only 26, the woman was addressing her as ‘Aunty’."
      },
      {
        "paragraph": "Catherine raised her brows. After sipping on the juice, she smiled and her eyes swept over the woman.\n“Are you ten years old?”"
      },

      {
        "paragraph": "Camilla was startled. Before she came to her senses, Catherine smiled and said, “You called me ‘Aunty’,\ns o I thought you were only ten years old. After all, I’m just in my 20s.”"
      },
      {
        "paragraph": "Camilla chuckled. “Really? I’m sorry. I couldn’t tell because you look older than your age.”"
      },
      {
        "paragraph": "“No. It’s not because I look old. You’re just too childish.”"
      },
      {
        "paragraph": "Catherine disputed serenely. Having met many hypocrites, she had absolutely no regard for low- level\nopponents like this woman."
      },
      {
        "paragraph": "“Who’s childish? You—”"
      },
      {
        "paragraph": "“Your style is quite unique, ” Catherine interrupted her sentence with a lazy tone, “But people usually\nview youngsters like you as low-class punks.”"
      },
      {
        "paragraph": "“How dare you insult me?! ” Camilla flew into a rage. “Do you know who I am?”"
      },
      {
        "paragraph": "“Hey, don’t accuse me. I didn’t insult you. I just told you what people say.” Catherine bit her lip\nindifferently. “What’s more, I’m rich and beautiful."
      },
      {
        "paragraph": "I don’t need anything from your family. Do I need to be bothered about a witless young girl like you?”"
      },
      {
        "paragraph": "Once Catherine finished speaking, she swaggered off without bothering about her."
      },
      {
        "paragraph": "She was still smoldering with anger. However, she was not angry at Camilla or Hannah but Shaun, that\nb*stard, for luring women. He continued to cause her trouble despite having divorced her."
      },
      {
        "paragraph": "Camilla returned to the house in a huff and told Hannah about it. “That woman has a sharp tongue. You\nmust teach her a lesson, Hannah.”"
      },
      {
        "paragraph": "“How can I teach her a lesson? She’s Freya’s best friend, ” Hannah replied in distress."
      },
      {
        "paragraph": "“Technically, she’s just friends with Freya and not related to the Snow family. The Mead family and the\nSnow family are real comrades.” Another friend egged Hannah on."
      },
      {
        "paragraph": "Hannah’s brows twitched. She suddenly glanced sideways and spotted Shaun turning around to leave."
      },
      {
        "paragraph": "She immediately went after Shaun and held onto him. “Shaun, where are you going? You have to cut the\ncake with me later.”"
      },
      {
        "paragraph": "“I’m going to the restroom. Are you coming with me?” Shaun’s patience for this woman had run out long\nago."
      },
      {
        "paragraph": "“Sure.” Hannah nodded unabashedly."
      }
    ]
  },
  {
    "title": "Chapter 1170 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "The corners of Shaun’s mouth twitched. He turned on his heel and left without being bothered about\nHannah."
      },
      {
        "paragraph": "However, Hannah continued to pester him and went after him. “Shaun, are you looking for your ex-wife?”"
      },
      {
        "paragraph": "“Miss Mead…”"
      },
      {
        "paragraph": "Shaun turned his head around and said indifferently, “You should know why I came here. If I had known\nearlier that you’d bite the hand that fed you, I wouldn’t have risked my life saving you the other day.”"
      },
      {
        "paragraph": "Tears welled in Hannah’s eyes as she was dissatisfied. “It’s because I love you so much. Shaun, it’s my\nfirst time pursuing a man.”"
      },
      {
        "paragraph": "“Sorry, but a lot of women are also pursuing me. If I accept every woman who pursues me, I can already\nbuild a harem.”"
      },
      {
        "paragraph": "Shaun’s handsome face was heavy with sarcasm."
      },
      {
        "paragraph": "“But I’m different from those women.”"
      },
      {
        "paragraph": "Hannah continued determinedly, “I’m Gavin Mead’s daughter. As long as you get together with me, you’ll\nsoon be able to make a comeback. Didn’t you see how many people were trying to approach and play up\nto me? Shaun, you’re a clever man. The chance is right in front of you.”"
      },
      {
        "paragraph": "“I never rely on women for my success.” Shaun finished his sentence impassively before he walked\naway without hesitation."
      },
      {
        "paragraph": "Hannah was so exasperated that she began to tear up. However, as she watched Shaun’s tall and cold\nfigure leave, she fell for him even more deeply."
      },

      {
        "paragraph": "To her, he was different from all the other men she had met. She was fond of Shaun’s arrogance and\nauthority."
      },
      {
        "paragraph": "“What happened? Who bullied my daughter?” Senator Mead walked over to Hannah. She was the apple\nof his eye since she was his only daughter."
      },
      {
        "paragraph": "“Dad, Shaun doesn’t like me.” Hannah pouted. “ Can you help me out? I want him.”"
      },
      {
        "paragraph": "“How dare he be uninterested in my daughter? !” Senator Mead’s face darkened. “Hannah, why don’t\nyou pick someone else? Admittedly, Shaun is very charming, but his status is not the same as before.\nWith his current status, he doesn’t deserve to be with you. Moreover, he was married before.”"
      },
      {
        "paragraph": "“Dad, you can’t say that. I think Shaun won’t give up easily. He’s a truly capable person.”"
      },
      {
        "paragraph": "Hannah paid no heed to her father’s remark. “A capable man can make a comeback with some help.\nWhat’s more, he’s no ordinary man.”"
      },
      {
        "paragraph": "Deep down, Senator Mead was slightly swayed."
      },
      {
        "paragraph": "With that, Hannah clutched his hand. “Dad, Shaun is on good terms with the Snow family. Of course, I\nknow you guys want me to be with Ryan. But first of all, Ryan doesn’t like me. Secondly, he’s still too\nyoung. Hardly any man in Australia can be compared to Shaun in terms of shrewdness, thoughts, and\nknowledge. Besides, Shaun only failed because he was tricked by people who used underhand tactics.\nNeedless to say, if we take advantage of him in the future, he can probably assist you in becoming the\nprime minister one day.”"
      },
      {
        "paragraph": "“Stop talking nonsense. ” Senator Mead glared at Hannah nervously."
      },
      {
        "paragraph": "Hannah said thoughtfully, “Well, you’re going to be the deputy prime minister next year. Don’t you want to\nclimb to the top? You can’t just be assisting Uncle Nathan forever.”"
      },
      {
        "paragraph": "“Fine. I can’t stop you from doing what you want. Having said that, you can’t easily win Shaun’s heart. I\nheard his ex-wife has always had a special place in his heart…”"
      },
      {
        "paragraph": "“Well, it’s just Catherine Jones. She has married someone else. Dad, as long as you give me your\nblessing, I’ll have a way of capturing Shaun’s heart,” Hannah replied confidently."
      },
      {
        "paragraph": "“Suit yourself.” Senator Mead could not be bothered about her."
      },
      {
        "paragraph": "Only after he left did Hannah secretly call the servant of the Mead family over. “Put this in Shaun’s drink\nlater.”"
      },
      {
        "paragraph": "After returning from the garden, Catherine stayed by Wesley’s side the entire time."
      },
      {
        "paragraph": "With Catherine constantly by his side, Wesley felt restrained for the first time. There were many people\nhe wanted to butter up, but her presence made him feel uncomfortable."
      }
    ]
  },
  {
    "title": "Chapter 1171 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "After all, Catherine had always perceived Wesley as an elegant gentleman with a noble reputation."
      },
      {
        "paragraph": "“Cathy, where’s Freya? Go and have fun with her. I’m afraid you’ll feel bored mingling with people like\nus.” Smiling, Wesley persuaded her to leave."
      },
      {
        "paragraph": "“But I’m your wife. It’s not good to walk away just like that.” Pretending as if she was torn, Catherine\ncontinued, “What’s more, Shaun is here. I’m worried that you’ll overthink.”"
      },
      {
        "paragraph": "“No. I trust you.” Wesley gazed at her earnestly."
      },
      {
        "paragraph": "Catherine nearly believed in his words."
      },
      {
        "paragraph": "She turned around and walked away. However, Instead of scurrying off, she hid in an inconspicuous\nspot. If she had not done this, she would not have seen Wesley sitting beside Senator Mead and\nattentively lighting a cigarette for him."
      },
      {
        "paragraph": "At the sight of his behavior, frustration crept into Catherine’s mind."
      },
      {
        "paragraph": "She could sense that Wesley had been trying to appear gentle and elegant in front of her before this."
      },
      {
        "paragraph": "Did it mean that there was another side of him unknown to her when she was not around?"
      },
      {
        "paragraph": "“Miss Jones, you’re here.” A female servant walked to her. “Miss Lynch has been looking for you\neverywhere. She’s asking you to head over as she wants to introduce two people to you.”"
      },
      {
        "paragraph": "“Alright.”"
      },
      {
        "paragraph": "Catherine nodded and walked to the courtyard with the servant."
      },

      {
        "paragraph": "There was a large pool in the back garden. Some people were playing in the pool, while some were\nchatting over the barbecue grill."
      },
      {
        "paragraph": "The servant suddenly stopped by the pool. “Miss Jones, please hold on. My shoelaces are loose.”"
      },
      {
        "paragraph": "When she bent over to tie her shoelaces, she swiftly tried to push Catherine."
      },
      {
        "paragraph": "A glint flashed across Catherine’s eyes. She smiled faintly and dodged aside. The servant was the one\nwho fell into the pool instead."
      },
      {
        "paragraph": "Due to the huge splash of water, everyone turned their eyes to the pool."
      },
      {
        "paragraph": "“Help! Someone has fallen into the pool, ” Catherine screamed while feigning fear."
      },
      {
        "paragraph": "Someone immediately saved the servant, who was in a sorry state."
      },
      {
        "paragraph": "Upon hearing Catherine’s scream, Shaun ran out from a dark spot and fixed his eyes on her nervously.\n“Are you okay?”"
      },
      {
        "paragraph": "“What do you think would’ve happened to me?” Catherine rolled her eyes and snorted. “Because of you,\nI almost became the one who fell into the pool. Luckily, I was clever enough.”"
      },
      {
        "paragraph": "Shaun froze for a moment before he glanced sideways at the servant’s silhouette. His handsome face\ndarkened. Given that he was not a fool, he had more or less guessed what was going on."
      },
      {
        "paragraph": "“What’s the matter?” Hannah hurried over. She had been looking forward to watching Catherine fall into\nthe pool in her gown, yet what she ended up seeing was the servant, whom she gave her order to, being\nsaved out of the pool. It infuriated her so much that she almost vomited blood."
      },
      {
        "paragraph": "When Hannah noticed how Shaun was protecting Catherine with a concerned look, her hatred for\nCatherine reached its peak."
      },
      {
        "paragraph": "Hannah had not been able to find Shaun when she looked everywhere for him just now. With Catherine’s\nscream, however, he showed up straight away."
      },
      {
        "paragraph": "She had underestimated Shaun’s love for Catherine."
      },
      {
        "paragraph": "“Miss… ” The servant was shocked to see Hannah’s eyes that were full of displeasure. She shuddered\nand quickly said, “I don’t know how I offended Miss Jones. She suddenly pushed me into the pool.”"
      },
      {
        "paragraph": "Upon hearing the remark, everyone shifted their gaze to Catherine."
      },
      {
        "paragraph": "Hannah asked furiously, “Madam Lyons, why did you do that?”"
      },
      {
        "paragraph": "Her best friend, Camilla, teased, “Madam Lyons, you’ve divorced President Hill. It’s not right to ruin\nHannah’s birthday party just because she’s into him.” After hearing what Camilla said, the guests began\nwhispering to each other."
      }
    ]
  },
  {
    "title": "Chapter 1172 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“In the end, it’s all because Shaun is in a relationship with Miss Mead.”"
      },
      {
        "paragraph": "“But Catherine has married Wesley, hasn’t she? ”"
      },
      {
        "paragraph": "“You won’t understand. A lot of women have a roving eye. What’s more, she might be dissatisfied that\nShaun managed to play up to the Mead family.”"
      },
      {
        "paragraph": "“She looks pretty, but I didn’t expect her to be so disgusting.”"
      },
      {
        "paragraph": "When those disparaging comments reached Shaun’s ears, his bright eyes revealed a sense of grimness.\nJust as he was about to lose his temper, he heard Catherine snort."
      },
      {
        "paragraph": "“Are you sure I pushed you?” Catherine fixed her sharp eyes on that servant. “I came here with you just\nbecause you told me that Miss Lynch called me over. When we walked by the pool, you claimed that\nyour shoelaces were loose, so I stopped to wait for you. But you tried to push me and ended up falling\ninto the pool yourself.”"
      },
      {
        "paragraph": "“You’re bullsh*tting.” The servant, who had come u p with a lie on the spot, panicked upon hearing\nCatherine’s clear explanation. “I didn’t say that Miss Lynch was looking for you. You were the one who\nasked me to bring you over here.”"
      },
      {
        "paragraph": "Catherine bit her lip. “I can see that you’re rushing to make up a story. You probably haven’t thought it\nthrough, right? Otherwise, you wouldn’t have forgotten that there are surveillance cameras around the\npool. We can just check the surveillance footage to find out whether I was the one who pushed you.”"
      },
      {
        "paragraph": "The servant’s mind went blank. In a state of panic, she had no other choice but to look at Hannah for\nhelp."
      },

      {
        "paragraph": "Hannah wished she could kick the servant away. At this point, she could not help but say, “I didn’t expect\nsuch an issue to happen today, so the surveillance cameras aren’t turned on.”"
      },
      {
        "paragraph": "“What a coincidence. It’s always at crucial moments that the surveillance cameras are off or some\nimportant footage is missing.”"
      },
      {
        "paragraph": "Catherine sighed faintly. “Well, there’s nothing I can do. It’s up to you, Miss Mead. If you want me to say\nsorry, I’ll do it since this is your home and she’s your servant. Anyway, you won’t be at ease unless I\napologize, right?”"
      },
      {
        "paragraph": "The guests were not dumb. From Catherine’s words, they understood that Hannah was deliberately\nbullying and framing Catherine just because this was her house. She even intentionally said that the\nsurveillance cameras were off."
      },
      {
        "paragraph": "Hannah’s face flushed with anger. She knew that if she taught Catherine a lesson today, people would\ncall her a bully."
      },
      {
        "paragraph": "She clenched her teeth. A moment later, she smiled and said, “I just thought that everyone would feel\nuncomfortable if the surveillance cameras were on. Apparently, turning them off was unnecessary."
      },
      {
        "paragraph": "Let’s forget it. It wasn’t anyone’s intention to make this happen.”"
      },
      {
        "paragraph": "“Yeah, forget it.” Someone smoothed things over. “ It must just be a misunderstanding.”"
      },
      {
        "paragraph": "“I think Miss Jones got a fright. Just give her a slice of cake to calm her down later, Miss Mead.”"
      },
      {
        "paragraph": "“Yup. Let’s get ready and cut the cake now,” Hannah said with a grin."
      },
      {
        "paragraph": "“Wait a minute.”"
      },
      {
        "paragraph": "All of a sudden, Shaun said nonchalantly, “I heard you guys discussing something just now. I’d like to\nclarify that I’m not in a relationship with Miss Mead. As everyone knows, I’m already interested in"
      },
      {
        "paragraph": "someone else.”"
      },
      {
        "paragraph": "As soon as he was done speaking, his eyes were fixed on Catherine. The glint in the depths of his eyes\nsaid it all."
      },
      {
        "paragraph": "Hannah’s pretty face turned ghastly. Everyone had seen her holding Shaun’s hand of her own accord\npreviously. She did not expect such a slap in the face from Shaun in public."
      },
      {
        "paragraph": "It was all Catherine’s doing!"
      },
      {
        "paragraph": "Hannah’s eyes flashed with deep hatred."
      },
      {
        "paragraph": "Catherine was overwhelmed with unease while a blush crept up her face."
      },
      {
        "paragraph": "She wished she could kick Shaun into the pool as he kept getting her more enemies."
      },
      {
        "paragraph": "What did she owe him?"
      },
      {
        "paragraph": "The awkward atmosphere lasted until the cake- cutting session."
      },
      {
        "paragraph": "Originally, Hannah planned to ask Shaun to cut the cake with her. At this point, she had to change her\nmind."
      }
    ]
  },
  {
    "title": "Chapter 1173 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "After the cake was cut, Hannah gave the first slice of cake to Catherine. “Madam Lyons, our family\nservant was quite thoughtless just now. Please"
      },
      {
        "paragraph": "don’t be offended.”"
      },
      {
        "paragraph": "She deliberately said ‘Madam Lyons’ loudly and used polite words, which made Catherine sound very\nold."
      },
      {
        "paragraph": "Everyone could sense it."
      },
      {
        "paragraph": "However, Catherine accepted the cake while smiling without any care. “I never took it to heart in the first\nplace. Thank you, Miss Mead. You and your friend are so polite. Your friend even called me ‘Aunty’ just\nnow.”"
      },
      {
        "paragraph": "Camilla, who was brought up all of a sudden, was stunned."
      },
      {
        "paragraph": "A trace of glee flashed across Shaun’s eyes. He raised his eyebrows and continued where Catherine left\noff. “You’re my ex-wife and we’re of the same seniority. Won’t Miss Mead and Miss Cross have to call me\n‘Uncle’ then?”"
      },
      {
        "paragraph": "Catherine looked at Shaun approvingly. He was doing a decent job of cooperating with her."
      },
      {
        "paragraph": "Shaun saw Catherine’s dark eyes sweeping across him charmingly, which was rare. He was in such a\ngood mood that he smiled with delight."
      },
      {
        "paragraph": "Hannah almost threw the cake seeing them agreeing with each other. However, she held back and\nbehaved in a spoiled manner with Shaun. “Okay then, I’ll call you ‘Uncle’ from now on. Speaking of this,"
      },

      {
        "paragraph": "aren’t there many romance dramas from Country H about younger women having sweet relationships\nwith older men?”"
      },
      {
        "paragraph": "Shaun said indifferently, “Unfortunately, I’m not a citizen of Country H.”"
      },
      {
        "paragraph": "“It’s alright. We still have plenty of time.”"
      },
      {
        "paragraph": "Some things had already been exposed, so Hannah did not bother hiding anymore."
      },
      {
        "paragraph": "She grew particularly attentive to Shaun afterward. That made many young masters throw jealous looks\nat Shaun."
      },
      {
        "paragraph": "“Uncle, let me give you a toast.” Hannah came over bringing a glass of red wine. “Thank you for joining\nmy birthday party today. This is the happiest birthday of my life.”"
      },
      {
        "paragraph": "Everyone was looking at them both."
      },
      {
        "paragraph": "It was not good for Shaun to reject her, so he clinked glasses with Hannah lightly and took a sip."
      },
      {
        "paragraph": "When he put down his glass, he saw that Catherine, who had turned around at some point, was leaving.\nHer slice of cake was left aside. It was untouched."
      },
      {
        "paragraph": "He wanted to go after her, but a bunch of Hannah’s friends stopped him. When he finally managed to\nsqueeze through those people, Catherine was already gone."
      },
      {
        "paragraph": "When Catherine returned to the banquet hall, she could not find Wesley even after looking around. She\nsaw Freya first."
      },
      {
        "paragraph": "“Are you looking for Wesley? He went to play poker with Senator Mead and a few other politicians.”"
      },
      {
        "paragraph": "Freya said with mixed feelings, “Things don’t look so simple. Look, quite a few big shots in the business\nworld are here tonight, but only Wesley is playing on the same table as Senator Mead and the"
      },
      {
        "paragraph": "politicians.”"
      },
      {
        "paragraph": "“Mm,” Catherine replied to Freya half-heartedly. “What are you thinking about? ” Freya gave her a\nsidelong glance. She chuckled and said, “Are you jealous of Shaun and Hannah?”"
      },
      {
        "paragraph": "“You’re crazy.”"
      },
      {
        "paragraph": "Catherine scolded Freya. She admitted that she was indeed a bit angry when she saw Shaun being\npestered by Hannah just now. However, that had nothing to do with her being jealous at all. “ I just don’t\nwant Hannah to be the stepmother of my children.”"
      },
      {
        "paragraph": "“Sarah can’t be their stepmother. Hannah is no good either. Then who do you want their stepmother to\nbe?” Freya said while laughing."
      },
      {
        "paragraph": "“I think Hannah is quite cunning. She’s not a kind person despite her young age. She even wanted to\nhave a servant push me into the pool to teach me a lesson. Luckily, I had my guard up,” Catherine said\nangrily."
      },
      {
        "paragraph": "Freya’s expression changed. “Such arrogance! You’re my friend, which means she’s disrespecting me.\nI’ll have a chat with her mother…”"
      },
      {
        "paragraph": "“Forget it.” Catherine stopped her. “In the end, I’m just your friend. The Mead family and the Snow family\nare business partners. No one wants any conflicts to occur at this moment.”"
      },
      {
        "paragraph": "“This kind of woman can’t be Suzie and Lucas’"
      },
      {
        "paragraph": "stepmother.” Freya wholeheartedly agreed too. “So you must keep a close eye on Shaun. Don’t let him\nbe snatched away by Hannah.”"
      },
      {
        "paragraph": "Strangely, Catherine felt exhausted."
      }
    ]
  },
  {
    "title": "Chapter 1174 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "In the garden."
      },
      {
        "paragraph": "Shaun finally found the opportunity to escape while Hannah was being held back by other people."
      },
      {
        "paragraph": "However, after a while, he felt his body growing very hot. Something was not right."
      },
      {
        "paragraph": "He had not eaten any contaminated food. He quickly understood that the glass of wine must have been\nspiked."
      },
      {
        "paragraph": "It must have been Hannah who did it. She was so shameless despite her young age."
      },
      {
        "paragraph": "Shaun quickly strode toward the entrance of the villa. However, before he could go near the door, he saw\ntwo of Hannah’s friends guarding the door. If he went over at that time, he would surely be blocked."
      },
      {
        "paragraph": "Damn it!"
      },
      {
        "paragraph": "As his body got hotter and hotter, someone tapped him on the back all of a sudden."
      },
      {
        "paragraph": "Shaun looked back. Ryan was standing behind him and looking at him in astonishment. “Brother Shaun,\nwhat’s wrong with you? Your face is very red.”"
      },
      {
        "paragraph": "“My wine was spiked.” Shaun smiled bitterly."
      },
      {
        "paragraph": "Ryan was dumbfounded. “It can’t possibly be… Hannah who did it, right?”"
      },
      {
        "paragraph": "“Mm, it was her. ” Shaun’s breathing grew heavy. He was feeling very uncomfortable. “I reckon Hannah is\nlooking for me all over the place now.”"
      },
      {
        "paragraph": "“Follow me.” Ryan brought Shaun to a guest room on the second floor right away. “The Mead family is\nletting me rest here tonight. You can head over to the bathroom.”"
      },

      {
        "paragraph": "“Thanks.” Shaun could no longer care about anything else. It was as if his whole body was being bitten\nby ants."
      },
      {
        "paragraph": "He rushed into the bathroom and used cold water to wash his face. However, it could not suppress the\nheat in his body at all."
      },
      {
        "paragraph": "Ryan stood outside. After glancing at the bathroom door for a moment, he gave Freya a call."
      },
      {
        "paragraph": "Downstairs."
      },
      {
        "paragraph": "After receiving Ryan’s call, Freya said to Catherine, “Ryan told me to bring you up. He must be looking\nfor you to talk about Wesley.”"
      },
      {
        "paragraph": "“Okay.” When Catherine was going upstairs, she saw Hannah coming in from the outside. She was\nfrantically looking around. It was unknown what she was looking for."
      },
      {
        "paragraph": "Catherine’s heart pounded. Could Hannah be looking for Shaun?"
      },
      {
        "paragraph": "“Cathy, hurry.” Freya urged."
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "Catherine followed Freya upstairs."
      },
      {
        "paragraph": "The Mead family’s villa was huge. There were more than ten rooms on just the second floor."
      },
      {
        "paragraph": "She and Freya went into the room that was at the innermost corner. After they went in, Ryan came over\nand closed the door."
      },
      {
        "paragraph": "“What’s wrong? You’re being so secretive.” Freya smiled and said, “Go ahead. Did Wesley look for you to\ntalk about anything tonight?”"
      },
      {
        "paragraph": "Ryan smiled embarrassedly. “I didn’t ask both of you to come up to talk about this. Miss Jones, please\nfollow me.”"
      },
      {
        "paragraph": "Catherine walked with him to the bathroom door."
      },
      {
        "paragraph": "Though they were separated by a door, she could vaguely hear a man’s heavy pants coming from inside.\nThat familiar voice made her blush."
      },
      {
        "paragraph": "After she realized what was happening, she turned around and wanted to leave. Ryan blocked her way. “\nMiss Jones, I have no choice either. Hannah set him up. She’s looking all over the place for him now. If\nshe finds him, Hannah will surely…”"
      },
      {
        "paragraph": "He hesitated as he spoke. However, his awkward expression told it all."
      },
      {
        "paragraph": "Freya was dumbfounded too. She stammered, “F*ck, it can’t possibly be… Shaun who’s inside, right…”"
      },
      {
        "paragraph": "Ryan nodded helplessly."
      },
      {
        "paragraph": "Catherine said angrily, “Just let him take a cold shower. Why did you ask me here? He and I are already\ndivorced. Moreover, if Hannah comes in, you can just block her. Why must it be me?”"
      }
    ]
  },
  {
    "title": "Chapter 1175 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“If I intervene in this matter, it’ll be very awkward for the Mead and Snow families if this gets out of hand.\nBrother Shaun will be put in an awkward spot too.”"
      },
      {
        "paragraph": "Ryan was in a dilemma. He explained, “You don’t understand. There are so many people here tonight.\nSince Hannah dares to do this, she must’ve gotten her parents’ permission. She’s their only daughter.\nThe Mead family dotes on her a lot. My dad and the Mead family are on the same boat now. There can’t\nbe conflicts between us.”"
      },
      {
        "paragraph": "Catherine’s scalp tingled. She was still slightly angry. “Who let him attend the party in the first place? It’s\nnone of my f*cking business. Just let Hannah give him relief. Maybe he can even play up to the Mead\nfamily.”"
      },
      {
        "paragraph": "In the end, Shaun was the one who got into this trouble himself. Why must she be the one to handle it?"
      },
      {
        "paragraph": "The bathroom door abruptly opened."
      },
      {
        "paragraph": "Shaun had already taken off his outerwear. He just had a shirt on him, and the buttons were all open,\nexposing a large area of his muscular chest. Water droplets were all over his flushed face. It was as if\nflames were burning in his eyes."
      },
      {
        "paragraph": "“I’m not here to play up to the Mead family.”"
      },
      {
        "paragraph": "Shaun fought back the agony, which felt as if bugs were biting his body. He gazed at Catherine deeply.\n“Yesterday, you were the one who said… you’ll be coming today. That’s why I came.”"
      },
      {
        "paragraph": "Catherine was taken aback."
      },

      {
        "paragraph": "She recalled him asking her if she was free today the day before yesterday. She said that she had to\nattend Senator Mead’s daughter’s party."
      },
      {
        "paragraph": "He came here because of her?"
      },
      {
        "paragraph": "While she was in a daze, Shaun closed the door again. He leaned back on the door. His distressed,\nhoarse voice could be heard. It made the two women blush with their hearts pounding."
      },
      {
        "paragraph": "Freya felt like she could not continue listening anymore. She even wanted to clean her ears. “Er… Cathy,\nwhy don’t you go in and help him out?”"
      },
      {
        "paragraph": "Catherine glared at Freya in embarrassment. Did Freya know what help she would be giving if she went\nin?"
      },
      {
        "paragraph": "“That’s right, ” Ryan said hurriedly, “If Hannah comes looking for him here, she’ll surely realize he’s inside\nif she hears his voice. At that time, she’ll definitely want to provide him relief. Men are capable of doing\nirrational things when they lose control. There are many guests here tonight too. Hannah will surely force\nShaun to take responsibility.”"
      },
      {
        "paragraph": "Freya cleared her throat. “You don’t want Hannah to be Suzie and Lucas’ stepmother, right?”"
      },
      {
        "paragraph": "Catherine did not want that, but asking her to do it with Shaun…"
      },
      {
        "paragraph": "Furthermore, Wesley was just downstairs. She could not bring herself to do such a thing."
      },
      {
        "paragraph": "Her brain was in a mess like mush."
      },
      {
        "paragraph": "Bang! Bang!"
      },
      {
        "paragraph": "Suddenly, there was the sound of someone knocking on the door from outside. Hannah’s voice could be\nheard. “Ryan, are you inside?”"
      },
      {
        "paragraph": "Catherine and the others’ expressions changed. Ryan gritted his teeth. He could not think too much\nabout it anymore. He opened the bathroom door and pushed Catherine inside."
      },
      {
        "paragraph": "Freya was startled. “You…”"
      },
      {
        "paragraph": "“If she’s unwilling, she can still come out. Let’s talk again after we dodge this oncoming problem.” Ryan\ntouched his nose helplessly."
      },
      {
        "paragraph": "Freya was speechless. Nevertheless, after Catherine went in, the panting sounds did get softer. Tsk,\ncould it be that those two were already… Ahem."
      },
      {
        "paragraph": "Seeing that Ryan was going to open the door, Freya ran over to the sofa and sat down. She acted like\nshe was eating fruits and watching television."
      },
      {
        "paragraph": "The door opened. Hannah immediately walked in. When she saw that only Freya was there, she could\nnot help but feel that it was weird. She said, “Ryan, what were you doing inside here with your godsister?\nYou even locked the door.”"
      },
      {
        "paragraph": "Those ambiguous words almost made Freya choke on a mango."
      },
      {
        "paragraph": "“ Sis, be careful.” Ryan nervously poured a glass of water for Freya in a hurry. Then, he patted Freya’s\nback gently."
      },
      {
        "paragraph": "Hannah watched that scene with a profound gaze. “ Have I… interrupted something?”"
      },
      {
        "paragraph": "“No… ” Freya could not resist retorting furiously, but Ryan beat her to it and said, “My sister isn’t feeling\ntoo well. My mom asked me to accompany her here. Hannah, why are you up here and not downstairs\nenjoying your birthday party?”"
      }
    ]
  },



  {
    "title": "Chapter 1176 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“I’m looking for someone.”"
      },
      {
        "paragraph": "Hannah said without concealing anything, “Have you seen Shaun?”"
      },
      {
        "paragraph": "Freya said calmly, “Hasn’t Shaun been with you all along? You kept holding onto him so tightly. How\ncould we have seen him?”"
      },
      {
        "paragraph": "Hannah pouted. “He was gone in a blink of an eye. ”"
      },
      {
        "paragraph": "Ryan flashed a vague smile. “Looks like Shaun doesn’t like you that much. It’s no use forcing something\nif it isn’t meant to be. There are so many guys outside who like you. Why must you insist on a man who’s\na lot older than you?”"
      },
      {
        "paragraph": "“He’s not a lot older than me. Isn’t it just a difference of ten years?” Hannah hmphed. “ Anyway, I must\nhave him.”"
      },
      {
        "paragraph": "“Fine, I’m too lazy to care about you. Anyway, I didn’t see him.”"
      },
      {
        "paragraph": "Ryan waved his hand and asked her to leave."
      },
      {
        "paragraph": "Hannah was in a hurry to look for Shaun and did not have much time to chat with Ryan. She turned\naround and went elsewhere to look for Shaun."
      },
      {
        "paragraph": "When the door closed again, Freya let out a huge breath of relief."
      },
      {
        "paragraph": "Luckily, Hannah did not suspect anything. If she had checked the bathroom only to find Catherine and\nShaun inside, it would have been troublesome."
      },
      {
        "paragraph": "However, why were there no movements from those two people?"
      },

      {
        "paragraph": "She tiptoed to the bathroom door to eavesdrop, but she was pulled back by Ryan. “Sis, can you not\ndisturb them?”"
      },
      {
        "paragraph": "“Hannah has already left. I have to call Catherine out, ” Freya said."
      },
      {
        "paragraph": "“Forget it. She’ll come out if she wants to.” Ryan gave Freya an eye signal. “If she doesn’t come out,\nwe’ll cover up for them.”"
      },
      {
        "paragraph": "When Freya thought about Shaun and Catherine burning with desire inside while she and Ryan stood\nguard outside, she suddenly felt embarrassed."
      },
      {
        "paragraph": "Ryan gazed at Freya’s adorable look with her blushed cheeks. He could not help but feel an itch in his\nheart."
      },
      {
        "paragraph": "She was older than him by a few years, but her skin was still rosy like a young girl’s."
      },
      {
        "paragraph": "Too bad. Unfortunately, she had become his sister in name."
      },
      {
        "paragraph": "No wonder the Snow family said that Rodney did not know how to cherish her."
      },
      {
        "paragraph": "In the bathroom."
      },
      {
        "paragraph": "After Catherine was pushed inside, a wet yet hot body immediately hugged her tightly."
      },
      {
        "paragraph": "“Cathy… Cathy, I feel so uncomfortable. Help me,” Shaun murmured pleadingly in her ear. He had a\nlovely voice to begin with, so his low and raspy"
      },
      {
        "paragraph": "voice at that moment could make one’s heart melt."
      },
      {
        "paragraph": "Catherine, who was wrestling him, suddenly became flustered."
      },
      {
        "paragraph": "Shaun’s kiss fell on her lips with a trace of ferociousness."
      },
      {
        "paragraph": "Before she could resist, she heard Hannah’s voice coming from the outside."
      },
      {
        "paragraph": "She was startled to the point her heart tightened up. She could only do her best to calm the man in front\nof her. She used her hand and patted the back of his neck lightly."
      },
      {
        "paragraph": "Shaun was like a dog. He became a lot more docile after that."
      },
      {
        "paragraph": "However, the hot kisses did not stop."
      },
      {
        "paragraph": "Catherine’s brain was blank from his kisses. She did not even notice when Hannah left."
      },
      {
        "paragraph": "After who knew how long, Shaun cupped her petite face. His eyes were bloodshot. “Cathy, I don’t even\nlike Hannah at all. If she wasn’t forcing me, I wouldn’t even show her a single bit of respect.”"
      },
      {
        "paragraph": "“Force you?” Catherine was confused. “Yes.” Shaun clenched his jaw. His tone was laced with deep\nhatred when he said, “If I don’t show her enough respect, she’ll mess with Hill Corporation. ”"
      }
    ]
  },
  {
    "title": "Chapter 1177 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine took pleasure in his misfortune. She mocked, “I never thought that there would be a day when\nYoung Master Hill would be forced by a woman. It looks like you’re quite miserable these days. Why\ndon’t… you just promise yourself to her? Hannah has a reputable status. When her dad becomes the\ndeputy— ”"
      },
      {
        "paragraph": "Before she could finish her sentence, Shaun blocked her mouth again. Her butt was spanked hard by\nhim too."
      },
      {
        "paragraph": "Catherine’s face flushed red from embarrassment. Her gaze looked as if she wanted to gobble him up. “\nShaun, how dare you hit me?”"
      },
      {
        "paragraph": "“Cathy, some words can’t be said even as a joke. The one I love is only you. I don’t even care if Hannah\nmakes me lose all my wealth.”"
      },
      {
        "paragraph": "Shaun buried his head beside her ear. He confessed to her in a low, hoarse voice, “We’ve experienced\ntoo many things between us. I understand now that power and money are just fleeting things. You’re the\nonly one who’s worth treasuring.”"
      },
      {
        "paragraph": "Catherine’s whole body tingled from his hoarse voice and hot breath. She could not help but say\nfrustratedly, “Unfortunately, you realized it too late. You’ve already lost me.”"
      },
      {
        "paragraph": "“It’s not late.” Shaun rubbed her with his head. “If you really don’t care about me at all, you wouldn’t have\ncome in just now. With me in this state, you’re obviously walking right into a trap.”"
      },
      {
        "paragraph": "Catherine pushed him embarrassedly. “I was pushed in here by Ryan.”"
      },
      {
        "paragraph": "“ I don’t care. You’re my cure now. ” Shaun raised his head in agony."
      },

      {
        "paragraph": "Catherine saw his handsome face flushing red. He looked so uncomfortable that he was about to\nexplode. She suddenly started becoming flustered."
      },
      {
        "paragraph": "“Cathy, don’t go. If you leave, I’ll die.” As Shaun spoke, he grabbed her hand and put it on his body."
      },
      {
        "paragraph": "Catherine was dumbfounded. Shaun had been set up by Hannah, but that part of his was not reacting a t\nall."
      },
      {
        "paragraph": "She suddenly pitied him a lot."
      },
      {
        "paragraph": "Shaun smiled bitterly as he gazed at her. “Cathy, I feel so uncomfortable but I don’t know what I should\ndo.”"
      },
      {
        "paragraph": "Catherine panicked as well. It was her first time experiencing such a problem. However, she knew that if\nthis went on, something would surely happen to Shaun. “Why not… Let’s go to the hospital.”"
      },
      {
        "paragraph": "“No, Cathy. I’m a man. I want my pride too. If you send me out in this state, tell me… How can I still lift\nmy head high in the future?” Shaun smiled bitterly. “I’d rather just die.”"
      },
      {
        "paragraph": "Catherine was shocked."
      },
      {
        "paragraph": "She did not expect there would come a day when Shaun would say lines that only women would say."
      },
      {
        "paragraph": "However, she could understand him. Although he was in dire straits now, he still had his pride."
      },
      {
        "paragraph": "“Cathy, I feel so hot. It’s agonizing.” Shaun mentally broke down and hugged Catherine. There was\nclearly a woman in his arms, but he still could not relieve the effects of the drug."
      },
      {
        "paragraph": "“Shaun, calm down. I’ll think of a way. ” Catherine was also telling this to herself to stay calm."
      },
      {
        "paragraph": "She slowly stretched her hand and cupped his handsome face. She went on tiptoes and got closer to his\nlips…"
      },
      {
        "paragraph": "Outside the bathroom."
      },
      {
        "paragraph": "Although the volume of the television was already very loud, Freya and Rodney could still hear Shaun’s\nsensual voice."
      },
      {
        "paragraph": "They made eye contact with each other. Both of them were blushing."
      },
      {
        "paragraph": "Freya could not tolerate it anymore. When she took the remote again and wanted to turn up the volume,\nRyan stopped her. “Don’t turn it up too high. It’ll arouse suspicions.”"
      },
      {
        "paragraph": "“But…” Freya was embarrassed."
      },
      {
        "paragraph": "“I’ll go out first, ” Ryan said, “If someone asks, I’ll say that you’re resting upstairs.”"
      }
    ]
  },
  {
    "title": "Chapter 1178 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“You should let me go out instead,” Freya said in a low voice, “I feel very awkward staying in here.”"
      },
      {
        "paragraph": "“You’re pregnant. My mom will understand if you stay up here. She can cover up for you as well. If I keep\nstaying upstairs, other people will come in to visit me.” Ryan gave her an encouraging gaze.“ Good luck.\nYou’ve experienced it before. I’m different. I’m still an innocent boy.”"
      },
      {
        "paragraph": "Freya cleared her throat heavily."
      },
      {
        "paragraph": "Ryan smiled. He turned around and went out."
      },
      {
        "paragraph": "Freya was on the verge of crying. She continued her battle inside the room."
      },
      {
        "paragraph": "Downstairs, Hannah had nearly searched the whole building but she could not spot Shaun at all."
      },
      {
        "paragraph": "She was infuriated."
      },
      {
        "paragraph": "The drug Shaun took must have taken effect by now. Where could he have run off to in that state?"
      },
      {
        "paragraph": "If he really could not control it and found another woman to relieve himself, Hannah would spit out a\nmouthful of blood."
      },
      {
        "paragraph": "“By the way, have you all seen Catherine?” she suddenly said."
      },
      {
        "paragraph": "“Ah, now that you mention it, I think I haven’t seen her,” Camilla said, “Shaun couldn’t have possibly\nlooked for her—”"
      },
      {
        "paragraph": "“Shut up!” Hannah glared at Camilla viciously. “ If Catherine dares to be so shameless, I’ll make her face\nthe consequences. Find Catherine for me at once. I already have people guarding the door."
      },
      {
        "paragraph": "Shaun must still be in here.”"
      },

      {
        "paragraph": "“Hannah, when we searched Ryan’s room, Freya was there too. Freya and Catherine are good friends,\nwhile the Snow and Hill families are on good terms too. Could Ryan and Freya be covering up for\nCatherine and Shaun?” Camilla reminded Hannah."
      },
      {
        "paragraph": "A thought flashed across Hannah’s mind. Camilla had a point there."
      },
      {
        "paragraph": "“Let’s go up and have a look again. ” Hannah ran upstairs in a hurry."
      },
      {
        "paragraph": "This time, she did not knock on the door and simply pushed it open."
      },
      {
        "paragraph": "On the sofa in the room, Catherine and Freya were having a pleasant chat while having fruits. When\nHannah suddenly barged in, Freya was so startled that she patted her chest. “Ah, Miss Mead, what are\nyou doing? Although this is your house, you can’t just come in without knocking first.”"
      },
      {
        "paragraph": "“Why is Madam Lyons here too?” Hannah stared at Catherine carefully. She saw Catherine resting an\nelbow on the sofa while supporting her head with her small hand. Catherine’s relaxed and beautiful\nappearance made Hannah jealous."
      },
      {
        "paragraph": "She was clearly younger than Catherine by a few years, but she could not compare to Catherine’s\nstunning beauty at all. Plus, Catherine’s fair skin complemented her black dress. The contrast of black\nand white accentuated her beauty to the maximum."
      },
      {
        "paragraph": "“Freya and I are good friends. Is it weird for us to be chatting here?” Catherine raised her eyebrows and\nrefuted while smiling faintly."
      },
      {
        "paragraph": "“It’s not weird. Sorry to intrude,” Hannah said as she walked inside. “Ah, I suddenly want to use the\nbathroom.”"
      },
      {
        "paragraph": "She did not wait for Catherine and Freya’s reply. She quickly pushed the bathroom door open. There was\nno one inside. Apart from the faint fragrance of women’s perfume in the air, it was also very wet inside."
      },
      {
        "paragraph": "Hannah looked at the showerhead. It was obvious that someone had used the showerhead just now.\nShaun had most likely hidden here and even took a cold shower."
      },
      {
        "paragraph": "When she thought of Catherine, who was sitting outside, her body trembled in anger."
      },
      {
        "paragraph": "She rushed out with a cold expression. Her gaze looked as if she wanted to rip Catherine apart. “ Were\nyou and Shaun hiding inside there just now?”"
      },
      {
        "paragraph": "“I don’t know what you’re talking about, ” Catherine replied calmly without any signs of fluster. “I just\ncame up.”"
      },
      {
        "paragraph": "“Stop acting. Catherine Jones, how can you be so shameless? You’re already married, yet you still hid in\nthe bathroom and made out with Shaun. I’ve never seen such a cheap woman like you! ” Hannah flew\ninto a fury and started scolding Catherine."
      }
    ]
  },
  {
    "title": "Chapter 1179 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "The expression on Catherine’s pretty face gradually became cold. “Miss Mead, I understand that you like\nShaun. Even so, he’s indifferent toward you. You can’t forcibly push the blame on me. Please mind your\nmanners.”"
      },
      {
        "paragraph": "“What right does a shameless woman like you have to educate me?” Hannah scolded."
      },
      {
        "paragraph": "“We don’t have the right, but I can look for your mom or your dad, ” Freya said furiously, “We’ll let them\neducate their daughter properly.”"
      },
      {
        "paragraph": "Hannah snorted. “Freya Lynch, do you insist on going against me? Let me remind you of this."
      },
      {
        "paragraph": "Frankly speaking, you’re just Uncle Nathan’s goddaughter. You’re not even his biological daughter. Why\nare you showing off? Everyone knows that the Snow family took you in as their goddaughter simply out\nof pity because no one wanted to take responsibility after Rodney had sex with you.”"
      },
      {
        "paragraph": "Freya’s face went pale."
      },
      {
        "paragraph": "“Shut your mouth!” Senator Mead’s roar came"
      },
      {
        "paragraph": "from behind all of a sudden."
      },
      {
        "paragraph": "Hannah was startled. She turned back and saw her parents, Heidi, and Ryan standing behind her."
      },
      {
        "paragraph": "Heidi had an angry expression. “Gavin, is this how you educate your daughter? The Snow family just\nheld a banquet to acknowledge Freya as our family. I t was also meant to prove Freya’s status in the\nSnow family to the outside world. That’s right, she may not be our biological daughter, but everyone in\nthe Snow family treats her like family. It turns out that you, the Mead family, actually look down on m y\ndaughter like this.”"
      },

      {
        "paragraph": "“Madam Snow, that’s not true, ” Senator Mead quickly explained in a low voice, “This is a\nmisunderstanding.”"
      },
      {
        "paragraph": "“Misunderstanding?” Ryan said coldly, “Uncle Gavin, we heard it with our own ears. My sister and I came\nto celebrate your daughter’s birthday with kind intentions, yet she was humiliated. This is too much. We\ndon’t think we’ll dare to come to the Mead family’s house in the future.”"
      },
      {
        "paragraph": "Senator Mead got mad at Hannah. “You’d better quickly apologize to Miss Lynch and Miss Jones.”"
      },
      {
        "paragraph": "Hannah was aggrieved. “Dad, you don’t know— ” Slap!"
      },
      {
        "paragraph": "A resounding slap landed on Hannah’s face. Senator Mead pointed at her exasperatedly. “I’ve spoiled\nyou too much that you’ve become so insolent.”"
      },
      {
        "paragraph": "Hannah was stunned. She cried out in disbelief, “ Dad, I didn’t do it on purpose. It was this woman,\nCatherine. She hid in the bathroom and had an affair with Shaun. Freya covered up for them. I got too\nannoyed.”"
      },
      {
        "paragraph": "“You’re simply accusing me by shooting your mouth off, Miss Mead, ” Catherine said coldly, “Do you have\nevidence for what you just said?”"
      },
      {
        "paragraph": "“Of course I do. There’s water everywhere in the bathroom.”"
      },
      {
        "paragraph": "Catherine snorted upon hearing those words. Ryan touched his nose and said, “I accidentally missed m\ny aim when I was using the bathroom before, so I washed it away using the showerhead.”"
      },
      {
        "paragraph": "“You’re talking nonsense. You’re just trying to cover up for her… ” Hannah received a death stare from\nSenator Mead before she could finish speaking."
      },
      {
        "paragraph": "“Stop talking and just shut up.”"
      },
      {
        "paragraph": "Senator Mead desperately wanted to slap his daughter to death. However, he could only hold it in and\napologize at that moment. “Miss Jones, my"
      },
      {
        "paragraph": "daughter didn’t know any better and misunderstood you. I apologize to you on her behalf.”"
      },
      {
        "paragraph": "Catherine indifferently made a snide comment, “ There’s no need to apologize. It’s just that I won’t dare\nto come to the Mead family’s house anymore. I have to take the blame for something I didn’t even do. I\nwas sitting in the hall when a servant came over and said Freya was looking for me. When I went over,\nthe maid wanted to push me into the pool. Luckily, I had quick reflexes and avoided her. However, the\nservant climbed back up and said I was the one who pushed her.”"
      },
      {
        "paragraph": "Freya was taken aback. “ I wasn’t looking for you! ” “That’s right. You weren’t looking for me, yet the\nservant said you were. I interrogated her, but the servant refused to admit it. I didn’t dare to go elsewhere\nbecause of that incident, so I had no choice but to chat with you in the room. Not long after, Miss Mead\nran in and said Shaun and I were having an affair.”"
      }
    ]
  },
  {
    "title": "Chapter 1180 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine said expressionlessly, “Miss Mead, you have a special status, so you can just say whatever\nyou want. However, have you ever considered that I’m a married woman? If rumors spread and\neveryone simply believes them, my reputation will be utterly ruined because of you.”"
      },
      {
        "paragraph": "Senator Mead did not expect Catherine to be so unforgiving. Nevertheless, Heidi was at the side. He\ncould only keep apologizing. “I didn’t expect that you’ve been wronged so badly. I’ll definitely have m y\ndaughter give you an apology. I’ll immediately fire that servant too. Not a word about today’s incident will\ngo out.”"
      },
      {
        "paragraph": "“Dad…” Hannah’s tears of resentment flowed."
      },
      {
        "paragraph": "“Hannah, apologize. If you don’t apologize today, you’re no longer my daughter, ” Senator Mead warned\nsternly."
      },
      {
        "paragraph": "Hannah gritted her teeth. She had no choice but to hold back her hatred and say to Catherine and Freya,\n“I’m sorry.”"
      },
      {
        "paragraph": "“Are you a mosquito? I can’t hear you at all.” Freya dug her ears."
      },
      {
        "paragraph": "“I said I’m sorry.” Hannah pushed away the people around her and ran after saying that loudly."
      },
      {
        "paragraph": "Senator Mead asked with a dark expression, “Miss Jones, are you satisfied with this?”"
      },
      {
        "paragraph": "“Actually, I don’t harbor any dissatisfaction. I just think that Miss Mead is still too young. If you keep\nletting her have her way, she may bring trouble to you in the future, Senator Mead. I hope you can\nunderstand my sincere intentions, ” Catherine said humbly."
      },

      {
        "paragraph": "“Thank you for that. ” Those were the words that came out from Senator Mead’s mouth, but he had the\nurge to rip Catherine apart in his heart."
      },
      {
        "paragraph": "Heidi sighed. She said, “You should go and console Hannah. After all, it’s her birthday. We should be\nleaving too. It’s quite late.”"
      },
      {
        "paragraph": "“I’ll see you all off.”"
      },
      {
        "paragraph": "Senator Mead saw them off at the door while forcing a smile. Wesley quickly rushed over after receiving\nSenator Mead’s message."
      },
      {
        "paragraph": "He had been playing poker with a few other politicians. Suddenly, he received Senator Mead’s message\nasking him to take Catherine and leave"
      },
      {
        "paragraph": "first. Although Senator Mead said it was due to the late hour, Wesley understood that he was being\nasked to leave."
      },
      {
        "paragraph": "He did not know what Catherine had done that made him be ‘asked’ to leave the villa so early by Senator\nMead."
      },
      {
        "paragraph": "Fury raged in Wesley’s stomach. However, he held i t back when he saw that Heidi was present."
      },
      {
        "paragraph": "After Heidi got into the car, she beckoned toward Catherine with her finger."
      },
      {
        "paragraph": "“Madam Snow, thank you so much for tonight,” Catherine said in a low voice with gratitude."
      },
      {
        "paragraph": "“You were bold today. Even my husband doesn’t usually dare to verbally attack Gavin that way."
      },
      {
        "paragraph": "You’re probably the first one who dares to speak that way.”"
      },
      {
        "paragraph": "Heidi looked at Catherine with an approving gaze.“ But you’re terrible at holding back. After tonight,\nGavin will surely hate you.”"
      },
      {
        "paragraph": "Catherine smiled. “If I must curry favor with a politician, I’d rather curry favor with the Snow family. I know\nmany people want to suck up to Senator Mead, but I can’t go against my principles just to flatter\nsomeone else. Some people are destined to go on different paths."
      },
      {
        "paragraph": "“Moreover, I don’t lack anything. I already have a lot more than many other people. I’m not that greedy.\nActually, ten million dollars or 1oo billion dollars won’t affect my life in any way. It’s just the difference in\nthe numbers in my bank account anyway.”"
      }
    ]
  },
  {
    "title": "Chapter 1181 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Heidi laughed. “You’re right. Unfortunately, many people can’t figure out this logic. Don’t worry, in\nconsideration of your dad and Freya’s relationship with the Snow family, we’ll protect you even if Senator\nMead wants to target you.”"
      },
      {
        "paragraph": "“Thank you.” Catherine thanked her sincerely again."
      },
      {
        "paragraph": "After the car left, she went back to Wesley’s car."
      },
      {
        "paragraph": "Wesley looked at Catherine. “Cathy, what did Madam Snow say to you?”"
      },
      {
        "paragraph": "Catherine sighed calmly. “She just told me off.”"
      },
      {
        "paragraph": "Wesley’s expression finally changed slightly. “What exactly happened tonight? The party hasn’t ended\nyet. Why did Senator Mead ask us to leave first?”"
      },
      {
        "paragraph": "“Maybe because I’m Shaun’s ex-wife, so Hannah takes me as an imaginary enemy. She kept messing\nwith me. We accidentally had a conflict,” Catherine said with a bitter expression, “I’m sorry that I caused\nyou trouble.”"
      },
      {
        "paragraph": "Wesley clenched his fists in secret. She had no clue how much effort he had put in to please Senator\nMead. He was almost able to join their social circle, yet it was so easily ruined because of her."
      },
      {
        "paragraph": "He could only endure it and not say a word. He was afraid that he would not be able to control his\nemotions once he opened his mouth."
      },
      {
        "paragraph": "The car was eerily quiet, and it made Catherine nervous. “Wesley, I know you want to please the Mead\nfamily, but Senator Mead isn’t a good person"
      },

      {
        "paragraph": "How good could Senator Mead’s character be considering how he had raised Hannah and was such a\npetty person himself?"
      },
      {
        "paragraph": "“Cathy, you don’t understand, ” Wesley interrupted her, “Not every person with a position like that will be\nsimple and kind. Forget it. You don’t understand. I’ll apologize to Senator Mead properly another time.\nSince you don’t like the Mead family, you don’t have to attend such banquets or parties in the future.”"
      },
      {
        "paragraph": "He turned his head away and looked out the window."
      },
      {
        "paragraph": "However, Catherine could sense that he was furious. He was just holding it in."
      },
      {
        "paragraph": "Her feelings were complicated too."
      },
      {
        "paragraph": "The neon lights outside the window flashed by. Catherine slowly went into a daze."
      },
      {
        "paragraph": "The scene in the bathroom just now flashed across her mind."
      },
      {
        "paragraph": "Shaun’s hot kisses, her taking the initiative and circling him."
      },
      {
        "paragraph": "All of it was so embarrassing that it made her face blush and her heart pound."
      },
      {
        "paragraph": "Luckily, she had expected that Hannah would start looking for her after failing to find Shaun."
      },
      {
        "paragraph": "Therefore, she quickly dealt with Shaun. After he felt slightly better, he climbed out of the window of the\nbathroom."
      },
      {
        "paragraph": "The incidents tonight had almost made her heart stop and break out in a cold sweat. Luckily, she\nsuccessfully made it through the night."
      },
      {
        "paragraph": "However, she could not help but feel lost when she thought about what she had done for Shaun."
      },
      {
        "paragraph": "Maybe she was really used to Shaun’s body. Although they were divorced, she was not disgusted no\nmatter how intimate she was with Shaun. When Wesley touched her, she would feel like puking."
      },
      {
        "paragraph": "That was the first time she felt lost regarding her current marriage."
      },
      {
        "paragraph": "Regardless of whether Wesley was the murderer who killed Ethan or not, she could not continue living\nwith him anymore."
      },
      {
        "paragraph": "She had to find a time to talk about their divorce."
      },
      {
        "paragraph": "Upon arriving at the villa after a quiet ride, Wesley immediately went to the study. After Catherine went\nupstairs, the first thing she did was brush her teeth."
      },
      {
        "paragraph": "As she was brushing her teeth, some embarrassing scenes flashed through her mind. Looking at her\nexcessively red lips in the mirror, her face became flushed."
      },
      {
        "paragraph": "She lowered her head and quickly brushed her teeth clean. She even wanted to eliminate all of that\nperson’s scent."
      },
      {
        "paragraph": "As she was thinking about it, Shaun gave her a call. She was so startled that she instinctively ended it."
      },
      {
        "paragraph": "Then, she received a message. Shaun: [I’ve arrived home. Thank you, babe. I never thought you\nwould… help me that way tonight. I love you.]"
      },
      {
        "paragraph": "Catherine tossed her phone aside with a blushing face. She aggressively washed her face with cold\nwater, trying to extinguish the heat."
      },
      {
        "paragraph": "However, a moment later, Shaun sent another message. [Why aren’t you replying? You can’t possibly be\nfeeling… shy, right?]"
      }
    ]
  },


  {
    "title": "Chapter 1182 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine could no longer tolerate him and replied: [Get lost.]"
      },
      {
        "paragraph": "Shaun: [I won’t get lost. I’ll never get lost in this lifetime. You saved me again. You’re my savior. I’m\nunable to repay your kindness, so I can only present myself to you.]"
      },
      {
        "paragraph": "“Shameless!”"
      },
      {
        "paragraph": "After Catherine scolded Shaun, the sound of her heartbeat was like a drumroll."
      },
      {
        "paragraph": "At that moment, the door to the bedroom was opened all of a sudden. Catherine frowned when she saw\nWesley walking in with big strides. It seemed like she had to lock the door in the future."
      },
      {
        "paragraph": "“Cathy, I called Senator Mead just now to apologize to him. He said… to contact him less in the future.”"
      },
      {
        "paragraph": "The expression on Wesley’s elegant, handsome face was awful. There was even uncontrollable anger in\nhis eyes. “He said you were aggressive, and you even gave him no choice but to hurt his daughter at her\nown birthday party. He doesn’t dare to offend you anymore.”"
      },
      {
        "paragraph": "Catherine felt apologetic. She had already expected that Senator Mead would be petty. Heidi was at the\nscene just now, so him making things hard for Wesley to get revenge was normal. “Wesley, it was\nHannah who kept messing with me tonight— ”"
      },
      {
        "paragraph": "“Senator Mead said you and Shaun hid in the bathroom and made out tonight. ” Wesley cut her off\nabruptly. He could no longer control the anger in his eyes."
      },
      {
        "paragraph": "Catherine’s face paled."
      },
      {
        "paragraph": "If it were other people, she could just lie. However, when she was facing Wesley, she… did not know\nhow to handle the situation."
      },

      {
        "paragraph": "Wesley saw Catherine keeping silent. The taut string in his heart finally broke."
      },
      {
        "paragraph": "He lost his rationality in an instant and yelled, “ Catherine Jones, do you think you’re treating me fairly? I\ngave you chances again and again. In the end, this is how you treat me? You act as if you’re about to die\nwhen I casually touch you. When Shaun touches you, you willingly accept him. Why are you such a sl*t?”"
      },
      {
        "paragraph": "Wesley really wanted to control himself."
      },
      {
        "paragraph": "However, Senator Mead’s anger at him and her betrayal made him lose control."
      },
      {
        "paragraph": "When he thought about her hiding and sneaking around with Shaun during a party with so many people\npresent, his heart was full of contempt."
      },
      {
        "paragraph": "Catherine looked at him with her eyes widened in shock."
      },
      {
        "paragraph": "Wesley, who was opposite her, had a ferocious expression. His usual gentleness and elegance were all\ngone. It was as if he had changed into another person."
      },
      {
        "paragraph": "She even thought she was hallucinating. Such vicious words actually came out of Wesley’s mouth."
      },
      {
        "paragraph": "However, she could understand him. Anybody else would have been upset and angry too if they were in\nthe same situation."
      },
      {
        "paragraph": "“Wesley, I’m sorry. I don’t want to lie to you. I’ve really tried to accept you, but no matter how hard I try, I\nstill can’t…”"
      },
      {
        "paragraph": "Slap!"
      },
      {
        "paragraph": "A loud slap landed on Catherine’s face."
      },
      {
        "paragraph": "The man’s strength was brutal. She fell onto the bed from his slap. Her whole face even swelled up."
      },
      {
        "paragraph": "Catherine had not regained her senses from the shock. Suddenly, Wesley charged at her like a madman\nand ripped her clothes apart with force."
      },
      {
        "paragraph": "“Since you’re such a sl*t, then I don’t have to respect you either. I must have you tonight. You’ll\naccompany me tonight the way you accompanied Shaun.”"
      },
      {
        "paragraph": "With a loud tear, Catherine’s clothes were ripped open."
      },
      {
        "paragraph": "Bruises quickly marked her skin."
      },
      {
        "paragraph": "“Wesley, let go! ” Catherine struggled with all her strength, but Wesley did not listen to her at all."
      },
      {
        "paragraph": "His appearance made Catherine feel unfamiliar and frightened. Luckily, she had good defense skills."
      },
      {
        "paragraph": "She had no choice but to lock his wrists and kick him away."
      },
      {
        "paragraph": "Wesley was kicked to the side. He lost control and came after Catherine. They started fighting in the\nroom."
      },
      {
        "paragraph": "In the middle of the fight, they knocked over a few flower vases."
      }
    ]
  },
  {
    "title": "Chapter 1183 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine did not want to continue fighting with Wesley anymore. After throwing Wesley off, she took the\nopportunity to grab her phone and quickly ran out of the villa without even changing her shoes. She got\nin the car, started it, and sped off."
      },
      {
        "paragraph": "From the rear-view mirror, she saw Wesley coming out to chase after her."
      },
      {
        "paragraph": "That scene made Catherine’s heart tremble."
      },
      {
        "paragraph": "Maybe it was because she never expected there would come a day when she and Wesley would fight."
      },
      {
        "paragraph": "Moreover, Wesley used to be such a gentle person. She had been married to Shaun for so long\npreviously, but they had never fought that way before. Her face, arms, and shoulders were in a lot of\npain."
      },
      {
        "paragraph": "Wesley’s expression just now frightened her."
      },
      {
        "paragraph": "The previous time when he wanted to force himself on her, that same expression had appeared on his\nface as well. It had been fleeting then, so she thought it was just an illusion."
      },
      {
        "paragraph": "This time, she saw it clearly."
      },
      {
        "paragraph": "Had Wesley changed because she hurt him too deeply, or had he always been like this and was just\ndisguising himself all this while?"
      },
      {
        "paragraph": "Catherine did not know anymore."
      },
      {
        "paragraph": "She was just terrified of living together with that man."
      },
      {
        "paragraph": "She did not know that Wesley smashed a lot of things in the house like a lunatic not long after she left."
      },

      {
        "paragraph": "However, after he was done with his row, his handsome face contorted as he looked at the mess on the\nfloor."
      },
      {
        "paragraph": "He had lost control. Damn it!"
      },
      {
        "paragraph": "That was not the time to have a falling out with Catherine."
      },
      {
        "paragraph": "He frantically sent a message to Catherine: [Cathy, I’m sorry. I didn’t mean to hit you. I was just too\nangry. Come back. I’m begging you. I can’t lose you."
      },
      {
        "paragraph": "Catherine only saw Wesley’s message after she arrived at the parking lot of Freya’s house."
      },
      {
        "paragraph": "She was utterly speechless."
      },
      {
        "paragraph": "It was the first time she realized Wesley was very unstable and extreme."
      },
      {
        "paragraph": "She did not reply to Wesley’s message. She really did not know how to face him."
      },
      {
        "paragraph": "After she pressed the doorbell, Freya was shocked when she saw her swollen face. “F*ck, who hit you\nuntil you became like this?”"
      },
      {
        "paragraph": "“Don’t say any more. I’ll sleep at your place for the time being. I’m afraid my dad will worry if I go to his\nplace.”"
      },
      {
        "paragraph": "Catherine threw herself onto the sofa, exhausted. She was wearing a coat as her clothes underneath\nwere torn in a few places. If she had not wrapped herself with a coat, she would have been very\nexposed."
      },
      {
        "paragraph": "She stared at the ceiling in a daze. Her eyes reddened, and she was upset."
      },
      {
        "paragraph": "She did not know why her marriage with Wesley would turn out this way. At first, she really wanted to\nmake the marriage work. However, it seemed like everything had changed after she was kidnapped to"
      },
      {
        "paragraph": "the island by Shaun."
      },
      {
        "paragraph": "After she returned, she would feel overwhelmed whenever she faced Wesley. She wanted to run away."
      },
      {
        "paragraph": "“It can’t be… Wesley who did this, right?” Freya knew Catherine had gone back home with Wesley. After\nrealizing something, Freya was infuriated. “He can’t possibly have found out about the incident regarding\nyou and Shaun in the bathroom, right?”"
      },
      {
        "paragraph": "“Senator Mead complained to him,” Catherine said in a low voice as she hugged her knees."
      },
      {
        "paragraph": "“Does he just believe in anything Senator Mead says? Senator Mead doesn’t have evidence anyway.\nDon’t you know how to lie?” Freya said in astonishment, “Could it be that you didn’t lie?”"
      },
      {
        "paragraph": "“I can’t lie about this to him, ” Catherine muttered, “Freya, he called me a slt. Actually, I think I’m quite\nsltty myself.”"
      }
    ]
  },
  {
    "title": "Chapter 1184 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Ah, don’t say that. After all, Shaun is your ex- husband. Yes, you’re married to Wesley, but you’ve never\nhad sex with him before. Maybe you’re still used to only being with Shaun. Everyone has some\nobsession with hygiene anyway,” Freya consoled her."
      },
      {
        "paragraph": "“Stop consoling me.” Catherine was at a loss."
      },
      {
        "paragraph": "She might have been forced by Shaun on the island, but tonight… she had been willing."
      },
      {
        "paragraph": "Seeing Shaun look like he was in agony, she really could not control herself. She just did it instinctively."
      },
      {
        "paragraph": "Maybe she was really bewitched by Shaun, that pr*ck, for a lifetime."
      },
      {
        "paragraph": "“Fine, I won’t console you anymore. But I think the rift between you and Wesley is permanent."
      },
      {
        "paragraph": "Although I should advise you to make up with him and not get a divorce, I’m still strongly opposed to men\nwho commit domestic violence. You can figure this out yourself.”"
      },
      {
        "paragraph": "Freya said, “I thought Wesley was a gentle person. It’s quite scary that he showed this side of himself all\nof a sudden. Furthermore… Ryan told me that Wesley kept trying to get close to him. Wesley even\nhinted that if they were to collaborate in the future, there’d be many benefits for him. Wesley is a\nbusinessman. What other benefits can he give? It’s nothing more than money.”"
      },
      {
        "paragraph": "Catherine was stunned. She had just wanted Ryan to be mindful of Eugene. She did not expect that\nRyan would discover something."
      },
      {
        "paragraph": "Wesley’s actions were not very appropriate. He was walking on the borders of the law."
      },
      {
        "paragraph": "“Anyway, Wesley isn’t a simple man. Ryan said he’s definitely very ambitious.”"
      },

      {
        "paragraph": "Catherine did not get a lot of sleep for the whole night."
      },
      {
        "paragraph": "One of the reasons was that her face hurt too much. Secondly, her mind was in a mess too."
      },
      {
        "paragraph": "The next day, she was afraid that Wesley would look for her at the company, so she did not even dare to\ngo over. She could only stay in Freya’s house and recuperate from her wounds."
      },
      {
        "paragraph": "In between, Shaun sent a few messages to her, but she did not reply to any of them."
      },
      {
        "paragraph": "She wanted to hide in a shell and lie low for another few days."
      },
      {
        "paragraph": "Unfortunately, a teacher from the preschool gave her a call on the second day. “Miss Jones, Mr. Lyons\ncame to pick up Lucas this evening. He said he’s your husband. However, it just so happens that Mr. Hill\nis here too. He said Lucas is his son. I remember you changed the name of the child’s father when you\ncame to the preschool with Mr. Hill last time. Now they’re quarreling at the preschool. Can you please\ncome over?”"
      },
      {
        "paragraph": "Catherine’s scalp tingled. “I’m sorry. I’ll come over immediately.”"
      },
      {
        "paragraph": "She hurriedly wore a mask and drove to the preschool."
      },
      {
        "paragraph": "Luckily, the preschool was nearby. She arrived in about ten minutes."
      },
      {
        "paragraph": "Fortunately, the number of parents who were here to pick up their children was not that many."
      },
      {
        "paragraph": "However, Shaun and Wesley’s tall figures still caught many people’s attention."
      },
      {
        "paragraph": "Lucas and Suzie stood by the entrance. Suzie had a helpless expression, while Lucas had an icy\nexpression."
      },
      {
        "paragraph": "“Shaun, let me warn you again. Lucas is my son. You don’t have the right to take him away,” Wesley said\nangrily."
      },
      {
        "paragraph": "“What a joke. Lucas is Cathy’s and my biological child. The name of his father in the preschool’s\ninformation book is mine. Cathy agreed to it herself, ” Shaun said coldly, “Wesley, you like to take other\npeople’s son as your own, but I’m not interested in having my son calling other people his dad.”"
      },
      {
        "paragraph": "Wesley was exasperated. He never thought Catherine would secretly let Lucas recognize Shaun as his\nfather."
      },
      {
        "paragraph": "How many more things had that woman done behind his back?"
      },
      {
        "paragraph": "“Lucas, have you forgotten how Shaun abandoned you and your mom?” Wesley could only turn to\nLucas. “Didn’t you say you would never forgive him?”"
      },
      {
        "paragraph": "Lucas’ expression changed. His soft and fair little face flushed red."
      },
      {
        "paragraph": "Right then, Suzie cried out, “Mom, you’re finally here! ”"
      },
      {
        "paragraph": "She ran into Catherine’s embrace."
      },
      {
        "paragraph": "Lucas looked at Catherine with reddened eyes as well."
      },
      {
        "paragraph": "Catherine gazed at Wesley with complicated feelings. “Wesley, can you not talk about this in front of the\nchildren?”"
      }
    ]
  },
  {
    "title": "Chapter 1185 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine admitted that Shaun had done a lot of things that hurt her."
      },
      {
        "paragraph": "However, they should not be used to force a child to make a choice."
      },
      {
        "paragraph": "Children were the most innocent. They did not have the power to choose their parents."
      },
      {
        "paragraph": "It was the nature of every child to yearn for their fathers. Catherine did not let her children acknowledge\nShaun as their father at the start because she had worried that Shaun was still under Sarah’s hypnosis\nand would do whatever it took to snatch the children from her. Secondly, had worried that Sarah would\nbecome the children’s stepmother and hurt them."
      },
      {
        "paragraph": "However, all those would not happen anymore. Therefore, she was no longer opposed to the idea."
      },
      {
        "paragraph": "Nobody understood Lucas better than Catherine. Lucas was a prideful, haughty boy. Wesley’s words\nwould make Lucas embarrassed and feel bad."
      },
      {
        "paragraph": "“Cathy…”"
      },
      {
        "paragraph": "A deep trace of hurt flashed across Wesley’s face from being accused. “I just think that it’s unfair to you\nand the children. Have you forgotten? If I hadn’t protected you back then, the children would’ve died from\nhis push. What has he contributed to the children? What right does he have to take them back just\nbecause he wants to?”"
      },
      {
        "paragraph": "“That’s our own matter, ” Shaun said coldly. “You…” Wesley’s face turned green from anger. “Shaun, shut\nup.”"
      },
      {
        "paragraph": "Catherine yelled at Shaun as well. “Both of you are adult men but you’re creating a ruckus at the\nentrance of the preschool. Have you both ever considered the children? Look at how many people are"
      },

      {
        "paragraph": "watching this mess from the side.”"
      },
      {
        "paragraph": "Shaun gave the children an apologetic glance. “I didn’t want to, but I don’t want to let Wesley take Lucas\naway.”"
      },
      {
        "paragraph": "Wesley said coldly, “I’m Cathy’s husband. Taking Lucas away is my right.”"
      },
      {
        "paragraph": "“You guys can continue arguing until you’re satisfied. I’m taking the kids away.”"
      },
      {
        "paragraph": "Catherine felt ashamed from the stares of the parents and teachers who had crowded around them. She\nbrought the two kids with her and got in her car."
      },
      {
        "paragraph": "“Cathy…” Wesley and Shaun followed her at the same time."
      },
      {
        "paragraph": "However, Shaun was staring at Catherine’s mask. “ Cathy, why are you wearing a mask?”"
      },
      {
        "paragraph": "Wesley stiffened. Catherine calmly turned her face away. “I caught a cold. Don’t follow me. The kids\nneed to cool down. Don’t let them be in a difficult position.”"
      },
      {
        "paragraph": "She got in her car and quickly drove away."
      },
      {
        "paragraph": "When he saw that Catherine had left, Shaun could not be bothered to fight with Wesley anymore."
      },
      {
        "paragraph": "When he was about to get in his car, Wesley’s cold voice came from behind. “Shaun, I’m warning you.\nStay away from Cathy in the future. If not, I can make you and your family’s lives a living hell. I can even\nmake Hill Corporation disappear.”"
      },
      {
        "paragraph": "The pair of eyes under Shaun’s sharp brows went cold. “Wesley, you’re finally revealing your true colors.\nMm, you really hid well.”"
      },
      {
        "paragraph": "“Don’t forget how you threatened me using my company in the past. Be aware of your current identity.\nDon’t overestimate your abilities.” Wesley stared gloomily at Shaun."
      },
      {
        "paragraph": "He had made several attempts to kill Shaun, but it was unfortunate that Shaun always got lucky."
      },
      {
        "paragraph": "After yesterday night, Wesley did not want to be tolerant anymore."
      },
      {
        "paragraph": "“Try it, then. However, let me remind you that if a woman doesn’t like you even after you’ve been\npursuing her for a few years, it means that you’re not attractive to her at all. Maybe she’ll never like you\nin this lifetime. Don’t try to demand something that’s not yours.”"
      },
      {
        "paragraph": "Shaun laughed sarcastically and opened the car door."
      },
      {
        "paragraph": "“At least I can give her pleasure in bed. Can you? You eunuch.”"
      },
      {
        "paragraph": "After Wesley said that, he got what he wanted when he saw Shaun’s body stiffening. Only then did he\nsmugly turn around and drive away."
      }
    ]
  },
  {
    "title": "Chapter 1186 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Shaun looked at the outline of Wesley’s car. He clenched his fists tightly."
      },
      {
        "paragraph": "He knew that Wesley was definitely involved in the incident of him being attacked in the police station\npreviously."
      },
      {
        "paragraph": "Catherine brought the two children back to the Yule family’s villa."
      },
      {
        "paragraph": "On the way, Suzie was doing fine, while Lucas was quite down. He kept looking outside the window with\na cold expression."
      },
      {
        "paragraph": "“Lucas, don’t overthink things, ” Catherine consoled, “Don’t take Uncle Wesley’s words to heart. Just\nfollow your own heart in everything you do.”"
      },
      {
        "paragraph": "“But Mom, I think Uncle Wesley is right.”"
      },
      {
        "paragraph": "Lucas said frustratedly, “ Shaun has wronged us so many times. I shouldn’t recognize him as my father\nfor the rest of my life, but lately, I keep going to the Hill family with him.”"
      },
      {
        "paragraph": "Shaun even accompanied him to play basketball, football, and went swimming with him."
      },
      {
        "paragraph": "Lucas would feel happy without realizing it. Sometimes, he would even admire Shaun quite a bit for\nknowing everything and excelling in everything."
      },
      {
        "paragraph": "“Lucas, you’re still young. Some things are not supposed to be shouldered by you. Shaun didn’t hurt you\non purpose either.”"
      },
      {
        "paragraph": "Catherine said in a serious tone, “In the past, Shaun was under Sarah’s hypnosis. Although I thought he\ndeserved it, he had never thought of hurting you little kids on purpose. At that time, he just didn’t like me\nand thought I didn’t deserve to have his children. He wanted to let Sarah take care of you both.”"
      },

      {
        "paragraph": "“Sarah is an evil, bad woman.”"
      },
      {
        "paragraph": "Lucas said loudly, “She even hurt Suzie before, yet Shaun still helped her. He also chopped off Uncle\nLogan’s finger too. He fought a lawsuit for Sarah and wanted to send you to jail.”"
      },
      {
        "paragraph": "“That’s also because he didn’t trust me. He’s stupid. He was completely fooled by a bad woman. ”"
      },
      {
        "paragraph": "Catherine said gently, “No matter how things are between him and me, I believe that he would have\ntreated you two well if he had known that you were his children. Even if you want to hate him, I’m the one\nwho’s supposed to do it—not you two. I only hope that you both can grow up without any worries.”"
      },
      {
        "paragraph": "“Mm-hmm.” Suzie nodded vigorously. “Lucas, don’t overthink it.”"
      },
      {
        "paragraph": "Lucas rolled his eyes at Suzie. “You’re always the first one to betray Mom. You’ ll switch sides once\nShaun buys you candy.”"
      },
      {
        "paragraph": "“Lucas, you’re too stubborn.”"
      },
      {
        "paragraph": "Suzie was disapproving of Lucas’ words. “What disadvantage is there to having a father who buys u s\ncandy, clothes, and toys? He can even help Mom save money. Don’t you know taking care of children is\nvery tiring? If he takes care of us more often, Mom can be more relaxed. Besides, I saw on the news that\neven if he doesn’t raise us now, he’s still our father by blood. According to the law, we’ll still have to take\ncare of him when he gets old.”"
      },
      {
        "paragraph": "For the first time, Lucas was stunned by the words o f his unreliable sister."
      },
      {
        "paragraph": "Catherine was dumbfounded too. “Er… Suzie, what news did you watch?”"
      },
      {
        "paragraph": "“I watched the legal news with Granny.”"
      },
      {
        "paragraph": "Suzie said in a serious manner, “Therefore, why do we have to care for him when he’s old in the future\nyet he doesn’t have to raise us when we’re young? I n his dreams! I won’t give such an advantage to our\nscummy dad.”"
      },
      {
        "paragraph": "Suzie kept going, saying, “Moreover, when I watched Instagram Reels with Great-grandma, there was a\nmom who jumped off a building because she was too exhausted from raising two babies. Therefore, we\ncan’t let Mom be too tired. Let’s let the person we hate the most take care of us more often. We can look\nfor that person we hate when we’re in a bad mood or when we’re crying. As for Mom, we can play and\nlaugh with her.”"
      },
      {
        "paragraph": "Catherine was utterly speechless again. Toward the end, she did not know whether she should laugh or\ncry. What on earth had Suzie been watching at the Hill family lately? “Suzie, I won’t jump off a building\nbecause I’m too exhausted from taking care of you both. Don’t worry.”"
      }
    ]
  },
  {
    "title": "Chapter 1187 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“But we know that Mom was very, very tired when she was taking care of us before. When I had a fever\nin the past, Mom had to accompany us while working as well. She couldn’t even sleep at night, ” Suzie\nsaid sadly."
      },
      {
        "paragraph": "“That’s right. There were tiring times, but I think they’re all worth it when I look at you two little cuties, ”\nCatherine said reassuredly."
      },
      {
        "paragraph": "Upon hearing that, Lucas remained silent while sitting in the backseat."
      },
      {
        "paragraph": "He felt that Suzie did have a point there."
      },
      {
        "paragraph": "If he did not let Shaun take care of him, would that not be giving Shaun an advantage?"
      },
      {
        "paragraph": "Suzie put her small hands on Lucas’ shoulder. “ Lucas, we still have to frequently get our scummy dad to\ntake us out to play in the future. That way, he won’t have the chance to go near other vixens. We have to\nwork hard being third-wheelers and make him single and lonely for the rest of his life. This is the heaviest\npunishment for him.”"
      },
      {
        "paragraph": "“Mm, your plan isn’t bad.” Lucas nodded his head with a straight face. It was rare that he agreed to\nSuzie’s words."
      },
      {
        "paragraph": "Catherine was shocked from listening to them."
      },
      {
        "paragraph": "She noticed that Suzie was getting more and more mischievous lately. That might be a good thing too.\nSuzie would not suffer any losses in the future."
      },
      {
        "paragraph": "After arriving at the Yule family’s villa, Catherine was about to get down from the car when she saw Joel\nseeing Old Madam Yule and Old Master Yule off."
      },

      {
        "paragraph": "The expressions of the two elderly people were not that good. Old Master Yule even said furiously, “Joel\nYule, if you hadn’t sold the shares to Kawada back then, Yule Corporation wouldn’t be in this state."
      },
      {
        "paragraph": "You have to take responsibility for this.”"
      },
      {
        "paragraph": "Joel sneered, “Then why don’t you blame Melanie for getting married to Charlie? Didn’t you all favor\nCharlie a lot? You believed in anything he said and even let Charlie’s assistant support Melanie. Look a t\nwhat has happened now. Yule Corporation is being dominated by Charlie and Kawada.”"
      },
      {
        "paragraph": "Old Master Yule was embarrassed by Joel’s words. When he saw that Catherine had returned, he\nimmediately switched targets. “Catherine, you’re here just in time. You’re married to Wesley now."
      },
      {
        "paragraph": "Ask Wesley to help Yule Corporation.”"
      },
      {
        "paragraph": "Catherine was puzzled. Joel came over and said, “ Cathy, don’t listen to your grandpa. Charlie and\nKawada have basically emptied out Yule Corporation. The Yule family has begun to fall now. Your\ngrandpa still refuses to accept reality.”"
      },
      {
        "paragraph": "“You…” Old Master Yule’s body was about to collapse from anger."
      },
      {
        "paragraph": "Old Madam Yule sighed and said, “That company is your father’s painstaking efforts, Joel. Can’t you\nthink of something?”"
      },
      {
        "paragraph": "“Mom, my heart already died long ago when you both kept taking Damien and his daughter’s side\ndespite Damien sabotaging me.”"
      },
      {
        "paragraph": "Joel continued saying coldly, “When Cathy advised you not to agree to establish an investment company\nwith the Campos family back then, you all didn’t listen to her. Look at what has happened now. The one\nsuffering losses is Yule Corporation, while the ones earning money are the Campos family. The Campos\nfamily aren’t kind people. If not, they wouldn’t have backstabbed Hill Corporation after Hill Corporation\nhelped them out so much.”"
      },
      {
        "paragraph": "Old Madam Yule murmured, “Must we really give up on Yule Corporation?”"
      },
      {
        "paragraph": "“What right do you have to not give up? Now, the Campos family wants to kick out everyone with the last\nname Yule. You don’t have a choice either, do you? Dad, you’re already so old. There’s only so much\nyou can do. I think you should retire earlier. ” Joel sighed. He did not care about the two elderly anymore\nand just went into the villa."
      },
      {
        "paragraph": "“Joel Yule, you unfilial son! ” Old Master Yule scolded from behind as he was too angry."
      },
      {
        "paragraph": "Catherine quickly brought the two children into the house. Not long after, they heard the sound of the two\nelderly leaving in their car."
      },
      {
        "paragraph": "“Dad, is the Yule family in a terrible state?”"
      },
      {
        "paragraph": "“Mm, your grandpa wants me to come out of retirement and help. I rejected him.”"
      },
      {
        "paragraph": "Joel sneered, “They only think of me when something happens. When there’s no problem, then it’s\nDamien. But now Damien and Melanie"
      },
      {
        "paragraph": "have both been kicked out of Yule Corporation by Charlie. They’ve been scheming their whole lives, but\nin the end, the Campos family are the ones who profited. They’re both stupid.”"
      },
      {
        "paragraph": "“The Campos family may not be easy to deal with since they’ve taken over Yule Corporation, ”Catherine\nlamented, ”Melanie is already useless now. Charlie will probably divorce her.”"
      },
      {
        "paragraph": "”I heard that Charlie hasn’t gone back home for half a month.”"
      }
    ]
  },
  {
    "title": "Chapter 1188 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Catherine frowned. Charlie had wanted to court Freya before. If he divorced Melanie, he would definitely\nwant to marry Freya."
      },
      {
        "paragraph": "“Forget it. The Yule family’s business has nothing to do with us. Let’s stay out of it.” Joel turned around to\nplay with his two little grandchildren."
      },
      {
        "paragraph": "Catherine looked at them and felt a little worried about the injury on her face."
      },
      {
        "paragraph": "She originally wanted to hide until it healed before going out, but it seemed she could not avoid it\nanymore."
      },
      {
        "paragraph": "She had been wearing a mask and lied that she was having a cold, but she could not hide anymore\nwhen it was time to eat."
      },
      {
        "paragraph": "“Cathy, are you going to wear your mask while eating too? The children aren’t that weak. It doesn’t\nmatter if you take off your mask, ” Joel said."
      },
      {
        "paragraph": "“Dad, I’d better take the food and eat elsewhere.” Cathy got up and picked up the dishes."
      },
      {
        "paragraph": "Joel looked at her deeply for a moment before suddenly giving Suzie a look."
      },
      {
        "paragraph": "Suzie was sitting beside Catherine. She took the opportunity to quickly pull the mask off Catherine’s face.\nThe red and swollen half of her face immediately came into view."
      },
      {
        "paragraph": "“Mommy, who hit you?” Lucas got up, his eyes surging with endless anger."
      },
      {
        "paragraph": "“Mommy, does it hurt?” Suzie almost shed tears in distress."
      },
      {
        "paragraph": "Joel was furious. “ I knew something was strange. Stop trying to hide from us. Tell me, who hit you?”"
      },

      {
        "paragraph": "“Calm down, I just had a dispute with someone and he accidentally hit me. I’ve already gotten revenge.\nReally, I got even with him. I even paid him back double.”"
      },
      {
        "paragraph": "Catherine pretended not to care and grinned. “ Don’t look at me, I know I’m ugly. Hurry up and eat.”"
      },
      {
        "paragraph": "Joel looked at her closely for a moment before lowering his head to give the children food."
      },
      {
        "paragraph": "After eating, Joel called Catherine upstairs and said in a serious tone, “Cathy, tell me the truth. Who hit\nyou? I know at first glance that your injury was caused by a man. A woman wouldn’t be able to hit you\nlike that.”"
      },
      {
        "paragraph": "Catherine’s eyes stung slightly as she lowered her head. “It was Wesley.”"
      },
      {
        "paragraph": "“What?” Joel was shocked."
      },
      {
        "paragraph": "He never thought that a gentle person like Wesley would do such a thing."
      },
      {
        "paragraph": "“That b*stard!” Joel slammed his fist on the table i n anger. “How dare he hit you? I really misjudged him\nfor thinking that he was a good man with deep feelings. Catherine, I’m going to settle the score with him\nfor you. I didn’t protect you well before, but this time, I can’t let another man bully you again.”"
      },
      {
        "paragraph": "“Don’t go, Dad.”"
      },
      {
        "paragraph": "Catherine hurriedly stopped him. “I was the one at fault in this matter…”"
      },
      {
        "paragraph": "“But he still shouldn’t have hit you. He even hit you so hard. You’ve only been married for a while.” Joel\nwas deeply saddened."
      },
      {
        "paragraph": "“Dad, it’s true. I did something wrong and triggered him. But after this incident, I realized that I might not\nbe suitable for him. I want to divorce him.” Catherine found that she was much more relaxed after voicing\nher thoughts out."
      },
      {
        "paragraph": "Joel froze. “But it hasn’t been long since you married. If you divorce again, this will be your second\ndivorce. The outside world will…”"
      }
    ]
  },
  {
    "title": "Chapter 1189 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Dad, I didn’t marry Wesley because I loved him. I might have liked him a little, but it was more so\nbecause I was moved. He had done so much for me, so I wanted to give him happiness. I thought he\nwas worthy of my dependence.”"
      },
      {
        "paragraph": "Catherine bowed her head bitterly. “Only recently did I realize that I might not understand him very well. I\noften feel tired and stressed when I’m with him. Of course, it’s also because I have great responsibilities.”"
      },
      {
        "paragraph": "Joel sighed deeply. He had also married a woman he did not love, so he understood her feelings well."
      },
      {
        "paragraph": "“Fine, do what you want. I’m willing to support you unconditionally. Even if you remain unmarried and\nstay at home for life, I won’t dislike you. Besides, a man who would raise a hand against a woman is not\na good man.”"
      },
      {
        "paragraph": "Joel was the protective kind. He used to like Wesley before, but since Wesley had hit his daughter, he no\nlonger liked him."
      },
      {
        "paragraph": "He did not care if his daughter had done something wrong. In any case, his daughter should be treated\nlike a treasure. No one could bully her."
      },
      {
        "paragraph": "“Thank you, Dad.” Catherine was sincerely grateful. “ But I hope that you won’ t intervene in this matter.\nI’ll slowly solve it with Wesley.”"
      },
      {
        "paragraph": "“Alright, I promise.”"
      },
      {
        "paragraph": "The two little children hiding in front of the door immediately sneaked back into the playroom when they\nheard footsteps walking out."
      },

      {
        "paragraph": "Their eyes were wide open. Lucas’ eyes were filled with endless anger and disbelief. “I didn’t expect that\nMommy’s cheek was swollen because Uncle Wesley hit her.”"
      },
      {
        "paragraph": "“Bah, he doesn’t deserve to be called ‘Uncle’ at all.” Suzie was furious. “He hit Mommy. I don’t like him\nanymore. I hate him.”"
      },
      {
        "paragraph": "“Me too.” Lucas clenched his small fists. Although he used to respect Wesley very much, his Mommy\nwas the one person who should not be touched. For the first time, he deeply hated himself for being\nweak and unable to protect Mommy."
      },
      {
        "paragraph": "When he thought of how he set up Mommy and Wesley before, he felt upset."
      },
      {
        "paragraph": "Someone like Wesley was not worthy of Mommy at all."
      },
      {
        "paragraph": "Shaun was also unworthy."
      },
      {
        "paragraph": "He had to quickly grow up and protect Mommy."
      },
      {
        "paragraph": "“We have to avenge Mommy, ” Suzie said indignantly, “I’m gonna tell our scummy dad about this.”"
      },
      {
        "paragraph": "She hurriedly took out her phone to call Shaun. Lucas did not stop her."
      },
      {
        "paragraph": "Suzie soon got through to Shaun. “Suzie, do you miss Daddy?”"
      },
      {
        "paragraph": "Hearing Shaun’s voice, Suzie suddenly became choked up."
      },
      {
        "paragraph": "“Why are you crying, baby? Who bullied you?”"
      },
      {
        "paragraph": "Shaunimmediately became anxious."
      },
      {
        "paragraph": "“I was bullied, and Mommy was bullied, ” Suzie said in an aggrieved tone. “Mommy’s face was beaten by\nWesley until it became swollen.”"
      },
      {
        "paragraph": "“Wesley hit your mom?” Shaun suddenly remembered that Catherine was wearing a mask when he saw\nher at noon. It turned out she was hiding her injury."
      },
      {
        "paragraph": "His heart seized up viciously while his hatred for Wesley reached another level."
      },
      {
        "paragraph": "“Yeah, Mommy is really sad. She even said she wants to divorce Wesley…”"
      },
      {
        "paragraph": "“Suzie, that’s enough.” Lucas quickly ended the call."
      },
      {
        "paragraph": "Suzie glared at him angrily. “What was that for?”"
      },
      {
        "paragraph": "“Don’t tell him what Mommy said, or he’ll think that his opportunity has come. Mommy is still married, so\nit’s not good for her to have contact with him.”"
      },
      {
        "paragraph": "Lucas said seriously, “Besides, I don’t want Mommy to get out of the frying pan that is Wesley only to\njump back into the same fire again.”"
      },
      {
        "paragraph": "“That… makes sense.”"
      }
    ]
  },
  {
    "title": "Chapter 1190 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Just as Suzie finished speaking, Shaun called again in a hurry. “Suzie, you said that your mommy wants\nto divorce Wesley. Is that true?”"
      },
      {
        "paragraph": "“Scummy dad, don’t ask any more questions. I’m going to accompany Mommy now. Her face must hurt a\nlot now.”"
      },
      {
        "paragraph": "Suzie mercilessly hung up the phone again."
      },
      {
        "paragraph": "Shaun stood in front of the floor-to-ceiling window for a while, his eyes cold with anger."
      },
      {
        "paragraph": "How dare Wesley hit her? Damn it! He had to teach Wesley a lesson."
      },
      {
        "paragraph": "However, what he was more worried about now was Catherine."
      },
      {
        "paragraph": "He immediately asked Chester to get the best ointment and headed to the Yule villa."
      },
      {
        "paragraph": "When he reached the door, he called Catherine. “ Come out. I brought you some ointment. Chester said\nthat this ointment is very useful. You’ll get better after using it for a day or two.”"
      },
      {
        "paragraph": "Catherine very quickly understood what had happened. Suzie must have snitched. She started to have a\nheadache and said, “I already put on ointment. I don’t need you to care about me.”"
      },
      {
        "paragraph": "“Yours isn’t as good as mine, ” Shaun said firmly."
      },
      {
        "paragraph": "Catherine was speechless. “How would you know mine isn’t as good? Is Chester’s medicine the most\neffective in the world? Shaun Hill, I’m begging you to keep a distance from me. Every time I provoke you,\nnothing good happens to me.”"
      },

      {
        "paragraph": "“Did Wesley hit you because he found out what happened between us in the Mead residence’s\nwashroom?” Shaun suddenly gritted his teeth and asked."
      },
      {
        "paragraph": "Catherine was stunned. She did not expect him to know that Wesley had hit her."
      },
      {
        "paragraph": "Did he guess it or did Suzie eavesdrop at the door earlier?"
      },
      {
        "paragraph": "“Stop making wild guesses. It has nothing to do with you…”"
      },
      {
        "paragraph": "“Stop lying to me. I went to Hudson yesterday to look for you but Harvey said you didn’t come to work.\nYou didn’t show up because you were beaten by him the night before, right?”"
      },
      {
        "paragraph": "The more Shaun guessed, the more he blamed himself and the more angry he became. “That son of a\nb*tch, Wesley! I’ll never forgive him. I’ll go"
      },
      {
        "paragraph": "teach him a lesson now.”"
      },
      {
        "paragraph": "“Shaun Hill, you’ re insane!” Catherine hurriedly scolded him."
      },
      {
        "paragraph": "“No, I’m not insane. I’m a piece of trash who let the woman I like get hurt by others. I’ll leave the ointment\nat your door. I’ll head out first.”"
      },
      {
        "paragraph": "Shaun put the ointment aside and slammed the car door."
      },
      {
        "paragraph": "Catherine hurriedly ran to the window and saw that he was really driving away. She cursed in her heart,\nquickly taking her car key to drive over and catch up to him."
      },
      {
        "paragraph": "Shaun drove very fast but she stopped him at the foot of the mountain, forcing him to slam on the\nemergency brake. She immediately ran out of the car."
      },
      {
        "paragraph": "She came out in a hurry and was still wearing her spaghetti strap pajamas. She was not wearing a mask,\nso the swollen half of her face was exposed to the moonlight. Shaun’s heart almost broke from the pain."
      },
      {
        "paragraph": "“That b*stard! How dare Wesley hit you so hard?” Shaun’s eyes were filled with a brutal look."
      },
      {
        "paragraph": "“Don’t go to Wesley.” Catherine looked at him pleadingly. “Besides, this isn’t completely his fault. Any\nman would have gotten angry.”"
      },
      {
        "paragraph": "Shaun felt deeply chagrined and guilty. “ I’m sorry, Cathy. It’s all my fault. You must be in a lot of pain.”"
      },
      {
        "paragraph": "As he spoke, he fiercely slapped himself on the face, leaving a palm print on his handsome face. The\ncorner of his lips split as well."
      },
      {
        "paragraph": "Catherine was shocked. “Did you… have to hit yourself that hard?”"
      },
      {
        "paragraph": "An average man would just do it for show."
      },
      {
        "paragraph": "“I just want to feel your pain.” Shaun raised his hand and could not help but touch her face gently."
      },
      {
        "paragraph": "Catherine looked at his deep and distressed eyes. She unnaturally took a few steps back."
      }
    ]
  },
  {
    "title": "Chapter 1191 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "However, Shaun did not give up."
      },
      {
        "paragraph": "Instead, he hugged her, tightly holding her delicate body in his arms."
      },
      {
        "paragraph": "The evening breeze blew her silk nightgown. “Cathy, divorce him. Wesley doesn’t deserve you.”"
      },
      {
        "paragraph": "Catherine was stunned for a moment before returning to her senses. She pushed him away. “Let me go.\nIf people see us alone in the middle of the night, I won’t be able to wash my name clean even if I jump\ninto the river. Do you want me to get beaten again?”"
      },
      {
        "paragraph": "Shaun’s heart ached when he heard her words and he let go of her."
      },
      {
        "paragraph": "Although he wanted to hold her like this forever, he was even more afraid that she would get hurt\nbecause of him."
      },
      {
        "paragraph": "“ Shaun, even if I divorce him one day, it won’t be because of you. Don’t flatter yourself. ” Catherine\ncooled her expression and deliberately said in a harsh tone."
      },
      {
        "paragraph": "“Cathy, you know best if I’m flattering myself or not. ” Shaun looked at her and smiled. “ If it were another\nman, would you have helped him like you helped me that night?”"
      },
      {
        "paragraph": "At the thought of what had happened that night, Catherine blushed in shame."
      },
      {
        "paragraph": "She glared at him fiercely. “I did it because of Suzie and Lucas. I don’t want them to lose their father. ”"
      },
      {
        "paragraph": "“Yes, I understand. Thank you, mother of my children.” Shaun looked at her with a burning gaze a s\nthough he wanted to set her on fire."
      },

      {
        "paragraph": "Catherine could not stay any longer and turned back to his car. “ I can’t be bothered with you. I’m going\nback to sleep. Don’t cause trouble for Wesley, or I really won’t be able to clear my name anymore.”"
      },
      {
        "paragraph": "“It can’t be cleared anyway.” Shaun grinned."
      },
      {
        "paragraph": "“Shut your mouth.” Catherine could not stop herself from yelling."
      },
      {
        "paragraph": "However, as soon as her facial muscles were pulled, she felt a burning pain on her face and hissed."
      },
      {
        "paragraph": "Shaun panicked. He had left the ointment at the Yule villa’s door. This was the first time he was\nencountering such a situation, so he did not know what to do. He could only act like he was coaxing\nSuzie. “Does it hurt? I’ll blow it for you.”"
      },
      {
        "paragraph": "He leaned over and gently blew on her face."
      },
      {
        "paragraph": "Catherine was speechless. He really was treating her like a child. “That’s enough, stop blowing. Just\ndon’t make me angry.”"
      },
      {
        "paragraph": "“When did I make you angry? I’m telling the truth. You don’ t have to persuade me about Wesley. He hurt\nmy beloved woman. If I give up, what kind of man would I be?”"
      },
      {
        "paragraph": "Hearing this, Catherine glanced at his lower body and said with a vague smile, “Are you sure you’re still\na man? Don’t pretend I haven’t seen it before. ”"
      },
      {
        "paragraph": "Shaun’s handsome face suddenly darkened when he was severely humiliated by her. What was more\nembarrassing to be humiliated by his beloved woman? “This is only temporary. I’m already in the middle\nof treatment. I’ll let you witness my true ability soon.”"
      },
      {
        "paragraph": "“Hoodlum.” Catherine rolled her eyes at him. “You started it.”"
      },
      {
        "paragraph": "Shaun’s expression was innocent. “Cathy, you don’t want me to go to Wesley because you want to\nprotect me, right? I’m powerless and pitiful now. Anyone is able to step on me, so you’re afraid that\nWesley will retaliate against me.”"
      },
      {
        "paragraph": "“You’re delusional, Shaun. I don’t want you to go to my husband and make my marriage more\ncomplicated,” Catherine snapped at him and refuted."
      },
      {
        "paragraph": "“I don’t believe you.” Shaun’s gaze fell on her chest. “ I can see that you were really anxious when you\nrushed down to chase after me.”"
      },
      {
        "paragraph": "Catherine froze and looked down at herself. She realized that in her haste, she had not worn underwear\nwhen she came out."
      },
      {
        "paragraph": "Her face turned red again."
      },
      {
        "paragraph": "She ignored him and got into the car before swiftly driving away."
      },
      {
        "paragraph": "After the car drove some distance away, she glanced through the rear-view mirror and saw the figure\nstanding in the night. Her heart involuntarily skipped a beat."
      },
      {
        "paragraph": "She then remembered Ethan’s sudden death."
      }
    ]
  },

  {
    "title": "Chapter 1192 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Maybe Shaun would also suddenly disappear like that one day…"
      },
      {
        "paragraph": "She clenched the steering wheel involuntarily."
      },
      {
        "paragraph": "When Shaun saw her car disappear and was about to get into his own car, he received a text message\nfrom Catherine: [Shaun, promise me you won’t go to Wesley, or I’ll never talk to you again for the rest of\nmy life.]"
      },
      {
        "paragraph": "Shaun’s thin lips curled faintly."
      },
      {
        "paragraph": "‘Cathy, your heart is clearly still concerned about me."
      },
      {
        "paragraph": "‘Even if you keep saying you don’t love me, my position in your heart is still different.’"
      },
      {
        "paragraph": "He lowered his head and replied: [Okay, I won’t go to him, so talk to me forever, okay?]"
      },
      {
        "paragraph": "After the message was sent, there was no response. However, he was not disappointed."
      },
      {
        "paragraph": "He already knew that she would not respond."
      },
      {
        "paragraph": "As for Wesley hitting her… He had agreed to Catherine’s request, but if he did not teach Wesley a\nlesson, his name was not Shaun Hill."
      },
      {
        "paragraph": "Wesley liked maintaining his gentlemanly and elegant image, so Shaun would let him make a fool of\nhimself."
      },
      {
        "paragraph": "When Catherine went back to the Yule villa, she still picked up the bottle of ointment at the door."
      },
      {
        "paragraph": "After she applied a little of it, her face was not as swollen the next day."
      },

      {
        "paragraph": "When she sent the children to kindergarten the next day, she asked seriously, “Were you two\neavesdropping outside when I was talking with your grandfather in the room last night?”"
      },
      {
        "paragraph": "“W-What are you… talking about?” Suzie’s eyes flickered as she looked outside. Even though she\nusually loved to lie, she still felt nervous when facing Mommy’s fiery eyes."
      },
      {
        "paragraph": "Lucas also looked outside the window at a loss."
      },
      {
        "paragraph": "“Lucas, you’re the most honest. Answer Mommy’s question.” Catherine pretended to say coldly."
      },
      {
        "paragraph": "“I’m sorry, Mommy.” Lucas looked down guiltily. “ I didn’t mean to. We just wanted to know who hit you.”"
      },
      {
        "paragraph": "“So you immediately tipped off Shaun?” Catherine remembered the things she said yesterday and\nsuddenly became nervous. “What else did you say to him? Don’t tell me you told him everything.”"
      },
      {
        "paragraph": "“No, absolutely not.” Suzie shook her head frantically. “We definitely didn’t tell him that you don’t love\nUncle Wesley and only married him out o f gratitude.”"
      },
      {
        "paragraph": "Catherine felt awkward. The children really heard everything. “You must never ever let Shaun hear those\nwords.”"
      },
      {
        "paragraph": "If that scumbag Shaun heard it, he would pester her endlessly."
      },
      {
        "paragraph": "“Yes, we know.” The two children nodded."
      },
      {
        "paragraph": "At the entrance of the kindergarten, Suzie suddenly asked a question as they got out of the car. “\nMommy, you don’t love Uncle Wesley. Is it because you still like our scummy dad?”"
      },
      {
        "paragraph": "Catherine was exasperated. “Of course not. I stopped liking him long ago.”"
      },
      {
        "paragraph": "“Oh, if you don’t like him, I’ll try my best to destroy his love life and make him live as a bachelor for life. ”\nAfter Suzie finished speaking, she went into the kindergarten with Lucas, hand in hand."
      },
      {
        "paragraph": "Catherine rubbed her forehead speechlessly."
      },
      {
        "paragraph": "After sending the children, she went straight to the company."
      },
      {
        "paragraph": "Just after entering the office, she found that Wesley had been waiting there for a long time. He held\nflowers in his hand. After seeing her, he immediately handed over the flowers and opened a gift box,\nrevealing the limited edition diamond necklace inside. “Cathy, please don’t be angry anymore. It was my\nfault that day. I shouldn’t have raised my hand against you. I was wrong. After you left, I regretted it so\nmuch that I felt sick. I’ve never lost control like that before.”"
      }
    ]
  },
  {
    "title": "Chapter 1193 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Wesley’s eyes were red. “I was just irritated that day. First, it was that incident with Senator Mead, and\nthen there was Shaun and you. I was too afraid o f losing you.”"
      },
      {
        "paragraph": "As he spoke, a pained expression suddenly appeared on his face."
      },
      {
        "paragraph": "“What’s… wrong?” Catherine was startled."
      },
      {
        "paragraph": "“It’s nothing. I just didn’t rest well, so my chest is a little uncomfortable,” Wesley pretended to casually\nsay."
      },
      {
        "paragraph": "Catherine knew that he often felt unwell because he lost a kidney when he saved her three years ago."
      },
      {
        "paragraph": "Back then, the doctor had also said that he could not be too stimulated."
      },
      {
        "paragraph": "“Cathy, come home, okay?” Wesley suddenly kneeled on the ground. “I promise I’ll never hit you again.\nLet’s go back to how we were before, okay?”"
      },
      {
        "paragraph": "Catherine looked at him silently for a while before saying in a low voice, “Get up. I’ll go back in the\nafternoon.”"
      },
      {
        "paragraph": "Wesley’s eyes looked up in surprise. “Really?”"
      },
      {
        "paragraph": "“Yeah.” Catherine lowered her eyes. “I don’t blame you either. What happened that day was…”"
      },
      {
        "paragraph": "“Don’t say it. I know you didn’t do it of your own accord. You must have been forced by Shaun,” Wesley\ninterrupted her before dodging the topic. “ Shall I put the necklace on you?”"
      },
      {
        "paragraph": "Seeing this, Catherine did not say anything more."
      },

      {
        "paragraph": "After letting him put the necklace on her and chatting with him for a while, she made an excuse that she\nhad a meeting and got him to leave first."
      },
      {
        "paragraph": "Not long after he left, Catherine dialed Logan’s number. “If there are hidden cameras installed in my\nhome, can you find out without alerting anyone?”"
      },
      {
        "paragraph": "Logan was stunned. “There are hidden cameras installed in your home?”"
      },
      {
        "paragraph": "“It’s not really my home,” Catherine said after a moment of silence. “It’s Wesley’s villa. Of course, I’m not\nsure if there really are hidden cameras. I simply want to check just in case. I need to look for something\nin his study but I’m afraid he has hidden cameras installed.”"
      },
      {
        "paragraph": "Logan was shocked for a long time and said in a strange tone, “Wesley and you…”"
      },
      {
        "paragraph": "“I suspect that he’s hiding something from me, ” Catherine said."
      },
      {
        "paragraph": "“But you asked me to trail after him for a while before. I didn’t find anything wrong,” Logan said in\nconfusion."
      },
      {
        "paragraph": "“Yes, so I dispelled my doubts at that time. But have you ever thought that there’s another possibility?\nMaybe Wesley already knew about Austin and you, or maybe what you didn’t escape his eyes,”\nCatherine said."
      },
      {
        "paragraph": "Logan’s heart jumped. After thinking about it carefully, it seemed that it was possible."
      },
      {
        "paragraph": "“I have a device. It can tell if there are hidden cameras around.”"
      },
      {
        "paragraph": "“Then I’ll contact you in the afternoon. Be careful when you come to the villa later. Don’t leave any\ntraces,” Catherine reminded him."
      },
      {
        "paragraph": "At 3:30 p.m., she drove back to Wesley’s villa."
      },
      {
        "paragraph": "Wesley had not come back yet. After she cleaned up the bedroom, she told Logan to come over."
      },
      {
        "paragraph": "Not long after Logan arrived, Wesley came back. “Logan, why are you here?” Wesley asked with a face\nof surprise."
      },
      {
        "paragraph": "“Oh, I came to talk to Ms. Jones about something. She noticed that I’ve been quite free lately so she\nasked me to help her in Hudson, but I’m used to being free so I don’t wish to take up her offer on that,”\nLogan said casually."
      }
    ]
  },
  {
    "title": "Chapter 1194 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“That’s true, you might not be used to working a nine to five job,” Wesley said cordially. “ If you like\nfreedom, I can arrange a job for you. I need someone to help me examine the pharmacies abroad— ”"
      },
      {
        "paragraph": "“That won’t do. My left and right-hand men are Logan and Austin. I can’t let them get too far away from\nme, ” Catherine came down from upstairs and interrupted him with a laugh."
      },
      {
        "paragraph": "“That’s true. I didn’t think it through.” Wesley saw her smile and his heart finally let out a sigh of relief.\n“You guys talk. I’ll cook tonight.”"
      },
      {
        "paragraph": "Then, he rolled up his sleeves and went to the kitchen."
      },
      {
        "paragraph": "Catherine walked over to Logan and glanced at him, deliberately asking, “Have you thought about what\nposition you want?”"
      },
      {
        "paragraph": "Logan lowered his voice and said, “There are hidden cameras installed in the living room, dining hall,\nyour bedroom, and the kitchen. I didn’t dare to go anywhere else. There must be someone watching\nbehind the scenes, so I’m afraid of arousing suspicion. But I’m guessing there are hidden cameras in\nthe whole house.”"
      },
      {
        "paragraph": "Catherine was horrified."
      },
      {
        "paragraph": "Although she had called Logan over to check, her thoughts had only been leaning toward the what- ifs.\nShe did not think that the house would be equipped with hidden cameras. She did not expect the whole\nhouse to be monitored."
      },
      {
        "paragraph": "This was Wesley’s home. No one but him would be able to do this."
      },

      {
        "paragraph": "It seemed like from the first day she entered this home, everything she did had been closely monitored\nby Wesley."
      },
      {
        "paragraph": "Fortunately, she had not rashly turned on Wesley’s computer to investigate the other day."
      },
      {
        "paragraph": "It was too scary."
      },
      {
        "paragraph": "Wait. Then, when she was showering…"
      },
      {
        "paragraph": "“There are none in the bathrooms,” Logan said in a hurry when she saw her face suddenly growing\npale."
      },
      {
        "paragraph": "Catherine was greatly relieved."
      },
      {
        "paragraph": "If there were cameras in the bathrooms as well, she would really have to die with Wesley."
      },
      {
        "paragraph": "“The places where the most cameras are installed are the living room, dining hall, the hallways, and\nyour bedroom, ” Logan said again. “Maybe you guessed it right. None of your actions have escaped the\nlens of the cameras. Everything you did in the bedroom was crystal clear too. It’s no wonder Wesley\ncame back not long after I arrived.”"
      },
      {
        "paragraph": "Catherine took a deep breath and tried to calm herself down. In any case, she could not be too\nflustered. “Are they very hidden? I’ve been staying in the bedroom for so long but I never noticed them\nbefore.”"
      },
      {
        "paragraph": "“Yeah, they’re the world’s top surveillance cameras. They’re as small as ants. They’re probably hidden\nin the socket or on a lamp on the ceiling."
      },
      {
        "paragraph": "They generally can’t be found by the naked eye. Even if they’re found, you’d just think that they’re dust\nor trash.”"
      },
      {
        "paragraph": "“Alright, I understand. You can go back first.” Catherine pressed her temple."
      },
      {
        "paragraph": "Logan said worriedly, “Why don’t I stay? I’ll be able to protect you. This place is undoubtedly a lion’s\nden. It’s dangerous for you to stay here. Wesley even hit your face last time…”"
      },
      {
        "paragraph": "“If you suddenly stay, Wesley will become suspicious. I can’t leave yet. Even if this is the lion’s den, I\nhave to stay.”"
      },
      {
        "paragraph": "She was more and more certain that Wesley had something to do with Ethan’s death. She had to find\nevidence of it. After all, Ethan would not have died if he had not come looking for her."
      },
      {
        "paragraph": "Besides, Tracy had reminded her that she promised she would find out the cause of Ethan’s death."
      },
      {
        "paragraph": "“By the way, help me find some very small cameras. If Wesley can use them, so can I,” Catherine said\nin a low voice."
      },
      {
        "paragraph": "“Got it.”"
      },
      {
        "paragraph": "Logan was still not at ease, but seeing how insistent she was, he had no choice but to leave quickly."
      },
      {
        "paragraph": "As soon as he left, Wesley came out with a surprised expression on his warm face. “Why did Logan\nleave? I cooked his portion.”"
      }
    ]
  },
  {
    "title": "Chapter 1195 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“How would a bodyguard like him dare to eat a meal cooked by the great President Lyons?” Catherine\nsmiled faintly."
      },
      {
        "paragraph": "She looked at Wesley’s handsome face. The more she smiled, the more her heart trembled."
      },
      {
        "paragraph": "It seemed like ever since she met Wesley, he had the same gentle and silent watchful look."
      },
      {
        "paragraph": "It was the same now as well."
      },
      {
        "paragraph": "Had he changed somewhere along the way, or had he always been this good at hiding his true colors?"
      },
      {
        "paragraph": "If Ethan died in his hands, how vicious must this person be to be able to kill his own nephew without\nmercy?"
      },
      {
        "paragraph": "Did such a terrible person know how to love? Was his love for her real?"
      },
      {
        "paragraph": "She thought about what Shaun had said. Wesley was holding back because he wanted to take revenge\non her. She would become the second Lea Hill."
      },
      {
        "paragraph": "The thought flashed in her mind."
      },
      {
        "paragraph": "She had a suspicion that if her guess was right, she might end up worse than Lea."
      },
      {
        "paragraph": "At least no matter how bad Mason was, he still cared about the Campos family."
      },
      {
        "paragraph": "“Logan is very important to you, so he is to me too. Your family is my family. Your friends are my friends,”\nWesley did not notice anything strange about her and responded with a smile."
      },
      {
        "paragraph": "If it were in the past, Catherine would feel touched and guilty. Now, she only felt that his face was\nextremely hypocritical and disgusting."
      },

      {
        "paragraph": "It was time for Wesley and her to act now. They would see who was the better actor."
      },
      {
        "paragraph": "“Do you need me to give you a hand?” Catherine changed the subject."
      },
      {
        "paragraph": "“No need. Just wait for the meal to be served.” Wesley went into the kitchen again."
      },
      {
        "paragraph": "At night, when Catherine was working in the bedroom, she received a call from Shaun again."
      },
      {
        "paragraph": "“Cathy, I heard from Suzie that you went back to Wesley.” Shaun’s voice sounded very upset. “He hit\nyou. Why did you go back to him?”"
      },
      {
        "paragraph": "“Because… he’s my husband. This is my home.” Catherine’s eyes imperceptibly glanced at the\nextension cord as she said in a low voice."
      },
      {
        "paragraph": "“Cathy, if a man dares to hit you a first time, there’ll be a second time—”"
      },
      {
        "paragraph": "“Didn’t you also hit me in the face before?” Catherine interrupted him."
      },
      {
        "paragraph": "Shaun immediately choked. After a long time, he said in a depressed voice, “I was hypnotized by Sarah\nback then. I didn’t mean it— ”"
      },
      {
        "paragraph": "“Enough. Stay out of my business.” Catherine hung up the phone."
      },
      {
        "paragraph": "Shaun looked at the call and felt so depressed that he wanted to vomit blood."
      },
      {
        "paragraph": "He did not understand. Last night, Suzie had said that Catherine wanted to divorce Wesley. Why did she\ngo back to him the next day?"
      },
      {
        "paragraph": "A few knocks came from the door of the study and Elle walked in. “Eldest Young Master…”"
      },
      {
        "paragraph": "“Did you find out where Chance and Yael went? ” Shaun asked in a low voice."
      },
      {
        "paragraph": "“They… didn’t leave Canberra. They’re living in a duplex that Chance recently bought. ”"
      }
    ]
  },
  {
    "title": "Chapter 1196 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "Elle lowered her voice. “During this period of time, Chance would accompany Yael every day and\noccasionally bring her out for maternity check-ups or buy groceries. I didn’t dare to follow too closely\nbecause I was afraid that Chance would find out."
      },
      {
        "paragraph": "After all, he’s very good at not being followed.”"
      },
      {
        "paragraph": "“So… you didn’t find out anything?” Shaun was very disappointed. Had he made a wrong guess?"
      },
      {
        "paragraph": "“No, I found something, ” Elle said. “Yesterday, Chance and Yael went into a private restaurant for dinner\ntogether. I didn’t dare to go in after them, but I saw that Ivan and Charlie Campos also arrived shortly\nafter. They stayed in the restaurant for more than an hour.”"
      },
      {
        "paragraph": "Shaun’s hand on the table slowly clenched into a fist. “That’s too coincidental.”"
      },
      {
        "paragraph": "Elle nodded with a complicated gaze. “Yes. Not long after Ivan and Charlie left, Chance and Yael came\nout too. Yael seemed to be in a very good mood.”"
      },
      {
        "paragraph": "“Looks like my guess might be right.”"
      },
      {
        "paragraph": "Shaun’s thin lips pursed with a chill. He had thought about all sorts of possibilities. How could he not\nhave considered that there might be a spy in Liona?"
      },
      {
        "paragraph": "He always thought that Liam betrayed the Hill family, but it was likely that Liam was just the scapegoat.\nThe person behind it was trying to frame Liam."
      },
      {
        "paragraph": "Yael must have colluded with the Campos family. It was unknown if Chance knew about it, but even if he\ndid, he would have hidden it from Shaun because of the baby in Yael’s belly."
      },

      {
        "paragraph": "Liam’s disappearance must have something to do with those two people. Chance was definitely hiding\nsomething from him."
      },
      {
        "paragraph": "Perhaps Liam’s disappearance had a lot to do with the Campos family."
      },
      {
        "paragraph": "However, Liam was still Mason’s son. Would Mason get rid of his own child?"
      },
      {
        "paragraph": "Elle could not help but say sadly, “I don’t know how Yael became like this. Yael and I grew up together on\nthe training camp and used to be close, but after she started protecting Sarah, we stopped speaking as\nmuch. I think she slowly changed after protecting Sarah.”"
      },
      {
        "paragraph": "Shaun’s heart trembled violently. Yes, Sarah was full of evil tricks. Yael had just become an official\nmember of Liona when he sent her to protect Sarah. At that time, Yael was a blank piece of canvas he\nallowed Sarah to smear."
      },
      {
        "paragraph": "Later, Yael became more loyal to Sarah than to him. Maybe it was Yael’s betrayal that allowed that\nvicious woman, Sarah, to sow discord."
      },
      {
        "paragraph": "Elle saw Shaun’s expression become increasingly unpleasant. She hurriedly said, “ I’m sorry, Eldest\nYoung Master. I spoke impulsively— ”"
      },
      {
        "paragraph": "“No, you’re right. Maybe the biggest defeat in my life was to that woman, Sarah Neeson…”"
      },
      {
        "paragraph": "Shaun gritted his teeth. “Fortunately, the hearing will be held soon. I’ll get the money back little by little\nfor now. I’ll slowly settle the score with her later.”"
      },
      {
        "paragraph": "As for Liam… Liam…"
      },
      {
        "paragraph": "Would Shaun ever be able to see him in this life again?"
      },
      {
        "paragraph": "After Elle left, Shaun opened the door and walked out soullessly. He was just in time to see Lea come\nback from outside."
      },
      {
        "paragraph": "“Why are you back so late?” Shaun asked casually."
      },
      {
        "paragraph": "“I went to see Willie. His condition hasn’t improved at all. Your uncle and aunt are depressed. Willie is\ntheir everything,” Lea said guiltily, “It’s all my fault.”"
      },
      {
        "paragraph": "Shaun had gotten used to her complaints lately, but today, he thought about Liam and could not help but\nask, “Mom, do you remember how you got pregnant with Liam?”"
      },
      {
        "paragraph": "At the mention of that, Lea’s face suddenly turned red and then white. “Why are you bringing that up? I\nwas blind back then. I must’ve been possessed. ”"
      },
      {
        "paragraph": "“I remember… you got pregnant with Liam before you got married, ” Shaun suddenly said."
      },
      {
        "paragraph": "“I don’t want to mention the past.” Lea felt humiliated and disgraced."
      },
      {
        "paragraph": "“Mom, I just want to find out if Liam is really Mason’s son.” Shaun could not figure it out. If Yael colluded\nwith the Campos family, she might have been in the know when he asked Chance to throw Liam out.\nLogically, Yael should have helped Liam instead. Why did Liam disappear instead?"
      },
      {
        "paragraph": "“What are you talking about?” Lea was dumbfounded and flushed in embarrassment. “Who could it be if\nnot Mason’s? Liam also asked the same question before, but this is a fact that can’t be erased. ”"
      },
      {
        "paragraph": "”Liam also asked this before?” Shaun was surprised."
      }
    ]
  },
  {
    "title": "Chapter 1197 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Yeah, when we acknowledged Suzie, Mason gave her a pitiful amount of money. He gave her less than\nwhat he gave his nieces. Liam was very uncomfortable and said that Mason had never cared much\nabout him since childhood.” Lea felt worse the more she spoke, and she missed Liam even more."
      },
      {
        "paragraph": "Shaun raised his brows. “Then didn’t you find it strange? Is Mason neglecting his own child just because\nhe doesn’t like you? Could he be so heartless? Even tigers don’t eat their own children.”"
      },
      {
        "paragraph": "Lea’s eyes flashed with deep chagrin and sorrow. “I don’t know what’s going on either. From start to end,\nI was completely used by him. But Liam is still his son.”"
      },
      {
        "paragraph": "“That’s why… I’m asking you to remember what happened that night. Are you sure it was Mason? Have\nyou ever thought that maybe he resented you at that time and found another man to replace him…”"
      },
      {
        "paragraph": "Shaun’s words were harsh and piercing. Lea’s face turned pale."
      },
      {
        "paragraph": "“That’s enough. Your mom isn’t that stupid… ” As she spoke, she suddenly seemed to remember\nsomething and her body shook. “That night, I drank a lot of wine so I don’t remember much. But"
      },
      {
        "paragraph": "Mason was beside me when I woke up the next day"
      },
      {
        "paragraph": "Just as she spoke, she had a bad feeling. “Do you think I was deceived by Mason?”"
      },
      {
        "paragraph": "“There’s something I haven’t told you yet. I found out that Yael might be colluding with Mason. Yael is\nChance’s woman and is pregnant with his child. I suspect that Chance is protecting Yael. It’s very likely\nthat Yael informed the Campos family the day I told Chance to throw Liam out, and the Campos family…\ngot rid of Liam.”"
      },
      {
        "paragraph": "After Shaun finished explaining his cruel speculation, he closed his eyes."
      },

      {
        "paragraph": "This was a bolt from the blue for Lea. Although Liam had been missing for a long time, she was still\nhopeful as no body had been found yet. “No, that’s impossible. Why would Mason kill Liam? Liam is his\nson.”"
      },
      {
        "paragraph": "“That’s the reason why I suspect that Liam might not be Mason’s son. When Hill Corporation’s data was\nleaked, I was taken away by the police and just so happened to see Mason bailing Liam out when I came\nout. At that time, I became even more suspicious that Liam was the spy. Everything pointed to Liam,\nmaking us disappointed in him and hate him. But what if it was a plot set up by Mason?” Shaun said\nthoughtfully."
      },
      {
        "paragraph": "“What does that mean?” Lea was slightly lost. Of course, it might be because she was unwilling to\nbelieve it."
      },
      {
        "paragraph": "“Coincidentally, Mason met up with Liam in a cafe and just so happened to be seen by the shareholders\nof the company. They’re father and son. What couldn’t be discussed at home? Why did they have to\ndiscuss it outside?”"
      },
      {
        "paragraph": "Lea was horrified. “You’re saying that the meeting was planned by the Campos family on purpose?"
      },
      {
        "paragraph": "They deliberately wanted Hill Corporation’s shareholders to suspect Liam?”"
      },
      {
        "paragraph": "Shaun nodded. “After Hill Corporation’s microchip data was stolen, the first person we suspected was\nLiam. Liam didn’t listen to Mason, so he became a victim. I was the last person to see him before he\ndisappeared, so everyone thought that I killed him. I’m still dealing with that lawsuit.”"
      },
      {
        "paragraph": "Lea stumbled back a few steps, completely unable to accept this reality. “How… How did it come to this\nShe broke down and cried out, “Could it be that it really wasn’t Mason that night? If Liam isn’t his child,\nthen who is his father?” “That’s just my guess.” Shaun frowned. “I was young at that time, but I heard\nfrom Aunty that the Hill family only agreed to let you marry Mason because you were pregnant.”"
      }
    ]
  },


  {
    "title": "Chapter 1198 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“Yes. ” Lea nodded blankly. “That year, I had just divorced your father and didn’t want to remarry so\nquickly. I fought with your father that day and drank some wine. I ended up with Mason.”"
      },
      {
        "paragraph": "Shaun raised his brows at her lost expression. As a son, the only thing he could do was sigh helplessly. “\nIs there a possibility that the person might have been my dad?”"
      },
      {
        "paragraph": "Lea was so shocked by his words that she stammered, “That’s… That’s impossible.”"
      },
      {
        "paragraph": "“I’m just saying. You don’t have to think too much into it. I have something to do, so I’m going out. I’ll\nleave Suzie and Lucas to you tonight.”"
      },
      {
        "paragraph": "Shaun spoke and left the dumbfounded Lea behind."
      },
      {
        "paragraph": "He quickly drove to the villa that Brennan recently bought in the capital. Although Hill Manor was\nBrennan’s now, it was too high profile. Brennan was not living there for the time being."
      },
      {
        "paragraph": "“It’s so late, why did you suddenly come over?” Brennan was dressed in a robe and had just about\ngotten ready to sleep when he heard that Shaun was coming. Hence, he came downstairs again."
      },
      {
        "paragraph": "“I read the news today. Garson Corporation and Campos Corporation intend to cooperate,” Shaun said\ngravely."
      },
      {
        "paragraph": "“Yeah.”"
      },
      {
        "paragraph": "Brennan nodded. “But I didn’t show up. I let the company’s GM contact Charlie Campos. Although the\nCampos family is the top family in the country, their brand isn’t very good. The microchip was licensed to\nthem by Landell, but the fact is they only earn a margin in profit. The Campos family has no tech in this\nfield and logistics is monopolized by Yule Corporation, which is why they really want to introduce"
      },

      {
        "paragraph": "Garson’s technology so they can develop products. We’ve reached a preliminary agreement where the\nCampos family will invest 3oo billion to establish an industrial park for this project.”"
      },
      {
        "paragraph": "Shaun quickly understood, and his eyes lit up. “But you already signed that technology to me long ago,\nso Hill Corporation got invested first. When our product is released before Campos Corporation’s, the\nCampos family’s 300 billion will have been squandered on a bad investment.”"
      },
      {
        "paragraph": "“Yes, this is a trap I dug for the Campos family. ” Brennan smiled. “But if you do that, Garson will be\nviolating the contract. The Campos family can sue Garson Corporation for fraud,” Shaun said with\ndifficulty."
      },
      {
        "paragraph": "“That’s why the contract you signed was never with Garson Corporation in the first place but with another\ncompany. Although it’s not under my name, it’s controlled by me. That company licensed you the top\ntechnology, while Garson licensed Campos Corporation the secondary technology.”"
      },
      {
        "paragraph": "Shaun was struck by a realization and admired his father’s far planning. “Then I’ll seize the opportunity to\ndevelop it first and give the Campos family a surprise.”"
      },
      {
        "paragraph": "“This matter can’t be leaked out, so you should keep a low profile for now. It’s fine if you pretend to be in\ndire straits and get bullied by others. It’s important for people to learn how to hold back.” Brennan\nsuddenly said faintly, “Even if you want to teach Wesley a lesson, you have to endure it first.”"
      },
      {
        "paragraph": "Shaun’s handsome face reddened. He did not expect Brennan to know that he wanted to get someone\nto teach Wesley a lesson. “Dad…”"
      },
      {
        "paragraph": "Brennan said meaningfully, “Shaun, it’s not the time to expose yourself now. The more they look down on\nyou, the more they’ll underestimate you. This is when you secretly take advantage of the situation to rise\nup. An oppressed person will not arouse suspicion.”"
      }
    ]
  },
  {
    "title": "Chapter 1199 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [

      {
        "paragraph": "“I understand, Dad.” Shaun sighed inwardly. He thought he was very smart, but compared to Brennan,\nhe was still too inexperienced."
      },
      {
        "paragraph": "“As expected of my son. When you rise again, the time will come for us father and son to take revenge. ”\nBrennan’s eyes were filled with hatred."
      },
      {
        "paragraph": "Shaun’s lips moved slightly. “Dad, I want to ask you a question. 20 years ago, after you divorced Mom,\ndid you two ever… sleep together again?”"
      },
      {
        "paragraph": "Brennan was startled. After a moment, his eyes flashed with annoyance. “Why are you asking that? It’s\nbeen so many years that I’ve already forgotten. Just the thought of Lea makes me nauseous.”"
      },
      {
        "paragraph": "“ Is it because of Mason and her?” Shaun could not help but ask."
      },
      {
        "paragraph": "“What else could it be? No man can stand something like that. I don’t care what history she had with\nMason. She should’ve at least kept a distance from him for the sake of her child after getting married, but\nwhat did she do instead? She neglected you and went out with Mason every day. ”"
      },
      {
        "paragraph": "Even though it was so long ago, Brennan’s veins still popped out in anger at the mention of it. “\nAfterward, she wanted to divorce me because I beat up Mason. We fought several times and I was\ndisheartened, so I left.”"
      },
      {
        "paragraph": "“Dad, I’m not asking about your history with Mom. I’m asking if you’ve ever slept with her after the\ndivorce,” Shaun said very seriously, “It’s really important. Maybe my mom got drunk or something A\ntouch of embarrassment flashed across Brennan’s handsome face. “There was that one time. I had a big\nfight with Lea and said many harsh words."
      },

      {
        "paragraph": "Afterward, I felt that I had been quite hurtful and went back to find her. She was drunk, and… Ahem. It’s\nall in the past. Don’t mention it again.”"
      },
      {
        "paragraph": "He did not know that his words had caused great waves in Shaun’s heart."
      },
      {
        "paragraph": "Lea said that she had been drunk at that time. Could it be that she was so drunk that she failed to\nrecognize who the man really was?"
      },
      {
        "paragraph": "In other words, Liam was most likely his full brother?"
      },
      {
        "paragraph": "His body trembled violently as his face went white."
      },
      {
        "paragraph": "“What’s wrong with you?” Brennan became uneasy."
      },
      {
        "paragraph": "“Dad, did you leave right after sleeping?” Shaun asked shakily."
      },
      {
        "paragraph": "“Of course I did. If I had waited for her to wake up, I would’ve definitely gotten scolded for trying to use a\nlady like her to climb up the social ladder. People would say I’m aiming for a woman out of my league.”"
      },
      {
        "paragraph": "Brennan scoffed coldly. “But I didn’t expect her to be so loose. She slept with Mason right after sleeping\nwith me. I heard that she was one month pregnant not long after.”"
      },
      {
        "paragraph": "“Dad, you got it all wrong.”"
      },
      {
        "paragraph": "Shaun muttered, “Mom was never pregnant with Mason’s child. The baby was yours. After you left that\nday, Mason went into the bedroom, so Mom thought she had slept with him. Then, she married Mason\nbecause she was pregnant. She said that she didn’t want to marry Mason so soon either, but it was only\nbecause she had Liam.”"
      },
      {
        "paragraph": "Brennan was stupefied."
      },
      {
        "paragraph": "Even though he had experienced countless storms before, he was still at a loss. “That’s… That’s\nimpossible.”"
      },
      {
        "paragraph": "“Dad, it’s absolutely true. I asked mom before I came. She was also confused.”"
      },
      {
        "paragraph": "Shaun’s eyes reddened in pain. “That’s why Mason never once cared about Liam since he was a child.\nIt’s because he knew Liam wasn’t his son. He used Liam and turned Liam and me against each other,\nmaking us destroy each other. Liam’s death must have been caused by Mason.”"
      },
      {
        "paragraph": "The more he thought about it, the more pain he felt. He covered his eyes and could not accept this\nreality. “I was too stupid. I got my own brother killed. If I had been calmer and didn’t beat Liam up that\nday, if I hadn’t told Chance to throw him out, he wouldn’t have gone missing.”"
      },
      {
        "paragraph": "Since childhood, he and Liam had always fought with each other. They had always been disgusted by\neach other’s existence."
      },
      {
        "paragraph": "How ridiculous! At the end of the day, they were full brothers."
      },
      {
        "paragraph": "Brennan’s eyes were also red. He had another son."
      },
      {
        "paragraph": "However, that son was gone before he could see him?"
      }
    ]
  }




]