[

  {
    "title": "Chapter 1850 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Of course, Patrick also understood that their statuses were different now. She was a princess and the\npearl of the Lynch family, whereas he was just the fallen Young Master of the Jackson family."
      },
      {
        "paragraph": "“Patrick, let’s go.” Linda tugged at Patrick apprehensively."
      },
      {
        "paragraph": "Since Rebecca was dead, she did not dare to provoke Freya and Rodney anymore."
      },
      {
        "paragraph": "“What? Why are you running when you see me?” Rodney’s lips curled into a sneer. “Weren’t you quite\nhappy throwing in your lot with Rebecca? Oh, by the way, that friend of yours was also found to be a\nfraudster, and her entire family had gone to jail. It was a huge fraud involving hundreds of billions. I\nremember you had a really good relationship with her back then. You weren’t dragged into it, were\nyou? Did the police investigate you?”"
      },
      {
        "paragraph": "“No, I didn’t…” Linda panicked, and her face turned white as snow. “ I’m not familiar with Rebecca at\nall.”"
      },
      {
        "paragraph": "“Not familiar?” Rodney smiled wickedly. “That can’t be. Back then, Rebecca even introduced you to the\nformer prime minister’s grandson and saved Patrick out of jail. But you’re saying that you’re not familiar\nwith her? Do you think I’m stupid? I think you must be a fish that slipped through the net, so you have\nto be caught and put on trial.”"
      },
      {
        "paragraph": "Then, he took out his phone."
      },
      {
        "paragraph": "Linda looked at Patrick pleadingly. “Patrick, I really didn’t know. You have to help me. I was cheated by\nRebecca. I only did it because I wanted to save you. Freya is just there, so please help me beg for\nmercy. I don’t want to go to jail. I’m innocent.”"
      },
      {
        "paragraph": "Patrick could not refute it. He had to admit that he only got out of jail because of Linda’s help."
      },
      {
        "paragraph": "He looked up at Freya with a complicated gaze and walked towards her."
      },
      {
        "paragraph": "However, just as he took a step, Rodney stopped him."
      },
      {
        "paragraph": "“What are you doing? Are you planning to harass my wife?” Rodney warned coldly, “Get lost.”"
      },
      {
        "paragraph": "Patrick’s face reddened in embarrassment, but he could not stand Linda’s bitter pleading. Hence, he\nforced his way through. “Freya…”"
      },
      {
        "paragraph": "He went to her side and looked at her face up close."
      },
      {
        "paragraph": "Only then did he realize that her face was a little rounder than before, but she seemed much more\nradiant. Her skin was excellent, and even the aura she exuded was different from what it used to be."
      },
      {
        "paragraph": "The difference between them now was like the difference between heaven and earth."
      },
      {
        "paragraph": "“Do you need something?” Freya looked at him calmly, her gaze flat."
      },
      {
        "paragraph": "Patrick’s heart suddenly flooded with pain, and he was suddenly at a loss. “I…”"
      },
      {
        "paragraph": "“He wants to plead for mercy on Linda’s behalf. ” Rodney walked over lazily. “Didn’t Linda get along\nwell with Rebecca? Rebecca was suspected of fraud, so it’s standard procedure to investigate her\nfriends too. But Patrick can’t bear to let Linda be investigated.”"
      },
      {
        "paragraph": "Patrick panicked. “That’s not it. I just…”"
      },
      {
        "paragraph": "“So you’re here to plead for mercy on Linda’s behalf?” Freya interrupted him and stared at him with her\ndark eyes."
      },
      {
        "paragraph": "Patrick felt a lump in his throat. In the end, he could only nod stiffly. “I admit that Linda might have done\na lot of bad things to you. But when it comes to Rebecca, Linda might really…”"
      },
      {
        "paragraph": "“Might? Really?” Freya smiled pensively. “ President Jackson, you know Rebecca is involved in a huge\nnational-level fraud. Are you still trying to vouch for Linda? Have you ever thought of what you’ll face if\nyou’re wrong? Have you thought about your parents? When you were in prison, your parents ran all\naround trying to help you. They even knelt at the entrance of the Lynch residence. You’re not young\nanymore to be so immature.”"
      },
      {
        "paragraph": "Patrick’s handsome face turned pale."
      },
      {
        "paragraph": "In the past, he always felt that Freya was not sensible and liked to kick up a fuss without reason."
      },
      {
        "paragraph": "Now, in her eyes, he was so immature that he looked like an idiot."
      },
      {
        "paragraph": "Freya said faintly, “In fact, even if Linda is investigated, she won’t necessarily go to jail. As long as she\ndidn’t do anything, the police can’t do anything to her. But if she’s suspected of it,  it’s only natural that\nshe goes to jail, isn’t it?”"
      }
    ]
  },
  {
    "title": "Chapter 1851 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Patrick was speechless."
      },
      {
        "paragraph": "It did seem like he was too hasty."
      },
      {
        "paragraph": "In other words, he should not have come over to plead for mercy at all."
      },
      {
        "paragraph": "It made it seem as if he cared about Linda when, in fact, it was Linda who caused Freya and him to end\nup in this position…"
      },
      {
        "paragraph": "“You don’t need to plead for Linda either. She has already slipped away. ” Rodney jerked his chin at the\ndoor with contempt."
      },
      {
        "paragraph": "That was when Patrick realized that Linda had quietly slipped away while he was pleading for her\nmercy."
      },
      {
        "paragraph": "At that moment, his heart went cold."
      },
      {
        "paragraph": "For that woman, he had misunderstood Freya and lost his first love."
      },
      {
        "paragraph": "Hah…"
      },
      {
        "paragraph": "Up until just now, he thought that he would help Linda one last time even though he had broken up with\nher."
      },
      {
        "paragraph": "“Aren’t you leaving?” Rodney stood in front of Freya, his eyes full of contempt."
      },
      {
        "paragraph": "Patrick was too ashamed to stay. With that, he turned around and staggered away."
      },
      {
        "paragraph": "Only then did the surrounding people, who were watching the show, disperse one after another."
      },
      {
        "paragraph": "Harley said nosily, “ Did Linda really collude with Rebecca? Hurry up and call the police to arrest her.”"
      },
      {
        "paragraph": "“ I was just deliberately scaring her. The police had already investigated Linda when Rebecca was\nconvicted. Linda was the first person Rebecca contacted after coming back, but Linda wasn’t involved\nin the fraud, or she would’ve been arrested long ago.”"
      },
      {
        "paragraph": "Rodney snickered and looked at Freya. “I didn’t expect Patrick to be stupid enough to plead for mercy\non behalf of Linda. He must have some loose screws in his head.”"
      },
      {
        "paragraph": "Freya was silent, but Harley said, “That’s nothing new. But Linda just ruined his blind date. It’ll be even\nharder for Patrick to find a good date in Melbourne from now on.”"
      },
      {
        "paragraph": "After lunch, Freya and Harley shopped a little longer before deciding to go home."
      },
      {
        "paragraph": "Once they got into the car, Freya took off her high heels."
      },
      {
        "paragraph": "She had not been wearing high heels during her pregnancy, so her heels hurt after wearing them for a\nwhile today."
      },
      {
        "paragraph": "Sure enough, beauty came with a cost."
      },
      {
        "paragraph": "Rodney started the car and glanced at the rearview mirror from time to time to look at Freya. When he\nsaw her rubbing her feet, he could not help but secretly sigh."
      },
      {
        "paragraph": "Women were so troublesome. She still wanted to wear those high heels even though they were\nuncomfortable."
      },
      {
        "paragraph": "It served her right."
      },
      {
        "paragraph": "Of course, he did not dare to say it out for fear of being killed by Freya."
      },
      {
        "paragraph": "“What are you looking at?” Freya caught his eyes that kept flickering to her. “I haven’t asked you yet.\nWhy did you go over there just now?”"
      },
      {
        "paragraph": "“I was just venting for you.” Rodney quickly chuckled and said, “Patrick and Linda hurt you before, so I\nwanted to scare them off for you.”"
      },
      {
        "paragraph": "“There’s no need. It’s all in the past. ” Freya pursed her lips. She truly did feel that way."
      },
      {
        "paragraph": "After giving birth to a child, her mind was focused on the child and her body."
      },
      {
        "paragraph": "The first love in her past had become less important."
      },
      {
        "paragraph": "Rodney was stunned for a while before he smiled. “It really isn’t that important anymore. You have a\nhusband and child now.”"
      },
      {
        "paragraph": "Freya snickered and rolled her eyes at him. “Get your facts right. You’re about to be laid off as a\nhusband.”"
      },
      {
        "paragraph": "“As long as I don’t sign, I won’t be laid off,” Rodney said with a straight face."
      },
      {
        "paragraph": "Freya really took her hat off to his lack of shame."
      },
      {
        "paragraph": "When she arrived at the Lynch family’s villa and stepped foot into the house, she realized that all the\nclothes, shoes, and jewelry she bought at the mall that morning had been delivered. They were piled\nup all over the living room."
      },
      {
        "paragraph": "Mrs. Lynch pointed to the pile of things and complained, “Look. You can shop if you want to, but why\ndid you buy so much? The house can barely fit all of it. Besides, you don’t intend on staying in\nMelbourne for a long time, so it’s a waste of money. Even if you have money, you shouldn’t squander it\nlike this.”"
      }
    ]
  },
  {
    "title": "Chapter 1852 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya was dumbfounded. She did not expect to have bought so much as well…"
      },
      {
        "paragraph": "Rodney rushed forward and said, “Mom, it’s not Freya’s fault. I paid for all of these. I didn’t think it\nthrough when I bought them. I was careless. How about this? I’ll see if there are any empty villas in this\nneighborhood. I’ll buy it for Freya to store her stuff in.”"
      },
      {
        "paragraph": "Mrs. Lynch was stunned. Buying a villa to store stuff?"
      },
      {
        "paragraph": "Well. The life of rich people was something she could not understand."
      },
      {
        "paragraph": "“That’s not necessary. Even if you’re rich…”"
      },
      {
        "paragraph": "“It doesn’t matter. Besides, Freya is my only wife. What would I spend my money on if not on her? It’s\njust a villa. It won’t cost me much.”"
      },
      {
        "paragraph": "Rodney was a man with deep pockets."
      },
      {
        "paragraph": "Mrs. Lynch could not refute. Since he said it would not cost much, what else could she say?"
      },
      {
        "paragraph": "Freya frowned. She really did not want to spend Rodney’s money."
      },
      {
        "paragraph": "However, it seemed a little too late to write it off now. After all, she already had him pay for so much of\nher stuff that morning."
      },
      {
        "paragraph": "Forget it. They shared a child anyway. At most, she would give it to the baby."
      },
      {
        "paragraph": "Then, she went upstairs to find Dani."
      },
      {
        "paragraph": "This was the first morning she left her daughter, so she missed her quite a bit."
      },
      {
        "paragraph": "Although Dani was heartless and loved an *sshole like Rodney more, Freya was still the one who gave\nbirth to her."
      },
      {
        "paragraph": "Dani was sleeping in her room, and seeing her lovely little face made Freya feel like the pain in her\nheart was cured."
      },
      {
        "paragraph": "As she watched Dani, she was so tired that she gradually fell asleep too."
      },
      {
        "paragraph": "When she woke up again, she felt something pinching her feet."
      },
      {
        "paragraph": "She opened her eyes in a daze and saw Rodney sitting at the end of the bed with his large hand\nmassaging her little feet."
      },
      {
        "paragraph": "Her face instantly turned red."
      },
      {
        "paragraph": "That b*stard. Did he have to be this shameless?"
      },
      {
        "paragraph": "She was so angry that she kicked him in the face. Rodney, who was caught off guard, fell off the bed\nwith a barn."
      },
      {
        "paragraph": "Oh. She did not expect to kick him so easily. Freya was speechless for a while as she watched"
      },
      {
        "paragraph": "Rodney crawl up miserably. His beautiful eyes were filled with anger, but he did not dare to get angry. I\nn the end, he could only glare at her, aggrieved."
      },
      {
        "paragraph": "“What are you looking at? It’s your fault for being perverted.” Freya rolled her eyes at him."
      },
      {
        "paragraph": "“I… I’m perverted?” Rodney’s blood almost boiled. “I saw that your feet hurt after shopping, so I wanted\nto massage it for her. I’ve never even given my parents a massage before. You’re the first, yet you"
      },
      {
        "paragraph": "kicked me.”"
      },
      {
        "paragraph": "Freya froze."
      },
      {
        "paragraph": "Now that he mentioned it, she realized that her sore feet did feel much better."
      },
      {
        "paragraph": "She did not expect him to know that her feet hurt and even massaged her…"
      },
      {
        "paragraph": "It was all too unbelievable."
      },
      {
        "paragraph": "It seemed like she had misunderstood him. “How would I know if you didn’t say?” She felt"
      },
      {
        "paragraph": "guilty but did not want to bow down and apologize to him. “I woke up and saw you taking advantage of\nme. I thought you were drooling over my feet. After all, my feet look so good.”"
      },
      {
        "paragraph": "“You’re so…” Shameless."
      },
      {
        "paragraph": "Rodney subconsciously wanted to retort, but when he saw her dangerous gaze, he hurriedly held back\nand tried to flatter her instead. “Wife, you’re absolutely right. Your small feet look so good. Look at\nthese toes. They’re delicate, exquisite, lovely, elegant, sophisticated…”"
      },
      {
        "paragraph": "“Shut up…” His words gave her goosebumps all over her body."
      },
      {
        "paragraph": "“In short, I fell in love at first sight, ” Rodney continued."
      }
    ]
  },
  {
    "title": "Chapter 1853 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "At that moment, even if Freya’s face was as thick as a wall, her cheeks still could not help but flush."
      },
      {
        "paragraph": "She was dumbfounded. Her brain short-circuited for a moment, and she forgot to say anything to refute\nhim."
      },
      {
        "paragraph": "Seeing that she did not say anything, he chuckled and continued to massage her. “Lie down and don’t\nmove. I’ll rub it for you.”"
      },
      {
        "paragraph": "It was fine when she was sleeping soundly. However, now that she was awake, his touch felt ticklish.\nHer whole body shrunk back as if she was electrocuted. “Let go. It’s ticklish…”"
      },
      {
        "paragraph": "“It is? I’ll switch spots.”"
      },
      {
        "paragraph": "Rodney then pinched her calf."
      },
      {
        "paragraph": "“Don’t. It tickles there too… No… Let go.” Freya laughed so hard that she trembled, feeling\nuncomfortable. She did not realize that her voice was sweet, as if she was flirting. Furthermore, they\nwere on the bed now."
      },
      {
        "paragraph": "As Rodney listened, he felt his blood surge."
      },
      {
        "paragraph": "He felt like Freya was deliberately tempting him."
      },
      {
        "paragraph": "He was just rubbing her calf. Was it necessary to scream like this?"
      },
      {
        "paragraph": "He was still a normal man."
      },
      {
        "paragraph": "At times like these, a normal man would think with his lower half."
      },
      {
        "paragraph": "After all, the woman in this bed was his wife, not someone else."
      },
      {
        "paragraph": "Only a fool would not take advantage of it."
      },
      {
        "paragraph": "“Then I’ll switch spots again…” Rodney was getting restless."
      },
      {
        "paragraph": "Freya widened her eyes in disbelief. When she realized that the situation had changed, blood\nimmediately rushed to the top of her head."
      },
      {
        "paragraph": "“Ro…”"
      },
      {
        "paragraph": "Before she could finish, Rodney kissed her."
      },
      {
        "paragraph": "It was not that he and Freya had not kissed before, but that was a long, long time ago."
      },
      {
        "paragraph": "He even forgot what she tasted like."
      },
      {
        "paragraph": "However, he remembered now that she had reapplied her lipstick after lunch."
      },
      {
        "paragraph": "It was sweet and fragrant, just like jelly."
      },
      {
        "paragraph": "He finally understood why Chester cycled through woman after woman, and Shaun was addicted to\nCatherine all day."
      },
      {
        "paragraph": "Who would not like this? He was so stupid before."
      },
      {
        "paragraph": "A woman like her was right beside him, but he did not even touch her."
      },
      {
        "paragraph": "Tsk. Was he a monk?"
      },
      {
        "paragraph": "He did not want to be a monk now. Freya was stunned by the raging kiss."
      },
      {
        "paragraph": "When she came to her senses, she was furious and ashamed."
      },
      {
        "paragraph": "Rodney Snow… How could he be so shameless? She pushed him away in annoyance."
      },
      {
        "paragraph": "However, they were on the bed, so she was no match for Rodney."
      },
      {
        "paragraph": "Besides, Dani was lying by the side, so she did not dare to use too much force. In the end, it gave"
      },
      {
        "paragraph": "Rodney the chance to be more and more aggressive."
      },
      {
        "paragraph": "The embarrassment and anger in her gradually changed into a strange feeling."
      },
      {
        "paragraph": "She was a little panicked and at a loss."
      },
      {
        "paragraph": "Although she got pregnant after she and Rodney got drunk that one time, she did not remember many\nthings because she had blacked out."
      },
      {
        "paragraph": "In fact, she was actually quite conservative at heart. She rarely had this kind of intimacy with men."
      },
      {
        "paragraph": "Of course, there were several misfires with Patrick before, but that was many years ago. She had\nalmost forgotten about it."
      }
    ]
  },
  {
    "title": "Chapter 1854 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "At that moment… Freya noticed something off about Rodney."
      },
      {
        "paragraph": "Her face burst red with disbelief."
      },
      {
        "paragraph": "On an impulse, she raised her knee sharply. “Urk…”"
      },
      {
        "paragraph": "Rodney let out a miserable scream, waking Dani up immediately."
      },
      {
        "paragraph": "The little girl burst into tears upon being woken up."
      },
      {
        "paragraph": "Freya panicked and hurriedly got up on her hands and knees to hold Dani."
      },
      {
        "paragraph": "Her clothes were all over the place, but Dani soon found the teat and stopped crying."
      },
      {
        "paragraph": "Next to her, Rodney stood on the side, watching. If it were in the past, she could pretend to ignore  it,\nbut her face was burning. Hence, she could only glare at him. “Can you get out?”"
      },
      {
        "paragraph": "“ I’m in pain. If you crippled me, you have to take responsibility.” Rodney’s pretty face turned bitter, but\nhis gaze was staring hard at Dani’s mouth with an envious expression."
      },
      {
        "paragraph": "“Judging by how you look, you’re definitely not crippled.”"
      },
      {
        "paragraph": "Freya scolded as he glared at him embarrassingly."
      },
      {
        "paragraph": "“Don’t worry. For you, I’ll do my best to prevent myself from getting crippled. ” Rodney looked at her\nswollen little mouth pensively."
      },
      {
        "paragraph": "There were some things that one could not start. Once they started, they would be addicted."
      },
      {
        "paragraph": "He was now in that state."
      },
      {
        "paragraph": "Freya’s scalp tingled. She felt like she was being watched by a malicious, starving wolf. However, she\nhad no choice. The child was still here."
      },
      {
        "paragraph": "After the baby was full, she hurriedly tidied herself up and did not even take a nap."
      },
      {
        "paragraph": "Since she did not sleep, Rodney stayed in her bed with Dani."
      },
      {
        "paragraph": "This was the first time he lay in the bedroom that she grew up in. The whole place was filled with her\nscent, and all the sheets were pink."
      },
      {
        "paragraph": "“I realize that… we like similar colors.” Rodney lay on her pillow and grinned. “ I like pink too. Oh, your\nquilt is orange. I like that too. I like bright and pastel colors.”"
      },
      {
        "paragraph": "“As a fully grown man, you have a lot of nerve to say that you like those kinds of colors.” The corners of\nFreya’s mouth twitched."
      },
      {
        "paragraph": "Rodney snorted. “ Is there a rule saying that men can only like cold tones? Some women also like\nwhite and black. Besides, this shows that we have a common interest. The greatest fear between a\nmarried couple is that they don’t have common likes.”"
      },
      {
        "paragraph": "Freya really was speechless. Besides, she was afraid that she would be forcibly kissed again if she\nwent on like this with him, so she turned her head and slipped out."
      },
      {
        "paragraph": "When the evening came, Mrs. Lynch had her go upstairs to call Rodney for dinner and see if Dani had\nwoken up yet."
      },
      {
        "paragraph": "By the time she went up, she saw Dani playing in the cradle by herself."
      },
      {
        "paragraph": "Meanwhile, Rodney was standing beside her bookcase with a comic book in his hands."
      },
      {
        "paragraph": "She did not notice it at first, but as soon as she walked over and saw the hot pictures in the comic\nbook, her brain exploded."
      },
      {
        "paragraph": "She forgot that when she was young, she had bought some sexually explicit comics and put them in\nthe bookcase. She was afraid of her parents discovering them, so she hid them in the most\ninconspicuous corner and even added covers to them."
      },
      {
        "paragraph": "She did not expect Rodney to discover them."
      },
      {
        "paragraph": "“ I didn’t think that… you’d liked stuff like this.” Rodney looked at her playfully. “You call me obscene,\nbut you’re not much better yourself.”"
      },
      {
        "paragraph": "Ah! She was going crazy."
      },
      {
        "paragraph": "Seeing that her face was turning redder, Rodney became more cheerful. “Look, I told you that we have\ncommon interests…”"
      },
      {
        "paragraph": "“Shut up.” Freya felt like she was going to explode."
      },
      {
        "paragraph": "“Well… There’s nothing to be embarrassed about. ” Rodney really found her embarrassment and\nfrantic expression quite cute. “The book is quite nice.”"
      },
      {
        "paragraph": "“If you like it, then read your fill.” Freya squeezed out a smile that was even more unpleasant than\ncrying and rushed up to snatched the book away, quickly stuffing it into the drawer. “My mom said\ndinner is ready. Do you want everyone in my family to wait for you?”"
      },
      {
        "paragraph": "Then, she picked Dani up and headed down."
      },
      {
        "paragraph": "Rodney followed her and whispered in her ear, “ I think that even if you read those books, you didn’t\nunderstand them, right? You need a practice target. I’m willing to let you practice on me. I also learned"
      },
      {
        "paragraph": "several new positions…”"
      },
      {
        "paragraph": "“Get lost.”"
      },
      {
        "paragraph": "Freya kicked him in the calf."
      },
      {
        "paragraph": "Rodney narrowed his eyes in pain. Women were really vicious creatures."
      }
    ]
  },
  {
    "title": "Chapter 1855 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rodney stayed with the Lynch family for two days."
      },
      {
        "paragraph": "Although the Lynch family did not look happy to see him, Mr. Lynch and Forrest were both very busy,\nso they were usually in the company during the day. When they came back in the evening, they only\ngot along for two or three hours before going back to their rooms to rest."
      },
      {
        "paragraph": "Thus, it did not affect Rodney whatsoever."
      },
      {
        "paragraph": "Delicious food and drinks were served in the Lynch residence every day, and Rodney found himself\ngetting used to living here more and more."
      },
      {
        "paragraph": "However, Freya was not used to it. Rodney was just too annoying. Not only did he dig up those\nsexually explicit comics, but the next day, he also dug up some sexually explicit books that she had\nhidden away very securely."
      },
      {
        "paragraph": "In just two days, her pure and elegant image was ruined."
      },
      {
        "paragraph": "“Can you just go back? I’m begging you, okay? Don’t you need to manage your company?” Freya\npainstakingly persuaded him."
      },
      {
        "paragraph": "“The company has a general manager. If there are any problems, they can be solved with a phone call.\nIf he can’t even solve so few matters, then  what’s the point of spending money to hire him?”"
      },
      {
        "paragraph": "Rodney did a lazy stretch. “Besides, is it more important to go to work or to accompany my wife and\nchild?”"
      },
      {
        "paragraph": "Freya was annoyed. Since he refused to leave, she would."
      },
      {
        "paragraph": "On the third day, she packed up her stuff and went back to Canberra."
      },
      {
        "paragraph": "However, she did not go back to the villa they lived in. Instead, she moved back to Brighton Gardens\nwhere she lived before she got married."
      },
      {
        "paragraph": "On the grounds that he had to take care of Dani, Rodney brazenly moved in as well."
      },
      {
        "paragraph": "Freya could not be bothered with him. She had already delayed too much time for the birth of her child.\nNow that she had a nanny to take care of Dani, she could focus on starting her career."
      },
      {
        "paragraph": "She previously planned to invest in a makeup company, which had also been delayed because of her\npregnancy. However, she could finally start now."
      },
      {
        "paragraph": "In the next few days, she was busy looking for a place to rent her office. After finally finalizing the place,\nshe asked Catherine out for coffee in the afternoon. Nevertheless, she did not expect Eliza to be\npresent as well."
      },
      {
        "paragraph": "“Eliza is quite interested in your project.” Catherine smiled."
      },
      {
        "paragraph": "Eliza sipped her coffee. “I can be your spokesperson. Free of charge.”"
      },
      {
        "paragraph": "Freya was very excited. She knew how popular Eliza was now, and the filming for Director Cheever’s\nnew film was almost coming to an end. The"
      },
      {
        "paragraph": "industry was optimistic that she would win an award for this movie."
      },
      {
        "paragraph": "“But…” Eliza paused and said seriously, “I hope you’ll become one of the world’s largest cosmetics\nbrands.”"
      },
      {
        "paragraph": "“Of course. The local makeup brands aren’t very good, so I intend to go overseas and make some\ndecent domestic products. Cathy has already tried my samples. They don’t cost much at all, and I want\nto target the student demographic.”"
      },
      {
        "paragraph": "The three of them talked about starting a business, and in the end, they named the company “"
      },
      {
        "paragraph": "Freycatheli”."
      },
      {
        "paragraph": "“That name is… so weird.” The corners of Catherine’s mouth twitched as she said speechlessly, “How\nabout Freyeli Hall?”"
      },
      {
        "paragraph": "“No way. Your name has to be in it. Besides, Freyeli Hall sounds too tacky.” Freya was very firm with\nher decision."
      },
      {
        "paragraph": "Was Freycatheli not tacky?"
      },
      {
        "paragraph": "Catherine looked at Freya’s ambitious expression and could not find it in her to refute."
      },
      {
        "paragraph": "After chatting, Freya returned home in a good mood, only to find that Dani was not there. Only the\nnanny was left mopping the floor."
      },
      {
        "paragraph": "Seeing that Freya was back, the nanny said, “Mr. Snow said he took Dani to see her grandparents. ”"
      }
    ]
  },
  {
    "title": "Chapter 1856 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya did not intend to keep Dani away from the Snow couple anyway. Besides, as a girl, it would be\ngood for Dani to get closer to the Snow family."
      },
      {
        "paragraph": "However, Dani was still not back at g:oo p.m., so she called Rodney impatiently. “Why aren’t you\nbringing her back?”"
      },
      {
        "paragraph": "“It’s too far. I’ll sleep with Dani in the villa.” Rodney said, “Dani has lived here for more than a month, so\nshe’s more familiar with this place and doesn’t cry much.”"
      },
      {
        "paragraph": "“She needs her milk,” Freya said anxiously."
      },
      {
        "paragraph": "“She can have milk formula. Besides, she’s full from milk powder now.”"
      },
      {
        "paragraph": "“Rodney Snow, what does that mean? Are you planning to keep my daughter away from me?” Freya\nsuddenly got annoyed."
      },
      {
        "paragraph": "“No. You can come over tonight if you miss her.” Rodney said lazily, “Besides, my place here is much\nmore comfortable than Brighton Gardens. You’re not at home all day to accompany Dani, so she’s quite\nbored. Since this place is close to the Snow residence, my parents can come over often. You have to\nthink about Dani. After all… You’ve started a new company now. You won’t have much time to take\ncare of her.”"
      },
      {
        "paragraph": "Freya was silent. She already knew that she could not hide the matter of opening her own company\nfrom Rodney."
      },
      {
        "paragraph": "The point was that Rodney was also in the cosmetics business. If she opened her own makeup\ncompany, both of them might become competitors in the future."
      },
      {
        "paragraph": "“Just think about whether I make sense.” Then, Rodney hung up."
      },
      {
        "paragraph": "After Freya took a shower, her surroundings suddenly became quiet. She was very unused to not\nhaving Dani with her, and the place even felt empty."
      },
      {
        "paragraph": "Furthermore, Dani had not drunk milk, so the swelling made her very uncomfortable."
      },
      {
        "paragraph": "She looked at the ceiling and sighed. When Dani was around, she found her noisy and annoying little\npiece of sh*t. Yet when Dani was not around, she missed her."
      },
      {
        "paragraph": "In the end, she got up from the bed and changed before driving over to Rodney’s villa."
      },
      {
        "paragraph": "When she entered, Dani was still awake and playing with Rodney on the bed."
      },
      {
        "paragraph": "Seeing Freya, Rodney’s thin lips raised, and he said to Dani, “Baby, your mommy is back.”"
      },
      {
        "paragraph": "Freya walked over and saw Dani’s sweet smile. At that moment, her heart melted like cotton candy."
      },
      {
        "paragraph": "She picked Dani up and glared at Rodney. “Get out. I want to feed her.”"
      },
      {
        "paragraph": "“She won’t drink it. I just fed her half a bottle of milk. ” Rodney shrugged. “I thought you wouldn’t come\nover.”"
      },
      {
        "paragraph": "Freya was speechless."
      },
      {
        "paragraph": "What would happen if Dani did not drink? She would swell up to death."
      },
      {
        "paragraph": "Usually, she could use the breast pump to solve it a little. However, she brought it back the last time\nshe went back to Melbourne. She did not expect…"
      },
      {
        "paragraph": "She felt so bitter, yet she could not say anything."
      },
      {
        "paragraph": "Rodney looked at her bitter face, and a smile flashed in his eyes. “I heard that… you intend to open a\nmakeup company. Actually, why bother? My company also intends to develop the cosmetic industry.\nWe can…”"
      },
      {
        "paragraph": "“No, I want to do it alone. I plan to start the business together with Cathy and Eiza.” Freya quickly said,\n“ I don’t trust you. It’s fine when we get along, but who knows if you’ll fall out and become hostile down\nthe line? Oh, right. You’ve also accused me of plagiarizing before. Would I be where I am now if I\nhadn’t worked my *ss off?”"
      },
      {
        "paragraph": "“…That was such a long time ago.” Rodney was most afraid of her bringing up the past and regretted\nbringing it up. “Fine, fine. Forget it."
      },
      {
        "paragraph": "You’re my wife now, so no matter how much money you and I earn, they all belong to our Dani. ”"
      },
      {
        "paragraph": "Freya muttered, “Mine will definitely belong to Dani, but who knows about yours? Maybe you’ll take\nanother wife and have other children.”"
      },
      {
        "paragraph": "“ I’ll never marry another wife and have children with her. You’re the only one I like now. ” Rodney\nlooked at her and suddenly smiled. “Of course, we can consider having another baby.”"
      },
      {
        "paragraph": "The topic changed so quickly that Freya’s pretty face turned red."
      }
    ]
  },
  {
    "title": "Chapter 1857 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "At this point, Rodney just behaved in a nonchalant manner."
      },
      {
        "paragraph": "“Why don’t… we do it tonight?” Rodney approached Freya with a playful expression."
      },
      {
        "paragraph": "“Do it, my *ss.”"
      },
      {
        "paragraph": "Freya promptly dodged him while carrying their child."
      },
      {
        "paragraph": "“Fine then. I’m going to bathe.”"
      },
      {
        "paragraph": "Rodney’s flirting made her face turn crimson. After that, he went to bathe in a cheerful mood."
      },
      {
        "paragraph": "When he came out of the bathroom, Freya switched off the lights to get ready for sleep."
      },
      {
        "paragraph": "Nevertheless, Dani did not obediently fall asleep. Shortly after, she started weeping as nobody was\ncarrying her."
      },
      {
        "paragraph": "After soothing Dani in her arms for a while, Freya felt that her eyes were bleary."
      },
      {
        "paragraph": "She was really sleepy. It had been a long day without rest."
      },
      {
        "paragraph": "“Let me carry her. You can rest.” Rodney, who had just taken a bath, approached Freya, his body\nexuding a fragrant smell. He extended his hands."
      },
      {
        "paragraph": "She turned her gaze to Rodney, whose short, curly hair was slightly messy. Even so, his exquisite face\nremained attractive and his thin lips, in particular, looked better than a woman’s."
      },
      {
        "paragraph": "Despite seeing his face every day, Freya could not help zoning out for a moment."
      },
      {
        "paragraph": "“Why are you looking at me like this? Is it because I’m too good-looking?” Upon realizing that her eyes\nwere fixed on him, he smiled smugly."
      },
      {
        "paragraph": "“Yeah. You’re good-looking. ” Freya nodded. “As a man, you look even better than a woman. I’m\njealous of your looks.”"
      },
      {
        "paragraph": "Rodney choked. It took him a while to put his feelings into words. “Actually, you don’t have to be\njealous of my looks. It’s your honor to be with such a good-looking man like me.”"
      },
      {
        "paragraph": "Freya deliberately grinned and said, “I think it’s because you’re too good-looking that I can’t treat you\nas a man. Do you get it now?”"
      },
      {
        "paragraph": "That was vicious."
      },
      {
        "paragraph": "This woman spoke such vicious words."
      },
      {
        "paragraph": "Rodney carried Dani over with a long face and said indifferently, “You can go to bed now.”"
      },
      {
        "paragraph": "As a night owl, Dani would usually fall asleep at around one or two in the morning. The scene pricked\nFreya’s conscience. “It’s alright… I’ll look after her.”"
      },
      {
        "paragraph": "“It’s fine,”   Rodney said teasingly, “Given that you’re already not as good-looking as me, you’ll look\nmuch worse if you stay up late. I’m doing this so that you’ll be less jealous of me and it’ll improve our\nrelationship.”"
      },
      {
        "paragraph": "“… Haha.”"
      },
      {
        "paragraph": "Furious, Freya covered herself with the blanket and ignored him."
      },
      {
        "paragraph": "She was wrong. She should not have sympathized with him for staying up to accompany their child."
      },
      {
        "paragraph": "Hang on. Sympathize?"
      },
      {
        "paragraph": "That was impossible. At most, she was just a little guilty."
      },
      {
        "paragraph": "Sure enough, women should not be soft-hearted."
      },
      {
        "paragraph": "In less than two minutes, Rodney could already hear her breathing turn even."
      },
      {
        "paragraph": "Rodney whispered to Dani, “Kiddo, your mom is a pig. She fell asleep so soon…”"
      },
      {
        "paragraph": "Before he could finish his sentence, he was struck on the head with a pillow."
      },
      {
        "paragraph": "“You’re the pig! ” Freya criticized him in a huff."
      },
      {
        "paragraph": "Rodney was embarrassed. “Weren’t you already asleep?”"
      },
      {
        "paragraph": "“Maybe I’m not a pig, that’s why I can’t fall asleep so soon,” Freya mocked."
      },
      {
        "paragraph": "At that moment, Rodney was too afraid to say anything while Dani was just smiling in his arms."
      },
      {
        "paragraph": "Later, Freya fell into a slumber, but she was soon roused by the pain in her chest."
      },
      {
        "paragraph": "Her body was not producing milk. Her breasts were rock hard and hurt so much."
      },
      {
        "paragraph": "However, she did not dare move around since Dani was asleep and Rodney was lying beside her."
      },
      {
        "paragraph": "Some time later, she could sense that Rodney was slowly moving closer to her. She could feel her\nhands undoing her buttons."
      },
      {
        "paragraph": "Her heart raced."
      }
    ]
  },
  {
    "title": "Chapter 1858 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya seemed to know what Rodney was planning to do."
      },
      {
        "paragraph": "Her instinct told her to kick him away. However, after struggling between pain and shame, the pain\nturned out to be more intense."
      },
      {
        "paragraph": "Ultimately, she let him be. Nevertheless, her chest heaved so much that her body felt unusual."
      },
      {
        "paragraph": "Rodney secretly looked up and found her eyelashes fluttering under the moonlight."
      },
      {
        "paragraph": "Was she awake?"
      },
      {
        "paragraph": "She was not pushing him away despite being awake?"
      },
      {
        "paragraph": "After a thought entered his mind, Rodney came up with an idea."
      },
      {
        "paragraph": "He took a deep breath before approaching her and kissing her lips."
      },
      {
        "paragraph": "Freya’s heart began thumping at that moment. What did this mean?"
      },
      {
        "paragraph": "How dare he jump at the chance to secretly kiss her when she was asleep?!"
      },
      {
        "paragraph": "What should she do now? Should she wake up or continue to pretend to be asleep?"
      },
      {
        "paragraph": "Upon noticing that he was pushing his luck, Freya had no choice but to open her eyes and act as if she\nwas awakened by the noise. She gnashed her teeth and pounded on him. “Rodney Snow, what the hell\nare you doing in the middle of the night…”"
      },
      {
        "paragraph": "“Wifey, stop pretending.” Rodney grabbed both her wrists and said with a deep voice, “I knew you\nweren’t asleep. You were already awake just now…”"
      },
      {
        "paragraph": "Barn."
      },
      {
        "paragraph": "Freya was extremely shamefaced."
      },
      {
        "paragraph": "“No. I don’t understand what you’re saying.”"
      },
      {
        "paragraph": "“You’re acting opposite to your feelings.” Rodney had seen through her. When he saw her flushed face,\nhe felt a tingling sensation. “You can’t get rid of me just because you’ve exploited me. I want you to\ncompensate.”"
      },
      {
        "paragraph": "“Compensate…”"
      },
      {
        "paragraph": "Freya’s lips were locked once again."
      },
      {
        "paragraph": "Rodney kissed her until she felt weak. He then said, “Don’t wake Dani. It took me some time to put her\nto bed.”"
      },
      {
        "paragraph": "The second Freya glanced at Dani who was sleeping soundly, she did not dare to breathe hard."
      },
      {
        "paragraph": "Nevertheless, once she gave in, Rodney pushed his luck."
      },
      {
        "paragraph": "The next day."
      },
      {
        "paragraph": "She was awakened by the baby’s cries. She was alone in the bedroom."
      },
      {
        "paragraph": "Freya quickly carried Dani. However, the moment she caught sight of the hickeys on her skin, she\nwished the ground would swallow her up."
      },
      {
        "paragraph": "How wicked of Rodney!"
      },
      {
        "paragraph": "Although they did not make it to the last step, he had touched the parts where he should not have."
      },
      {
        "paragraph": "What irked her more was that she was actually aroused…"
      },
      {
        "paragraph": "Ahhh. She must stop thinking about it, or her head would explode."
      },
      {
        "paragraph": "After washing up, she had no choice but to put on a turtleneck sweater."
      },
      {
        "paragraph": "By the time she came out, Rodney was playing with Dani. When he raised his head and saw that her\nneck was covered, a trace of smugness flashed across his face."
      },
      {
        "paragraph": "“Wifey, you look good in this turtleneck sweater. ”"
      },
      {
        "paragraph": "Freya glared at him in embarrassment and headed downstairs without replying to him."
      },
      {
        "paragraph": "In the dining room, the sitter pointed at the breakfast and said smilingly, “Young Master Snow woke up\nearly this morning to prepare this meal.”"
      },
      {
        "paragraph": "The breakfast on the table was not as great as what she had during her confinement period. There\nwere only fruit juice, sweetcorn fritters, salad, boiled eggs, and meatballs."
      },
      {
        "paragraph": "If  this sort of breakfast  was served on any other day, Freya would not have commented on it. At the\nthought  that he interrupted  her sleep for a long time last night, she was unspeakably grumpy."
      },
      {
        "paragraph": "“This is all?” Freya purposely found fault with him. “They look unappetizing. I want to eat pasta and—”"
      },
      {
        "paragraph": "“Aren’t  you going on a diet?”  Rodney  interjected."
      },
      {
        "paragraph": "“What do you mean? Are you saying that I’m fat now?” His words hit a nerve in Freya. “Ha. I knew that\nyou despise me for being fat even though you"
      },
      {
        "paragraph": "said otherwise. Men are all liars.”"
      },
      {
        "paragraph": "In the face of her criticism, Rodney showed an innocent look. He really felt that women were\nunreasonable. “When you had breakfast in the Lynch family’s house before this, you were the one who\nkept complaining about the oily food. You said that you couldn’t go on a diet because of the food. I\nreferred to recipes this morning to prepare this meal for you. They may not taste great, but they’re all\nnutritious.”"
      }
    ]
  },
  {
    "title": "Chapter 1859 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "When Freya recalled it, she instantly felt ashamed. She did say that."
      },
      {
        "paragraph": "“Yeah, Young Master Snow personally made these chicken meatballs.” The sitter added, “ I wanted to\ncook pasta for Young Master Snow at first, but he said he’s afraid you’d be jealous if you saw him\neating such good food. Hence, he said he’d eat the same food as you.”"
      },
      {
        "paragraph": "Freya was at a loss for words."
      },
      {
        "paragraph": "The sitter’s words made Freya seem like she was being unreasonable."
      },
      {
        "paragraph": "Well, she was a woman. Women were meant to be unreasonable, right?"
      },
      {
        "paragraph": "“ If you don’t want to eat this, I’ll cook something else for you.” Rodney rose to his feet. “In fact, it\ndoesn’t matter to me how you look.”"
      },
      {
        "paragraph": "“Fine. I’ll eat this.”"
      },
      {
        "paragraph": "Freya picked up the glass of fruit juice and drank it reluctantly. “I still need to go on a diet.” Speechless,\nRodney watched her eat."
      },
      {
        "paragraph": "He felt that women were really phony."
      },
      {
        "paragraph": "No matter how phony she was, she was still far better than Sarah, though. At most, Freya was just\ninsistent on saving her dignity. On second thought, he found her quite cute."
      },
      {
        "paragraph": "Her behavior was akin to his, was it not? They were always set on preserving their dignity. Anyway, the\ntwo of them were pretty cute, and they had similar hobbies too."
      },
      {
        "paragraph": "After breakfast, Rodney pretended to scroll on his phone. “Hey, do you want to watch a movie tonight?\nLet’s watch it early and return home after that. There’s a new blockbuster movie and it’s quite a hit.”"
      },
      {
        "paragraph": "Freya was aware of the movie as it was being widely discussed online."
      },
      {
        "paragraph": "She was vaguely interested, but at the thought of Dani, she fought back her urge. “No way. We can’t go\nout together. If we’re both not around at night, Dani will be unused to it. Why don’t you watch the movie\ntonight and I’ll watch it tomorrow?”"
      },
      {
        "paragraph": "Rodney pulled a long face after hearing her words."
      },
      {
        "paragraph": "What a dumb*ss. How dare she call herself emotionally intelligent? Why would one watch a movie\nalone? It would only be romantic when both of them watched it together."
      },
      {
        "paragraph": "The sitter said with a smile, “Both of you can go together. Aunty Marie and I are around, so we can take\ncare of Dani. What’s more, when the two of"
      },
      {
        "paragraph": "you start working in the future, you won’t be able to stay by Dani’s side all the time.”"
      },
      {
        "paragraph": "“Exactly. If you’re still worried, I can ask my mom to come over at night. She enjoys looking after her\ngrandchildren the most,” Rodney promptly said,“ Besides, who should I watch the movie with? Given\nthat Chester needs to work and spend time with a bunch of women, he won’t be free to keep me\ncompany. What more Shaun, who’s more concerned about his wife than his friends? He won’t even eat\nwith me, let alone watch a movie with me. The rest are just fair-weather friends, so there’s no point\nasking them out. Come to think of it, I’m really lonely.”"
      },
      {
        "paragraph": "A hint of dejection crossed his handsome face."
      },
      {
        "paragraph": "Freya shuddered for a moment. This man suddenly became so melancholic that she could not help but\nhave goosebumps."
      },
      {
        "paragraph": "On second thought, it hit her that she did not have anyone to watch a movie with either. Eliza, the star,\ncould not possibly accompany her. On the other hand, Catherine had to look after her kids and Shaun,\nso she would not be able to make it too."
      },
      {
        "paragraph": "All of a sudden, she could understand Rodney’s feelings."
      },
      {
        "paragraph": "“ I’m going to buy the tickets now.” Upon noticing that she was silent, Rodney quickly booked the\ntickets. “ I’ll pick you up at 7:00 p.m. after work. ”"
      },
      {
        "paragraph": "“I…”"
      },
      {
        "paragraph": "“ I’ve bought the tickets. They’re not refundable, ” Rodney hurriedly added."
      },
      {
        "paragraph": "It was only when Freya left for work did it occur to her that she was going on a date with… Rodney."
      },
      {
        "paragraph": "The minute Freya left, Rodney swiftly drove to Chester’s house and dragged him out of his bed."
      },
      {
        "paragraph": "“Are you out of your mind? You’re waking me up when it’s only 10:00 a.m.”"
      },
      {
        "paragraph": "It seemed Chester had gotten up on the wrong side of the bed. He would have made Rodney’s life a\nthousand times more miserable if he were not his buddy."
      }
    ]
  },
  {
    "title": "Chapter 1860 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Tsk. Singles always sleep late and get up late, ” Rodney teased, “Bud, if you ask me, I think it’s time\nfor you to start a family.”"
      },
      {
        "paragraph": "“I’m not interested. ” Chester returned to his bed and sneered. “What’s the point of being stuck with a\nwoman forever? I’ll get bored of her.”"
      },
      {
        "paragraph": "“What a sc*mbag,” Rodney criticized."
      },
      {
        "paragraph": "“Although I’m an utter sc*mbag, those women are willing to throw themselves at me, ” Chester said\nindifferently, “Why are you looking for me?”"
      },
      {
        "paragraph": "“Oh, actually…” Rodney looked distressed. “I think I’m too good -looking for a man. Do you have any\nidea how to make me look less handsome?”"
      },
      {
        "paragraph": "Chester replied, “… Something’s wrong with you.”"
      },
      {
        "paragraph": "“I’m serious. Freya said that she’s jealous of my good looks. ” Rodney sighed. “She’s so jealous that\nshe can’t bring herself to treat me as a man.”"
      },
      {
        "paragraph": "Chester chuckled. “Indeed, you’re too good- looking. You often dress extravagantly and curl your hair\ntoo…”"
      },
      {
        "paragraph": "“Enough. My hair is naturally curly. I didn’t curl it on purpose. Also, what’s wrong with my clothes?"
      },
      {
        "paragraph": "Those male celebrities dress extravagantly too, don’t they? Yet so many women are into them.”\nRodney was annoyed. “Of course, those celebrities can’t compare to me when it comes to looks. I’ m\njust too good -looking. Why did my mom give me such good looks?”"
      },
      {
        "paragraph": "Speechless, Chester wondered why he was here to listen to Rodney’s exaggerations on such a lovely\nmorning."
      },
      {
        "paragraph": "“Chester, come up with a solution. I’m going on a date with Freya tonight.” Rodney tugged on Chester.\n“I’m planning to have a candlelight dinner with her. Then, we’ll watch a movie together. When we\nreturn… at night… hehe. You know it.”"
      },
      {
        "paragraph": "“… Are you sure you’ll succeed?” At the sight of Rodney who was hyped up, Chester did not know\nwhat to say."
      },
      {
        "paragraph": "“That’s why I need you to help me out. You’re most capable of dealing with women…”"
      },
      {
        "paragraph": "“You’ re overthinking it. I don’t normally pursue women. They’re the ones who come buttering me up.”\nChester lit a cigarette sluggishly."
      },
      {
        "paragraph": "“Oh, but haven’t you been pretty interested in Eliza’s affairs recently?”"
      },
      {
        "paragraph": "Chester glanced sideways at him. “All I want is to sleep with her.”"
      },
      {
        "paragraph": "“You’re really sc*mmy.” Rodney felt that it was unfair. Considering that his character was a lot better\nthan Chester’s, it was strange that he was not appreciated by women."
      },
      {
        "paragraph": "“Let’s go. I’ll get a makeup team to primp you up. ” Chester got up lazily."
      },
      {
        "paragraph": "At five-ish in the afternoon."
      },
      {
        "paragraph": "After Freya had a discussion with the president of a digital media company, the president invited her to\nhave dinner."
      },
      {
        "paragraph": "“I’m sorry, but I need to return home and accompany my child later.”"
      },
      {
        "paragraph": "Freya turned down the president’s offer tactfully.  He could not do anything about it."
      },
      {
        "paragraph": "When she took the elevator down, her new secretary, Charlene Cash, said with a grin, “ President\nLynch, your identity as the prime minister’s goddaughter is too special. Other business owners need to\nmove from pillar to post, yet you can easily have so many people come pleading with you to work with\nthem.”"
      },
      {
        "paragraph": "Freya thought so too."
      },
      {
        "paragraph": "It was true that she benefited greatly from her identity as Nathan’s goddaughter. Of course, it was also\ndue to her identity as the daughter-in-law of Snow Corporation’s chairman that she could dominate the\nbusiness industry."
      },
      {
        "paragraph": "With various kinds of resources coming to her, she could now understand the perks of having a\npowerful background."
      },
      {
        "paragraph": "Although God gave her an average marriage, he opened another window for her. She should be\ncontent. After all, having a perfect life was impossible."
      },
      {
        "paragraph": "Amid her messy thoughts, she suddenly heard some exclamations."
      },
      {
        "paragraph": "“Did the man step straight out of a comic book?”"
      }
    ]
  },
  {
    "title": "Chapter 1861 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya shifted her eyes to the man."
      },
      {
        "paragraph": "A chic, limited-edition white convertible was parked at the roadside. There was a young man inside,\nwho was wearing a white shirt beneath a linen vest. His curly black hair was parted with a ratio of four\nto six, while his fringe was blown up, exposing his forehead and exquisite eyebrows. He had pretty thin\nlips and a high nose bridge where a pair of black-rimmed glasses sat. With his outstanding presence,\nhe looked like a handsome and elegant young man who had just stepped right out of a comic book."
      },
      {
        "paragraph": "Even a woman like Freya who was used to seeing handsome men zoned out for a short moment."
      },
      {
        "paragraph": "Previously, she used to think that some male celebrities seemed alluring when wearing glasses."
      },
      {
        "paragraph": "Next to the man in front of her, however, those celebrities paled in comparison."
      },
      {
        "paragraph": "Nevertheless… This handsome man looked familiar. When the man noticed her gaze, he smiled\nsmugly."
      },
      {
        "paragraph": "He took a bouquet of pink roses from the rear seat. After that, he opened the car door and strode\ntoward Freya."
      },
      {
        "paragraph": "Under everyone’s admiring gazes, he approached her…"
      },
      {
        "paragraph": "As soon as he stopped in front of her, he handed her the roses. The scent filled her nose. “Wifey, here\nare 27 stalks of roses, which signifies my love for you.”"
      },
      {
        "paragraph": "The man fixed his eyes on her with a smile. His two charming dimples coupled with his familiar voice…"
      },
      {
        "paragraph": "Freya was dazed and shocked to the core."
      },
      {
        "paragraph": "It was no wonder she found him familiar. It turned out that it was… Rodney."
      },
      {
        "paragraph": "He had always dressed extravagantly before this. Now that he had suddenly changed his style, he\nlooked like a gentleman. Not only did he change his car and hairstyle but he had also put on a pair of\nglasses. Anyway, she was so fascinated by his handsome looks that her brain shorted out, which made\nher unable to react."
      },
      {
        "paragraph": "Coincidentally, it was time to get off work. As such, a crowd began to surround him."
      },
      {
        "paragraph": "“Sadly, this handsome man is already taken.”"
      },
      {
        "paragraph": "“He’s not only handsome but he’s also wealthy, fit, and tall. Look at his sports car. It’s a limited edition."
      },
      {
        "paragraph": "It costs hundreds of billions of dollars. Not everyone who’s rich can buy it.”"
      },
      {
        "paragraph": "“Oh, God. Why am I not that lucky? I admire that woman.”"
      },
      {
        "paragraph": "When Freya heard the chatter of the people around, she lifted her head and looked at the man who\nseemed to be drawn by a brush. Indeed, he resembled a prince that one would find in a comic book."
      },
      {
        "paragraph": "Her heart began to thump in spite of herself."
      },
      {
        "paragraph": "Women were fond of novelty. She had to admit that the sight of Rodney’s new appearance gave her a\ndifferent impression of him."
      },
      {
        "paragraph": "It felt as though her calm mind was becoming more and more flustered."
      },
      {
        "paragraph": "However, the moment she caught sight of someone recording them with their phone, she\nsubconsciously clutched Rodney’s hand and said in a deep voice, “Let’s leave this place.”"
      },
      {
        "paragraph": "After a short pause, she said to Charlene, “You can return first.”"
      },
      {
        "paragraph": "With that, she held Rodney’s hand and swiftly got in the car."
      },
      {
        "paragraph": "Rodney glanced at his hand that she had just held. He could still feel her warmth on his wrist."
      },
      {
        "paragraph": "Nevertheless, he had yet to give her the roses. “ Wifey, these roses…”"
      },
      {
        "paragraph": "Freya immediately snatched the flowers and used them to cover her face before she said in a low,\nmuffled voice, “Let’s go.”"
      },
      {
        "paragraph": "Rodney was slightly sulky. Women enjoyed keeping a high profile, did they not?"
      },
      {
        "paragraph": "He was under the impression that Freya would weep tears of joy, hug him warmly, and address him as\n‘Hubby’ after he showed up with the bouquet of roses."
      },
      {
        "paragraph": "He would have spun her happily…"
      },
      {
        "paragraph": "Ahem…"
      },
      {
        "paragraph": "His imagination was too good to be true."
      },
      {
        "paragraph": "After Rodney started the car and drove away, he was met with admiring stares along the street."
      },
      {
        "paragraph": "Freya whispered, “Can you close the roof? I don’t want those people outside staring at me.”"
      }
    ]
  },
  {
    "title": "Chapter 1862 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Alright.”"
      },
      {
        "paragraph": "Once Rodney pressed a switch, the roof of the convertible slowly closed."
      },
      {
        "paragraph": "Freya looked at the flowers in her hand. Judging from their fragrance, she was certain that they were\nimported by air."
      },
      {
        "paragraph": "The atmosphere in the car was bizarre. She awkwardly tucked her hair behind her ear and took a\nglimpse at the man beside her. He seemed strange from all angles. “What happened to you… Why did\nyou suddenly change your appearance?”"
      },
      {
        "paragraph": "“Didn’t you say that my good looks make women jealous? So I changed my style and wore darker\nclothes. ” Rodney instantly gazed at her with a note of nervous anticipation. “Do I look handsome?”"
      },
      {
        "paragraph": "If it had been another man who asked such a question, Freya would have come up with a lie and said\nthat his face was too big."
      },
      {
        "paragraph": "However, Rodney was really handsome today. What was more, his clothes were not as bright as\nbefore. All of a sudden, he seemed far more restrained and elegant."
      },
      {
        "paragraph": "Even so, she did not want Rodney to be complacent. “Not bad.”"
      },
      {
        "paragraph": "“That’s impossible.” Rodney curled his lips. “When I appeared just now, all the women outside were\nstaring at me, and so were you. Your eyes were completely fixed on me.”"
      },
      {
        "paragraph": "“Well, I was just shocked by your sudden change.” Freya looked away as she denied it."
      },
      {
        "paragraph": "“Women just like to say things they don’t mean. ” Rodney did not believe her."
      },
      {
        "paragraph": "Half an hour later, the car arrived at a Western restaurant."
      },
      {
        "paragraph": "The restaurant here had a membership system and the food was pricey. Usually, reservations needed\nto be made a couple of days in advance."
      },
      {
        "paragraph": "Freya entered the restaurant, only to find the interior decorated with flowers that were imported by air.\nThere was no one inside."
      },
      {
        "paragraph": "“Did you reserve this whole restaurant?” Freya blinked."
      },
      {
        "paragraph": "“Duh. Considering that it’s my first time officially going on a date with you, it’s a must to reserve the\nentire restaurant. ” Rodney pulled out the chair for her. “Darling, please take a seat.”"
      },
      {
        "paragraph": "Freya felt all jittery. She had only agreed to go to a movie with him, yet why did it turn out to be a\ncandlelight dinner?"
      },
      {
        "paragraph": "“Sir and Madam, this is our menu.”"
      },
      {
        "paragraph": "A server came over with a menu and darted an admiring look at Freya."
      },
      {
        "paragraph": "Freya lowered her head and flipped through the menu. “Which food takes the least time to be served?\nWe’re in a rush since we’re going to watch a movie later.”"
      },
      {
        "paragraph": "The server said with a smile, “Our chef is only serving the two of you tonight, so it’ll be very quick.”"
      },
      {
        "paragraph": "After ordering the dishes, Rodney rose to his feet. “ Please stay seated. I’m going to the restroom.”"
      },
      {
        "paragraph": "Freya let out a sigh. This atmosphere was making her feel rather nervous, especially since the man\nshe was here with was Rodney."
      },
      {
        "paragraph": "At this moment, Catherine sent her a WhatsApp message. [Not bad. It’s very romantic of Rodney.]"
      },
      {
        "paragraph": "Freya: [How did you find out? Was it Shaun who told you?]"
      },
      {
        "paragraph": "Catherine: [No. Someone took a video of Rodney coming in a sports car and giving you flowers. It has\ngarnered millions of views. See for yourself.]"
      },
      {
        "paragraph": "She soon forwarded a video. [A strikingly handsome man appeared at Yorkdale Center Building to\nconfess his feelings.]"
      },
      {
        "paragraph": "Freya tapped the video open and saw Rodney’s imposing physique that resembled the main character\nin a drama. Even his face was so handsome that she could not pick out any flaws."
      },
      {
        "paragraph": "The netizens had left comments on the video. [Oh, God. This young man has stolen my heart!] [Please\ndebut as a celebrity!]"
      },
      {
        "paragraph": "[Please, the Patek Philippe SA watch on his wrist costs as much as an apartment. Why would he debut\nas a celebrity when he’s already so wealthy?]"
      }
    ]
  },
  {
    "title": "Chapter 1863 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "[This young lady must have rescued the universe in her previous life to have such a handsome young\nlad pursuing her.]"
      },
      {
        "paragraph": "[Lad, why don’t you look for me? You don’t have to pursue me. I’ll be the one doing it.]"
      },
      {
        "paragraph": "[Lad, it’s getting colder. Let me sleep with you to provide you with some warmth. I promise not to\ncharge you at all…]"
      },
      {
        "paragraph": "The various comments on the internet surprised Freya."
      },
      {
        "paragraph": "Fine. She admitted that Rodney was good-looking. Even so, it seemed that women these days were far\nfrom restrained."
      },
      {
        "paragraph": "However, those comments were understandable. When she was obsessed with some celebrities back\nthen, she had left some shameless comments at the sight of handsome young men too."
      },
      {
        "paragraph": "If she had not known Rodney, she would have felt jealous as well after watching the video."
      },
      {
        "paragraph": "As the person involved in the matter, she could not help feeling a little… happy and smug."
      },
      {
        "paragraph": "Catherine sent her a message. [You’re very smug now, huh?]"
      },
      {
        "paragraph": "Others might not know Freya well, but Catherine, who had been her best friend for years, knew her\ninside out."
      },
      {
        "paragraph": "Freya: [Why should I be smug? I’ve gotten him, so there’s nothing special about it…]"
      },
      {
        "paragraph": "Catherine: [I’m just going to stay quiet and watch you bluff…]"
      },
      {
        "paragraph": "This left Freya blushing. Indeed, she was bluffing…"
      },
      {
        "paragraph": "At this moment, the melodious, relaxing music from a violin suddenly  rang out  in the restaurant."
      },
      {
        "paragraph": "It sounded quite pleasant, and the tune was familiar. Only after listening to it for a while could Freya\nrecognize  that it was  ‘A Whole  New World’."
      },
      {
        "paragraph": "She used to be familiar with this song when she was younger."
      },
      {
        "paragraph": "She recalled singing it with Patrick at a karaoke lounge back then."
      },
      {
        "paragraph": "However, it felt different now that it was being played on a violin. It was more relaxing. A man was\nsinging the romantic song with his elegantly soft voice."
      },
      {
        "paragraph": "She had no idea who was playing the violin."
      },
      {
        "paragraph": "She could not help but turn her eyes to the source of the music."
      },
      {
        "paragraph": "Under the dull lights, Rodney was wearing a vest and a pair of trousers with the violin resting on his\nshoulder. While holding the strings with one hand, he was giving a violin performance."
      },
      {
        "paragraph": "As he played the violin, his eyes were fixed on Freya. His alluring eyes behind his glasses sparkled like\nstars."
      },
      {
        "paragraph": "Freya froze."
      },
      {
        "paragraph": "To her, Rodney had always been a good-for- nothing rich man."
      },
      {
        "paragraph": "She had always thought that he was unromantic and dull."
      },
      {
        "paragraph": "Nevertheless, he was an outstanding rich man tonight."
      },
      {
        "paragraph": "She did not expect that he would be able to play the violin."
      },
      {
        "paragraph": "On second thought, a rich man like him would have learned all kinds of skills from a young person. His\nability to play the violin should be surprising."
      },
      {
        "paragraph": "She just had not seen this side of him before."
      },
      {
        "paragraph": "They said a talented man could capture one’s heart. She was no exception."
      },
      {
        "paragraph": "As soon as Rodney walked up to her, two servers pushed a cart with a heart-shaped cake on it. White\nchocolate was used to decorate the cake, and several words were written on it— ‘You’re my\nsweetheart’."
      }
    ]
  },
  {
    "title": "Chapter 1864 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "As Freya read those words, a wave of heat crept up her face."
      },
      {
        "paragraph": "Rodney… Why did he become so cheesy all of a sudden?"
      },
      {
        "paragraph": "After playing the violin, Rodney opened a rectangular box beside the cake and revealed a crescent\nnecklace embedded with melee diamonds. It was stunning and intricate."
      },
      {
        "paragraph": "Freya was quite a fashionista, so she could recognize that it was from a high-end luxury brand after\ntaking a glance at the logo on the box."
      },
      {
        "paragraph": "However, she had never seen this design in magazines before."
      },
      {
        "paragraph": "“ I… requested to have this customized.” Rodney was blushing. “ It’s meant to symbolize passionate\nlove. And there’s even your name engraved on it. Do you like it?”"
      },
      {
        "paragraph": "Complicated feelings flashed across Freya’s bright eyes."
      },
      {
        "paragraph": "The necklace was undoubtedly pretty and expensive. If the question was whether she liked it or not,\nshe definitely did."
      },
      {
        "paragraph": "No woman would not like this restaurant, a handsome guy, and an expensive gift."
      },
      {
        "paragraph": "However, she never thought that Rodney would plan all this for her."
      },
      {
        "paragraph": "He was a man who had often hurt her and quarreled with her."
      },
      {
        "paragraph": "Freya felt conflicted."
      },
      {
        "paragraph": "She, too, wanted a stable and sweet marriage. However, there were too many conflicts between her\nand Rodney. They would fight almost every day. She was unsure how long the harmony between them\ncould last."
      },
      {
        "paragraph": "The fact that he said he liked her made her confused."
      },
      {
        "paragraph": "She still could not understand which part of her was likable to him."
      },
      {
        "paragraph": "“Freya…”"
      },
      {
        "paragraph": "As Freya did not say anything, Rodney pressed his lips together. He said with a serious face, “Actually,\nwhen I proposed to you at the Snow family, I did that with the thought of spending the rest of my life\nwith you. Yes, we often fight, but… I don’t fight with you because I dislike you. Maybe we’re used to\ninteracting with each other through quarreling."
      },
      {
        "paragraph": "However, as a man, I shouldn’t fight with you over every matter. I should be accommodating. I want to\napologize to you for all the past issues. I’ll treat you and Dani well in the future. I really like you."
      },
      {
        "paragraph": "“I like the way you get angry, the way you smile, and the way you scold me."
      },
      {
        "paragraph": "“When you left after our fight at the Snow family that day, I felt like I had lost my soul. I didn’t have\nmuch of an appetite and I couldn’t sleep. My head was filled with thoughts of you. Actually… Maybe I\nalready had feelings for you a long time ago. It’s just that… I’m really dense about relationships. I hope\nyou can give me a chance to pamper you…"
      },
      {
        "paragraph": "“In the future, I’ll take care of the child, cook the meals, and give you money to spend. I’ll pamper you…\nlike a princess. I’ll treasure and love you, take care of you and protect you…”"
      },
      {
        "paragraph": "Toward the end, the blush on Rodney’s face grew a shade deeper."
      },
      {
        "paragraph": "Freya’s face flushed redder as she listened."
      },
      {
        "paragraph": "Maybe it was because she never expected Rodney to say such cheesy words."
      },
      {
        "paragraph": "Her heart was beating fast."
      },
      {
        "paragraph": "She even strangely thought that Rodney looked pretty cute when he was confessing."
      },
      {
        "paragraph": "“Your words may be touching now, but… who knows if you’ll go back on them?” Freya muttered and\nrolled her eyes at him."
      },
      {
        "paragraph": "To be honest, she did not want to divorce Rodney for Dani’s sake. It was just that their huge quarrel on\nthe day she gave birth and the baby’s one-month celebration had made her really uncomfortable about\ntheir current situation."
      },
      {
        "paragraph": "“No, I definitely won’t. If I ever make you unhappy in the future, just chase me out of the room. I\nguarantee I’ll own up to my mistakes.”"
      },
      {
        "paragraph": "Rodney inched closer to Freya. “Let me help you… put on a necklace.”"
      },
      {
        "paragraph": "Freya rolled her eyes at him, but she did not say a word or refuse."
      },
      {
        "paragraph": "Rodney was elated. He quickly bent over and put the necklace on her."
      },
      {
        "paragraph": "As Freya was lowering her head, she suddenly noticed that there was something in Rodney’s sleeve."
      },
      {
        "paragraph": "She took it out and had a look when he was not paying attention. Her face darkened in an instant."
      },
      {
        "paragraph": "“Freya, the necklace looks good on you…” When Rodney lowered his head and saw the little note in\nher hands, he felt as if a bomb had gone off in his head."
      },
      {
        "paragraph": "“Rodney Snow…” Freya spat out her words and glared at him with gritted teeth. “ Is this the love you\nhave for me? You even had to hide a note and secretly read from it to confess to me. Tell me, who\nwrote this for you?”"
      }
    ]
  },
  {
    "title": "Chapter 1865 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya was so furious that she slapped the note on his face."
      },
      {
        "paragraph": "No wonder the words he said just now sounded as if he suddenly had a realization."
      },
      {
        "paragraph": "She was almost touched. B*stard."
      },
      {
        "paragraph": "Rodney felt as if a basin of cold water was poured down on him. He also thought he was seeing a\nvolcano erupting in front of him."
      },
      {
        "paragraph": "He almost broke out in a cold sweat."
      },
      {
        "paragraph": "“No… It’s not like that. Let me explain…”"
      },
      {
        "paragraph": "“Don’t explain. ” Freya stood up. Disappointment filled her eyes. She did not know whether the\ndisappointment was directed toward Rodney or herself because she had felt the slightest bit of\nhappiness just now."
      },
      {
        "paragraph": "“You even needed to prepare a small note to confess to me. You don’t like me at all, so you have\ndifficulty expressing the feelings you have for me."
      },
      {
        "paragraph": "You didn’t write that note, right? Which love expert did you look for? It must  be Chester,  right? He\ndated so many women, so he must have quite some experience.”"
      },
      {
        "paragraph": "Rodney immediately cried out, “I’m being wronged.”"
      },
      {
        "paragraph": "“Do you dare to swear that you wrote it yourself?” Freya sneered and stared at him."
      },
      {
        "paragraph": "Rodney’s gaze faltered."
      },
      {
        "paragraph": "Freya pushed him away and turned around to leave. She did not even want to eat anymore."
      },
      {
        "paragraph": "“Hey, don’t go.” Rodney quickly went after her. “I admit that it was Chester who helped me write the\nnote, but the words represent my actual feelings. I didn’t ask him to write it for me with other intentions.\nI was scared I couldn’t speak well and you wouldn’t be touched…”"
      },
      {
        "paragraph": "“Did Chester also write a note for you when you proposed to Sarah in the past? ” Freya halted her\nsteps and asked angrily, “I reckon you didn’t need a note then, right?”"
      },
      {
        "paragraph": "Rodney said, “It indeed wasn’t…”"
      },
      {
        "paragraph": "“Enough. Since you know it yourself, then you surely understand how shallow is the love that you’re\ntalking about.”"
      },
      {
        "paragraph": "Freya was infuriated. She found it ridiculous as well. She was not lacking in any way, but she could not\neven beat Sarah. “If you had memorized the contents of the note and didn’t secretly place it in your\nsleeve, I wouldn’t be this angry. Since you want to woo me, please show some sincerity. You can’t\nplease a woman just by changing your clothes, your car, and playing the violin.”"
      },
      {
        "paragraph": "Rodney was frustrated. As Freya walked farther away, his anxiety grew."
      },
      {
        "paragraph": "“Freya, don’t go.”"
      },
      {
        "paragraph": "He pulled her back. He could clearly see the disappointment in her eyes. He felt that their relationship\nwould really end if she were to walk out of the door. “Actually, I remember all the contents. I was just\nafraid that I’d be too nervous in front of you…”"
      },
      {
        "paragraph": "“Don’t say anything more. I won’t believe you.”"
      },
      {
        "paragraph": "Freya was unable to push him away. In the end, she exploded. “Rodney Snow, I’m not a fool! You’re\njust trying to trick me into staying by saying you love me so that Dani will have a family. At the same\ntime, you can have me warm up your bed too. You’ve loved someone before, so you should know what\nlove is, right? What you had for Sarah was love. I’m just a suitable marriage partner to you, and I just\nhappen to be the biological mother of your child. You just can’t be bothered anymore. I understand that\nfeeling. Sometimes, I’m too lazy to be bothered too. As long as we have a harmonious relationship and\nyou stop hurting and agitating me, I can continue to be in a respectful marriage with you. However, you\ncan’t lie to me under the pretense of love.”"
      },
      {
        "paragraph": "“I didn’t. I admit that that was the situation when we got married at first. Since my parents liked you and\nyou were pregnant, I considered you as a suitable candidate for marriage…”"
      },
      {
        "paragraph": "Rodney felt regretful. He did not think that his plans for today would create such a huge\nmisunderstanding. “But I really like you now. People have feelings. After spending time with you every\nday, I like the feeling of having you in the house. If you’re not around, I’ll look for you everywhere. I like\nit when you, Dani, and I are together. I used to indulge in eating, drinking, and having fun in the past,\nbut I’m not interested in those things anymore with you and Dani next to me. “"
      },
      {
        "paragraph": "“Enough. I don’t want to listen.”"
      },
      {
        "paragraph": "Freya could not tell what was true and what was not."
      }
    ]
  },
  {
    "title": "Chapter 1866 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya had given her all in a relationship once, but she ended up being heavily wounded."
      },
      {
        "paragraph": "She did not dare to simply give out her heart anymore, especially when that person used to love\nanother woman for many years."
      },
      {
        "paragraph": "Rodney lowered his head and stared at her. He was at a loss."
      },
      {
        "paragraph": "Freya kept resisting and pushing him away. His head was in a mess."
      },
      {
        "paragraph": "It seemed that she would not believe in anything he said."
      },
      {
        "paragraph": "Rodney made a decision. He cupped her small face. “ Since you don’ t believe my words, I’ll prove it to\nyou with my actions.”"
      },
      {
        "paragraph": "After he spoke, he kissed her aggressively. Freya pushed him, annoyed."
      },
      {
        "paragraph": "Rodney pressed himself against her and forced her to take a few steps back until she was pressed\nagainst the wall. His kiss was hot and deep."
      },
      {
        "paragraph": "He had wanted to do this for a long time. However, Dani was beside them last night, so he kept holding\nit in."
      },
      {
        "paragraph": "Rodney’s heavy panting echoed in Freya’s ears. She was so embarrassed that she curled her toes."
      },
      {
        "paragraph": "They were in the restaurant. Although the whole place had been booked, there were still waiters\naround."
      },
      {
        "paragraph": "At that moment, the difference in the strength between a man and a woman was evident."
      },
      {
        "paragraph": "Freya could not even make Rodney budge. She even felt Rodney’s temperature rising."
      },
      {
        "paragraph": "When he was about to lose control, Rodney quickly grabbed the curtain beside them and wrapped it\naround them to form a confined space."
      },
      {
        "paragraph": "“Wifey, feel it for yourself. Is this not love?” Rodney’s body was pressed against Freya’s. She\nimmediately felt the difference in his body."
      },
      {
        "paragraph": "Freya did not have much experience with guys. She was flustered. “You… Stay away from me.”"
      },
      {
        "paragraph": "“We already have a child together. Why are you still so embarrassed?” Rodney placed his hands on\nboth sides of her head. His eyes were bloodshot. “"
      },
      {
        "paragraph": "Moreover… Besides you, I’ve never had another woman in my life. Although I pursued and dated\nSarah before, I was never… like this in front of her.”"
      },
      {
        "paragraph": "Freya wanted to ask what he meant by that."
      },
      {
        "paragraph": "However, looking at his gaze, it was as if she instantly became mute. She did not dare to believe it. “It\ncan’t be.”"
      },
      {
        "paragraph": "“Ah, I’d be a b*stard if I’m lying to you. It was my first time back in the hotel. You stole my virginity when\nI was in a blur. After that, I never had another woman. ” Rodney then thought of something. He simply\nleaned on her and did not move. “I don’t care. You have to take responsibility.”"
      },
      {
        "paragraph": "Freya was dumbfounded. She did not understand how things had developed in this direction. She was\nclearly furious and about to leave too."
      },
      {
        "paragraph": "“Oh please, it was my first time too…”"
      },
      {
        "paragraph": "“And I’m willing to be responsible.”  Rodney hugged her shamelessly. “So you have to be responsible\ntoo, okay? Learn from me. Actually, you think too highly of me. Do you think I’m a father who can\nsacrifice my lifelong happiness for a child?”"
      },
      {
        "paragraph": "“Although you love Dani, you’re not a mother who"
      },
      {
        "paragraph": "can compromise and sacrifice your happiness for the child too, right? Otherwise, you wouldn’t have\nargued for a divorce before.” Rodney pouted."
      },
      {
        "paragraph": "Freya glared at him."
      },
      {
        "paragraph": "“See? Both of us aren’t  that kind of people.” Rodney shrugged his shoulders and laughed. “ So don’t\nkeep saying that I’m making you stay under the pretense of love just to give Dani a perfect family. I’m\nnot that great of a father.”"
      }
    ]
  },
  {
    "title": "Chapter 1867 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya let out a hmph. “Then it’s because you want to have s*x with me.”"
      },
      {
        "paragraph": "Rodney raised his eyebrows. “With my status and body, it’s easy for me to sleep with pretty women, but\nI only want to have sex with you. What does that imply? It means that I sincerely love you. I don’t care\nabout other women.”"
      },
      {
        "paragraph": "Freya was stunned. She opened her mouth."
      },
      {
        "paragraph": "Rodney cut her off before she could speak. “Don’t think of me as a casual man either. If I were a casual\nman, I wouldn’t still have my virginity at such an age. You were the one who benefitted in the end.”"
      },
      {
        "paragraph": "“Didn’t you benefit from it as well?” Freya muttered."
      },
      {
        "paragraph": "However, after hearing Rodney’s analysis, she slightly wavered."
      },
      {
        "paragraph": "It was true that if he did not like her, there was no need for him to lie to her."
      },
      {
        "paragraph": "Rodney saw that Freya was not pushing him away anymore. He was delighted. He brazenly went\ncloser to her and pecked her lips several times. “ Besides… Why can’t I love you? You’re pretty,"
      },
      {
        "paragraph": "capable, and career-oriented. Although you have a sharp tongue like me sometimes, deep down, you\nhave a good heart. Isn’t it normal to fall in love with you…”"
      },
      {
        "paragraph": "She was enveloped in his breaths."
      },
      {
        "paragraph": "As Freya listened to him muttering while their lips were brushing past each other’s, she felt soft and\nsweet all over."
      },
      {
        "paragraph": "It seemed that… his words made sense. She was worthy of being loved."
      },
      {
        "paragraph": "However…"
      },
      {
        "paragraph": "Freya pushed him away slightly. “My mom always says that I’ m lazy and my house is messy. Do you\nlike that about me too?”"
      },
      {
        "paragraph": "“I’ve known you for more than a day or two. If I disliked those things about you, I would’ve talked to you\nabout it early on.” It was true that Rodney did not mind those things. “Moreover, what’s wrong with\nliking to eat and being lazy? I have a housekeeper. Why do I need you to do the chores? I’m not\nlooking for a housekeeper to marry anyway. You just have to live a happy life. You can dress up\nanytime you want to and buy whatever you want…”"
      },
      {
        "paragraph": "Freya’s heart felt increasingly sweet upon hearing that."
      },
      {
        "paragraph": "When Patrick and Mrs. Lynch criticized her before, she had thought to herself that she was not\nmarrying to be someone else’s housekeeper."
      },
      {
        "paragraph": "It was the first time that she realized Rodney was quite satisfactory in that aspect."
      },
      {
        "paragraph": "However…"
      },
      {
        "paragraph": "Freya lowered her head and rummaged through Rodney’s sleeves. She even went through his\npockets."
      },
      {
        "paragraph": "“What are you doing?”"
      },
      {
        "paragraph": "“You’re suddenly saying such nice words. I’m checking whether you’re hiding another note, ” Freya said\nin a low voice."
      },
      {
        "paragraph": "“Look for it, then. I most definitely don’t have one.” Rodney let Freya search all she wanted."
      },
      {
        "paragraph": "Freya could not find anything after searching for quite some time."
      },
      {
        "paragraph": "Rodney smiled. “Freya, everything I said just now is the truth. Previously when you lived in Brighton\nGardens, when did I not cook for you when I visited"
      },
      {
        "paragraph": "you? I really don’t mind all those things. I quite like cooking, and I like other people eating the food I\nmake. Besides, you’d finish everything up each time. It made me feel pretty satisfied.”"
      },
      {
        "paragraph": "Freya raised her head and gazed at him."
      },
      {
        "paragraph": "When Rodney said those words, his eyes, which were behind his glasses, were bright and happy."
      },
      {
        "paragraph": "Freya’s heart suddenly throbbed."
      },
      {
        "paragraph": "She felt even more touched compared to the way she felt when he drove a sports car earlier today and\nappeared before her eyes in a handsome outfit."
      },
      {
        "paragraph": "Actually, she had always remembered the scene of Rodney coming to her place for the first time and\ncooking for her despite it being a long time ago."
      },
      {
        "paragraph": "At that time, she had even told Catherine that Rodney was a decent guy apart from the fact that he\nwould become an idiot if it had anything to do with Sarah. It would be blissful to be loved by a guy like\nhim, but Sarah did not treasure him."
      },
      {
        "paragraph": "She did feel the slightest bit of attraction toward him and had some thoughts back then. However, due\nto the issue regarding Sarah and Thomas that happened afterward, she did not have those thoughts\nanymore."
      },
      {
        "paragraph": "“Don’ t look at me like that. Your eyes are so big, you’re like a seductive fairy. It’s tough for me\nwhenever you look at me like that.” Rodney’s heart itched terribly. When he lowered his head and was"
      },
      {
        "paragraph": "about to kiss her again, Freya blocked his lips."
      },
      {
        "paragraph": "“No. I’m hungry, I want to eat.”"
      }
    ]
  },
  {
    "title": "Chapter 1868 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“You’re not leaving anymore?” Rodney was glad. “ Then… I’ll go to the washroom. You can start eating\nfirst.”"
      },
      {
        "paragraph": "Freya glanced downward with her face flushed. Then, she walked away heartlessly."
      },
      {
        "paragraph": "Only after she returned to her seat did Rodney go to the washroom in discomfort."
      },
      {
        "paragraph": "By the time the food was served, Rodney was still not back yet. As such, Freya started eating first, but\nshe ate slowly."
      },
      {
        "paragraph": "Not long after, Rodney appeared again, well- dressed."
      },
      {
        "paragraph": "Freya glanced at him. “That was fast.”"
      },
      {
        "paragraph": "“Ahem… ” Rodney choked on water, and his whole face darkened a little. “Why don’t… we go back and\ntry it out tonight? Actually, I’m not that fast— Ow.”"
      },
      {
        "paragraph": "Before he could finish his sentence, Freya stepped on him hard."
      },
      {
        "paragraph": "“In your dreams. ” She smiled at him as she cut the steak."
      },
      {
        "paragraph": "Rodney felt as if she was cutting his flesh. However, he was not in a rush. He could take it slow. At\nleast he had taken the first step."
      },
      {
        "paragraph": "After having their Western meal, they went to a cinema nearby."
      },
      {
        "paragraph": "When they arrived, Rodney diligently bought some snacks, popcorn, and drinks before bringing her\ninside."
      },
      {
        "paragraph": "The cinema hall was quite huge. However, there were only two of them when the movie started."
      },
      {
        "paragraph": "Puzzled by the situation, Freya asked, “Isn’t this movie pretty popular? Why is there only the both of us\nhere?”"
      },
      {
        "paragraph": "“Oh. It’s because I bought the rest of the movie tickets,” Rodney said nonchalantly."
      },
      {
        "paragraph": "Freya glared at him speechlessly."
      },
      {
        "paragraph": "“They’ll just be third-wheelers, so there’s no need for them to be here,” Rodney explained confidently."
      },
      {
        "paragraph": "“It’s not the weekend, so there won’t be that many people in the first place. You’re wasting money.”"
      },
      {
        "paragraph": "Freya sighed. “Moreover, isn’t the atmosphere the main point of watching movies? If it’s just the both of\nus, we might as well just watch it in the theater room back at home.”"
      },
      {
        "paragraph": "“Yes, yes. My wife is right. I won’t spend money rashly in the future. I’ll seek your approval every time I\nspend.” Rodney was smiling from ear to ear. The way she said “you’re wasting money”  made her\nsound like a bossy wife, and he liked it a lot."
      },
      {
        "paragraph": "It turned out that having someone in charge of his money felt so good."
      },
      {
        "paragraph": "No wonder Shaun liked to be bossed around by his woman."
      },
      {
        "paragraph": "Freya wanted to tell him that was not what she meant. However, seeing Rodney being so self-\nconscious made the corners of her lips curl upward."
      },
      {
        "paragraph": "Besides, it felt pretty good to have Rodney suddenly kissing up to her."
      },
      {
        "paragraph": "It was as if she finally tamed the disobedient husky."
      },
      {
        "paragraph": "Especially during the movies, she finally did not have to twist the bottle caps open herself."
      },
      {
        "paragraph": "She also did not have to use her own hands to eat popcorn or tear the opening of a packet of snacks."
      },
      {
        "paragraph": "That feeling was pretty satisfying."
      },
      {
        "paragraph": "No wonder so many people liked to be in a romantic relationship."
      },
      {
        "paragraph": "Since she had not dated in a long time, she almost forgot how awesome it was to be in a relationship."
      },
      {
        "paragraph": "However, Rodney was too fidgety. He would be squeezing her hands in one moment, then coming near\nto kiss her in another. It was never-ending."
      },
      {
        "paragraph": "“Stop it. Can you please? I want to pay attention to the movie?”"
      },
      {
        "paragraph": "“Watch it, then. I’m not covering your eyes anyway.” Rodney pecked her cheek again. “Freya, I used to\nfind it boring when I watched movies with Shaun and the rest. But now, I realize that it’s quite fun. No\nwonder so many people like to watch movies.”"
      },
      {
        "paragraph": "“Haven’t you watched movies with Sarah before?” Freya asked."
      }
    ]
  },
  {
    "title": "Chapter 1869 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“ I have never. Why do you keep mentioning her?” Rodney blinked. “Whenever you bring her up, I feel\nlike I’ve had a fake relationship with her. I’ve never interacted with her the way I do with you.”"
      },
      {
        "paragraph": "“What way?” Freya raised her eyebrows."
      },
      {
        "paragraph": "In the dark cinema, Rodney began to blush. “I can’t put it in exact words. I only dated her for a short\ntime, and I was quite cautious when I was around her. However, I feel very relaxed when I’m with you. I\ncan do whatever I want.”"
      },
      {
        "paragraph": "Freya understood him."
      },
      {
        "paragraph": "It was the same when she was dating Patrick back then. Whenever they went to a movie, they always\nhad to bring Linda along."
      },
      {
        "paragraph": "She often saw other couples making out in the cinema at that time, but she and Patrick had never done\nthat before. Sometimes, when she wanted to kiss Patrick, Cindy would be at the side saying that she\ncould not open a bottle cap or that she wanted to eat popcorn."
      },
      {
        "paragraph": "Freya felt like she was an extra back then."
      },
      {
        "paragraph": "However, her situation might have been better than Rodney’s. Rodney must have treated and\nrespected Sarah as a goddess, but maybe that was precisely why he had never experienced the\npassionate relationship that many young men and women had. It was quite a pity."
      },
      {
        "paragraph": "Anyway, Freya and Rodney did have some similarities in some aspects."
      },
      {
        "paragraph": "Moreover, they were now in the phase of falling head over heels for each other."
      },
      {
        "paragraph": "Freya could finally experience it herself. Otherwise, she would always be envious of others."
      },
      {
        "paragraph": "When the movie ended, it was already 9:30 p.m."
      },
      {
        "paragraph": "Freya was in a hurry to go back home, but Rodney was not. “Don’ t worry. My mom is there  tonight.\nShe said Dani is behaving well,  and  she  doesn’t miss us at all.”"
      },
      {
        "paragraph": "“But I miss her.” Freya glared at the man beside her who was driving. “Dani is your daughter, but why\ndo I feel like you don’t care about her anymore?”"
      },
      {
        "paragraph": "Rodney widened his eyes from being wronged. “ Freya, although I know that you’re quite\nunreasonable, you can’t be too unreasonable, right?"
      },
      {
        "paragraph": "If I care about Dani, you’ll say that I’m only pretending to say I love you because of Dani. If I want to\nspend more time with you, you’ll say that I don’t care about Dani.”"
      },
      {
        "paragraph": "Freya harrumphed. “Women are just that unreasonable. Do you have a problem with it?”"
      },
      {
        "paragraph": "“I don’t dare to, ” Rodney muttered. “I just want the both of us to have more alone time together. This\nmeans that I love you as much as I love Dani.”"
      },
      {
        "paragraph": "A hint of a smile flashed in Freya’s eyes. Then, she glanced at the “paw” on her leg. “I think you’re just\ntrying to take advantage of me.”"
      },
      {
        "paragraph": "“I’ve never taken advantage of other women. My personal life is clean, ” Rodney said faintly."
      },
      {
        "paragraph": "Freya had nothing to say in regards to that point."
      },
      {
        "paragraph": "During her pregnancy and after she gave birth, she knew that other than going to the company,\n Rodney would be at home by her side."
      },
      {
        "paragraph": "Once they arrived at the villa and parked the car, Rodney held Freya’s hand."
      },
      {
        "paragraph": "However, Freya felt so embarrassed that she avoided him. “We’re already home. Let’s not hold hands.”"
      },
      {
        "paragraph": "“Why not? What’s wrong with holding hands?”"
      },
      {
        "paragraph": "Rodney was like glue. He always had to be in contact with her."
      },
      {
        "paragraph": "“Your mom is here…”"
      },
      {
        "paragraph": "“So what if she is? We’re a married couple. What’s there to be afraid of?” Both of them kept pushing\nand pulling until they reached the living room. Only then did they realize that Wendy was carrying Dani\nand looking at them with a smile. “You guys are back from your date?”"
      }
    ]
  },
  {
    "title": "Chapter 1870 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Freya’s face flushed red in an instant. After all, she recently had a huge fight with Rodney at the Snow\nfamily’s and wanted a divorce. Not much time had passed since then, and they were already holding\nhands again. It looked as if she was spineless."
      },
      {
        "paragraph": "However, she could not shake off Rodney’s hand at all."
      },
      {
        "paragraph": "“There’s no need to be shy. You even have a child together. ” Wendy was delighted. “I’ve been waiting\nfor this day for so long that I almost lost hope."
      },
      {
        "paragraph": "Luckily… You, Rodney, aren’t too stupid.”"
      },
      {
        "paragraph": "“Mom, I’ve always been smart, okay?” Rodney snorted."
      },
      {
        "paragraph": "“Ha! If you were smart, you wouldn’t have passed off a bad person as good back then. I’ve said long\nago that Freya is a good girl. This is good. Your dad and I can be rest assured now.”"
      },
      {
        "paragraph": "Wendy said earnestly to Freya, “If Rodney bullies you in any way, just tell us. I’ll help you to teach him\na lesson. If he dares to flirt and fool around outside, I’ll make him leave this marriage without any\nassets.”"
      },
      {
        "paragraph": "“Mom, am I even your son? I will never flirt and fool around outside.” Rodney pouted."
      },
      {
        "paragraph": "Wendy rolled her eyes at him. “Well, that’s true. I believe you’re  a person who knows your boundaries.\nTake a look at those wealthy families in Canberra. How many men are there who didn’t have an affair\nand an illegitimate child after their marriage? However, that has never happened in the Snow family.\nYour uncle, dad, and grandfather  are all loyal to their wives.”"
      },
      {
        "paragraph": "“I will be too.” Rodney looked at Freya and said with a serious face."
      },
      {
        "paragraph": "Freya’s long eyelashes trembled slightly."
      },
      {
        "paragraph": "This time, she did not push Rodney’s hand away."
      },
      {
        "paragraph": "Wendy smiled in satisfaction and said, “You two should go on more dates if you can. I’ll take care of\nDani for you. It just so happens that retiring has given me more time on my hands. Also, Rodney, you\nshouldn’t stay at home to accompany the child during the day all the time. Snow Corporation is\nplanning to spend a fortune on entering the electric power system industry. However, your sister has\ntoo many things to take care of at the company, so she can’t manage it. Your dad intends to leave the"
      },
      {
        "paragraph": "development of this plan to you and Carson. Do it well.”"
      },
      {
        "paragraph": "Astonishment washed over Rodney’s face. The field of the electric power system was the world’s most\ncompetitive industry."
      },
      {
        "paragraph": "Of course, its potential for development was infinite too. However, the former prime minister’s people\nkept oppressing Snow Corporation, hence they could not expand into that industry. Now, the whole\nworld had its eyes on it."
      },
      {
        "paragraph": "As long as he did well, it would be a chance to achieve greater heights in the future."
      },
      {
        "paragraph": "Wendy had a serious look on her face. “Your uncle plans to research and develop a technology that\nbelongs to us and can occupy a leading position in the world. Don’t let us down. The Snow family will\ngive you our full support as well.”"
      },
      {
        "paragraph": "Wendy’s bombshell of news made Rodney a little absent-minded as he carried the child to sleep that\nnight."
      },
      {
        "paragraph": "When Freya came out of the bath and saw that he was still in a daze, she teased him. “Why? Are you\ntoo excited?”"
      },
      {
        "paragraph": "“A little. My sister and Carson have always handled Snow Corporation’s matters. I thought I would"
      },
      {
        "paragraph": "never have the chance to take part.” Rodney suddenly sat up straight. “I never thought my dad would\nhand over such a huge project to me. Do you think… he finds me as the most capable younger\ngeneration of the Snow family? As expected, the development of Snow Corporation can’t be without\nme.”"
      },
      {
        "paragraph": "Freya rolled her eyes at him speechlessly. “Oh, please. Your mom said you’ll be working with Carson,\nokay?”"
      },
      {
        "paragraph": "“Ha, I’m Carson’s elder brother. Don’t I know how capable he is? In the end, he still has to count on\nme.” Rodney’s expression was smug."
      },
      {
        "paragraph": "“Do you need me to remind you that on the young billionaire ranking, Carson is leading you by ten\npositions?” Freya reminded him coldly."
      },
      {
        "paragraph": "“…Really? Do those kinds of stuff still exist? Why have I never seen it? It must be fake.”"
      },
      {
        "paragraph": "“Mm, it’s fake. Only those rankings with you as Australia’s wealthiest man are real.”"
      },
      {
        "paragraph": "Freya was about to sleep after kissing Dani’s little face."
      }
    ]
  },
  {
    "title": "Chapter 1871 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rodney felt attacked."
      },
      {
        "paragraph": "However, when he smelt the after-shower floral scent on her body, he began to feel antsy again."
      },
      {
        "paragraph": "What project? What World’s Top Wealthiest People ranking? Those were not as real as the woman in\nfront of him."
      },
      {
        "paragraph": "“Don’t worry. I’ll work hard to earn money  for you to  spend in the future. Of course,  I know you can\n earn your own money, but you can just save your money in the bank.”"
      },
      {
        "paragraph": "Rodney said those nice words and leaned over to try and kiss Freya’s little mouth."
      },
      {
        "paragraph": "However, before he could, Freya kicked him away. She blushed and said, “Dani is watching.”"
      },
      {
        "paragraph": "Rodney froze. Only then did he notice his daughter looking at him curiously with her wide eyes."
      },
      {
        "paragraph": "He felt his head hurt. His daughter was cute, but could she not go to bed earlier?"
      },
      {
        "paragraph": "“Honey, wait for me. I’ll tuck our little girl in. ” He hurriedly got up and paced around the house with his\ndaughter in his arms."
      },
      {
        "paragraph": "However, Dani was stubborn and only fell asleep after half an hour of coaxing. By then, Freya had\nalready fallen asleep."
      },
      {
        "paragraph": "He looked at her sleeping face with sweetness and annoyance. When would he have the chance to\ntake her to bed?"
      },
      {
        "paragraph": "Half  a month later, Freycatheli  officially launched."
      },
      {
        "paragraph": "Prior to this, several online celebrities from new media companies reviewed Freycatheli’s products.\nFreycatheli even used Eliza’s fame to stir up a small wave of hype, which spread the brand’s\nawareness."
      },
      {
        "paragraph": "On the day of the launch, the company lobby was filled with flowers sent from all sorts of industries.\nThe cosmetics group under Rodney, Osher Corporation, also forwarded an official congratulations to\nFreycatheli: [We warmly celebrate the official launch of the Freycatheli Makeup Brand.]"
      },
      {
        "paragraph": "Snow Corporation, Hill Corporation, Hudson Corporation, and Eliza also made similar posts."
      },
      {
        "paragraph": "Some companies that worked closely with these groups also followed immediately in order to curry\nfavor."
      },
      {
        "paragraph": "It instantly attracted the attention of the people in the industry, and someone soon found out that the\nthree founders of Freycatheli were ‘ Freya Lynch, Catherine Jones, and Eliza Robbins’."
      },
      {
        "paragraph": "Those three people were each a subject of talk themselves. Freya was Australia’s princess and had\nwon the title of the world’s most promising cosmetic chemist. Several cosmetics that she developed\nwere very popular all around the world."
      },
      {
        "paragraph": "Catherine made it into the top ten of the World’s Richest Youths ranking a few days ago. Apparently,\nher mother was the world’s richest woman, her stepfather was the world’s richest mysterious man, and\nher current lover was Shaun Hill, the former richest man."
      },
      {
        "paragraph": "Although Eliza’s status was not as good as the first two, she had more fans and was more well-known\nthan them."
      },
      {
        "paragraph": "When her fans learned that their idol had invested in a new company, tens of millions of fans surged\nonto the official website to splurge."
      },
      {
        "paragraph": "Seeing that the products that had just been launched were about to be sold out, Eliza made a post."
      },
      {
        "paragraph": "[Freycatheli has just launched these products online, so there isn’t much stock. I hope my fans will buy\nit rationally because they need it. If they don’t need it for the time being, then don’t waste money just to\nsupport me. I believe in my product, and I also hope that fans can give others a chance to try it out and\nlet them experience how amazing Freycatheli is. At the same time, I also hope that everyone who buys\nFreycatherli’s products in the future will genuinely do so because you believe the products are good.]"
      },
      {
        "paragraph": "The post immediately aroused the admiration of the outside world."
      },
      {
        "paragraph": "[Eliza really is a celebrity with a good conscience. Many stars start their own companies by using their\npopularity to recommend them and suck their fans’ money dry. I didn’t like or dislike her before, but I\nnow have a good impression of her.]"
      },
      {
        "paragraph": "[Eliza has always been like this. She personally tries out all the products that she endorses, and the\nfans who buy them also find them pretty good.]"
      }
    ]
  },
  {
    "title": "Chapter 1872 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "[I feel like Eliza is quite confident about the product, so they should be good. I heard that all of\nFreycatheli’s products were personally developed by Freya’s team. I’ve bought cosmetics developed by\nher before, and they’re all very good, so I’ll place an order and try them.]"
      },
      {
        "paragraph": "[Freya used to develop cosmetics, but who knows if she’s good at developing makeup products? I don’t\nbelieve it.]"
      },
      {
        "paragraph": "[It’s not that expensive anyway. Just give it a try.]"
      },
      {
        "paragraph": "[I heard that their makeup looks quite natural. Even if you use it, guys will think that you aren’t. Also, it\ndoesn’t fade and lasts for a long time, so I’m a little tempted.]"
      },
      {
        "paragraph": "The online discussion was in full swing. Unexpectedly, the company’s inventory sold out on the first day\nitself."
      },
      {
        "paragraph": "In the office, the secretary, Charlene said, “Our products are very good. As long as the people using\nthem like them, our popularity will rise. We have to urge the factories to speed up production and set up\nphysical stores in major shopping malls as soon as possible.”"
      },
      {
        "paragraph": "“I wanted to take it slow.” Freya sighed. “I was afraid that developing too fast would cause our\ncompetitors to try and push us away. I didn’t want to use our identities to raise Freycatheli’s popularity\ntoo.”"
      },
      {
        "paragraph": "Catherine smiled. “Well, there’s the good and the bad. Having competitors is proof that your products\nare doing well.”"
      },
      {
        "paragraph": "Eliza picked at her nails and said casually, “I didn’t want to make that post. But Rodney’s company\nmade a big deal out of it by sharing Freycatheli’s post, and someone found out our identities, so I had"
      },
      {
        "paragraph": "to stand up.”"
      },
      {
        "paragraph": "“Ugh, I already told him to stay out of my company’s business.” Freya sighed."
      },
      {
        "paragraph": "“It won’t be good for him to show no interest in his wife’s company either.” Catherine grinned and\nteased, “Even Snow Corporation shared the post. Tsk. It looks like your status as the  daughter-in- law\nis becoming more and more stable. Will you be giving birth to a son for the Snow family soon?”"
      },
      {
        "paragraph": "“Absolutely not.” Freya’s little face heated up at her words."
      },
      {
        "paragraph": "“You haven’ t slept together yet?” Catherine was shocked."
      },
      {
        "paragraph": "“That’s enough. Not everyone is like you and Shaun. You both only know how to have s*x every day.”\nFreya started to feel uncomfortable, especially with Eliza right beside them. “Cathy, I realized that\nyou’ve become really shameless recently.”"
      },
      {
        "paragraph": "Catherine was snubbed. Now that Freya mentioned it, that really did seem to be the case. However,\nshe was just led astray by Shaun. “Well… do you want  me to give you a few packs of condoms?\nShaun bought too much last time.”"
      },
      {
        "paragraph": "Freya gnashed her teeth.  “Thanks,  but no thanks.”"
      },
      {
        "paragraph": "Eliza cleared her throat.  “You guys go on. I have to go and shoot a commercial.”"
      },
      {
        "paragraph": "“Look, even Eliza is leaving.” Freya quickly held Eliza’s hand. “We’ll stop talking about this. Do you\nwant me to introduce you to someone? I recently attended the Snow family’s banquet and know many\n“No, I have no intention of dating or getting married.” Eliza interrupted her with a faint smile. “ I’m quite\nhappy like this.”"
      },
      {
        "paragraph": "“Being single has its perks, but it’s not that bad being in a relationship— ”"
      },
      {
        "paragraph": "Before Freya could finish, Catherine gave her an ambiguous look. “Looks like Rodney gave you pretty\ngood feelings recently.”"
      },
      {
        "paragraph": "“Well… It’s fine.”"
      },
      {
        "paragraph": "Freya had just said vaguely when the voice of an employee suddenly came from outside. “Young\nMaster Snow, Young Master Hill, why are you leaning on the door instead of going in?”"
      },
      {
        "paragraph": "The three women were speechless."
      },
      {
        "paragraph": "The outside was eerily quiet for a while before Freya rushed over to open the door."
      },
      {
        "paragraph": "Rodney took two steps back in panic, his handsome face slightly red. Behind him stood an\nexpressionless Shaun, and not far away was Chester with his hands in his trouser pockets and a vague\nsmile on his face."
      }
    ]
  },
  {
    "title": "Chapter 1873 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Even a blind person could figure out what this scene was."
      },
      {
        "paragraph": "Rodney must have been leaning on the door eavesdropping, and Shaun might have been doing the\nsame. Since Chester was standing so far away in a leisurely manner, he should be the only one\ninnocent."
      },
      {
        "paragraph": "It was very likely that they had heard the women’s bold exchanges inside."
      },
      {
        "paragraph": "Freya’s scalp immediately exploded, but she did not know whether it was from shame or anger."
      },
      {
        "paragraph": "“Rodney Snow…”"
      },
      {
        "paragraph": "“I didn’t hear anything. I’m innocent.” Rodney hurriedly shook his head and denied it."
      },
      {
        "paragraph": "Shaun rubbed his temples. Freya had not even said anything yet. Was Rodney not shooting himself in\nthe foot?"
      },
      {
        "paragraph": "Catherine smiled sweetly. “Young Master Snow, what are you innocent of? I’m confused.”"
      },
      {
        "paragraph": "Rodney was at a loss for words."
      },
      {
        "paragraph": "Well, now he knew what it meant to give himself away while concealing the truth."
      },
      {
        "paragraph": "“Wow, you eavesdropped on us.” Freya was so angry she greeted him with her small fist."
      },
      {
        "paragraph": "However, the woman’s fist did not fall on the man’s body with that much force."
      },
      {
        "paragraph": "Rodney also did not dare to dodge. As such, he could only take the beating like a punching bag."
      },
      {
        "paragraph": "“Cathy, I didn’t eavesdrop. ” Shaun went over and pulled Catherine’s hand with innocent eyes."
      },
      {
        "paragraph": "“Is that so?” Catherine smiled, but the words that left her red lips did not sound warm at all. “I don’t\nbelieve you.”"
      },
      {
        "paragraph": "Shaun fell silent before saying, “Actually, I don’t think I bought that much. There’s no need to give them\naway.”"
      },
      {
        "paragraph": "When she thought of the amount of those at home…"
      },
      {
        "paragraph": "No matter how thick-skinned she was, her face still flushed a little."
      },
      {
        "paragraph": "“And you said you didn’t eavesdrop? You clearly heard everything.” Catherine also pinched the flesh on\nhis waist mercilessly."
      },
      {
        "paragraph": "“Shaun, you’re so petty.” Rodney scolded from the side. “Be careful you don’t die of exhaustion in bed.”"
      },
      {
        "paragraph": "“ I won’t. I’m not like you, who doesn’t even have the chance to die of exhaustion,” Shaun retorted."
      },
      {
        "paragraph": "Rodney seemed deeply insulted, and the atmosphere instantly turned icy."
      },
      {
        "paragraph": "“You guys better watch yourselves.” Catherine did not want to stay as she felt that it was too humiliating\nto argue over such things. She said her goodbyes to Eliza and Freya and left with her bags."
      },
      {
        "paragraph": "“Babe…”"
      },
      {
        "paragraph": "Shaun hurriedly followed after Catherine."
      },
      {
        "paragraph": "“I’m leaving too. I’ll call you when I have time. ” Eliza did not have a good impression of Rodney and\nChester, and she did not want to get acquainted with them either. Hence, she left quietly."
      },
      {
        "paragraph": "Chester’s eyes glinted, and he waved his hand at Rodney. “You guys can continue.”"
      },
      {
        "paragraph": "Then, he left as well."
      },
      {
        "paragraph": "Freya frowned. “Is he planning to pester Eliza? What is he thinking…”"
      },
      {
        "paragraph": "She tried to chase after him, but Rodney grabbed her arm. “Don’t go. Chester is a bigshot in the\nentertainment industry. Since your brand just launched, you still need to cooperate with many\nbusinesses and companies under him in order to stabilize your foundation. It’s not wise to offend him.”"
      }
    ]
  },
  {
    "title": "Chapter 1874 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“So what if I offend him? Is my friend less important than a company?” Freya snorted. “ Besides, you’re\nmy husband. Don’t you know how to help me?”"
      },
      {
        "paragraph": "“Well… I can only get Chester to help you. Even if you go to my parents or my uncle, they can’t do\nanything, ” Rodney explained helplessly. “The Jewell family is involved in too many fields."
      },
      {
        "paragraph": "Whether it’s in the medical or entertainment industry, no one can touch their territories. In the first half\nof the year, there was a listed company that offended Chester. With just his word, no media company\nhas dared to cooperate in commercials"
      },
      {
        "paragraph": "with that company ever since. Now, that company is dying silently.”"
      },
      {
        "paragraph": "Freya was silent."
      },
      {
        "paragraph": "Fine. Compared to a big boss like Chester, she was just a little rookie. However, Eliza was in the\nentertainment circle, so it would be unlucky for her to offend Chester."
      },
      {
        "paragraph": "Sigh, she was a little worried about Eliza."
      },
      {
        "paragraph": "“Honey…” Rodney suddenly hooked her little finger to his and looked at her ambiguously. He\nwhispered. “Shall… we try…”"
      },
      {
        "paragraph": "“Try what? Go back. I have to work.” Freya pretended not to understand and walked into her office with\nher heart racing."
      },
      {
        "paragraph": "Rodney closed the door and shamelessly went up to grab her hand. “You know what I’m talking about.\nLook, Cathy is your best friend, yet she never gets tired of doing that. This means that it’s really good"
      },
      {
        "paragraph": "“Or maybe it’s because Shaun is good. You’re not necessarily better than him.” Freya became so\nflustered  that  she interrupted him with annoyance."
      },
      {
        "paragraph": "Rodney’s handsome face darkened. “Freya, you’re questioning my ability by saying that. This is a great\ninsult to a man. If I don’t prove it to you tonight, I can’t say I’m a man.”"
      },
      {
        "paragraph": "Freya’s scalp tingled when she saw how serious he looked."
      },
      {
        "paragraph": "Great. She seemed to have aggravated him. “You misunderstood my meaning. I—”"
      },
      {
        "paragraph": "Rodney interrupted her. “How would you know if Shaun was good at it from the start? He’s been with"
      },
      {
        "paragraph": "Catherine for so long, so I’m sure he slowly improved on it. But what about me? You’ve never even\ngiven me a chance. Poor me. I’m already in my thirties, but I’m still an old virgin…”"
      },
      {
        "paragraph": "His words at the start were just to arouse her sympathy, but after actually voicing them, his heart truly\nfelt sour. “I have a wife, but I can’t even touch her. I’ve really failed as a man.”"
      },
      {
        "paragraph": "Freya was speechless to hear his pitiful voice. “If you’re an old virgin, where did the child come from?”"
      },
      {
        "paragraph": "“Freya, my first time was when I was drunk and confused. I barely remember anything about it. What’s\nthe difference between that and being an old virgin?” Rodney pouted. “You don’t know this, but Chester\nand Shaun always laugh at me in secret because of this.”"
      },
      {
        "paragraph": "“Then you can keep it to yourself, ” Freya snapped. “Do you talk about our private life everywhere you\ngo?”"
      },
      {
        "paragraph": "“Do I need to? Other people just have to look at me to know.” Rodney pointed at his beautiful face and\nsaid, “Look, it has the words ‘a man who isn’t nourished by a certain life’ written on it.”"
      },
      {
        "paragraph": "Freya rolled her eyes at him."
      },
      {
        "paragraph": "In fact, she was a little troubled."
      },
      {
        "paragraph": "She was actually not averse to sleeping with Rodney. She was just not ready mentally."
      },
      {
        "paragraph": "Besides… She was embarrassed. There was no need to say stuff like that out loud either. If they got\ninto the mood and things progressed naturally,  she would not push him away."
      },
      {
        "paragraph": "However, Rodney was a fool who did not understand women’s thoughts."
      },
      {
        "paragraph": "When they were alone, he got handsy a lot with her. Yet every time they went a step further and she\nsaid ‘don’t’ shyly, he would immediately stop."
      },
      {
        "paragraph": "This kind of man was the opposite of cunning."
      },
      {
        "paragraph": "“ Stop talking about that and go already. I have to call the factory. All the goods sold out today, so I\nhave to inform the other side to hurry up with the production. I have a meeting later too.” Freya stopped\nlooking at him and lowered her head to pick up her phone to call her subordinates."
      },
      {
        "paragraph": "Rodney sighed in disappointment and did not dare to disturb her. “Then I’ll walk around downstairs.\nCall me when you’re done. I’ll take you home.”"
      },
      {
        "paragraph": "“Aren’t you busy with the company today?” Freya asked suspiciously."
      }
    ]
  },
  {
    "title": "Chapter 1875 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "A little touched, Freya said in a low voice, “I have a celebration party tonight. Why don’t you come with\nme?”"
      },
      {
        "paragraph": "“Sure.”"
      },
      {
        "paragraph": "Rodney’s eyes brightened as he nodded."
      },
      {
        "paragraph": "Downstairs."
      },
      {
        "paragraph": "Eliza called the driver, but he said that there was traffic congestion, and it would take more than ten\nminutes before he arrived. As such, she had to wait for a while."
      },
      {
        "paragraph": "After she put down the phone, a tall body suddenly loomed down on her from behind, and Chester’s\nlazy voice sounded overhead. “Where are you going? I’ll send you there.”"
      },
      {
        "paragraph": "“There’s no need to trouble you, President Jewell. The driver will be here soon.” Eliza took an\nimperceptible step back and refused politely."
      },
      {
        "paragraph": "Chester looked at her playfully. She was wearing a white knitted sweater today with blue jeans, making\nher look very simple and casual, unlike those female celebrities he met before. They always dressed\nup as if they were attending a reception, and although they did look good, they were as boring as\nporcelain. However, Eliza was different. She was tall, her temperament was good, and she had a\nbeautiful face. Everything she wore brought out her luminous temperament as a star."
      },
      {
        "paragraph": "“Eliza, how many times have you rejected me?” Chester put one of his hands in his pockets. His\nhandsome face was wicked yet charming. “There’s a limit to my patience.”"
      },
      {
        "paragraph": "“President Jewell, I really have no intention to date, ” Eliza said politely. “I just want to focus on my job.”"
      },
      {
        "paragraph": "“I know. ” Chester took out a lighter and cigarette case. “You don’t want to date or get married.”"
      },
      {
        "paragraph": "Eliza’s expression changed slightly. That was what she said upstairs. She thought that only Rodney\nand Shaun were eavesdropping, but it turned out that he heard them too. “I didn’t know that a person\nwith such a prominent status like President Jewell would also eavesdrop at the door.”"
      },
      {
        "paragraph": "“Don’t Rodney and Shaun have prominent statuses too? They eavesdropped as well. ” Chester looked\nat her with a vague smile. “But it is the first time I’ve done such a thing. Maybe it’s because I want to\nknow what you’re thinking.”"
      },
      {
        "paragraph": "Eliza was silent for a moment. “Those are my true thoughts.”"
      },
      {
        "paragraph": "Chester nodded. “That’s good. I also don’ t really like dating or getting married, so we’re quite like –\nminded. However, I have needs. If you let me sleep with you, we can be friends with benefits.”"
      },
      {
        "paragraph": "“ Sorry, but I’m afraid of getting a disease, ” Eliza said mockingly."
      },
      {
        "paragraph": "Chester did not get angry either. Perhaps it was because he had gotten angry at her too many times,\nso his tolerance was much better  now.  “Don’t worry. I’m a doctor. I might actually be more attentive in\nthis aspect than you. If it really bothers you, I can have a physical examination report done for you.”"
      },
      {
        "paragraph": "Suddenly faced with such a patient Chester, Eliza could not help but look up at his handsome face."
      },
      {
        "paragraph": "It was true. The more she interacted with him in this body, the more he disgusted her."
      },
      {
        "paragraph": "Chester lowered his head to look at her. Her eyes were calm and cold."
      },
      {
        "paragraph": "He was amazed. He had met countless  women  in the past, but he just could not understand Eliza."
      },
      {
        "paragraph": "Undeniably, the more she refused him, the more curious he became."
      },
      {
        "paragraph": "“Be a good girl, and let me sleep with you, Eliza. Maybe I’ll find out that you’re nothing much.” Chester\ngently puffed out smoke on her cheek. “ Why are you doing this? It’s not like you haven’ t slept with\nanyone before.”"
      },
      {
        "paragraph": "Eliza smiled, but the light in her eyes turned cold. “ Maybe… It’s because I’ve slept with someone\nbefore, so I know it doesn’t feel good to be toyed with by young tycoons like you. After all, I’m not for\nsale.” “It’s not as if you haven’t sold yourself before.” Chester retorted. His lips were beautiful, but the\nwords that came out from them were so cold and horrible."
      }
    ]
  },
  {
    "title": "Chapter 1876 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“You’re wrong. I didn’t sell myself to him. I did it because I liked him.” Even if she was not the real Eliza,\nEliza was still her friend. She would not allow anyone to humiliate her. “I fell in love with a love rat but\nwas cheated, so I changed.”"
      },
      {
        "paragraph": "“Only you think that way. The other party might not agree.” Chester smiled faintly. “Eliza, you know I\nwon’t be reconciled if I don’t try you. After all, you’ve successfully aroused my interest. Usually, I’ll get\ntired of someone after sleeping with them a few times.”"
      },
      {
        "paragraph": "“Who knows? What if you end up getting addicted instead? I don’t have a hobby of being a lover.”"
      },
      {
        "paragraph": "Eliza paused and enunciated her words as she said, “ And I don’t have a hobby of sleeping with a\nperson my best friend slept with before either. Even if you’re not disgusted, I am.”"
      },
      {
        "paragraph": "Chester’s face changed slightly. “Will you die if you don’t bring Charity up?”"
      },
      {
        "paragraph": "“She’s very important to me.” Eliza closed her eyes. “She’s dead, but she was innocent and wrongly"
      },
      {
        "paragraph": "accused. You can’t wash your hands off this matter. Young Master Jewell, I don’t expect you to feel\nregret, but don’t you have a shred of humanity?"
      },
      {
        "paragraph": "You’re the cause of her death, so the least you could do is not hurt her friends.”"
      },
      {
        "paragraph": "“Shut up.”"
      },
      {
        "paragraph": "She seemed to have struck a nerve in him."
      },
      {
        "paragraph": "Chester pinched her chin fiercely, his eyes cold. “ Who told you all that?”"
      },
      {
        "paragraph": "“Everyone knows about it. Charity’s case is well known among the police. Anyone can find out just by\nasking a little.” Eliza looked up and smiled. “ Young Master Jewell, it was your lawyer who took the\nlawsuit. Do you still remember the despair in her eyes when she was taken away?”"
      },
      {
        "paragraph": "Chester’s heart trembled, and he pushed her away.“"
      },
      {
        "paragraph": "Get lost.”"
      },
      {
        "paragraph": "Eliza immediately left without waiting for the car."
      },
      {
        "paragraph": "Chester stood on the spot and took drags of his cigarette. Soon, his face was covered in smoke."
      },
      {
        "paragraph": "Sometimes, thinking about that woman was like being in hell."
      },
      {
        "paragraph": "He often dreamt of Charity in the middle of the night. She trembled in hell, saying, “Chester Jewell,"
      },
      {
        "paragraph": "why aren’t you coming down? Quick, come down and accompany me.”"
      },
      {
        "paragraph": "Hah. In that case, he did not mind being the devil and dragging everyone to hell."
      },
      {
        "paragraph": "He was a cold-blooded and heartless devil anyway."
      },
      {
        "paragraph": "“Chester, what are you standing here for?” Rodney came out of the elevator and was slightly surprised\nwhen he saw such a desolate Chester."
      },
      {
        "paragraph": "He went up and patted Chester on the shoulder. “ Did you chase after Eliza?”"
      },
      {
        "paragraph": "Chester did not speak and took a fierce drag from the cigarette."
      },
      {
        "paragraph": "“Chester, look at you. I think you really need to find yourself a girlfriend. ” Rodney stared at him. “But\nEliza might not suit you. She’s Catherine and Freya’s good friend. If you play with her, Shaun and I will\nbe the ones who end up suffering. Why don’t you change your target?”"
      },
      {
        "paragraph": "“Do you still remember Charity Neeson?” Chester suddenly asked."
      },
      {
        "paragraph": "Rodney froze. He fell silent and felt slightly guilty. “ That’s not entirely your fault. We all had a part in it.\nEven me…”"
      },
      {
        "paragraph": "“Yes, we all had a part in it, but you two were different from me. I personally sent her to jail.” After\nChester finished speaking, he lifted his long legs, got into the car, and left."
      },
      {
        "paragraph": "Rodney stood in place for a long time. It was not a good feeling."
      },
      {
        "paragraph": "Even if he felt guilty and wanted to atone, the Neeson family was gone, and Charity was dead. They\ncould not even find her bones. There was no chance for atonement anymore."
      }
    ]
  },
  {
    "title": "Chapter 1877 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "In the van."
      },
      {
        "paragraph": "Eliza closed her eyes and leaned back on the leather seat. The conversation with Chester earlier made\nher feel as sick as if she had eaten flies."
      },
      {
        "paragraph": "Hah. He told her to get lost, so he must have gotten angry from embarrassment."
      },
      {
        "paragraph": "However, she did not think that Chester felt guilty for her death. That person was cold-hearted and\ncold-blooded."
      },
      {
        "paragraph": "Charity, who once carefully reminisced about that relationship, was probably the dirtiest existence in his\neyes."
      },
      {
        "paragraph": "To her, Chester and Sarah were the same. They were both people she shared a death feud with."
      },
      {
        "paragraph": "However, Chester was too powerful, so it was simply impossible for her to shake him with her ability.\nShe was just unreconciled."
      },
      {
        "paragraph": "All of a sudden, her phone rang. She looked at it and placed it by her ear."
      },
      {
        "paragraph": "“Ms. Robbins, Sarah Neeson has appeared.” Eliza sat up. “Where?”"
      },
      {
        "paragraph": "“At the airport.” The person said with chagrin, “"
      },
      {
        "paragraph": "But after we followed her, we found out that she got a body double and managed to slip away.”"
      },
      {
        "paragraph": "Eliza frowned in disappointment."
      },
      {
        "paragraph": "Catherine and Shaun’s men were probably looking for Sarah in this critical period, so it was normal for\nSarah to be cautious. However, it seemed like Sarah had indeed fled abroad. Logically speaking, she\nshould be hiding after the fall of Wesley,  but  why did she come back?"
      },
      {
        "paragraph": "Eliza pondered."
      },
      {
        "paragraph": "She had a hunch that Sarah must have an objective. “Find her as soon as possible no matter what.”"
      },
      {
        "paragraph": "“I’m afraid… it’ll take some time, ” the person said. “After we seized her double, we realized that she\nseemed hypnotized. She said that she only met Sarah at the airport and doesn’t remember what Sarah\ndid. By the time she came back to her senses, she was at Canberra Airport. She didn’t even know why\nshe was wearing clothes similar to Sarah’s.”"
      },
      {
        "paragraph": "“That’s terrifying.” Eliza shuddered."
      },
      {
        "paragraph": "It was just like that year when Jennifer Craven fell to her death in the washroom for no apparent reason\nafter she met Sarah."
      },
      {
        "paragraph": "It seemed like after all these years, Sarah had become even better at this."
      },
      {
        "paragraph": "“Yes. I wonder where she learned such horrid skills from.”"
      },
      {
        "paragraph": "“Find her as soon as possible.”"
      },
      {
        "paragraph": "Eliza rubbed her brows. This time, she would make Sarah pay in blood."
      },
      {
        "paragraph": "At night."
      },
      {
        "paragraph": "A five -star hotel was holding a celebration banquet."
      },
      {
        "paragraph": "The banquet was attended not only by the company employees but also by many partners. Even\nJessica and Carson Snow from the Snow family showed up in a dignified manner."
      },
      {
        "paragraph": "Once those two appeared, they were instantly surrounded by many bosses."
      },
      {
        "paragraph": "This was especially true for Jessica since she was Snow Corporation’s president. It was rare to see\nsomeone like her."
      },
      {
        "paragraph": "Ryan eventually arrived too. As the prime minister’s son, he instantly caused a sensation when he\nappeared."
      },
      {
        "paragraph": "“I didn’t expect Ryan Snow to come too. It looks like although Freya Lynch is the prime minister’s\ngoddaughter, she’s quite important to the prime minister.”"
      },
      {
        "paragraph": "“Of course. I thought those two siblings would be at odds, but it looks like they get along very well.”"
      },
      {
        "paragraph": "“We have to cooperate more with Freya in the future. It doesn’t matter if we make less money, but we\ncan’t offend her.”"
      },
      {
        "paragraph": "The guests whispered to each other."
      },
      {
        "paragraph": "Having heard them, Freya walked towards Ryan, feeling touched. “You didn’t have to come. It’s just a\nsmall celebration party.”"
      }
    ]
  },
  {
    "title": "Chapter 1878 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“That’s different. I have to support you.” Ryan beamed with affection in his eyes."
      },
      {
        "paragraph": "Rodney became really unhappy when he saw this and subconsciously held Freya’s waist, asserting his\ndominance. “ No need. With me as her husband, I can hold up the sky for her.”"
      },
      {
        "paragraph": "Ryan glanced at the hand on her waist and smiled at her. “What I mean is… I’ll always be your\nsupporter. If Rodney bullies you in the future, I won’t let him."
      },
      {
        "paragraph": "Freya was very touched."
      },
      {
        "paragraph": "Rodney said angrily, “Ryan Snow, stop talking nonsense. Why would I bully her? She’s my wife. I’ll love\nher, of course.”"
      },
      {
        "paragraph": "“Who knows?” Ryan raised his eyebrows. “Watch your words. If you don’t know how to speak, then\nmove aside. ” Rodney looked at him in disgust."
      },
      {
        "paragraph": "“ I think you’ re the one who needs to watch your words.” Freya rolled her eyes at Rodney. “Ryan came\nhere to congratulate me, yet you? Why are you always targeting him? Go stand in the corner.”"
      },
      {
        "paragraph": "“You want me to stand in the corner?” Rodney was shocked, disappointed, and upset all at the same\ntime. “I’m your husband.”"
      },
      {
        "paragraph": "“And he’s my younger brother.” “You just acknowledge him…”"
      },
      {
        "paragraph": "“I already consider him family, ” Freya said very firmly."
      },
      {
        "paragraph": "Rodney was very displeased, especially when he saw Ryan’s gloating expression. He gnashed his\nteeth and said, “Did you hear that? You’re just family."
      },
      {
        "paragraph": "I’m her lover.”"
      },
      {
        "paragraph": "“Rodney, what’s that supposed to mean? I don’t want to be her lover, ” Ryan said innocently. “Can you\nnot think of us in such a lewd way?”"
      },
      {
        "paragraph": "“You’re nuts.” Freya also felt that Rodney’s thoughts were lewd, so she glared at Rodney and pulled\nRyan away."
      },
      {
        "paragraph": "Rodney was furious at being left behind. Ryan was a cunning fox who was clearly eyeing Freya\ncovetously. Yet, he was still pretending to be a pure and innocent younger brother. How shameless."
      },
      {
        "paragraph": "No, he could not let them be alone for too long."
      },
      {
        "paragraph": "Fortunately, Ryan’s identity was not ordinary. Soon, someone came over to toast him on the pretense\nof congratulating Freya."
      },
      {
        "paragraph": "“President Lynch, congratulations. Oh, this must be Senator Snow. You truly are young and talented. I\ndidn’t expect to have the privilege to meet you today. I propose a toast to both of you…”"
      },
      {
        "paragraph": "“My wife can’t drink. I’ll drink for her.” Rodney hurriedly leaned in and took Freya’s glass."
      },
      {
        "paragraph": "Remembering that she had to nurse Dani later, Freya just let him take it."
      },
      {
        "paragraph": "“Young Master Snow really dotes on his wife, ” the man said with a smile."
      },
      {
        "paragraph": "“Naturally. Since she wants to start her business, I’ll support her. With Freya’s talent, working as a\ncosmetic chemist for another company will only bury her talent.” Rodney heaped praises on her."
      },
      {
        "paragraph": "Freya shot him a complicated look while Ryan took a sip of red wine with a smile on his face."
      },
      {
        "paragraph": "The subsequent toasts from guests who came over were all taken by Rodney."
      },
      {
        "paragraph": "Even if he had high alcohol tolerance, he was still drunk after all that drinking."
      },
      {
        "paragraph": "After the celebration banquet, Ryan and Carson helped to take Rodney to the car."
      },
      {
        "paragraph": "“Freya, do you really not need my help with sending him home?” Carson was worried."
      },
      {
        "paragraph": "“ It’s fine.” Freya smiled. “You both should head back early and get some rest. If I really can’t hold him,\nI’ll ask the doorman for help.”"
      },
      {
        "paragraph": "“Be careful on the way back, ” Ryan said before watching the car leave."
      },
      {
        "paragraph": "Carson lamented, “I didn’t expect I’d  see the day my brother finally learns to cherish the people around\nhim. This is great. The family would keep worrying about him otherwise.”"
      },
      {
        "paragraph": "“Mmhm.”"
      },
      {
        "paragraph": "Ryan’s eyes were fixed at the direction of the car far away."
      },
      {
        "paragraph": "Although he had a favorable impression of Freya, he understood that it would be difficult for them to be\ntogether with their identities. It was better this way. At least she was happy."
      },
      {
        "paragraph": "However, he was not joking. If Rodney bullied her, Ryan would not let him off."
      }
    ]
  },
  {
    "title": "Chapter 1879 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "A black Bentley whizzed along the road."
      },
      {
        "paragraph": "Rodney tilted his head and leaned on Freya’s shoulder. As he was completely drunk, he groaned and\nsaid, “Wifey, you smell so good.”"
      },
      {
        "paragraph": "In a daze, Freya said, “Mm.” Considering that the chauffeur was in front, she did not want to talk to the\ndrunkard."
      },
      {
        "paragraph": "Not only was he drunk, but he was also crossing the line."
      },
      {
        "paragraph": "“I feel like kissing you…”"
      },
      {
        "paragraph": "Freya was so uncomfortable that she promptly pushed him away."
      },
      {
        "paragraph": "“Why are you pushing me away? Is it because… you don’t like me?” Rodney instantly acted like a kid\nand became despondent. “I know everyone dislikes me, including you…”"
      },
      {
        "paragraph": "“No, I don’t.” Freya denied."
      },
      {
        "paragraph": "“You do.” While speaking, Rodney went to hug her. “Wifey, don’t leave me. I’ll treat you well. Listen to\nme…”"
      },
      {
        "paragraph": "Freya’s entire face reddened."
      },
      {
        "paragraph": "His nonsensical words almost made her go insane. How was she going to face the chauffeur\ntomorrow?"
      },
      {
        "paragraph": "She gnashed her teeth. After that, she locked lips with Rodney in order to stop him from talking\nnonsense."
      },
      {
        "paragraph": "Although the wine in his mouth tasted bitter, it was not too bad."
      },
      {
        "paragraph": "Rodney hugged and kissed her for a long time."
      },
      {
        "paragraph": "Hearing the movements behind, the middle -aged chauffeur felt awkward and drove faster."
      },
      {
        "paragraph": "It was hard to put up with the affectionate young couple who were in the first flush of love."
      },
      {
        "paragraph": "Although the chauffeur had worked for the Snow family for over ten years, this was his first time\nencountering such a situation."
      },
      {
        "paragraph": "When they finally arrived at the villa, Freya exerted her strength to push Rodney away. “We’re home.”"
      },
      {
        "paragraph": "“Huh?” Rodney was in a daze. “But I still want to continue kissing you.”"
      },
      {
        "paragraph": "“Let’s get back to our room first, alright?” Freya coaxed him."
      },
      {
        "paragraph": "Only after a long while did he enter the house with Freya supporting him."
      },
      {
        "paragraph": "As soon as the sitter heard that they were back, she quickly welcomed them and helped support\nRodney as they headed to the bedroom."
      },
      {
        "paragraph": "“Where’s Dani?”"
      },
      {
        "paragraph": "“Aunty Cally has put her to bed,” the sitter replied."
      },
      {
        "paragraph": "Freya nodded. The Snow family assigned Aunty Cally here as she was experienced in taking care of\nchildren. This made Freya at ease."
      },
      {
        "paragraph": "Normally, Freya would personally put Dani to bed, but she was burned out today."
      },
      {
        "paragraph": "After the sitter left, she helped Rodney take off his suit as he had met many people today. She was not\ncomfortable sleeping with someone who wore the same clothes throughout the day. It just made her\nfeel uncomfortable as the germs on the clothes could spread to the bed."
      },
      {
        "paragraph": "Now that Rodney was asleep, she could not care less."
      },
      {
        "paragraph": "After looking at him for a while, she decided to change his trousers."
      },
      {
        "paragraph": "By the time she finished bathing, Rodney was still asleep."
      },
      {
        "paragraph": "She went to bed. When she almost fell asleep, Rodney approached her and hugged her."
      },
      {
        "paragraph": "He signaled her with two nudges."
      },
      {
        "paragraph": "“Wifey…”"
      },
      {
        "paragraph": "Rodney, who was intoxicated, began to kiss her again."
      },
      {
        "paragraph": "“No. I want to sleep now, ” Freya muttered."
      },
      {
        "paragraph": "She kept yawning as she was drained of all energy."
      },
      {
        "paragraph": "“Wifey, I love you.” Rodney’s passion had been ignited."
      },
      {
        "paragraph": "Upon noticing that he had lost control, Freya was not sleepy anymore. She was rather anxious. “No,\nRodney. I’m not… mentally prepared.”"
      },
      {
        "paragraph": "“Freya, I want you. Don’t reject me. I’ll love and treat you well in the future.”"
      },
      {
        "paragraph": "Rodney spoke sweetly."
      },
      {
        "paragraph": "He looked at her with his handsome face. Seeing his good looks, any woman would melt in spite of\nthemselves."
      },
      {
        "paragraph": "Freya’s heart melted for a moment."
      },
      {
        "paragraph": "When she was deeply in love with Patrick back then, Patrick would keep his composure, unlike\nRodney."
      },
      {
        "paragraph": "Of course, Rodney would not usually behave like this. It was only because he was drunk today."
      },
      {
        "paragraph": "She was not that resistant to him now."
      },
      {
        "paragraph": "After all, they were married. She wanted to be in a serious relationship with Rodney as well."
      },
      {
        "paragraph": "After a moment of hesitation, Rodney managed to have his way."
      },
      {
        "paragraph": "7: 00 a.m."
      },
      {
        "paragraph": "There was a bird chirping on the windowsill."
      },
      {
        "paragraph": "Rodney opened his eyes. After waking up with a hangover, he felt dizzy and had an upset stomach."
      },
      {
        "paragraph": "The moment he turned around, he was dumbfounded."
      },
      {
        "paragraph": "He was lying under the blanket with his arms wrapped around a woman. The woman’s pretty hair fell\nover the pillow and her face. There were hickeys all over the part of her neck that was exposed."
      },
      {
        "paragraph": "Several scenes flashed across Rodney’s head."
      },
      {
        "paragraph": "He felt as though an atomic bomb had gone off in his head."
      },
      {
        "paragraph": "It seemed that he had slept with Freya last night."
      },
      {
        "paragraph": "They slept together…"
      },
      {
        "paragraph": "This was what he had been dreaming of."
      },
      {
        "paragraph": "However… he was drunk on such an exciting night… He felt like crying."
      },
      {
        "paragraph": "He had only experienced it twice in his life, yet he was drunk on both occasions."
      },
      {
        "paragraph": "It felt as though he had missed out on 1oo billion dollars."
      },
      {
        "paragraph": "He felt terrible."
      },
      {
        "paragraph": "No way. He must do it again…"
      },
      {
        "paragraph": "Rodney stared at Freya, who was sleeping soundly. After struggling internally for a long time, he began\nto move toward her little by little."
      },
      {
        "paragraph": "When Freya woke up, she wanted to kick him off the bed so badly."
      },
      {
        "paragraph": "“Rodney, why can’t you leave me alone?”"
      },
      {
        "paragraph": "She was embarrassed and annoyed at the same time. “Freya, I didn’t mean to do it. I was drunk last\nnight, so I can’t remember what happened.” Rodney coaxed and kissed her. “Well, since we’ve done it,\nlet’s continue adding some spice to our love life, alright?”"
      },
      {
        "paragraph": "‘Who wants to do that with you?’"
      },
      {
        "paragraph": "Freya was exasperated and embarrassed. However, now that things had already happened, there was\nno point in resisting him."
      },
      {
        "paragraph": "She was just slightly annoyed. She wondered if she should not have let him have his way so soon."
      },
      {
        "paragraph": "The two of them slept till about ten in the morning."
      },
      {
        "paragraph": "When they got downstairs, Wendy gazed at them with an ambiguous gaze."
      },
      {
        "paragraph": "How Freya wished to hide in her room. She felt uncomfortable, yet the instigator beside her was smug."
      },
      {
        "paragraph": "“Wifey, what do you want to eat? I’ll prepare it for you.” Rodney was constantly hugging her."
      },
      {
        "paragraph": "Wendy teased, “You can go ahead and prepare breakfast. But Freya, you need to feed Dani first.”"
      },
      {
        "paragraph": "Freya swiftly took Dani over. Then, she went to one corner and fed her."
      },
      {
        "paragraph": "She was extremely embarrassed and afraid of letting other people notice the many hickeys on her skin."
      },
      {
        "paragraph": "”Well done, son.” Wendy shot an approving look at Rodney in the kitchen."
      }
    ]
  },
  {
    "title": "Chapter 1880 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rodney was smug, but knowing that Freya was someone who easily felt embarrassed,  he thought  he\nshould keep it low-key. “Mom, what  are you saying? I don’t get it.”"
      },
      {
        "paragraph": "“It’s alright. I was in your shoes once.”"
      },
      {
        "paragraph": "Wendy uttered this and did not say anything else after that."
      },
      {
        "paragraph": "She knew what had happened between them only because Dani was hungry earlier. Just as she was\nabout to knock on the door, she heard some sounds in the room. She quickly understood the situation."
      },
      {
        "paragraph": "Since the young couple was willing to do it, they would start behaving differently now."
      },
      {
        "paragraph": "“Well, you need to treat Freya well. Don’t always make hurtful remarks like you did in the past.”"
      },
      {
        "paragraph": "“I got it, Mom.”"
      },
      {
        "paragraph": "Rodney obediently nodded. He was afraid of losing his happy life if he offended Freya."
      },
      {
        "paragraph": "At this point, he was willing to do anything to maintain his current life."
      },
      {
        "paragraph": "If he had not experienced certain things, he would not have realized the beauty of what he had now."
      },
      {
        "paragraph": "After preparing a bowl of pumpkin soup, Rodney brought it to Freya cautiously. “Wifey, be careful not to\nburn your tongue.”"
      },
      {
        "paragraph": "“Blow on the soup to cool it down, then,” Freya said casually."
      },
      {
        "paragraph": "“Oh, sure.” Rodney quickly took a spoonful of soup and blew on it."
      },
      {
        "paragraph": "Freya looked at him and was stunned for a moment."
      },
      {
        "paragraph": "She had always been enemies with Rodney in the past. Little did she expect that he would one day be\nlike this."
      },
      {
        "paragraph": "What a huge change in this man."
      },
      {
        "paragraph": "“Wifey, I know I’m handsome, but you don’t have to keep staring at me this way,” Rodney said with a\ngrin."
      },
      {
        "paragraph": "“You’re overthinking it.” Freya raised her eyebrows. “I was just thinking about how nasty you were to\nme in the past…”"
      },
      {
        "paragraph": "“That was in the past. Don’t continue thinking about it anymore.” Rodney shuddered. With a strong\ndesire for survival, he continued, “Back then, I was blind and something was wrong with my mind.”"
      },
      {
        "paragraph": "Seeing that he had some self-awareness, Freya smirked. “Really? If I had said this to you a month ago,\nyou would’ve lost your temper. Sure enough, you’ve changed a lot after sleeping with me.”"
      },
      {
        "paragraph": "“Not really. After Dani’s party, I realized that I’m in love with you. I began treating you very well since\nthen.”"
      },
      {
        "paragraph": "Rodney said with a deep voice, “I’m just extra nicer to you today. I just think that… you had a hard time\nlast night. Also… the feeling is different. It feels like you finally belong to me. Although you’ve given\nbirth to my child, I wasn’t sure about your feelings because you’re not the kind who opens up easily.\nBut now that you’ve opened yourself up to me, it shows that you want to live with me. In this case, I’ll\ngo all out to protect you.”"
      },
      {
        "paragraph": "Deep down, Freya was moved."
      },
      {
        "paragraph": "In fact, she used to envy Sarah. Although Rodney was terrible, he was genuinely nice to her."
      },
      {
        "paragraph": "His EQ was so low that he was easily deceived by hypocrites. Nevertheless, once he fell for a woman,\nhe would treat her well with all her heart."
      },
      {
        "paragraph": "At this point, she could feel Rodney’s sincerity."
      },
      {
        "paragraph": "“Well… do you like me or Sarah more?” She could not help but stare at him while asking."
      },
      {
        "paragraph": "“Why do you always mention her?” Rodney was at a loss for words. “Loving her is the biggest regret in\nmy life. Meanwhile, you’ve given birth to my child."
      },
      {
        "paragraph": "Plus, we’re now in a relationship. She can’t compare to you at all.”"
      },
      {
        "paragraph": "“What an answer. Your words are getting sweeter. ”"
      },
      {
        "paragraph": "Freya drank the pumpkin soup and curled her lips. She was very satisfied with his answer."
      }
    ]
  },
  {
    "title": "Chapter 1881 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“It’s because of your sweet kiss, ” Rodney said while grinning."
      },
      {
        "paragraph": "By the time Freya and Rodney finished their breakfast, it was already late. Freya decided not to g o to\nwork. She would stay home to accompany Dani."
      },
      {
        "paragraph": "Rodney had to go to the office for a meeting. About ten minutes after he drove away, he came back\nwith a pack of pills. “About that… We didn’t use protection last night. Considering that you’ve just given\nbirth, it’s not good for you to get pregnant again now, so take these pills. Later in the afternoon, I’ll…\nbuy some condoms. Then, you won’t have to take the pills anymore.”"
      },
      {
        "paragraph": "Freya glanced at him before she took the pills. Her face was slightly flushed. “Why are you going to buy\ncondoms? Did I agree to it? What’s more… I’m exhausted today.”"
      },
      {
        "paragraph": "“ I know. I didn’t say that I wanted to do it tonight. We can keep them at home.” Rodney shot her a\npensive look before he left."
      },
      {
        "paragraph": "He was elated as he made his way to the office."
      },
      {
        "paragraph": "If it had not been for Freya’s reputation, he would have shared his joy with Chester and Shaun."
      },
      {
        "paragraph": "As he was in a good mood today, he smiled at everyone he met."
      },
      {
        "paragraph": "Carson, who was working on the same project as him, was the first to notice his expression. “ Brother,\ncould you have done something with Sister-in-law after you left the banquet drunk last night? Hehe…”"
      },
      {
        "paragraph": "“Nonsense. We already have a child together. Why would I be so happy over such a thing?” Rodney\nsmiled brightly while denying it. “I’m happy because I have a daughter and my wife is pretty and\nconsiderate. Also, I’m happy because Dad handed a large project to us.”"
      },
      {
        "paragraph": "Carson did not bother to expose him. After all, everyone knew that Rodney married Freya only because\nshe was pregnant. He hardly got the chance to do it with her after they got married."
      },
      {
        "paragraph": "“Well, it’s time you get into a serious relationship, Carson. Settle down and have a child. Only then will\nit be fun.” Rodney clutched Carson’s shoulder."
      },
      {
        "paragraph": "“You sound  just  like Mom.”  Carson dodged him.  “By the way, I’ll be heading to Country D to talk\nbusiness tomorrow. Do you want me to buy something for Sister-in-law?”"
      },
      {
        "paragraph": "“Sure.” At the thought that all the top luxury items with the newest collections were sold there, Rodney\nquickly said,  “Buy her some necklaces,  watches, and skincare products.”"
      },
      {
        "paragraph": "Carson sighed. “Brother, you shouldn’t give her so many gifts at one go. Otherwise, she’ll be\ndisappointed if you only give her one gift the next time. You can’t satisfy her like this. Give her one gift\nat a time so that she’ll be surprised.”"
      },
      {
        "paragraph": "“That’s true.” After some thought, Rodney said, “ Bring home about 3o gifts and I’ll keep them first.\nThen, I’ll give her one gift on each day of the month.”"
      },
      {
        "paragraph": "Carson was speechless."
      },
      {
        "paragraph": "Who said Rodney had low EQ? Even Carson could not bring himself to do that."
      },
      {
        "paragraph": "“Brother, where’s Mom and Sister?”"
      },
      {
        "paragraph": "“Figure out their whereabouts on your own. They’re your biological sister and mom. I only care about\nmy wife.” Rodney chuckled."
      },
      {
        "paragraph": "Carson was at a loss for words, but he understood the situation. Now that Rodney had a wife and a\nchild, he no longer prioritized his mother and sister."
      },
      {
        "paragraph": "Four days later, Carson returned from overseas. Rodney wrapped up the gifts."
      },
      {
        "paragraph": "Every morning when Freya woke up, she would find a gift on her bedside table."
      },
      {
        "paragraph": "At first, it did not occur to her that Rodney was being romantic."
      },
      {
        "paragraph": "On the first day, she unwrapped the gift and saw an exquisite Vacheron Constantin wristwatch. The dial\nof the watch was inlaid with shiny diamonds."
      },
      {
        "paragraph": "She was very fond of it."
      },
      {
        "paragraph": "However, she ran up to Rodney and asked him for confirmation, “ Is this for me, your mom, or your\nsister?” “ If I wanted to give it to them, why would I put it on your bedside table?” Rodney was baffled.\n“Why do you need to ask me about it?”"
      }
    ]
  },
  {
    "title": "Chapter 1882 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“I’m afraid I misunderstood. After all… you’re not a romantic person.” Freya put on the watch, which\nmade her hand look exquisite."
      },
      {
        "paragraph": "Although she already had a watch, she would not mind having a few more nice accessories, especially\nwhen it was Rodney who gave her the surprise."
      },
      {
        "paragraph": "“This probably… cost millions of dollars.” Freya asked sympathetically, “You bought me quite a lot of\nthings from Melbourne last time too. Do you still have so much money to spend?”"
      },
      {
        "paragraph": "“Don’t doubt my ability to make money. I might not be as outstanding as Shaun, but I’m not that\nincompetent.”"
      },
      {
        "paragraph": "Rodney hugged and kissed her. “Do you like it?”"
      },
      {
        "paragraph": "“Yes.” Freya nodded. She stood on her tiptoes and kissed him back. With a soft voice, she said with\nsome embarrassment, “Tonight… I’ll wait for you. ”"
      },
      {
        "paragraph": "Rodney’s nose almost bled at that moment."
      },
      {
        "paragraph": "The next day, Freya woke up and received a pair of pretty diamond earrings, which were not available\nin the local market yet."
      },
      {
        "paragraph": "On the third day, she received a diamond ring."
      },
      {
        "paragraph": "She complained to Rodney about his lavish spending. Even so, he placed a new handbag beside her\npillow on the fourth day."
      },
      {
        "paragraph": "When Catherine went to Freycatheli for inspection, she spotted a Vacheron Constantin wristwatch on\nFreya’s right wrist, a large diamond ring on her middle finger, a pretty necklace around her neck, and a\nforeign luxury handbag on her desk. She could not help but gasp."
      },
      {
        "paragraph": "“You’re decked out in jewels… like a rich lady. I know you’re married to Rodney, the rich guy, but…\nAhem… You don’t have to dress in such a high profile manner and make others jealous.”"
      },
      {
        "paragraph": "Catherine glanced at Freya’s wristwatch. “I’ve seen it in magazines, and it’s quite pretty. I’ve been\nlonging to buy it but I haven’t gone overseas.”"
      },
      {
        "paragraph": "“Is this only available overseas?” Freya could not help but ask in astonishment."
      },
      {
        "paragraph": "“Duh. This is a limited edition. There are only 30 watches of this design in the world.” Catherine pointed\nat Freya’s handbag. “Same goes to that handbag. Where did you get it?”"
      },
      {
        "paragraph": "“Rodney gave them to me.” Freya smiled smugly. “ He gave me the earrings, watch, and ring as well.\nRecently, he has been giving me a small gift every day. I wonder what he’s going to give me tomorrow.”"
      },
      {
        "paragraph": "“You call these small gifts?” Catherine’s lips curled. “Enough.”"
      },
      {
        "paragraph": "“I think he’s being lavish too.” Freya grinned. “I’ll give him a piece of my mind tonight.”"
      },
      {
        "paragraph": "Catherine was jealous. “Enough. Stop humblebragging.”"
      },
      {
        "paragraph": "“I’m not humblebragging. Shaun must be very romantic too.” Freya’s lips twitched. “I was also jealous\nof you and Shaun when both of you showed public displays of affection back then.”"
      },
      {
        "paragraph": "Catherine was angered as comparing her situation to Freya’s only drove her to despair. Shaun’s\nromantic acts could not compare to Rodney’s."
      },
      {
        "paragraph": "How romantic it was to receive a gift each day. Shaun had never done such a thing."
      },
      {
        "paragraph": "“Why didn’t I realize that Rodney is such a generous and romantic man before this?” Catherine sighed."
      },
      {
        "paragraph": "“Of course, you didn’t notice it before this. We weren’t his girlfriends. He was probably only romantic to\nSarah.”"
      },
      {
        "paragraph": "Freya said bitterly, “Yet Sarah didn’t know how to appreciate him. I think something is wrong with her\nmind. Actually, Rodney is pretty good. He’s the eldest young master of the Snow family. Plus, he’s\ngenerous and good at cooking.”"
      },
      {
        "paragraph": "“Really?” Catherine’s face was filled with mockery. “This is different from what you said earlier.”"
      },
      {
        "paragraph": "“Earlier… I didn’t know him well enough. ” Freya lowered her head awkwardly."
      },
      {
        "paragraph": "“It’s not because you didn’t know him well enough. You just had not… hehe. ” Catherine chuckled. “ In\nfact, things become different after a couple does it.”"
      },
      {
        "paragraph": "Freya was so ashamed that her face turned crimson. “That day… he was really drunk… “"
      }
    ]
  },
  {
    "title": "Chapter 1883 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Alright. Drop it.” Catherine looked at Freya seriously. “Anyway, as your friend, I’m glad to see that\nyou’ve settled down in your life. It’s good that you’re moving on from the past.”"
      },
      {
        "paragraph": "Freya was momentarily stunned. Then, she nodded."
      },
      {
        "paragraph": "Her darkest moment in life was when Thomas hurt her. She thought that she would never get to live a\nblissful life after that."
      },
      {
        "paragraph": "The minute Catherine walked out of the office building, Shaun got out of the car and opened the\npassenger door for her."
      },
      {
        "paragraph": "Catherine rolled her eyes at him. She pulled the rear door open and got in while ignoring him."
      },
      {
        "paragraph": "When a gust of cold wind blew past him, Shaun was frozen to the spot. His scalp instantly turned\nnumb."
      },
      {
        "paragraph": "He then got in the car and asked, “What’s wrong, Cathy?”"
      },
      {
        "paragraph": "Catherine stared at his handsome face coldly without saying anything."
      },
      {
        "paragraph": "“… Did I do something wrong?” Shaun reflected on himself with a confused look. “Is it because… I hurt\nyou last night?”"
      },
      {
        "paragraph": "At the mention of the matter, Catherine was annoyed and ashamed. “If you don’t know what to say, just\nzip it.”"
      },
      {
        "paragraph": "“If I zip it, how can I find out why you’re unhappy?” Shaun gripped her hand."
      },
      {
        "paragraph": "Nevertheless, Catherine broke free from his grip and looked at him with rage. “I realized that… you’re\nnot romantic at all.”"
      },
      {
        "paragraph": "“ I’m not romantic?” Shaun was dumbfounded. “ I always put you as my top priority and listen to you.”"
      },
      {
        "paragraph": "Catherine pursed her lips. “We’re like an old couple and there’s no romance in our relationship. What’s\nmore, we haven’t remarried, so we’re still just a couple.”"
      },
      {
        "paragraph": "The mention of the issue made Shaun feel uneasy. He had yet to remarry Catherine. He had\nmentioned it to her a few times, but she always rejected him."
      },
      {
        "paragraph": "Due to that, Shaun had been cautious for fear that she would suddenly leave him one day when she\nwas mad at him."
      },
      {
        "paragraph": "“Cathy, I want to be romantic too, but we have two kids now. We can’t just immerse ourselves in our\nown little world. Plus, you enjoy accompanying the kids…”"
      },
      {
        "paragraph": "“Freya and Rodney have a child too, but Rodney is so romantic now. He gives Freya different gifts\nevery day. He gave her a watch one day and a diamond"
      },
      {
        "paragraph": "ring the next. The following day, he gave her a handbag… I’ve never received such treatment, ”\nCatherine said glumly, “When was the last time you gave me a gift?”"
      },
      {
        "paragraph": "Shaun did not expect Rodney to have gotten it right. Nevertheless, at least he knew now that Catherine\nwas jealous. “Cathy, we just went shopping yesterday, and I bought you some clothes. I even gave you\nmy card…”"
      },
      {
        "paragraph": "“That’s nothing. I want surprises,” Catherine said in a self-righteous manner."
      },
      {
        "paragraph": "“… Alright then.” Shaun’s head hurt. It was too difficult to understand a woman’s mind."
      },
      {
        "paragraph": "Regardless, as a man, all he needed to do was satisfy her unconditionally."
      },
      {
        "paragraph": "“Let me think about it. I’ll give you a surprise as well…”"
      },
      {
        "paragraph": "“I don’t want your idea to be the same as Rodney’s,” Catherine added, “You have a higher EQ than\nhim, so you should figure it out yourself.”"
      },
      {
        "paragraph": "Shaun was at a loss for words."
      },
      {
        "paragraph": "She wanted a surprise, but it could not be similar to Rodney’s surprises."
      },
      {
        "paragraph": "What a strict requirement."
      },
      {
        "paragraph": "“You seem to have some objections?” Catherine asked with a smile."
      },
      {
        "paragraph": "“No. ” Shaun promptly shook his head. “But when are you going to remarry me, Cathy? Look, Freya\nand Rodney are already married. I don’t want to be unmarried even after Chester gets married.”"
      }
    ]
  },
  {
    "title": "Chapter 1884 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Why are you in a rush? It’s not as if you’ve never gotten married before. There’s nothing to be jealous\nof.” Catherine fiddled with her fingers. “ Let’s wait until Chester gets married. He’s your buddy. If you’ re\nalso married, he’ll be lonely and it’ll look pathetic.”"
      },
      {
        "paragraph": "Shaun felt helpless. “He’s not pathetic. He’s not planning on getting married either.”"
      },
      {
        "paragraph": "“How can it be? Didn’t he want to marry Cindy before this?” Catherine lifted a finger to his lips, and her\ngaze was seductive. “What’s more, if I get bored of you one day, I can easily break up with you.”"
      },
      {
        "paragraph": "Was this something she should say?"
      },
      {
        "paragraph": "“Cathy, don’t you love me?” Frowning, Shaun asked with mixed feelings."
      },
      {
        "paragraph": "“I love you now, but I can’t guarantee that I’ll love you forever. It depends on your performance.”\nCatherine beamed and flashed a charming smile at him."
      },
      {
        "paragraph": "Her expression was cute yet exasperating."
      },
      {
        "paragraph": "As much as Shaun had the urge to punch her, he did not have the guts to do it."
      },
      {
        "paragraph": "He could only blame himself for being extremely phony back then."
      },
      {
        "paragraph": "Snow Corporation. In the office."
      },
      {
        "paragraph": "Rodney was talking to Freya on the phone. “Wifey, it’s Young Master Wooten’s birthday today. He\ninvited me to his birthday party tonight. He helped me once before, so I can’t turn him down. I’m going\nover for a meal, but I’ll be back around 8:00 p.m. ”"
      },
      {
        "paragraph": "“It’s okay if you return slightly late.” It was probably because of his great behavior lately that Freya was\nbeing generous toward him. “I know you’re busy with work and you have to socialize because\nconnections are crucial. It doesn’t matter if you don’t come home and have dinner on time."
      },
      {
        "paragraph": "When I was in the Snow family’s house yesterday, Carson complained that he was always the one who\nwent on business trips.”"
      },
      {
        "paragraph": "“Given that Carson isn’t married, it’s okay for him to work harder, isn’t it?” Rodney snorted before he\nsaid flatteringly, “How considerate of you, Wifey.”"
      },
      {
        "paragraph": "Freya was speechless. “Are you sure I’m considerate?”"
      },
      {
        "paragraph": "“Yes. I wonder why I didn’t notice that earlier on,” Rodney said vaguely, “In truth, you’re a wonderful\nwoman.”"
      },
      {
        "paragraph": "He truly meant it."
      },
      {
        "paragraph": "Ever since the two of them started taking their relationship seriously, they rarely quarreled."
      },
      {
        "paragraph": "Rodney always obeyed Freya, and Freya would not act contrary to him like she used to."
      },
      {
        "paragraph": "With the weather turning chilly these two days, she even gave him a shawl and sweater."
      },
      {
        "paragraph": "Although the shawl was not something expensive, her effort warmed his heart."
      },
      {
        "paragraph": "“I’ve always been a wonderful woman. You were the one who forced me to behave that way back then,\n” Freya said coquettishly with a coquettish smile. “You mentioned it’s Young Master Wooten’s birthday,\nbut who is he? I’ve never seen him.”"
      },
      {
        "paragraph": "“He came to Dani’s party the other day. But I guess you didn’t notice him because there were too many\npeople. After all, he’s not as handsome, tall, and elegant as me.” Rodney jumped at the chance to\npraise himself."
      },
      {
        "paragraph": "“Have you no shame?” Freya criticized while giggling. “Nope.”"
      },
      {
        "paragraph": "“Fine. I’m not going to argue with you,” she said flirtatiously, “Rich young men like you are sure to look\nfor women during these occasions. It’s fine for them to do it, but you’d better not get close to any other\nwomen…”"
      },
      {
        "paragraph": "“I’ve never done that. If I were that sort of person, I wouldn’t have lost my virginity to you, ” Rodney\nswiftly said, “Those women are unrefined. Now"
      },
      {
        "paragraph": "that I’m with you, I’m not interested in anyone else. Having said that, Young Master Wooten enjoys\nfooling around. I’ve told him not to get any women. If he does, I’ll definitely not show up. Of course, you\ncan tag along if you’re worried.”"
      },
      {
        "paragraph": "“ I’m not going to tag along. I want to accompany Dani at home. I miss her.” Freya refused."
      },
      {
        "paragraph": "“Do you miss me?” Rodney asked eagerly."
      },
      {
        "paragraph": "“No, ”  Freya replied even though  she felt otherwise."
      }
    ]
  },
  {
    "title": "Chapter 1885 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“How cold! But it’s fine. Even so, I miss you.”"
      },
      {
        "paragraph": "As soon as Freya heard Rodney’s flirtatious voice on the other end, her face flushed."
      },
      {
        "paragraph": "“I’ll stop here. I need to carry on with my work.” She hurriedly hung up."
      },
      {
        "paragraph": "Rodney smirked, knowing that she must have gotten shy."
      },
      {
        "paragraph": "He was very familiar with her shy side, especially on the bed…"
      },
      {
        "paragraph": "At the mere thought of it, he felt a burning sensation. He could not help but grumble about Young\nMaster Wooten’s birthday. Why did Young Master Wooten invite him? It was because of this that he\ncould not do it with his wife at home tonight."
      },
      {
        "paragraph": "At 6:oo p.m., Rodney drove to the restaurant where the party was being held."
      },
      {
        "paragraph": "When he arrived, he realized that nobody else was there except for Young Master Wooten."
      },
      {
        "paragraph": "“Just the two of us?” Rodney was dumbfounded. He thought that he had come to the wrong place."
      },
      {
        "paragraph": "“What’s wrong? Why can’t it just be the two of us on my birthday?” Rory Wooten grinned as he poured\na cup of coffee for Rodney."
      },
      {
        "paragraph": "“No. This is just untypical of you.” Rodney was glum. “You used to invite at least 20 people to every\ngathering and even call a few beautiful ladies over. ”"
      },
      {
        "paragraph": "“So you want me to call a beautiful lady over for you, huh?” Rory winked."
      },
      {
        "paragraph": "“No. I’m already married,” Rodney quickly responded."
      },
      {
        "paragraph": "“ I’m just kidding. Who doesn’t know that you’re a man of integrity? What’s more… we all know that\nSarah is the only person you love.” Rory passed the menu to Rodney."
      },
      {
        "paragraph": "Rodney said coldly, “ Don’t mention that woman. Our relationship is over.”"
      },
      {
        "paragraph": "“Ha. Forget it. You said that every time you got drunk for her, ” Rory said calmly."
      },
      {
        "paragraph": "“I already have a child.” Indeed, Rodney did not want to recall the past."
      },
      {
        "paragraph": "Rory was under the impression that Rodney could never get back together with Sarah because of the\nchild."
      },
      {
        "paragraph": "Rory would not believe that he had completely gotten over Sarah. When Sarah and Shaun were\npreviously in a relationship, Rodney felt embarrassed to pour his heart out to Shaun and Chester.\nHence, he came looking for him."
      },
      {
        "paragraph": "“Let’s start ordering. The dishes here are quite good, ” Rory said, “How’s the project development in\nCairns going?”"
      },
      {
        "paragraph": "“ It should be done by the end of this year. By the way, I want to thank you for that. If it hadn’t been for\nyour help, the hooligans in Cairns wouldn’t have stopped.” Rodney raised his glass. “Although my uncle\nis the prime minister, I have to deal with certain issues in a low-profile manner. If I fail to deal with them\nproperly, other people will perceive me as a bully, which will affect my uncle’s reputation.”"
      },
      {
        "paragraph": "“No worries. We go back a long way, after all.” Rory paused for a moment before he said awkwardly, “\nWhen you were kicked out of the Snow family previously, it wasn’t my intention to not lend you a hand.\nIt was because your dad warned us and we were all afraid of offending him.”"
      },
      {
        "paragraph": "“I got it. It’s all in the past.”"
      },
      {
        "paragraph": "Rodney had gotten over it. He understood that everyone had their personal gains, including himself\nwho was here because he could benefit from Rory."
      },
      {
        "paragraph": "The two of them talked shop for a while."
      },
      {
        "paragraph": "A knock sounded on the door, and a server subsequently pushed the door open."
      },
      {
        "paragraph": "Rodney did not realize it until he heard a glass falling to the floor. He lifted his head and froze the\nminute he saw a thin and pale face."
      },
      {
        "paragraph": "Sarah Neeson."
      },
      {
        "paragraph": "Never did he expect that he would meet this woman under such circumstances."
      }
    ]
  },
  {
    "title": "Chapter 1886 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "What did Sarah mean to Rodney?"
      },
      {
        "paragraph": "She used to be his most wonderful crush and first love."
      },
      {
        "paragraph": "After that, she became the humiliation of his life. She was the one who trampled on his pride\nunderneath her feet."
      },
      {
        "paragraph": "Moreover, his ten fingers were not enough to count the evil things that Sarah had done."
      },
      {
        "paragraph": "When she saw Rodney, she was flustered  and wanted to turn around to leave. Rory quickly stood u p\nand grabbed her. “Sarah, don’t go.”"
      },
      {
        "paragraph": "“You’ve got the wrong person. ” Sarah lowered her head and avoided eye contact with him."
      },
      {
        "paragraph": "“I recognized you when I came here to eat last time.” Rory pulled her to a chair and pressed down on\nher to force her to sit down."
      },
      {
        "paragraph": "Rodney’s handsome face showed a cold expression. “Rory, what do you mean by this?”"
      },
      {
        "paragraph": "“Young Master Rodney, I just happened to see her here last time. I never thought she would end up\nbeing a waitress. It’s too terrible. ” Rory often saw Rodney defending Sarah back then. He witnessed\nfor himself how well Rodney treated Sarah. He did not think Rodney would forget about Sarah so\nquickly."
      },
      {
        "paragraph": "During Rodney’s baby’s  one-month-old celebration banquet, Rory could sense the distance between\nFreya and Rodney."
      },
      {
        "paragraph": "“Young Master Wooten, I’m really not Sarah.”"
      },
      {
        "paragraph": "Sarah lowered  her head and covered her face with her hand. She looked like she was avoiding\nRodney."
      },
      {
        "paragraph": "“If   you’re not Sarah, how do you know that I’m Young Master Wooten?” Rory sighed. “Sarah,"
      },
      {
        "paragraph": "aren’t you a skilled psychologist? How did you end up like this?”"
      },
      {
        "paragraph": "Bang! Rodney hit the table and stood up. His eyes were filled with fury. “She brought everything upon\nherself. She deserves it. Since you’ve shown up, follow me to see Shaun.”"
      },
      {
        "paragraph": "After he spoke, he rushed over and dragged Sarah out of the chair. “Shaun and the others are looking\nfor you all over the place. Go and recover Shaun’s memories.”"
      },
      {
        "paragraph": "“I don’t know what you’re talking about.” Sarah"
      },
      {
        "paragraph": "was roughly yanked to the floor by Rodney. Her face was as pale as a sheet."
      },
      {
        "paragraph": "“Young Master Snow, what are you doing? ” Rory saw Sarah’s pitiful expression. He quickly stopped\nRodney."
      },
      {
        "paragraph": "“What the f*ck do you know?” Rodney spat out vulgar words due to his anger. “This woman is evil. She\nused to take advantage of my money and treated me as a backup. When I was no longer of use to her,\nshe kicked me away without hesitation."
      },
      {
        "paragraph": "What was more hateful was that she went mad and did many evil things…”"
      },
      {
        "paragraph": "Sarah bit her lip and lowered her head without saying a word. Her tears fell to the floor."
      },
      {
        "paragraph": "Rory could not bear seeing this. “Young Master Rodney, you must’ve misunderstood her.”"
      },
      {
        "paragraph": "“Misunderstood?” Rodney laughed angrily. “I saw it with my own eyes. She was entering the hotel while\nbeing all intimate with President Yard of Helios Investment Group. I caught  her  red- handed.”"
      },
      {
        "paragraph": "Rory sighed. “ I didn’t want to reveal some things, but if I don’t do it today, you might actually skin her\nalive…”"
      },
      {
        "paragraph": "“Young Master Wooten…” Sarah interrupted him nervously. “ It’s all in the past. I don’t want to talk\nabout it anymore.”"
      },
      {
        "paragraph": "“But you can’t let other people keep misunderstanding you,”    Rory said with a straight face. “Young\nMaster Snow, Sarah and President Yard of Helios Investment Group were just acting back then…”"
      },
      {
        "paragraph": "“Acting?” Rodney sneered. “Do you think I’m blind?”"
      },
      {
        "paragraph": "“It’s true. She initially asked me to put on a performance with her, ” Rory said, “Back then, you were\nchased out of the Snow family and Osher Corporation was met with many obstacles. Your relationship\nwith your friends was estranged, and everything you did wasn’t going well. Sarah thought you weren’t\nhappy at that time. You were distracted whenever you were with her. She knew you had ambitions for\nyour career, and she understood your pain of not being able to go back home. She knew that as long\nas you were with her, you wouldn’t be forgiven by your parents and family. Since you definitely wouldn’t\nbreak up with her, she kept staying in the hotel on purpose to distance herself from you."
      },
      {
        "paragraph": "“She deliberately looked for President Yard to act as if they were making out in front of you. That was\nall planned. At first, she looked for me, but I didn’t want to ruin my relationship with you. After all, if you\nwere to return to the Snow family, no good would come from offending you. She really went through a\nlot for your sake.”"
      },
      {
        "paragraph": "After Rodney heard that, it was as if thunder had sounded  in his head."
      }
    ]
  },
  {
    "title": "Chapter 1887 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "The thunder rumbled."
      },
      {
        "paragraph": "Sarah was only acting with President Yard back then?"
      },
      {
        "paragraph": "Those harsh words that she said were to make him break up with her?"
      },
      {
        "paragraph": "She did that to let him mend his relationship with his parents?"
      },
      {
        "paragraph": "Rodney felt his brain getting overwhelmed. He almost believed it."
      },
      {
        "paragraph": "Rodney’s heart calmed down again in an instant when he thought of the times Sarah made Shaun lose\nhis memories and the ambiguous relationship she had with Wesley."
      },
      {
        "paragraph": "“Enough, Rory. I don’t know what she told you, but I won’t believe it,” Rodney said hatefully, “I’ve\nwitnessed how important power, money, and benefits are for this woman.”"
      },
      {
        "paragraph": "“If I’m lying to you, I’ll be struck by lightning.” Rory swore.“ If you don’t believe me, you can ask"
      },
      {
        "paragraph": "President Yard. I met President Yard during a business banquet once. He said that Sarah previously\ntreated his mother and cured her. He owed Sarah a favor, so he agreed to put on a performance with\nher. To be honest, if she were that kind of woman, I wouldn’t even let you meet her. I just think that her\ncurrent state is too miserable.”"
      },
      {
        "paragraph": "Rodney looked at Rory closely."
      },
      {
        "paragraph": "Although his friendship with Rory could not compare to the friendship he had with Shaun and Chester,\nhe had known Rory for more than ten years. He still knew him to some extent."
      },
      {
        "paragraph": "It was unlikely that Rory was lying since he had already sworn on it."
      },
      {
        "paragraph": "There was no need for him to tell a lie for Sarah’s sake either."
      },
      {
        "paragraph": "However…"
      },
      {
        "paragraph": "Rodney was a little confused."
      },
      {
        "paragraph": "Was there really nothing going on between Sarah and President Yard?"
      },
      {
        "paragraph": "She did not betray him?"
      },
      {
        "paragraph": "However, even if Sarah did not betray Rodney, she still made a lot of mistakes."
      },
      {
        "paragraph": "Furthermore, Shaun and the others even said she had a shady relationship with Wesley. They said\nSarah was the one who swapped Jennifer’s ashes to a dog’s."
      },
      {
        "paragraph": "Those actions were all utterly despicable."
      },
      {
        "paragraph": "“Young Master Wooten, don’t say any more. The past is in the past.” Sarah lifted her lips helplessly. “\nMy current life isn’t that bad. Actually, the Neeson family’s status wasn’t high from the start. When I fell\nin love with Shaun and Rodney, it was all my wishful thinking. It’s normal that Rodney’s parents dislike\nme. He already has a family now and built himself a good career. I really don’t wish to disturb him. My\nsituation now is pretty good.”"
      },
      {
        "paragraph": "After Sarah spoke, she turned around and bent over to pick up the broken glass shards on the floor."
      },
      {
        "paragraph": "Rodney gazed at the wrist of her hand. She had gotten a lot thinner, and her bones were even\nprotruding from her flesh."
      },
      {
        "paragraph": "In the past, Sarah was like a goddess in his heart. He never thought she would end up in that state,\nwearing a ragged waitress uniform with a dull complexion. She could not return to the way she looked\nin the past."
      },
      {
        "paragraph": "“Stop picking them up. Your hands are bleeding from being cut by the glass,”  Rory reminded,“ I’ll have\nsomeone bring a broom to sweep the floor.” “No. If the floor manager finds out about this, he’ll say that\nI’m clumsy again,” Sarah said in a panic."
      }
    ]
  },
  {
    "title": "Chapter 1888 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Alright, don’t work here anymore. Switch to another job.” Rory looked at Rodney as he asked, “ What\ndo you think?”"
      },
      {
        "paragraph": "Rodney frowned. He said, “She has nothing to do with me anymore.”"
      },
      {
        "paragraph": "Sarah gave a small smile but still looked depressed. “I’m fine with working here. Although it’s a bit\ntough, this kind of life makes me feel more down to earth.”"
      },
      {
        "paragraph": "After she finished speaking, she left without even turning her head back."
      },
      {
        "paragraph": "Rodney sat at the table with a cold expression. His good mood was utterly ruined."
      },
      {
        "paragraph": "He took out his phone, wanting to call Shaun to tell him about Sarah."
      },
      {
        "paragraph": "However, Rodney suddenly recalled Rory’s words. Rory said that Sarah found President Yard to agitate\nRodney on purpose and make him leave her. She did that so he could reconcile with his parents."
      },
      {
        "paragraph": "It was true that after Sarah hurt Rodney, he realized his mistakes and returned to the Snow family. As\nUncle Nathan had become the prime minister, Rodney’s status changed as well."
      },
      {
        "paragraph": "If it was really true, then he would not have what he had today if not for Sarah’s sacrifice back then."
      },
      {
        "paragraph": "His thumb stiffened on top of the screen of his phone for a moment."
      },
      {
        "paragraph": "Rory stole a glance at Rodney’s expression.  “Should I not have called you here? I just did that\nbecause your status has changed. In the past, you kept pleasing Sarah, yet she only had eyes for\nShaun."
      },
      {
        "paragraph": "People will always want to have their first love. Look, Sarah has already become like this. You can\neasily take her to bed and have fun with her. It’s okay even if you secretly keep her by your side as\nyour mistress. With your status, it’s not like you don’t have the right to keep a lover. You can afford it\ntoo.”"
      },
      {
        "paragraph": "“Enough. I don’t care about how you choose to fool around,  but you should know that I’m  different\nfrom you.”"
      },
      {
        "paragraph": "Rodney found Rory’s words jarring. He grew furious. “Since I’m already married, I won’t do anything\nthat will betray my wife and child.”"
      },
      {
        "paragraph": "“Oh, please. We’re both guys. When Freya was pregnant, you didn’t want to take responsibility and still\nchose to be with Sarah.” Rory was unconvinced."
      },
      {
        "paragraph": "Bang!"
      },
      {
        "paragraph": "Rodney hit the table and got up. His handsome face was filled with anger. “I didn’t like Freya back then,\nbut I like her now.”"
      },
      {
        "paragraph": "Rory raised his eyebrows. He was pissed, but he understood that Rodney was not someone he could\noffend."
      },
      {
        "paragraph": "“Fine, just take it as me being nosy. Alright, I won’t say anything more. It’s my birthday today, so do me\na favor. Let’s eat,” Rory said as he forced a smile."
      },
      {
        "paragraph": "In the end, the meal was unpleasant and ended early."
      },
      {
        "paragraph": "After arriving at the parking lot, Rodney and Rory bid goodbye to each other. When they were about to\nleave, Sarah suddenly approached them nervously."
      },
      {
        "paragraph": "“I’m guessing she’s looking for you. I’ll be leaving first.” Rory flashed Rodney a profound smile, then got\nin his car and left."
      },
      {
        "paragraph": "Rodney had an icy expression and did not say a word until Sarah stood in front of him with her pale\nface."
      }
    ]
  },
  {
    "title": "Chapter 1889 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "It was almost winter. A gust of wind blew, and Sarah was shivering under her thin clothing."
      },
      {
        "paragraph": "Rodney gripped his car keys tight. He asked coldly with annoyance, “What do you want?”"
      },
      {
        "paragraph": "Sarah’s body trembled. She said while holding back her tears, “Rodney, I beg you not to tell anybody\nthat I’m here.”"
      },
      {
        "paragraph": "“You mean Shaun and Catherine, right?”"
      },
      {
        "paragraph": "Rodney sneered icily. “ It seems that you’re capable of feeling fear too. Then why did you help Wesley\ntarget Shaun? He was the person you used to love. Shaun became so miserable because of you. Ha,\nforget it. I almost  forgot  that what  you had for Shaun was most probably not love. When you went to\nthe mental hospital in the past, it was probably a scheme to approach him, huh? How many benefits\nhave you reaped from Shaun throughout  these years? I’ve never seen such a greedy woman like you.”"
      },
      {
        "paragraph": "“No, it’s not like that. I truly loved Shaun back then. I loved him for so long, but how did he treat me in\nthe end? I wasn’t satisfied. I really couldn’t accept that.” Sarah broke down in tears."
      },
      {
        "paragraph": "Rodney was utterly disappointed. “You finally admitted it. Sarah, you’re too scary. Maybe you’ve been\nthis scary all along. The three of us might’ve just been tools to you—”"
      },
      {
        "paragraph": "“Rodney, whether you believe it or not, it was indeed a coincidence that I met Shaun in the mental\nhospital back then. I didn’t know who he was. I was just a little over ten years old at that time. How\nwould I have known all those things? I studied psychology so diligently because I wanted to cure his\nillness. I even went overseas for my studies to make myself good enough for him, yet I experienced the\nworst nightmare of my life. But I still wanted to be with him. In the end, the man who said he loved me\nwasn’t faithful anymore after I was gone for only a few years.”"
      },
      {
        "paragraph": "Sarah smiled miserably. “That’s right. I did something when I was giving him treatment. I made him\nremember that he loved me alone.”"
      },
      {
        "paragraph": "“You’re really crazy.” Rodney found it hard to tolerate and shouted, “Do you know Shaun could’ve\nbecome mentally retarded if you had failed?”"
      },
      {
        "paragraph": "“I just thought that it would be fine even if Shaun became mentally retard. At least he would be by my\nside. It was better than him being with another woman.”"
      },
      {
        "paragraph": "Sarah cried out painfully and said, “I went mad for Shaun’s sake, but he still abandoned me after\nCatherine came back three years later. During the period he said he wanted to marry me, he would go\nto Catherine’s place every night and sleep with her. He lied to me again and again. I hated it, so I tried\nhard to hold onto his money to make him lose his status. At the same time, I wanted to let him know\nthat Catherine wouldn’t be with him if he lost everything. I was never aiming for his money. I just…\nwanted to make him miserable.”"
      },
      {
        "paragraph": "Rodney was confused. He did not know which of Sarah’s sentences was true and which of them was\nfalse. “What about the things that happened afterward? Shaun got hurt again from falling down the\nstairs. Security footage showed that you went to that place. After Shaun got hurt, you escaped from\nCanberra. Who else could’ve done it if not you?”"
      },
      {
        "paragraph": "“I did it.”"
      },
      {
        "paragraph": "Sarah was exhausted from crying. She nodded her head numbly. “That’s because after I left you, I was\ntrapped by Wesley. He got to know what I had done to Shaun from Catherine. He wanted to use me.”"
      },
      {
        "paragraph": "After she spoke, she rolled up her sleeves and revealed her scars."
      },
      {
        "paragraph": "Rodney widened his eyes in shock."
      },
      {
        "paragraph": "“Wesley locked me up. ” Sarah smiled bitterly. “I was living in darkness every day. I couldn’t even\ncommit suicide when I wanted to. When he wasn’t in a good mood, he would whip and hit me. He said\nthat if I didn’t help him, he would strip me naked and throw me out onto the streets.”"
      },
      {
        "paragraph": "Rodney’s head was buzzing. He kept asking himself if all of these words were true."
      },
      {
        "paragraph": "However, if they were not true, why would there be so many scars on her arms?"
      },
      {
        "paragraph": "“So… you did the same trick again and made Shaun lose his memories?”"
      },
      {
        "paragraph": "“Wesley was aiming to have me make Shaun a complete retard. I followed his order to deceive him.\nHowever, I did some tampering during the process. You might’ve sensed it too. Shaun didn’t really\nbecome a retard. He regained his intelligence later on. Toward the end, he would gradually recover his\nmemories, ” Sarah said in a low voice."
      },
      {
        "paragraph": "“Recover?”"
      }
    ]
  },
  {
    "title": "Chapter 1890 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rodney was stunned. “That’s impossible. The doctor said that he…”"
      },
      {
        "paragraph": "“That’s a very ancient forbidden skill. Other people will say that the chances of recovery are very slim,\nbut that’s because too few people truly understand the skill. I might’ve made Shaun seem like a retard,\nbut in truth, it was for him to walk out of a dead end. His intelligence will grow slowly from a young age.\nMaybe after half a year, he will completely regain his memories.”"
      },
      {
        "paragraph": "Sarah said calmly, “The memories will include the whole process of him and Catherine falling in love in\nMelbourne. It’ll be complete, without any missing pieces.”"
      },
      {
        "paragraph": "Rodney’s heart was in a mess. “Don’t try to lie to me.”"
      },
      {
        "paragraph": "“ I’m not lying. Maybe it still needs a month or so. Then, you can ask Shaun whether any familiar\nmemories have been coming back to him on and"
      },
      {
        "paragraph": "Sarah said in a self-deprecating way, “If I really wanted to destroy Shaun, he’d remain a crazy retard\nright now.”"
      },
      {
        "paragraph": "Rodney went silent."
      },
      {
        "paragraph": "He was half convinced and half suspicious of Sarah’s words."
      },
      {
        "paragraph": "However, it would be easy to verify her words too. All he had to do was ask Shaun after a month."
      },
      {
        "paragraph": "“Rodney, the reason I’m approaching you today is that I hope you won’t tell Shaun I’m here.” Sarah\nlooked toward Rodney with a pleading gaze."
      },
      {
        "paragraph": "“If what you say is true, you can explain it to Shaun “But I did alter his memories before this as well,\nwhich separated him and Catherine for three years. With his personality, he’ll kill me if he finds me. ”\nSarah’s lips curved helplessly. “Moreover, I was the one who gave Sheryl’s medicine to Wesley. I had\nno choice. If I didn’t, I would be in a living hell.”"
      },
      {
        "paragraph": "Rodney’s brows were knit in a tight frown."
      },
      {
        "paragraph": "Indeed, if Shaun and the others were to find out, Sarah would not only be killed by Shaun. She would\nalso be tortured to death by Titus."
      },
      {
        "paragraph": "Rodney heard that after Wesley was brought to Neah Bay, he was tortured to the point of pure misery."
      },
      {
        "paragraph": "At the end of the day, Sarah deserved to be hated. However, she was still quite pitiful."
      },
      {
        "paragraph": "After all, she used to be the woman he loved, and Rodney could not bear to see her like that."
      },
      {
        "paragraph": "After a long while, Rodney said, “ I can give you a month. If Shaun recovers some of his memories\nafter a month, I’ll sneak you out of the country to start a new life. However, if you’re lying, I can only\nhand you over to Shaun.”"
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "Sarah smiled and thanked him with tears in her eyes."
      },
      {
        "paragraph": "Rodney’s lips moved. His heart felt a little heavy, but he did not say a word. Instead, he opened the\ndoor of his car and was about to get in."
      },
      {
        "paragraph": "“Rodney, can I have your current phone number?” After that, Sarah quickly explained, “Don’t worry. I\nwon’t disturb you for no reason. I just think it’ll be more convenient for me to contact you if any urgent"
      },
      {
        "paragraph": "situation arises. I know that you have a new life, and I’m happy for you.”"
      },
      {
        "paragraph": "Despite saying that, her eyes were filled with sadness."
      },
      {
        "paragraph": "Rodney could not bear seeing her that way, so he told her his number and drove away."
      },
      {
        "paragraph": "As Sarah looked at the number on her phone, the mournful look on her face was replaced with\nsmugness."
      },
      {
        "paragraph": "Luckily,  Wesley did treat her as a piece of chess  back then. Therefore, whether it was President Yard\nor Rory, it was all a planned scheme. It was so that she could get back together with Rodney without a\nhitch  in the future."
      },
      {
        "paragraph": "As for Shaun’s matter, what she said was true. She did tamper with some things while keeping it a\nsecret from Wesley."
      },
      {
        "paragraph": "Wesley was confident that he would succeed, but Sarah could not place all her hopes on him."
      },
      {
        "paragraph": "Of course, if Wesley were to succeed, Shaun would not even have the chance to regain his memories.\nThat was because once Senator Mead took control of everything, the first thing Wesley would do was\ntorture Shaun to death."
      },
      {
        "paragraph": "If Wesley were to fail, then Shaun would be the only breakthrough for Sarah and Rodney to get back\ntogether."
      },
      {
        "paragraph": "Reality proved  that her decision back then was right."
      },
      {
        "paragraph": "Wesley’s luck was not that great."
      }
    ]
  },
  {
    "title": "Chapter 1891 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Today, the Snow family has become the most powerful family in Australia. As for Rodney, the Snow\nfamily had entrusted him with an important responsibility, so he had started to involve himself in the\nindustry of alternative energy."
      },
      {
        "paragraph": "If Sarah could get back together with Rodney, she would be able to turn her situation around again."
      },
      {
        "paragraph": "At the thought of her plan, Sarah felt very satisfied. Hurting her hand was worth it."
      },
      {
        "paragraph": "Rodney was distracted as he drove back to the villa."
      },
      {
        "paragraph": "There was only the housekeeper, Aunty Cally, at home."
      },
      {
        "paragraph": "“Young Master Snow, Young Madam Snow and Dani have gone to the manor to have their meal.”"
      },
      {
        "paragraph": "“Mm.”"
      },
      {
        "paragraph": "Rodney nodded and went upstairs with a heavy expression."
      },
      {
        "paragraph": "About half an hour later, Freya came back with Dani in her arms."
      },
      {
        "paragraph": "Aunty Cally secretly approached her. “Young Master is back. His expression is weird. I think he has\nsomething weighing on his mind.”"
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "Freya nodded with a smile."
      },
      {
        "paragraph": "By the time she was upstairs, Rodney was already in the shower."
      },
      {
        "paragraph": "He only came out after she was done feeding Dani. Since the floor heating in the house was on, he\nwore a T-shirt and a pair of pajama pants, revealing his muscular body."
      },
      {
        "paragraph": "Yes, Rodney’s body was muscular."
      },
      {
        "paragraph": "Freya only realized that recently when she was looking at his body. Rodney was pretty fit in parts that\nwere supposed to be fit despite having a feminine face. It felt pleasant to the touch."
      },
      {
        "paragraph": "Remembering that she had hugged his waist last night, her blood started pumping a little."
      },
      {
        "paragraph": "“Didn’t you say it was Young Master Wooten’s birthday? You’ re back so early.” Freya dismissed the\ndirty thoughts in her mind and said, “I don’ t expect you to come back right after dinner. It’s fine as long\nas you return before 9:00 p.m.”"
      },
      {
        "paragraph": "“I came back after dinner. I find doing other stuff boring.”"
      },
      {
        "paragraph": "Rodney did not dare to tell Freya that he had met Sarah. Hence, he said sheepishly,  “It’s nothing more\nthan going to the karaoke, the bar, or the club. It gets quite boring after a while. I’d rather come home\nand accompany you and the child.”"
      },
      {
        "paragraph": "Upon hearing that, Freya stared at him attentively. “ Have you finally decided to concentrate on more\nserious things? If I remember correctly, you used to like having fun with your buddies.”"
      },
      {
        "paragraph": "“Mm, but wasn’t I kicked out of the Snow family last time? All of them avoided me back then, yet now\nthey’re trying to please me. It’s pretty meaningless. Not many of them are sincere.” Rodney took Dani\nover from Freya’s embrace. “ Baby, did you miss Daddy?”"
      },
      {
        "paragraph": "Dani grinned and laughed happily when she saw Rodney."
      },
      {
        "paragraph": "Then, Freya remembered Aunty Cally’s words. She hesitated for a moment and asked, “How’s your\nwork going? I heard Carson saying there were some problems with the project  at Cairns a while\nback…”"
      },
      {
        "paragraph": "“The problem has been solved, and everything is going smoothly there. I may have to go over for a\nbusiness trip once in a while, but don’t worry. I’ll come back after a day or two at most.” Rodney quickly\nhugged Freya’s waist. He felt an itch in his heart as he gazed at the stunning little face of the woman in\nhis embrace."
      },
      {
        "paragraph": "However, Sarah’s sad face flashed across his mind for one moment, and he felt troubled again."
      },
      {
        "paragraph": "“Freya, you can take a shower. I’ll play with the baby.”"
      },
      {
        "paragraph": "“Mm.”"
      },
      {
        "paragraph": "After Freya got up, Rodney stared at her back and thought, ‘So what even if Rory’s words were true?’\nHe already had a married life of his own anyway."
      },
      {
        "paragraph": "He was satisfied. Once he verified whether Sarah’s words were valid or not, he would send her away\nimmediately."
      }
    ]
  },
  {
    "title": "Chapter 1892 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "At night, Rodney tossed and turned in bed. Luckily, Sarah did not contact him."
      },
      {
        "paragraph": "After a few days had passed, Rodney had to go on a business trip to Cairne for two days."
      },
      {
        "paragraph": "The night before he left, he could not miss out on making out with Freya."
      },
      {
        "paragraph": "“Wifey, I’ll be going for two days. Let’s do it once more, okay?” Rodney pestered her by kissing her."
      },
      {
        "paragraph": "Freya could cry. It was already the second time, and she was utterly exhausted. “Hey, you’re only going\nfor two days, and I’ve already made the payment upfront. Do you know no shame?”"
      },
      {
        "paragraph": "“No, I still have to collect the interest.” Rodney kept arousing her."
      },
      {
        "paragraph": "Although he did not have much experience before, that did not stop him from learning more from his\nexperiences. He could finally put them into use."
      },
      {
        "paragraph": "Freya was also a rookie in that area. However, since they had spent so much time together, they knew"
      },
      {
        "paragraph": "each other’s bodies to a certain extent. Rodney knew which parts she liked, so he would keep\nstimulating that part."
      },
      {
        "paragraph": "Soon, Freya could not resist anymore. Rodney was about to have his way."
      },
      {
        "paragraph": "Suddenly, the phone rang."
      },
      {
        "paragraph": "“The phone…”"
      },
      {
        "paragraph": "“Ignore it.”"
      },
      {
        "paragraph": "Rodney was not in the mood to care about the call. Only after they were done did he turn his body and\npick up the phone lazily. There were two unknown missed calls and two messages."
      },
      {
        "paragraph": "[Rodney, can you come  to our manor? My boss found an excuse and insisted  on keeping  me tonight.\nThere’s only the both of us here now. He’s looking at me strangely.]"
      },
      {
        "paragraph": "[Can you come quickly? I’m hiding in the bathroom. He’s waiting for me outside. I’m so scared…]"
      },
      {
        "paragraph": "It turned out that the call just now was from Sarah. Rodney shuddered."
      },
      {
        "paragraph": "The last message was received ten minutes ago."
      },
      {
        "paragraph": "For a woman who was waiting for help, many things could have happened in that time frame."
      },
      {
        "paragraph": "“Wifey, you can go to sleep first. I have to go out because of an urgent matter. Don’t wait for me.”"
      },
      {
        "paragraph": "Rodney quickly put on his clothes before he rushed out in a hurry without even doing his hair."
      },
      {
        "paragraph": "He was so fast that Freya could not even react."
      },
      {
        "paragraph": "She did not know what had happened to put him in such a hurry."
      },
      {
        "paragraph": "Could it be a company matter?"
      },
      {
        "paragraph": "Freya felt a little uncomfortable. She felt like she was a rag that was thrown aside after its use."
      },
      {
        "paragraph": "Usually, Rodney would help her to take a shower and wipe her body."
      },
      {
        "paragraph": "She was usually not that unreasonable. Perhaps she was just too tired that day."
      },
      {
        "paragraph": "She did not even have the strength to get down from the bed."
      },
      {
        "paragraph": "Forget it. She could not be so narrow-minded. After all, anyone would have urgent matters."
      },
      {
        "paragraph": "Rodney sped toward the manor."
      },
      {
        "paragraph": "Even though he drove very quickly, it was about half an hour later when he arrived."
      },
      {
        "paragraph": "During that time, he called Sarah’s phone, but no one picked up."
      },
      {
        "paragraph": "He hit the steering wheel a few times out of frustration. He should have picked up the phone call just\nnow. Was he that hungry for s*x?"
      },
      {
        "paragraph": "Sarah had experienced a devastating shock when she was in the US. If she were to go through it again\nRodney could not imagine it."
      },
      {
        "paragraph": "By the time he arrived at the manor, the doors were closed. Hence, he climbed over the wall to get in.\nOut of the whole manor, only the dining area on the second floor had its lights on."
      }
    ]
  },
  {
    "title": "Chapter 1893 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "Rodney rushed in and kicked open the balcony door on the second floor."
      },
      {
        "paragraph": "“Don’t come in…”"
      },
      {
        "paragraph": "A vase was thrown at him."
      },
      {
        "paragraph": "Rodney hurriedly dodged. When he looked into the room, he saw Sarah disheveled and curled in the\ncorner with tears on her face. At her feet lay a fat middle -aged man’s naked and disgusting body, as\nwell as his bleeding head."
      },
      {
        "paragraph": "He knew at a glance what happened."
      },
      {
        "paragraph": "“Sarah, don’t be scared. It’s me,” Rodney said softly."
      },
      {
        "paragraph": "“Rodney, you’re here. Why are you so late?” Sarah slowly slumped down at the corner, hugging herself\ninto a ball helplessly and painfully. “I thought you wouldn’t come. I was so scared. He kept trying to\nforce himself on me, and I had no choice but to smash his head. I don’t know if he’s still alive. I might\nhave killed someone.”"
      },
      {
        "paragraph": "Rodney suddenly took pity on her."
      },
      {
        "paragraph": "He hurriedly took off his jacket and draped it over her shoulders. Then, he squatted down and checked\nthe middle-aged man’s breathing. “He’s not dead. We’ll send him to the hospital.”"
      },
      {
        "paragraph": "“But…” Sarah was frightened. “What if he calls the police…”"
      },
      {
        "paragraph": "“ I’ll send him to a private hospital. Chester won’t know about this.” Rodney comforted her. “And… he\nwon’t be able to stay in Canberra anymore."
      },
      {
        "paragraph": "Someone like him doesn’t have the right to own a manor.”"
      },
      {
        "paragraph": "“Thank you.” Sarah looked at him with tears of gratitude. “I didn’t expect you to come.”"
      },
      {
        "paragraph": "Rodney was a little afraid to meet her eyes. “I’ll make a call first.”"
      },
      {
        "paragraph": "He dialed his assistant’s number and told him the details."
      },
      {
        "paragraph": "After hanging up, he hesitated and said to Sarah, “ I’ll send you back.”"
      },
      {
        "paragraph": "“…Okay.” Sarah hesitated a moment  before nodding. However, when she got up, her body fell to the\nground in pain."
      },
      {
        "paragraph": "“Easy there.” Rodney subconsciously held her."
      },
      {
        "paragraph": "“I’m sorry. I bumped my knee when I pushed him, ” Sarah said in a low voice."
      },
      {
        "paragraph": "Rodney thought about it and finally picked her up."
      },
      {
        "paragraph": "Sarah could instantly smell the fragrance of an unfamiliar woman on him, and a hint of annoyance\nwelled up in her."
      },
      {
        "paragraph": "She used to look down upon Rodney in the past, but she did not think he would be seduced to bed with\nFreya."
      },
      {
        "paragraph": "Freya and Catherine were probably the two women she hated most in her life."
      },
      {
        "paragraph": "However, she did not dare to reveal any expression on her face. She simply said with remorse, “I’m\nsorry… Did I disturb Freya and you by suddenly contacting you tonight?”"
      },
      {
        "paragraph": "“No,” Rodney denied it."
      },
      {
        "paragraph": "Sarah forced a smile. “I can smell the scent of a woman on you. It’s good that you’ve found happiness.”"
      },
      {
        "paragraph": "Although she was smiling, there were tears at the bottom of her eyes."
      },
      {
        "paragraph": "Rodney was a little upset, but he pursed his lips and did not say anything."
      },
      {
        "paragraph": "After putting her in the car and asking for her address, he drove the car to take her there."
      },
      {
        "paragraph": "When they reached their destination, Rodney was stunned to see the dilapidated building. “You live in\nthis place?”"
      },
      {
        "paragraph": "“Yeah. This is the only place that doesn’t require an ID. You can live here as long as you pay, and the\nrent is cheap too,” Sarah said softly."
      },
      {
        "paragraph": "“Are you that short of money?” Rodney frowned."
      },
      {
        "paragraph": "“After I lost that lawsuit, I gave all my money to Shaun.” Sarah bit her lip. “Then, Wesley caught me. I\nhaven’t been able to earn money ever since.”"
      },
      {
        "paragraph": "“Give me your bank account. I’ll transfer some money to you.” Rodney took out his phone."
      },
      {
        "paragraph": "“No, I don’t want to owe you anymore…”"
      },
      {
        "paragraph": "“Pay me back in the future. ” Rodney interrupted her. “I’m only lending you this money. Also, if I find out\nthat you’re lying to me about Shaun, I won’t let you off, never mind this money.”"
      },
      {
        "paragraph": "“I’m not lying to you… ” Sarah took out her phone weakly."
      },
      {
        "paragraph": "After getting her account, Rodney transferred five grand to her. It was not that he had no money, but\nSarah was nothing to him anymore. It would not make sense if he gave her too much."
      }
    ]
  },
  {
    "title": "Chapter 1894 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“This house is terrible. It’s not safe for a woman to live here alone. Go and find another place to stay. If\nyou spend wisely, this money should be enough for a month…”"
      },
      {
        "paragraph": "Sarah hesitated before asking, “Can you find a place for me? I don’t dare to run around now, and the\nhousing agencies need to see an ID card…”"
      },
      {
        "paragraph": "Rodney frowned. He did have a property under his name, but he had told Freya about it before."
      },
      {
        "paragraph": "Although she did not check, it would be troublesome if she found out."
      },
      {
        "paragraph": "He thought about it and called Rory. “Let Sarah live in the small apartment  under your name  for a\nmonth. I’ll pay the rent.”"
      },
      {
        "paragraph": "“Oh, so you’ve decided to care for her after all,” Rory teased."
      },
      {
        "paragraph": "“It’s not what you think…”"
      },
      {
        "paragraph": "“It’s fine. Since Young Master Snow has asked,  I’ll get it done. I guarantee that no one will know about\nthis. At most, I’ll declare to the public that I have a"
      },
      {
        "paragraph": "sugar baby. I have a ton anyway, so one more doesn’t matter.”"
      },
      {
        "paragraph": "With that, Rory gave him the address of an apartment."
      },
      {
        "paragraph": "Rodney then sent Sarah to Rory’s apartment."
      },
      {
        "paragraph": "“Don’t go to work this month. Just stay here. If Shaun is fine, then I’ll send you abroad.”"
      },
      {
        "paragraph": "After that, he drove away."
      },
      {
        "paragraph": "It was already 1:oo a.m. by the time he returned to the villa."
      },
      {
        "paragraph": "He quietly took a bath downstairs before going upstairs to sleep."
      },
      {
        "paragraph": "Freya was already asleep."
      },
      {
        "paragraph": "When he looked at her and recalled what happened tonight, he could not fall asleep."
      },
      {
        "paragraph": "The next day, Freya woke up and asked him, “What time did you come back last night? I didn’t know\nyou came back at all.”"
      },
      {
        "paragraph": "“Around 1:00 a.m. You were sleeping like a little pig,” Rodney said vaguely."
      },
      {
        "paragraph": "“You’re the pig.” Freya hammered her fist on him but did not use much strength. “What did you do last\nnight? You left in such a hurry.”"
      },
      {
        "paragraph": "“There was an emergency at the company, so I went over to solve it. It’s fine now.” Rodney was afraid\nthat she would ask more questions, so he quickly turned around to tease Dani."
      },
      {
        "paragraph": "Freya looked at him for a moment and kicked him lightly. “No gift today?”"
      },
      {
        "paragraph": "Rodney froze for a while and quickly said, “There is, there is. I came back too late yesterday and forgot\nto get it. It’s in the car. I’ll go get it now.”"
      },
      {
        "paragraph": "Within a few minutes, he came back with a gift box."
      },
      {
        "paragraph": "Freya opened it and took a look. It was a brand new scarf from a high-end foreign luxury brand."
      },
      {
        "paragraph": "It was also the perfect time for her to wear it now."
      },
      {
        "paragraph": "“Thank you, hubby. ” She plucked up the courage and moved over to kiss his face gently."
      },
      {
        "paragraph": "After the kiss, she felt quite embarrassed. After all, it was her first time consciously calling him hubby."
      },
      {
        "paragraph": "The previous times she called him was because he had forced her to while they were in bed."
      },
      {
        "paragraph": "She did not feel shy back then, but she did now. Rodney was overwhelmed. “Say that again.”"
      },
      {
        "paragraph": "“No.” Freya turned her head and left."
      },
      {
        "paragraph": "“Come on, honey. ” Rodney took her into his arms."
      },
      {
        "paragraph": "Freya closed her eyes. Now, she really wanted to carry on this marriage and live a good life."
      },
      {
        "paragraph": "She could tell how well Rodney treated her. Furthermore, he was good-looking, rich, and a good cook.\nHe even had a great body. They were together day and night, so it was only natural for her to feel\nsomething for him. After all, she was human."
      },
      {
        "paragraph": "Of course, she had not reached the point of falling in love with him yet."
      }
    ]
  },
  {
    "title": "Chapter 1895 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Rodney, you don’t have to give me gifts every day. Although I like them, I can’t use all of them. It’s a\nwaste of money. In the future, you can gift me something once or twice a month.”"
      },
      {
        "paragraph": "“…Okay.”"
      },
      {
        "paragraph": "Rodney nodded."
      },
      {
        "paragraph": "Frankly speaking, there was no problem giving her gifts every day, and money was not a problem\neither. However, it was a little difficult to give her different presents every time."
      },
      {
        "paragraph": "After breakfast, Freya sent Rodney to the airport."
      },
      {
        "paragraph": "The secretary, Hans Fleming, had already been waiting there for a while."
      },
      {
        "paragraph": "When Rodney arrived, he immediately went up to get the former’s luggage."
      },
      {
        "paragraph": "It was not until Freya left that he whispered,  “ Young Master Snow, the owner of that manor has been\ntaken care of. He won’t dare to talk about what"
      },
      {
        "paragraph": "happened last night. I’ll send him to prison for a while, and when he comes out, he’ll leave Canberra\nobediently.”"
      },
      {
        "paragraph": "Rodney nodded. “Did you find out what happened?”"
      },
      {
        "paragraph": "“He said that Sarah’s very beautiful and that he had been watching her for a while. Since he noticed\nthat she wasn’t married, didn’t have a man, and seemed hard-pressed for money, he wanted to sleep\nwith her. He gave her several hints before, but she didn’t listen. That was why he tried to force himself\non her last night.”"
      },
      {
        "paragraph": "“Trash.” Rodney’s eyes looked angry."
      },
      {
        "paragraph": "Hans hesitated for a while and said, “Young Master Snow, you already have a wife. I think it’s better to\nleave Ms. Neeson alone. If— ”"
      },
      {
        "paragraph": "“Don’t worry. It’s just for one month, and I won’t care about her much. As long as she stays at Rory’s\nplace and doesn’t come out, nothing will happen after this month passes. ” Rodney interrupted him."
      },
      {
        "paragraph": "Hans was relieved to see that Rodney knew what he was doing."
      },
      {
        "paragraph": "He had been with Rodney for six to seven years. Rodney was at his worst when the Snow family cut off\ntheir ties to Rodney, and as Rodney’s secretary, he had a hard time as well. Hence, he really hoped"
      },
      {
        "paragraph": "that Rodney would stop being entangled with Sarah."
      },
      {
        "paragraph": "Cairns was a newly rising tourist city in the coastal area."
      },
      {
        "paragraph": "Seven or eight years ago, it was only a small city. However, due to its superior geographical\nenvironment and rapid development in the past two years, as well as the support from the government,\ncountless real estate developers and entrepreneurs came to Cairns for investment and development. In\njust a few years, it had become a large city."
      },
      {
        "paragraph": "Once Rodney arrived at Cairns, he first inspected the factory before having a meal with some local\nleaders and signed an investment agreement. In the evening, he was invited to a banquet."
      },
      {
        "paragraph": "“Young Master Snow, I know you have a distinguished status, but there’s no harm in getting to know\nmore bigwigs. Those here at the banquet tonight are all bosses who have invested a lot in Cairns over\nthe past few years. Do you see that black"
      },
      {
        "paragraph": "-suited guy there? He’s a car manufacturer. Last year, he set up a car factory here in Cairns, and I\nheard he intends to manufacture alternative energy cars. You both can get to know each other and\nperhaps collaborate on something.”"
      },
      {
        "paragraph": "Director Wale, the person who brought him here, introduced him with a smile on his face."
      },
      {
        "paragraph": "“That person over there in the suit is the owner of Florace Corporation. He invested 5oo billion dollars\nin Cairns last year."
      },
      {
        "paragraph": "Rodney nodded and took note."
      },
      {
        "paragraph": "However, before he could go over, many people had come over to greet him."
      },
      {
        "paragraph": "Although it was his first time in Cairns, many people had already heard the news about the Snow family\ncoming to Cairns for investment."
      },
      {
        "paragraph": "The Snow family was a family respected by the entire country."
      },
      {
        "paragraph": "“Young Master Snow, I’ve heard a lot about  you. But I didn’t expect to see you today. You’re really\nhandsome. ” The boss of Florace Corporation joked."
      },
      {
        "paragraph": "“You flatter me. I was just about to go over to greet you. After all, I’m your junior…”"
      },
      {
        "paragraph": "Rodney chatted with the bosses."
      },
      {
        "paragraph": "When he finally ended the social niceties with one boss, he took a sip of red wine, and another man’s\nvoice suddenly sounded behind him."
      },
      {
        "paragraph": "“Young Master Snow, we meet again. This must be fate.”"
      },
      {
        "paragraph": "Rodney turned around and froze when he saw that face."
      },
      {
        "paragraph": "He did not expect to see President Yard from Helios Investment Group here."
      },
      {
        "paragraph": "The memory of President Yard was deeply engraved in his mind."
      },
      {
        "paragraph": "Rodney’s face instantly went cold."
      }
    ]
  },
  {
    "title": "Chapter 1896 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Young Master Snow, it’s been a while. You look more and more dashing.”"
      },
      {
        "paragraph": "President Yard grinned at him as if they were very close. “I heard that you’ re with an excellent lady\nthese days. Congratulations.”"
      },
      {
        "paragraph": "Rodney’s handsome face was cold. “I don’t think I deserve your congratulations, President Yard. In\nyour eyes, I’m probably just a useless piece of trash. I still remember every word you said to humiliate\nme.”"
      },
      {
        "paragraph": "“Young Master Snow,  that was a misunderstanding, ” President Yard said with a vague smile.\n“Besides, you should thank me instead. If it weren’t for my words back then, how would you have\nreturned to the Snow family, let alone married a beautiful and loving wife? Now, you have  a successful\ncareer and a happy  family. You can be considered a winner in life.”"
      },
      {
        "paragraph": "Rodney suddenly remembered Rory’s words. His heart moved slightly as he sneered, “So you’re\nsaying I should thank you instead.”"
      },
      {
        "paragraph": "“Exactly. ” President Yard raised his eyebrows and nodded."
      },
      {
        "paragraph": "“Hah…”"
      },
      {
        "paragraph": "Rodney snickered. If they were not in public, he would have punched President Yard already."
      },
      {
        "paragraph": "To be honest, he no longer cared about President Yard."
      },
      {
        "paragraph": "“President Yard, since you know that my career is going well, you should understand that I’m not the\nsame as I was before. As long as I say the word, the project in your hands will be stopped, your funds\nwon’t be returned, and your value will plummet. I can make you go bankrupt.”"
      },
      {
        "paragraph": "There was a flash of fear in President Yard’s eyes, but he still smiled and said, “That’s not necessary,\nYoung Master Snow. We don’t have such a huge grudge between us. Besides, even though it looked\nlike I took Sarah away back then, nothing happened between us.”"
      },
      {
        "paragraph": "“Do you think I’ll believe that?” Rodney looked at him coldly."
      },
      {
        "paragraph": "“ Speaking of Sarah, she really cares a lot for you.”"
      },
      {
        "paragraph": "President Yard said, “When she cured my family’s illness, I wanted to pay her, but she refused to\naccept my money and said she wanted a favor from me. She requested me to pretend that she\ncheated on you with me so that you would misunderstand, give up on her, and leave on your own\naccord. When I asked why, she said she didn’t want to see your company suffer. She said that your\nfamily doesn’t like her, and she didn’t want you to leave them for her since she was also afraid that you\nwould regret i t in the future. Even when you guys were together, she could tell that you really wanted\nto go back to the Snow family. However, you couldn’t because of her. You even drifted away from your\nbest friends."
      },
      {
        "paragraph": "“She hoped you could continue to be the spirited and ambitious Young Master Snow you used to be,\nwithout being ridiculed and trampled on.”"
      },
      {
        "paragraph": "President Yard took a sip of red wine and glanced at Rodney’s lost expression. He then smiled. “I’m\ntelling the truth. She also knew it was hard to get you to leave, so she asked me to cooperate with her\nand portray her as a gold-digging, selfish, and vicious woman. That way, you won’t feel guilty about\nleaving her.”"
      },
      {
        "paragraph": "“Why should I believe what you’re saying?” Rodney suppressed the shock he was feeling and asked in\na low, cold voice."
      },
      {
        "paragraph": "“You can go ahead and check what I’ve done this year. I’ve only had two women, and I’m about to get\nmarried in two months.”"
      },
      {
        "paragraph": "President Yard shrugged. “Less than half a month after that, I left the capital to develop and invest in\nCairns. Sarah didn’t come here, and there were no monetary transactions between us. In fact, Sarah\nknew your location and deliberately took me to the bar that day. When we went to the hotel, we got\nseparate rooms. You can go ahead and check. You’ll find records of what I’ve said.”"
      },
      {
        "paragraph": "Rodney was as motionless as a statue."
      },
      {
        "paragraph": "President Yard raised his glass. “As I said, you should thank me instead. If I hadn’t played along with\nher, how would you have been willing to return to the Snow family? Now, your uncle is the prime\nminister, and you’re married to the prime minister’s goddaughter. Your family is also so satisfied with\nyou that they’ve handed over big projects of Snow Corporation to you. Now, you’re held in high esteem\nand respected everywhere you go.”"
      },
      {
        "paragraph": "“Think about what would’ve happened if Sarah continued to stay by your side. You would’ve had to\nlower yourself to the ground while looking at the high and mighty Snow family. You’d be ridiculed by\nothers, and your friends would distance themselves from you. If your career doesn’t go well, your family\nwill ignore you and protect another woman instead. Don’t you get jealous when you see your elder\nsister and younger brother climb higher and higher? As time passes, you won’t be happy either. You\nmight even come to hate Sarah.”"
      },
      {
        "paragraph": "Rodney felt conflicted. “Did she tell you all that?”"
      },
      {
        "paragraph": "President Yard nodded. “Women are always more rational and can see further than men. Sarah said\nshe liked you, so she should stay away from you and let you fly high instead.”"
      },
      {
        "paragraph": "After the party, Rodney did not know how he made it back to the hotel. His mind was filled with what\nPresident Yard said."
      }
    ]
  },
  {
    "title": "Chapter 1897 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "When Rory said it last time, Rodney did not believe him."
      },
      {
        "paragraph": "However, it was different when it came from President Yard, who was directly involved."
      },
      {
        "paragraph": "He could not fathom Sarah using such an embarrassing method to leave him because she wanted him\nto spread his wings and fly high."
      },
      {
        "paragraph": "It turned out that she really did like him."
      },
      {
        "paragraph": "It turned out that she had made so many sacrifices for him."
      },
      {
        "paragraph": "It turned out that he had been wrong about her."
      },
      {
        "paragraph": "She suffered so much, yet he swiftly married another woman and had a child."
      },
      {
        "paragraph": "Rodney suddenly felt like a sc*mbag. Just then, Freya called."
      },
      {
        "paragraph": "When he saw her name, he had no idea how to face her."
      },
      {
        "paragraph": "Freya was innocent. He knew that."
      },
      {
        "paragraph": "However, when he thought of Sarah’s cautious appearance and how humble she looked when she was\nworking in the restaurant, he was overwhelmed with guilt."
      },
      {
        "paragraph": "The phone rang and stopped."
      },
      {
        "paragraph": "Rodney stood in front of the floor-to-ceiling window for a long time. Then, a knock sounded at the door,\nand Hans came in. “Young Master Snow, the Missus called me earlier, saying that you didn’t answer\nher call. She was worried about you.”"
      },
      {
        "paragraph": "“Was that what she said?” Rodney asked while feeling conflicted."
      },
      {
        "paragraph": "Hans fell silent."
      },
      {
        "paragraph": "In fact, Freya’s actual words were, “Rodney didn’t pick up my call. Did he drink too much? Go and\ncheck up on him before he drinks himself to death. I don’t want Dani to lose her father so young.”"
      },
      {
        "paragraph": "Although the words were a little rough, the concern was definitely there."
      },
      {
        "paragraph": "“Hans, check President Yard’s relationship history and find out if he and Sarah slept in separate rooms\nthe night I broke up with Sarah. ” Rodney was silent for a moment before giving the order."
      },
      {
        "paragraph": "Hans froze, feeling a little sad for Freya. “Young Master Snow, that’s… not a good idea. You’re\nmarried.”"
      },
      {
        "paragraph": "“ I know. I just want to clarify something. Even if it’s true, I don’t plan to divorce Freya. I’ll just… make it\nup to Sarah a little more,” Rodney said."
      },
      {
        "paragraph": "“But if the Missus finds out… The consequences will be terrible.”"
      },
      {
        "paragraph": "“Then don’t  let her know.” Hans frowned."
      },
      {
        "paragraph": "Women could be exceptionally perceptive sometimes. He was not as sure and optimistic as Rodney."
      },
      {
        "paragraph": "Ten minutes later, Freya received a call from Hans. “ Young Master Snow drank too much tonight and\nwent straight to sleep after returning to his room.”"
      }
    ]
  },
  {
    "title": "Chapter 1898 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Why did he drink so much?” Freya was slightly surprised."
      },
      {
        "paragraph": "She remembered that Rodney would not usually drink much when he went out to socialize."
      },
      {
        "paragraph": "She did not expect him to be so liberal on a business trip."
      },
      {
        "paragraph": "If a woman took advantage of his situation, it would be easy for him to get drunk and do something\ndisorderly, right?"
      },
      {
        "paragraph": "“There were too many big shots tonight, so Young Master Snow couldn’t refuse them. After all, those\npeople came to Cairns earlier than him, and they might work together in the future.” Hans tactfully\nspoke up for Rodney."
      },
      {
        "paragraph": "“Alright. In that case… tell the hotel to serve him a light breakfast tomorrow. Also, tell him that he’s not\nallowed to get drunk again.”"
      },
      {
        "paragraph": "Freya then hung up immediately."
      },
      {
        "paragraph": "Sometimes, she still had to show concern for him."
      },
      {
        "paragraph": "After all, if she wanted to carry on this marriage seriously, she could not be too unreasonable."
      },
      {
        "paragraph": "Rodney was absent."
      },
      {
        "paragraph": "After she finished with work, there was no one to rush her home. Hence, she took Dani and went on a\nwalk with Catherine."
      },
      {
        "paragraph": "Catherine also brought Lucas and Suzie along. The two children were overjoyed when they saw Dani."
      },
      {
        "paragraph": "“Mommy, Dani looks prettier and prettier. She was like a wrinkled monkey when she was born.” Suzie\npinched Dani’s little face. “I like her a lot.”"
      },
      {
        "paragraph": "“If you like her, tell your mommy to give you one.” Freya teased with a smile."
      },
      {
        "paragraph": "“Cough…”"
      },
      {
        "paragraph": "Catherine almost choked on her tea, and she rolled her eyes speechlessly. “You’re insane.”"
      },
      {
        "paragraph": "“Having us is enough for Mommy.” Lucas said coolly, “Godmother, you can give Dani a younger\nbrother.”"
      },
      {
        "paragraph": "“There’s no need for that. You can help me protect her in the future.”"
      },
      {
        "paragraph": "Freya hurriedly waved her hand. Give birth again? He must be joking. She never wanted to experience\nthat kind of pain ever again."
      },
      {
        "paragraph": "“Will the Snow family agree if you don’t have a son?” Catherine frowned. “Although the Snow family\nlikes Dani and you very much, they’re a big family. They attach a lot of importance to family\nsuccession.”"
      },
      {
        "paragraph": "“There’s still Carson,” Freya muttered."
      },
      {
        "paragraph": "“That’ll depend on whether he has a boy or girl after he gets married. If it’s a girl, you’ll have to have\nanother child.”"
      },
      {
        "paragraph": "Catherine sipped her tea quietly."
      },
      {
        "paragraph": "The Hill family may be complex, but they were much simpler compared to the Snow family, who were\ninvolved in both the political and business circles."
      },
      {
        "paragraph": "Otherwise, Old Master Snow would not have held back for so many years and used the Snow family’s\nheart and soul to push Nathan onto that high pedestal."
      },
      {
        "paragraph": "“We’ll see.” Freya was a little distracted."
      },
      {
        "paragraph": "In fact, after Dani was one month old, they would sometimes go to the Snow family’s place, where the\nother women in the family would start to joke that she and Rodney could prepare for their second child\nin another year."
      },
      {
        "paragraph": "She smiled and remained silent. The family elders did not say anything either, which meant that they\ntacitly agreed with it."
      },
      {
        "paragraph": "“Yeah, there’s no rush. When Dani is older and your relationship with Rodney improves, maybe you’ll\nwant to have a child with him willingly in the future.”"
      },
      {
        "paragraph": "Catherine took out her phone. “I received this message yesterday.”"
      },
      {
        "paragraph": "Freya leaned over and saw that it was a message from an unknown number. [Sarah Neeson has\nreturned to Canberra. Be careful.]"
      },
      {
        "paragraph": "She froze. “Who’s it from?”"
      },
      {
        "paragraph": "“I don’t know.” A name flashed in Catherine’s mind, but she did not voice it."
      }
    ]
  },
  {
    "title": "Chapter 1899 - Let Me Go, Mr. Hill!",
    "sub_title": "test",
    "reading_time": 0.0,
    "content": [
      {
        "paragraph": "“Sarah is really back?” Freya was surprised. “ Is it just a ruse, or is it true? Haven’t you and Shaun\nbeen looking for her?”"
      },
      {
        "paragraph": "“Yeah. There’s been no news.”"
      },
      {
        "paragraph": "“The person who sent the message is much more skillful than you?” Freya was filled with doubt. “ They\nfound her even though you didn’t?”"
      },
      {
        "paragraph": "“I think it’s true. Whoever this is should be Sarah’s enemy,” Catherine said. “I don’t think we’re the only\npeople Sarah provoked. Besides, don’t you think it’s strange that Thomas disappeared?”"
      },
      {
        "paragraph": "“That’s true. I quite hate Thomas, but since he disappeared, I don’t even have the chance to get even.”"
      },
      {
        "paragraph": "Freya became inexplicably upset. Sarah was a person she absolutely hated."
      },
      {
        "paragraph": "During Catherine’s accident back then, she was badly hurt by the Neeson siblings. Of course, the most\nunforgivable thing was the death of Charity’s parents."
      },
      {
        "paragraph": "“But Sarah lost all her backers. Why is she back? If I were her, I’d hide overseas and never come\nback.” She could not help but mutter."
      },
      {
        "paragraph": "“I don’t know. ” Catherine gave her a thoughtful look. “Keep an eye on Rodney.”"
      },
      {
        "paragraph": "Freya’s heart skipped a beat. “What for? He won’t be that stupid. Come on, Sarah humiliated him\nmiserably back then and trampled on his dignity. He hates her to death.”"
      },
      {
        "paragraph": "“I’m  just being cautious.”"
      },
      {
        "paragraph": "Catherine pondered deeply. “After what happened with Rebecca, I’ve learned to never underestimate\nwomen who are good at pretending to be innocent. Sarah’s schemes are no weaker than Rebecca’s. In\nfact, she might be more dangerous than Rebecca. After all, she played Shaun, Chester, and Rodney\nlike fiddles. Do you think that’s something Rebecca could’ve done?”"
      },
      {
        "paragraph": "Rebecca definitely could not."
      },
      {
        "paragraph": "Rebecca simply relied on Wesley’s help and took advantage of the mother Catherine had never met…"
      },
      {
        "paragraph": "Freya said irritably, “If Rodney gets involved with Sarah again, I’ll castrate him, divorce him, and make\nsure our paths never cross again.”"
      },
      {
        "paragraph": "“ I’m just asking you to keep an eye out. It should be impossible. After all, he’s not that stupid.”\nCatherine laughed. “Rodney has everything he could ever wish for now. He has a beautiful wife to hold\nand his cute, lovely daughter. He wouldn’t bear to let you go.”"
      },
      {
        "paragraph": "Freya scoffed. “True. I’m much better compared to Sarah. We have to catch her this time and avenge\nCharity.”"
      },
      {
        "paragraph": "“That’s for sure.”"
      },
      {
        "paragraph": "These two days, there was not much contact between Freya and Rodney."
      },
      {
        "paragraph": "She only knew that he would come back on the third day, and when she called to ask, Rodney said that\nhe would not arrive in Canberra until 7:00 p.m. Hence, she did not have to pick him up or wait for him to\nhave dinner."
      },
      {
        "paragraph": "However, on the morning of the third day, she was developing a new product in the laboratory when a\nlady from the entertainment circle whom she met at a banquet sent her a picture. [I just came back"
      },
      {
        "paragraph": "from overseas and saw Young Master Snow as soon as I arrived at the airport. Hehe.]"
      },
      {
        "paragraph": "Freya opened the photo. Although it was a little far, she could tell that the figures were Rodney and his\nsecretary, Hans. The two suitcases that Hans was carrying were the same as when they left."
      },
      {
        "paragraph": "However, Rodney said that he would only come back at night. Why was he back at 11 a.m.?"
      },
      {
        "paragraph": "Being lied to did not feel good."
      },
      {
        "paragraph": "She comforted herself by saying that maybe Rodney had an emergency."
      },
      {
        "paragraph": "Rodney had such long-lasting feelings for Sarah, which showed that he was not a person who would\neasily change his mind. Furthermore, the marital relationships in the Snow family were quite good."
      },
      {
        "paragraph": "She thought about it before calling Rodney and asking casually, “What are you doing?”"
      },
      {
        "paragraph": "“I’m still inspecting the factory here in Cairns.” Rodney then joked. “Miss me?”"
      },
      {
        "paragraph": "“Don’t worry. I’ll be back tonight. Wait for me.”"
      },
      {
        "paragraph": "“Okay.”"
      },
      {
        "paragraph": "Freya hung up the phone and looked at the photo on her phone again. Her heart went numb."
      }
    ]
  }
]